{
    "url": "https://insidehmcts.blog.gov.uk/2025/03/20/the-state-of-play-in-our-criminal-courts-challenges-and-current-actions-part-1/",
    "title": "The State of Play In Our Criminal Courts: Challenges and Current Actions (Part 1) ",
    "authors": [
        "Daniel Flury, Operations Director"
    ],
    "categories": [
        "Court and tribunal reform",
        "General",
        "User experience and research"
    ],
    "pub_date": "2025-03-20T13:00:00+00:00",
    "content": [
        {
            "text": "[English] - [Cymraeg]"
        },
        {
            "text": "As we enter a new financial year, I wanted to share how HMCTS is responding to the current major challenges in the criminal courts, as well as preparing for the significant changes and opportunities that lie ahead. "
        },
        {
            "heading": 2,
            "text": "The scale of our challenge "
        },
        {
            "text": "I’ll start with an overview of the scale of the HMCTS operation. Our courts and tribunals handle millions of cases each year, ranging from road traffic offences to the most serious criminal trials. In 2023-2024, our criminal courts received over 1.4 million cases. We disposed (dealt with and closed) approximately the same number of cases during this time. These disposals are huge numbers and testament to the monumental role of frontline court staff, judges, advocates, solicitors and all of those who work in the criminal justice system. However, despite these efforts, caseloads in both the magistrates’ and Crown Court continue to grow.  "
        },
        {
            "text": "In the first three quarters of 2024 we'd received almost the same number of cases received in the whole of 2022. There are several reasons for this, but the end result is that despite the efforts of everyone working in the criminal courts, the Crown Court outstanding caseload (sometimes known as \"the backlog\") currently stands at over 73,000 cases. In the magistrates courts it is over 330,00 cases. While there will always be a significant number of cases awaiting trial or hearing, this number is far higher than any of us would want it to be. We know that the delays this causes are not acceptable and each case affects people, whether they're victims, witnesses, defendants or communities. "
        },
        {
            "text": "HMCTS is one of a number of partners in the criminal justice system and I want to assure you we're taking action to administer justice as promptly and effectively as possible for everyone who needs it. "
        },
        {
            "heading": 2,
            "text": "Current policy initiatives "
        },
        {
            "text": "At the end of 2024 the government announced measures to help address these challenges. Magistrates' sentencing powers were doubled in October, enabling them to hand down custodial sentences of up to 12 months for single offences. This change will help divert approximately 2,000 cases away from the Crown Court each year to ease pressure on the system. "
        },
        {
            "text": "Building on this, earlier this month, the Lord Chancellor announced that Crown Court sitting days have been increased to 110,000 for the next financial year – 4,000 more than was initially allocated the previous year. These additional sitting days will help more trials go ahead this year and speed up justice. "
        },
        {
            "text": "The Lord Chancellor has also appointed Sir Brian Leveson to lead a once-in-a-generation review of our criminal courts. With the first part expected to report in the spring, this review will explore a range of innovative solutions and initiatives to maximise efficiencies and effectiveness. "
        },
        {
            "heading": 2,
            "text": "Investing in our estate "
        },
        {
            "text": "I know how building issues can affect the productivity of a criminal court, so I'm pleased to share the significant progress we're making in improving our court buildings. Last year, we put £116 million into maintaining, renovating and renewing our courts and tribunals, plus another £38 million on new properties and lease renewals. We're already seeing the results of this investment: since January this year, we’ve opened new Crown Court rooms in Redditch Magistrates' Court and Hereford Justice Centre, providing additional capacity for the local areas. In London, we've found a creative solution at Southwark Crown Court, turning unused space into a new jury trial courtroom for bail cases.  "
        },
        {
            "text": "Looking ahead, funding allocated to estates for the financial year 25/26 amounts to £148.5m. This will allow us to drive forward key projects like the City of London Law courts, as well as undertake essential maintenance to roofs, lifts, heating, and ventilation and improving fire safety and security. I'm particularly proud that we've kept disruption to an absolute minimum – less than 0.1% of available sitting days were lost to maintenance work in the year to October 2024. We're careful to direct our funding where it's needed most, keeping our buildings safe and operational for everyone who uses them. This work continues, and – for example – while we'll need to replace the roof at Oxford Magistrates' Court this summer, we'll make sure local people can still access justice by moving hearings to nearby courts.  "
        },
        {
            "text": "The challenges we face cannot be solved by HMCTS alone, but through innovation, collaboration, and dedication, we're building a stronger, more efficient criminal courts system. In my next blog, I'll share our vision for 2025 and beyond, including our technological innovations and collaborative approaches that will shape the future of our justice system. "
        },
        {
            "text": "[English] - [Cymraeg]"
        },
        {
            "heading": 2,
            "text": "Y sefyllfa yn ein Llysoedd Troseddol: Heriau a Chamau Gweithredu Cyfredol (Rhan 1)"
        },
        {
            "text": "Wrth i ni ddechrau blwyddyn ariannol newydd, roeddwn i eisiau rhannu sut mae GLlTEF yn ymateb i'r heriau mawr presennol yn y llysoedd troseddol, yn ogystal â pharatoi ar gyfer y newidiadau a'r cyfleoedd sylweddol sydd o'n blaenau."
        },
        {
            "heading": 2,
            "text": "Graddfa ein her"
        },
        {
            "text": "Mi ddechreuaf gyda throsolwg o raddfa gwaith GLlTEF. Mae ein llysoedd a'n tribiwnlysoedd yn delio â miliynau o achosion bob blwyddyn, yn amrywio o droseddau traffig ffyrdd i'r treialon troseddol mwyaf difrifol."
        },
        {
            "text": "Yn 2023-2024, cafodd ein llysoedd troseddol dros 1.4 miliwn o achosion. Bu inni benderfynu (delio a chau) ag oddeutu yr un nifer o achosion yn ystod y cyfnod hwn."
        },
        {
            "text": "Mae'r ffigurau hyn yn enfawr ac yn dyst i rôl sylweddol staff rheng flaen y llysoedd, barnwyr, eiriolwyr, cyfreithwyr a phawb sy'n gweithio yn y system gyfiawnder troseddol."
        },
        {
            "text": "Fodd bynnag, er gwaethaf yr ymdrechion hyn, mae llwythi achosion yn y llys ynadon a’r Llys y Goron yn parhau i dyfu."
        },
        {
            "text": "Yn nhri chwarter cyntaf 2024 roeddem bron wedi cael yr un nifer o achosion a gafwyd drwy gydol 2022. Mae yna nifer o resymau am hyn, ond y canlyniad terfynol yw, er gwaethaf ymdrechion pawb sy'n gweithio yn y llysoedd troseddol, mae llwyth achosion sy'n weddill Llys y Goron (a elwir weithiau yn \"ôl-groniad\") ar hyn o bryd yn fwy na 73,000 o achosion. Yn y llys ynadon mae dros 330,00 o achosion. Er bydd nifer sylweddol o achosion bob amser yn aros am dreial neu wrandawiad, mae'r rhif hwn yn llawer uwch nag y byddai unrhyw un ohonom eisiau iddo fod. Rydym yn gwybod nad yw'r oedi y mae hyn yn ei achosi yn dderbyniol ac mae pob achos yn effeithio ar bobl, p'un a ydynt yn ddioddefwyr, tystion, diffynyddion neu gymunedau."
        },
        {
            "text": "Mae GLlTEF yn un o nifer o bartneriaid yn y system gyfiawnder troseddol ac rwyf eisiau eich sicrhau ein bod ni’n cymryd camau i weinyddu cyfiawnder mor gyflym ac effeithiol â phosibl i bawb sydd ei angen."
        },
        {
            "heading": 2,
            "text": "Mentrau polisi cyfredol"
        },
        {
            "text": "Ar ddiwedd 2024 cyhoeddodd y llywodraeth fesurau i helpu i fynd i'r afael â'r heriau hyn. Dyblwyd pwerau dedfrydu ynadon ym mis Hydref, gan eu galluogi i roi dedfrydau o garchar o hyd at 12 mis am droseddau unigol. Bydd y newid hwn yn helpu i gyfeirio tua 2,000 o achosion i ffwrdd o Lys y Goron bob blwyddyn er mwyn lleihau'r pwysau ar y system."
        },
        {
            "text": "Gan adeiladu ar hyn, yn gynharach y mis hwn, cyhoeddodd yr Arglwydd Ganghellor fod dyddiau eistedd Llys y Goron wedi cael eu cynyddu i 110,000 y flwyddyn ariannol nesaf - 4,000 yn fwy nag a ddyrannwyd yn wreiddiol y flwyddyn flaenorol. Bydd y diwrnodau eistedd ychwanegol hyn yn helpu mwy o dreialon i fynd ymlaen eleni ac yn cyflymu cyfiawnder."
        },
        {
            "text": "Mae'r Arglwydd Ganghellor hefyd wedi penodi Syr Brian Leveson i arwain adolygiad unwaith mewn cenhedlaeth o'n llysoedd troseddol. Disgwylir cyhoeddiad ar yr adran gyntaf yn y gwanwyn, a bydd yr adolygiad hwn yn archwilio ystod o ddatrysiadau a mentrau arloesol i sicrhau'r effeithlonrwydd a'r effeithiolrwydd mwyaf posibl."
        },
        {
            "heading": 2,
            "text": "Buddsoddi yn ein hystad"
        },
        {
            "text": "Rwy'n gwybod sut y gall materion gydag adeiladau effeithio ar gynhyrchiant llys troseddol, ac felly rwy'n falch o rannu gwybodaeth am y cynnydd sylweddol rydym yn ei wneud o ran gwella ein hadeiladau llys. Y llynedd, mi wnaethom wario £116 miliwn ar gynnal, adnewyddu a diweddaru ein llysoedd a'n tribiwnlysoedd, ynghyd â £38 miliwn arall ar eiddo newydd ac adnewyddu prydlesi. Rydym eisoes yn gweld canlyniadau'r buddsoddiad hwn: ers mis Ionawr eleni, rydym wedi agor ystafelloedd Llys y Goron newydd yn Llys Ynadon Redditch a Chanolfan Gyfiawnder Henffordd, gan ddarparu capasiti ychwanegol ar gyfer yr ardaloedd lleol. Yn Llundain, rydym wedi dod o hyd i ateb creadigol yn Llys y Goron Southwark, gan droi gofod nas defnyddiwyd i mewn i ystafell llys newydd ar gyfer treialon rheithgor yn ymwneud ag achosion mechnïaeth."
        },
        {
            "text": "Wrth edrych tua'r dyfodol, y cyllid a ddyrannwyd i ystadau ar gyfer y flwyddyn ariannol 25/26 yw £148.5 miliwn. Bydd hyn yn ein galluogi i ddatblygu prosiectau allweddol fel Llysoedd Barn Dinas Llundain, yn ogystal â gwneud gwaith cynnal a chadw hanfodol i doeau, lifftiau, systemau gwresogi ac awyru a gwella diogelwch tân. Rwy'n hynod falch nad yw hyn wedi tarfu llawer ar waith y llysoedd - collwyd llai na 0.1% o'r diwrnodau eistedd o ganlyniad i waith cynnal a chadw yn y flwyddyn hyd at fis Hydref 2024. Rydym yn ofalus i ddefnyddio ein cyllid lle mae ei angen fwyaf, gan gadw ein hadeiladau'n ddiogel ac yn weithredol i bawb sy'n eu defnyddio. Mae'r gwaith hwn yn parhau, ac - er enghraifft - er bydd angen i ni osod to newydd ar Lys Ynadon Rhydychen yr haf hwn, byddwn yn sicrhau y gall pobl leol barhau i gael mynediad at gyfiawnder trwy symud gwrandawiadau i lysoedd cyfagos."
        },
        {
            "text": "Ni all GLlTEF ddatrys yr heriau sy'n ein hwynebu ar ei ben ei hun, ond trwy arloesi, cydweithredu ac ymrwymiad, rydym yn adeiladu system llysoedd troseddol cryfach, fwy effeithlon. Yn fy mlog nesaf, byddaf yn rhannu ein gweledigaeth ar gyfer 2025 a thu hwnt, gan gynnwys ein datblygiadau technolegol arloesol a'n dulliau cydweithredol a fydd yn llywio dyfodol ein system gyfiawnder."
        }
    ]
}