{
    "url": "https://digitalpeople.blog.gov.uk/2025/03/20/updating-the-product-manager-role-and-skills-on-the-government-digital-and-data-capability-framework/",
    "title": "Updating the product manager role and skills on the Government Digital and Data Capability Framework",
    "authors": [
        "Debbie Blanchard, Head of Profession for Product Management, Department for Education",
        "Olivia Helliwell, Senior Content Designer, CDDO"
    ],
    "categories": [
        "Capability Framework",
        "Product Management"
    ],
    "pub_date": "2025-03-20T09:50:58+00:00",
    "content": [
        {
            "heading": 3,
            "text": "Introduction"
        },
        {
            "text": "I’m Debbie Blanchard, the Head of Profession for Product at the Department for Education (DfE). The Government Digital and Data Capability Framework defines digital and data roles in government and the skills expected at different role levels. Since its launch in 2017, many of the digital and data roles listed in the framework have largely stayed the same. "
        },
        {
            "text": "Product managers in government work on world class, critical products used by millions of people every day, so it’s vital that the Framework reflects the skills they need. As Head of Profession for Product it felt timely when I joined DfE in April 2024 to review the product manager role. To support this, I’ve been working with Olivia Helliwell, from Government Digital Service (GDS), who leads content for the Framework."
        },
        {
            "heading": 3,
            "text": "Getting started "
        },
        {
            "text": "In Spring 2024 we brought together a broad selection of product leaders from 16 different departments across government to share thinking, expertise and review product manager skills on the framework, agreeing on what needed to be updated, what was no longer needed, and where the gaps were. "
        },
        {
            "heading": 3,
            "text": "Keeping going "
        },
        {
            "text": "Following that meeting, a working group was officially formed. This group met regularly to review and update existing skills, draft new ones, and to consider the levelling of skills to roles. "
        },
        {
            "text": "The working group was made up of colleagues from the Department for Work and Pensions, Ministry of Justice, Department for Business and Trade, HM Revenue and Customs, Homes England, Government Legal Department and NHS England."
        },
        {
            "text": "We have been supported throughout by Olivia, who has also been working with Jon Forman, Head of the Digital Function, Professions, Skills and Communications at Ministry of Defence, and other subject matter experts to redevelop the service owner role. This provided an exciting opportunity to collaborate and address the significant overlap and challenge in differentiating these roles."
        },
        {
            "text": "After many months of hard work, with some tricky problem solving but a good amount of laughter along the way, we now have a revised set of skills for product managers at each level in government. These skills are much more representative of the work that we do and that they better recognise the skills that we require."
        },
        {
            "heading": 3,
            "text": "Making sure they work "
        },
        {
            "text": "We tested  the proposed changes and got feedback from subject matter experts and other stakeholders. This was particularly important for skills that were shared with other roles, where we needed to ensure that the proposed changes worked for everyone.."
        },
        {
            "text": "Olivia led a cross-government fact-check to get large-scale feedback that we used to iterate the skills facilitated by capability leads across government through the Capability Framework Design Council."
        },
        {
            "text": "Through agreement, the skills for product manager will be:  "
        },
        {
            "text": "Some of these are brand new skills, to better reflect the work that product managers do. Some of these are iterations of existing skills, for example, life cycle perspective became life cycle management to make it more active. "
        },
        {
            "text": "The new content went live as part of the regular quarterly updates to the framework in February 2025."
        },
        {
            "heading": 3,
            "text": "What’s next "
        },
        {
            "text": "Doing this work has made us think about what else we need to do to keep the new role description, role level descriptions and skills relevant for product managers. Continuing to work with the framework team, and joining up with their associated learning team, we have translated these new skills into the FutureLearn Introduction to Product Management course. We’re pulling together a working level course too.  "
        },
        {
            "text": "The one thing we’re sure of is that we need to treat this like everything else we do and make sure we get feedback and iterate. If you have any feedback on the changes, please get in touch with debbie.blanchard@education.gov.uk or olivia.helliwell@digital.cabinet-office.gov.uk.  "
        },
        {
            "text": "The Capability Framework works with communities across government to ensure it is up to date and reflects government needs. We encourage you to propose a change to the framework or contact digitaldatacapabilityframework@digital.cabinet-office.gov.uk to find out more."
        },
        {
            "heading": 3,
            "text": "Thank you"
        },
        {
            "text": "Thanks to all those who supported me on the working group for the review:  "
        }
    ]
}