{
    "url": "https://insidehmcts.blog.gov.uk/2023/12/03/celebrating-inclusivity-deaf-jurors-in-our-courts/",
    "title": "Celebrating inclusivity: Deaf jurors in our courts",
    "authors": [
        "Sian Wharton-Goodman, Senior Communications Manager"
    ],
    "categories": [
        "Court and tribunal reform",
        "Crime",
        "Interviews"
    ],
    "pub_date": "2023-12-03T11:00:12+00:00",
    "content": [
        {
            "text": "Legislative changes to the Police, Crime, Sentencing and Courts Act now allow British Sign Language (BSL) interpreters to enter the jury deliberation room as a thirteenth person. This change makes it possible for many adults in our society who rely on BSL interpreters to fulfil their civic duty and serve on a jury."
        },
        {
            "text": "We’re committed to ensuring that our courts are accessible and inclusive. In July 2022, Karen made history at Croydon Crown Court when she became the first deaf juror to be supported by BSL interpreters in the deliberation room. "
        },
        {
            "text": "To mark International Day of Persons with Disabilities on Sunday 3 December 2023, we caught up with Karen, and Jury Manager, Toby, who has also welcomed a deaf juror to serve at Leicester Crown Court. "
        },
        {
            "text": "We invited Karen and Toby to share their insights and reflect on the progress made towards a more inclusive justice system. "
        },
        {
            "text": "Karen, thank you for taking the time to share your experiences with us. Can you start by telling us how you felt when you first received your jury summons? "
        },
        {
            "text": "\"At first, I was surprised, as I never thought I would receive a jury summons. But as I thought about it more, I realised it could be an interesting experience.\"\n"
        },
        {
            "text": "How did the court staff help you prepare to attend court? "
        },
        {
            "text": "\"Maria, the Jury Team Leader at Croydon Crown Court, was brilliant and played a crucial role in ensuring I was well-prepared. She invited me to the court, along with an interpreter, to introduce me to the courtroom and the jury deliberation room. This visit allowed me to provide feedback which was really valuable to me and helped me feel reassured that my needs would be taken in to account.\" "
        },
        {
            "text": "How did the court staff help you understand what you needed to do as a juror? "
        },
        {
            "text": "\"They explained where I would be sitting, what would happen during the trial, and one of the judges even took the time to meet me and discuss where the interpreter would stand. I also had the opportunity to observe a trial, which gave me a better understanding of how things worked.\""
        },
        {
            "text": "Were there any adjustments made so you could fully participate in the trial process? "
        },
        {
            "text": "\"The court staff made several adjustments, including the layout of the jury deliberation room to ensure I could see everyone, including the interpreters. They introduced me to the other jurors on the first day and provided them with information on working with interpreters. "
        },
        {
            "text": "\"I was pleased to see that this information was printed out as posters in various places within the court. Court staff also took time to explain to me what would happen during the jury deliberations and what we needed to do as jurors.\"\n"
        },
        {
            "text": "You also served as the jury foreperson. Can you tell us about that? "
        },
        {
            "text": "\"It was an experience that made me feel heard and equal to my fellow hearing jurors. Of course, it was nerve-wracking to stand up and deliver the verdict, but looking back, the whole thing was an experience of a lifetime.\""
        },
        {
            "text": "If you were to serve as a juror again, is there anything you would do differently or any improvements you'd like to see from HMCTS? "
        },
        {
            "text": "\"Honestly, no. My input was considered, and everything went well. Everything went smoothly, and the 3 interpreters I worked with also mentioned how seamless it was, considering it was the first time for a Deaf juror using interpreters in the deliberation room.\"\n"
        },
        {
            "text": "What would you say to other people with deafness who have received a jury summons? "
        },
        {
            "text": "\"Go for it! Deaf people now have an equal opportunity with hearing people to serve on a jury after many years of not being able to.\"\n"
        },
        {
            "text": "And Toby, as Jury Manager at Leicester Crown Court, what have your experiences been when a deaf person has served on a jury in your court?  "
        },
        {
            "text": "\"It was quite interesting going into court to observe it in action, and it felt like a well-oiled machine. The court room didn’t feel any different to normal and certainly watching the interpreters moving around seamlessly and quietly without disturbing or interrupting the flow of the witness giving evidence was impressive. "
        },
        {
            "text": "\"Apart from the additions of the interpreters being in court, we tried to keep the experience as normal as possible for the juror. We’re really proud that the trial went as well as we could have hoped for. \""
        },
        {
            "text": "Since Karen's historic moment, HMCTS has welcomed over 40 more Deaf jurors to participate in jury panels, demonstrating our ongoing commitment to accessibility. We look forward to Deaf jurors continuing to play a vital role in our Crown courts, bringing diverse perspectives and truly representing the communities we serve.  "
        }
    ]
}