{
    "url": "https://defradigital.blog.gov.uk/2023/12/03/how-i-balance-office-working-alongside-a-chronic-condition/",
    "title": "How I balance office working alongside a chronic condition",
    "authors": [
        "Wendy Marsden"
    ],
    "categories": [
        "Defra digital"
    ],
    "pub_date": "2023-12-03T07:30:16+00:00",
    "content": [
        {
            "text": "On the International Day for Persons with Disabilities, Wendy Marsden shares her experiences of using her mobility scooter in the workplace, and the difference it has made to her level of work fulfilment by enabling her to interact, face to face, with her colleagues."
        },
        {
            "text": "Hi, my name is Wendy, I’ve worked in Defra for around 18 months. I want to share my experience of balancing a chronic condition alongside working in the office, and the things I and my employer do to make this happen."
        },
        {
            "text": "I have, among other things, Rheumatoid Arthritis (RA), which affects mainly my joints, as well as causing chronic fatigue, and which can affect other areas of the body too, such as my lungs. I also have a chronic pain syndrome, endometriosis and trigeminal neuralgia."
        },
        {
            "text": "These conditions have led, at times, to me being unable to work from the office. However, I do enjoy working from there and building relationships with my colleagues. It’s therefore been important for me to try and find ways to strike a sensible and attainable balance between my home and office working."
        },
        {
            "heading": 2,
            "text": "Workplace adjustments are more than just work enablers"
        },
        {
            "text": "I originally had a ‘reasonable adjustment’ to allow me to work at home. Reasonable adjustments are changes which an employer makes to remove or reduce a disadvantage related to someone's disability. For example: making changes to the workplace or changing someone's working arrangements."
        },
        {
            "text": "After six months though, I was more than ready to get into the office and start meeting people! I began going into the office, in Leeds, in November, just for two days a week. I’ve found that this has been mainly a seamless operation."
        },
        {
            "text": "I use a small mobility scooter to go in and out of the office, as well as to move around the office. My scooter has a hoist, and this allows me to get it in and out of the car without any issues. I have a car parking space, which is reserved for me to use, and with the lift taking me from the underground car park up to the office, it’s simple."
        },
        {
            "heading": 2,
            "text": "It’s not just about getting to the office though – I still need to move around once I’m there"
        },
        {
            "text": "I use my scooter to get to and from my desk, and around the office. This makes a huge difference to my ability to get around. The nature of my illness may mean I can walk a short distance, but that is not something I can sustain. Therefore, not only does the scooter conserve my energy, but it also means I can minimise the pain I suffer daily."
        },
        {
            "text": "I do have a network of colleagues who all happily help me by making hot drinks and carrying them for me. That is one thing I have found a challenge when either scooting or walking with my crutch. If anyone could invent some sort of gravity-defying accessory, then that would be greatly appreciated!"
        },
        {
            "text": "My manager is very understanding, and realises that there may be times when I am unable to attend the office, due to the pain i suffer. He effectively leaves me to decide, for myself, on a daily basis, if I can attend."
        },
        {
            "text": "This flexibility also applies, for example, if there is an influx of colds and flu around the office. Due to the medication which I take for my conditions, I am classed as severely immune supressed. This not only makes me more vulnerable to illnesses, but it also has the effect of making it more difficult to fight illness off. The last thing I want to do is expose myself to illness. This does of course reinforce the message that if you aren’t well enough to attend the office, please don’t, as you never know who you are exposing to your illness."
        },
        {
            "text": "I recognise that all of these things have contributed to me being able to maintain going to the office as well as I can, and without any undue pressure. Stress also makes a difference to how my body reacts, and stress alone can cause a flare up, one of the many wonders in how my body can react to RA on a daily basis. Minimising stress, therefore, has also been a real work enabler for me."
        },
        {
            "text": "These may seem like small adaptations, but overall they make my challenges easier to deal with, my pain easier to manage and my working life easier to cope with."
        }
    ]
}