{
    "url": "https://valuationoffice.blog.gov.uk/2025/03/19/how-we-value-properties-for-business-rates-the-rental-comparison-method/",
    "title": "How we value properties for business rates: the rental comparison method",
    "authors": [
        "Alan Colston - Chief Valuer and Head of Surveying Profession"
    ],
    "categories": [
        "Business Rates",
        "How We Value",
        "Valuation Methods"
    ],
    "pub_date": "2025-03-19T14:30:42+00:00",
    "content": [
        {
            "text": "[English] - [Cymraeg]"
        },
        {
            "text": "If you're a business owner, understanding how your property's business rates are calculated is important for your bottom line. At the Valuation Office Agency (VOA), we're responsible for valuing and providing a rateable value for all non-domestic properties in England and Wales."
        },
        {
            "text": "To do this, our surveyors use three main valuation methods approved by the Royal Institution of Chartered Surveyors (RICS), tailored to each property type. Since properties are used in many different ways, a one-size-fits-all approach wouldn't be suitable."
        },
        {
            "text": "Let’s explore the most common method we use."
        },
        {
            "heading": 2,
            "text": "What is the rental comparison method?"
        },
        {
            "text": "For most business properties, we use the rental comparison method. Put simply, we look at how much rent your property could achieve on the open market at a specific date - this gives us your property's rateable value, which is then used to calculate your business rates."
        },
        {
            "text": "Let’s break this down. A property’s ‘open market rent’ is the rent a property could reasonably achieve if leased to a new tenant. This isn't necessarily the same as the current rent being paid, though that can be a useful starting point."
        },
        {
            "text": "To ensure fairness, we base all valuations on rents at a specific date, known as the Antecedent Valuation Date (AVD). For current rateable values, the AVD is 1 April 2021. This date is set by law and means everyone's property is valued based on market conditions at the same time."
        },
        {
            "heading": 2,
            "text": "When is the rental comparison method used?"
        },
        {
            "text": "We use this method when good rental information is available for the property itself or similar ones. For example, we use it to value:"
        },
        {
            "text": "These properties are often rented on the open market, giving us plenty of rental evidence to analyse."
        },
        {
            "heading": 2,
            "text": "What evidence do we consider?"
        },
        {
            "text": "We usually start by looking at rents agreed around the AVD. However, this doesn’t always tell us the full story, so we also consider:"
        },
        {
            "text": "Since the actual rent paid might not accurately reflect the property's value at a specific time, we also look at what similar nearby properties are renting for. We use standard measurements called 'units of comparison' to compare properties accurately and fairly."
        },
        {
            "heading": 2,
            "text": "Comparing similar properties"
        },
        {
            "text": "For shops, offices and restaurants"
        },
        {
            "text": "For these properties, we use the 'net internal area' - the actual space you can use to run your business including sales floor, storage areas, desk space and customer areas. We don't include spaces like staff toilets and cleaning cupboards."
        },
        {
            "text": "We use the net internal area because a potential tenant primarily cares about how much usable space they're getting for their money."
        },
        {
            "text": "For offices and restaurants, if similar properties in your area rent for about £250 per square metre, and yours has 100 square metres of net internal area, we'd estimate its annual rental value at around £25,000."
        },
        {
            "text": "For most shops, we take an extra step because the shape matters. A shop where most space is near the front window is more valuable than a long, narrow shop where much of the space is hidden at the back, even if both have the same total area."
        },
        {
            "text": "We therefore value the front area of a shop (closest to the entrance and display windows) at a higher rate than the areas further back. This reflects the reality of this type of retail outlet, where space that customers see first is more valuable for displaying and selling products. This is known as Zoning, more information about this can be found in our YouTube video."
        },
        {
            "text": "For larger shops like superstores and department stores we continue using the net internal area."
        },
        {
            "text": "For factories and warehouses"
        },
        {
            "text": "For industrial properties, we use 'gross internal area', which includes nearly everything under the roof, excluding only external spaces like loading bays."
        },
        {
            "text": "In industrial settings, almost all internal space has potential value as layouts can be rearranged based on production needs. For example, if local factories typically rent for £60 per square metre, and your factory has a gross internal area of 1,000 square metres, we'd estimate its annual rental value at £60,000."
        },
        {
            "text": "We analyse rental evidence from various industrial properties - considering factors like size, age, location and specification - to ensure we apply appropriate rates to your property."
        },
        {
            "text": "You can learn more about net internal area and gross internal area in our YouTube video."
        },
        {
            "text": "For pubs "
        },
        {
            "text": "For pubs and some hospitality venues, we use a different approach based on trade evidence. We look at the property's earning potential – what we call Fair Maintainable Trade (FMT). This measures what a reasonably efficient operator could expect to earn, rather than actual trade figures."
        },
        {
            "text": "We use FMT because the level of trade could be deceptive. For example, a celebrity-run pub might earn more than one run by a local operator, but we're valuing the property itself, not the business. We therefore base our valuation on what a reasonably efficient operator could earn. The rateable value is then calculated by taking a percentage of this FMT."
        },
        {
            "heading": 2,
            "text": "How can I find out more? "
        },
        {
            "text": "You can sign up for a business rates valuation account to find out more about how your rateable value has been calculated."
        },
        {
            "text": "Our ‘how we value’ blogs discuss how we use the rental comparison method to value properties like shops, pubs and more."
        },
        {
            "text": "Further information on the rental comparison method of valuation can be found in the VOA Rating Manual Rating Manual section 4: valuation methods - Part 1: R2017 rental evidence and valuation issues - Guidance - GOV.UK."
        },
        {
            "text": "[English] - [Cymraeg]"
        },
        {
            "heading": 2,
            "text": "Sut fyddwn yn prisio eiddo ar gyfer ardrethi busnes: y dull rhent cymharol"
        },
        {
            "text": "Fel perchennog busnes, mae deall sut mae ardrethi busnes eich eiddo yn cael eu cyfrifo’n bwysig wrth geisio asesu eich costau sylfaenol. Yn Asiantaeth y Swyddfa Brisio (VOA) yr ydym yn gyfrifol am brisio a darparu gwerth ardrethol i bob eiddo annomestig yng Nghymru a Lloegr."
        },
        {
            "text": "Er mwyn gwneud hyn fe fydd ein syrfewyr yn defnyddio tri dull o brisio, y tri wedi eu cymeradwyo gan Sefydliad Brenhinol y Syrfewyr Siartredig (RICS), a pob un wedi ei deilwra i’r math o eiddo sy’n cael ei brisio. Gan fod eiddo yn cael ei ddefnyddio mewn cymaint o wahanol ffyrdd, ni fyddai un dull yn addas ar gyfer pob eiddo."
        },
        {
            "text": "Gadewch inni archwilio ein dull mwyaf cyffredin"
        },
        {
            "text": "Beth yw’r dull rhent cymharol?"
        },
        {
            "text": "Yn achos y rhan fwyaf o eiddo busnes byddwn yn defnyddio’r dull rhent cymharol. Yn syml, byddwn yn canfod pa rhent y byddai eich eiddo yn ei sylweddoli ar y farchnad agored ar ddyddiad penodol – dyma sy’n rhoi gwerth ardrethol eich eiddo inni, ac yn ei dro, dyma sy’n cael ei ddefnyddio i gyfrifo eich ardrethi busnes."
        },
        {
            "text": "Gadewch inni geisio symleiddio hyn. Rhent ar y farchnad agored yw’r hyn y byddai eiddo yn resymol yn medru ei sylweddoli o’i lesio i denant newydd. Nid yw hyn o reidrwydd yn gyfystyr a’r rhent sy’n cael ei dalu ar hyn o bryd, er gall hwn fod yn fan cychwyn defnyddiol."
        },
        {
            "text": "Er mwyn diogelu tegwch, byddwn yn defnyddio dyddiad penodol ar gyfer prisio rhent, a byddwn yn galw’r dyddiad yma yn ‘ddyddiad prisio rhagflaenol’ (AVD). I bwrpas y gwerth ardrethol cyfredol, y 1af o Ebrill 2021 yw’r AVD. Mae’r dyddiad yn cael ei benderfynu a’i osod mewn deddfwriaeth, ac mae hyn yn golygu fod gwerth eiddo pawb yn cael ei bennu ar gyflwr y farchnad ar yr un dyddiad."
        },
        {
            "text": "Pryd fydd y dull rhent cymharol yn cael ei ddefnyddio?"
        },
        {
            "text": "Rydym yn defnyddio'r dull hwn pan fydd gwybodaeth rhent da ar gael ar gyfer yr eiddo ei hun neu rai tebyg. Er enghraifft, rydym yn ei ddefnyddio i brisio:"
        },
        {
            "text": "Mae'r eiddo hyn yn aml yn cael eu rhentu ar y farchnad agored, gan roi digon o dystiolaeth rhent i ni ei dadansoddi."
        },
        {
            "text": "Pa dystiolaeth fyddwn ni'n ei hystyried?"
        },
        {
            "text": "Rydym fel arfer yn dechrau drwy edrych ar renti y cytunwyd arnynt o amgylch y AVD. Fodd bynnag, nid yw hyn bob amser yn dweud y stori lawn wrthym, felly rydym hefyd yn ystyried:"
        },
        {
            "text": "Gan na fydd yr union rent a delir yn adlewyrchu gwerth yr eiddo yn gywir ar adeg benodol, rydym hefyd yn edrych ar faint o rent mae eiddo cyfagos yn sylweddoli. Rydym yn defnyddio mesuriadau safonol o'r enw 'unedau cymharu' i gymharu eiddo'n gywir ac yn deg."
        },
        {
            "text": "Cymharu eiddo tebyg"
        },
        {
            "text": "Ar gyfer siopau, swyddfeydd a bwytai"
        },
        {
            "text": "Ar gyfer yr eiddo hyn, rydym yn defnyddio'r 'ardal fewnol net' - y gofod gwirioneddol y gallwch ei ddefnyddio i redeg eich busnes gan gynnwys llawr gwerthu, mannau storio, gofod desg ac ardaloedd cwsmeriaid. Nid ydym yn cynnwys lleoedd fel toiledau staff a chypyrddau glanhau."
        },
        {
            "text": "Rydym yn defnyddio'r ardal fewnol net oherwydd bod darpar denant yn poeni'n bennaf am faint o le y gellir ei ddefnyddio am ei arian."
        },
        {
            "text": "Ar gyfer swyddfeydd a bwytai, os yw eiddo tebyg yn eich ardal yn rhentu am oddeutu £250 y metr sgwâr, ac mae gan eich un chi 100 metr sgwâr o arwynebedd mewnol net, byddem yn amcangyfrif ei werth rhent blynyddol oddeutu £25,000."
        },
        {
            "text": "Ar gyfer y rhan fwyaf o siopau, rydym yn cymryd cam ychwanegol oherwydd bod y siâp yn bwysig. Mae siop lle mae'r rhan fwyaf o le ger y ffenestr flaen yn fwy gwerthfawr na siop hir, gul lle mae llawer o'r gofod wedi'i guddio yn y cefn, hyd yn oed os oes gan y ddau yr un ardal gyfan."
        },
        {
            "text": "Rydym felly yn prisio ardal flaen siop (agosaf at y fynedfa a'r ffenestri arddangos) ar gyfradd uwch na'r ardaloedd ymhellach yn ôl. Mae hyn yn adlewyrchu realiti'r math hwn o allfa fanwerthu, lle mae gofod y mae cwsmeriaid yn ei weld gyntaf yn fwy gwerthfawr ar gyfer arddangos a gwerthu cynhyrchion. Mae hyn yn cael ei adnabod fel Parthu neu ‘Zoning’, a gellir dod o hyd i fwy o wybodaeth am hyn drwy wylio ein fideo YouTube."
        },
        {
            "text": "Ar gyfer siopau mwy fel archfarchnadoedd a siopau adrannol rydym yn parhau i ddefnyddio'r ardal fewnol net."
        },
        {
            "text": "Ar gyfer ffatrïoedd a warysau"
        },
        {
            "text": "Ar gyfer eiddo diwydiannol, rydym yn defnyddio 'ardal fewnol gros', sy'n cynnwys bron popeth o dan y to, ac eithrio dim ond mannau allanol fel baeau llwytho."
        },
        {
            "text": "Mewn lleoliadau diwydiannol, mae gan bron pob gofod mewnol werth posibl gan y gellir aildrefnu cynlluniau yn seiliedig ar anghenion cynhyrchu. Er enghraifft, os yw ffatrïoedd lleol fel arfer yn rhentu am £60 y metr sgwâr, ac mae gan eich ffatri arwynebedd mewnol gros o 1,000 metr sgwâr, byddem yn amcangyfrif fod y gwerth rhent blynyddol yn £60,000."
        },
        {
            "text": "Rydym yn dadansoddi tystiolaeth rhent o amrywiol eiddo diwydiannol - gan ystyried ffactorau fel maint, oedran, lleoliad a manylion - i sicrhau ein bod yn cymhwyso cyfraddau priodol i'ch eiddo."
        },
        {
            "text": "Gallwch ddysgu mwy am ardal fewnol net ac ardal fewnol gros drwy wylio ein fideo YouTube."
        },
        {
            "text": "Ar gyfer tafarndai "
        },
        {
            "text": "Ar gyfer tafarndai a rhai lleoliadau lletygarwch, rydym yn defnyddio dull gwahanol yn seiliedig ar dystiolaeth masnach. Rydym yn edrych ar botensial enillion yr eiddo – yr hyn yr ydym yn ei alw'n Masnach Gynaliadwy Deg (FMT). Mae hyn yn mesur yr hyn y gallai gweithredwr rhesymol effeithlon ddisgwyl ei ennill, yn hytrach na ffigurau masnach gwirioneddol."
        },
        {
            "text": "Rydym yn defnyddio FMT oherwydd gallai lefel y fasnach fod yn dwyllodrus. Er enghraifft, gallai tafarn sy'n cael ei rhedeg gan rywun enwog ennill mwy nag un sy’n cael ei redeg gan weithredwr lleol, ond rydym yn prisio’r eiddo ei hun, nid y busnes. Felly, rydym yn seilio ein prisiad ar yr hyn y gallai gweithredwr rhesymol effeithlon ei ennill. Yna cyfrifir y gwerth ardrethol trwy gymryd canran o'r FMT hwn."
        },
        {
            "text": "Sut alla i ddarganfod mwy?"
        },
        {
            "text": "Gallwch gofrestru ar gyfer cyfrif prisio ardrethi busnes i gael gwybod mwy am sut y cyfrifwyd eich gwerth ardrethol."
        },
        {
            "text": "Mae ein blogiau 'sut rydym yn prisio’ yn trafod sut rydym yn defnyddio'r dull rhent cymharol i brisio eiddo fel siopau, tafarndai a mwy."
        },
        {
            "text": "Ceir rhagor o wybodaeth am y dull rhent cymharol i brisio yn adran 4 o’r VOA Rating Manual  gyhoeddir gan y VOA  4: dulliau prisio - Rhan 1: R2017 rental evidence and valuation issues - Guidance - GOV.UK. ."
        }
    ]
}