{
    "url": "https://dfedigital.blog.gov.uk/2025/03/19/introducing-the-dfe-plain-language-standard/",
    "title": "Introducing the DfE Plain Language standard ",
    "authors": [
        "Kerry Lyons",
        "Steve Milnes",
        "Sarah Stewart, Senior Content Designer"
    ],
    "categories": [
        "Accessibility",
        "Content design",
        "Plain Language Standard",
        "technology"
    ],
    "pub_date": "2025-03-19T10:00:00+00:00",
    "content": [
        {
            "text": "In digital, data, and technology in DfE, we’ve published a Plain Language standard. "
        },
        {
            "text": "The Plain Language standard ensures that users can: "
        },
        {
            "text": "The standard incorporates our ways of working and best practise for user-centred design in government. It should not create any more work for content designers, or anyone working on content. "
        },
        {
            "heading": 3,
            "text": "A department-specific standard to support delivery  "
        },
        {
            "text": "There are lots of different standards that we need to meet when building digital government services.           "
        },
        {
            "text": "While services are typically assessed against the 14 points of the government Service Standard, sometimes, we use other standards to further assure our services.  "
        },
        {
            "text": "For example, this can include: "
        },
        {
            "text": "The DfE Plain Language standard provides a framework and a departmental commitment to use plain language in our services. "
        },
        {
            "text": "Our working hypotheses is that a standard which formalises the use of plain language will support teams to advocate for its use. "
        },
        {
            "heading": 3,
            "text": "Applying standards and guidance "
        },
        {
            "text": "In DfE service teams, we follow and apply GDS Service Manual guidance, and work to meet the Service Standard. But not all services or websites go through assessment checks. "
        },
        {
            "text": "We know that existing guidance can be challenged or that people might not know it exists. The Plain Language standard aims to help us to meet our commitment as a public body to build services that everyone can use.   "
        },
        {
            "heading": 3,
            "text": "How we designed the standard "
        },
        {
            "text": "When the International Organization for Standardization (ISO) published the Plain Language standard, content designers in DfE mapped out how we work to meet it and identify any gaps. "
        },
        {
            "text": "We shared this work with the DfE content community, user-centred policy design colleagues, and across government with content designers at HMRC and GDS.We also explored the idea of whether having a language-based standard could support the work we do as content designers."
        },
        {
            "heading": 3,
            "text": "What we learnt "
        },
        {
            "text": "Our research showed that a Plain Language standard could support or add to GDS guidance and help people advocate for using plain language. "
        },
        {
            "text": "We also knew that other disciplines have standards, for example, Tech Code of Practice (TCoP), which support service delivery.  "
        },
        {
            "text": "The scope of our standard could be a minimal viable standard to support raising the quality of services. "
        },
        {
            "heading": 3,
            "text": "Scoped the standard "
        },
        {
            "text": "We ran a workshop with DfE senior content designers and content designers across DfE and GOV.UK to explore what a DfE Plain Language standard could look like, how could we measure it, and when it would be used. "
        },
        {
            "text": "We took the first draft to the wider DfE content community to ask if they could: "
        },
        {
            "text": "We heard, ‘a standard gives more clout than guidance’ and that it could be shared with stakeholders and contractors, to support and reinforce our ways of working. "
        },
        {
            "text": "We also received challenge about overly formalising the content design process and that sometimes government needs to use jargon. "
        },
        {
            "text": "Meeting the standard is about working to GDS guidance and best practice. "
        },
        {
            "text": "We do recognise that as a government department we must use jargon sometimes, the jargon is what users recognise, rather than plain, simple wording. This is why we acknowledge that if there is a business, or user need, we always focus on writing clear content, directed by user research. "
        },
        {
            "text": "We iterated the standard, shared it with GDS and had a second community crit. We refined guidance for tools we use to support meeting the standard and considered cross-government content discussions about questioning how helpful a reading age is, so we removed it. "
        },
        {
            "text": "The Plain Language standard was approved by our standards forum in February, as part of a wider standards piece of digital, data and technology work in DfE. We’ll be working with our senior content designers to understand how useful the standard is to support service delivery.  "
        }
    ]
}