{
    "url": "https://socialcare.blog.gov.uk/2022/07/20/developing-a-new-framework-for-delegated-healthcare-interventions/",
    "title": "Developing a new framework for delegated healthcare interventions",
    "authors": [
        "Deborah Sturdy",
        "Oonagh Smyth"
    ],
    "categories": [
        "Innovation",
        "Integrated care",
        "Viewpoint",
        "Workforce"
    ],
    "pub_date": "2022-07-20T14:34:31+00:00",
    "content": [
        {
            "heading": 2,
            "text": "Building on best practice"
        },
        {
            "text": "The pandemic has not only been a tough two years for adult social care, it has brought a whole host of unexpected changes. We know that social care has been delivering delegated healthcare interventions for some years. We’ve seen an increase in these interventions, with clear benefits for people who draw on services, as well as a recognition of the value, skills and complexity of care across health and social care settings."
        },
        {
            "text": "A delegated healthcare intervention is an activity, usually of a clinical nature, where registered healthcare professionals delegate to a competent care worker, having been given appropriate training, monitoring and support."
        },
        {
            "text": "These include blood pressure monitoring, insulin administration, catheter care, wound care and more. We have seen some great examples of good practice, where this process has worked well, but the delegation picture across the country is varied, with differing local protocols, structures and processes in place."
        },
        {
            "text": "With this in mind, there’s a need to develop a national voluntary framework to support safe and effective delegation across residential and community settings. This will also include the personal assistant (PA) workforce. We want to support the delegation that is already taking place, with the oversight and accountability of a registered health professional. We are clear this accountability will not change under the new framework."
        },
        {
            "text": "This piece of work is a collaborative project involving the Department of Health and Social Care, Skills for Care, sector partners, regulators and all key stakeholders, including people who draw on services."
        },
        {
            "text": "This approach means we can maximise the benefits to people who draw on services, and their families, so we can secure their peace of mind for effective and safe delivery of person-centred and consistent care. It is also a recognition of the good practice already happening before the pandemic but which became accelerated during the crisis."
        },
        {
            "heading": 2,
            "text": "Flexible frameworks"
        },
        {
            "text": "It is important to note the new national delegation framework will be voluntary, sector-led and adaptable to local experiences, complementing existing good practice and protocols. It will set out clear guiding principles informed by policy, procedure, governance arrangements. The research conducted last year has fed into this work."
        },
        {
            "text": "We plan to publish the framework in spring 2023, followed by the establishment of trailblazer sites across England. We are very aware this is just the beginning of a longer term vision of support and implementation in a period of great change for our sector."
        },
        {
            "text": "We know we have a lot of work to do to create a flexible and effective framework, but it has the potential to offer clear benefits for people who draw on services in our communities and the workforce who support them."
        }
    ]
}