{
    "url": "https://nda.blog.gov.uk/how-artificial-intelligence-could-revolutionise-work-at-sellafield/",
    "title": "How artificial intelligence could revolutionise work at Sellafield",
    "authors": [
        "Mel Willis"
    ],
    "categories": [
        "Innovation/savings"
    ],
    "pub_date": "2022-07-20T16:33:54+01:00",
    "content": [
        {
            "text": "We talk about robots a lot at Sellafield – the way they are revolutionising what we do and how we do it, which in turn is helping us create a clean and safe environment for future generations."
        },
        {
            "text": "Mel Willis a robotics project engineer, who works in our robotics and artificial intelligence team, tells us how it’s the other side of her team’s work – the introduction and development of artificial intelligence (AI) – that could bring the bigger changes."
        },
        {
            "text": "Mel explains:"
        },
        {
            "text": "Imagine a world where old-but-important paper files are scanned and collated – and become fully searchable. Where our facilities are automatically checked for corrosion or degradation. Where every photo we take is checked and given a security marking dependant on its content."
        },
        {
            "text": "It's these pieces of work, and a thousand others, which AI systems could help us achieve, either in whole or partly. It could free our people up to do other work, speeding up jobs, delivering value for money – and even keep them out of harm’s way."
        },
        {
            "text": "Our robotics and AI capability is developing our strategy for artificial intelligence. We recently took part in a workshop organised by the Nuclear Institute, bringing together AI work from across the nuclear industry."
        },
        {
            "text": "We want it to be ‘business as usual’. It’s the next step – we’ve seen our robotics work bring in AI but there’s so much more it can do."
        },
        {
            "text": "For most people, AI is part of their lives – including the personal lives of our workforce. From how you find photos on your phone to what you watch on Netflix, it’s all around us."
        },
        {
            "text": "But of course, allowing AI systems to make decisions on a nuclear site is a world away from tagging faces in photos on your phone. Which is why workshops like the one we attended are so important. Hearing what’s on offer and working with partners is vital as we figure out how we can bring AI into nuclear applications."
        },
        {
            "text": "We’ve identified 15 areas where we could use AI, ranging from chemistry in our facilities to sorting images from our drones. A lot of them are about saving human time. And of course, most of it isn’t new – it’s just new to nuclear."
        }
    ]
}