{
    "url": "https://queensawards.blog.gov.uk/2022/07/20/welsh-translation-agency-awarded-for-international-trade/",
    "title": "Welsh Translation Agency Awarded For International Trade",
    "authors": [
        "The Queen's Awards for Enterprise"
    ],
    "categories": [
        "Advice",
        "International trade",
        "Queen's Awards",
        "queensawards",
        "Wales",
        "Winners"
    ],
    "pub_date": "2022-07-20T16:36:19+01:00",
    "content": [
        {
            "text": "Ruth Partington, CEO of Empower Translates, reflects on their journey to being recognised with The Queen’s Award for Enterprise for International Trade. "
        },
        {
            "text": "It was a rainy Tuesday in Chepstow, Wales – nothing new – and I was tackling my overflowing inbox. An email from a client popped up as I was starting on replies, with a curious subject line: ‘We’ve won a Queen’s Award for Enterprise’. "
        },
        {
            "text": "Our client is a prominent manufacturing company in the UK, with solid exporting ties, and is no stranger to accolades. Yet the pride and prestige that accompanied The Queen’s Award for Enterprise had made them hit ‘Send to All’ on their contact list. This was the email that convinced me to apply. "
        },
        {
            "text": "I wondered if the same would be possible for my company, Empower Translate. We are a niche translation agency and a relatively small enterprise in the UK, although diligent with records and reporting. So, we were incredibly encouraged to see that we met the criteria for two of the categories. "
        },
        {
            "text": "After settling on the International Trade category, the process was justifiably lengthy. It involved producing a significant amount of information, which gave our newly appointed Managing Director a fantastic (and intense) insight into the business. Our win is certainly attributable to his hard work, and also the years of reaching out beyond our own borders to export our specialist services where they’re needed most.  "
        },
        {
            "text": "It is precisely our niche specialism within translation that allows us to maintain an excellent reputation at home and abroad, based on excellent quality, customer service and innovation that is driven by a deep understanding of our clients, and supported by steadfast ethics. Our natural connection to international networks through the translation industry also means that we have always had the processes and systems in place to support international trade and were able to achieve the outstanding growth required to win the award. "
        },
        {
            "text": "Since being awarded, we have made full use of the bragging rights… having The Queen’s Award for Enterprise emblem on our site and materials lends a certain authority to Empower, which we imagine will support future sales with prospects and new clients. We equally hope to benefit from expanding our network through our ‘Institute of Export and International Trade’ membership. "
        },
        {
            "text": "For anyone looking to apply, I would recommend first and foremost making sure you can easily prove that you meet the criteria using reporting and metrics. It is no small feat pulling together all of the paperwork required, so having your ‘ducks in a row’ is a great starting point. We also relied on our proven and measurable reputation during application, as well as highlighting our Corporate Social Responsibility initiatives. "
        },
        {
            "text": "Find out more about Empower Translate here: https://www.empowertranslate.com/ "
        },
        {
            "text": "Does your company have what it takes to achieve The Queen’s Award for Enterprise?  "
        },
        {
            "text": "Applications are open now: https://www.gov.uk/queens-awards-for-enterprise "
        },
        {
            "text": "Contact our helpline if you have any questions: queensawards@beis.gov.uk or 020 7215 6880 "
        }
    ]
}