{
    "url": "https://publicpolicydesign.blog.gov.uk/2025/05/08/designing-policy-with-complex-evidence/",
    "title": "Designing policy with complex evidence",
    "authors": [
        "Becky Miller",
        "Anne Thurston",
        "Robin Hancock"
    ],
    "categories": [
        "Case study",
        "PublicPolicyDesign"
    ],
    "pub_date": "2025-05-08T16:00:00+01:00",
    "content": [
        {
            "text": "Evidence-based policy making relies on robust, diverse research insights to inform policy ideas and decision making. But that’s easier said than done, particularly for complex policy challenges with evidence that contains many different actors and factors influencing the outcomes."
        },
        {
            "text": "This is the first of a two-part blog post where we’ll explain the combination of methods we’ve tested to review and make sense of a complex evidence base with a wider group of people on our programme. "
        },
        {
            "text": "In this first post, we’ll describe the challenges of evidence-based policy making we’ve experienced on the Farming and Countryside Programme and explain the steps we took to prepare for a participatory evidence mapping workshop. In the second post, we’ll explain how we designed, ran and analysed the evidence mapping workshop, combining systems thinking and serious games."
        },
        {
            "heading": 2,
            "text": "Why is evidence-based policy making challenging?"
        },
        {
            "text": "Evidence-based policy making is an important aspiration referenced in the HM Treasury's Green Book, but it presents practical challenges for policy teams working under pressure which we’ve experienced first-hand on our programme:"
        },
        {
            "text": "These challenges present risks for policy teams. Without a holistic view of the evidence, we can introduce assumptions and bias. For complex policy areas, a lack of methods to collectively make sense of complexity in the evidence base, can lead to siloed policy ideas and interventions which don’t make sense in delivery, for end users or frontline workers."
        },
        {
            "text": "Equally, for research colleagues, they can experience frustration if policy colleagues aren’t aware of their work which can lead to duplication of effort if new research is commissioned without knowledge of existing evidence. This also risks undermining trust in government if citizens are engaged in research on the same issues multiple times."
        },
        {
            "heading": 2,
            "text": "How can policy teams gather robust and complex evidence bases and make sense of them?"
        },
        {
            "text": "In response to these challenges faced by our policy teams, we asked ourselves:"
        },
        {
            "text": "To address these challenges and support our policy colleagues in their work, we designed and tested a four-phase participatory methodology to allow our policy team to make sense of their complex and extensive evidence base and come up with a portfolio of policy ideas to test and learn from. We’ll explain the first two stages of this methodology below which cover the evidence gathering activities. In the next blog we’ll explain the evidence mapping workshop itself."
        },
        {
            "heading": 2,
            "text": "Evidence discovery"
        },
        {
            "text": "Inspired by Policy Lab’s collaborative evidence discovery method,  we first hosted an online evidence discovery workshop, inviting any colleagues on our programme who might have research related to our policy challenge. "
        },
        {
            "text": "We used an online whiteboard tool to populate an ‘evidence gallery’ with all the evidence the policy team currently held. In the workshop, we allowed time for everyone to explore and read through the evidence gallery, inviting them to add any evidence or specific insights they thought were missing"
        },
        {
            "text": "This first workshop helped us to quickly grow a more robust and diverse evidence base, drawing on the breadth and diversity of knowledge, experience and research disciplines in our programme."
        },
        {
            "heading": 2,
            "text": "Insight ‘nuggets’"
        },
        {
            "text": "After the online evidence discovery workshop, we were inspired by Tomar Sharon and Benjamin Gadbaw’s work on the atomic unit of a research insight. They argue that insight ‘nuggets’ (rather than research reports) are the most useful, actionable unit of research. And they’ve shown how research operations can evolve to extract insight ‘nuggets’ that become readily available to organisations to answer a whole range of questions and challenges over time. "
        },
        {
            "text": "We distilled our evidence into an online searchable database of 150 individual insights, tagged with themes, and with referenced sources. We now had a much richer and more accessible evidence base, that we could use to underpin the activities."
        },
        {
            "text": "To enable a group of people to use these insight ‘nuggets’ in our evidence mapping workshop we printed them out as individual ‘evidence cards’. This physical, tactile format allowed the evidence to be easily and quickly socialised and deliberated among participants in a more nuanced and dynamic way compared to our experiences attempting to run to similar activities online."
        },
        {
            "text": "In our next blog post we will detail how we worked with professional games designer Matteo Menapace to design our participatory ‘evidence mapping’ workshop, that allowed 36 colleagues with little or no prior knowledge of systems mapping to explore the 150 insights nuggets and build their own maps."
        },
        {
            "text": "If you would like to find out more about this project, or others undertaken by Defra’s Policy Design Lab, get in touch! Equally we’d love to hear about any similar approaches you’ve been testing for evidence collection and review. Please email policydesignlab@defra.gov.uk."
        }
    ]
}