{
    "url": "https://nationalscreening.blog.gov.uk/2025/05/08/nhs-aaa-screening-programme-proves-its-effectiveness/",
    "title": "NHS AAA Screening Programme proves its effectiveness",
    "authors": [
        "Harriet Strachan",
        "Phil Gardner",
        "Sophie Mitra"
    ],
    "categories": [
        "Abdominal Aortic Aneurysm Screening"
    ],
    "pub_date": "2025-05-08T08:42:19+01:00",
    "content": [
        {
            "text": "In 2005, the UK National Screening Committee (UK NSC) recommended screening for abdominal aortic aneurysm (AAA) in men aged 65."
        },
        {
            "text": "Although death rates had been reducing, there were still as many as 3,000 deaths each year from ruptured AAAs in men aged over 65."
        },
        {
            "text": "The NHS AAA screening programmes in the UK were implemented to reduce AAA-related deaths. Population-based ultrasound screening started in 2009, and by 2013 the screening programme was fully operational across the UK. "
        },
        {
            "text": "A review team has now studied data from the programme’s first decade – April 2013 to March 2023."
        },
        {
            "text": "It has found that AAA screening in the UK has been effective and has contributed substantially to ongoing reductions in AAA-related deaths."
        },
        {
            "heading": 2,
            "text": "Key findings"
        },
        {
            "text": "The review found strong evidence that the number of deaths from ruptured AAAs had halved during the programme’s first 10 years. "
        },
        {
            "text": "An updated cost-effectiveness model for the AAA screening programme showed that it remained cost-effective at the current activity levels."
        },
        {
            "text": "When comparing international data, only Sweden and the UK showed consistent reductions in ruptured AAAs over the last 6 years. These 2 countries are the only ones with a well-established AAA screening programme."
        },
        {
            "text": "The number of repairs of ruptured AAAs fell by over two thirds in the age group of men offered screening."
        },
        {
            "text": "The review also highlighted potential opportunities for future changes to the screening programme that may help to maintain its effectiveness as the prevalence of AAAs decreases over time."
        },
        {
            "heading": 2,
            "text": "Future effectiveness reviews"
        },
        {
            "text": "This review has demonstrated the benefits of evaluating an existing screening programme to assess the extent to which it remains effective in the years following implementation. "
        },
        {
            "text": "The UK NSC Secretariat’s Screening Data and Effectiveness team is currently undertaking a similar review of the Infectious Diseases in Pregnancy Screening Programme, and will shortly begin a review of the Cervical Screening Programme. The aim is to put in place an ongoing programme of effectiveness reviews across all national screening programmes, and report those findings to the UK NSC so it can consider the next steps for each programme."
        },
        {
            "heading": 2,
            "text": "Thank you"
        },
        {
            "text": "This review was a collaborative piece of work, with input from stakeholders and subject matter experts across the 4 UK nations. We would like to take this opportunity to thank everyone who was involved with the AAA screening effectiveness review for their help and support throughout this project."
        },
        {
            "heading": 2,
            "text": "Keep up to date "
        },
        {
            "text": "The UK NSC blog provides up to date news from the UK NSC. You can register to receive updates direct to your inbox, so there is no need to keep checking for new articles. If you have any questions about this blog article, or about the work of the UK NSC, please email uknsc@dhsc.gov.uk. "
        }
    ]
}