{
    "url": "https://ofsi.blog.gov.uk/2025/05/08/svarog-penalty-a-lesson-in-information-offences/",
    "title": "Svarog Penalty: A Lesson in Information Offences ",
    "authors": [
        "OFSI"
    ],
    "categories": [
        "OFSI Blog"
    ],
    "pub_date": "2025-05-08T11:03:13+01:00",
    "content": [
        {
            "text": "On 11 April 2025, OFSI imposed a monetary penalty of £5,000 on the UK-registered company Svarog Shipping & Trading Company Limited (“Svarog”).  "
        },
        {
            "text": "This penalty relates to an information offence and is the first of its kind to be issued by OFSI. Svarog failed to respond within the required timeframe to a statutory Request for Information (RFI) made by OFSI, and failed to provide a reasonable excuse. In those circumstances, OFSI has the power to impose a penalty in respect of the information offence.  "
        },
        {
            "text": "This case highlights the importance of firms and individuals responding in a timely manner to OFSI RFIs. Below, we have provided an overview of RFIs, a brief summary of the case, and the key compliance lessons that industry can take away.   "
        },
        {
            "text": "What do we mean by a “Request for Information?” "
        },
        {
            "text": "OFSI has legal powers to require certain firms and individuals to provide information to it. The reasons OFSI might request this information are outlined in section 5.6 of OFSI’s general guidance, and can include establishing whether financial sanctions may have been breached, or monitoring compliance with certain financial sanctions regulations or licences.  "
        },
        {
            "text": "When requesting information, OFSI will specify the legislative basis for the request, and the time period within which the information is to be provided.  "
        },
        {
            "text": "OFSI’s powers to request information are among the most important tools it has for investigating suspected breaches of financial sanctions. If firms or individuals fail to respond to these requests, it can hinder OFSI’s timely access to information, thereby impacting OFSI’s overall effectiveness and efficiency.  "
        },
        {
            "text": "What was the information offence committed by Svarog? "
        },
        {
            "text": "OFSI issued an RFI to Svarog on 26 January 2024, as part of a large and complex investigation. Svarog did not respond to the RFI by the deadline. Despite OFSI sending reminders, Svarog’s response was only received after OFSI contacted Svarog’s auditors. Svarog apologised for failing to respond to the RFI, but it did not provide a reasonable excuse for missing the statutory deadline. "
        },
        {
            "text": "Given Svarog’s failure to respond to OFSI’s RFI issued on 26 January 2024 and its failure to provide a reasonable excuse, OFSI concluded that Svarog had committed an information offence and that a penalty of £5,000 was the appropriate outcome. OFSI ultimately concluded that Svarog had not breached financial sanctions other than in respect of this information offence.  "
        },
        {
            "text": "For the full details of the case, please see the penalty notice.  "
        },
        {
            "text": "What are the key compliance lessons for industry? "
        },
        {
            "text": "1. Firms should recognise the seriousness of failing to respond promptly to RFIs. "
        },
        {
            "text": "OFSI takes a dim view of firms who delay or fail to respond to statutory obligations placed upon them. Firms should therefore first note the importance OFSI attaches to its information gathering powers and should be aware of the potential consequences of inaction. "
        },
        {
            "text": "Failure to respond to RFIs can significantly impede OFSI’s ability to assess compliance, enforce financial sanctions and maintain compliance with the sanctions regimes.  "
        },
        {
            "text": "In this instance, Svarog’s failure to respond by the deadline caused delay to the wider investigation the RFI was related to, and wasted OFSI’s resources, including the need for OFSI to contact Svarog’s auditor. Such delays, if repeated across OFSI’s other enquiries, could seriously undermine OFSI’s effectiveness and efficiency, diverting resources away from enforcement action and constituting a poor use of taxpayer money.  "
        },
        {
            "text": "2. Engage proactively and candidly with OFSI when it comes to RFIs. "
        },
        {
            "text": "If firms receive an RFI from OFSI but are unsure how to respond, or believe they cannot meet the deadline, they should contact OFSI as soon as possible to seek clarification and/or request an extension. They should not ignore the request. If a firm believes it has missed a statutory deadline, but has a reasonable excuse, it should provide that excuse proactively for OFSI to consider, accompanied by a full explanation of the circumstances. Firms are also encouraged to engage with OFSI’s published guidance and seek professional advice on their sanctions obligations if necessary. "
        },
        {
            "text": "3. Have effective communication and monitoring systems in place. "
        },
        {
            "text": "OFSI expects firms to have effective communication and monitoring systems in place, so that firms can promptly identify and respond to any RFI they might receive from OFSI. This includes appointing responsible personnel, monitoring and maintaining up-to-date contact information to ensure compliance with OFSI requests for information.  "
        },
        {
            "text": "This is especially true for firms operating in sectors with elevated exposure to sanctions. Svarog - operating in the high-risk maritime oil shipment sector - demonstrated some awareness of sanctions risks and its own exposure. These factors ought to have made Svarog more vigilant to the request from OFSI, and should have caused it to have robust processes in place for responding.  "
        },
        {
            "text": "4. Consider other compliance and reporting obligations. "
        },
        {
            "text": "Whilst the penalty in this case related to the failure to respond to an RFI without a reasonable excuse, other types of failures to provide information can also constitute breaches leading to penalties. For example: "
        },
        {
            "text": "You should ensure you are aware of your obligations either as a relevant firm (as defined in the regulations), or as the user or holder of a valid OFSI licence. The requirement to comply with all other obligations applies to both individuals and entities. "
        },
        {
            "text": "Conclusion  "
        },
        {
            "text": "The information powers contained in the Russia Regulations are designed to ensure OFSI has prompt and full access to the information it needs to implement and enforce financial sanctions. This case signals to industry the importance of responding to RFIs in a timely and comprehensive manner; doing so helps contribute to the effective implementation and robust enforcement of financial sanctions. "
        }
    ]
}