{
    "url": "https://socialcareinspection.blog.gov.uk/2025/05/08/the-importance-of-oral-health-in-childrens-social-care/",
    "title": "The importance of oral health in children’s social care",
    "authors": [
        "Yvette Stanley"
    ],
    "categories": [
        "care experienced",
        "children looked after",
        "children's homes",
        "health",
        "looked after children"
    ],
    "pub_date": "2025-05-08T10:56:14+01:00",
    "content": [
        {
            "heading": 2,
            "text": "Our goals for oral health in children’s social care"
        },
        {
            "text": "We've been working closely with the Care Quality Commission (CQC) to look at the importance of good oral health for children. We want to tackle oral health inequality by driving improvement in the quality of oral care provision in children’s social care. The success of CQC’s ‘Smiling Matters’ project in adult social care shows the potential for making improvements."
        },
        {
            "text": "All children are dependent on adults for access to a dentist, diet choices and oral hygiene support. For children living away from home, this responsibility sits with the staff who are caring for them. That includes children living in children’s homes, foster care and residential special schools, as well as young people living in supported accommodation."
        },
        {
            "text": "We have a great opportunity to influence what happens for these children and young people."
        },
        {
            "heading": 2,
            "text": "Why oral health is so important"
        },
        {
            "text": "Oral health is vital for all, but even more so for children in care. Even though tooth decay is preventable, it:"
        },
        {
            "text": "There are also wider concerns about poor oral health. Children may:"
        },
        {
            "text": "Care-experienced children and those with special educational needs and/or disabilities (SEND) are more vulnerable to poor oral health. And we need to collectively make a change."
        },
        {
            "heading": 2,
            "text": "What we see on inspection regarding oral health"
        },
        {
            "text": "On inspection, we often see providers having difficulties in accessing dental services for the children they care for."
        },
        {
            "text": "Many children find it difficult to attend the dentist even if they have an appointment. Fear, poor past experiences and lack of support can make it hard for a child to attend. These difficulties can be exacerbated for children who are already traumatised or finding life difficult."
        },
        {
            "text": "We also know that some children may find it hard to understand what might be happening when they visit the dentist and may also have increased levels of anxiety or fear. A parent of a child with autism told us that:"
        },
        {
            "heading": 2,
            "text": "Good practice in supporting children’s oral health"
        },
        {
            "text": "It is vital that children are supported to attend appointments and have a good oral hygiene routine. The importance of a good routine is increased when access to services is poor. Carers should support children in their routines and encourage oral hygiene whenever possible. We will highlight good practice when we observe this in inspection."
        },
        {
            "text": "An inspector told us:"
        },
        {
            "text": "And a manager of a children’s home told us:"
        },
        {
            "heading": 2,
            "text": "Ofsted’s role in promoting good oral health"
        },
        {
            "text": "Oral health features in our social care inspection framework and Annex A form for children’s homes."
        },
        {
            "text": "When we inspect, we may ask you a range of questions about the oral health of the children. These questions could be about preventing decay, their access to dental services or their oral health routines."
        },
        {
            "text": "Questions about prevention could include:"
        },
        {
            "text": "Around access, we might ask questions such as:"
        },
        {
            "text": "We may also ask about routines, such as:"
        },
        {
            "text": "Please do think about these questions, and the arrangements you have in place for decay prevention, access to dental services and oral health routines."
        },
        {
            "text": "We want to make sure every child has good oral health and the right habits to continue that as they grow up."
        },
        {
            "heading": 2,
            "text": "Additional resources"
        },
        {
            "text": "There is staff training available from the NHS that you can refer to. This is designed to help staff feel comfortable in supporting children’s oral health, and it includes resources you can use. Although these are directed at SEND settings, you can adapt them for other use."
        },
        {
            "text": "You can also find out more about oral health from CQC."
        }
    ]
}