{
    "url": "https://marinedevelopments.blog.gov.uk/2025/05/08/the-east-marine-plan-statement-of-public-participation-spp-has-been-refreshed-to-highlight-changes-in-the-timeline/",
    "title": "The East Marine Plan Statement of Public Participation (SPP) has been refreshed to highlight changes in the timeline",
    "authors": [
        "Sidonie Kenward, Senior Marine Planner"
    ],
    "categories": [
        "marine planning"
    ],
    "pub_date": "2025-05-08T11:55:46+01:00",
    "content": [
        {
            "text": "An SPP, required under the Marine and Coastal Access Act 2009 (MACAA), is the contract between the MMO and our stakeholders which sets out how, when, and why we carry out engagement. An SPP also outlines what we will do with the outcomes of any views and opinions presented by stakeholders throughout the development of a marine plan."
        },
        {
            "text": "The East Marine Plan SPP was published in 2024 following productive online and in-person stakeholder sessions, and an online consultation. Its publication marked the start of the process to replace the East Marine Plans."
        },
        {
            "text": "The MMO are required through MACAA to ensure the SPP remains up to date throughout plan development, to ensure transparency and accountability to stakeholders. Engagement activities were paused during the pre-election period and following the July 2024 General Election until November 2024. This pause impacted the plan development timelines for work on replacing the East Marine Plans and which necessitated changes to the East Marine Plan SPP."
        },
        {
            "text": "Throughout early 2025 the Marine Planning team undertook work to update the engagement timeline included in the East Marine Plan SPP. Following the completion of this work we are pleased to announce that the updated East Marine Plan SPP was recently published. For more information, and to see the updated East Marine Plan SPP please visit: East Marine Plans - GOV.UK. The refreshed timeline estimates plan adoption to be Summer 2027."
        }
    ]
}