{
    "url": "https://socialworkwithadults.blog.gov.uk/2025/05/08/welcoming-the-casey-commission/",
    "title": "Welcoming the Casey Commission",
    "authors": [
        "Sarah McClinton"
    ],
    "categories": [
        "Ageing",
        "Care and support",
        "Co-production",
        "Communities",
        "Learning disabilities",
        "Mental health",
        "Our profession",
        "Personalisation",
        "Recognition",
        "Society",
        "Viewpoint"
    ],
    "pub_date": "2025-05-08T07:42:12+00:00",
    "content": [
        {
            "text": "Baroness Louise Casey has begun her role as Chair of the Independent Commission (the Commission) into Adult Social Care. Baroness Casey marked the formal start of the Commission by chairing a roundtable with people with first-hand experience of the social care system."
        },
        {
            "text": "Baroness Casey not only has a reputation as ‘Whitehall’s greatest doer’, but she also carries a strong track record of championing social justice and challenging inequity. "
        },
        {
            "text": "We all carry our own experiences of social care, whether that be family or friends, ageing relatives who need more help at home, support for mental health recovery or access to work for a disabled adult we know. Social care is broad and at its best it enables every adult to fulfil their potential and live the lives they choose. "
        },
        {
            "text": "Social care is about all of us and that’s why the Independent Commission is such an important opportunity towards creating a National Care Service that we can all feel proud of.        "
        },
        {
            "text": "Whether we are thinking about people who draw on care and support, those who find it harder to access the help that’s right for them or those who are working in people’s homes and in care settings, tackling inequity needs to be at the heart of reform. "
        },
        {
            "text": "People who rely on local authority-funded support are among the poorest in society in terms of disposable assets and income. The Care Act 2014 introduced the ‘wellbeing principle’ which means that everyone should be able to access the support they need to live gloriously ordinary lives and to address the barriers they may face due to age, physical or mental disabilities. Sometimes that’s a little bit of early help to get back on your feet and for others it can mean long term support.     "
        },
        {
            "text": "Family and friends who support their loved ones, play a vital role in enabling good lives. Around half of unpaid carers report at least one adverse health effect from providing care and caring disproportionately impacts women and older people, most unpaid carers are over 50 years. "
        },
        {
            "text": "People working in care settings also face inequalities, with a disproportionate number having a long-term health condition or disability. They are some of the lowest paid workers, with 29% on zero hours contracts. Again, women are particularly affected, making up one in four of our social care workforce. "
        },
        {
            "text": "The Independent Commission brings an opportunity to achieve real reform by setting the right conditions to galvanise genuine co-production, a strong prevention and early help offer, high quality personalised support and commissioning of joined up services that enable us all to thrive.    "
        }
    ]
}