{
    "url": "https://space.blog.gov.uk/2023/04/27/expanding-the-uks-sovereign-sensor-network-to-the-british-antarctic-territory-and-beyond/",
    "title": "Expanding the UK’s Sovereign Sensor Network to the British Antarctic Territory and Beyond",
    "authors": [
        "UK Space Agency Space Surveillance and Tracking team"
    ],
    "categories": [
        "Space surveillance and tracking"
    ],
    "pub_date": "2023-04-27T10:53:46+01:00",
    "content": [
        {
            "text": "The UK Space Agency Space Surveillance and Tracking (SST) team is collaborating with the British Antarctic Survey (BAS) on a study exploring the feasibility of building and operating a satellite tracking sensor in the British Antarctic Territory (BAT)."
        },
        {
            "heading": 2,
            "text": "The Southernmost Sensor in the World"
        },
        {
            "text": "We depend on a global network of satellite tracking sensors to support space-based services essential to our everyday lives."
        },
        {
            "text": "These sensors are used to predict possible collisions between satellites and other space debris, as well as object fragmentation and re-entry. As our dependence grows, so does the requirement for accurate and reliable SST data."
        },
        {
            "text": "The first phase of a feasibility study completed in 2021 confirming that operating a sensor in the South Polar region is feasible, environmentally sustainable and would offer distinct SST value for UK registered satellites in Low Earth Orbit (LEO). Currently, the UK has 675 Resident Space Objects in LEO."
        },
        {
            "text": "There are currently no operational sensors deployed south of New Zealand. This project, therefore, is an opportunity for the UK Space Agency to make a significant global contribution to SST data by plugging a gap in the worldwide distribution of sensors."
        },
        {
            "heading": 2,
            "text": "The White Horizon"
        },
        {
            "text": "There are stark similarities between the Antarctic continent and outer space. The ferocious in-hospitability, as well as the human fascination regarding their exploration and habitation is increasingly shadowed by humanity’s negative impact on both environments."
        },
        {
            "text": "Ice mass loss in Antarctica is driven by global warming associated with human-driven climate change and increasing amounts of dangerous human-made space debris in Earth orbit threaten the future of these environments."
        },
        {
            "text": "The BAT is one of fourteen British Overseas Territories (OTs); while it is 4.2x larger than mainland UK, its population is limited to around 250 science and maintenance personnel, and a native population of emperor and Adélie penguins."
        },
        {
            "text": "The BAS is responsible for the administration of BAT, including the operation of two research stations (Halley & Rothera) and two field sites (Sky Blu & Fossil Bluff)."
        },
        {
            "heading": 2,
            "text": "Pole to Pole"
        },
        {
            "text": "The UK is not the only country looking to enhance SST capability at Earth’s poles. NASA are developing a satellite laser ranging (SLR) sensor station on the Norwegian island of Svalbard in the Arctic."
        },
        {
            "text": "The operation of sensors at both North and South poles will enable all-year round coverage to account for long periods of darkness and light, greatly improving SST data for polar orbiting satellites."
        },
        {
            "text": "From 2023, the SST team will conduct similar feasibility studies elsewhere and kick off the next phase of the BAS study."
        },
        {
            "text": "During this phase, we aim to provide final suitability and environmental assessments for both locations within BAT (Rothera and Sky Blu - identified as optimal sites in the Phase A study) and define which type of sensor is best suited for Antarctic deployment."
        },
        {
            "text": "Current estimates place the deployment of a sensor to Antarctica as achievable within a 3–4-year time frame."
        }
    ]
}