{
    "url": "https://defradigital.blog.gov.uk/2023/04/27/girl-power-why-we-chose-a-career-in-ict/",
    "title": "Girl Power: Why we chose a career in ICT",
    "authors": [
        "Fay Toward",
        "Iris Faraway"
    ],
    "categories": [
        "Defra digital",
        "Defra service design",
        "Software tools"
    ],
    "pub_date": "2023-04-27T14:00:01+01:00",
    "content": [
        {
            "text": "On International Day of Girls in ICT we hear from two colleagues about why and how they have built a tech career in Defra."
        },
        {
            "text": "Before joining Defra, I was a waitress at a local pub, while completing A-Levels in Science, IT and Business Studies. ICT always interested me growing up, and I also knew I was good at it. I only needed to be shown how to do something once, and I could continue to replicate it over and over."
        },
        {
            "text": "At school ICT was always such a broad subject. From taking a desktop apart and putting it back together without breaking it, to designing animations; there was always something different and exciting so you could never get bored. I decided that’s how I wanted my career to be."
        },
        {
            "heading": 2,
            "text": "On the fast track"
        },
        {
            "text": "My route into Defra was through the Rural Payment Agency (RPA) Fast Track ICT apprentice scheme. I spent 3-6 months in different areas of the ICT department, learning how the whole department fits together and the range of roles that exist."
        },
        {
            "text": "Recently I have been working on some of the internal software that has been around for many years, some of which is no longer fit for purpose. Working with stakeholders to use modern approaches and meet the needs of the end user, speeding up the process and reducing the reliance on us as developers to complete tasks along the way."
        },
        {
            "heading": 2,
            "text": "A helpful and friendly workplace takes you a long way"
        },
        {
            "text": "Everyone is very friendly here and will help you where they can, and if they can’t, they will always try to help find someone who can. I also find that no two days are the same; there is always something different to be doing so I never get bored."
        },
        {
            "text": "When I’m not working, I love to bake, mainly cakes and bread, but I’m rubbish at the decorating part. I have a two-year-old German shepherd called Nala, who is crazy and always full of energy, so most of my evenings and weekends are spent trying to wear her out just enough that she will snuggle up on the sofa and let me watch a Disney film with no interruptions."
        },
        {
            "text": " "
        },
        {
            "text": "I'm a lead developer working on user-facing digital services. I mostly work with JavaScript and Ruby on Rails. I initially joined the Environment Agency, after applying for a developer position through the website, and then moved over to Defra not long after."
        },
        {
            "text": "Like a lot of my colleagues, I took a slightly roundabout route into development. I graduated with a degree in English Literature and eventually took a job as a content designer for a university."
        },
        {
            "text": "It was my first time working in a multi-disciplinary agile team and I loved the energy – but I also found myself constantly eyeing up what the developers in the team were doing and picking up whatever knowledge I could."
        },
        {
            "text": "So, when a junior developer position became available, I jumped on the chance to apply and haven't looked back. A year later, I applied for a job with the Environment Agency and joined Defra."
        },
        {
            "heading": 2,
            "text": "Computers have always fascinated me"
        },
        {
            "text": "I was fascinated by computers and the internet from an early age and made my first website when I was 9 (a fan site for my favourite book series at the time), but I didn't have a lot of ICT education at school, and at first, I didn't think it was a professional option for me."
        },
        {
            "text": "I always thought you needed a Computer Science degree, but many developers I've worked with have very different backgrounds. There are lots of ways to get into the profession, and everyone brings their own unique skillset, which is great. I think my nine-year-old self would think it was pretty cool that I've made a career from the web."
        },
        {
            "heading": 2,
            "text": "Defra has given me plenty of variety"
        },
        {
            "text": "Right now, I'm working on the \"Get a rod fishing licence\" service, but I've previously worked on several other services, including \"Register as a waste carrier\" and \"Register your waste exemptions\"."
        },
        {
            "text": "Working for the public good is really important to me, and the most satisfying part of the job is managing to make it quicker and easier for people to get things done. Feedback from a happy user always makes my day!"
        },
        {
            "text": "Outside of work, if it was up to me, I'd spend all my free time on the sofa with a book, but I have a very stubborn dog who gets me out for a walk every day, whatever the weather. I also like knitting and playing board games, and tabletop role-playing games such as Dungeons & Dragons."
        },
        {
            "text": " "
        }
    ]
}