{
    "url": "https://insidehmcts.blog.gov.uk/2023/04/27/improving-support-for-children-going-to-court-as-witnesses/",
    "title": "Improving support for children going to court as witnesses",
    "authors": [
        "Trudy Lewis"
    ],
    "categories": [
        "Court and tribunal reform",
        "Crime",
        "Digital services"
    ],
    "pub_date": "2023-04-27T15:30:24+01:00",
    "content": [
        {
            "text": "Every year hundreds of child witnesses pass through our court system."
        },
        {
            "text": "Courts can be an uncomfortable environment for children and giving evidence in a courtroom can cause nervousness and stress."
        },
        {
            "text": "The role of the Crime Live Service team is to reduce the burden felt by these witnesses, working with criminal justice partners to provide better support, tailored to their needs. That’s one of the reasons introducing the ability to pre-record cross examination before the trial was so important."
        },
        {
            "text": "Under this process, a child will attend a court building in advance of the main trial, and be cross examined from a video witness room located in the non-public side of the building. The judge, lawyers, defendant, and any necessary court staff remain in the courtroom, as at trial. I explain more about how we use this service to protect the vulnerable in an earlier blog post."
        },
        {
            "text": "Our new animated video guides "
        },
        {
            "text": "Our partners work tirelessly to provide advice and support to help child witnesses give their best evidence in this situation. But our partners also told us children would benefit from more visual and engaging guidance, directed at their age group. Something they could review at their own pace."
        },
        {
            "text": "With this vital insight we have created two new animated video guides and published them on the HMCTS YouTube channel. One is aimed at children aged under 5 years old, and the other is aimed at slightly older children from 5 to 8 years old."
        },
        {
            "text": "We made these videos with input from professionals who support witnesses when giving evidence. They place the child front and centre, thinking about things from their perspective and creating something that works for them."
        },
        {
            "text": "I’m immensely proud of the way in which criminal justice partners and support services have worked collaboratively to produce these videos. I’m confident they will improve the experience and understanding of the court for many children in the future."
        },
        {
            "text": "Watch our animated video guides."
        },
        {
            "text": "Supporting our most vulnerable users"
        },
        {
            "text": "Thanks to the dedication and commitment of many people across the criminal justice system, there’s been significant progress on pre-recorded cross examination over the last year."
        },
        {
            "text": "We completed roll out of the service to all Crown Courts in 2022. This met a pledge within the government’s Rape Review Action Plan to help reduce the number of victims withdrawing from the process and to increase the number of cases reaching court."
        },
        {
            "text": "1,800 victims and witnesses used the pre-recorded cross examination process in the last 12 months, meaning over 4,300 people have used this service since 2020."
        },
        {
            "text": "We also launched a pilot of the pre-recorded cross examination service at Leeds Youth Court. This will help protect some of our most vulnerable on the most sensitive cases."
        },
        {
            "text": "And a recent government report into the experience of intimidated witnesses found that pre-recorded cross examination improved their experience. This delivers on plans promised in a previous blog post by my colleague Daniel Flury."
        },
        {
            "text": "Keeping up the good work "
        },
        {
            "text": "We continually review feedback about what can be done to support the most vulnerable users of our courts from across the justice system. We will continue to roll out additional support where needed and provide specialist, thorough and essential advice to our most vulnerable users."
        },
        {
            "text": "Across the criminal justice system we share a collective purpose and responsibility to support every person, none more so than the most vulnerable. We’re at our best when working together, and I’m confident that together we will continue to improve the experience for countless witnesses and improve justice for all."
        }
    ]
}