{
    "url": "https://ipo.blog.gov.uk/2023/04/27/meet-the-ipo-board-chief-ddat-officer-sian-nia-davies/",
    "title": "Meet the IPO Board: Chief DDaT Officer, Siân-Nia Davies",
    "authors": [
        "Jenny Manders"
    ],
    "categories": [
        "Business",
        "Innovation",
        "IPO"
    ],
    "pub_date": "2023-04-27T15:45:31+01:00",
    "content": [
        {
            "text": "It’s time for the next episode in our ‘Meet the Board’ series. We’ve been speaking to Siân-Nia Davies, IPO’s Chief Digital, Data and Technology Officer (CTO), who is responsible for IT, data and security at the IPO."
        },
        {
            "text": " "
        },
        {
            "heading": 2,
            "text": "Siân-Nia, where did you start your career?"
        },
        {
            "text": "I graduated with an Applied Biology degree from Cardiff University and worked for British Gas for a few years. I then spent 20 years at BT. During that time, I did a variety of IT and data jobs. I created a technology showcase where I identified and advocated innovative tech to solve business solutions. I’ve worked in many different technical delivery and programme management roles too."
        },
        {
            "text": "What was closest to my heart, and the thing that I kept on being drawn back to, was leading large technical teams in BT. Sometimes I led teams responsible for a single, large, complex computing system and other times, I had teams responsible for a whole series of services, comprising 50 or 60 smaller inter-connected systems."
        },
        {
            "heading": 2,
            "text": "How did you come to join the IPO?"
        },
        {
            "text": "I had completed the large programme of work I was working on, and I wanted to find new challenges. BT had very few big technology roles in Wales, so I spoke to my friends, and several of them recommended that I look to the Civil Service. That encouraged me to look around outside the private sector for an alternative role, and that’s when I spotted a job ad for the Head of Platforms at the IPO."
        },
        {
            "text": "I had a chat with the then Chief Technology Officer, before applying. I really liked the fact that he also came from a private sector background and shared my passion for focusing on customer experience. I was excited by the prospects offered at the IPO and believed I would be a good fit."
        },
        {
            "text": "I joined the IPO in June of 2021 and initially, I was managing traditional infrastructure such as servers and networks ‘on premise’ as well as being responsible for moving from the old world to the new with our move to public Cloud."
        },
        {
            "text": "We were also introducing lots of new ways of working, including automation, so that the technology environments are stable and the processes we use are completely repeatable. Not long after I joined the IPO, I was asked to step up into the role of CTO on an interim basis. When a slightly larger version of the role was advertised in the summer of 2022, I went through the interview process and was thrilled to be that successful candidate."
        },
        {
            "heading": 2,
            "text": "Tell us about your IPO highlights"
        },
        {
            "text": "Some of the highlights I've experienced over the past two years at the IPO include investing efforts in our system availability. We've increased our out of hours support and we've also carefully managed our legacy systems estate so that we’ve exceeded our system availability targets. We've had fewer unplanned outages, meaning our systems are available when our customers need them and can file applications at a time that suits them - and that's really important to me."
        },
        {
            "text": "We're now getting ready to manage and run our brand-new rights-granting systems. We're working closely with colleagues across the IPO, and our customers, to design our transformed services. We've built our new Cloud-based environments and our people are learning the new tech ready for the autumn of 2023, when we'll have a pilot for some of our patent customers."
        },
        {
            "heading": 2,
            "text": "What are your priorities for the future?"
        },
        {
            "text": "Well, much of my focus at the moment is going to be on delivering our new transformed services. They'll give our customers easy access with quicker and more straightforward transactions. It'll help keep our costs - and therefore our fees - low. The new services will also free up more of our IPO people to spend more of their time directly supporting our customers."
        },
        {
            "text": "There'll also be new services, including improved search tools and better ways for accessing public IP data. We're expecting this to stimulate innovation as well as help support British businesses to protect their existing rights and to transform services."
        },
        {
            "text": "The new services will also enable us to be more flexible, so we can respond more quickly to customer needs and take advantage of new technology. We're taking our people with us on that journey too, so the digital data and technology teams are learning new skills as well as bringing existing IP knowledge to those new services."
        },
        {
            "text": "We’ll even be organising ourselves differently, so we move closer to our users and customers. We want all our customers to have a brilliant experience when using our services. That way we’ll protect the rights of innovators in the UK."
        },
        {
            "text": "I'm proud to be an instigator in doing the right thing for our customers, not just now but for the future too."
        }
    ]
}