{
    "url": "https://healthmedia.blog.gov.uk/2023/04/27/nhs-workforce-record-numbers-of-doctors-and-nurses-in-nhs/",
    "title": "NHS workforce: Record numbers of doctors and nurses in NHS",
    "authors": [
        "DH Media Centre"
    ],
    "categories": [
        "NHS",
        "Workforce"
    ],
    "pub_date": "2023-04-27T15:25:50+01:00",
    "content": [
        {
            "text": "There are a record number of doctors, nurses and other healthcare staff working in NHS trusts in England helping to deliver extra appointments, speed up diagnoses and tackle the Covid backlog."
        },
        {
            "text": "This is what you need to know."
        },
        {
            "heading": 2,
            "text": "How many NHS staff do you have?"
        },
        {
            "heading": 2,
            "text": "What about general practice?"
        },
        {
            "heading": 2,
            "text": "What are you doing to recruit and retain more health workers?"
        },
        {
            "heading": 2,
            "text": "What have you already done to boost the workforce?"
        },
        {
            "text": "We have:"
        },
        {
            "heading": 2,
            "text": "Where can I access the figures?"
        },
        {
            "text": "The latest figures for February 2023 can be found in full below:"
        },
        {
            "text": "NHS workforce: NHS Workforce Statistics - January 2023 (Including selected provisional statistics for February 2023) - NDRS (digital.nhs.uk)"
        },
        {
            "text": "General practice workforce: https://digital.nhs.uk/data-and-information/publications/statistical/general-and-personal-medical-services#latest-statistics"
        },
        {
            "heading": 2,
            "text": "Our latest statement"
        },
        {
            "text": "Health and Social Care Secretary, Steve Barclay, said:"
        },
        {
            "text": " \"Today’s figures demonstrate the clear progress being made to train and recruit record numbers of staff across the NHS and in primary care. Cutting waiting lists is a key priority for this government and we are committed to ensuring we have the workforce in place to achieve that. "
        },
        {
            "text": " “We will soon be publishing a long term workforce plan focused on recruiting and retraining more staff – to help tackle the backlogs and improve patient care. We will also be publishing a plan outlining further support for primary care.”"
        }
    ]
}