{
    "url": "https://insolvencyservice.blog.gov.uk/2023/04/27/true-or-false-top-ten-beliefs-about-bankruptcy/",
    "title": "True or false: top ten beliefs about bankruptcy",
    "authors": [
        "mediaofficer"
    ],
    "categories": [
        "Bankruptcy",
        "Debt management",
        "Debt solutions"
    ],
    "pub_date": "2023-04-27T09:54:32+01:00",
    "content": [
        {
            "text": "If you can’t pay your debts, there are various solutions that can help. It is important to seek free debt advice from a money adviser before making any decision on problem debt solutions. Free advice can be sought from: Debt Advice Locator | Syndication | MoneyHelper."
        },
        {
            "text": "One way of dealing with debt is bankruptcy. However, there are lots of beliefs about bankruptcy – some of which can be unhelpful and misleading."
        },
        {
            "text": "Here we look at, and address, the beliefs and misbeliefs about bankruptcy."
        },
        {
            "heading": 3,
            "text": "True or false: top ten beliefs about bankruptcy"
        },
        {
            "text": "We’ve asked our experts from the Official Receivers’ offices – the people who work directly with those who are going through bankruptcy – to reveal the top ten beliefs they encounter about bankruptcy, and to make clear the facts associated with them.  Official Receivers act as trustees and manage your bankruptcy."
        },
        {
            "heading": 4,
            "text": "1.I’ll lose my home"
        },
        {
            "text": "True and false"
        },
        {
            "text": "Many people think that being bankrupt means that you will lose your home – either by selling it if you are a homeowner or being asked to leave if you rent."
        },
        {
            "text": "The truth is that you might lose your home, depending on the circumstances."
        },
        {
            "text": "Homeowners"
        },
        {
            "text": "When your home might be sold:"
        },
        {
            "text": "When you might be able to keep your home:"
        },
        {
            "text": "Renters:"
        },
        {
            "text": "However, your landlord could ask you to leave:"
        },
        {
            "heading": 4,
            "text": "2. I won’t be able to use my bank account"
        },
        {
            "text": "True and false"
        },
        {
            "text": "Your bank account may initially be frozen by your bank when they receive notice of the bankruptcy ultimately your bank or building society will decide whether to allow you to continue using your existing account or open a new account"
        },
        {
            "text": "Can’t use:"
        },
        {
            "text": "Can use:"
        },
        {
            "text": "Accessing money to pay bills:"
        },
        {
            "text": "Some people who can’t access a bank account pay bills and essentials by:"
        },
        {
            "heading": 4,
            "text": "3. I won’t get a mortgage"
        },
        {
            "text": "False"
        },
        {
            "text": "Although it will probably be more difficult to get a mortgage after bankruptcy, it can still be possible, with these considerations:"
        },
        {
            "heading": 4,
            "text": "4. Everyone will know I’m bankrupt"
        },
        {
            "text": "True and False"
        },
        {
            "text": "Although being bankrupt is a matter of public record, it is not usually reported in the press in England and Wales. There are some rules including:"
        },
        {
            "heading": 4,
            "text": "5. I won’t be able to get credit in future"
        },
        {
            "text": "False"
        },
        {
            "text": "You might be able to get credit in the future, although it’s likely to be harder to secure. Consider:"
        },
        {
            "heading": 4,
            "text": "6. I’ll lose my car "
        },
        {
            "text": "True and false"
        },
        {
            "text": "Your car may be an asset and could therefore be sold by the Official Receiver to pay your creditors, depending on circumstances."
        },
        {
            "text": "If you own your car outright:"
        },
        {
            "text": "You could be allowed to keep your car if the Official Receiver decides that is essential It could be classed as essential if:"
        },
        {
            "text": "If your car is classed as essential but worth more than £2,000:"
        },
        {
            "text": "If you use a Motability scheme car:"
        },
        {
            "text": "Motability scheme cars are leased, rather than owned by you, and therefore cannot be sold by the Official Receiver. The Motability agreement might continue through your bankruptcy via payments including:"
        },
        {
            "heading": 4,
            "text": "7. Being bankrupt will clear all my debts"
        },
        {
            "text": "True and False"
        },
        {
            "text": "Most, but not all debts will not have to be paid by you after bankruptcy. Debts that you will still have to pay include:"
        },
        {
            "text": "If you continue to live in a home with a mortgage, you are likely to need to keep up the mortgage repayments otherwise the lender may sell the property."
        },
        {
            "text": "If you earn enough to have money left over after paying your reasonable regular living costs, it is likely that you will be asked to pay money towards your debts, during and after bankruptcy. This payment – usually made monthly – is called an income payments agreement (IPA) and can last for 3 years."
        },
        {
            "text": "8. Being bankrupt will ruin my future"
        },
        {
            "text": "False"
        },
        {
            "text": "Bankruptcy can have serious repercussions in your current and future life; it is not something to enter into lightly, or without exploring alternative ways out of debt:"
        },
        {
            "text": "However, bankruptcy can also provide a clean slate for your finances, and allow you to rebuild a life free of what might have seemed like unresolvable debts:"
        },
        {
            "heading": 4,
            "text": "9. I’ll lose all my possessions "
        },
        {
            "text": "False"
        },
        {
            "text": "You will be able to keep the things you need for daily living, including:"
        },
        {
            "text": "Other possessions vest in (transfer to) your trustee and could be sold to pay creditors."
        },
        {
            "heading": 4,
            "text": "10. I’ll have to go to court to make myself bankrupt"
        },
        {
            "text": "False"
        },
        {
            "text": " "
        }
    ]
}