{
    "url": "https://foresightprojects.blog.gov.uk/2023/03/30/building-a-shared-understanding-of-emerging-technologies/",
    "title": "Building a shared understanding of emerging technologies",
    "authors": [
        "mirandafleming"
    ],
    "categories": [
        "Emerging Technologies"
    ],
    "pub_date": "2023-03-30T16:15:16+01:00",
    "content": [
        {
            "text": "The Government Office for Science has just published its Rapid Technology Assessments, which are accessible introductions to different technology areas for policy makers."
        },
        {
            "text": "Identifying, explaining, and assessing emerging technologies that have potential to change the world is at the core of what we do in the Technology and Science Insights (TSI) team at the Government Office for Science. We enable policy teams to keep up to date with a rapidly evolving technology landscape and respond to potential risks and opportunities. Our data and expert insight support government departments to make better strategic decisions on science and technology."
        },
        {
            "text": "One of the ways we do this is through our Rapid Technology Assessments (RTAs), which give policymakers an accessible overview of a technology area:"
        },
        {
            "text": "Each assessment involves a range of academic, industry, and government experts from the UK and beyond. We combine their insight with our own analysis of international research and investment activity. Each RTA is thoroughly reviewed by these experts and undergoes analytical quality assurance before they are shared."
        },
        {
            "text": "RTAs have different uses depending on the topic. They can help us understand the likely potential of a technology and how close to being ready it is (for example, 4D Printing). Or they can summarise the latest developments in a technology already known to be important (such as Artificial Intelligence). The topics we choose for an RTA are based on our horizon scanning and the interests of other departments. We deliberately cover a wide range of technologies at different readiness levels. Our topic selection does not represent a policy view of priorities."
        },
        {
            "text": "Our recent RTAs cover topics including:"
        },
        {
            "text": "Read the summary reports."
        },
        {
            "text": "These reports have been produced over the last 2 years so there may now be more recent developments that these summaries do not cover. By sharing these RTAs we hope to work with experts to uncover new developments in these technologies and ultimately inform government policy."
        },
        {
            "text": "If you are a policymaker and think these emerging technologies could be important in your area please get in touch via emtech@go-science.gov.uk. If you are a researcher, industry expert, or investor and have ideas about further technologies we should look at, please get in touch too."
        },
        {
            "text": "Thank you to colleagues and experts who have donated their time and energy to this work over the last few years."
        }
    ]
}