{
    "url": "https://healthmedia.blog.gov.uk/2023/03/30/covid-ppe-media-fact-sheet/",
    "title": "Covid PPE - media fact sheet",
    "authors": [
        "dhscpressoffice"
    ],
    "categories": [
        "Coronavirus (COVID-19)"
    ],
    "pub_date": "2023-03-30T17:34:52+01:00",
    "content": [
        {
            "text": "The below is a media fact sheet setting out the government’s procurement of PPE to help protect health and care workers during the Covid pandemic."
        },
        {
            "text": "Why did the government procure so much PPE during the pandemic?"
        },
        {
            "text": "Our priority throughout the pandemic was saving lives – and we make no apology for erring on the side of caution and ensuring that the NHS had the PPE it needed to deal with the worst-case scenario. This meant we were able to keep our NHS open and protect as many people as possible."
        },
        {
            "text": "We acted swiftly to procure PPE at the height of the pandemic, competing in an overheated global market where demand massively outstripped supply."
        },
        {
            "text": "We ordered over 30 billion items during the initial response to the pandemic - and we have delivered over 25 billion items of PPE to frontline staff and other eligible users to keep them safe."
        },
        {
            "text": "How much PPE is currently in storage and how much does this cost? "
        },
        {
            "text": "We currently have around 5.8 billion items of excess PPE, which is equal to 15% of the total stock purchased."
        },
        {
            "text": "Since the height of the pandemic, PPE storage costs have reduced significantly and we continue to prioritise efforts to minimise them.  We have already reduced storage costs by 78% since the first three months of 2021. In January 2023 it cost approximately £564,000 per day to store PPE."
        },
        {
            "text": "To manage PPE stock, including any excess stock, we have put in place a management data system  track the volume of PPE items in stock."
        },
        {
            "text": " What is the government doing to reduce PPE stock?"
        },
        {
            "text": "We are taking action to save taxpayers’ money by reducing storage costs for excess stock"
        },
        {
            "text": "We continue to sell, donate, repurpose and recycle excess PPE in the most cost-effective way, as well as seeking to recover costs from suppliers wherever possible to ensure taxpayer value for money."
        },
        {
            "text": "During the pandemic we have, for example, donated masks to schools and have donated PPE to over 40 countries around the world, including Ukraine and Turkey."
        },
        {
            "text": "We are also exploring innovative solutions to reprocess excess PPE into materials or new products that have further uses."
        },
        {
            "text": "For example, following trials of recycling options, we recycled 23 million visors into plastic food trays and aprons have also been made into 'Bags for Life'. DHSC has also worked with Innovate UK’s Knowledge Transfer Network to invite proposals for innovative and sustainable solutions for managing excess stock."
        },
        {
            "text": "Where all other routes have been explored stock is being disposed of via recycling and energy from waste processes in ways to minimise environmental impact."
        },
        {
            "text": "Are you burning PPE? "
        },
        {
            "text": "We always prioritise other options such as selling, donating, repurposing and recycling."
        },
        {
            "text": "However, some excess PPE has been incinerated through ‘energy from waste’ processes, for example to generate electricity for the national grid. Where PPE has been disposed of via this way it replaces coal, which would generate higher carbon emissions."
        }
    ]
}