{
    "url": "https://dragonsden.blog.gov.uk/2023/03/30/dragons-den-episode-13-series-20/",
    "title": "Dragons' Den, Episode 13 Series 20",
    "authors": [
        "Kelsey Jones"
    ],
    "categories": [
        "Business",
        "International",
        "IP",
        "Patents",
        "Trade marks"
    ],
    "pub_date": "2023-03-30T21:05:52+01:00",
    "content": [
        {
            "text": "The Dragons had fire in their bellies tonight and didn’t hold back, leaving some entrepreneurs with their tails between their legs. I was however, pleased to watch such IP-rich conversations, which I’ll break down for any budding business owners looking to protect their assets."
        },
        {
            "heading": 2,
            "text": "Making them sweat "
        },
        {
            "text": "First into the Den was Theresa Pope, creator of Dandi London, a business that produces products to prevent embarrassment from involuntary bodily functions. These included a patch that absorbs moisture from under the arms, nipple covers and a hair removal device. Theresa was after £150,000 for a 30% investment and immediately took a grilling from the Dragons over Dandi’s turnover. The heat was turned up and Theresa sweated over the company’s net loss but managed to explain the reasons behind her large spend. Since the absorbent patch is a very technical product, Theresa wisely thought it best to apply for patent protection which covers the key ways in which it works. "
        },
        {
            "text": "This process is not quick and can take several years before you receive a granted patent. It also costs money, so you need to make sure that the potential benefit of a patent will outweigh the time, effort and money it takes to get and maintain one. We strongly advise you to seek legal advice before applying. "
        },
        {
            "text": "While all the Dragons decided against investing in Theresa’s business, she was praised by Peter Jones and Sara Davies for investing in the protection of a “brilliant product”. "
        },
        {
            "heading": 2,
            "text": "When one door closes, another opens "
        },
        {
            "text": "Next up in the Den were Mr and Mrs Siriwardana, inventors of the Handisure, a door guard created to protect little fingers getting injured by door. They asked for £60,000 for 8% of their business and reeled off some impressive accolades the product has received so far. The couple disclosed that they have an international patent pending and have already heard from the US Patent and Trademark Office that their application is likely to be accepted. When questioned about the “international patent”, they revealed that they are selling in 37 countries worldwide.  "
        },
        {
            "text": "It’s brilliant that they’ve already thought about overseas protection because IP rights are territorial. They only give protection in the countries where they are granted or registered. This means that if you only have UK protection, others may be allowed to use your IP abroad without infringing your rights. So, if you are thinking about trading overseas then you should always consider registering your IP rights there."
        },
        {
            "text": " "
        },
        {
            "text": "You can either file separate applications in individual countries or make use of an international process which allows you to file in several countries at once. You can protect your invention in many countries using the Patent Cooperation Treaty (PCT). You can read more about these procedures in our protecting your patent abroad guidance."
        },
        {
            "text": "Unfortunately, while the couple have kept on top of their IP protection, the Dragons weren’t sold on the idea. Peter Jones identified what he thought was a design flaw while Steven Bartlett worried that the product would be difficult to create a brand from it. "
        },
        {
            "heading": 2,
            "text": "What sets you apart? "
        },
        {
            "text": " For example, when you see a tick on an item of clothing, you instantly know that it’s owned by Nike and therefore trust that the product meets a certain standard. Creating a distinguishable brand also means that you can go on to sell it, franchise it or let other people have a licence that allows them to use it. "
        },
        {
            "text": "This episode wasn’t all bad news though. Congratulations to Bellybambino, award winning belly basket business that walked away with an investment from Touker Suleyman. "
        }
    ]
}