{
    "url": "https://insidehmcts.blog.gov.uk/2023/03/30/hosting-the-supreme-court-at-manchester-civil-justice-centre/",
    "title": "Hosting the Supreme Court at Manchester Civil Justice Centre",
    "authors": [
        "Lorraine Edgar - Cluster Manager, HMCTS"
    ],
    "categories": [
        "Civil",
        "Crime"
    ],
    "pub_date": "2023-03-30T11:32:37+01:00",
    "content": [
        {
            "text": "When Manchester Civil Justice Centre was chosen to host the highest court of appeal, I felt very proud that the city had been picked as the first place outside a UK capital to hold a Supreme Court sitting."
        },
        {
            "text": "It felt like a great opportunity to showcase the work of the Supreme Court to the people of Manchester and we hoped they would take the time to visit our court and listen to the hearings."
        },
        {
            "heading": 2,
            "text": "Years in the making"
        },
        {
            "text": "The story of how the Supreme Court came to Manchester started in 2019, when the court first approached HMCTS to make enquires about the possibility of sitting. However, the pandemic forced us to put the plans on hold until last summer."
        },
        {
            "text": "The Supreme Court hears cases of the greatest public or constitutional importance affecting the whole population. It also plays an important role in the development of UK law."
        },
        {
            "text": "While it was exciting to be chosen, HMCTS had never hosted the Supreme Court before so we were unsure of what we’d need to do."
        },
        {
            "heading": 2,
            "text": "Preparing for the sitting"
        },
        {
            "text": "Our first steps were to build a relationship with the Supreme Court, find out their needs and arrange a visit to Manchester to scope out the building."
        },
        {
            "text": "They needed a courtroom large enough to broadcast from and they would bring their own security team to manage the increased number of visitors."
        },
        {
            "text": "Making sure we had everything in place to broadcast proceedings was very important. As well as needing to be certain that we had the space to accommodate the broadcasting and fit all the cameras and equipment in, it was equally important that we had the digital capability to support it."
        },
        {
            "text": "We also had to keep in mind, of course, that we still had a responsibility to run our existing non-Supreme Court cases in the building that week and maintain the level of service that all court users would expect."
        },
        {
            "text": "This involved carefully balancing the need for the Supreme Court Justices to have rooms available for the valuable engagement work they wanted to do with court users and law students, while making sure we did not impact on cases that were already scheduled to take place."
        },
        {
            "heading": 2,
            "text": "A rise in visitors"
        },
        {
            "text": "President of the Supreme Court, Lord Reed, was joined at Manchester by 4 other Supreme Court Justices for the hearings that week."
        },
        {
            "text": "It became clear on the first morning that court 47 – the large courtroom we had provided for the sitting – would not be able to accommodate the volume of people who wanted to sit in and listen to the cases. The level of interest exceeded even our most ambitious of expectations."
        },
        {
            "text": "My team quickly arranged an overspill courtroom where people could watch the proceedings instead and it was soon full of members of the public and legal professionals."
        },
        {
            "text": "The 3 cases they heard were all from the north, which had clearly sparked local interest. The first case they heard, involving The Manchester Ship Canal Company, was specific to the city, so it was great that people could see the court dealing with issues local to their community."
        },
        {
            "heading": 2,
            "text": "Blueprint for the future"
        },
        {
            "text": "I’m delighted to say that the hard work and months of organising paid off and the sitting was a great success."
        },
        {
            "text": "The court was packed every day. Court staff welcomed almost 3,400 visitors to the court between 6 and 9 March, an increase of more than 700 when compared to footfall figure of 2,656 the following week.  "
        },
        {
            "text": "We were delighted that people had taken the opportunity to listen to proceedings that we’d worked so hard to prepare for. "
        },
        {
            "text": "This was testament to the dedicated and talented staff we have working at the Civil Justice Centre, and I’m immensely grateful to everyone who played their part to make it happen."
        },
        {
            "text": "I feel a real sense of pride that we were able to deliver for our partners at the Supreme Court. The Justices gave us positive feedback, saying they would like to come back to Manchester."
        },
        {
            "text": "We now have a blueprint for the future so that if the Justices approach HMCTS to sit at one of our sites again, we have the skills and knowledge to make the sitting another resounding success."
        },
        {
            "heading": 2,
            "text": "Great success"
        },
        {
            "text": "Supreme Court President Lord Reed said:"
        }
    ]
}