{
    "url": "https://ruralpayments.blog.gov.uk/2023/03/30/introducing-you-to-17/",
    "title": "Introducing You To...",
    "authors": [
        "RPA Editor"
    ],
    "categories": [
        "Countryside Stewardship",
        "Introducing You To"
    ],
    "pub_date": "2023-03-30T15:37:58+01:00",
    "content": [
        {
            "text": "Hello, my name is David Gale and I work in Countryside Stewardship (CS) Inspections. I work at the RPA’s Carlisle site, starting as a fresh-faced 20-year-old, and am now, 19 years later, a not so fresh-faced 39-year-old!"
        },
        {
            "text": "In my role I process the EU and Domestic Inspection findings after an RPA Field Officer (formerly Inspectors) has carried out a CS field visit."
        },
        {
            "text": "My role, along with the Field Officers, is to ensure that all the customer’s claim information is accurate. Field officers carrying out visits can help them ensure that future claims will be accurate and avoid any penalties or breaches."
        },
        {
            "text": "I’m responsible for applying the Field Officer’s findings and applying any reductions to claims in their agreement through the post payment adjustment process, and explaining this to the customer."
        },
        {
            "text": "There’s no typical day as we tend to do a bit of everything which adds to the variety. One day I could be processing the field visit findings and the next I could be doing verification or amendments. I love the variety of my work, and some of what we do is like a big puzzle that needs working out. We also have a good team of processors in Carlisle who work well together."
        },
        {
            "text": "The greatest impact my work has on the customer is helping them manage their environment correctly and helping them understand they will benefit financially if they keep all the information they give us as accurate as possible. Customers who get found satisfactory get the reassurance that they’re completing their information correctly. At the end of the day both we and the customer have the same end goal of ensuring all claims are correct and they get paid correctly."
        },
        {
            "text": "Prior to CS Inspections I worked on Basic Payment Scheme Inspections (physical and remote sensing) and I’ve also worked on Cross Compliance and legacy schemes such as the Single Payment Scheme (SPS) and going back further in time, the Integrated Administration and Control System (IACS), which really shows I’ve been here a while. Before that I worked in a department store primarily selling furniture, and then briefly as a data input clerk at Cumbria County Council."
        },
        {
            "text": " I live with my wife Tracey and my eight-year-old son Spencer and I love spending time with him. We live just north of the border in Scotland, a few miles north of Lockerbie in Dumfries and Galloway.  We spend a lot of time between our respective families in Carlisle and Lockerbie which certainly keeps us busy. I also like travelling about and visiting places, going to sporting events and concerts."
        },
        {
            "text": "Those that work with me know, that aside from my wife and son, my main passion is Carlisle United. I go to all the home games, and I did go to most of the away games, but since having Spencer I calmed this down to spend time with him. Outside work I’m also a Scottish Council member for Muscular Dystrophy UK. My involvement for the past 13 years comes from having one of the conditions that comes under this umbrella. I’ve won awards for campaigning and volunteering for the charity in the past - it’s a very worthwhile charity to fundraise for - which culminated in being invited to a Queen’s Garden party at Buckingham palace a few years ago."
        }
    ]
}