{
    "url": "https://cspl.blog.gov.uk/2023/03/30/leading-in-practice-reflecting-on-conversations-about-our-report/",
    "title": "Leading in Practice - reflecting on conversations about our report",
    "authors": [
        "Ewen Fergusson"
    ],
    "categories": [
        "Leadership",
        "Leading in Practice"
    ],
    "pub_date": "2023-03-30T11:01:15+01:00",
    "content": [
        {
            "text": "It has been two months since CSPL published Leading in Practice, and a good time to reflect on the initial conversations we have had with public servants about the report."
        },
        {
            "text": "Leading in Practice looks at how a range of organisations have approached building a working environment that supports and encourages people to live up to the ethical values reflected in the Principles of Public Life - and it is fair to say that it seems to have struck a chord. "
        },
        {
            "text": "We have already talked to hundreds of public servants at a range of staff events, held meetings with senior civil servants and non-executive directors of departments, attended conferences with public bodies and have been invited to many more events. Throughout, I have been enthused by the appetite among public servants to talk about promoting high ethical standards. "
        },
        {
            "text": "The feedback we’ve had is that people have really valued the opportunity and space to explore what it means to be guided by the ethical values in the Principles of Public Life and that this has prompted further reflection and discussion within teams. "
        },
        {
            "text": "This is music to my ears because stimulating discussion and action was the motivation for this piece of work. "
        },
        {
            "text": "We didn’t make formal recommendations on how to build an ethical culture as we recognise that there is no single right way to achieve this; instead, our report draws together insights and case studies from a range of organisations and shares these as a source of inspiration to others."
        },
        {
            "text": "We also included a set of 20 Questions for Leaders to prompt reflection. By considering questions such as, ‘how do people know you care about the Principles of Public Life?’ or ‘how do you ensure you are listening to the concerns of people in your organisation?’ or ‘is your staff training specific to the ethical risks and challenges faced by your organisation? leaders can determine for themselves what will work best. Our Chair, Lord Evans, wrote an open letter to public sector leaders with these questions."
        },
        {
            "text": "We hope that public sector organisations will continue to discuss what more they can do to encourage and support their people to uphold the Principles of Public Life as they go about their work in the public interest. And CSPL looks forward to discussing the report at future events.  "
        },
        {
            "text": "Download ‘Leading in Practice’ report. "
        }
    ]
}