{
    "url": "https://dcmslibraries.blog.gov.uk/2023/03/30/libraries-strategy-update/",
    "title": "Libraries Strategy Update",
    "authors": [
        "Nicole Agyekum, Libraries Team , DCMS"
    ],
    "categories": [
        "Library news"
    ],
    "pub_date": "2023-03-30T13:28:34+01:00",
    "content": [
        {
            "text": "Baroness Sanderson’s engagement work to support the development of a new government public libraries strategy is now well underway. In October she blogged on some of the visits she had made to start the work she is doing with us.  Since then she’s spoken to a variety of individuals and organisations, with still more on her list to come."
        },
        {
            "text": "In January, Baroness Sanderson began a series of 9 in-depth discussion sessions with a wide range of people – both within and outside the sector – looking at the successes of the sector as well as the challenges confronting it and possibilities for the future. These sessions are taking place in libraries all over the country from Ipswich to Leeds, focusing on one of the 7 strategic outcomes in Ambition, plus sessions on libraries governance and ‘blue sky thinking’."
        },
        {
            "text": "Emerging themes "
        },
        {
            "text": "So far, we have completed five sessions and have been really pleased with, and grateful for, the enthusiasm and commitment of attendees, including Arts Council, Libraries Connected, the Local Government Association and others, to the process and their readiness to contribute to an open and frank conversation.  The conversations have been wide ranging and thought provoking covering issues such as the need for improved data collection to better showcase the impact of public libraries, how libraries can most effectively  raise awareness of their local and national offer and the importance of seeing libraries as an investment rather than a cost."
        },
        {
            "text": "We’re looking forward to the final four sessions before Baroness Sanderson takes some time to reflect on them, along with all the things she learns from her wider  visits and meetings, before bringing a report and recommendations to the Libraries Minister on what might go into the next government public libraries strategy."
        }
    ]
}