{
    "url": "https://mojdigital.blog.gov.uk/2023/03/30/meet-the-super-women-in-tech-senior-operation-managers/",
    "title": "Meet the Super Women in Tech: Senior Operation Managers",
    "authors": [
        "Lindsay Hancock"
    ],
    "categories": [
        "Our services"
    ],
    "pub_date": "2023-03-30T18:00:10+01:00",
    "content": [
        {
            "text": "Closing Women’s History Month we have some fascinating stories of brilliant women here at Justice Digital who have had such amazing careers so far, and we are lucky to have them onboard!"
        },
        {
            "text": "Emma Clayton-Lloyd, Network Services - Senior Operations Manager "
        },
        {
            "text": "I have recently joined Justice Digital as a Senior Operations Manager. Previously, I worked as a supplier to MoJ being the first point of contact for MoJ for all requirements."
        },
        {
            "text": "One of the main things that attracted me to join the Justice Digital team was the diversity amongst all the teams. When I first started working with MoJ as a supplier, the industry was very male dominant, however, in the last 18 months or so, the drive to bring more women into technology has been apparent and the balance between the teams because of this is refreshing to be a part of."
        },
        {
            "text": "Being a woman in tech can often be daunting, however, at Justice Digital, this feeling doesn’t exist, as you are always made to feel welcome and that your opinion matters and you are listened to, which is the most important thing."
        },
        {
            "text": "I also love how approachable more Senior people are in the team, its almost like the managerial ‘hierarchy’ doesn’t even exist, which is very refreshing. I enjoy the vast opportunities available, whether it be Learning and Development, site visits to enable us to understand the challenges that our colleagues experience daily, which supports us with how we can improve the user’s experiences (as we are driven by users after all!) and that no two days in Justice Digital are the same. There are always new challenges presented to us, which is very exciting!"
        },
        {
            "text": "Paula D’Arcy, Network Services - Senior Operations Manager"
        },
        {
            "text": "I have over 20 years experience of working in technology. Past industries have included: broadcasting, education, housing, pharmaceutical before landing in Central Government. My roles have included, ServiceDesk Manager, IT Manager, Service Delivery Portfolio Manager."
        },
        {
            "text": "I joined the Justice Digital team in July 2020 in the End User Compute Space, right in the middle of Covid. The demand and shift of how people were functioning was to change to a remote way of working and I was very proud of being part of delivering this to all areas of the MOJ. It might sound cliché, but it is so rewarding to know what you are doing is making a difference and the people I work with are great. My current focus is working with the Evolve Portfolio."
        },
        {
            "text": "Natalie McKenna, Network Services - Senior Operations Manager"
        },
        {
            "text": "I am currently a Senior Operations Manager in the Networks Team having started about 7 months ago and here is a little bit of background into my journey here."
        },
        {
            "text": "I began my civil service career just over 22 years ago for HMCTS. When working as the Jury Officer at St Albans Crown Court I found the work that the Probation service did fascinating and applied to move into the Probation Service. I spent 17 years in the service progressing to a Probation Officer. I was excited when I saw this new role in Justice Digital advertised and wanted to be part of it."
        },
        {
            "text": "I was attracted to the Justice Digital team as it was a diverse, new, exciting and fast-growing team and I believed it could be the next step in progressing my career, while remaining committed to working in the MOJ."
        }
    ]
}