{
    "url": "https://defrafarming.blog.gov.uk/2023/03/30/the-green-finance-strategy-and-nature-markets-framework-what-they-mean-for-you/",
    "title": "The Green Finance Strategy and Nature Markets Framework: what they mean for you",
    "authors": [
        "The Team"
    ],
    "categories": [
        "Things we're doing"
    ],
    "pub_date": "2023-03-30T11:21:57+01:00",
    "content": [
        {
            "text": "Alongside government funding, there are a range of private sector opportunities for farmers and land managers to access new income streams to invest in their holdings. "
        },
        {
            "text": "We want farmers and land managers to be able to confidently and securely access payments from both the public and private sector for the environmental benefits they produce.  "
        },
        {
            "text": "Published today, the Nature Markets Framework and the new Green Finance Strategy, set out how government will enable this. "
        },
        {
            "text": "We want to continue working closely with farmers and land managers over the coming weeks and months to work through what this means for them. "
        },
        {
            "heading": 2,
            "text": "Our ambition "
        },
        {
            "text": "Alongside our new farming schemes, there are an increasing number of opportunities to access new funding streams through private nature markets.  "
        },
        {
            "text": "These include funding for carbon sequestration, improving water quality and enhancing biodiversity.  "
        },
        {
            "text": "We have set a target in England for private finance into nature’s recovery to reach over £1 billion a year by 2030."
        },
        {
            "text": "We know from talking to farmers that they have questions about how they can access and trust markets, how the environmental improvements will be measured and monitored, who potential investors might be, where advice can be found and what any changes might mean in the long term. "
        },
        {
            "text": "In this post, we’ll share the steps we are taking so that we can start to answer those questions in what is still, a developing area. "
        },
        {
            "heading": 2,
            "text": "Trusting and accessing markets  "
        },
        {
            "text": "The Nature Markets Framework sets out principles for how we expect new and developing nature markets to grow, so that they are fair, effective and accessible.  "
        },
        {
            "text": "It also introduces our work with the British Standards Institution (BSI) to develop a range of nature investment standards which provide clear rules for how farmers can access payments from nature markets.  "
        },
        {
            "text": "This seeks to build on the success of, and lessons learned from, other standards such as the Woodland Carbon Code and Peatland Code."
        },
        {
            "text": "Taken together, these will form the basis of a more robustly managed market, so that farmers and land managers can engage confidently with green finance opportunities and know that they will stand the test of time. "
        },
        {
            "heading": 2,
            "text": "Measuring and reporting environmental outcomes and emissions reductions "
        },
        {
            "text": "A lot of questions on private finance are about how farmers measure and report the benefits they deliver on their land. It is essential for farmers and investors to be clear on what is being bought and sold. "
        },
        {
            "text": "We know that better data can help farmers to get payments from nature markets. We are therefore testing how we support farmers to collect environmental data that can support them to understand the environmental opportunities on their farm.  "
        },
        {
            "text": "We confirmed today that we are developing a consistent approach for measuring emissions from farms. By 2024, we will set out how farmers will be supported to understand their emissions through carbon audits. "
        },
        {
            "heading": 2,
            "text": "Accessing advice and support "
        },
        {
            "text": "Accessing nature markets can be complicated and may be a new experience for most farmers. That is why we are looking at what further advice and support we can provide. "
        },
        {
            "text": "We have asked the Green Finance Institute (GFI) to develop an online toolkit to help farmers identify and access private payments for environmental benefits. "
        },
        {
            "text": "This builds on GFI’s Farming, Finance and Agrifood Working Group report and existing Investment Readiness Toolkit. We expect this to be available in summer."
        },
        {
            "text": " We are also looking at how farmers get advice to access nature markets from commercial sources. We are already supporting farmers to access advice through the Landscape Recovery development phase and are looking at how we facilitate collaboration through Countryside Stewardship.  "
        },
        {
            "heading": 2,
            "text": "Combining payments from public and private schemes "
        },
        {
            "text": "As we accelerate the roll out of the environmental land management schemes, farmers want to understand whether they can combine payments from public and private schemes. "
        },
        {
            "text": "As we set out last year, we want our public payments to complement nature markets so that together, we can do more. We will continue to design the environmental land management offer to make it easier for the private sector to identify where they can fund additional environmental benefits. For example, by being clear about how different schemes can and cannot be stacked. "
        },
        {
            "text": "Landscape Recovery projects are required to identify private funding streams to boost the outcomes they deliver. Through this we will further test how nature markets can work with public funds and provide examples of how farmers can access both sources of income and deliver more for the environment.     "
        },
        {
            "text": "We are also looking at how the environmental land management offer should adapt over time as markets develop so that farmers can continue to access better payments from the private sector into the future. "
        },
        {
            "text": "We will be clear what private sector income you can access alongside any public payments, and we will provide you with clarity on any changes, giving you plenty of time to plan and adjust.   "
        },
        {
            "heading": 2,
            "text": "Attracting investors "
        },
        {
            "text": "Supporting farmers to sell additional environmental benefits from nature friendly actions is only one part of the puzzle.  "
        },
        {
            "text": "We also need to get investors in the private sector interested and engaged in these new markets so that there is a ready stream of money available. "
        },
        {
            "text": "Our new Green Finance Strategy outlines how we intend to achieve the step change needed in private investment. This includes how we will get our world-leading financial services sector behind our climate and nature goals, and lever private investment into delivering them. "
        },
        {
            "text": "For example, we are investing £30 million of seed capital in the Big Nature Impact Fund (BNIF), which will attract private sector investment into a range of nature projects in England."
        },
        {
            "text": "We are also providing four pioneering local authority areas with funding of up to £1 million each as part of our Local Investment in Natural Capital (LINC) programme, which will be supported by the Environment Agency. They are: "
        },
        {
            "text": "These local authorities will work with partners to test ‘what works’ when it comes to attracting investment into local priorities for nature on the ground.    "
        },
        {
            "heading": 2,
            "text": "The tax treatment of environmental land use"
        },
        {
            "text": "We recognise the concerns about the tax implications of using land to produce environmental benefits that can then be sold for income.  "
        },
        {
            "text": "As announced at Budget 2023, government opened a consultation to gather the views of farmers, land managers, and investors, exploring elements of the tax treatment of nature markets and environmental land management.  "
        },
        {
            "text": "We encourage farmers and land managers to submit their views. "
        },
        {
            "heading": 2,
            "text": "Looking ahead "
        },
        {
            "text": "By guiding the development of nature markets and supporting farmers to access them, we can secure a resilient future for vibrant agricultural businesses that produce sustainable food and deliver environmental benefits. "
        },
        {
            "text": "If you have any questions about our approach or would like to share your thoughts, do comment below.  Don’t forget to subscribe to the Farming blog for updates. "
        }
    ]
}