{
    "url": "https://mhrainspectorate.blog.gov.uk/2025/08/08/fda-warning-letters/",
    "title": "FDA Warning Letters",
    "authors": [
        "Chris Jones",
        "Himal Makwana"
    ],
    "categories": [
        "GMP",
        "Good manufacturing practice"
    ],
    "pub_date": "2025-08-08T14:06:53+01:00",
    "content": [
        {
            "text": "This Blog relates to actions which licence holders should do following the issuing of USFDA Warning Letters. "
        },
        {
            "text": "The MHRA’s Inspection Action Groups (IAG) are responsible for recommending and implementing regulatory action against companies for breaches across all GxPs, and its Defective Medicines Report Centre (DMRC) provides an emergency assessment and communication system for manufacturers and regulatory authorities in regard to defective medicines. Click to find more information about the important roles that are performed by the IAG and DMRC."
        },
        {
            "text": "The IAG and DMRC regularly receives USFDA Warning Letters (also Official Action Indicated, OAI, and Import Ban letters) and contacts UK licence holders who may be implicated – e.g. in instances where a company in receipt of a letter may be a contract manufacturer or API supplier for a company who has medicines marketed in the UK."
        },
        {
            "text": "The MHRA has reviewed its current approach. IAG and DMRC note that these letters are in the public domain and takes the view all manufacturing and wholesale licence holders, as well as API (Active pharmaceutical ingredient) registration holders should be reviewing these warning letters as part of their ongoing quality assessment of suppliers and contract manufacturers. While technical agreements between third party suppliers should be sufficiently robust to ensure these are provided as a matter of course, IAG and DMRC regards it to be prudent to check as part of routine qualification and re-qualification activities."
        },
        {
            "text": "In future, MHRA will not be contacting licence holders as a matter of routine and companies should ensure they have measures in place to review and risk assess USFDA Warning Letters. Should this risk assessment require notification to MHRA then this could be via the DMRC (if medicines are defective) and to IAG (in regard to ongoing regulatory compliance). "
        },
        {
            "text": "The USFDA warning letters are informal and advisory. They are not an indication that action is going to be taken. The company in question can respond to the letter, the USFDA will review the response and may re-inspect or take other actions."
        },
        {
            "text": "See the FDA Warning Letters."
        },
        {
            "heading": 2,
            "text": "Contact"
        },
        {
            "text": "DMRC@mhra.gov.uk"
        },
        {
            "text": "IAGSecretariat@mhra.gov.uk"
        }
    ]
}