{
    "url": "https://dluhcdigital.blog.gov.uk/2023/03/23/15-council-led-projects-funded-to-scale-digital-solutions-which-aim-to-improve-citizen-engagement-within-the-planning-process/",
    "title": "15 council led projects funded to scale digital solutions which aim to improve citizen engagement within the planning process",
    "authors": [
        "Digital Planning"
    ],
    "categories": [
        "Digital Citizen Engagement",
        "Digital Planning",
        "PropTech"
    ],
    "pub_date": "2023-03-23T09:33:46+00:00",
    "content": [
        {
            "text": "We’re pleased to announce 15 more council-led projects have been awarded a total of £3.2 million of funding through Round 3 of the PropTech Innovation Fund. 27 Local Planning Authority (LPAs) are involved in the pilots, some of which see multiple LPAs working in partnership. "
        },
        {
            "text": "This next stage of the PropTech Innovation Fund will allow LPAs to build on previous rounds of funding which saw them develop and test solutions relating to the scalability, interoperability and visualisation of consultation data and digital engagement platforms."
        },
        {
            "heading": 3,
            "text": "The story so far: funding councils to scale the adoption of digital citizen engagement tools"
        },
        {
            "text": "The PropTech Innovation Fund has already supported 45 LPAs across Round 1, Round 2 and most recently through Continuous Funding. These projects have provided increasing evidence on how the adoption of Property Technology (PropTech) digital citizen engagement tools can increase the quantity and quality (diversity and representation) of community engagement. "
        },
        {
            "text": "There is also emerging evidence that digital platforms are helping to increase positive dialogue and support for planning, upskill planning officers and reduce officer time spent processing data. "
        },
        {
            "text": "However, as demand for these digital tools accelerates across LPAs, it is clear that adoption is hindered due to inconsistencies and a lack of standardisation of processing and visualisation of consultation feedback, as well as a lack of interoperability between new and existing platforms. "
        },
        {
            "text": "These current system inefficiencies not only restrict the scaling of new digital solutions and the efficiency of planning policy, but they also impact the ability of LPAs, industry stakeholders and communities to use data as a basis for developing a shared vision for local housing, planning and infrastructure."
        },
        {
            "heading": 3,
            "text": "Our ambition for Round 3 of the Fund"
        },
        {
            "text": "The most recent round of funding will allow LPA teams and their PropTech partners to work together to enhance  solutions which are helping to improve the visualisation and processing of consultation data, ensure digital engagement platforms are interoperable and scale their use. "
        },
        {
            "text": "The solutions being developed will help to reduce time and resources lost due to the current complex processing and packaging of consultation information generated from citizen engagement activities. They will also help to solve the challenges of data analysis, management, governance as well as make it easier to visualise and share data across stakeholder and communities networks."
        },
        {
            "text": "The LPAs who have been awarded funding represent a range of diverse planning teams, projects and opportunities to design digital solutions at scale and pace across the country, some of which are delivering their pilot as part of a joint project team with other LPAs. "
        },
        {
            "text": "The programme is taking a multifaceted approach to scale digital solutions which aim to improve digital citizen engagement within the planning process, for this reason the funded projects have been split into three cohorts. "
        },
        {
            "text": "Cohort 1 are trialling 3D, 4D, virtual reality (VR), augmented reality (AR) models and visualisation to ensure data driven decision making and transparency in planning"
        },
        {
            "text": "The successful LPAs are:"
        },
        {
            "text": "Nottingham City Council & Bradford Council: Funds awarded: £375,000"
        },
        {
            "text": "Cornwall Council: Funds awarded: £365,000"
        },
        {
            "text": "Southampton City Council: Funds awarded: £180,000"
        },
        {
            "text": "Wirral Council: Funds awarded: £325,050"
        },
        {
            "text": "Birmingham City Council: Funds awarded: £250,000"
        },
        {
            "text": "Cohort 2 are solving interoperability and lack of back office integration through developing application programming interfaces (APIs), platform integration and data standards and supplier collaboration "
        },
        {
            "text": "The successful LPAs are:"
        },
        {
            "text": "Epsom & Ewell District Council: Funds awarded: £250,000"
        },
        {
            "text": "London Borough of Newham: Funds awarded: £100,000"
        },
        {
            "text": "London Borough of Waltham Forest: Funds awarded: 99,000 "
        },
        {
            "text": "London Borough of Hounslow: Funds awarded: £30,000"
        },
        {
            "text": "Cohort 3 are working with statutory consultees and The Planning Inspectorate (PINS) to trial innovative approaches to process and package feedback and representations through the application of new technologies including artificial intelligence (AI) and natural language processing (NLP)"
        },
        {
            "text": "The successful LPAs are:"
        },
        {
            "text": "Harlow and Gilston Garden Town: Funds awarded: £295,000"
        },
        {
            "text": "Greater Cambridge Shared Planning: Funds awarded: £290,000"
        },
        {
            "text": "Bolsover District Council: Funds awarded: £238,800"
        },
        {
            "text": "London Boroughs of Richmond & Wandsworth: Funds awarded: £100,000"
        },
        {
            "text": "Cotswold & West Oxfordshire District Councils: Funds awarded: £50,000"
        },
        {
            "text": "South West Hertfordshire Joint Strategic Plan: Funds awarded: £325,000"
        },
        {
            "heading": 3,
            "text": "Staying up to date "
        },
        {
            "text": "Beyond supporting LPAs to make use of PropTech to improve digital citizen engagement, the DLUHC Digital Planning Programme aims to make plan making faster and more effective, give better access to planning data and improve planning software through initiatives like the Planning Data Platform and the Open Digital Planning project. "
        },
        {
            "text": "To stay up to date with the work of the programme, find out about future funding rounds and read more on policy developments, follow us on LinkedIn and Twitter, visit our website or sign up to receive our newsletter. If you have a specific question you can get in touch with the team via email. "
        }
    ]
}