{
    "url": "https://defrafarming.blog.gov.uk/2023/03/23/animal-health-and-welfare-grants-apply-now/",
    "title": "Animal Health and Welfare grants: apply now",
    "authors": [
        "The Team"
    ],
    "categories": [
        "Payments to improve animal health and welfare"
    ],
    "pub_date": "2023-03-23T14:17:56+00:00",
    "content": [
        {
            "text": "We recently blogged to introduce Animal Health and Welfare grants.  "
        },
        {
            "text": "These grants, of between £1,000 and £25,000, go towards the cost of items from a list which are designed to improve the health and welfare of your livestock.  "
        },
        {
            "text": "We're very pleased to say that the window for this first round is now open. It will remain open for 12 weeks. The deadline is 15 June at midday."
        },
        {
            "text": "In this post, we'll share more about the grant, why you might want to consider it and how to apply."
        },
        {
            "heading": 2,
            "text": "Support that makes a real difference for animals and for farmers  "
        },
        {
            "text": "These grants are offered through the Farming Equipment and Technology Fund.  They represent the next step on the Animal Health and Welfare Pathway. Just like other parts of the Pathway, it has been developed through careful co-design with farmers, academics, vets and industry groups. "
        },
        {
            "text": "So, if you are a livestock farmer who keeps cattle, pigs, sheep, broiler chickens or laying hens, this is a great opportunity to get some funding towards the cost of items that will help improve the health and welfare of your livestock. "
        },
        {
            "text": "Not only is that good for the animals, it's a way to improve both productivity and profitability. "
        },
        {
            "text": "John Reed, a livestock farmer, non-executive director of Avara Foods and member of the Animal Health and Welfare Board for England, chaired the co-design group that developed the list of items. He shared some thoughts about the process.  "
        },
        {
            "text": "This close work with our partners has produced a wide and varied list. With over 100 items on offer, (many of which are new for this round of the Farming Equipment and Technology Fund), this presents a great opportunity for farmers. John told us: "
        },
        {
            "heading": 2,
            "text": "Before you apply"
        },
        {
            "text": "If you’re interested in the grant, take a look at the list of eligible items and consider having a chat with your vet. They'll be able to offer advice on the items which best address the specific health and welfare challenges on your farm."
        },
        {
            "text": "Before making an application, read the official grant guidance on GOV.UK.  It sets out the eligibility criteria and the steps you need to follow."
        },
        {
            "heading": 2,
            "text": "How to apply "
        },
        {
            "text": "Once you are ready to make an application, you can can apply through the online portal."
        },
        {
            "text": "We will offer Animal Health and Welfare grants every year throughout the Agricultural Transition. "
        },
        {
            "text": "We will keep the feasibility of further application windows in 2023/2024 under review as we assess levels of demand. We'll publish information about future rounds in the summer.   "
        },
        {
            "text": "Don't forget that applications for the Productivity and Slurry theme of the Farming Equipment and Technology Fund (FETF) will close on 4 April. So, make sure you submit your application in time. "
        }
    ]
}