{
    "url": "https://defencedigital.blog.gov.uk/2023/03/23/definitive-guidance-for-digital-services/",
    "title": "Definitive guidance for digital services",
    "authors": [
        "G.Brown",
        "M.O'Donaghue."
    ],
    "categories": [
        "Digital Foundry"
    ],
    "pub_date": "2023-03-23T15:04:02+00:00",
    "content": [
        {
            "text": "The Digital Strategy for Defence makes it clear that: “people and process are as vital as tech for successful digital change”. To innovate the way Defence works, people need clear guidance that they can rely on and access easily."
        },
        {
            "text": "There’s some great guidance on GOV.UK but it can be difficult to apply in Defence. We’ve also identified other issues across Defence. "
        },
        {
            "text": "Teams in the Content and Transaction Service (CTS), part of the Defence Digital Foundry, are trying to solve these problems. "
        },
        {
            "heading": 2,
            "text": "A service manual for digital teams across Defence."
        },
        {
            "text": "The first version of the Defence Service Manual is live. It sits alongside guidance on GOV.UK, rather than copying it. The manual includes work previously done by the Royal Navy and the Royal Air Force."
        },
        {
            "text": "In user research sessions, participants tell us that they need to point to definitive guidance: “this is the way it is done in Defence”. "
        },
        {
            "text": "In the Defence Service Manual, you’ll find guidance on:"
        },
        {
            "heading": 2,
            "text": "Helping you do your role in Defence"
        },
        {
            "text": "Service and interaction designers can find guidance on starting with simple designs, using the right styles and designing for safety. "
        },
        {
            "text": "Anyone creating content for digital services can check how we write for users, deal with acronyms and pair write with experts."
        },
        {
            "text": "If you’re doing user research, there’s a section covering everything from finding participants to storing data correctly. You’ll also find links to useful templates, like the MOD consent form."
        },
        {
            "text": " "
        },
        {
            "text": "You can also check how to join your community of practice, when community calls are held and how to ask for advice."
        },
        {
            "text": "As one user told us: “I’ve now found the right Defence Slack channel to post this question to, because of the Defence Service Manual. That’s very cool. Thanks.”"
        },
        {
            "heading": 2,
            "text": "We’re working on more guidance"
        },
        {
            "text": "So far, we’ve identified 42 areas where digital teams need Defence-specific guidance. We’ve met 27 of these needs with published guidance. We’re working on the rest and discovering more."
        },
        {
            "text": "To create new guidance we look at policy, audit existing guidance and run workshops with communities of practice. If you’re in the data, technology or architecture community in Defence, we’d like to talk to you about the guidance you need. Please get in touch."
        },
        {
            "heading": 2,
            "text": "Get involved"
        },
        {
            "text": "It’s your manual and we’ve only just started. We’d like you to suggest content, tell us what’s missing and what we can improve. Use the feedback links in the Defence Service Manual."
        },
        {
            "text": "You can also take part in user research. If you can spare just one hour, you’ll help us create better guidance for everyone."
        },
        {
            "text": "Anyone working in Defence is also welcome to join our monthly show and tells. Get in touch and ask for an invitation."
        }
    ]
}