{
    "url": "https://dragonsden.blog.gov.uk/2023/03/23/dragons-den-episode-12-series-20/",
    "title": "Dragons’ Den, Episode 12 Series 20",
    "authors": [
        "Kevin Bartle"
    ],
    "categories": [
        "Business",
        "Patents",
        "Trade marks"
    ],
    "pub_date": "2023-03-23T21:05:43+00:00",
    "content": [
        {
            "text": "Joining the Dragons this week were golfing wizards, beauty elixirs, potions and gargoyles. As a patent examiner, I was particularly interested in the first pitch in this week’s episode, so let’s dive straight in..."
        },
        {
            "heading": 2,
            "text": "Glowing from within"
        },
        {
            "text": "First up in the Den was a very nervous Caroline Sims, who was looking for an investment of £60k in return for a 10% stake in her plant-based beauty remedy business, “Botanycl”. Caroline’s product had a USP in that the product addresses the root cause of many skin and hair problems, a hormonal imbalance, from within the body."
        },
        {
            "text": "Deborah Meaden felt uneasy about how the product might stand out in a crowded market and declared that she was out. Whilst this could have knocked Caroline’s confidence, things got considerably better as all the other Dragons decided to make an offer, albeit for more equity than Caroline had initially offered."
        },
        {
            "text": "After some deliberation, Caroline asked Peter Jones and Steven Bartlett if they would be willing to join forces as she saw the potential in Peter’s ability to open doors, coupled with Steven’s online marketing prowess. They were both happy to enter into such an arrangement, and Caroline’s growing confidence meant she was able to knock down the equity being offered, with a guarantee that the Dragons would see a return from their investment within 18 months."
        },
        {
            "text": "The outcome was that Caroline got Peter and Steven on board, securing the full £60k for 20% of her business."
        },
        {
            "heading": 2,
            "text": "Granted IP rights help negotiations run smoothly"
        },
        {
            "text": "The interest in Caroline’s business and products will no doubt have been helped by the fact that she already holds a granted patent for her plant-based skin remedy. From the point of view of an investor, there can be quite a difference between an inventor having applied for a patent (and therefore having a “patent pending”) and having a granted patent. The latter having been examined by a patent examiner, who will have searched for similar inventions and is satisfied that what’s in the patent is novel and inventive. A granted patent puts the inventor in a strong position, as there is certainty around what their patent covers, and therefore what a competitor is allowed to do."
        },
        {
            "text": "To find out more about trade marks and how a brand can add value to your business, watch our short video:"
        },
        {
            "heading": 2,
            "text": "Sweet investment for chocolate producers"
        },
        {
            "text": "Next up were Steve Victor and Hamza Shah, who were offering 10% equity in their business “My Chocolate Shop” for a £40k investment. After the Dragons drilled down into the business, it became apparent that what the chocolatiers were looking for investment in, was actually an extension of an already successful business which involved Steve’s brother. As Peter Jones put it, “it’s like you’ve come in and pitched an idea for Charlie and the Chocolate Factory, but you’ve left Charlie at home”."
        },
        {
            "text": "Whilst Steve and Hamza did mention that they would own any intellectual property that came out of the side business, this was not enough to convince four of the Dragons that this was a business they could invest in. Things got sweeter for the pair, however, when Sara Davies said that she was keen to add a chocolate business to her portfolio. Despite the issues that had been discussed, Sara offered all of the money for a 30% share of the business. Although Steve and Hamza briefly considered negotiating to a lower equity level, they decided to go with what was on offer."
        },
        {
            "heading": 2,
            "text": "Investment slipped out of grasp"
        },
        {
            "text": "Leaving the Den without success this week was Lisa Hickey and her “Grip + Glow” products, which offer moisturisation whilst also providing grip for pole fitness enthusiasts. Lisa was looking for £30k in return for 10% of her business but the Dragons felt that the product may be too niche and declined to invest after Lisa failed to get to grips with her figures."
        },
        {
            "heading": 2,
            "text": "No spell for success"
        },
        {
            "text": "Also walking away without investment tonight were Ben Fry and Phil Pinder who, along with Grobblenook the gargoyle, were looking for investment to help them expand their wizard-themed crazy golf enterprise, “The Hole in Wand”. After four of the Dragons dropped out, it was left to Peter Jones to come through with an unexpected offer after he had been impressed with the duo’s initial figures. Ben and Phil had offered 5% for a £200k investment, and for such an investment Peter wanted a third of the business – which proved to be a gap that the two parties were unable to bridge."
        }
    ]
}