{
    "url": "https://governmentscienceandengineering.blog.gov.uk/2023/03/23/gse-leadership-value-inclusive/",
    "title": "GSE Leadership Values: Inclusive",
    "authors": [
        "Dr Shabana Haque"
    ],
    "categories": [
        "Blog Series",
        "Talent & Leadership"
    ],
    "pub_date": "2023-03-23T16:09:51+00:00",
    "content": [
        {
            "text": "My career journey hasn’t exactly been linear. I’ve worked inside and outside government, as a deep specialist, and in several science policy and non-technical policy roles, despite this I always have, and probably always will, describe myself as a scientist. This may seem odd, as I studied and trained in chemistry, frankly quite a long time ago. Science is integral to who I am, just as being a woman of colour and from an ethnic minority background are important parts of my identity. Inclusion starts with a respect of identity and recognition; how people define themselves professionally and personally and is different for everyone.   "
        },
        {
            "text": "The GSE Leadership “inclusive” Value talks about respecting a range of expertise and seeking a diversity of perspectives. My experiences and identity, shape who I am, and influence how I approach life and work, but I am fully aware that these experiences and insights are my personal and narrow lens, a partial view, and to provide the best evidence-based advice to Ministers requires a diverse, multiple views, perspectives, backgrounds, knowledge, which for me begins with creating diverse and inclusive teams. The GSE leadership values give me chance to take stock, reflect on what more I can do to role-model inclusive behaviours and to ensure underrepresented groups across the profession and wider Civil Service feel valued and supported. "
        },
        {
            "text": "A few years ago, I chose to take a role outside of government, at the Royal Academy of Engineering one of the four National Academies, to challenge my own thinking beyond my own traditional science background and learn more about the engineering mindset and systems thinking. It was a very rewarding experience. I learnt how engineering can help to optimise systems by framing/defining a problem in a different way, how it can spark creative/collaborative problem solving, encourage evidence gathering that draws upon the widest, most diverse and critical perspectives, and create a “bigger picture view”, with new/different ideas for tackling societal challenges on net zero, biodiversity loss, health inequalities, and economic growth and security. "
        },
        {
            "text": "It is great to see that this systems approach is captured in the GSE leadership “inclusion” standards. It is something I strongly encourage my teams to do, through our ways of working, testing their ideas with independent external experts and with those from opposing viewpoints, and convening systems/multi and cross-discipline thinkers, as well as domain/deep experts, to help us understand how the whole system/policy connects and functions. "
        },
        {
            "text": "It can be easy win for the profession to say it is being inclusive because it champions the use of external experts, but this ignores a much deeper point, about the ability to create and sustain an inclusive profession and Civil Service, that is fit for the future. These GSE leadership values are good start for all of us. As leaders we all have a duty to ensure that those from underrepresented groups that might otherwise be excluded or marginalised, feel recognised, feel confident to participate and feel able to contribute their ideas and experiences without judgement.   "
        },
        {
            "text": "Dr Shabana Haque, OBE. 12th Feb 2023 "
        },
        {
            "text": "Deputy Director Research Infrastructure, Security and Position, Navigation and Timing (PNT) "
        },
        {
            "text": "Department for Science, Innovation and Technology (DSIT) "
        }
    ]
}