{
    "url": "https://educationhub.blog.gov.uk/2023/03/23/how-were-helping-people-get-into-a-career-in-construction/",
    "title": "How we’re helping people get into a career in construction",
    "authors": [
        "mediaofficer"
    ],
    "categories": [
        "Apprenticeships",
        "Skills",
        "T Levels"
    ],
    "pub_date": "2023-03-23T10:48:18+00:00",
    "content": [
        {
            "text": "We’re working with industry leaders and other government departments to help more people access high-quality training and careers in construction."
        },
        {
            "text": "From T Levels to apprenticeships to Skills Bootcamps, there are many routes into a job in construction for people of all ages. Whether you’re looking for post-16 training options, or thinking of getting back into work later in life through a ‘returnership’, there is a pathway for you."
        },
        {
            "text": "Here’s what we’re doing to support the construction industry with our gold-standard programmes."
        },
        {
            "heading": 3,
            "text": "How can T Levels help with a career in construction?"
        },
        {
            "text": "T Levels are available for 16 to 19-year-olds when they leave school. T Levels are the gold standard vocational course, and a high-quality alternative to A levels."
        },
        {
            "text": "One T Level is worth the same UCAS points as three A Levels. They are two-year programmes with 80% of time spent in the classroom and 20% on a minimum nine-week industry placement with an employer."
        },
        {
            "text": "T Levels students can opt for one of three specialised T Level courses in construction:"
        },
        {
            "text": "Kinnari Khodiara took a T Level course in Design, Surveying and Planning."
        },
        {
            "text": "After an industry placement with Sandicliffe, a mechanic in Leicester, she has been offered a an apprenticeship: \"T levels are a great way to learn and get hands on with a job."
        },
        {
            "text": "\"I would definitely recommend T levels as you gain an understanding of what needs to be done in the industry you’re about to work in and how a real business works day to day.\""
        },
        {
            "heading": 3,
            "text": "How can an apprenticeship help with a career in construction? "
        },
        {
            "text": "People of all ages can do an apprenticeship. An apprenticeship is a paid job where you benefit from structured training whilst gaining valuable workplace experience."
        },
        {
            "text": "Alongside your on-the-job training, as an apprentice, you will spend a minimum of six hours a week on average in off-the-job training with a provider, such as a college or university."
        },
        {
            "text": "We’ve also introduced Flexi-Job Apprenticeships, which make it easier for employers in industries like construction where work is short-term and project-based, to hire apprenticeships."
        },
        {
            "text": "From Level 2 apprenticeships in painting and decorating, to degree apprenticeships in quantity surveying, there are over 90 types of apprenticeship available within the construction industry. Browse options in your area here."
        },
        {
            "text": "Archie Curtis did an apprenticeship in site management after completing a T Level in construction: “It feels good to be doing an apprenticeship."
        },
        {
            "text": "\"I am able to learn through a part-time college course and get my Higher National Certificate qualification, as well as gaining first-hand experience out on site, getting a deeper insight into my future job role, and developing other communication skills, whilst earning.\""
        },
        {
            "heading": 3,
            "text": "How can Skills Bootcamps help with a career in construction?"
        },
        {
            "text": "Skills Bootcamps are for adults aged 19 or over who are full-time or part-time employed, self-employed or unemployed, as well as adults returning to work after a break."
        },
        {
            "text": "There are Skills Bootcamps around the country that offer courses in different areas of construction like retrofit installation, insulation, and scaffolding. For most Skills Bootcamps, no previous knowledge in the subject is needed, just the willingness to learn new skills."
        },
        {
            "text": "Skills Bootcamps are free and designed in partnership with local employers to help fill job vacancies in your area. These flexible courses last up to 16 weeks and allow you to gain the in-demand skills employers are looking for, with the offer of a job interview on completion."
        },
        {
            "text": "Find a Skills Bootcamp in your local area here."
        }
    ]
}