{
    "url": "https://childrenssocialcare.blog.gov.uk/2023/03/23/the-step-up-to-social-work-journey/",
    "title": "The Step Up to Social Work journey",
    "authors": [
        "Isaac - Step Up graduate"
    ],
    "categories": [
        "Celebrating social work",
        "Leadership",
        "Social Work Week",
        "Step Up to Social Work",
        "World Social Work Day"
    ],
    "pub_date": "2023-03-23T15:58:08+00:00",
    "content": [
        {
            "text": "Step Up to Social Work is a full-time training programme for talented graduates and career changers to become the next generation of child and family social workers supporting vulnerable children, young people and families. "
        },
        {
            "text": "Isaac who joined the Step Up to Social Work programme in January 2022 and graduated this year, shares his journey to becoming a social worker and advice for others on the programme or those thinking of joining."
        },
        {
            "text": "My previous job was in the British Red Cross refugee service, where I provided refugees, asylum seekers with advice, advocacy and support. I also worked with survivors of human trafficking and exploitation, supporting them to access relevant support and to challenge negative decisions."
        },
        {
            "text": "I really enjoyed the front-line, people-centric aspects of my role and wanted to continue this. I found out about the Step Up programme through a colleague who was a social worker and she encouraged me to apply. The programme offered me the opportunity to continue supporting vulnerable people, while also providing me with exponential career growth."
        },
        {
            "text": "Undertaking Step Up has genuinely been one of the best decisions I’ve made. The programme is very well structured and eases participants into social work. The blended nature of study and practice is also beneficial and the staff at my university make the classes interactive, engaging and thought-provoking."
        },
        {
            "text": "I have enjoyed applying research and academia to practice. My tutors and staff on placement encourage this during placement , as it helps you to think about the wider context when working with families. You are able to analyse how policy, and legislation affects families and how as social workers we can support those who are vulnerable. I have found myself enjoying applying research and academia to practice and taking a theoretical, critically analytical approach has genuinely made me a better social worker."
        },
        {
            "text": "There is a strong focus within the programme and on placement around anti-discriminatory practice and ensuring that it is at the centre of social work. It has never been more important to think about how people are affected by class, race and gender difference and to work to support them through our practice. One key point of learning for me was around intersectionality. I have used this learning to support those who are more vulnerable to discrimination due to unique characteristics."
        },
        {
            "text": "The pace of the course is a challenge - it is an intensive 14 months where you are frequently studying whilst working. I found it challenging at first but I’ve learnt to become well organised, which ultimately is a life skill needed for social work! If you throw yourself into the course and give it your best, I guarantee you will enjoy it."
        },
        {
            "text": "Step Up supports and nurtures you before placement to ensure that you are ready which I found really important. There are always people on hand for advice and support which is also helpful. The course offers you the chance to develop essential skills and attributes required to become a social worker and you will leave well prepared for a role working in social care."
        },
        {
            "text": "Ultimately, I feel I am really making a real difference and so I would, without a doubt, recommend the course to others."
        },
        {
            "text": " "
        },
        {
            "text": "Further information"
        },
        {
            "text": "The Step Up to Social Work programme is an opportunity to receive support while you are training to start a new career in social work."
        },
        {
            "text": "On the 14-month training programme, you will receive hands-on experience of working in a real-life social work role through placements in a local authority whilst undertaking your qualification. Once you’ve successfully completed the course, you’ll be awarded a Postgraduate Diploma in Social Work enabling you to apply to register and practice as a social worker."
        },
        {
            "text": "The Department for Education covers the cost of your university tuition on the programme and provides a tax-free bursary of £19,833 to support you during your training."
        },
        {
            "text": "Applications are currently open for 2024 – head to Home | Step Up to Social Work (pocketrecruiter.com) for more information"
        },
        {
            "text": "Further information about how you can become and child and family social worker is on the Education Hub."
        }
    ]
}