{
    "url": "https://educationhub.blog.gov.uk/2023/03/23/what-are-the-latest-rules-around-covid-19-in-schools-colleges-nurseries-and-other-education-settings/",
    "title": "What are the latest rules around COVID-19 in schools, colleges, nurseries and other education settings?",
    "authors": [
        "Media Officer"
    ],
    "categories": [
        "Coronavirus"
    ],
    "pub_date": "2023-03-23T09:19:56+00:00",
    "content": [
        {
            "text": "This article was first published on 14 December 2022. "
        },
        {
            "text": "Since March 2022 when the final Covid restrictions were lifted the UK Health and Security Agency (UKHSA) has advised that COVID-19 should be managed like other respiratory infections, such as flu."
        },
        {
            "text": "COVID-19 presents a low risk to children and young people. This, combined with high vaccination rates in the population, means there are no longer specific rules relating to COVID-19 in schools, colleges, childcare and other education settings."
        },
        {
            "text": "Here’s what you need to know."
        },
        {
            "heading": 3,
            "text": "What happens if a staff member or my child tests positive for COVID-19?"
        },
        {
            "text": "For children and young people aged 18 and under who test positive for COVID-19, the advice is to try to stay at home and avoid contact with other people for three days. This is because children and young people tend to be infectious to other people for less time than adults."
        },
        {
            "text": "Adults with a positive COVID-19 test result are advised to try to stay at home and avoid contact with other people for five days, which is when they are most infectious."
        },
        {
            "text": "The UKHSA has also published public health guidance on living safely with respiratory infections, including COVID-19."
        },
        {
            "heading": 3,
            "text": "Who can still test?"
        },
        {
            "text": "As individuals are now mixing in an open society, regular testing within a setting is no longer as effective as it once was. Instead, the most effective protection against severe disease from COVID-19 for everyone, including those at higher risk from COVID-19, is to get vaccinated."
        },
        {
            "text": "People at risk of serious illness from COVID-19 will continue to get free tests to use if they develop symptoms, along with NHS and adult social care staff and those in other high-risk settings. Local Health Protection Teams (HPT) may implement outbreak testing for specific settings at their discretion."
        },
        {
            "text": "Public health guidance on the actions people with symptoms of a respiratory infection should take to help reduce the risk of catching COVID-19 and passing it on to others is available."
        },
        {
            "text": "Vaccines remain our best weapon against this virus. By getting vaccinated, children, young people and staff can increase their protection against COVID-19."
        },
        {
            "text": "Resources, including immunisation guidance are available for parents and young people, which can be found here."
        },
        {
            "heading": 3,
            "text": "What measures should schools be taking to stop the spread? "
        },
        {
            "text": "As well as following the UKHSA guidance signposted, all settings should have in place baseline infection prevention and control measures that will help to manage the spread of infection:"
        },
        {
            "heading": 3,
            "text": "Should schools provide remote education for pupils who have COVID-19?"
        },
        {
            "text": "Schools should consider remote learning for pupils that do test positive for COVID-19 but who feel well enough to learn but are following advice to stay at home and avoid contact with other people for three days."
        },
        {
            "heading": 3,
            "text": "What is in place to help children catch up if they miss school?"
        },
        {
            "text": "We’ve made nearly £5 billion available to help children and young people to recover from the impact of the pandemic, including over £1 billion for the National Tutoring Programme, which has revolutionised the way targeted support is provided for the children and young people who need it the most. Over two million courses have started through the programme, including in areas with high proportions of children in receipt of pupil premium funding, such as parts of Yorkshire & the Humber and the North West."
        }
    ]
}