{
    "url": "https://ipo.blog.gov.uk/2023/03/23/what-is-user-research-and-why-is-it-so-important/",
    "title": "What is user research and why is it so important?",
    "authors": [
        "Lauren Warchol"
    ],
    "categories": [
        "Innovation",
        "Transformation",
        "User research"
    ],
    "pub_date": "2023-03-23T10:30:14+00:00",
    "content": [
        {
            "text": "In March last year, I joined the Intellectual Property Office’s (IPO) User Research team as the Research Support Manager. In preparation for my role, I read all I could about user research. However, it took a while to get to grips with all the jargon and to fully understand exactly what user research was and why it was so important."
        },
        {
            "text": "That’s when it struck me! I was doing the job five days a week and yet we expected IPO customers to understand what user research was and what we wanted from them, just by asking them to participate."
        },
        {
            "text": "So, I thought I would give an overview of what the IPO truly means when we ask you to participate in user research, and why it would benefit us all."
        },
        {
            "heading": 2,
            "text": "Defining user research"
        },
        {
            "text": "Every service and product in the country has a user. But how do we know exactly what our users need and if our systems are working for them? That’s where user research comes in. It enables us to engage with our customers and tailor our services to suit their needs."
        },
        {
            "text": "User research is about understanding users behaviours, needs, and motivations (why they act in a certain way). This is done through observation techniques, task analysis and other feedback methods."
        },
        {
            "heading": 2,
            "text": "Who can get involved?"
        },
        {
            "text": "The answer is, everyone! Some people think we’re only interested in the opinions of the top IP law firms or inventors with hundreds of registered rights. This isn’t true."
        },
        {
            "text": "Our user researchers speak to a vast range of individuals, whether they already own a patent, trade mark, or design or are just beginning their intellectual property journey. Amongst those people are individuals who have disabilities or low digital skills; it is important to us that everyone who interacts with the IPO can access and use our services. Wherever you are on your IP journey, we are interested in your feedback."
        },
        {
            "text": "This is especially important during the midst of our ‘One IPO’ Transformation programme, where we are undergoing the biggest modernisation ever of our IP systems."
        },
        {
            "text": "By getting involved with our user research at this significant time, you will be helping to shape and improve the IPO’s services for the future, for you and others like you."
        },
        {
            "heading": 2,
            "text": "So I'd like to help...but what is the user panel?"
        },
        {
            "text": "Our user panel is simply a list of people who are happy to be contacted when a user researcher needs to organise research. In the case of the IPO, we ask that each member of our panel take a short survey, which you can find at the bottom of this blog."
        },
        {
            "text": "The survey helps us keep track of who we’re speaking to and tailor each session to you and your IP. The information you provide is not shared with third parties and is never used for marketing purposes."
        },
        {
            "text": "The IPO may contact you about your availability to participate in a research activity. The format of these activities may include:"
        },
        {
            "heading": 2,
            "text": "What to expect from a user research session"
        },
        {
            "text": "The User Research team is currently focusing on testing One IPO Transformation services through meetings with our users. Carried out through Microsoft Teams, these meetings typically run between 60-90 minutes and include conversations in a 1:1 setting. During this time you may be asked about your interactions with our existing services, and what you might expect from future services. We may also ask you to test partial or full prototype/trial services, guidance pages, or other content."
        },
        {
            "text": "Before each session, you will be sent our recording release form which lays out your data rights, how we intend to use your data, and how it will be stored. Before the session begins, our user researcher will confirm with you whether you agree to be recorded. We also occasionally have a separate team member observing sessions or helping us to take notes – if you are uncomfortable with this however, just let us know when booking a session."
        },
        {
            "text": "You shouldn’t need to prepare for a session unless we ask you to complete a survey ahead of time. We would simply like you to arrive to the meeting ready to answer our questions on the service we are testing!"
        },
        {
            "heading": 2,
            "text": "Interested in participating?"
        },
        {
            "text": "Hopefully user research is less daunting now all that is explained, but if you’re unsure about anything, you can email us at UserTesting@ipo.gov.uk where the team is always happy to answer any questions."
        }
    ]
}