{
    "url": "https://insolvencyservice.blog.gov.uk/2023/03/23/what-am-i-expected-to-do-when-im-in-an-iva/",
    "title": "What am I expected to do when I’m in an IVA?",
    "authors": [
        "mediaofficer"
    ],
    "categories": [
        "Debt management",
        "Individual Voluntary Arrangement"
    ],
    "pub_date": "2023-03-23T12:17:07+00:00",
    "content": [
        {
            "text": "An Individual Voluntary Arrangement (IVA) is a formal debt solution available to you if you are insolvent – that is, unable to pay your debts."
        },
        {
            "text": "More information about what an IVAs is and whether it could be right for you can be found here: What you need to know about Individual Voluntary Arrangements (IVAs) - Insolvency Service (blog.gov.uk)."
        },
        {
            "text": "If an IVA is recommended for you after seeking advice, it’s important to know what your responsibilities are."
        },
        {
            "text": "Here we provide information about what you are expected to do if you have an IVA."
        },
        {
            "heading": 3,
            "text": "Your proposal "
        },
        {
            "text": "If you choose to apply for an IVA, you will work with your Insolvency Practitioner on a proposal. Your proposal is a legal document that is written by the Insolvency Practitioner on your behalf, but you are the person agreeing to it."
        },
        {
            "text": "The proposal will explain who you owe money to (your creditors), how you came to owe it, and what you can afford to pay each month in repayments."
        },
        {
            "text": "The proposal will set out to your creditors how much will be repaid to them and how much will be taken as a fee by the Insolvency Practitioner for managing your IVA for you."
        },
        {
            "text": "In many cases, your Insolvency Practitioner will follow the IVA Protocol. This is an agreement in which IVA providers and creditors pledge to use standard forms, terms and conditions to make the process easier and simpler."
        },
        {
            "text": "If your case is more complicated, for example if you own a business, a “protocol IVA” may not be right for you. If that is the case, your Insolvency Practitioner will agree a proposal with you that is specific to your personal situation. This is called a bespoke IVA."
        },
        {
            "text": "The information below applies to protocol IVAs. Where you have a bespoke IVA, some of the terms may be different and you should check these carefully."
        },
        {
            "text": "If you have any questions, you should ask your Insolvency Practitioner."
        },
        {
            "heading": 3,
            "text": "My proposal has ‘Modifications’ – what does this mean?"
        },
        {
            "text": "The Insolvency Practitioner will invite your creditors to a meeting where they will read your proposal and decide whether they agree to the terms. Sometimes creditors may only agree your IVA if some changes are made to the terms."
        },
        {
            "text": "These changes are called ‘modifications’ and will be a condition of the creditors agreeing to your proposal."
        },
        {
            "text": "Modifications could include changing:"
        },
        {
            "text": "Your Insolvency Practitioner will inform you of any modifications that have been requested and whether they can be included."
        },
        {
            "text": "It is important to ask the Insolvency Practitioner if you do not understand what the changes will mean for you."
        },
        {
            "text": "You are the person proposing the IVA, so it is important you understand any changes and decide whether you are happy to agree to them."
        },
        {
            "text": "You don’t have to agree to the changes, but this may mean that your IVA cannot go ahead, and you will have to either find a different way of dealing with your debt."
        },
        {
            "heading": 3,
            "text": "What is a “Chairman’s report”? "
        },
        {
            "text": " You will receive a document after the creditors meeting which is called a “Chairman’s report”. This is written by the Chair of the meeting (usually the Insolvency Practitioner). If there are any modifications, the report will explain what they were. The report will also set out how each creditor voted."
        },
        {
            "text": "The report will explain whether your IVA was agreed to or rejected. If your IVA proposal was rejected, you will have to either find a different way of repaying your creditors or writing-off your debts."
        },
        {
            "text": "It is important that you speak to a trusted debt adviser  about your options if you are unsure about what to do."
        },
        {
            "heading": 3,
            "text": "What is an annual review?"
        },
        {
            "text": "Every year, around the anniversary of the date your IVA was agreed, your Insolvency Practitioner will carry out a review of your financial situation."
        },
        {
            "text": "They will ask you if anything has changed, including how much you earn, and whether your important payments (such as rent, mortgage, utilities, food) have increased or decreased."
        },
        {
            "text": "Your monthly IVA payments may change if the review shows that you have either more or less spare money. The payments could also remain the same."
        },
        {
            "heading": 3,
            "text": "What happens if I can no longer afford to pay the amount I agreed to?"
        },
        {
            "text": "The first step to take if you can no longer make the agreed payments, is to talk to the Insolvency Practitioner who is supervising your IVA."
        },
        {
            "text": "Their contact details will be on the paperwork you received, and you should contact them as soon as possible."
        },
        {
            "text": "Your Insolvency Practitioner can discuss the options open to you, which might include:"
        },
        {
            "text": "Your Insolvency Practitioner will explain whether your creditors need to agree to these changes, and you can talk through further options with your Insolvency Practitioner if your creditors don’t agree."
        },
        {
            "text": "You should continue to make your payments while you are discussing alternative options, otherwise you may be in breach of the terms of your IVA and it could be ended, but you would still owe money to your creditors."
        },
        {
            "heading": 3,
            "text": "What happens if I am made redundant, or there are other changes to my employment? "
        },
        {
            "text": "If you are made redundant, contact your Insolvency Practitioner immediately so they can discuss your options to help you continue with the IVA."
        },
        {
            "text": "Your proposal will usually tell you what should happen if you receive any redundancy pay. Many people are permitted to keep an amount up to a total of 6 months of your usual take-home pay (as set out at your last annual review). You will have to give any redundancy pay which is more than this to your Insolvency Practitioner."
        },
        {
            "text": "From the pay you are allowed to keep, you must keep paying your usual monthly contributions into your IVA."
        },
        {
            "text": "If you get a new job, you must tell your Insolvency Practitioner and they will decide whether any more of your redundancy money needs to be paid into the IVA."
        },
        {
            "text": "If there has been a significant change in your employment, your Insolvency Practitioner might have to ask your creditors’ permission to change your IVA terms."
        },
        {
            "text": "If this happens the Insolvency Practitioner will arrange a further meeting with your creditors, and Insolvency Practitioner will guide you through the process."
        },
        {
            "text": "There may be other changes to your employment, such as a pay rise or pay cut, or a change of job, and you should always let your Insolvency Practitioner know when these changes happen."
        },
        {
            "heading": 3,
            "text": "I received a bonus at work – what do I do?"
        },
        {
            "text": "The terms of most IVAs will mean that you must tell your Insolvency Practitioner about any bonus you receive, as some of it might need to be paid to your creditors as part of your arrangement."
        },
        {
            "text": "If, having read the terms of your IVA, you are unsure whether this applies to you, then you should contact your Insolvency Practitioner. Failure to follow the terms you agreed at the beginning of your IVA could result in a breach of your IVA. Your IVA may then be ended, and you would still owe money to your creditors."
        },
        {
            "heading": 3,
            "text": "I received a windfall – what do I do? "
        },
        {
            "text": "Most IVAs will also include terms and conditions that mean if you receive an unexpected windfall, such as an inheritance or lottery win, you will have to tell your Insolvency Practitioner about it, and some or all of it may need to be paid to your creditors."
        },
        {
            "text": "It is likely that some of the money paid from a windfall would also be taken by the Insolvency Practitioner as an additional fee. Information about this is set out in the terms of your IVA. This additional money is to pay for the extra work they will have to do when dealing with the windfall and paying it to your creditors."
        },
        {
            "text": "Your IVA might also include terms that mean if you receive a windfall after your IVA has been successfully completed, you may still have to pay some of that windfall to the Insolvency Practitioner, who will pass it onto your creditors. It is important to check the terms of your IVA carefully, or ask your Insolvency Practitioner if you are unsure, so that you know whether this term applies to your IVA."
        },
        {
            "heading": 3,
            "text": "I own a house – what will happen to it?"
        },
        {
            "text": "If you own a house, your Insolvency Practitioner will discuss your options with you when you are agreeing your proposal."
        },
        {
            "text": "Generally speaking, an IVA allows you to keep your home. However, you must tell your creditors that you own a property and whether you propose that any value (that is the difference between how much your house is worth and the amount you owe on your mortgage, known as equity) might be used to repay some of your debts."
        },
        {
            "text": "Your Insolvency Practitioner will get a valuation for your property and ask you about your mortgage and the amount that is remaining for you to pay. They will use this information to decide whether you are able to give your creditors any of the of equity."
        },
        {
            "text": "The equity can be dealt with in one of three ways:"
        }
    ]
}