{
    "url": "https://companieshouse.blog.gov.uk/2025/08/11/our-new-powers-in-action-tackling-company-cloning/",
    "title": "Our new powers in action: tackling company cloning",
    "authors": [
        "Integrity and Enforcement Team"
    ],
    "categories": [
        "Changes to UK company law",
        "Companies House transformation",
        "Digital transformation"
    ],
    "pub_date": "2025-08-11T12:00:54+01:00",
    "content": [
        {
            "text": "Our new powers under the Economic Crime and Corporate Transparency Act 2023 are already making a real-world impact."
        },
        {
            "text": "As part of our ongoing efforts to prevent financial crime and expose organised criminals who engage in fraud, we have targeted an emerging area of concern: the exploitation of businesses through the cloning of legitimate companies."
        },
        {
            "heading": 2,
            "text": "Investigating cloned restaurant companies"
        },
        {
            "text": "Between December 2023 and February 2024, our intelligence and enforcement teams identified 786 companies that had been incorporated and were suspected to be fraudulent clones of established restaurant businesses."
        },
        {
            "text": "By looking to exploit the reputation of well-known hospitality brands, organised crime groups were trying to make their illegal activities look legitimate and trustworthy. "
        },
        {
            "text": "These cloned companies often used names that closely resembled existing brands, often only differentiating themselves by a single character or punctuation mark."
        },
        {
            "text": "Their intention is typically to:"
        },
        {
            "text": "Well-known restaurant groups and public figures within the hospitality sector were among those targeted, which resulted in widespread media coverage.Companies House took immediate action to investigate this activity, and we were soon able to flag companies for enforcement action."
        },
        {
            "text": "As a result, 2,895 fraudulent appointments and 965 companies were removed from the register. We also then changed the names of 929 of the associated companies, an important action that protected the businesses and individuals whose company or personal names were misappropriated in these cases."
        },
        {
            "heading": 2,
            "text": "How our new powers are helping"
        },
        {
            "text": "The Economic Crime and Corporate Transparency Act has given Companies House important new powers to respond to such threats:"
        },
        {
            "heading": 2,
            "text": "Increasing transparency and trust in UK business"
        },
        {
            "text": "These cases highlight the importance of the role Companies House plays to preserve the integrity of the register. Cloned companies pose a threat to both legitimate businesses and the public. Suppliers and investors who rely on accurate company information are also at risk if we do not stop this criminal activity."
        },
        {
            "text": "We're committed to using our new powers effectively to challenge this misuse of the register and disrupt criminal activity."
        },
        {
            "text": "Together, we're strengthening the UK’s company register and helping to build a more transparent and trustworthy business environment."
        }
    ]
}