{
    "url": "https://environmentagency.blog.gov.uk/2025/08/11/what-is-drought/",
    "title": "What is drought? ",
    "authors": [
        "Environment Agency"
    ],
    "categories": [
        "Drought"
    ],
    "pub_date": "2025-08-11T08:13:21+00:00",
    "content": [
        {
            "text": "Over the past 50 years, England has suffered lots of droughts - some of the more notable ones include 1975-76, 1989-92, 1995-96, 2004-06, 2011-12 and recently 2018, 2022 and 2025. But what does this mean, how does the Environment Agency monitor it, and how are we responding? "
        },
        {
            "text": "Droughts are natural events that cannot be defined, as every drought is different. Whilst they are all caused by a shortage of rainfall, the characteristics (including timing, duration, impacts on people, the environment, agriculture and business) can vary. "
        },
        {
            "text": "Some droughts are short and intense, caused by a hot, dry summer. Others are long and take time to develop over multiple seasons due to low amounts of rainfall. "
        },
        {
            "text": "As a result of climate change, we are experiencing longer hotter summers and more intense rainfall in winters, leading to an increased likelihood of drought and flooding events. "
        },
        {
            "text": "What are the types of drought? "
        },
        {
            "text": "The main types of drought, which may occur separately or together, are: "
        },
        {
            "text": "The Environment Agency monitors various indicators (such as rainfall, river flows, groundwater levels, reservoir storage, ecology, public water supplies) and will decide the level of drought an area is in.  "
        },
        {
            "text": "We use four stages to describe and manage our response: "
        },
        {
            "text": "You can keep up-to-date with the latest dry with situation with our Dry weather and drought in England: summary reports. "
        },
        {
            "text": "What does the Environment Agency do during dry weather and drought? "
        },
        {
            "text": "The Environment Agency has a statutory duty under The Water Resources Act 1991 to ensure there is enough water for people and the environment. During dry weather, we carry out a range of actions to monitor, report and act to reduce the impacts of dry weather on the natural environment.  "
        },
        {
            "text": "The Environment Agency is responsible for: "
        },
        {
            "text": "Further information on how the Environment Agency responds to dry weather can be found: Drought: how it is managed in England   "
        },
        {
            "text": "Find out more about we’re responding to the 2025 drought  "
        }
    ]
}