{
    "url": "https://mojdigital.blog.gov.uk/2022/10/25/20-10-2025/",
    "title": "- 20 - 10 + 2025",
    "authors": [
        "Gina Gill"
    ],
    "categories": [
        "a great place to work",
        "digital strategy",
        "Justice Digital Strategy",
        "Our People",
        "Our services",
        "our users"
    ],
    "pub_date": "2022-10-25T11:52:56+01:00",
    "content": [
        {
            "text": "It’s a bit of a long one this week in celebration of a two-part anniversary at Justice Digital (so grab a cuppa!). We are marking (over!) 20 years of our technology teams, 10 years of our digital teams and thinking about how we achieve our 2025 Strategy: -20 -10 +2025."
        },
        {
            "text": "It’s difficult to express just how much has changed in the past 10 to 20 years. I remember my first mobile phone. It was a little black Nokia 3310 that made calls and did text messages quite badly. I was in my last year of university and had to go to Appleton Tower to use a computer that was quite clunky and slow. When we could afford takeaways we would have to find a paper menu, call them and then patiently wait for it to arrive, constantly getting up and checking out the window every time there was a sound outside. Banking was either done through a long wait on the phone or via a branch. I didn’t ever have to interact with Justice Services but I do remember having to go to the post office to pick up forms to use other government services - things like driving licence and passport. "
        },
        {
            "text": "Our work at the Ministry of Justice (then called the Lord Chancellor’s department) has continually evolved too. I’ve only been here for 5 years, so I am not the best person to describe that. Instead three of our colleagues, Laurence, Eddie and Kellie are going to tell you a little bit about the evolution of technology here over the past 20 years and the evolution of our digital teams and services over the last 10."
        },
        {
            "text": "20: Laurence Tams, Delivery Lead, Technology Services "
        },
        {
            "text": "Twenty years ago, my wife and I had just finalised the adoption of our three children. My Magistrates Court (Wimbledon) had just installed office automation, i.e. we had email, word and excel and no longer had to share a VDU to ‘use the computer’. Audio conferencing was available, some sites had a dial up video conferencing, whilst good for the time was poor by modern standards. Email started to replace the post and fax for document sharing. Mobile phones were far from smart, colleagues could talk, not all could text, some had a torch. Apps were called case management systems and hosted locally on site or in data centres. HQ moved into 102 Petty France, Wi-Fi was non-existent, and users relied on different coloured data cables depending on domain, some readers will remember bright pink cables used for Libra!"
        },
        {
            "text": "The launch of Blackberry and iPhones marked a step change. Colleagues could now manage emails on the move, view attachments and access the internet. Our journey with Wi-Fi was underway, case management systems became services and the mobile experience evolved with more handheld devices available. One became three with HMPPS joining with their Probation teams operating on OMNI and Prison teams on Quantum platforms."
        },
        {
            "text": "TTP replaced the DISC platform, OMNI users joined ex DISC users who received Windows 10 and office 365. The collaboration possibilities were now endless, files could now be shared across several different parts of the MOJ. The pandemic witnessed an upgrade to the Teams platform vastly improving the video meeting space. Many colleagues can now work successfully away from the office with up to date technology. The journey continues with deployment of more modern technology and software to prison service colleagues. Landline telephone can now be provided through Microsoft Teams allowing colleagues to use their laptops for calls."
        },
        {
            "text": "Twenty years ago, users were tied to desks, now they can work from anywhere; meeting rooms, with service users, remotely, even abroad. Going back to my Magistrates’ Court system, data was removed every six months to keep space for new cases, nowadays many years’ worth of data is available at the press of a key."
        },
        {
            "text": "I have worked with many colleagues over the years and the ‘three into one’ theme continues:"
        },
        {
            "text": "Power we hold to get things done keeping service running or new products to improve ways of working for front line colleagues;"
        },
        {
            "text": "Passion day in and day out this is displayed across Justice Digital to get the job done and make a difference and "
        },
        {
            "text": "Pride when we step back and see our products used and relied on in the same way as turning on the electric light."
        },
        {
            "text": "And one other constant – The Buckingham Arms!"
        },
        {
            "text": "10: Eddie & Kellie from our Digital Teams "
        },
        {
            "text": "When we first joined the digital team there were only 16 of us, taking up just 3 banks of desks with a great view of Buckingham Palace!"
        },
        {
            "text": "We were the only Interaction Designers, and there was one Content Designer. At that stage we didn’t have any User Researchers or Service Designers."
        },
        {
            "text": "It was an exciting time, GDS had recently launched GOV.UK, and we were building a buzzing community of new digital teams across government."
        },
        {
            "text": "We took the approach to design good government services that are simpler, clearer and faster to use, using the Government Design Principles. "
        },
        {
            "text": "Our first goal was digital transformation of four of the 25 exemplar services."
        },
        {
            "text": "We were able to design solutions based on user needs by visiting courts, prisons and probation offices and involving policy and operational colleagues and service users in the work. "
        },
        {
            "text": "One of the initial challenges was to gain trust from staff who deliver these services, especially when we came along wearing jeans and carrying MacBooks!"
        },
        {
            "text": "10 years later we now have over 145 designers and researchers in Justice Digital, designing over numerous digital products, and working across locations up-and-down the UK."
        },
        {
            "text": "Eddie - Interaction Designer, Prisons"
        },
        {
            "text": "I still remember the thrill of visiting the MOJ headquarters in London for the first time in 2012. There was lots to do, but we felt we had support from our colleagues both in digital and operations."
        },
        {
            "text": "I was tasked with building a team of designers alongside the other professions. My first hire was a lucky one, and Kellie joined the team a few weeks after I arrived, in which Kellie worked on civil claims and I worked on prison visit booking."
        },
        {
            "text": "I’ll never forget my first conversations with relatives and friends of people in prison, and the profound effect social visits have on everyone involved. We knew design could help improve existing processes, including steps that weren’t online, to give users a better experience."
        },
        {
            "text": "The team has grown a lot, but 10 years down the line I still feel the same level of passion for working together to solve the knotty problems the department has. "
        },
        {
            "text": "I now focus on services to help prison staff. Through our hard work I can proudly say that we have brought positive change to an area of the department that has historically been overlooked when it comes to designing good government services. "
        },
        {
            "text": "There’s lots still to do, but we have the skills and the determination to see it through."
        },
        {
            "text": "Kellie - Interaction Design Lead for HMPPS"
        },
        {
            "text": "When I first joined the digital team as the second designer after Eddie, I was at a point in my career of feeling disillusioned. I’d been freelancing as a User Interface Designer in advertising and the private sector, where users weren’t included in the process."
        },
        {
            "text": "I got my first contract at MOJ by chance, and returned two years later and again three years after that. I was hooked, or as I said in this video on Working at MOJ, “It’s quite addictive!”."
        },
        {
            "text": "I had so much to learn about user-centred design. Working at MOJ allowed me to develop my skills and shape my career as an Interaction Designer. "
        },
        {
            "text": "One of my proudest moments has been working in a team to deliver a new digital service for people to get help paying court and tribunal fees. In order to achieve this, we made sure we were doing the hard work to remove complexity for the users."
        },
        {
            "text": "I feel so grateful to have had the opportunity to work at MOJ over this time. I’m now a Lead Interaction Designer in HMPPS looking after a community of over 24 Interaction Designers, and I feel proud and privileged to support and grow the amazing design talent we have. "
        },
        {
            "text": "25: Back to Me!"
        },
        {
            "text": "I won’t keep you for much longer and won’t regurgitate our strategy. We’ve come a long way, and you should each be proud of how far we’ve come. We have a long way still to go, and I’d ask that you don’t lose the ability to be creative, challenge mindsets and ways of working, and to have some fun along the way."
        },
        {
            "text": "I am incredibly proud to lead an organisation full of people who turn up to work every day to do the right thing and make the lives of people, who are often experiencing a time of crisis, a little easier and simpler. For that, I want to say an enormous thank you. Happy Anniversary."
        }
    ]
}