{
    "url": "https://ukhsa.blog.gov.uk/2022/10/25/5-ways-to-protect-your-under-5s-this-winter/",
    "title": "5 ways to protect your under 5s this winter",
    "authors": [
        "Blog Editor"
    ],
    "categories": [
        "Children and Young people",
        "flu",
        "Health Protection"
    ],
    "pub_date": "2022-10-25T13:26:32+01:00",
    "content": [
        {
            "text": "As this is the first winter without pandemic restrictions in two years, you and your children may be more susceptible to the usual winter bugs and viruses this year.  Winter bugs and viruses are usually mild, but can sometimes become more serious, particularly in younger children or if an infection spreads to a vulnerable family member."
        },
        {
            "text": "Here are the top 5 things you can do to help protect your little ones under age five and reduce the risk of infections for your family this season."
        },
        {
            "heading": 2,
            "text": "1 - Check your child is up to date with their vaccinations "
        },
        {
            "text": "Vaccination is the best defence against severe illness, so to protect your child, check their red book or contact your GP to make sure that your child is up to date with all of their vaccines."
        },
        {
            "text": "Since the start of the COVID-19 pandemic, there has been a drop in uptake levels of children getting their routine vaccines. It’s never too late for children to catch up on their childhood vaccines, even if they have missed them in the past, or you are unsure about your child’s vaccination history."
        },
        {
            "text": "Getting vaccinated will not only protect your child but also protect others by stopping outbreaks in nurseries and schools, and reducing the risk of spread to your family and friends. It may also help you avoid having to take time off work or arrange alternative childcare as a result of your child getting ill."
        },
        {
            "text": "You can see some of the vaccines on offer below, and the full list of vaccines your child should have on the NHS website vaccination schedule, including the flu vaccine."
        },
        {
            "text": "With flu cases on the rise, this is a particularly important time to ensure your child gets the flu vaccine. These are available for any children aged 2 or 3 on 31 August 2022, all primary school children, and some secondary school children."
        },
        {
            "text": "They will most likely be offered a painless and quick nasal spray vaccine to help protect them against flu, or if they are between 6 months and 2 years and have a health condition that puts them at higher risk from flu, they'll be offered a flu vaccine injection instead of the nasal spray."
        },
        {
            "text": "By getting your children vaccinated, it will not only help protect your child, but your family and friends too, including those who may be more vulnerable to serious illness from flu such as grandparents. It may also help you avoid having to take time off work or arrange alternative childcare as a result of your child getting flu."
        },
        {
            "text": "For more information on who is eligible for the flu vaccination this year, go to the NHS website."
        },
        {
            "heading": 2,
            "text": "2 - Take up any additional vaccinations your child is eligible for"
        },
        {
            "text": "You might have seen on the news that Poliovirus has recently been detected in sewage in north and east London. Polio is an illness caused by a virus that attacks the nervous system – in unvaccinated children and adults it can cause permanent paralysis."
        },
        {
            "text": "While the risk to the public overall is extremely low, to protect children in areas where Poliovirus has been detected, an additional dose of the polio vaccine is being offered. Therefore, if your child is between 1 and 9, and lives in London, book your polio vaccine . This will provide a high level of protection from paralysis for your child and help to reduce the further spread of the virus."
        },
        {
            "heading": 2,
            "text": "3 - Teach your child how to wash their hands and cover their coughs and sneezes"
        },
        {
            "text": "The good hygiene habits that were used to slow the spread of COVID-19 are important defences against a range of other infections, including respiratory infections and stomach bugs, like norovirus."
        },
        {
            "text": "By teaching your child how to wash their hands properly with soap for 20 seconds, using a tissue to catch coughs and sneezes, and keeping away from others when feeling unwell, they will be able to reduce the risk of picking up, or spreading, infections. Our e-bug resources for Early Years can help you to explain to your child what good hygiene habits are, how they can practice them and why they are important."
        },
        {
            "heading": 2,
            "text": "4 - Learn about the symptoms of common infections and what you can do if they get worse"
        },
        {
            "text": "There are several common infections that your child might pick up over the winter period. In most cases, these infections will be a mild illness and can be treated at home. However, in some cases they might get worse and require medical help. Some common infections include:"
        },
        {
            "heading": 3,
            "text": "Flu"
        },
        {
            "text": "Flu can be an unpleasant illness in children causing a fever, stuffy nose, dry cough, sore throat, aching muscles and joints, and extreme tiredness. This can last several days or longer."
        },
        {
            "text": "Some children can get a very high fever, sometimes without the usual flu symptoms, and may need to go to hospital for treatment. Serious complications of flu include a painful ear infection, acute bronchitis, and pneumonia. Whilst in most cases, flu will be a mild illness in children, let’s not forget that every winter, some children require intensive care for flu infection."
        },
        {
            "text": "The best way for your child to avoid flu, to ensure your child is vaccinated against flu. Learn more about the flu symptoms to look out for and who to contact, as well as vaccination on the NHS website."
        },
        {
            "heading": 3,
            "text": "Respiratory Syncytial Virus (RSV)"
        },
        {
            "text": "RSV is a common winter virus which affects children under the age of two. RSV often causes mild coughs and colds but is also the most common cause of bronchiolitis infants. Bronchiolitis can make breathing harder and cause difficulty feeding. RSV can be more severe in premature babies, babies under 2 months and infants with underlying health conditions that increase their risk of acute lower respiratory tract infection. Breathing in cigarette smoke also increases the risk of a child getting bronchiolitis, so it is important not to smoke around your child."
        },
        {
            "text": "Learn more about the bronchiolitis symptoms to look out for and who to contact on the NHS website. "
        },
        {
            "heading": 3,
            "text": "Scarlet Fever"
        },
        {
            "text": "Scarlet fever is usually a mild illness, but it is highly infectious and levels are higher than normal this year. Therefore, look out for symptoms in your child, which include a sore throat, headache, and fever, along with a characteristic fine, pinkish or red body rash with a sandpapery feel."
        },
        {
            "text": "Contact your GP or NHS 111 if you suspect your child has scarlet fever, because early treatment of scarlet fever with antibiotics is important to reduce the risk of complications such as pneumonia. If your child has Scarlet Fever, keep them at home until at least 24 hours after the start of antibiotic treatment to avoid spreading the infection to others."
        },
        {
            "heading": 3,
            "text": "Getting help and advice"
        },
        {
            "text": "As a parent, you may know if your child seems seriously unwell and should trust your own judgement. You should contact your GP or call 111 if:"
        },
        {
            "text": "Call 999 or go to A&E if:"
        },
        {
            "heading": 2,
            "text": "5 - Support your child’s school or nursery by keeping them off when needed"
        },
        {
            "text": "Depending on the type of infection, it may spread through respiratory droplets, direct contact between people, or via contact with a contaminated surface. This means that if your child is infectious, there is a risk they could pass it to others in their school or nursery, or amongst other members of your family."
        },
        {
            "text": "If your child has mild respiratory symptoms, like a runny nose, sore throat, or slight cough but are otherwise well, they can continue to attend their school or nursery."
        },
        {
            "text": "If your child has a tummy bug with vomiting and/or diarrhoea, keep them off for 48 hours after symptoms have stopped. You can learn more about norovirus, which is one very infectious tummy bug, and how to stop the spread in our blog."
        },
        {
            "text": "More information about when to keep your child away from school or nursery is available here: Is my child too ill for school? - NHS (www.nhs.uk)"
        },
        {
            "text": "Taking these easy steps to protect your child comes with great benefits. Winter can be tough for many, so doing all you can to help keep your child fit and healthy through it is vital."
        },
        {
            "text": "The more children who benefit from these steps, the more the protection to those around them – which means more people benefit and the bigger the positive impact we can have to reduce the number of people getting ill and help the NHS this winter."
        }
    ]
}