{
    "url": "https://apprenticeships.blog.gov.uk/2022/10/25/black-history-month-a-conversation-between-jennifer-coupland-and-charlotte-mensah/",
    "title": "Black History Month: A conversation between Jennifer Coupland and Charlotte Mensah",
    "authors": [
        "Institute for Apprenticeships"
    ],
    "categories": [
        "Black History Month",
        "Employers",
        "Insider insights",
        "The Institute"
    ],
    "pub_date": "2022-10-25T10:00:48+01:00",
    "content": [
        {
            "text": "This year’s theme for Black History Month is 'Time For Change: Action Not Words'."
        },
        {
            "text": "Our chief executive Jennifer Coupland talks to our hair and beauty route panel member Charlotte Mensah about what changes she has seen and what else needs to happen."
        },
        {
            "heading": 2,
            "text": "How did you get into hairdressing and starting your own business?"
        },
        {
            "text": "From the age of seven to 10, I knew I would do something in business. My grandfather used to run a brewery in Ghana, so I would always see what he was doing… Then when I was 13, my mum died. It was such a difficult time for us, we were living in the UK by then. I took over doing my sister’s hair because it made me still feel connected to her."
        },
        {
            "text": "In 1971, the first black hair salon opened in the UK - Splinters, and I jumped at the chance to join. I was at a job fair at my school and saw the poster. I also trained one day a week at the London College of Fashion under the youth training scheme by Margaret Thatcher, 1986-88. Then I started to hop around because I wanted to learn lots of skills. At the age of 25, I rented my own chair in a business centre in Kilburn Park Road – it didn’t have a shop front, but I was still able to build a client base, which I then moved to my home to be close to my son. I finally opened my own high street salon in 2003."
        },
        {
            "text": "It was hard to achieve because every time I asked the landlord about renting it, he said the space was unavailable. But I kept walking past and seeing it empty. Eventually, I asked my white friend to ring him, and he got the place straightaway. When I confronted the landlord – showing him my business accounts, he was ashamed. He had assumed I wouldn’t be able to afford it."
        },
        {
            "heading": 2,
            "text": "Have things changed since then?"
        },
        {
            "text": "I’ve been in the industry nearly four decades and think it is still hard even now for people of colour. There are still so many stigmas and challenges. There are a lot of changes that still need to happen."
        },
        {
            "text": "My door is now open to everyone who walks through, I treat all hair types, but it’s also a safe space for women of colour because all the hair salons on the high street, all the hair brands; the magazines – every part of the industry needs to be more inclusive."
        },
        {
            "text": "The campaign that everyone should learn all types of hair is a good one, but the big brands need to have more people of colour in their decision making. We are not going to get anywhere if it’s just those at the bottom trying to fix things?"
        },
        {
            "heading": 2,
            "text": "What should IfATE and its route panels be doing to tackle these challenges?"
        },
        {
            "text": "We are having conversations about making sure apprenticeship training works for different hair types, which is great; hairdressers should be trained in all hair types."
        },
        {
            "text": "We are also discussing how to look after hair properly. Some of the assessments, for example, the time that they give is too short when treating black hair. As a route panel member, I’ve been able to explain this, and it’s been updated."
        },
        {
            "text": "Maybe our route panel needs to go to primary schools to teach them the idea of vocation. I see a big difference between the UK and Ghana, where I go regularly because I have a charity there in memory of my mother. Everyone in Ghana is encouraged to learn a vocation. But young people in the UK all want to be their own boss too quickly and this has increased post pandemic. There’s a system to things, you must learn the foundation first and we need to promote that more. I am so grateful for the training I had when I was younger."
        }
    ]
}