{
    "url": "https://educationhub.blog.gov.uk/2022/10/25/children-are-eligible-for-flu-virus-and-covid-19-booster-vaccines-heres-what-you-need-to-know/",
    "title": "Children are eligible for flu virus and COVID-19 booster vaccines – here’s what you need to know",
    "authors": [
        "mediaofficer"
    ],
    "categories": [
        "Covid-19",
        "Schools"
    ],
    "pub_date": "2022-10-25T13:15:48+01:00",
    "content": [
        {
            "text": "Getting vaccinated against the flu virus and COVID-19 offers the best protection."
        },
        {
            "text": "Not only does it protect us as individuals but also those around us and limits the disruption to pupils’ education."
        },
        {
            "text": "Here’s what you need to know about the flu virus and COVID-19 autumn booster vaccines and how to get them for your children."
        },
        {
            "heading": 3,
            "text": "Who can get a flu virus vaccine?"
        },
        {
            "text": "The nasal spray flu vaccine is free on the NHS for:"
        },
        {
            "heading": 3,
            "text": "Who can get a COVID-19 autumn booster vaccine?"
        },
        {
            "text": "The COVID-19 autumn booster programme started in early September. It is available for children:"
        },
        {
            "text": "Children can have their seasonal booster if it’s been at least three months since their previous dose."
        },
        {
            "text": "Why should children be vaccinated against the flu virus and COVID-19?"
        },
        {
            "text": "Flu and COVID-19 can both be life-threatening and spread more easily when mixing indoors during winter."
        },
        {
            "text": "Being vaccinated against seasonal flu virus and COVID-19 is the best way for your children to build up immunity, helps reduce the chance of infection and offers good protection against serious illness. It also helps minimise the disruption to your child’s education."
        },
        {
            "text": "They are also the most effective way to prevent infectious diseases."
        },
        {
            "heading": 3,
            "text": "How are the vaccines administered? "
        },
        {
            "heading": 4,
            "text": "Flu"
        },
        {
            "text": "The flu virus vaccine is a nasal spray. The vaccine is given as a spray squirted up each nostril. It's quick and painless. The vaccine will still work even if your child gets a runny nose, sneezes or blows their nose."
        },
        {
            "text": "The flu virus vaccines are given in the autumn ideally before flu starts circulating."
        },
        {
            "text": "The nasal spray vaccine offers the best protection for children aged 2 to 17 years. They'll be offered a flu vaccine injection if the nasal spray vaccine is not suitable for them. Injected flu vaccines are also safe and effective."
        },
        {
            "heading": 4,
            "text": "COVID-19"
        },
        {
            "text": "The COVID-19 vaccine is an injection. Children will be given a Pfizer/BioNTech vaccine for their COVID-19 vaccination."
        },
        {
            "text": "Children aged 5 to 11 (or 12 if they are in school Year 7) will be given smaller doses than older children and adults."
        },
        {
            "heading": 3,
            "text": "How children can get the flu vaccine"
        },
        {
            "text": "All primary school aged children will be offered a free flu vaccine at school or a community clinic. Look out for your child’s consent form in their book bags, sign it and return it."
        },
        {
            "text": "Below is an NHS table showing a child's age and where the flu vaccine is available."
        },
        {
            "heading": 3,
            "text": "How children can get the COVID-19 vaccine"
        },
        {
            "text": "Parents and guardians will be invited to make an appointment for their child to be vaccinated."
        },
        {
            "text": "For children you can:"
        },
        {
            "heading": 3,
            "text": "And what about adults?"
        },
        {
            "text": "The UKHSA flu vaccination programme page contains the latest guidance leaflet regarding the flu vaccine and who should have it. You can visit it here: Flu vaccination: who should have it this winter and why - GOV.UK (www.gov.uk)."
        },
        {
            "text": "For COVID-19 please visit: A guide to the COVID-19 autumn booster - GOV.UK (www.gov.uk)."
        }
    ]
}