{
    "url": "https://accessibility.blog.gov.uk/2022/10/25/establishing-accessibility-in-the-ddat-profession/",
    "title": "Establishing accessibility in the DDaT Profession",
    "authors": [
        "Beverley Newing - Accessibility Lead - MoJ",
        "David Caldwell, Head of Technology and Digital Assurance, Home Office"
    ],
    "categories": [
        "Accessibility"
    ],
    "pub_date": "2022-10-25T15:24:18+01:00",
    "content": [
        {
            "text": "The Digital Data and Technology (DDaT) Capability Framework describes the job roles in the DDaT Profession and provides details of the skills needed to work at each role level. The framework helps departments to create consistency in roles across DDaT that makes career development and progression easier as well as reducing duplication and effort."
        },
        {
            "text": "The framework is constantly evolving, recognising the changes to what government departments need to deliver modern digital and technology services. One area that was missing from the framework was accessibility. "
        },
        {
            "text": "Over the last 18 months, we have been working to define the roles, skills and progression routes for accessibility roles within government and, back in August, the initial set of accessibility roles and skills went live."
        },
        {
            "heading": 2,
            "text": "The accessibility profession within government"
        },
        {
            "text": "The accessibility profession in the UK government has grown considerably over the past couple of years. For example, in the past two years, the Ministry of Justice team has gone from a team of 1 to a team of 7. In total, the current number of accessibility professionals across government stands at more than 60."
        },
        {
            "text": "Defining accessibility roles meant that we had to agree on a common set of guidelines on what we all do, and what was required of different levels, to help people identify what was needed for promotions. "
        },
        {
            "text": "By adding these roles we’ve also given accessibility more prominence, and will enable greater recognition across government, making it easier to hire accessibility professionals in the future."
        },
        {
            "text": "Working with peers in the private sector, we also identified that having accessibility professionals inside the DDaT framework would help to create an authoritative definition for these roles which could then be used beyond government and act as a catalyst for growth within the industry. This also helps to demonstrate how the government is at the forefront of developing what is a niche and under developed profession globally."
        },
        {
            "heading": 2,
            "text": "Defining the profession"
        },
        {
            "text": "We wanted to make sure that we factored in the different needs of the government departments, arms length bodies and devolved administrations. To do this we ran several workshops and data gathering exercises with the various senior accessibility professionals from across the UK government. These exercises helped us capture the top level requirements of what departments needed from the profession."
        },
        {
            "text": "We subsequently formed a working group with representatives from across government in order to create a shared set of skill definitions and progression routes that worked for the various sizes and complexities of the organisations inside government. "
        },
        {
            "text": "The working group was made up of :"
        },
        {
            "text": "As a group we spent time discussing the various skills that we felt were needed to be accessibility specialists in government, identified which of these skills already existed in the DDaT skills catalogue and which we’d have to create from scratch. We tried to reuse as many existing skills as possible to allow people to move into accessibility from other DDaT roles. We also spent time mapping the different skill levels to the various roles we wanted to create, allowing people to see how to progress within accessibility throughout their careers. "
        },
        {
            "heading": 2,
            "text": "What next"
        },
        {
            "text": "We’re pleased that the first iteration of the roles and skills went live on the framework at the end of August - we would love to hear your feedback, so please comment on this blog if you have any to share. "
        },
        {
            "text": "This is just the starting point for the accessibility specialist roles within the DDaT Framework. We’ve already identified a number of additional role levels that we want to add include emerging and early career options, for example Apprentices. We also think there are deeper specialisms within the family that we’d like to explore, for example, Assistive Technology Specialist. "
        },
        {
            "text": "If you’re interested in getting involved in this work, let us know."
        }
    ]
}