{
    "url": "https://vmd.blog.gov.uk/2022/10/25/extramural-studies-ems-placement-at-the-vmd-july-2022/",
    "title": "Extramural Studies (EMS) Placement at the VMD, July 2022",
    "authors": [
        "Claire Gilbert"
    ],
    "categories": [
        "Training"
    ],
    "pub_date": "2022-10-25T15:16:03+01:00",
    "content": [
        {
            "text": " "
        },
        {
            "text": "A small group of veterinary students in their final years of study joined us this summer for a two-week EMS placement at our office in Surrey."
        },
        {
            "text": "Students were given a comprehensive overview of our work, with a focus on areas of relevance to clinical veterinary surgeons. The experience also enabled them to explore Civil Service career opportunities for the veterinary profession."
        },
        {
            "text": "The placement structure included lectures and workshops, as well as a student-led journal club."
        },
        {
            "heading": 2,
            "text": "Topics covered"
        },
        {
            "heading": 2,
            "text": "What the students said"
        },
        {
            "text": "Amy Bagster, a student from the University of Nottingham said,"
        },
        {
            "text": "“I was interested in seeing alternative career pathways within the veterinary profession. I liked the fact that there was a structured programme of learning that would help complement and add to my knowledge base in regard to veterinary medicine.”"
        },
        {
            "text": "The student group particularly appreciated the opportunity to talk to our vets and experts, along with the chance to research a topic that interested them and to discuss it at the journal club."
        },
        {
            "text": "Amber Cornock, veterinary student from the University of Bristol said,"
        },
        {
            "text": "“My highlight of the placement was the University Challenge style quiz on the last day, where we competed to answer questions covering all that we had learnt during the two weeks.” Amber added, “I also enjoyed the opportunity to create a presentation on a paper of my choice and listening to the presentations from the other EMS students.”"
        },
        {
            "text": "Phoebe Tarver, also a student from the University of Bristol, will be telling her colleagues and classmates to,"
        },
        {
            "text": "“always look at the SPC and not just the data sheet given in the drug packet as the SPC has the most up to date information.” In particular, Pheobe noted the importance to “always report side effects and suspected lack of efficacy.”"
        },
        {
            "text": "The vet students that join us are always surprised by the amount of work that goes in to authorising and regulating veterinary medicines. Amy commented, “there are so many facets of work that the VMD cover,” going on to say, “the resulting safety and security we can have in the products we use provides great assurance.”"
        },
        {
            "text": "This year, our students were interested to learn that we have an interest in bee health and commission research on this and potential veterinary medicine development. They also enjoyed learning about the International Development and Training work we do to train other countries in regulatory affairs, and our regulation of imported drugs."
        },
        {
            "text": "We were delighted that our course was so well received and informative as evidenced by the group’s participation and enthusiasm throughout, and the positive feedback received."
        },
        {
            "text": "In summing up, Amy concluded that, “Overall, the experience was a great insight into a diverse career pathway within the Civil Service. All the staff are super friendly and helpful, invite lots of questions, and interact in a professional and respectful way. I learnt so much and had a really fantastic experience that was something different to most other placements.”"
        },
        {
            "heading": 2,
            "text": "Future placements"
        },
        {
            "text": "The VMD is hoping to offer a 2023 student placement, full details will be published on VMD social media accounts when the application process opens and UK veterinary schools will be notified."
        },
        {
            "text": " "
        }
    ]
}