{
    "url": "https://mhclgdigital.blog.gov.uk/2022/10/25/future-councils-delivering-pathways-for-councils-to-become-modern-and-resilient-organisations/",
    "title": "Future Councils: Delivering pathways for councils to become modern and resilient organisations",
    "authors": [
        "The Local Digital team"
    ],
    "categories": [
        "Future Councils",
        "Local Digital"
    ],
    "pub_date": "2022-10-25T14:03:42+01:00",
    "content": [
        {
            "text": "We’re delighted to announce that applications are now open to join the pilot of Future Councils."
        },
        {
            "text": "Future Councils is a partnership between Local Digital and a group of councils to deliver replicable pathways to digital and cyber security reform that other councils can follow. "
        },
        {
            "text": "We’re inviting local authorities in England to apply to join us as we pilot this programme over the next six months. "
        },
        {
            "text": "In this blog post, find out why we’re taking this approach and who can take part in the pilot."
        },
        {
            "heading": 2,
            "text": "We’re taking a broader approach"
        },
        {
            "text": "Following the launch of the Local Digital Declaration in 2018, there has been a significant shift in local government digital services towards more modern, user-friendly, cost effective services, which are based on flexible, secure technology that can be reused across the sector."
        },
        {
            "text": "However, we have also seen the growing risk and scale of cyber attacks, with incidents across the country showing that no council is immune from risk. "
        },
        {
            "text": "We are proud of the improved outcomes Local Digital has delivered over the last four years in collaboration with councils. But we have also learned that improvements to one service do not necessarily drive transformation across a council. "
        },
        {
            "text": "Councils have told us of the importance of taking a broader approach that removes the barriers to change, if they are to meet the principles of the Declaration. This includes finding ways to:\n"
        },
        {
            "heading": 2,
            "text": "About Future Councils"
        },
        {
            "text": "Over the past few months, we’ve been working with colleagues at a range of councils to think about how we could support councils to tackle these challenges and, earlier this month, we announced an exciting new opportunity called Future Councils. "
        },
        {
            "text": "Taking a whole-council approach, the Future Councils programme will bring together digital services and cyber security reform to multiple areas within a local authority. It will address some of the systemic barriers that make it challenging for councils to sustain digital reform and to become modern, resilient organisations. "
        },
        {
            "text": "We intend to begin working with a small pilot cohort of six councils in January 2023. This will enable us to rapidly test and iterate our approach and the types of interventions we can collaborate on, before opening to a bigger cohort in mid-2023."
        },
        {
            "text": "The pilot phase will see funding of up to £750k given to each council that takes part, to support them with a range of projects, including:\n"
        },
        {
            "text": "We will also work with pilot councils to:"
        },
        {
            "heading": 2,
            "text": "Could you be a Future Council?"
        },
        {
            "text": "Through Future Councils, we are looking to collaborate with local authorities to invest in change projects across the following areas:"
        },
        {
            "text": "For the pilot, we are looking for a diverse range of local authorities that:"
        },
        {
            "heading": 2,
            "text": "Apply to join the pilot cohort"
        },
        {
            "text": "Applications for Future Councils are now open and will close on Friday 18 November 2022 at 5:30pm."
        },
        {
            "text": "To apply to be part of the Future Councils pilot, you must be:"
        },
        {
            "text": "You must sign the Local Digital Declaration in order to take part in Future Councils. If you have not yet signed up, you can read our guidance on signing and then sign the Declaration online."
        },
        {
            "text": "If you are eligible to apply, visit the Local Digital website to find out more about the application process, read the application guidance, and apply to join the pilot cohort. "
        },
        {
            "heading": 2,
            "text": "Ask us a question"
        },
        {
            "text": "We’re holding a dedicated Q&A on the #dluhc-future-councils Slack channel in the LocalGovDigital workspace from 11am to 12pm on Wednesday 2 November. We’ll be monitoring this channel regularly so you can also ask us questions outside this time. Alternatively, you can email us on futurecouncils@localdigital.gov.uk."
        },
        {
            "text": "We’ll continue to share updates on Future Councils as it develops via the DLUHC Digital blog and across our usual channels:"
        }
    ]
}