{
    "url": "https://civilservice.blog.gov.uk/2022/10/25/helping-you-navigate-your-civil-service-job-journey/",
    "title": "Helping you navigate your Civil Service job journey",
    "authors": [
        "Monica Maya-Martinez"
    ],
    "categories": [
        "A Modern Civil Service",
        "A Skilled Civil Service",
        "An Innovative Civil Service",
        "Better policymaking"
    ],
    "pub_date": "2022-10-25T16:14:42+00:00",
    "content": [
        {
            "heading": 3,
            "text": "We’ve all been there, looking for a new job. With 2.26 million job applications submitted to  the Civil Service last year, it is the top career choice for many. It’s not always easy for job hunters, but Monica Maya-Martinez explains how she’s helping make the job journey a bit easier."
        },
        {
            "text": "Did you know the average person has 12 jobs during their lifetime? This means, unless we’ve been lucky enough to land every job we’ve applied for, we’ll have filled out a fair few applications. "
        },
        {
            "text": "I remember doing around 200 applications when I finished my Master’s as I was desperate to work for either the United Nations or an environmental charity. It didn’t happen - at least not straight away. After many attempts, I joined the Environment Agency and fulfilled my dream to work on cleaning up our polluted environment. Fast forward to 2021 and I found myself wanting to join the Cabinet Office, and faced a very different recruitment system. "
        },
        {
            "heading": 4,
            "text": "Positive difference"
        },
        {
            "text": "But why the Civil Service? Well, it’s different for everyone, though I think most of us are driven to make a positive difference for our fellow citizens, and help advance change in stability, fairness and opportunities. "
        },
        {
            "text": "However, applying for a job in the Civil Service isn’t always straightforward. For example, unlike some job sites, it’s not as simple as clicking on ‘apply’, uploading your CV and personal statement, and job done (pun intended). "
        },
        {
            "text": "While searching for a job in the Civil Service, I was initially confused by the grades, the contract types (“temporary not fair and open” being one) and the different working patterns. For example, what if I was looking for flexible and compressed hours at the same time? Then, when I decided to apply for a job, there were ‘behaviours’ to understand and a rather complicated process that felt unfamiliar  and - at times - confusing. Throw some accessibility issues into the mix and I found the process rather daunting and complex. "
        },
        {
            "text": "Cut to the chase, I landed a job as Delivery Manager for the Civil Service Jobs Portal, meaning that the ‘daunting, long and complicated’ process suddenly became my problem - but now I am also part of the solution! "
        },
        {
            "text": "After all, it’s the role of Government Shared Services to support departments across government in delivering efficient, innovative and user-friendly shared services - including Civil Service recruitment."
        },
        {
            "heading": 4,
            "text": "Bucket of ideas"
        },
        {
            "text": "We have a big bucket full of features and changes designed to make the journey much better for users (both candidates and recruiters). But as each organisation has a particular way to write adverts, recruit, sift and in essence complete the different stages of the recruitment process, we’ve had to be smart and resourceful. Standardisation is a dream, but it also means change, and not everyone embraces it. "
        },
        {
            "heading": 4,
            "text": "Improving accessibility"
        },
        {
            "text": "Our team has been working full tilt to tackle accessibility issues so that users with accessibility challenges have a positive experience and feel the Civil Service Jobs Portal is giving them what they need. Screen reader users have found the service to be more challenging than other user groups. Some of the major issues encountered included inaccessible content and problematic custom elements, which we have been addressing. "
        },
        {
            "text": "For low vision users, navigating through the platform was difficult, so we’ve made changes to improve colour contrast. And whilst voice activation users could navigate the platform only encountering a few issues, those were high priority and also addressed. Many usability issues encountered have affected applicants' personal experience of the website, and we feel these are important and should be addressed or considered.   "
        },
        {
            "text": "The Welsh language is another feature we’ve been working on. Although there aren’t huge numbers of candidates that request content in Welsh language, we want to support the Welsh Government’s plan to reach 1 million native Welsh speakers by 2050. And as part of A Modern Civil Service, we’re keen to spread job opportunities for people from every background and walk of life."
        },
        {
            "text": "There is a long way to go but unless we invest in our customers, understand their needs, and work towards making simple and efficient user journeys, we aren’t going to get what we want: the right candidates for the right job at the right time. "
        },
        {
            "heading": 4,
            "text": "Bright future"
        },
        {
            "text": "The future looks challenging but also promising. Whilst Civil Service recruitment is currently scaled back, we are taking every opportunity to improve and evolve recruitment, to widen the talent net as far as possible."
        },
        {
            "text": "As we continue to research what job applicants find challenging and how their needs are changing, we also explore what other top organisations are doing in areas of innovation, automation, inclusiveness and diversity. "
        },
        {
            "text": "We all want the same thing: a clear, simple system that draws the best talent into the Civil Service, regardless of their background, age, sexual orientation or gender. Overall, we want a positive recruitment experience for both candidates and recruiters. "
        }
    ]
}