{
    "url": "https://environmentagency.blog.gov.uk/2022/10/25/national-drought-group-projections-for-winter-water-resources/",
    "title": "National Drought Group projections for winter water resources",
    "authors": [
        "Environment Agency"
    ],
    "categories": [
        "Water"
    ],
    "pub_date": "2022-10-25T10:14:23+00:00",
    "content": [
        {
            "text": "Despite the welcome rain we are still in drought and will be next year."
        },
        {
            "text": "This summer follows a trend towards hotter drier summers. Record breaking temperatures exceeded 40C for the first time and for many parts of England it was the driest summer on record. Since then, drought conditions remain across most of the country and exceptionally low water resources levels continue to impact the environment, water companies and farmers."
        },
        {
            "text": "We are more prepared for droughts than ever before, particularly when compared to the well-remembered drought of 1976. Through the current drought, water companies and the Environment Agency have implemented pre-agreed drought plan measures and taken action to conserve and supplement water. But there is more to do as we must prepare for the worst, which would be another dry winter."
        },
        {
            "text": "Despite some welcome wetter weather in recent weeks, drought has not gone away. Normally at this time of year autumn rainfall starts to restore river flows, refill reservoirs and recharge groundwaters, and water resources recover. But with such dry soils it will take longer for the recovery to start this year. Saturated soils are needed to sustain increases in river baseflows (to support reservoir refill) and groundwater recharge to commence."
        },
        {
            "text": "Last week, the National Drought Group (NDG) discussed projections for the winter using different rainfall scenarios on public water supply, agriculture, and the environment. If we have rainfall that is above average; falling steadily all winter, water supplies should return to normal conditions by spring."
        },
        {
            "text": "If we have average rainfall, we will still expect to see impacts on the environment next year as ecology and habitats take longer to recover from drought stress. Farmers would be concerned their water supply storage reservoirs may not fully refill, and some rivers and groundwater levels could be lower than normal. Public water supply, whilst remaining safe, might not fully recover by spring too. South West Water expects its supply area covering Cornwall and parts of Devon to be in drought at the start of next summer, as it has large reservoirs which will take more than one winter’s rainfall to refill. Several other water companies expect they could be at risk, depending on when and where the rain falls."
        },
        {
            "text": "If the winter is dry with 80% or less of long-term average rainfall, projections show that depleted reservoirs and groundwater are unlikely to fully recharge, and large parts of the country will be at risk of drought continuing into next summer - notably in parts of the South West, South East, East and Yorkshire and East Midlands. In more severe rainfall scenarios, the projections suggest drought conditions would be widespread, covering most of the country."
        },
        {
            "text": "Scenario planning like this helps mitigate the risk that drought will occur and when it does occur, planning helps communities and sectors adapt. We are not waiting for the rain to fall - all sectors are planning for all rainfall scenarios and taking the necessary action over the winter to improve supplies and resilience for next year. For example, water companies are applying for drought permits to help refill reservoirs and are working together with farmers and others to explore opportunities to support each other and protect the environment."
        },
        {
            "text": "Even so, we can all do more to use our precious water wisely. Everyone has a part to play."
        },
        {
            "text": "Our National Framework for Water Resources clearly sets out the challenges we may face in the future as our climate changes and our population grows. It sets targets to help meet the deficit and use water resources in the best way. Together with the government and water companies, we are determined to drive forward and intensify that work to meet and beat the targets, as well as working collaboratively with farmers and others to deliver secure, sustainable and affordable supplies of water for us and the environment."
        }
    ]
}