{
    "url": "https://marinedevelopments.blog.gov.uk/2022/10/25/recycling-commercial-trawl-nets-from-harbour-to-pellet-in-the-uk/",
    "title": "Recycling commercial trawl nets from harbour to pellet in the UK",
    "authors": [
        "Jessica Churchill-Bissett (MMO)"
    ],
    "categories": [
        "Coastal",
        "fisheries",
        "marine conservation"
    ],
    "pub_date": "2022-10-25T14:58:32+01:00",
    "content": [
        {
            "text": "Following on from my blog in 2018 regarding the initiation of Torbay Cleaner Coasts Initiative and our work to encourage the commercial Brixham fishing fleet to recycle their HDPE nets, I am pleased to say that there has been some developments."
        },
        {
            "text": "On 9th March 2022 I used a volunteer day to visit the first plant in England to have developed the ability to recycle HDPE trawl nets from harbour to pellet in this country!"
        },
        {
            "text": "The background:"
        },
        {
            "text": "Since 2018 the Port of Brixham have been recycling their commercial HDPE fishing nets with the support of Fathoms Free, Odyssey Innovation and more recently Keep Britain Tidy (KBT)."
        },
        {
            "text": "Once word got out amongst the local Skippers that there was an alternative way to dispose of their large HDPE plastic fishing nets, the fleet showed huge support to the project bringing in their old end of life nets and even nets that they had trawled up whilst at sea."
        },
        {
            "text": "The project was successful in recycling a huge amount of net, but this was always fairly labour intensive for a group of volunteers from Torbay Cleaner Coasts Initiative who would strip the nets of all un-recyclable materials such as chain, rope and debris to prepare them. The net was then sent off to Denmark once or twice a year to be recycled by Plastix Global, who returned them to plastic pellet form to create other products. Another issue with this method was the amount of storage required at Brixham port for processed net due for collection."
        },
        {
            "text": "Over the years Torbay Harbour Authority supported and then took over the preparation of the nets for recycling and remained fully onboard with the project, supporting those who were trying to find other solutions to the circular economy. From a partnership between Torbay Harbour Authority, Keep Britain Tidy and Milspeed Ltd. has led to a breakthrough for Milspeed to be the first plant in England to be able to recycle HDPE commercial fishing nets."
        },
        {
            "text": "Milspeed Ltd. have invested in research and machinery to enable their plant to tackle the often-fouled trawl nets, clean them, shred them and process them back into pellet form to be re-used in a circular economy. Businesses in the UK are being supported in collecting material from beaches and harbours, having pellet created and manufacturing products from it."
        },
        {
            "text": "Keep Britain Tidy’s Ocean Recovery Project Manager Neil Hembrow says ‘As we enter a critical period of climate change for our planet we have looked to develop regional and UK solutions for recycling fishing material. The trawl nets from Brixham travel just 150 miles from Harbour to processor before being made into a recycled pellet. It’s fantastic that the nets can be utilised right here in England. We’ve spent a long time assisting the development of this new system and great credit goes to the processor and all involved at Brixham harbour for their hard work tackling what is a difficult material to recycle’."
        },
        {
            "text": "The visit:"
        },
        {
            "text": "I joined Neil Hembrow from KBT and Chloe North from Western Fish Producers’ Organisation to visit the site in Bourton on the Water. We had a tour of the plant and saw the machinery in action cleaning and shredding the HDPE nets. Ian and James from Milspeed explained the process and the possibilities of re-use including for fish boxes, plastic cord for 3D printing and sole compounds for trainers."
        },
        {
            "text": "The future:"
        },
        {
            "text": "KBT are now starting further work with Torbay Harbour Authority and Western Fish Producers’ Organisation to improve the collection and stripping of nets at the Port of Brixham and establish sustainable transport links between the port and the recycling plant. KBT have acquired funding to support other UK harbours, local groups and organisations to set-up recycling of fishing material. Funds are available to set up collection systems at harbourside and to cover transportation costs. Milspeed are keen to slowly expand the operation as they grow the market for the recycled pellets."
        },
        {
            "text": "Keep Britain Tidy thanked Torbay Cleaner Coasts Initiative for helping to initiate the net recycling scheme in Brixham and the man hours we put into getting the scheme established. There’s more work to be done but to have a closed circular economy for commercial HDPE trawl fishing nets in the UK is ground-breaking."
        },
        {
            "text": "If you are an organisation or harbour looking to recycle fishing gear in the UK and need funding to help please contact ‘oceanrecoveryproject@keepbritaintidy.org’"
        },
        {
            "text": "#cleanercoasts #keepbritaintidy #oceanrecoveryproject"
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": "Jessica Churchill-Bissett, Senior Marine Planner"
        }
    ]
}