{
    "url": "https://prisonjobs.blog.gov.uk/2022/10/25/why-becoming-a-case-administrator-could-be-your-best-career-move/",
    "title": "Why becoming a Case Administrator could be your best career move",
    "authors": [
        "Ministry of Justice"
    ],
    "categories": [
        "Career progression"
    ],
    "pub_date": "2022-10-25T10:03:16+01:00",
    "content": [
        {
            "text": "How did you come to the Case Administrator role?"
        },
        {
            "text": "I joined London Probation Service in 2006 as a Case Administrator in the Willesden Probation Office in Brent. At the time, I was working for the Irish passport and visa office, and I just wanted a change. I wanted something where I could progress. I saw the advert for Case Administrators and thought “this sounds really interesting”. So, I applied and got the role!  I went on to work as a Case Administrator for about three years."
        },
        {
            "text": "What did you think about the Case Administrator role when you started?"
        },
        {
            "text": "When I first joined it seemed like a role that was really varied, and no two days would be the same. There were lots of opportunities for training and career progression. Plus, my colleagues in the office were so supportive."
        },
        {
            "text": "What does the Case Administrator role involve doing?"
        },
        {
            "text": "It is so varied. You're there to:"
        },
        {
            "text": "It's crucial that you're working collaboratively with the Probation Officer and/or Probation Service Officer because they really do rely on that support. That for me was the best part of the role and I learned so much from working with them."
        },
        {
            "text": "What skills do you need to do the Case Administrator role effectively?"
        },
        {
            "text": "I think patience. You have to be patient and also have empathy. I think it's really key to be able to empathise with the people that are coming through those doors."
        },
        {
            "text": "Like I mentioned, no two days are the same: you could be dealing with people that are going through a crisis that turn up at the office or be on the phone and be really agitated. So, enjoying a challenge and communication skills are key. Most importantly, you have to be a team player, you have to want to pull together, work together."
        },
        {
            "text": "What did you value most about your role as a Case Administrator?"
        },
        {
            "text": "I would say one of the biggest strengths of the Probation Service is definitely how everyone works together and there's real camaraderie. There's real teamwork, everyone pulls together and everyone's really supportive."
        },
        {
            "text": "I loved working with my peers, I would meet with other Case Administrators across London, and we would work together, and everyone would always help out. I could reach out to another Case Administrator and ask \"have you done this before”, “what did you in this situation” etc."
        },
        {
            "text": "Feeling a part of something important gave me a real sense of purpose. I was contributing to protecting the public and reducing reoffending. I felt really proud working for the Probation Service because I very much believed in what they were trying to achieve."
        },
        {
            "text": "Did you get other opportunities within the team?"
        },
        {
            "text": "I was Case Administrator for about three years and then I was promoted to become a MAPPA Administrator, which is a Multi-agency Public Protection Arrangements Administrator."
        },
        {
            "text": "The people that I worked with were all so supportive and they were my biggest cheerleaders in supporting my career progression. My managers, all of them just kept pushing me, saying “come on Donna, you can do it”. And I thought “it's time for me to develop myself” and I was massively supported in that."
        },
        {
            "text": "After that, I stepped into management to become a Senior Case Administrator and I managed a team of 10 Case Administrators. I did that role for about two years. I was then promoted to a Business Manager."
        },
        {
            "text": "So, would you say your first Case Administrator role was a really good foundation?"
        },
        {
            "text": "Doing the role definitely gives you that advantage because you understand what happens on the frontline. So, when new ways of working were suggested, I would understand how it would land."
        },
        {
            "text": "All that experience was invaluable. It built those foundations in terms of my understanding and knowledge."
        },
        {
            "text": "I know several people that started off as Case Administrators who then went on to be trainee Probation Officers and then Probation Officers and Senior Leaders."
        },
        {
            "text": "So, what are you doing now?"
        },
        {
            "text": "I got a role as a HR Performance Manager after that and then I got promoted again to an interim HR Business Partner. I then obtained a promotion to Resourcing Delivery Lead which is my current role."
        },
        {
            "text": "That’s brilliant and shows how starting off as a Case Administrator can take you anywhere. Anything else we’ve not covered about the role or something important we’ve not mentioned?"
        },
        {
            "text": "Yes. I've not come from an academic background and because I've not gone to university or got a degree, I thought this would be a barrier in obtaining a career or advancing myself. Actually, joining the Probation Service really opened my eyes to the fact that you don't need to be from an academic background to have a career. The training and the support are there for you to progress. So, I think it's important that people that don't come from an academic background or don't want to have to do that route know that there's very much a place for them in the Probation Service."
        },
        {
            "text": "You can build your career and further develop yourself through the Probation Service, as there are so many opportunities. Not only that but gain skillsets that actually I'm not quite sure other organisations would offer."
        },
        {
            "text": "If you want a career, if you want to progress, it's there for you. If you don't, that's fine as well."
        },
        {
            "text": "Ultimately being a Case Administrator is very rewarding. You work with probably the best people you can ever work with who are so committed and dedicated to their role. And that's what kept me in the Probation Service so long. That's why I stayed working in the Probation Service for 13 years, because I loved it."
        }
    ]
}