{
    "url": "https://healthcareleaders.blog.gov.uk/2022/03/04/building-an-integrated-health-and-care-system-with-staff-and-patients-at-its-heart/",
    "title": "Building an integrated health and care system with staff and patients at its heart",
    "authors": [
        "Sajid Javid - Secretary of State for Health and Social Care, Department of Health and Social Care"
    ],
    "categories": [
        "NHS integration"
    ],
    "pub_date": "2022-03-04T11:09:01+00:00",
    "content": [
        {
            "text": "The Covid-19 pandemic has been a clear example of the importance of working together as one."
        },
        {
            "text": "Whether it’s the extraordinary success of the vaccination programme, or the work to identify and protect the most vulnerable, we were at our best when we worked across traditional boundaries and out of silos towards a common goal."
        },
        {
            "text": "The health and social care integration white paper, which we launched last month, sets out our bold ambition to build on the foundations laid by the Health and Social Care Bill. Not only does it seek to create a seamless, integrated system with people’s needs at its heart, it will also empower NHS colleagues and their social care counterparts to make the most of new and existing career paths."
        },
        {
            "text": "Those of you on the NHS frontline already know the integration project has been gathering pace for many years. But now, we need to see a step change in how we bring the clinical and care workforces together."
        },
        {
            "text": "Integrated services can only be delivered by a capable, confident, collaborative health and care workforce, which feels valued for the work they do."
        },
        {
            "text": "This is about making the most of your time, allowing you to focus on priority cases and shifting the balance further away from less invasive treatments to prevention and support."
        },
        {
            "text": "We also want to create a more agile workforce, with NHS and care staff able to move easily between roles and sectors. For example, through more learning experiences in social care, including health undergraduate degree programmes, apprenticeships, or the potential introduction of integrated skills passports, allowing you to transfer skills and knowledge between the NHS, public health and social care."
        },
        {
            "text": "Of course, you’ll need the digital tools to make the most of these innovations. A major step forward will be the use of care records, shared across health and social care, for every person, and digital tools that allow individuals to book appointments, order prescriptions and communicate more easily with those providing their care. This will provide the foundations for more joined up direct care, planning and population health."
        },
        {
            "text": "It’s not all about admin and data either. The introduction of a single person, accountable for delivery of shared plans at local level, will encourage and direct a more joined-up approach to health and social care service delivery."
        },
        {
            "text": "The ‘one size fits all’ approach to health and care services is long gone, but it is clear – as regional and cultural health inequalities persist – we must do more to ensure that someone’s experience of health and care isn’t dictated by their background, or where their live."
        },
        {
            "text": "Better integration is about giving people the best and most appropriate care, whoever they are, whatever they do, wherever they live. It is equally about supporting you to deliver high quality care without compromising your own health and wellbeing."
        },
        {
            "text": "The integration white paper represents the next step in our journey of reform, shaping a path towards a future of health and care with you – and your patients – at its very heart."
        },
        {
            "text": " "
        }
    ]
}