{
    "url": "https://mojdigital.blog.gov.uk/2022/03/04/creating-content-for-women-in-prison/",
    "title": "Creating content for women in prison",
    "authors": [
        "Jo Meek"
    ],
    "categories": [
        "Content",
        "Content Hub Team"
    ],
    "pub_date": "2022-03-04T16:13:18+01:00",
    "content": [
        {
            "text": "The Content Hub is a good way to meet the needs of both staff and prisoners. It allows prisoners to access content relevant to their journey and frees up staff time. The 'Your profile' area gives prisoners visibility over their timetable, visits, incentive level and money. Research has shown repeatedly how important some 'agency' over these things is."
        },
        {
            "text": "When people go to prison they lose some of their ability to manage their day to day activities. This can lead to a sense of disempowerment. We are hoping that valuable content, at the right time, will support people with critical activities that will help them to resettle."
        },
        {
            "text": "The Content Hub is currently available in 10 prisons, including 2 women’s prisons, and all Young Offender Institutions (YOIs)."
        },
        {
            "text": "Basic differences between the male and female estate"
        },
        {
            "text": "The women’s estate is different in many ways to the male. There are only 12 women’s prisons (out of 117 in total)  in England and Wales. As a result, women are often many miles from home. And often many miles from their children. Women make up around 5% of the prison population. Women are more likely to serve shorter sentences than men, and trauma can often play a big role in their lives."
        },
        {
            "text": "We know that more than 50% have suffered domestic violence, and 53% faced emotional, physical or sexual abuse as a child. So, we suspected the way we interact with these women in prison needed to be trauma-informed, and the content we eventually make for them needs to be trauma-informed."
        },
        {
            "text": "Backing this up with research"
        },
        {
            "text": "Wonderful user Researcher Jenny Winfield needed to understand what exact content would have the biggest, most positive impact. She started her discovery with three women’s prisons: HMP New Hall, Styal and Send. "
        },
        {
            "text": "Over the course of several months, she interviewed many women and staff:"
        },
        {
            "text": "Initial findings were:"
        },
        {
            "text": "The importance of being ‘trauma-informed’"
        },
        {
            "text": "What are trauma-informed services? They take people’s trauma into account to avoid triggering reactions or re-traumatising them, and they adjust the behaviour of staff to support a person’s coping capacity. This approach allows survivors to manage their trauma symptoms successfully, so they are able to access, retain, and benefit from the services available. "
        },
        {
            "text": "In order to be trauma-informed, service providers (and that includes content providers on the Hub) also need to adopt five core values: "
        },
        {
            "text": "Method used for digging deeper"
        },
        {
            "text": "When digging deeper, we found so much more. Users were diverse and the wide array of problems faced were numerous and unknown. I can only give you some snapshots of the research to give you a taste of what we found, but please ask the Content Hub team if you'd like to see the research into the female estate in full. "
        },
        {
            "text": "What content did the women trust, feel safe with and want to hear?"
        },
        {
            "text": "After looking at user needs and feedback from this discovery, we started to design content to test. "
        },
        {
            "text": "First, we wanted to design a 'welcome' for women that would encourage them to use the Content Hub. This was based on insight that traumatised women don’t always trust or engage with services that claim to help them."
        },
        {
            "text": "The 3 test videos were:"
        },
        {
            "text": "All reactions were recorded for research and testing."
        },
        {
            "text": "As in the pilot male prisons, the women felt safer with a woman like themselves. The video, recorded by Brenda Birungi, who has lived experience of a women’s prison worked best for them. This is another example of 'authentic voice' that is so vital on the Content Hub."
        },
        {
            "text": "Gender-specific needs"
        },
        {
            "text": "Building on previous research in male prisons, we were careful to focus on specific needs for women, that is, needs different to those of men that required its own content on the Hub."
        },
        {
            "text": "For example, we found their mental health needs were different:"
        },
        {
            "text": "And we found accommodation was in some ways a woman-specific need:"
        },
        {
            "text": "Gender-specific sexual health"
        },
        {
            "text": "We also looked at content around women’s sexual health. We knew from our research this area could have a big impact. We worked on the idea of self-serve content: tiles that could be clicked on to access content. This is the kind of information that could be googled on the outside, but not in prison. Women might feel embarrassed or want to explore periods, breast-checking, sexual health and the menopause, on their own. In prison, they can't do this."
        },
        {
            "text": "We shared content from basic pages, the NHS, simple videos and podcasts. We also asked staff in prison healthcare to explain how a simple procedure – like a cervical smear test – takes place in prison (bearing in mind everything we’ve mentioned about trauma). The nurse shared questions women ask about the procedure, and we created content shaped by this which worked well, when tested."
        },
        {
            "text": "Women asked for content that the outside community sees, so they know they are being treated the same. But they also appreciate the extra steps we took in creating prison-focused and accessible content. The content needed to be accurate and reflect reality."
        },
        {
            "text": "We’ve gone on to develop content around visits, incentives and money. We’ve recorded short videos with staff at HMP Styal, which can be used across the women’s estate, and we’ve recorded audio with women who are in prison now. They’ve shared their experiences around these topics, so that other women can learn from them. This will be specific audio content on the Hub from women who have valuable experiences to share about how they’ve coped in prison."
        },
        {
            "text": "Working with personas to inform research and Hub content"
        },
        {
            "text": "What's next?"
        },
        {
            "text": "While specific launch dates are still to be confirmed, I know the hard work and valuable insights gained will be important in shaping the content women will access when they get their devices. By applying the trauma-informed principles to our work as content designers, it will also help us and the local digital communications managers shape content that can work for everyone in prison: men, young people and women. "
        },
        {
            "text": "A clear and final insight from this research is that sometimes these women speaking very honestly and emotionally have touched on issues that inevitably affect men and young offenders, but might not voice."
        },
        {
            "text": "If your team or department wants to create content for the Hub, please get in touch. "
        },
        {
            "text": "Email: hubcontentteam@digital.justice.gov.uk"
        }
    ]
}