{
    "url": "https://vets.blog.gov.uk/2022/03/04/food-standards-agency-job-vacancy-for-a-field-operations-veterinary-delivery-leader/",
    "title": "Food Standards Agency - Job Vacancy for a Field Operations Veterinary Delivery Leader",
    "authors": [
        "kenmeger"
    ],
    "categories": [
        "Government Veterinary Services",
        "Jobs and Experiences",
        "Professional development"
    ],
    "pub_date": "2022-03-04T17:17:29+00:00",
    "content": [
        {
            "heading": 3,
            "text": "Background"
        },
        {
            "text": "The FSA is a non-ministerial department of over 1300 people with the key responsibility to protect public health and consumers’ wider interest in food and animal welfare standards"
        },
        {
            "text": "A key function for delivering this work is shaping and guiding good practice through the delivery of official controls for food business operators (FBOs) such as slaughterhouses and meat processing plants. the FSA carries out a range of duties within these properties to ensure that food reaching the consumer remains safe for all. As well as ensuring the quality of food consumers have access to,  the FSA plays a vital role in ensuring the wellbeing of the animals that enter our food system, ensuring that they are healthy and well looked after."
        },
        {
            "heading": 3,
            "text": "Job description"
        },
        {
            "text": "As Field Operations Veterinary Delivery Leader you will play a key role through providing expertise and leadership to the Veterinary teams and enabling them to do their best work by offering expert advice and support. Working alongside the Field Management Group Leadership Team, you will help to ensure that FSA delivery of official controls consistently meets expectations for keeping our food safe."
        },
        {
            "text": "In providing strong direction and veterinary leadership to FSA teams across the country, the successful candidate will act as a voice of authority and expertise that colleagues can look to for guidance. You will lead on the delivery of consistent and quality work, developing systems that allow for the sharing of knowledge between Veterinary teams, and building on existing best practice ideals."
        },
        {
            "text": "The role can be challenging, and the successful candidate will seek to ensure standards across the UK are met and maintained, allowing the public to have confidence in the food on their tables. This position offers an opportunity for talented veterinarians to make a direct and positive impact upon the lives of thousands of animals within our food system, whilst also supporting the FSA’s efforts to protect public health and ensure food is safe for all."
        },
        {
            "text": "By providing leadership to those carrying out official controls on the FSA’s behalf, the work of the Field Veterinary Leader offers a rare chance to make a widespread and tangible difference in the quality of food in the UK."
        },
        {
            "text": "If you are excited by this opportunity and are capable of working at pace to deliver strong and sensible decisions that you will be proud to defend, apply at Civil Service Jobs for this important role within the FSA. Applications need to be completed and received before 11:55 pm on Sunday 13th March 2022."
        }
    ]
}