{
    "url": "https://naturalengland.blog.gov.uk/2022/03/04/hen-harrier-monitoring-and-the-actions-taken-when-a-tagged-bird-is-lost/",
    "title": "Hen harrier monitoring, and the actions taken when a tagged bird is lost",
    "authors": [
        "Dave Slater"
    ],
    "categories": [
        "Licensing",
        "Protected sites and species",
        "Science and evidence",
        "Wildlife"
    ],
    "pub_date": "2022-03-04T09:53:02+00:00",
    "content": [
        {
            "text": "Alongside our partners, Natural England is involved in a number of initiatives to support the recovery of hen harriers in England, including satellite tracking birds to investigate patterns of dispersal and survival. In this blog, we will share the latest update on tagged birds monitored by Natural England and explain the approach we take when a tag stops transmitting. We will also share as much information as we can on current investigations into confirmed hen harrier deaths."
        },
        {
            "text": "What does it mean when a tag stops transmitting? \nSatellite tags on hen harriers are powered by small solar panels. If a bird dies and the solar panel is no longer exposed to light, tags gradually stop transmitting until the battery drains completely. Natural mortality is high for juvenile hen harriers, especially in winter, and natural causes of death include predation, starvation and disease. However, illegal persecution on land managed for grouse shooting remains the main threat to the recovery of hen harriers, and Natural England research has found high rates of tag failure on grouse moors. Tags can stop transmitting due to malfunction or if they reach the end of their life, but are generally reliable."
        },
        {
            "text": "Therefore, when a bird goes missing, we always consider the possibility that it could have been illegally killed. When a tag stops transmitting, Natural England staff communicate with the police, scrutinise the data received from the transmitter, and attempt to retrieve the bird. This is not always straightforward, as the final transmissions from the tags do not always give a precise location. If a dead bird is retrieved, a post-mortem examination is carried out, normally by our partners at the Institute of Zoology, Zoological Society of London (ZSL). It is crucial in taking these steps that we are careful about what information is released, and when, as we do not want to risk compromising any criminal investigation carried out by the police."
        },
        {
            "text": "We work closely with the police throughout, and are committed to continuously improving our partnership working, and our processes and communications. As part of this commitment, Natural England is supporting the National Wildlife Crime Unit via the secondment of a full-time staff member working on tackling raptor persecution. When birds die, we aim to publicly share as much information as we can, without compromising any potential criminal investigation."
        },
        {
            "text": "Current status of satellite-tagged birds \nWe regularly share the status of all the satellite-tagged birds monitored by Natural England, and the latest update is now live."
        },
        {
            "text": "Since the last update in November 2021, tags on six birds have stopped transmitting; at this stage, we don’t know what has happened to them, but the birds are assumed to have died. These include the wild-reared juveniles Val, Percy, Jasmine, Ethel and Amelia, hatched in 2021, and the adult brood-managed bird R2-F1-20, hatched in 2020. The locations of the last satellite tag fixes are given in the update, although accuracy may be low, so the location of the last fix could be many kilometres away from the actual location of the bird. Despite searches, at present we have no further evidence to indicate whether they were lost due to normal over-winter causes of mortality such as starvation or predation, or to illegal killing. The tag data do not indicate that the satellite tags malfunctioned."
        },
        {
            "text": "We are pleased to still be tracking 19 birds, including eight juveniles hatched in 2021 and 11 adult birds, and are looking forward to following them back to the breeding grounds soon. The adults include Sorrel, Dru and Frank, tagged in 2016, 2017 and 2018 respectively and still providing regular updates."
        },
        {
            "text": "Post-mortem examination results \nIn our previous blog we shared the fact that two of the 2021 brood-managed (raised in captivity) birds had been found dead by Natural England staff in October 2021 and had been sent for post-mortem examination. Since then, we have received the full results of the post-mortem examinations, and are able to share the following summaries:"
        },
        {
            "text": "We have shared these findings with the police, who have reviewed all the facts, considered the history of the sites where the birds were found, and judged that, based on the information provided and available to them, there was no evidence to suggest any offences had been committed. Our presumption, therefore, is that these birds died due to natural causes. As these individuals were part of the brood management trial, these results will also be reviewed during the brood management evaluation. Four of the seven 2021 brood-managed juveniles are still alive and being tracked as of February 2022."
        },
        {
            "text": "Samples are taken during the detailed post-mortem examinations which assist in the evaluation of the health of the hen harrier population over the long term, and examples of these type of investigations include the storage of the skeleton for potential toxin analysis, or intestinal samples screened for the intensity and species of roundworm infestation."
        },
        {
            "text": "Ongoing investigation \nWe can confirm that a missing bird from 2021 is currently the subject of a police investigation. This is a different bird to the ones sent for post-mortem examination mentioned above. We are aware of public interest in this case, but, at present, Natural England has been asked by the police to not comment publicly. Investigations are led by the police and their timeframes will vary. Our top priority at this time is to ensure this investigation is not compromised, but we commit to sharing the full facts of Natural England’s involvement this case when we are informed that the investigation has reached a stage at which this would be appropriate."
        },
        {
            "text": "Clarification on quote \nOn 4 December 2021 an article was published in the Guardian, titled ‘Hen harriers’ friend: gamekeeping turns conservation in Yorkshire’, in which Natural England’s Stephen Murphy was quoted initially as saying that a tagged hen harrier named Betty ‘had been shot away from the estate before flying on to it’. The wording has been corrected upon our request to say that she ‘could have been shot away from the estate before flying on to it’."
        },
        {
            "text": "We want to clarify that no further information has come to light about this case. At the time, ground-breaking work by ZSL and Natural England confirmed that Betty was shot, using electron microscope techniques to show that metal had been propelled into her leg, and to detect the composition of metallic residues undetected by conventional x-rays. Whilst this proved Betty was shot, the leg injury was not thought to have been immediately fatal. It is thought that Betty could have flown to her last known location, and the location where she was shot is still unknown."
        },
        {
            "text": "Looking to the future \nWe are grateful to all the groups and individuals we work with for helping us gather the best information we can on what happens to tagged birds. It’s always hard to hear about the deaths of individual hen harriers, but as with all wild birds it is expected that some will not survive, and it is vital that our future conservation work is based on sound evidence. We welcome the promising increase in breeding hen harriers in northern England, and are hoping to see a further increase in breeding numbers in 2022."
        },
        {
            "text": "Acknowledgements\nA wide range of organisations are working together to support Hen Harrier recovery. These include: Natural England, Defra, RSPB, Forestry Commission, Moorland Association, United Utilities, National Trust, Hawk and Owl Trust, International Centre for Birds of Prey, Yorkshire Dales National Park Authority, Northumberland National Park Authority, Peak District National Park Authority, Nidderdale & Forest of Bowland Areas of Outstanding Natural Beauty, Northumberland Wildlife Trust, British Association for Shooting and Conservation, Game & Wildlife Conservation Trust, local police forces and the National Wildlife Crime Unit, various Estates and their representatives, and individuals including landowners, farmers, academic researchers and volunteer raptor enthusiasts. "
        }
    ]
}