{
    "url": "https://deframedia.blog.gov.uk/2022/03/04/nao-report-on-tree-planting/",
    "title": "NAO report on tree planting",
    "authors": [
        "Defra Press Office"
    ],
    "categories": [
        "Uncategorized"
    ],
    "pub_date": "2022-03-04T15:08:18+00:00",
    "content": [
        {
            "text": "Today the National Audit Office has published a report on Defra’s tree planting progress and the success of the Nature for Climate Fund (NCF)-funded Tree Programme so far. The NCF Programme was set up to deliver the Government’s landmark England Trees Action Plan in order to achieve its target of at least 7,500 hectares of annual tree-planting by the end of Parliament."
        },
        {
            "text": "The report acknowledges that Defra has made significant progress under challenging circumstances to launch multiple new grant schemes since the launch of the Programme, but also claims Defra is unlikely to meet this years’ tree planting target and raises questions about the long-term planning and monitoring of future planting schemes."
        },
        {
            "text": "Coverage in The Times, The Telegraph and the Independent reports on the NAOs’ assessment that progress towards the ambitious planting target is being hampered by reluctance among landowners to commit land for planting, a shortage of foresters, risks of seed and sapling shortages, and delays by the Forestry Commission in approving applications for planting grants."
        },
        {
            "text": "The NAO underplays the amount of tree-planting that will take place from other government-funded schemes this year, in addition to Nature for Climate Fund planting and privately-funded tree-planting. A number of government funded schemes that pre-date the NCF are still planting high volumes of trees this year and we forecast that when all government funded tree-planting is taken into account, between 2,200 and 2,900 ha of government funded tree planting will take place in 21/22, in comparison to 1,800 ha of government funded tree planting in 20/21."
        },
        {
            "text": "Our tree planting pathway is consistent with the Climate Change Committee’s advice on meeting net zero. The target is ambitious but achievable – over 6000ha/year was planted as recently as the 2000s, and in the England Trees Action Plan we have a more ambitious agenda on trees now than we did then. Our programme plan anticipates a year-on-year increase in tree planting as grant funding proposals are delivered."
        },
        {
            "text": "Environment Secretary George Eustice said:"
        },
        {
            "text": "\"The challenge of climate change requires stretching targets and high ambition. The NAO report acknowledges that we have worked at pace in difficult circumstances to rise to this challenge but we are under no illusion that there is more to do. That is why we will treble the number of trees planted rates by the end of this Parliament, backed up by over £500m.”"
        },
        {
            "text": "Forestry Minister Lord Goldsmith has committed on several occasions that no one will be worse-off as a result of planting trees now rather than waiting for Environment Land Management (ELM) schemes. By taking up grants such as the England Woodland Creation Offer now, farmers and landowners will be able to transfer into a future environmental scheme at agreed points without having to repay their current funding."
        },
        {
            "text": "We are confident that we are on track to meet the UK-wide target of planting 30,000ha per year by the end of this Parliament and continue to work closely with the devolved administrations to raise ambition on tree planting as we meet our shared responsibility of net zero emissions."
        },
        {
            "text": "We will now be considering the NAO report’s findings carefully before responding in due course."
        },
        {
            "text": "Follow Defra on Twitter, and sign up for email alerts here."
        }
    ]
}