{
    "url": "https://governmentscienceandengineering.blog.gov.uk/2022/03/04/national-careers-week-science-and-engineering/",
    "title": "National Careers Week: Science and Engineering",
    "authors": [
        "Jamal Arabi"
    ],
    "categories": [
        "Blog Series",
        "GSE Opportunities"
    ],
    "pub_date": "2022-03-04T16:06:40+00:00",
    "content": [
        {
            "text": "Do you like to solve problems and discover new things? If so, then a career in government science and engineering might be for you.The government is always on the lookout for talented, versatile people to join, and the scope of science and engineering roles available is vast."
        },
        {
            "text": "If you have no idea where to start but would like to join the science and engineering field, then read on. There are many entry-level roles that will help introduce you to the world of science and engineering, as well as apprenticeship roles which give you the opportunity to train as you go. No matter where you start, you’re guaranteed to gain hands-on experience and learn from experts."
        },
        {
            "text": "We’ve rounded up some early career opportunities within science and engineering, so keep reading to see what’s out there."
        },
        {
            "text": " "
        },
        {
            "heading": 3,
            "text": "Defence Science and Technology Laboratory (Dstl)"
        },
        {
            "text": "The Defence Science and Technology Laboratory (Dstl) is the science inside UK defence and security. Dstl is an executive agency of the Ministry of Defence (MOD) providing world-class expertise and delivering cutting-edge science and technology for the benefit of the nation and allies."
        },
        {
            "text": "Dstl is one of the principal government organisations dedicated to science and technology in the defence and security field."
        },
        {
            "text": "Dstl supplies specialist services to MOD and wider government, working collaboratively with external partners in industry and academia worldwide, providing expert research, specialist advice and invaluable operational support."
        },
        {
            "text": "We are innovative, collaborative, and impactful."
        },
        {
            "text": "Job opportunities within Dstl"
        },
        {
            "text": "We're always on the lookout for talented, creative, dedicated, and innovative individuals to join us."
        },
        {
            "text": "Graduates, students, and apprentices contribute to the future of our organisation, and we take great pride in recruiting talented and enthusiastic young people each year."
        },
        {
            "text": "We have exciting projects and assignments that we can’t wait to get you involved in. We’re confident that you’ll join Dstl and see things through a different lens. We want you to come in, think differently, and bring solutions to our challenges."
        },
        {
            "text": "There are many job opportunities currently at Dstl to apply go onto Civil Service Jobs."
        },
        {
            "text": " "
        },
        {
            "heading": 3,
            "text": "British Toxicology Society (BTS)"
        },
        {
            "text": "What is Toxicology?"
        },
        {
            "text": "Toxicology is the study of how harmful effects may occur - in humans, other animals, and plants - and how exposure can be avoided or minimised."
        },
        {
            "text": "In today’s world, we are exposed to many thousands of chemicals, both natural and man-made, on a daily basis. Unfortunately, some may have harmful effects. Toxicology is the study of the adverse effects of chemicals on living organisms in humans, other animals, and plants. It may be necessary to avoid or minimise exposure."
        },
        {
            "text": "Many types of toxicologists: Pharmaceutical, Academic, Government Toxicologist and many more."
        },
        {
            "text": "For more information on toxicology watch this video!"
        },
        {
            "text": "How do I become a Toxicologist?"
        },
        {
            "text": "There are currently no undergraduate courses where toxicology is taught on its own; however, toxicology can be studied as part of many undergraduate degree courses in combination with other relevant subjects such as biochemistry or pharmacology. However, you may choose to specialise in toxicology in post graduate studies."
        },
        {
            "text": "For more information on what qualification is required visit the Prospects  website."
        },
        {
            "text": "The BTS"
        },
        {
            "text": "The BTS is a learned society for those with a professional interest in toxicology that provides educational, professional, and scientific support for members throughout their careers."
        },
        {
            "text": "Professional institution for Toxicologists: "
        },
        {
            "text": "Example Career Paths…. "
        },
        {
            "text": "Many have gone onto different roles. Here is just a list of some of the roles that many have gone into:"
        },
        {
            "text": "There are many government departments that offer toxicologist roles such as: Home Office, Food Standard Agency, Health and Safety Executive (HSE) and many more."
        },
        {
            "text": "For more insight here’s a link to a webinar that took place last year on Careers in toxicology."
        },
        {
            "text": " "
        },
        {
            "heading": 3,
            "text": "Met Office"
        },
        {
            "text": "The Met Office is the national meteorological service for the UK. And provide critical weather services and world-leading climate science, helping you make better decisions to stay safe and thrive."
        },
        {
            "text": "Introduction to Deployable Project Scientists Team"
        },
        {
            "text": "The Met Office has recently formed a ‘Deployable Project Scientists Team’. This team is based in the Programmes Directorate and provides new recruits a breadth of experience across Met Office science, as well as extensive training opportunities and the chance to contribute to high priority work at an early career stage."
        },
        {
            "text": "New scientists are each assigned a host team and project for 3-6 months, during which time they become fully immersed in that area of the Met Office, learning broadly applicable skills and gaining a detailed understanding of the goals of their team. They will take part in multiple placements over an 18–24 month period, with the aim to provide as varied opportunities as possible while developing a general understanding of how the Met Office works and proficiency in widely used tools."
        },
        {
            "text": "In parallel, the team members attend taught courses covering Meteorology and Climate Science and have access to a wealth of online and hybrid training opportunities to support both their current project work and long-term career development. They also come together as a team for bespoke events, including Invited Speakers sessions (where they can quiz Met Office experts on their area of expertise) and a journal club."
        },
        {
            "text": "The Deployable Project Scientists are in post for up to two years with the intention for them to find a permanent Met Office home once they have finished their placements. These roles are purposefully filled with early career scientists from outside the organisation as they are likely to gain maximum benefit from this initiative. The intention is to run a new recruitment campaign every 18 months and the roles will be advertised on the Met Office careers webpage."
        },
        {
            "text": "If you'd like to find out more about Met Office opportunities, please click here."
        },
        {
            "text": " "
        },
        {
            "heading": 3,
            "text": "Food Standards Agency"
        },
        {
            "text": "Lois Gaden share’s their journey in Civil Service "
        },
        {
            "text": "Science Communication Lead, Food Standards Agency (HEO)"
        },
        {
            "text": "After completing my degree in Biology at university I wanted to pursue a career in science. I found the most interesting part of my degree to be explaining my science to others, especially to an audience with different backgrounds and specialisms. I went into science communications in the pharmaceutical sector for just over a year before applying for the role at the Food Standards Agency (FSA) through Civil Service Jobs."
        },
        {
            "text": "As Science Communication Lead for the FSA, I was responsible for drafting science communications for our website. I worked closely with our Central Communications Directorate to deliver projects and support coordination between the Science Directorate. I led on developing our science communication strategy to help maximise the impact and reach of our science communications."
        },
        {
            "text": "Current Role…"
        },
        {
            "text": "I have since moved to role of Partnerships Coordinator at the FSA, where I build on my communication skills to form key partnerships with our science stakeholders, such as researchers, academics, charities, and other government departments. A science communication role gives you the flexibility to move into areas such as communications, project management or to a more science-focused role."
        },
        {
            "text": " "
        },
        {
            "text": "There are many opportunities within government. Remember to sign up to the Civil Service Jobs website for many Science and Engineering roles."
        },
        {
            "text": "Top Tip: Ensure you have the job alerts on, so you get the notifications when new jobs are advertised. As the saying goes “The world is your oyster”."
        },
        {
            "text": " "
        }
    ]
}