{
    "url": "https://ipo.blog.gov.uk/2022/03/04/the-future-of-protecting-designs-have-you-had-your-say-yet/",
    "title": "The future of protecting designs: have you had your say yet?",
    "authors": [
        "Fiona Warner"
    ],
    "categories": [
        "Business",
        "Design",
        "Design right",
        "IPO"
    ],
    "pub_date": "2022-03-04T13:39:47+00:00",
    "content": [
        {
            "text": "From the moment I wake up, to when I go to bed, I see design all around me. In the clothes I choose, the packaging of my toothpaste, down to the shape of my laptop. Design is part of all our lives and at the IPO we make sure that creators can easily protect their designs. "
        },
        {
            "text": "Now the UK has left the EU, we have the opportunity to look at how well the UK design system is working for UK designers and to make sure that it continues to support businesses in an increasingly digital environment.  "
        },
        {
            "text": "It is important that we have the input of everyone who might be impacted by the design system. If you are a designer, someone who works in design, or an IP professional then we want to hear from you."
        },
        {
            "text": "Keep reading to find out more about the issues you may want to have your say on. "
        },
        {
            "heading": 3,
            "text": "Different design rights "
        },
        {
            "text": "You can protect your designs in several different ways in the UK – as registered, supplementary unregistered, and UK unregistered designs. Some designs can also be protected by copyright.  We’d like you to tell us if you think it's useful to have different rights available, or whether we should simplify the system. "
        },
        {
            "heading": 3,
            "text": "Where you disclose your creations: protecting unregistered designs "
        },
        {
            "text": "One way of protecting a design in the UK is as a supplementary unregistered design. "
        },
        {
            "text": "The UK’s departure from the EU means that a product is only protected as supplementary unregistered design if it is first disclosed in the UK. We know this concerns designers who sell products in the UK and EU and want to hear your views on how we could address this."
        },
        {
            "heading": 3,
            "text": "Checking for similar-looking designs "
        },
        {
            "text": "When we receive a design application, we  do not currently check whether it is new compared to previous designs. We want to hear whether you are happy with the current system or whether we should carry out a search as part of the registration process. "
        },
        {
            "heading": 3,
            "text": "How long should design deferment be? "
        },
        {
            "text": "Applicants can currently choose to defer publication and registration of their design for up to 12 months. This gives them flexibility to reduce the risk of a design being copied before it is marketed.  We want to know how long you think the UK’s deferment period should be.  "
        },
        {
            "heading": 3,
            "text": "Future technology "
        },
        {
            "text": "We need to ensure that the design framework continues to be relevant as new technologies such as AI develop.  We also want to make sure that designers can protect their products in an increasingly digital environment. How can we make  sure the designs system meets the challenges of future technologies? "
        },
        {
            "heading": 3,
            "text": "Your experience of enforcing your design rights"
        },
        {
            "text": "The UK has one of the best intellectual property systems in the world. But we know that the cost of enforcing rights can be a barrier, particularly for individuals and small businesses. We want to hear about your experiences of enforcing your designs in the UK, and how we could improve the system. "
        },
        {
            "heading": 3,
            "text": "How you can get involved "
        },
        {
            "text": "Design touches so much of our everyday lives, and involves so many businesses across the UK, from fashion and furniture to engineering and transport. To make sure our system works for all these industries and consumers, we want to hear about the design issues that impact you. "
        }
    ]
}