{
    "url": "https://civilservicelocal.blog.gov.uk/2022/03/04/your-future-and-the-north-west-civil-service/",
    "title": "Your Future and the North West Civil Service",
    "authors": [
        "dianecoates"
    ],
    "categories": [
        "North West England"
    ],
    "pub_date": "2022-03-04T14:12:38+00:00",
    "content": [
        {
            "text": " "
        },
        {
            "text": "The civil service in the North West is in the middle of some exciting changes. There are a number of programmes underway, with Places for Growth, the Levelling Up agenda, and Modernisation and Reform promising lots of new opportunities for colleagues."
        },
        {
            "text": "But what are these programmes? What do they mean for your future career? And how can you be ready to take advantage of the opportunities presented by them?"
        },
        {
            "text": "CS Local North West is delighted to be working together with the North West Heads of Place Directors to present an online event for you to learn more about the civil service in our region. We are keen to build your understanding of the fantastic opportunities for talent and career development and the work underway to shape the future of the civil service."
        },
        {
            "heading": 3,
            "text": "Agenda"
        },
        {
            "heading": 4,
            "text": "9:00am to 10:00am Departmental Talent Development Schemes"
        },
        {
            "text": "Hear from speakers based in two of the largest departments in the region - HM Revenue and Customs and Department forWork and Pensions. In this session, we’ll give a high-level overview of the talent development offer in the largest departments in the region, before discussing how the skills acquired on any development programme can be transferred across roles, and help to shape your career."
        },
        {
            "heading": 4,
            "text": "10:00am to 11:00am Cross-Departmental Talent Development"
        },
        {
            "text": "In addition to ‘in-house’ development schemes offered by many departments, there are also schemes, which introduce delegates to colleagues from across departmental boundaries. These schemes provide fantastic opportunities to learn more about the wider civil service, and to develop career skills that can be useful in any role. Join this session to learn more!"
        },
        {
            "heading": 4,
            "text": "11:00am to 12:00pm Places for Growth and Levelling Up"
        },
        {
            "text": "The Places for Growth Programme is a new team within the Cabinet Office seeking to relocate Civil Service roles out of London, to the regions and nations of the UK. Join this session to learn more about the work underway in the NW, including a look at the range of departments based in our region, and the opportunities to shape your career."
        },
        {
            "heading": 4,
            "text": "12:00pm to 13:00 pm Heads of Place"
        },
        {
            "text": "The Heads of Place initiative aims to embed a community of Civil Servants networked across departmental boundaries. Each region will be led by senior leaders, including the Head of Place, working together to shape the future. In this session you can hear from the North West Heads of Place, and learn more about their four core objectives."
        },
        {
            "heading": 4,
            "text": "1:00pm to 2:00pm Modernisation and Reform"
        },
        {
            "text": "The Declaration on Government Reform outlines how the Civil Service and Ministers will reform government together, to deliver better for citizens. Join this session to learn more about the network of Modernisation and Reform Champions, spread across the North West, and how they’re helping to support the vision of a Skilled Civil Service."
        },
        {
            "heading": 4,
            "text": "2:00pm to 3:00pm Government Skills and Curriculum Unit"
        },
        {
            "text": "The Government Skills and Curriculum Unit (GSCU) aims to ensure that all civil servants have the training, skills, and networks to perform their roles to the best of their capabilities. In this session, representatives of the GSCU will tell us about their work, including the five strands of the Curriculum and Campus for Government skills."
        },
        {
            "heading": 4,
            "text": "3pm to 4pm Fast Stream and Apprenticeships"
        },
        {
            "text": "With all of the opportunities available - whether to progress in your current role, across departmental boundaries, or in a new profession - you may have questions about gaining access. Join this session to hear from colleagues in the Civil Service Fast Stream, and our Apprenticeship teams."
        },
        {
            "heading": 4,
            "text": "4:00 pm to 5:00 pm Professions"
        },
        {
            "text": "Did you know that there are 28 different recognised professions within the Civil Service? From communicators and engineers, to procurement managers and lawyers, each profession develops the capability of a group of people with particular skills, knowledge or expertise. Learn more about the range of professions, and the training available."
        },
        {
            "heading": 3,
            "text": "How do I find out more?"
        },
        {
            "text": "If you have any questions about the event please email cslocalnw@cabinetoffice.gov.uk"
        },
        {
            "text": " "
        },
        {
            "text": "\n"
        }
    ]
}