{
    "url": "https://dcmslibraries.blog.gov.uk/2025/10/29/collaboration-is-the-key-public-libraries-as-gateways-to-nature/",
    "title": "Collaboration is the Key -public libraries as gateways to nature",
    "authors": [
        "Cordelia Spalding FRSA, Senior Specialist for Public Engagement, Natural England"
    ],
    "categories": [
        "Case study"
    ],
    "pub_date": "2025-10-29T10:06:46+00:00",
    "content": [
        {
            "text": "In an era where connection - to nature, community, and wellbeing - is more important than ever, Culture Nature England (CNE) is helping to open up new opportunities for people to engage with the natural world. As part of Natural England’s Protected Site Strategy research and development programme, CNE reimagines public libraries as gateways to nature, creativity, health, and community resilience. At its heart, the programme aims to inspire more people to care about and connect with nature - especially those who may not typically engage with it. Delivered in partnership with Libraries Connected, CNE is bringing this vision to life through practical, community-led projects that strengthen both people and places."
        },
        {
            "text": "Protected Site Strategies are all about working with a wide range of stakeholders to collectively tackle environmental pressures that impact protected sites and their surrounding communities, landscapes or seascapes. These pressures could be nutrient pollution, climate change, or various other complex issues that cannot easily be tackled without collaborative action."
        },
        {
            "text": "This is why Natural England partnered with Libraries Connected on CNE; CNE is a celebration of cross-disciplinary collaboration. It brings together librarians, conservationists, artists, educators, health professionals, and community groups to co-create experiences that deepen people’s connection to the natural world. With 25 library services across England receiving funding to deliver hundreds of activities, the programme has reached thousands of individuals—many of whom face barriers to accessing nature or cultural programming."
        },
        {
            "text": "From sensory walks and archaeological surveys to courtyard gardens and immersive digital experiences, CNE activities reflect the richness of its partnerships. Libraries have worked with organisations such as  Wildlife Trusts, National Parks, Volunteer groups, schools, care homes, ESOL groups, and health and creative practitioners- representing wide cultural interests and offering the most diverse and inclusive of entry points. These collaborations have not only expanded the reach of nature-based programming but have also reshaped perceptions of what libraries can offer, and how collaboration brings sustainable and sustained approaches that can ease many of today’s societal challenges."
        },
        {
            "text": "Solihull Libraries’ “Hill of the Elms” project, partnered with the Young Archaeologists Club, offering archaeological training for young people – blending natural history with cultural heritage. The result was a powerful reminder that nature and culture are deeply intertwined—and that libraries can be custodians of both."
        },
        {
            "text": "In Kirkby-in-Ashfield, Inspire Libraries transformed a disused courtyard into a sensory-garden. Staff noted how their existing skills translated seamlessly into nature-based programming, reinforcing the library’s role as a community anchor."
        },
        {
            "text": "Somerset Libraries took a different approach. Using digital tools, VR headsets, soundscapes, and filmed visits to protected sites, libraries demystified nature for those with limited mobility or access. These events not only increased library membership but also strengthened relationships with schools and environmental partners."
        },
        {
            "text": "In Bolton, Farnworth Library focused on inclusion, tailoring activities to ESOL learners, families, and older residents. The programme strengthened the library’s ties to the Green Libraries initiative and equipped staff with the confidence to embed environmental themes across their service offer."
        },
        {
            "text": "Lowestoft Library in Suffolk used CNE to respond to local health challenges and limited green space. By co-creating a garden with the community and partnering with Suffolk Wildlife Trust, the library fostered a sense of ownership and wellbeing. "
        },
        {
            "text": "Gateshead Libraries’ “Welcoming Nature” project exemplified the power of nature to foster social connection. Working with asylum seekers, the library partnered with a faith-based charity and a nature-focused artist to deliver walks, art workshops, and shared meals. Participants described the sessions as transformative, offering respite, kindness, and a sense of belonging."
        },
        {
            "text": "Camden’s Pancras Square Library partnered with the London Wildlife Trust to connect children from disadvantaged backgrounds with nature through storytelling and sensory exploration. Visits to Camley Street Natural Park helped children feel welcome in green spaces and inspired creative reflection. "
        },
        {
            "text": "Finally, work with Hartlepool and Middlesbrough libraries, Teesside Valley Wildlife Trust, Natural England’s Health team and “You’ve Got this”, (Sport England satellite), has gone from strength to strength. Resulting in an area wide initiative that will work across South Tees, Redcar & Cleveland and Middlesbrough Library Services delivering a new programme: “Naturally Active Libraries”, working with communities across the area and building a sustainable “template” that can then be rolled out further afield."
        },
        {
            "text": "Across all these case studies, a common thread emerges: libraries are uniquely positioned to bridge gaps—between people and nature, between disciplines, and between communities, and how Protected Site Strategies are a perfect vehicle to bring partners together to solve shared problems and ensure recovery for Nature and Communities. The Culture Nature England programme has not only expanded what libraries do, but also who they do it with. It has shown that with the right partnerships, even modest resources can create profound impact."
        },
        {
            "text": "As libraries continue to evolve, CNE offers a compelling blueprint for how cross-sector collaboration can unlock new possibilities for public spaces, environmental engagement, and community wellbeing."
        }
    ]
}