{
    "url": "https://mhclgmedia.blog.gov.uk/2025/10/29/coverage-of-1-5-million-homes-target/",
    "title": "Coverage of 1.5 million homes target",
    "authors": [
        "mhclgpress"
    ],
    "categories": [
        "Housing"
    ],
    "pub_date": "2025-10-29T11:08:00+00:00",
    "content": [
        {
            "text": "There has been media coverage today questioning whether the government’s 1.5 million homes target is achievable and concerns about the OBR forecast on housebuilding being too optimistic."
        },
        {
            "text": "From the outset the government has been clear this is a stretching but achievable target, and thanks to the planning reforms already introduced, including the updated National Planning Policy Framework, this alone will drive housebuilding to its highest level in over 40 years and add £6.8 billion to the UK economy."
        },
        {
            "text": "The OBR’s estimate only covers existing planning reforms and said this will boost housebuilding by 170,000 homes over five years – reaching 1.3 million new homes by 2029/30. This does not account for pro-growth reforms in the landmark Planning and Infrastructure Bill, the National Housing Bank, the £39 billion Social and Affordable Homes Programme, or wider measures coming down the track.  "
        },
        {
            "text": "When the government announced an overhaul of the planning system within its first month of office, it was publicly supported by a wide range of representatives across the housing sector who welcomed the first and most important step to break down barriers to development."
        },
        {
            "text": "Last month the Housing Secretary convened leading developers and housebuilders to discuss the next phase of planning reform and how to most effectively ramp up housebuilding in the months ahead."
        },
        {
            "text": "Most recently the Housing Secretary has agreed an emergency package with the Mayor of London to accelerate housebuilding in the capital and ensure more affordable homes are built – this was warmly welcomed by the housing sector to get spades in the ground faster and unlock stalled housing sites.  "
        },
        {
            "text": "The government remains confident in its plans to get Britain building and will continue working closely with the OBR and sector experts to monitor delivery and adapt as needed."
        },
        {
            "text": "A Ministry of Housing, Communities and Local Government spokesperson said:“We will leave no stone unturned to build the 1.5 million homes this country desperately needs and restore the dream of homeownership. "
        },
        {
            "text": "“On top of the major planning changes we have already introduced to get developers building and our huge £39 billion investment in social and affordable housing, we are going further and faster to accelerate reforms and bring about the biggest era of housebuilding in our country’s history.”"
        }
    ]
}