{
    "url": "https://companieshouse.blog.gov.uk/2025/10/29/data-protection-for-small-businesses-practical-support-from-the-information-commissioners-office-ico/",
    "title": "Data protection for small businesses: practical support from the Information Commissioner's Office (ICO)",
    "authors": [
        "Faye Spencer, Head of Business Service - The ICO"
    ],
    "categories": [
        "Running a company",
        "Starting a company"
    ],
    "pub_date": "2025-10-29T09:32:46+00:00",
    "content": [
        {
            "text": "Running a business can feel daunting, with so many things to do, and sometimes not enough time to do them. But it’s important that you make time for data protection - ideally from the very beginning, but it’s never too late to start."
        },
        {
            "text": "Any personal information your business holds, including names, addresses, email addresses or payment details, needs to be used fairly and securely in line with data protection law. Handling this information in the right way:"
        },
        {
            "heading": 2,
            "text": "How the ICO can help your business"
        },
        {
            "text": "The Information Commissioner's Office (ICO) is the UK's independent regulator for data protection. We turn data protection laws into jargon free, practical resources that make it quicker and easier to put data protection into practice and responsibly unlock the value of the personal information you hold."
        },
        {
            "text": "Our resources are funded by the data protection fee, which all businesses are required to pay by law, unless they’re exempt. You can check if you need to pay the fee or if you’re exempt, and your fee amount (typically £52 or £78 per year) by using the simple online fee checker tool on the ICO website."
        },
        {
            "text": "To protect the personal information you hold, you need procedures in place for its whole lifecycle, from collection and processing to storage and deletion. This information could be about:"
        },
        {
            "text": "Our handy resources show you how to store, share and dispose of this information safely, whilst keeping your systems secure. They’ll also help you put the right measures in place to respond correctly when people ask you about the information you hold."
        },
        {
            "text": "Small businesses can struggle to find time for data protection. That’s why our resources are bite-sized and designed specifically for people with limited knowledge of data protection. They include a mixture of advice, tips, tools and videos, that will help you to use people’s information confidently and lawfully as your business grows.  "
        },
        {
            "text": "Getting started with data protection: a step-by-step guide is a good place to start, with 8 easy steps you can quickly put into practice. There’s also a checklist to help you see how well your business is doing, with practical actions to improve."
        },
        {
            "text": "The ICO also offer a business advice helpline and live chat service to answer any questions, so whatever support you need, help is at hand."
        }
    ]
}