{
    "url": "https://civilservice.blog.gov.uk/2025/10/29/find-your-place-to-grow-fast-stream-opens-doors-across-the-uk/",
    "title": "Find Your Place to Grow: Fast Stream Opens Doors Across the UK",
    "authors": [
        "Civil Service"
    ],
    "categories": [
        "A great place to work"
    ],
    "pub_date": "2025-10-29T15:49:27+00:00",
    "content": [
        {
            "text": "The Government has an ambition to be closer to the communities it serves, and representative of the whole of the UK. Places for Growth is delivering this work, by ensuring more high quality roles are located outside of London. The Civil Service Fast Stream is creating exciting opportunities for graduates to build rewarding careers across the country, develop their careers whilst staying rooted in their communities. This is being driven by the Government’s ambition for 50% of Fast Stream roles to be based outside London by 2030.  "
        },
        {
            "text": "The Civil Service Fast Stream creates incredible career opportunities for new graduates, building a thriving career in Government. Fast streamers can deliver impactful, rewarding work and develop a career regardless of location. John Parker joined the Fast Stream through the Darlington Economic Campus pilot. His first year was spent with the Department for Business and Trade, where he worked on the Swiss Free Trade Agreement. In his second year, at HM Treasury, he tackled diverse challenges including Ukraine-related projects, Mayoral engagement, and work on the Heathrow expansion. This allowed him to work on challenging policy work and develop new skills while staying connected to his local community in the North East."
        },
        {
            "text": "The benefits extend beyond individual career growth. Abi Duckworth's journey shows how persistence pays off. After an initial unsuccessful application, she joined the Department for Work and Pensions as a Work Coach in Lincolnshire. This experience gave her the confidence and skills needed to successfully re-apply to the Fast Stream. Based in Nottingham throughout her programme, Abi worked across multiple departments on nationally significant projects such as net zero policy for social housing. Abi now works as a Grade 7 in MHCLG's Resilience and Response Directorate."
        },
        {
            "text": "The Fast Stream can also offer opportunities to explore living in different parts of the UK, as some candidates opt to move to different locations for their placements. Filippo Pasquali moved from London to Wales through the Operational Delivery scheme. \"The Fast Stream helped me settle into a new community,\" he shares. Working between HMRC and DWP whilst living in Cardiff, Filippo has developed leadership skills, contributed to nationally relevant projects, and embraced local culture – including plenty of rugby. "
        },
        {
            "text": "Whether starting a career, looking for a change, or wanting to contribute to meaningful public service work closer to home, the Fast Stream offers a pathway to impactful work across government departments throughout the UK."
        },
        {
            "text": "Applications are now open for those ready to discover their place to grow with the Civil Service Fast Stream."
        }
    ]
}