{
    "url": "https://naturalengland.blog.gov.uk/2025/10/29/growing-stronger-together-community-action-for-nature/",
    "title": "Growing stronger together: community action for nature",
    "authors": [
        "David Drake"
    ],
    "categories": [
        "Connecting People with Nature",
        "Development",
        "Education",
        "Green Infrastructure",
        "Mental health and wellbeing",
        "Natural England",
        "Nature",
        "Parks, trails and nature reserves",
        "Wildlife"
    ],
    "pub_date": "2025-10-29T15:47:07+00:00",
    "content": [
        {
            "text": "By David Drake, Director for People and Nature, Natural England"
        },
        {
            "text": "The Nature Towns and Cities Partnership established by The National Lottery Heritage Fund, the National Trust and Natural England, brings together organisations across the UK with a shared vision for happier, thriving towns and cities where nature and communities can flourish together. "
        },
        {
            "text": "Last week the partnership convened a conference on Creating Nature Neighbourhoods, Towns and Cities hosted by the Co-op, as a funding partner in the Nature Neighbourhoods project, at their HQ in Manchester.  "
        },
        {
            "text": "The event brought together an inspiring collection of community voices, all united by a shared belief that when nature grows stronger, so do communities. The energy in the room was palpable as voluntary, community and social enterprise organisations from across the UK gathered to celebrate achievements, share knowledge, and chart a course for the future of community-led environmental action. "
        },
        {
            "heading": 4,
            "text": "Natural England's Wider Community Work"
        },
        {
            "text": "The conference provided an excellent platform to showcase the exciting opportunities within the Nature Towns and Cities programme and highlighted what we can achieve when we work together. Natural England works alongside communities across the country and recognises that meaningful environmental change happens when local people are empowered to act in their neighbourhood."
        },
        {
            "text": "Natural England has drawn on the experiences of our area teams colleagues working with communities, and many national and regional organisations to co-develop five core principles for engaging communities to support their ambitions for nature where they live."
        },
        {
            "text": "We provide expert knowledge, guidance, and practical advice and support to help communities protect and enhance their local environments. Whether it's helping a residents' association create a community orchard, supporting communities to build their  green skills that meet their needs, or working with faith groups to green their spaces, our approach remains consistently community centred."
        },
        {
            "heading": 4,
            "text": "The Nature Towns and Cities Offer"
        },
        {
            "text": "The Nature Towns and Cities programme represents an ambitious step forward in this community-focused approach. Building on the learning from the founding partners community programmes including Nature Neighbourhoods, we’re working with voluntary, community and social enterprise organisations to understand local needs."
        },
        {
            "text": "Recognising that these groups are often best positioned to build long-term trust within their communities, Nature Towns and Cities is working with these organisations to co-design the support they need to bring nature home to urban neighbourhoods and strengthen local networks. "
        },
        {
            "heading": 4,
            "text": "Health, Access, and Green Social Prescribing"
        },
        {
            "text": "Natural England's work with communities increasingly focuses on the powerful connections between access to nature and public health. Unequal access to quality green spaces contributes to health inequalities, and our community partnerships actively address this challenge."
        },
        {
            "text": "Green social prescribing represents a particularly exciting area of growth. Natural England works with community groups to develop nature-based activities that healthcare professionals can recommend as part of treatment plans. "
        },
        {
            "text": "From guided woodland walks for people managing depression to community gardening sessions for those recovering from illness, these programmes demonstrate nature's role as a powerful health intervention. They also recognise that nature's benefits extend far beyond environmental improvement – they're fundamental to building resilient, healthy communities."
        },
        {
            "heading": 4,
            "text": "Looking Forward: The Power of Partnership"
        },
        {
            "text": "The conference reinforced a irrefutable fact: the most effective environmental action happens when communities are given licence lead, and organisations like Natural England, the National Trust and The National Heritage Lottery Fund provide supporting foundations. "
        },
        {
            "text": "The enthusiasm and innovation displayed by conference attendees, from urban food growing projects to community-led river restoration initiatives demonstrates the incredible potential that exists when local knowledge meets appropriate support."
        },
        {
            "text": "As we move forward, Natural England remains committed to this collaborative approach. Whether through Nature Towns and Cities, health-focused initiatives, or the countless other ways we work with communities, our role is to amplify and support the remarkable work already happening in neighbourhoods across the country. The conference was a great step forward as we continue to support communities."
        }
    ]
}