{
    "url": "https://defrafmp.blog.gov.uk/2025/10/29/king-scallop-implementation-group-spotlight-on-sustainability/",
    "title": "King Scallop Implementation Group: spotlight on sustainability",
    "authors": [
        "Shellfish FMP policy team, Defra"
    ],
    "categories": [
        "- Defra led FMPs",
        "Implementation"
    ],
    "pub_date": "2025-10-29T16:00:00+00:00",
    "content": [
        {
            "text": "The King Scallop Implementation Group (KSIG) met online in August 2025  to continue its work on improving the sustainability and management of king scallop fishing across the UK."
        },
        {
            "text": "Find the meeting minutes on our GOV.UK page: King Scallop Implementation Group meeting minutes"
        },
        {
            "heading": 2,
            "text": "Spotlight on the Scallop Fishery Improvement Project (FIP)"
        },
        {
            "text": "A major focus of the meeting was the UK King Scallop Fishery Improvement Project (FIP), which officially launched in March 2025. "
        },
        {
            "text": "An update was given to highlight the work that is going on, and how the KSIG’s work will help support the FIP."
        },
        {
            "text": "The FIP is a six-year plan (2025–2031) aiming to bring UK king scallop fisheries in line with the Marine Stewardship Council (MSC) Fisheries Standard for sustainability."
        },
        {
            "text": "The project is led by the fishing industry and supported by scientists, regulators, retailers and environmental groups. It covers 16 areas around the UK where king scallops are caught using dredge gear."
        },
        {
            "text": "It works alongside the fisheries management plan (FMP) and together, they aim to improve how king scallop fishing is managed across the UK. To do this, the project focuses on three things:"
        },
        {
            "heading": 2,
            "text": "Looking ahead"
        },
        {
            "text": "The next KSIG meeting is scheduled for 13 November 2025."
        },
        {
            "text": "To support transparency, we share all our meeting notes online. You can read them here: King Scallop Implementation Group meeting minutes."
        },
        {
            "heading": 2,
            "text": "Want to get involved?"
        },
        {
            "text": "We currently have four open places on the group:"
        },
        {
            "text": "If you would like to be considered, please get in touch for more information about joining. Email us at shellfish@defra.gov.uk."
        }
    ]
}