{
    "url": "https://forestrycommission.blog.gov.uk/2025/10/29/new-clearer-easier-accessible-guidance-for-the-england-woodland-creation-offer/",
    "title": "New clearer, easier, accessible guidance for the England Woodland Creation Offer",
    "authors": [
        "Louise Alexander"
    ],
    "categories": [
        "Woodland creation"
    ],
    "pub_date": "2025-10-29T09:00:00+00:00",
    "content": [
        {
            "text": "We’ve been busy working behind the scenes in collaboration with the Department for Environment, Food and Rural Affairs' GOV.UK Farming Content Improvement team, to enhance EWCO information on GOV.UK. Our refreshed GOV.UK guidance is now clearer, easier to find and more accessible for everyone."
        },
        {
            "heading": 2,
            "text": "Understanding the challenges applicants faced"
        },
        {
            "text": "Despite a 30% increase in planting applications in 2024/25 compared to 2023/24, we want the application process to be as smooth as possible. Therefore, we have listened to feedback that the grant guidance can feel complicated and we have acted on it."
        },
        {
            "text": "Through one-to-one interviews, we listened to landowners, farmers, land agents and advisors to better understand their experience using the EWCO information on GOV.UK."
        },
        {
            "text": "Participants shared a range of difficulties. It was felt the guidance was too much to read, too long and difficult to understand. They found it hard to find the right information when they needed it. The use of inaccessible formats such as PDF documents only added to the frustration."
        },
        {
            "text": "As you can imagine, all these challenges led some to feel confused, caused application errors and even discouraged them from applying for EWCO funding."
        },
        {
            "text": "A farmer participant in the recent research group said:"
        },
        {
            "heading": 2,
            "text": "Delivering meaningful improvements"
        },
        {
            "text": "It quickly became apparent that we needed to simplify, restructure and improve the accessibility of the guidance for potential customers, applicants and agreement holders."
        },
        {
            "text": "On 23 October 2025 we published refreshed guidance which delivers the following significant improvements:"
        },
        {
            "heading": 3,
            "text": "1. Making language clearer and more accessible"
        },
        {
            "text": "We’ve simplified language throughout the guidance to make it clearer to understand and easier to read."
        },
        {
            "heading": 3,
            "text": "2. Streamlining content for efficiency"
        },
        {
            "text": "Unnecessary and duplicated information has been removed, so people can now find exactly what they need without wading through information that was slowing them down. We've cut down the guidance by about 20%, reducing reading time by over an hour."
        },
        {
            "text": "Guidance is divided into smaller, more digestible chunks to help people get through the essential information for each stage of their application. This makes the experience of applying much faster, less overwhelming and more manageable."
        },
        {
            "heading": 3,
            "text": "3. Introducing intuitive navigation"
        },
        {
            "text": "We’ve launched a new EWCO GOV.UK collection page to bring together all the guidance into one easy to access place."
        },
        {
            "text": "To make navigating smoother, we’ve improved content menus and headings so they’re much clearer and make content easier to find."
        },
        {
            "heading": 3,
            "text": "4. Improving accessibility"
        },
        {
            "text": "We need our guidance to be easily accessible for as many people as possible, and to meet public sector accessibility standards. "
        },
        {
            "text": "The revised information is now fully compatible with assistive technology such as screen readers. It is also easier to access using mobile and tablet devices. This means people can read and use the guidance wherever they are, on whichever device suits them best."
        },
        {
            "text": "For those who prefer to read the guidance offline and hold a hard copy, each page includes a ‘print this page’ button, allowing them to print or save the guidance as an accessible PDF document."
        },
        {
            "text": "If you print a copy, remember to check periodically for any updates. Subscribing to our eAlerts can help you keep up-to-date with changes."
        },
        {
            "heading": 2,
            "text": "Testing the refreshed guidance"
        },
        {
            "text": "We tested the refreshed EWCO guidance with landowners, farmers, forestry and land agents and advisors."
        },
        {
            "text": "The results showed a clear improvement – participants were able to complete tasks more easily using the new version. Survey results from participants also revealed a strong preference for the refreshed guidance."
        },
        {
            "text": "These findings have confirmed that the changes should make a real difference in helping people understand and navigate the EWCO information."
        },
        {
            "text": "An adviser participant in the recent EWCO research group said:"
        },
        {
            "text": "A farmer participant in the recent EWCO research group said:"
        },
        {
            "heading": 2,
            "text": "Continuing to improve the experience"
        },
        {
            "text": "We hope these improvements will boost satisfaction and confidence in using the EWCO guidance, as well as reduce application errors which in turn will speed up processing times for EWCO applications."
        },
        {
            "text": "We will continue to monitor the impact of these changes and gather insights for the future improvements that are planned for the EWCO application process. This will ensure our grant support remains as straightforward as possible for those looking to create new woodlands across England."
        },
        {
            "text": "If you have considered woodland creation before but were deterred by the existing guidance, we encourage you to look again at EWCO."
        }
    ]
}