{
    "url": "https://marinescience.blog.gov.uk/2025/10/29/peltic-survey-monitoring-the-pelagic-ecosystem-in-the-western-channel-and-celtic-sea-since-2012/",
    "title": "PELTIC survey – monitoring the pelagic ecosystem in the Western Channel and Celtic Sea since 2012",
    "authors": [
        "Jeroen van der Kooij",
        "Elisa Capuzzo"
    ],
    "categories": [
        "biodiversity",
        "Fisheries",
        "Monitoring"
    ],
    "pub_date": "2025-10-29T13:40:57+00:00",
    "content": [
        {
            "text": "The waters to the south-west of the UK are home to a rich diversity of small fish such as sardines, anchovy, sprat, mackerel, horse mackerel and herring (collectively known as “small pelagic fish”)."
        },
        {
            "text": "These fish species feed on plankton (microscopic algae and animals) and in turn are the main food source for seabirds, sea mammals, including dolphins and whales, and large fish, from cod and hake to bluefin tuna. Several of these small pelagic species, such as (Cornish) sardines and sprat, are also targeted by commercial fisheries, providing an important food source for people and supporting local livelihoods."
        },
        {
            "text": "PELTIC survey - monitoring of small pelagic fish stocks"
        },
        {
            "text": "Although these fish are environmentally and economically important, we know relatively little about their distribution and population size in the English Channel and Celtic Sea."
        },
        {
            "text": "To ensure their stocks are managed sustainably it is essential to monitor their population size as it can fluctuate strongly from year to year. Changes in abundance can also be driven by environmental conditions such as water temperature. Therefore, it is also important to monitor the pelagic ecosystem where small pelagic fish live."
        },
        {
            "text": "The PELTIC (Pelagic ecosystem survey in the Western Channel and Celtic Sea) survey series, funded by the UK’s Department for the Environment, Food and Rural Affairs (Defra), is the only survey investigating small pelagic fish in the Celtic Sea, Bristol Channel and Western English Channel."
        },
        {
            "text": "Since 2012, each October, the survey collects data on distribution and abundance of sardines, sprat, anchovy, mackerel, horse mackerel and herring, as well as the associated plankton communities and environmental conditions. The survey supports the UK’s commitments to sustainable fisheries management and tackling issues of food security and biodiversity loss."
        },
        {
            "text": "Each survey, carried out on board the Research Vessel Cefas Endeavour, covers more than 3500 km of transects in the waters to the south-west of the UK. Small pelagic fish are mapped and quantified using fisheries acoustic methods (echosounders). A pelagic trawl is used to sample the fish, to confirm the species composition and to collect biological information (fish size, weight and age). The combined acoustic and trawl information is converted into a biomass (weight) estimate for that survey year."
        },
        {
            "text": "PELTIC survey data is used as the basis for the assessment of sprat in the western English Channel and was used for the first dedicated stock assessment of sardines in the English Channel and Celtic Sea since 2020 (an example of the 2024 assessment for sardine can be downloaded here). Thanks to the PELTIC survey data, these stocks are no longer data-limited, allowing monitoring to assess the sustainability of these fisheries."
        },
        {
            "text": "Monitoring of the different ecosystem components"
        },
        {
            "text": "The PELTIC survey has been collecting data on the different life stages of small pelagic fish, including the eggs and larvae stages. Other components of the ecosystem are also monitored providing information on phytoplankton (microscopic algae), and zooplankton (microscopic animals) which are key food for fish larvae, as well as the environmental conditions. In fact, sea surface temperature may also affect small pelagic fish dynamics and their reproduction."
        },
        {
            "text": "To study the role of top predators in the study area, the survey has been collaborating with MARINElife since 2013 and the Joint Nature Conservation Committee (JNCC), in recent years. A unique multi-year dataset of observations on cetaceans and seabirds, including Europe's only critically endangered seabird, the Balearic shearwater, has been collected. These observer data were also important in capturing the return of Atlantic bluefin tuna in British waters, since their population disappeared in the 1960s."
        },
        {
            "text": "Innovation in monitoring and a multi-disciplinary team at the core of PELTIC"
        },
        {
            "text": "Jeroen van der Kooij, Principal Investigator and PELTIC survey lead at Cefas, highlights that “The surveys have been made possible by a great team of enthusiastic and multi-disciplinary scientists. By being at sea, observing the changes in the different components of the ecosystem, we can start developing hypotheses about the processes that may be driving the small pelagic fish ecology”."
        },
        {
            "text": "As part of this, the surveys have always been keen to use innovative tools to measure the ecosystem in a different way, such as by using a flow cytometer, plankton imager and environmental DNA (eDNA). Find out more in our previous blog, Plankton observations, microscopic creatures with global influence: how we use small ocean life to monitor the health of seas the life they support."
        },
        {
            "text": "Through the years, many PhD students have been onboard to collect data for their studies while also experiencing the various interdisciplinary activities carried out during the survey, and having the opportunity to connect with scientists working in the fields of fisheries, plankton and oceanography. As a result, PELTIC survey data, accessible through the Cefas Data Portal has been at the core of multiple scientific publications (see Google Scholar), contributing to advancing our understanding of the marine ecosystem of the waters south-west of the UK."
        },
        {
            "text": "The PELTIC survey will continue to provide essential fisheries and environmental data, with the next survey due to embark in October 2026, but meanwhile, data from the survey this year will inform the upcoming sprat and sardine stock assessments for the English Channel and Celtic Sea in November 2025."
        }
    ]
}