{
    "url": "https://moderncivilservice.blog.gov.uk/2025/10/29/what-can-policy-profession-membership-do-for-your-career/",
    "title": "What can Policy Profession membership do for your career?",
    "authors": [
        "Government Reform"
    ],
    "categories": [
        "A Modern Civil Service",
        "Ambitious",
        "Government Reform",
        "Innovation",
        "Join a profession",
        "Policy",
        "Professional Networks",
        "Proud Civil Servant",
        "Skilled"
    ],
    "pub_date": "2025-10-29T09:17:00+00:00",
    "content": [
        {
            "text": "Since launching in June, the Join a Profession campaign has seen 1,818 policy professionals sign up in order to accelerate their careers. This strong uptake reflects the clear value professionals are finding in membership, making it an ideal time to get involved."
        },
        {
            "heading": 2,
            "text": "Why join the Policy Profession?"
        },
        {
            "text": "You'll become part of the second largest government profession, a 37,000-strong community of policy makers sharing expertise and driving excellence. Professional membership gives you both belonging and accountability, connecting you with peers whilst upholding the highest standards."
        },
        {
            "text": "Susan Acland-Hood, Permanent Secretary at the Department for Education, emphasises: \"Strong professional communities are essential for developing the high-quality foundational skills that policy work in government demands. In my time supporting the Policy Profession, I've seen how professional connection transforms both individual careers and collective capability across the Civil Service.\""
        },
        {
            "text": "Gareth Davies, Permanent Secretary at the Department for Business and Trade, adds: \"Drawing on experience from both the private sector and across government, I've seen how effective policy and strategy development requires continuous learning and professional engagement. The Policy Profession provides the framework for this essential development, connecting policy makers with the tools, networks and insights they need to excel.\"     "
        },
        {
            "heading": 3,
            "text": "What you'll gain"
        },
        {
            "text": "Transform your skills through Policy Profession Standards, accredited programmes including King's College London postgraduate offer and the Executive Master of Public Policy courses, as well as specialist information hubs climate, energy and environment and Policy System Review. Sign up to Continuous Professional Development (CPD), to ensure your skills evolve throughout your career, because great policy making demands lifelong learning."
        },
        {
            "text": "Network and connect through our people-finding tools, dynamic discussion boards, and regular events. We also annually hold the Policy Festival, our flagship gathering featuring masterclasses and leading policy thinkers. Plus, Policy Owl provides confidential, personalised advice for your policy challenges."
        },
        {
            "heading": 3,
            "text": "Ready to join?"
        },
        {
            "text": "Don't miss career-changing opportunities - join today and unlock your potential."
        }
    ]
}