{
    "url": "https://gds.blog.gov.uk/2024/02/28/how-were-using-webinars-to-demonstrate-how-quick-and-easy-it-is-to-use-gov-uk-forms/",
    "title": "How we’re using Webinars to demonstrate how quick and easy it is to use GOV.UK Forms",
    "authors": [
        "Amanda Dahl, Deputy Director of Digital Service Platforms, GDS"
    ],
    "categories": [
        "GOV.UK Forms"
    ],
    "pub_date": "2024-02-28T11:52:05+00:00",
    "content": [
        {
            "text": "Here at GDS we’re focused on making digital government simpler, clearer and faster for everyone. As part of the early access phase of GOV⁠.⁠UK Forms we wanted to put this into practice by demonstrating just how quickly and easily you can create an online form."
        },
        {
            "text": "With a sold out online audience, we hosted a webinar showcasing the service, current and future features, and showing how GOV⁠.⁠UK Forms is already making a difference across government."
        },
        {
            "text": "GOV⁠.⁠UK Forms replaces the dependence on PDFs and document-based forms. In just a matter of minutes you can create a new online form that’s quick to process and incorporates lots of GOV.UK Design System components which are focused on accessibility. This makes it even easier for people to complete government forms. Best of all, there’s no need for any technical knowledge to create a form and it’s completely free to use!"
        },
        {
            "heading": 2,
            "text": "Live Demonstration"
        },
        {
            "text": "During the webinar, we conducted a live demonstration to showcase the ease and efficiency of GOV⁠.⁠UK Forms in action.  In under 20 minutes a form was created, which included basic routing and some detailed guidance for the person completing the form."
        },
        {
            "text": "The purpose of the example form created in the webinar was to capture feedback from the audience. It included questions such as name, date of birth, webinar attended and previous experience of form builders. The questions used a variety of methods to submit data, from text to buttons. Another feature on show was the ability to autofill answers, where you have information such as name and address already stored on your device. "
        },
        {
            "text": "Providing questions that are clear and easy to understand are vital to help people complete a form once published. During the demonstration we also showed how the form builder provides helpful information in hint text, and prompts the person creating a form to include contact details for anyone needing additional support. "
        },
        {
            "heading": 2,
            "text": "Technical Overview"
        },
        {
            "text": "While you don’t need any technical knowledge to use GOV⁠.⁠UK Forms we’re also exploring more advanced options for departments and teams with more digital expertise. "
        },
        {
            "text": "The next presentation in the webinar provided a brief technical overview of the service and work towards future opportunities. For instance, currently form submissions are emailed to a chosen inbox from which they can be processed. This is fine in lots of cases and, as demo-ed, is really easy to setup.  But we know departments have more complex needs for receiving and processing form data so we are learning and looking at how we might send data differently to support automated form processing."
        },
        {
            "text": "This presentation also outlined how GOV⁠.⁠UK Forms follows the 14 cloud security principles from the National Cyber Security Centre."
        },
        {
            "heading": 2,
            "text": "User Feedback"
        },
        {
            "text": "User feedback is critical to the development of GOV⁠.⁠UK Forms and this formed an integral part of the webinar. John Ploughman, Head of Content Design at the Driver and Vehicle Standards Agency, described his first hand experience of GOV⁠.⁠UK Forms, emphasising its role in saving time and simplifying processes for DVSA teams: "
        },
        {
            "text": "John Ploughman Head of Content Design at the Driver and Vehicle Standards Agency"
        },
        {
            "heading": 2,
            "text": "Next Steps"
        },
        {
            "text": "Looking ahead, we're enhancing GOV⁠.⁠UK Forms with new features and capabilities. In our final presentation we shared upcoming developments, including the integration of payment links powered by GOV⁠.⁠UK Pay, which is a seamless solution for accepting payments through online forms. Additionally, improvements to user access management processes and the introduction of multi-answer questions will further enhance the platform's functionality, empowering departments to utilise GOV⁠.⁠UK Forms in a more self-service manner. The audience also heard how GOV⁠.⁠UK Forms will be available to the wider public sector in a later phase, once we have a scalable product for central government as this is our core mandate at GDS."
        },
        {
            "text": "The webinar closed with a chance for audience members to put questions to the GOV.UK Forms team. Examples included:  "
        },
        {
            "text": "The questions shared and feedback to the presentations showed just how much interest there is in GOV.UK Forms. While we’re currently in the early access phase of the platform's development, look out for further webinars as more features are released."
        }
    ]
}