{
    "url": "https://extremismcommission.blog.gov.uk/2024/02/28/new-standards-and-compliance-unit-launched-an-update-by-robin-simcox/",
    "title": "New Standards and Compliance Unit launched - An update by Robin Simcox",
    "authors": [
        "Commission for Countering Extremism"
    ],
    "categories": [
        "Blog"
    ],
    "pub_date": "2024-02-28T00:01:38+00:00",
    "content": [
        {
            "text": "Commissioner for Countering Extremism, Robin Simcox shares his thoughts on the launch of the Standards and Compliance Unit (StaCU)."
        },
        {
            "text": "Just over a year after the publication of the Independent Review of Prevent (IRP), I am delighted to announce the launch of the Standards and Compliance Unit (StaCU)."
        },
        {
            "text": "The Independent Review of Prevent provided a roadmap for ensuring Prevent remains a world leading terrorism prevention programme. StaCU was created because of recommendation 34 from the IRP."
        },
        {
            "text": "StaCU is a welcome addition to the CCE, enabling us to fulfil a crucial oversight function of Prevent. It demonstrates the CCE’s value in supporting government with advice and scrutiny on the approaches to countering extremism."
        },
        {
            "text": "StaCU will promote transparency, trust and accountability for Prevent. It will be able to gather complaints data and inform ministers, so that decisions can be made to improve the robustness and effectiveness of the programme."
        },
        {
            "text": "We face a stark challenge in our country from extremist ideologies. This transcends across different communities in our country. "
        },
        {
            "text": "If we want to continue to build public trust and confidence in the programme, it’s vital that we listen to the public and those who are subject to the Prevent Duty. Their concerns and complaints will feed into the overall improvement of Prevent."
        },
        {
            "text": "StaCU will play a huge role in shoring up our defences to prevent terrorism and extremism. I look forward to sharing the progress that StaCU makes over the year ahead."
        }
    ]
}