{
    "url": "https://ofsi.blog.gov.uk/2024/02/28/ofsi-refreshes-its-guidance-for-the-maritime-sector/",
    "title": "OFSI refreshes its guidance for the maritime sector",
    "authors": [
        "OFSI"
    ],
    "categories": [
        "Financial Sanctions"
    ],
    "pub_date": "2024-02-28T12:54:46+00:00",
    "content": [
        {
            "text": "The maritime shipping industry is crucial for global trade and growth, linking countries and economies worldwide. However, because of its global reach, it faces unique challenges with financial sanctions. To help businesses navigate these complexities and ensure compliance, OFSI has released updated guidance tailored for the maritime sector. "
        },
        {
            "text": " "
        },
        {
            "text": "What's in the refreshed guidance? "
        },
        {
            "text": "The refreshed guidance covers new tactics used by illicit actors to evade UK financial sanctions. By understanding these tactics, businesses can adjust their compliance measures to stay ahead of potential risks. It also offers support for dealing with high-risk jurisdictions and provides links to relevant UK regulations. "
        },
        {
            "text": "Additionally, the guidance offers recommendations for implementing additional due diligence practices, which are essential for building robust compliance programs and minimising risks. "
        },
        {
            "text": " "
        },
        {
            "text": "Who should read it? "
        },
        {
            "text": "Given the extensive reach of UK financial sanctions and their impact on maritime operations, it's essential for all entities in the maritime sector with any ties to the UK and relevant UK nationals to carefully review the updated guidance. Whether operating within UK territories or dealing with UK-affiliated entities, understanding these regulations is crucial for compliance and risk mitigation. "
        },
        {
            "text": "The guidance also extends support to insurers involved in the maritime shipping sector. By offering tailored advice on industry-specific prohibitions, it aims to empower insurers to navigate regulatory challenges more effectively. "
        },
        {
            "text": " "
        },
        {
            "text": "How does this it fit with the Oil Price Cap guidance on Russian oil?  "
        },
        {
            "text": "This refreshed maritime guidance does not impact guidance on the maritime services ban and oil price cap, which you can find here. The guidance sits side-by-side, and you should review both pieces of guidance, as well as any other guidance applicable to your specific situation. OFSI also encourages those affected by UK sanctions to seek independent legal advice.  "
        },
        {
            "text": " "
        },
        {
            "text": "What else is to come? "
        },
        {
            "text": "Today’s launch of the refreshed maritime guidance marks the start of a series of guidance and engagement to support those in the maritime sector including new webinars. "
        },
        {
            "text": "You can signup for the OFSI & The Maritime Sector webinar on the 14th or 21st March on gov.uk. The webinar will be available to watch on demand afterwards. "
        },
        {
            "text": " "
        },
        {
            "text": "OFSI’s Maritime Shipping guidance is now available from GOV.UK "
        }
    ]
}