{
    "url": "https://cyberandspecialistoperationscommand.blog.gov.uk/2024/02/28/op-teamwork/",
    "title": "Royal Gibraltar Regiment OP Teamwork",
    "authors": [
        "abievans"
    ],
    "categories": [
        "Gibraltar",
        "Overseas Bases"
    ],
    "pub_date": "2024-02-28T10:07:13+00:00",
    "content": [
        {
            "text": "For the third year running, the Royal Gibraltar Regiment (RG) attended an Army-wide TEAMWORK Day activity as part of the overall TEAMWORK campaign at the University of Gibraltar."
        },
        {
            "text": "The University kindly agreed to host the RG and continue to build the excellent relationship between both parties."
        },
        {
            "text": "The event opened with a welcome from Christian Camilleri, the Board of Governors, followed by a talk from Áine Panter, Head of School (Business), allowing the RG to gain awareness of the potential educational opportunities on offer at the University."
        },
        {
            "text": "Commanding Officer, Lieutenant Colonel Matt Moore, and Second-In-Command, Major John Pitto, gave an introductory brief before the team watched a series of videos to illustrate examples of successful teams as discussion prompts, for conversations lead by their Senior Non-Commissioned Officers."
        },
        {
            "text": "The afternoon consisted of personnel been divided into groups within their departments for facilitator-led discussions. Each group discussed three subjects covering: ‘When are our teams at their best?’, ‘What are some of the values that allow our teams to be at their best?’ and ‘What can we do to be at our best more often?’"
        },
        {
            "text": "The closing brief involved a spokesperson from each group delivering feedback from the topics discussed."
        },
        {
            "text": "Commander British Forces (CBF), Commodore Tom Guy, who was in attendance, gave a final closing speech to all those involved."
        }
    ]
}