{
    "url": "https://nationalscreening.blog.gov.uk/2024/02/28/screening-research-who-does-what/",
    "title": "Screening research: who does what?  ",
    "authors": [
        "Mike Harris"
    ],
    "categories": [
        "General"
    ],
    "pub_date": "2024-02-28T16:53:50+00:00",
    "content": [
        {
            "text": "The UK National Screening Committee (UK NSC) is responsible for making recommendations that affect millions of people, commit hundreds of millions of pounds of public funds and involve thousands of health care workers."
        },
        {
            "text": "High quality research and evidence underpins the work of the UK NSC and all the recommendations it makes to ministers in the 4 UK countries."
        },
        {
            "text": "The UK NSC sets a deliberately high evidential bar for screening because:​"
        },
        {
            "text": "The committee only recommends screening if the condition is an important health problem (judged by frequency and/or severity) and available high-quality evidence gives the committee confidence that screening would do more good than harm."
        },
        {
            "text": "This evidence might be gained through formal research – see UK Policy Framework for Health and Social Care Research, or rigorous evaluation – see Planning an evaluation: evaluation in health and wellbeing."
        },
        {
            "text": "Researchers often work in partnership with funding organisations such as the National Institute for Health and Care Research (NIHR). Their work should be independent and published (or publishable if there is some urgency) and generalisable to the population at which the screening programme is aimed."
        },
        {
            "heading": 2,
            "text": "Screening’s unique context"
        },
        {
            "text": "There are important factors to consider for anyone wanting to conduct research or evaluation in screening."
        },
        {
            "text": "New population or targeted screening programmes, or modifications to existing programmes, should only be implemented in the NHS following a positive recommendation from the UK NSC and ministerial approval."
        },
        {
            "text": "As well as good quality evidence, the UK NSC takes many criteria into account when considering any proposal, including:"
        },
        {
            "heading": 2,
            "text": "Roles and responsibilities"
        },
        {
            "text": "Different organisations have different roles to play in the commissioning, development, and approval of screening research."
        },
        {
            "text": "The UK NSC reviews the evidence in its role as the independent scientific committee that makes recommendations to ministers and the NHS."
        },
        {
            "text": "The UK NSC’s expert research and methodology group (RMG) helps provide clarity and specific advice to stakeholders wishing to carry out research that will help the committee. See the UK NSC RMG: submitting research requests guidance for more information."
        },
        {
            "text": "Requesting advice from this expert group can help researchers who want to have the best chance of their work affecting UK screening policy."
        },
        {
            "text": "The RMG's role is to examine the protocol and proposal of a study to advise on whether it would be appropriate for the UK NSC to review it and to make sure it addresses UK NSC questions. The RMG does not carry out a detailed critical appraisal of the methodology (for example, the study design and numbers involved). This role is typically carried out by a clinical trials unit, NHS research funding body, NIHR or university."
        },
        {
            "text": "Involving the RMG helps make sure screening research is best able to answer screening policy questions. For example, the RMG might advise researchers to rethink a proposal if its recruitment strategy would result in the demographics (age, sex, ethnicity) of study participants being different from the demographics of the population eligible for the screening programme involved in the research."
        },
        {
            "text": "It is important to note that RMG support cannot guarantee UK NSC approval."
        },
        {
            "text": "The Department of Health and Social Care, which hosts the UK NSC, can commission some targeted academic research, for example what evidence might be needed to implement a new technology."
        },
        {
            "text": "Roles and responsibilities for health research in the UK are set out in the UK Policy Framework for Health and Social Care Research."
        },
        {
            "text": "Study sponsors hold overall responsibility for studies and must ensure their study is conducted ethically and lawfully. Researchers themselves are responsible for the design and delivery of research, which should be conducted in line with the principles of good practice set out in the above framework."
        },
        {
            "text": "The specific governance requirements of a study depend on whether it is research or some other form of evidence generation, such as service evaluation. The Health Research Authority (HRA) has a helpful Is my study research? tool and guidance on what approvals and decisions are needed depending on the type of study."
        },
        {
            "text": "When conducting research, the specific approvals required depend on the nation where the research is being conducted. See NHS/HSC R&D permissions for details."
        },
        {
            "text": "The NHS in each of the 4 UK nations has a vital role in determining if screening research is feasible. Unlike other clinical services, NHS screening programmes must comply with nationally set and assured clinical standards to ensure everyone gets the same high-quality care. Researchers are advised to engage with the NHS at an early stage, particularly pre-grant application, to ensure they have thought of the right issues and determine if their proposed study would work in practice."
        },
        {
            "text": "The NHS in each country reviews any proposed research into existing NHS screening programmes to determine if it can be managed without negatively impacting aspects of current services such as staff capacity, IT, data reporting, service quality and safety."
        },
        {
            "heading": 2,
            "text": "Country specific guidance"
        },
        {
            "heading": 3,
            "text": "England"
        },
        {
            "text": "In England, researchers should engage early with the NHS England Research and Innovation Development Advisory Committee (RIDAC), which advises on:"
        },
        {
            "heading": 3,
            "text": "Scotland"
        },
        {
            "text": "In Scotland, researchers should engage with the National Screening Oversight Research and Innovation Group (NSO RIG) by emailing nss.nsoresearch&innovation@nhs.scot"
        },
        {
            "text": "This single point of entry to the research pathway in Scotland enables early input from relevant screening programmes and the identification of future challenges."
        },
        {
            "text": "If the NSO RIG endorses a proposal, investigators can include the endorsement in applications to research funder(s). Investigators should note that endorsements are not a recommendation for funding and do not remove the need for other approvals."
        },
        {
            "heading": 3,
            "text": "Wales"
        },
        {
            "text": "In Wales, researchers should engage with the Screening Division of Public Health Wales NHS Trust in the early stages of their project’s development. The Screening Division delivers the 7 national screening programmes in Wales and additionally manages the Antenatal Screening Wales clinical network. In this capacity, it is able to advise researchers on national screening research priorities, research feasibility, and data access."
        },
        {
            "heading": 3,
            "text": "Local services"
        },
        {
            "text": "Importantly, local NHS screening services involved in any screening studies also need to give approval for research governance, local controlled data sharing, any IT changes, contracting with researchers and communication with patients."
        },
        {
            "text": "Local commissioners and quality assurance teams may ask local services for assurance that research will not harm delivery."
        },
        {
            "heading": 2,
            "text": "Keep up to date"
        },
        {
            "text": "The UK NSC blog provides up to date news from the UK NSC. You can register to receive updates direct to your inbox, so there is no need to keep checking for new articles. If you have any questions about this blog article, or about the work of the UK NSC, please email uknsc@dhsc.gov.uk."
        }
    ]
}