{
    "url": "https://aphascience.blog.gov.uk/2023/11/03/aphas-one-health-approach/",
    "title": "APHA’s One Health approach is critical",
    "authors": [
        "Jane Tennant"
    ],
    "categories": [
        "One Health"
    ],
    "pub_date": "2023-11-03T10:37:18+00:00",
    "content": [
        {
            "text": "One Health recognises that human, animal and plant health are interdependent and bound to the health of the ecosystems in which they exist. It means working to understand, anticipate and address risks to global health.  Worldwide, nearly 75% of all emerging human infectious diseases since 1993 have originated in animals so the optimal and most cost-effective solution is to control the disease in animals, both nationally and internationally, thereby protecting damage to the environment and preventing the pathogen reaching the human population."
        },
        {
            "text": "This blog, alongside the UK Chief Veterinary Officer’s blog, highlight some of the ways that we are championing a One Health approach."
        },
        {
            "heading": 3,
            "text": "Vector-borne disease"
        },
        {
            "text": "This year APHA secured new funding to deliver innovative research to better understand vectors, including mosquitoes, midges and ticks, vector-borne diseases and their impact. This is particularly critical considering climate change, warmer summer temperatures and rapid international travel, all which pose potential threats to animal and human health."
        },
        {
            "text": "APHA holds the UK National Reference Laboratory for mosquito-borne viruses such as West Nile Virus (WNV) and Rift Valley Fever virus, which could spread to the UK as environmental temperatures rise."
        },
        {
            "text": "Our recent research has shown the UK mosquito, Culex pipiens, can be infected with Japanese Encephalitis virus, not found in the UK, at 21°C but infected mosquitoes did not contain the live virus in their saliva, suggesting an inability to transmit infection. However, at 25°C live virus was detected in saliva, suggesting that bites could transmit virus should the virus reach the UK in susceptible vector species during the warmer months."
        },
        {
            "text": "We are undertaking further research to study the vector competence of UK target mosquito species for WNV and are developing a serological test for this virus. We are also taking an integrated approach to surveying ticks and establishing molecular tests for the detection of tick-borne pathogens in livestock and wildlife."
        },
        {
            "heading": 3,
            "text": "Brucella canis (B. canis)"
        },
        {
            "text": "The Brucella species usually of concern are those infecting livestock, causing production losses and threatening human health, but these do not occur in the UK."
        },
        {
            "text": "B.canis is a bacterial species affecting dogs, which can cause an infection known as brucellosis, which can also spread to humans. Cases of B.canis are rare in GB, but instances are on the increase – with most positive cases found in, or linked to, dogs imported from Eastern Europe. We have raised awareness of B.canis and brucellosis through an extensive piece of work to raise awareness among veterinary professionals, whilst continuing to test samples from animals as part of our roles as a National Reference Laboratory and United Nations Food and Agriculture Organization (FAO) International Reference laboratory/Centre for brucellosis."
        },
        {
            "heading": 3,
            "text": "Rabies"
        },
        {
            "text": "Rabies is a devastating disease that affects mammals, including humans, and remains an endemic disease in many countries around the world. The UK is officially free of rabies. APHA’s Rabies laboratory is working to prevent the re-introduction of rabies into the UK and in supporting numerous overseas rabies capability-building projects.  Consequently, technical support has been provided to the Government of Sierra Leone with funding from the World Organisation for Animal Health in partnership with the FAO Emergency Centre for Transboundary Animal Diseases, to enhance the laboratory-based capabilities for rabies diagnosis and surveillance.  This has led to an improved outcome for Sierra Leone in being able to independently diagnose rabies cases in animals, thereby improving the outcome for patients and reducing the spread of rabies in the environment."
        },
        {
            "heading": 3,
            "text": "One Food"
        },
        {
            "text": "Last year the Centre for Environment, Fisheries and Aquaculture Science (Cefas) in partnership with APHA launched the OneFood programme in The Republic of South Africa (RSA) with the RSA Council for Scientific and Industrial Research (CSIR).  The programme highlights the importance of identifying and controlling hazards in food systems, combining specialisms in new ways to design and champion sustainable food systems, specifically in low-and middle-income countries (LMICs).  The project is funded by the UK Department for Environment, Food and Rural Affairs (Defra) within the Global Centre on Biodiversity for Climate."
        },
        {
            "heading": 3,
            "text": "Animal Health System Strengthening (AHSS) Programme"
        },
        {
            "text": "AHSS delivers multiple projects in collaboration with LMICs, to build resilient health systems, by using our expertise to help strengthen their animal health systems.  AHSS is in place to better protect, detect and respond to known and emerging diseases and health threats."
        },
        {
            "text": "AHSS is a collaboration between Defra, APHA, Veterinary Medicines Directorate (VMD), and Cefas. So far, projects have included working with non-governmental organisations in Ghana, which reach local organisations vaccinating small ruminants and poultry against infectious diseases, as well as training Community Animal Health Workers."
        },
        {
            "text": "Last year, AHSS funding in partnership with the University of Ghana with EcoHealth Alliance from the USA, focused on an outbreak of Marburg disease in Ghana. People living near the first case were educated about the dangers of Marburg spreading from animals to humans via activities such as hunting and eating bushmeat.  As a result, people reported changes in behaviour, suggesting that continued education and outreach, including ways to reduce and prevent disease risks, is indispensable."
        },
        {
            "heading": 3,
            "text": "One Health European Joint Programme (OHEJP)"
        },
        {
            "text": "OHEJP was a ground-breaking five-year programme that finished recently. It brought experts together across borders to tackle issues including foodborne zoonoses, antimicrobial resistance, and emerging threats."
        },
        {
            "text": "Thirty research projects, many of which APHA were partners in, and 17 PhD projects, brought together researchers to ensure people continue to learn together about One Health issues.  OHEJP demonstrated that collaborations between medical, veterinary, and environmental professions work well and that this approach is essential in combating emerging issues, ultimately improving food security and human, animal and environmental health."
        },
        {
            "heading": 3,
            "text": "Antimicrobial resistance (AMR)"
        },
        {
            "text": "AMR remains a global public health threat. AMR occurs when bacteria, and other microorganisms develop resistance to antimicrobial drugs reducing how effectively they treat infections.  The UK FAO AMR Reference Centre, led by APHA, Cefas and VMD, participated in a recent Delivery Partners Event in Ghana.  We delivered the One Health AMR session, alongside colleagues from the WHO, FAO and Exeter University, providing partners with insight into priorities and key challenges to tackling AMR in a one health manner. You can learn more during World AMR Awareness Week (November 18th - 24th 2023)."
        },
        {
            "heading": 3,
            "text": "APHA and One Health"
        },
        {
            "text": "Today’s blog highlights just some examples of how APHA’s collaborative One Health approach can:"
        },
        {
            "text": "By promoting collaboration across all sectors, a One Health approach can achieve the best health outcomes for people, animals, and plants in a shared environment and APHA continues to be a part of the solution in many areas, both nationally and internationally."
        },
        {
            "heading": 3,
            "text": "Find out more:"
        },
        {
            "text": "You may be interested in reading some of our previously published One Health-related blogs."
        },
        {
            "text": "Additionally, further information on content contained in this blog can be found in the following links:"
        }
    ]
}