{
    "url": "https://vets.blog.gov.uk/2023/11/03/chief-veterinary-officer-cvo-celebrating-8th-one-health-day/",
    "title": "Celebrating the 8th Annual ‘One Health’ Day – Working Across Boundaries",
    "authors": [
        "Dr Christine Middlemiss BVMS MRCVS"
    ],
    "categories": [
        "Disease outbreak",
        "International Work",
        "Policy Work"
    ],
    "pub_date": "2023-11-03T11:21:40+00:00",
    "content": [
        {
            "text": "Today marks the 8th annual One Health Day. As the world faces ever more complex and intertwined challenges affecting humans, animals, plants, and the environment, it’s important we take time to recognise the value of a One Health approach, focusing on the interconnections between these areas in order to deliver more effective, joined-up, solutions.  "
        },
        {
            "text": "This blog is an opportunity for me to reflect on the UK’s One Health activity over the past year and look towards the future. First though, I want to thank all our partners - both domestic and abroad - for their continued collaboration as we tackle these challenges together.  "
        },
        {
            "text": "2023 has seen great engagement with One Health. From the World Organisation of Animal Health (WOAH) General Session in Paris to the focus on One Health during G7 and G20 summits in Japan and India, there is wide international commitment to these principles. It was also great to meet some of my overseas counterparts in East and South-East Asia last month, sharing our experiences and approach to One Health issues. I was pleased to see how UK expertise is being sought after internationally. "
        },
        {
            "text": "Defra and its partners continue to strongly support Global Health initiatives and our abilities are being championed brilliantly across Government, domestically and overseas - including by our Minister for Biosecurity and Animal Welfare, Lord Benyon, who holds responsibility for One Health in Defra.  "
        },
        {
            "text": " "
        },
        {
            "text": "Highlights from the past year.  "
        },
        {
            "text": "World Organisation for Animal Health (WOAH) General Session "
        },
        {
            "text": "I had the pleasure of co-hosting the reception at the British Ambassador’s residence in Paris, to promote international collaboration on ‘Avian Influenza - the One Health Perspective’ during the annual World Organisation for Animal Health (WOAH) General Session in May, bringing together scientists and experts in animal health and welfare. This represented a renewed focus from WOAH on the prominent challenge of Avian Influenza and provided a useful space to discuss disease control and eradication strategies such as vaccination. The event showcased the UK’s approach to Avian Influenza preparedness, including our science and laboratory capabilities, and highlighted the importance of continued international partnerships for this kind of global risk.  "
        },
        {
            "text": "Lord Benyon representing the UK at the UN Food and Agriculture Organisation (FAO) "
        },
        {
            "text": "Lord Benyon spoke at the One Health side event during July’s FAO conference in Rome. The Minister spoke about the UK’s commitment to One Health and the importance of this model for the developing world. He reflected on our FAO Reference Centre for Antimicrobial Resistance (AMR) Designation being renewed through to 2027, our support of the FAO’s work on Avian Influenza in West Africa, and the development of a One Food ‘Risk Tool’ and ‘Community of Practice’ with South Africa, to solve hazards across food sectors in Low- and Middle-Income Countries (LMICs) and improve food security. "
        },
        {
            "text": "WHO International Pathogen Surveillance Network (IPSN) "
        },
        {
            "text": "I was pleased by the WHO’s launch of the IPSN, an ambitious new platform working to detect and respond to disease threats before they become epidemics or pandemics by optimising routine disease surveillance, for example through data sharing, practices and innovations to build a robust global health surveillance architecture, and our surveillance capacity.  "
        },
        {
            "text": "As we see in the UK, for example through our Human Animal Infection Risk Surveillance (HAIRS) group, bringing together experts from a range of areas and sectors can help connect countries and regions, improving sample analysis and the use of data to improve decision-making for public and animal health.  "
        },
        {
            "text": "Global Health Framework "
        },
        {
            "text": "It’s testament to all the work we do that Defra was central to the UK government’s new Global Health Framework (GHF) earlier this year.  This initiative works to protect the health of people both at home and abroad, strengthen country health systems and advance UK leadership in science and technology - for example by bringing over 30 new products to market that include drugs, diagnostics, and vaccines. "
        },
        {
            "text": "The Framework recognises the interdependence of human, animal, plant, and environmental health, making it clear that we – both the UK and the international community – must work more effectively across boundaries and normalise One Health approaches. It recognises the important role that the animal and environment sector must play if we are to protect ourselves against current and future infectious diseases and curb the spread of AMR, as well as the health impacts of climate change, biodiversity loss and pollution. "
        },
        {
            "text": "Animal Health QUADs Alliance – international collaboration with like-minded countries "
        },
        {
            "text": "The QUADs alliance is a great forum to consolidate the UK’s One Health ambitions with likeminded countries, and I am very happy to continue working closely with our partners – New Zealand, Canada, the United States and Australia. April saw the reinvigoration of the QUADs One Health Working Group. It’s invaluable having peers and colleagues to share, challenge and learn with; we can have far greater impact together than apart. "
        },
        {
            "text": "Creating Effective Warnings for All "
        },
        {
            "text": "Looking at the news I am struck, as I’m sure many of you are too, by the number of disasters occurring around the world today. It’s only right that Defra plays its part, not only to help manage those affecting the UK, such as flooding, but also to support the international community with the unique challenges faced around the globe. We’re growing this capacity here at Defra through the International Natural Hazards Forward Look.  "
        },
        {
            "text": " We have expertise that can help to better understand the causes, signs, and consequences of all kinds of disasters, working with those in meteorology, oceans, food, and health. In partnership with UK academia, we brought together leading specialists in a panel session at University College London’s ‘Creating Effective Warnings for All’ conference. This emphasised how different sectors all have a role in preparing for and responding to disasters, or instance, how animal health professionals can support livelihoods and food safety following extreme weather events, which have also been linked to the spread of Rift Valley Fever.  "
        },
        {
            "text": " "
        },
        {
            "text": "Dr Tasker’s discussion was of particular interest, bringing out the interconnection between climate change and animal health, he pointed to the cases of anthrax in Siberian reindeer herds because of spores being released from thawing permafrost. The risk of pathogens re-emerging as temperatures warm, and the link between climate change and emergence of zoonotic disease, is a real danger and one we must remain alert to."
        },
        {
            "text": "Looking forward  "
        },
        {
            "text": "I am delighted that COP28 will, for first time, have a dedicated Health Day promoting international collaboration to benefit the health of people, animals and the ecosystem. This highlights the increased adoption of One Health thinking and the importance of the link between climate change and human, animal and plant health.  "
        },
        {
            "text": "Building on this momentum, and efforts to protect the world from the emergence of future pandemics, I look forward to the signing of the WHO Pandemic Accord in May 2024. It’s emphasis on prevention and surveillance, as well as the article on One Health, will bring out the critical role of animal health and multisector collaboration. The UK has been a great advocate for these elements and will continue to support the One Health language being embedded throughout the final Accord. "
        },
        {
            "text": "I anticipate continued progress on joint action against AMR. The UN General Assembly next September will be an opportunity for leaders around the world to come together and drive forward action to tackle the threat of ineffective medicines, both for our own health and that of the animals we rely on. We have strong expertise in this space across the Defra Group (especially at the Veterinary Medicines Directorate). I support the work of colleagues to ensure the - sometimes underrepresented - dynamics of animal, plant and environmental AMR can be brought to the spotlight among the international community.  "
        },
        {
            "text": "I am confident that the focus on One Health will continue to strengthen over the next year. We must keep this momentum, break down siloes and learn from our different expertise and experiences, both in the UK and abroad. Only with this enduring spirit of collaboration can we hope to effectively anticipate, prepare for, and respond to the diverse threats that challenge our societies and the rapidly changing world we all share.  "
        },
        {
            "text": " "
        }
    ]
}