{
    "url": "https://educationhub.blog.gov.uk/2023/11/03/free-school-transport-explained-eligible-free-travel/",
    "title": "Free school transport explained: From who’s eligible to how it works",
    "authors": [
        "mediaofficer"
    ],
    "categories": [
        "Schools"
    ],
    "pub_date": "2023-11-03T11:49:05+00:00",
    "content": [
        {
            "text": "When choosing which schools to apply for, it is important to consider how your child will get there. Some children are eligible for free travel, but this isn’t the case for everyone."
        },
        {
            "text": "Most parents should expect to be responsible for making arrangements for their child to get to and from school."
        },
        {
            "text": "Here, we explain everything you need to know about free school travel, from who’s eligible to how it works."
        },
        {
            "heading": 3,
            "text": "Is my child eligible for free school travel?"
        },
        {
            "text": "We set the national eligibility criteria for free travel to school and your local authority is responsible for deciding whether your child meets these criteria."
        },
        {
            "text": "Your child is eligible if they are of compulsory school age, go to their nearest suitable school and one of the following applies:"
        },
        {
            "text": "If the local authority decides your child would be able to walk to school if they were accompanied, the general expectation is that you will accompany them, or make other suitable arrangements. A child will not normally be eligible for free travel solely because of their parent’s work commitments or caring responsibilities."
        },
        {
            "text": "Your child may also be entitled to free transport if you have a low family income and they are entitled to free school meals or you get the maximum Working Tax Credit and one of the following applies:"
        },
        {
            "text": "If your child doesn't meet the criteria above, you are responsible for arranging their travel to and from school. Some local authorities arrange travel for children who don’t meet the eligibility criteria, although they are not required to. Where they choose to do so, they may charge you for the cost of it."
        },
        {
            "text": "You can find your local authority’s school travel policy through our postcode search on Gov.uk."
        },
        {
            "heading": 3,
            "text": "What is a ‘suitable’ school?"
        },
        {
            "text": "A suitable school is one that provides education appropriate to the child’s age, ability, aptitude, and any special educational needs they may have."
        },
        {
            "text": "If your child has an Education, Health and Care plan, the school named in their plan will usually be considered their nearest suitable school for travel purposes."
        },
        {
            "heading": 3,
            "text": "What do I need to do if I think my child is eligible?"
        },
        {
            "text": "You should check your local authority website to see the school travel policy and find out how to apply."
        },
        {
            "text": "If your child is eligible for free school travel, your local authority will make suitable travel arrangements.  For example, they might provide your child with a pass for free travel on public transport or arrange a dedicated school bus or taxi. They may expect your child to walk to a suitable pick-up point if they are able to."
        },
        {
            "heading": 3,
            "text": "My child has a special educational need or disability, what does this mean for them?"
        },
        {
            "text": "Your local authority will assess whether your child meets the eligibility criteria. They may ask for information to help them decide whether your child would be able to walk to school."
        },
        {
            "text": "Your child doesn't need to have an Education, Health and Care plan to be eligible but having one doesn’t make your child automatically eligible."
        },
        {
            "text": "If your child is eligible, your local authority will make suitable travel arrangements for them, taking into account their needs. It may often be the case that they share a vehicle with other children."
        },
        {
            "text": "If they have a medical condition which may affect them on the journey, your local authority will decide what arrangements they need to make to manage this."
        },
        {
            "text": "Your local authority may offer you a personal travel budget or mileage allowance to take your child to school yourself. Some parents prefer this, but you don’t have to accept it if you don’t want to. If you don’t accept it, the local authority will need to arrange your child’s free travel."
        },
        {
            "text": "As your child gets older, your local authority may offer them the opportunity to take part in independent travel training."
        },
        {
            "text": "The authority will pay for this and your child will be supported, by a trainer, to learn how to travel to school independently, for example on public transport."
        },
        {
            "text": "Learning to travel independently is an important part of preparing a child to lead a fulfilling and active adult life. If you want to know more about independent travel training, you should contact your local authority."
        },
        {
            "heading": 3,
            "text": "What if my child spends time at more than one address?"
        },
        {
            "text": "It’s not normally possible to provide eligible children with travel to and from more than one address, for example if their parents don’t live together. Local authorities usually only arrange travel to and from a child’s main place of residence."
        },
        {
            "text": "Your local authority’s school travel policy will explain how it decides which address they will arrange travel to."
        },
        {
            "heading": 3,
            "text": "Can I appeal the local authority’s decision?"
        },
        {
            "text": "Yes. There is an appeals process, published on the local authority’s website, for parents to follow should they want to challenge the decision about their child’s home to school travel."
        },
        {
            "text": "If you’re not happy with the way the local authority conducts your appeal, the Local Government and Social Care Ombudsman may be able to investigate. Further information can be found on the LGO website."
        },
        {
            "heading": 3,
            "text": "What about young people aged 16-25?"
        },
        {
            "text": "When a young person begins post-16 education or training, the level of school travel support changes. It is for the local authority to decide the level of support they offer and these arrangements don’t have to include free or subsidised travel. More information can be found on Gov.uk."
        }
    ]
}