{
    "url": "https://socialcare.blog.gov.uk/2023/11/03/hear-hear-for-this-years-nursing-in-social-care-award-winners/",
    "title": "\"Hear, hear!\" for this year's 'Nursing in Social Care' award winners",
    "authors": [
        "Suzanne Mumford",
        "Natalia Stan"
    ],
    "categories": [
        "Care and support",
        "Dementia",
        "Innovation",
        "Recognition"
    ],
    "pub_date": "2023-11-03T12:16:42+00:00",
    "content": [
        {
            "heading": 2,
            "text": "Passion, motivation and the desire to do more"
        },
        {
            "text": "We were delighted to win the Nursing Times Nursing in Social Care Award for a project we are both passionate about. This nurse-led research project, funded by care provider Care UK and The Queen's Nursing Institute (QNI) in collaboration with Tympa Health, researched ways to identify and treat hearing loss and reversible hearing loss for people living in care homes."
        },
        {
            "text": "Being recognised for this work, not only helps us promote a project with the potential to help many more people living with dementia, it also showcases the value, innovation and expertise of social care nurses. There is so much we can and want to do to improve the quality of life for those we support."
        },
        {
            "text": "The Lancet Commission (2020), Dementia prevention, intervention and care, cites 8% of cases of dementia result from hearing loss, and therefore, management of hearing loss is one of the 12 factors that can minimise the risk of developing the condition."
        },
        {
            "text": "Research from Leeds NHS Teaching Hospitals found “links between hearing loss and dementia are growing. The risk of getting dementia almost doubles if you have an untreated mild hearing loss. With a moderate hearing loss, the risk of dementia triples. With a severe untreated hearing loss, you are five times more likely to develop dementia.”"
        },
        {
            "text": "In December 2022, over 1700 people living within Care UK’s services were identified as wearing hearing aids or deaf, the majority of these had not had access to physical ear or hearing checks since before March 2020, because of the COVID-19 pandemic."
        },
        {
            "heading": 2,
            "text": "Impressive uptake and outcomes"
        },
        {
            "text": "42% identified ear wax causing hearing loss, which was subsequently treated with a course of ear drops and micro-suction."
        },
        {
            "text": "The impact on quality of life was immediate, with residents who had isolated themselves in their rooms now engaging in social activities."
        },
        {
            "text": "One gentleman stated loudly he was very deaf. Otoscopy identified both ear canals were blocked with wax. Following micro-suction removing earwax from both ears, he experienced an immediate improvement. The gentleman was absolutely delighted and is now able to participate in many activities he had previously withdrawn from."
        },
        {
            "text": "Following otoscopy and a hearing test, it was clear to another resident she might benefit from referral to an audiologist, who subsequently arranged hearing aids for her. She and her family can now enjoy conversations and activities together. She has become less socially isolated and enjoys the company of others."
        },
        {
            "text": "Another resident had been reluctant to come out of their room since admission, and had difficulty understanding colleagues and their families. Otoscopy revealed a wax blockage in both ears. Successful wax removal resulted in the resident having immediate improvement in their hearing. They are now fully integrated in the care home community and enjoying spending time with family and friends."
        },
        {
            "text": "Important realisations emerging from the project included the need to determine the necessary time required to release nurses to run clinics  and the ongoing cost of the equipment subscription – both of which needed to be addressed before rollout could commence."
        },
        {
            "heading": 2,
            "text": "Next steps for the Hearwell Project"
        },
        {
            "text": "Over 64% of people in Care UK care homes live with dementia. Of the total population of residents, 20.4% are deaf or wear hearing aids, therefore, the potential need for treatment for reversible hearing loss is extensive."
        },
        {
            "text": "A development programme is underway to train nurses and practitioners to deliver otoscopy, hearing assessment and micro-suction. Further study is continuing to measure impacts of quality-of-life indicators, including falls reduction."
        },
        {
            "text": "The importance of funding small studies like the Hearwell Project cannot be underestimated. Nurses in care homes are uniquely positioned to identify areas of practice development that significantly improve quality of life and help reduce non-essential hospital admissions."
        },
        {
            "text": "I believe projects like these really show how social care nursing can not only transform the lives of those we care for but also help our colleagues, across all care and clinical disciplines, deliver even  better care. I hope the recognition we received at this year’s Nursing Times Awards will be an inspiration to others, proving our worth as vital partners in maintaining the health and wellbeing of our communities."
        }
    ]
}