{
    "url": "https://ukhsa.blog.gov.uk/2023/11/03/how-weather-health-alerts-differ-from-the-national-severe-weather-warning-service/",
    "title": "How Weather-Health Alerts differ from the National Severe Weather Warning Service",
    "authors": [
        "Blog Editor"
    ],
    "categories": [
        "Climate",
        "Health in a changing climate"
    ],
    "pub_date": "2023-11-03T09:54:17+01:00",
    "content": [
        {
            "text": "During both the summer and winter seasons, UKHSA and the Met Office monitor weather forecasts to help health and social care professionals, responders, the voluntary sector and the public cope with adverse weather. Where episodes of particularly hot or cold weather are identified, they carry out a joint dynamic risk assessment and issue alerts if necessary."
        },
        {
            "heading": 2,
            "text": "Not just temperature"
        },
        {
            "text": "The UKHSA’s Weather-Health Alerts (WHA) system changed in June 2023. While the previous system triggered alerts when a specific temperature was reached, the new WHAs use temperature thresholds alongside other criteria, including duration of the event, how many regions are affected and the potential for escalation."
        },
        {
            "text": "Over and above temperature, there are other compounding risks such as drought, air pollution, wildfires or flooding that may exacerbate impacts on health. This change in approach is due to evidence of the relationship between temperatures and mortality; observed impacts across the health and social care system during heatwave episodes in the last decade; and long-term weather trends of each region of England."
        },
        {
            "heading": 2,
            "text": "How do Weather-Health Alerts differ from Weather Warnings?"
        },
        {
            "text": "UKHSA works in collaboration with the Met Office on deciding when to trigger our WHAs, but these alerts are separate from the Met Office’s own UK-wide National Severe Weather Warning Service (NSWWS). Weather-Health Alerts relate to health impacts that may be seen as a result of the weather and are mainly targeted at the health and social care sector and responders, while the NSWWS has a wider audience. The WHAs break down into 2 main types:"
        },
        {
            "heading": 2,
            "text": "Cold-Health Alerts"
        },
        {
            "text": "Cold temperature-specific warnings are not issued currently as part of the National Severe Weather Warning Service. The Met Office instead publishes alerts for a range of high-impact weather conditions, including rain, fog, wind, thunderstorms, snow and ice. These warnings provide a holistic view of the weather picture and its potential impacts over an alerting period that the public and emergency planners may find useful."
        },
        {
            "text": "UKHSA considers cold temperatures explicitly in relation to Weather-Health Alerts alongside other factors (outlined in the WHA user manual) as part of a dynamic risk assessment conducted with the Met Office. This is due to observed impacts across the health and social care system during periods of cold weather."
        },
        {
            "text": "UKHSA and the Met Office remain in regular contact throughout the winter season, ensuring the earliest possible issuing of UKHSA’s Cold-Health Alerts (CHAs) and the maximum possible warning time. Warnings issued by the Met Office during this period serve as contributing factors to the level alert being issued."
        },
        {
            "heading": 2,
            "text": "Heat-Health Alerts"
        },
        {
            "text": "In England there are 2 early warning systems related to high temperature – Heat-Health Alerts (HHA) and Extreme Heat (EH) warnings. The latter are part of the National Severe Weather Warning Service. A key difference between the systems is that UKHSA’s alerting system begins at the yellow level, while the Met Office’s National Severe Weather Warning Service only issues amber and red alerts."
        },
        {
            "text": "UKHSA’s yellow alerts focus on those who are particularly vulnerable, such as the elderly and those with certain long-term health conditions. At this level, action is likely to be required within the health and social care specifically. It is for this reason that amber HHAs issued by UKHSA have lower thresholds than the Met Office’s amber NSWWS warnings, meaning they are not always issued in parallel."
        },
        {
            "text": "Due to the generally higher temperatures experienced in London, a slightly different measurement is used to trigger HHAs in the London region."
        },
        {
            "heading": 2,
            "text": "Specific to region"
        },
        {
            "text": "Alerts from the National Severe Weather Warning Service cover the whole of the UK, while Weather Health Alerts relate to England only. WHAs are issued per government region, and the new automated alerting system allows users to specify which area they wish to be updated about."
        },
        {
            "text": "You can register for the new alerting system here or visit the dedicated WHA Service web platform to view the current alert status across England. We will also share any Weather Health Alerts on social media platforms including Facebook and X. These alerts will help our health professionals and responders cope with what seem to increasingly extreme weather events, in both summer and winter."
        }
    ]
}