{
    "url": "https://deframedia.blog.gov.uk/2022/04/12/bathing-water-status-for-isle-of-wight-and-oxford-swimming-spots/",
    "title": "Bathing water status for Isle of Wight and Oxford swimming spots",
    "authors": [
        "Defra Press Office"
    ],
    "categories": [
        "Environment Agency",
        "Weekly stories"
    ],
    "pub_date": "2022-04-12T15:45:18+01:00",
    "content": [
        {
            "text": "There has been widespread positive coverage today in The Times, the Telegraph, the Guardian, the Independent, BBC News and Sky News of Defra’s announcement that part of the Wolvercote Mill Stream at Port Meadow, Oxford, and the East Cowes Esplanade on the Isle of Wight will be added to the list of bathing waters in England from next month."
        },
        {
            "text": "This follows public consultations which ran from 9 February to 2 March on designating the sites, which are popular swimming and paddling spots for both local residents and visitors to the area."
        },
        {
            "text": "The new status means that the Environment Agency will regularly take samples from the sites to assess the level of water quality and whether action is needed to cut bacteria levels. Monitoring will begin at both sites from May 15, the beginning of the bathing water season. Results of water quality testing will be used to classify the bathing waters in the autumn."
        },
        {
            "text": "Environment Minister Rebecca Pow said:"
        },
        {
            "text": "The Environment Agency has been monitoring and driving improvements at coastal and inland bathing waters since the 1990s, and in this time there have been significant improvements to water quality. In 2021, 99 per cent of England’s bathing waters met the minimum bathing water standard – the highest number since new standards were introduced in 2015."
        },
        {
            "text": "Today’s announcement follows new plans unveiled by the Government to tackle the number of discharges of untreated sewage from storm overflows, including discharges into bathing waters. Under the proposed plan, there will be over 70% fewer discharges close to bathing waters by 2035 during the bathing season, with significant reductions expected outside the bathing season as well."
        },
        {
            "text": "Follow Defra on Twitter, and sign up for email alerts here."
        },
        {
            "text": "Photo credit: cc-by-sa/2.0 - Bathers in Wolvercote Mill Stream by David Martin - geograph.org.uk/photo/5836119"
        }
    ]
}