{
    "url": "https://educationhub.blog.gov.uk/2022/04/12/everything-you-need-to-know-about-covid-measures-during-exams-this-summer/",
    "title": "Everything you need to know about Covid measures during exams this summer",
    "authors": [
        "media officer"
    ],
    "categories": [
        "A Level",
        "Coronavirus",
        "Exams and qualifications",
        "GCSE"
    ],
    "pub_date": "2022-04-12T11:33:02+01:00",
    "content": [
        {
            "text": "*This post was updated on Tuesday 17 May 2022. Students studying for their GCSEs, A levels and vocational qualifications will be preparing to sit their exams this summer. We know that there may be instances where students contract the virus during the exam period, as we continue to live with COVID-19."
        },
        {
            "text": "Here we look at what students should do if they display the symptoms in UKHSA guidance or receive a positive Covid test result while taking their exams."
        },
        {
            "text": "Exams have been spaced by a minimum of ten days between the first and last exam in any subject, to reduce the chance of students missing all exams in a subject because of illness."
        },
        {
            "text": "Parents should, wherever possible, encourage their children to attend their exams. However, there may be exceptional cases though where this will not be possible, e.g., a temporary illness on the day of the examination."
        },
        {
            "heading": 3,
            "text": "Will I have to provide proof of a positive Covid test if I fail to sit an exam due to Covid?"
        },
        {
            "text": "No - there is no requirement for you to complete a COVID-19 test to provide evidence of your absence from an exam. You should speak to your school, college, or exam centre, who can provide you with a self-certification form for you or your parents/carers to complete and tell you if there is anything else you need to do."
        },
        {
            "heading": 3,
            "text": "I am taking my A levels and have a high temperature on the day of one of my exams, what should I do?"
        },
        {
            "text": "UKHSA guidance advises you to stay at home and avoid contact with others, until you no longer have a high temperature and are well enough to attend your exams."
        },
        {
            "text": "As your exams have been spaced by at least ten days you will be able to receive A-level grades based on the other components completed, as you are considered to have an acceptable reason for missing the exam."
        },
        {
            "text": "You need to ask your school, college, or exam centre to make an application for special consideration and complete any forms they ask you to do. This is important because if your centre doesn’t make the special consideration application, you would receive a 0 for the missed exam."
        },
        {
            "heading": 3,
            "text": "I have taken a COVID-19 test under the direction of my GP and have a positive test result, what should I do?"
        },
        {
            "text": "The UKHSA guidance is that you stay at home and avoid contact with others for 3 days (if 18 and under) or 5 days (if 19 or older) after the day you took the test. You should speak to your school, college, or exam centre, who can provide you with a self-certification form to complete and tell you if there is anything else you need to do. As your exams have been spaced by at least ten days you will be able to receive A-level grades based on the other components completed, as you are considered to have an acceptable reason for missing the exam. If your centre doesn’t make the special consideration application, you would receive a 0 for the missed exam, so speak to them as soon as possible."
        },
        {
            "heading": 3,
            "text": "I am taking my A levels and am feeling unwell and experiencing a high temperature, but I still want to attend my exam. Can I still sit it?"
        },
        {
            "text": "UKHSA guidance is to stay at home and avoid contact with others until you no longer have a high temperature."
        },
        {
            "text": "JCQ guidance confirms that following UKHSA guidance is an acceptable reason to miss an exam, and you will be eligible to receive special consideration. You should speak to your school, college, or exam centre, who can provide you with a self-certification form to complete and tell you if there is anything else you need to do."
        },
        {
            "text": " "
        },
        {
            "text": " "
        }
    ]
}