{
    "url": "https://food.blog.gov.uk/2022/04/12/making-food-safer-with-two-new-path-safe-fellowships/",
    "title": "Making food safer with two new PATH-SAFE fellowships",
    "authors": [
        "Rick Mumford, Deputy Director, Science Evidence and Research, Deputy CSA"
    ],
    "categories": [
        "Science"
    ],
    "pub_date": "2022-04-12T15:18:22+01:00",
    "content": [
        {
            "text": "Cymraeg"
        },
        {
            "text": "We're delighted to announce the appointment of two fellowships to the Pathogen Surveillance in Agriculture, Food and the Environment programme (PATH-SAFE) team. Data Fellow Professor David Aanensen and Science Fellow Dr Ed Haynes will play a key role in driving forward our scientific innovation."
        },
        {
            "text": " "
        },
        {
            "text": "Foodborne diseases are a major public health risk accounting for 2.4 million individual illnesses and more than 16,000 hospitalisations per year, but recent advances in technology and data management offer the opportunity to create a new surveillance system to protect public health."
        },
        {
            "text": "Through these fellowships and the overall objectives of the PATH-SAFE programme, we aim to significantly improve existing surveillance activities to make the diagnosis of pathogens more accurate, quicker and more efficient."
        },
        {
            "text": "As part of a major cross-government consortium, the FSA is leading a new Shared Outcomes Fund project which aims to harness the power of genomic technology to identify and track foodborne pathogens and antimicrobial-resistant organisms through the agri-food system and environment."
        },
        {
            "text": "The PATH-SAFE programme will build accessible datasets on anti-microbial resistance and antimicrobials in the environment, and a national database to enable ‘user-friendly’ analysis, storage and sharing of pathogen whole-genome data and associated metadata. It will also explore the development of novel remote sampling and diagnostic approaches, and their applicability for microbial surveillance. We are bringing together partners from academia, government and industry to produce a world-leading pathogen surveillance system through this programme."
        },
        {
            "text": "The programme has recruited two talented scientists to help lead on the science and technical delivery of this project, Professor David Aanensen and Dr Ed Haynes."
        },
        {
            "text": "I am absolutely delighted that Dr Haynes and Professor Aanensen have been able to join the PATH-SAFE team, as our new fellows. With their complementary expertise, we look forward to working with them both to drive forward an ambitious and exciting programme of research over the next two years."
        },
        {
            "text": "Find out more about the work of the PATH-SAFE Programme."
        },
        {
            "text": " "
        },
        {
            "heading": 2,
            "text": "Data Fellow: Professor David Aanensen, University of Oxford"
        },
        {
            "text": "I am Director of the Centre for Genomic Pathogen Surveillance at the University of Oxford with a background in molecular epidemiology, software engineering and translational application of data and tools for delivering public health insight."
        },
        {
            "text": "The development of flexible and adaptable data processes that can deliver rational scientific insight, when combined with allied metadata (epidemiological, etc.) presents great opportunities to operationalise genomics for pathogen surveillance and interventional change."
        },
        {
            "text": "Our toolsets are utilised globally for the linkage of epi, clinical and genomic data, for example within:"
        },
        {
            "text": "They're architected to adapt to pathogen paradigms, e.g. from SARS-CoV-2 to pathogens implicated in the landscape of antimicrobial resistance (AMR), as well as local data architectures."
        },
        {
            "text": "I am also Director of the NIHR Global Health Research Unit on Genomic Surveillance of AMR which has delivered sustainable genomic and data capacity for AMR surveillance with partners in India, Colombia, Nigeria and The Philippines. This work has helped shape policy within the country and upwards within white papers for the World Health Organisation (WHO)."
        },
        {
            "text": "Within PATH-SAFE we have a tremendous opportunity to synergise the rollout of whole-genome sequencing with rapid data linkage and interpretation to deliver information to stakeholders. This will enable more rapid and informed decision making, both for outbreak detection and to start addressing the complex operational challenges of AMR detection and prevention."
        },
        {
            "text": " "
        },
        {
            "heading": 2,
            "text": "Science Fellow: Dr Ed Haynes, Fera Science Ltd"
        },
        {
            "text": "I am a molecular biologist at Fera Science, with a background in bacterial genomics of foodborne, plant and honey bee pathogens."
        },
        {
            "text": "Earlier in my career, I held another joint post between Fera and the FSA to develop genomic approaches to foodborne bacteria, which involved working with the US Food and Drug Administration (FDA) to learn from the extensive work they had been doing to routinely apply genomic tools to foodborne pathogens in the GenomeTrakr project."
        },
        {
            "text": "In the last few years, I have also led projects applying non-targeted metagenomic sequencing approaches to detect AMR genes in different parts of the food production chain, in meat factories and in ready-to-eat foods."
        },
        {
            "text": "The PATH-SAFE programme is strongly aligned with my interests and joining the programme as Science Fellow seemed like a tremendous opportunity to be involved in piloting the use of genomic techniques for a national surveillance system for foodborne pathogens."
        },
        {
            "text": "At the end of the programme, I hope that we will have produced a roadmap for a national genomic surveillance system, and the pilot studies that the programme is developing should allow us to use these molecular tools to generate important insights into specific pathogens and AMR in the agri-environment around the UK."
        },
        {
            "heading": 1,
            "text": "Gwneud bwyd yn fwy diogel gyda dwy gymrodoriaeth newydd ar gyfer y rhaglen Cadw Gwyliadwriaeth ar Bathogenau mewn Amaethyddiaeth, Bwyd a’r Amgylchedd"
        },
        {
            "text": "Mae tîm y rhaglen Cadw Gwyliadwriaeth ar Bathogenau mewn Amaethyddiaeth, Bwyd a’r Amgylchedd (PATH-SAFE), yn falch iawn o gyhoeddi ein bod wedi penodi dwy gymrodoriaeth i’r rhaglen, sef Cymrodoriaeth Data a Chymrodoriaeth Wyddoniaeth, a fydd yn allweddol wrth yrru ein gwaith gwyddonol arloesol yn ei flaen."
        },
        {
            "text": "Mae clefydau a gludir gan fwyd yn peri risg fawr i’r cyhoedd gan gyfrif am 2.4 miliwn o achosion o salwch a mwy na 16,000 o ymweliadau â’r ysbyty bob blwyddyn, ond mae datblygiadau diweddar ym maes technoleg a rheoli data yn cynnig cyfle i greu system wyliadwriaeth newydd i ddiogelu iechyd y cyhoedd."
        },
        {
            "text": "Trwy’r cymrodoriaethau hyn ac amcanion cyffredinol y rhaglen PATH-SAFE, ein nod yw gwella gweithgarwch cadw gwyliadwriaeth presennol yn sylweddol er mwyn gallu diagnosio pathogenau’n gyflymach ac mewn modd mwy effeithlon a chywir."
        },
        {
            "text": "Fel rhan o gonsortiwm traws-lywodraethol mawr, mae’r ASB yn arwain ar brosiect Cronfa Canlyniadau a Rennir newydd sy’n ceisio rheoli grym technoleg genomig a’i defnyddio i nodi ac olrhain pathogenau a gludir gan fwyd ac organebau sydd ag ymwrthedd gwrthficrobaidd trwy’r system fwyd-amaeth a’r amgylchedd."
        },
        {
            "text": "Bydd y rhaglen PATH-SAFE yn creu setiau data hygyrch ar ymwrthedd gwrthficrobaidd (AMR) a sylweddau gwrthficrobaidd yn yr amgylchedd, yn ogystal â chronfa ddata genedlaethol i hwyluso dulliau hawdd eu defnyddio ar gyfer dadansoddi, storio a rhannu data genom-cyfan am bathogenau a metadata cysylltiedig. Bydd y rhaglen hefyd yn archwilio’r gwaith o ddatblygu dulliau samplu a dulliau diagnostig o bell newydd, a’r gallu i’w cymhwyso wrth gadw gwyliadwriaeth ar lefel ficrobaidd. Trwy’r rhaglen hon, rydym ni’n dod â phartneriaid o’r byd academaidd, y llywodraeth a’r diwydiant at ei gilydd i greu system cadw gwyliadwriaeth ar bathogenau sydd ar flaen y gad yn fyd-eang."
        },
        {
            "text": "Mae’r rhaglen wedi recriwtio dau wyddonydd dawnus i helpu i arwain y prosiect hwn yn wyddonol ac yn dechnegol, sef yr Athro David Aanensen a Dr Ed Haynes."
        },
        {
            "text": "Rwyf wrth fy modd bod Dr Haynes a’r Athro Aanensen wedi gallu ymuno â thîm PATH-SAFE, fel ein cymrodyr newydd. Gan fanteisio ar arbenigedd y naill a’r llall, edrychwn ymlaen at weithio gyda nhw i yrru rhaglen ymchwil uchelgeisiol a chyffrous yn ei blaen dros y ddwy flynedd nesaf."
        },
        {
            "text": "Ewch ati i ddysgu rhagor am waith y Rhaglen PATH-SAFE."
        },
        {
            "text": " "
        },
        {
            "heading": 2,
            "text": "Cymrawd ar gyfer Data: Yr Athro David Aanensen, Prifysgol Rhydychen"
        },
        {
            "text": "Fi yw Cyfarwyddwr y Ganolfan Cadw Gwyliadwriaeth ar Bathogenau Genomig ym Mhrifysgol Rhydychen, gyda chefndir mewn epidemioleg foleciwlaidd, peirianneg meddalwedd a defnyddio data ac offer trawsfudol i gael dealltwriaeth o iechyd y cyhoedd."
        },
        {
            "text": "Mae datblygu prosesau data hyblyg ac addasadwy a all gyflwyno mewnwelediad gwyddonol rhesymegol, a chyfuno hyn â metadata perthnasol (epidemiolegol ac ati), yn cynnig cyfleoedd gwych i fanteisio ar genomeg er mwyn cadw gwyliadwriaeth ar bathogenau ac ysgogi newid ymyriadol. Defnyddir ein setiau offer dros y byd i gyd er mwyn cysylltu data epi, clinigol a genomig (er enghraifft, o fewn Canolfannau Atal a Rheoli Clefydau (CDC) yr Unol Daleithiau, Canolfan Atal a Rheoli Clefydau Ewrop (eCDC), Iechyd Cyhoeddus Cymru ac Asiantaeth Diogelu Iechyd y Cyhoedd yr Alban), a chânt eu dylunio i addasu i baradeimau pathogenau (er enghraifft, o SARS-CoV-2 i bathogenau sy’n gysylltiedig â thirwedd AMR) yn ogystal â phensaernïaeth ddata leol."
        },
        {
            "text": "Rwyf hefyd yn Gyfarwyddwr Uned Ymchwil Iechyd Byd-eang y Sefydliad Cenedlaethol dros Ymchwil Iechyd (NIHR) ar Gadw Gwyliadwriaeth Genomig ar AMR, sydd wedi sicrhau capasiti genomig a chapasiti data cynaliadwy ar gyfer cadw gwyliadwriaeth ar AMR gyda phartneriaid yn India, Colombia, Nigeria ac Ynysoedd Philippines. Mae’r gwaith hwn wedi helpu i lunio polisi yn y gwledydd unigol ac ar lefel uwch, o fewn papurau gwyn Sefydliad Iechyd y Byd."
        },
        {
            "text": "Fel rhan o PATH-SAFE, mae gennym ni gyfle gwych i gydlynu’r broses o gyflwyno dilyniannu genom cyfan â dehongliadau a chysylltiadau data cyflym i rannu gwybodaeth â rhanddeiliaid a fydd yn galluogi gwneud penderfyniadau cyflymach a gwybodus ar gyfer canfod brigiadau o achosion, ac i ddechrau mynd i’r afael â heriau gweithredol cymhleth canfod ac atal AMR."
        },
        {
            "text": " "
        },
        {
            "heading": 2,
            "text": "Cymrawd ar gyfer Gwyddoniaeth: Dr Ed Haynes, Fera Science Ltd"
        },
        {
            "text": "Rwy’n fiolegydd moleciwlaidd yn Fera Science, gyda chefndir mewn genomeg bacteriol pathogenau a gludir gan fwyd, pathogenau planhigion a phathogenau gwenyn mêl."
        },
        {
            "text": "Yn gynharach yn fy ngyrfa, roedd gennyf swydd arall ar y cyd â Fera a’r ASB i ddatblygu dulliau genomig mewn perthynas â bacteria a gludir gan fwyd. Roedd y rôl yn cynnwys gweithio gyda Gweinyddiaeth Bwyd a Chyffuriau’r Unol Daleithiau (FDA) i ddysgu am y gwaith helaeth yr oedd wedi’i wneud wrth ddefnyddio offer genomig yn rheolaidd ar gyfer pathogenau a gludir gan fwyd, fel rhan o’r prosiect GenomeTrakr."
        },
        {
            "text": "Yn ystod y blynyddoedd diwethaf, rwyf hefyd wedi arwain prosiectau sy’n defnyddio dulliau dilyniannu metagenomig heb eu targedu i ganfod genynnau AMR mewn gwahanol rannau o’r gadwyn cynhyrchu bwyd, ffatrïoedd cig a bwydydd parod i’w bwyta."
        },
        {
            "text": "Mae’r rhaglen PATH-SAFE yn cyd-fynd â’m diddordebau ac roedd ymuno â’r rhaglen fel Cymrawd Gwyddoniaeth yn teimlo fel cyfle gwych i fod yn rhan o dreialu defnyddio technegau genomig mewn perthynas â system wyliadwriaeth genedlaethol ar gyfer pathogenau a gludir gan fwyd."
        },
        {
            "text": "Ar ddiwedd y rhaglen, rwy’n gobeithio y byddwn ni wedi creu cynllun ar gyfer system wyliadwriaeth genomig genedlaethol, a dylai’r astudiaethau peilot y mae’r rhaglen yn eu datblygu ein galluogi i ddefnyddio’r offer moleciwlaidd hyn i gael mewnwelediad pwysig i bathogenau penodol ac AMR yn y amaeth-amgylchedd, ledled y DU."
        }
    ]
}