{
    "url": "https://digitaltrade.blog.gov.uk/2022/04/12/our-strategy-being-data-driven/",
    "title": "Our strategy: being data driven",
    "authors": [
        "Sian Thomas, Chief Data Officer",
        "Jane Naylor, Chief Statistician"
    ],
    "categories": [
        "Culture",
        "Data",
        "Digital Services",
        "People and Skills"
    ],
    "pub_date": "2022-04-12T12:39:49+01:00",
    "content": [
        {
            "text": "In the Department for International Trade (DIT), data and data-driven approaches are held in high regard. Data should underpin our policy and operational decisions and quantify the impact of our work. This could be from engaging with businesses to support exports, to understanding the drivers for investment or supporting trade policy and negotiations. Developing the Data Annex of the Digital, Data and Technology (DDaT) strategy has been a collaborative effort. DDaT’s data teams and analysts have been working together on a data strategy for the whole department."
        },
        {
            "text": "The new data strategy will allow us to rise to this challenge to meet our vision:"
        },
        {
            "text": "Making better use of data is something that DIT and wider government talk about a lot. However, this is dependent on having the right culture, capability and skills in place to make the most of opportunities. We were keen to have this clearly articulated in our data strategy."
        },
        {
            "text": "\nSian Thomas, Chief Data Officer and Jane Naylor, Chief Statistician "
        },
        {
            "heading": 2,
            "text": "Culture, capability, and skills   "
        },
        {
            "text": "Our new strategy lays out that: “we will develop DIT culture, capability, and skills to make use of data with useful and timely insight. DIT will develop sustainable capability and expertise to build, manage and run services and infrastructure and undertake innovative analysis. We will improve our data quality, manage our data effectively and seek opportunities to creatively make the best use of the data we have as well as developing and exploiting new data sources. We will share the lessons we learn so others may benefit from our experience. "
        },
        {
            "text": "A collaborative approach will ensure that all staff have opportunities to develop data capability for the 21st Century, enabling DIT to be part of the transformation that government is striving to achieve through the National Data Strategy.  Central to this is developing a workforce that is ambitious to engage with future ways of working around data, including ongoing learning across all roles and areas so that data is put to good use at DIT.\""
        },
        {
            "text": "Collaboration around this ambition means our teams can build on their strengths, deliver great analytical insight and use modern data infrastructure to innovate.   "
        },
        {
            "text": "We have our data principles that underpin the strategy:"
        },
        {
            "text": "\nData principles of Use, Value and Governance"
        },
        {
            "heading": 2,
            "text": "Use "
        },
        {
            "text": "We will ensure that DIT staff have the right data easily available to them by ensuring it is stored and accessible in our Data Workspace. We will continue to explore new data sources that can underpin our work. This includes researching new approaches to measuring trade and investment and new non-traditional data sources. "
        },
        {
            "heading": 2,
            "text": "Value "
        },
        {
            "text": "We will ensure DIT staff have the right tools, skills and support to drive value from these data sources. We will ensure that we are clear about the strengths and limitations of data sources to ensure appropriate use. "
        },
        {
            "heading": 2,
            "text": "Governance  "
        },
        {
            "text": "We will follow government best practice to maintain trust in DIT’s ability to hold and use data. "
        },
        {
            "text": "Now that we have our data strategy, we are keen to measure its impact and review effectiveness. We would like to hear views on whether this aligns with the work progressing in other government departments or the private sector. We are happy to share our experience. "
        }
    ]
}