{
    "url": "https://deframedia.blog.gov.uk/2022/04/12/six-year-programme-of-flood-protection-work-exceeds-targets-after-2-6-billion-investment/",
    "title": "Six-year programme of flood protection work exceeds targets after £2.6 billion investment",
    "authors": [
        "Defra Press Office"
    ],
    "categories": [
        "Environment Agency",
        "Weekly stories"
    ],
    "pub_date": "2022-04-12T15:38:59+01:00",
    "content": [
        {
            "text": "There has been widespread positive regional coverage of our publication of the assessment of the 2015-2021 flood and coastal defence capital investment programme – revealing how this £2.6 billion six-year programme of work exceeded its original targets by 14,000 with over 314,000 homes now better protected from flooding since 2015."
        },
        {
            "text": "Op-eds by Environment Secretary George Eustice are carried in regional outlets including the Yorkshire Post and the Northern Echo. There is also a short piece in The Sun, and further coverage in the Western Morning News, the Eastern Daily Press and BusinessGreen."
        },
        {
            "text": "Analysis in the post-programme assessment of 2015-2021 flood and coastal defence capital investment programme reveals how more than 850 new flood and coastal erosion defence projects were completed during this six-year period. Over 580,000 acres of agricultural land, as well as thousands of businesses, communities and major infrastructure – including more than 8,000 kilometres of roads – also benefited from improvement schemes."
        },
        {
            "text": "Alongside delivering on its headline target, Defra’s capital investment programme from 2015-2021 has also brought wider benefits to both the environment through the creation and enhancement of natural habitats, and also local communities, through better protecting nationally important infrastructure and wider contributions to economic recovery. Early analysis suggests the programme of work over the last six years has saved the economy more than £28 billion in avoided damages to properties, businesses and more over the lifetime of these defence assets."
        },
        {
            "text": "Environment Secretary, George Eustice, said:"
        },
        {
            "text": "Emma Howard Boyd, Chair of the Environment Agency, said:"
        },
        {
            "text": "The assessment of this 2015-2021 programme comes as the government is one year into a £5.2 billion investment in around 2,000 new flood and coastal defences between 2021 and 2027."
        },
        {
            "text": "These upcoming schemes will help to reduce the national flood risk by up to 11 per cent and help to avoid £32 billion of wider economic damages along with a range of other benefits for local communities and the environment."
        },
        {
            "text": "It will better protect 550 kilometres of road and rail infrastructure, create or improve 13,000 acres of natural habitat, and enhance 830 kilometres of rivers."
        },
        {
            "text": "Follow Defra on Twitter, and sign up for email alerts here."
        }
    ]
}