{
    "url": "https://naturalengland.blog.gov.uk/2022/04/12/social-prescribing-the-power-of-nature-as-treatment/",
    "title": "Social Prescribing: the power of nature as treatment",
    "authors": [
        "Natural England"
    ],
    "categories": [
        "Mental health and wellbeing",
        "Natural England"
    ],
    "pub_date": "2022-04-12T10:11:44+01:00",
    "content": [
        {
            "text": "Taking place between 4-11 March, Social Prescribing Week saw a national celebration for social prescribing. Across the country, organisations shared their stories on social media and at national and international conferences about the activities they were undertaking to make a difference to people’s lives."
        },
        {
            "text": "There was something very inspiring and different about Social Prescribing Week this year – which was the greenness of the social prescribing activities involved. The week helped to highlight local projects and emphasise the importance that Green Social Prescribing is playing in improving the nation’s wellbeing."
        },
        {
            "text": "Studies are showing more and more that nature plays a critical role in our physical and mental wellbeing. Our People & Nature Survey data recorded that in January 2022, 90 per cent of adults in England reported they view green and natural spaces as good places for mental health and wellbeing. It’s plain to see that the power of nature is essential for our health, and so Natural England, along with its partners, is on a mission to ensure that more people can access the healing properties of spending time in natural spaces through its Green Social Prescribing programme."
        },
        {
            "text": "Green Social Prescribing (GSP) is the practice of supporting people in engaging in nature-based interventions and activities to improve their mental health. Social prescribing Link Workers (and other trusted professionals in allied roles) connect people to community groups and agencies for practical and emotional support, based on a ‘what matters to you’ conversation. Across the country, there is a clear shift towards acknowledging the benefits that nature and green social prescribing plays in the recovery of mental ill health. That shift is evidenced by reviews such as those outlined within the reviewed journal Population Health, Science Direct:"
        },
        {
            "text": "Nature-based outdoor activities for mental and physical health: Systematic review and meta-analysis by Coventry et al., (2021)"
        },
        {
            "text": "With the green social prescribing movement ever growing, more people are being encouraged to engage in more opportunities and activities across the country which will help improve their health and wellbeing. You can find more information from our exciting explainer video:"
        },
        {
            "text": "Green social prescribing activities can be offered as an alternative form of treatment by a GP as well as through other methods within social care, housing, and community groups. Individuals might also sign up to GSP activities themselves directly."
        },
        {
            "text": "As well as supporting green social prescribing to create benefits for people and for nature’s recovery, Natural England has been playing a key role in supporting the delivery of the National Academy of Social Prescribing’s (NASP) Thriving Communities Programme. Furthermore, Natural England is also working with new partners such as Wessex Water, Bath University and Bath and North-East Somerset Council on the Pharmaceuticals and Nature pilot project, which is exploring options to reduce pharmaceutical loads entering sewage works through the use of GSP."
        },
        {
            "text": " "
        },
        {
            "text": "To understand what can be done to facilitate access to GSP for everyone, Natural England is working with the Department for Environment, Food and Rural Affairs (Defra), NHS England, Department of Health and Social Care (DHSC), the Department for Levelling Up, Housing and Communities (DLUHC), NASP and Sport England, as well as a host of local community and health partners, on a national £5.77m project preventing and tackling mental ill health through green social prescribing, which runs until March 2023. The project builds on the government’s commitment to transform mental health services and increase social prescribing, set out in the NHS Long Term Plan. It will also help deliver on the ambition set out in the Government’s 25 Year Environment Plan to help more people, from all backgrounds, to engage with and spend time in green and blue spaces in their everyday lives."
        },
        {
            "text": "This project is developing seven ‘test and learn’ pilot sites across England, which are exploring what is required to scale up GSP at a local level and increase patient referrals to nature-based activities. The project is also delivering national research, aiming to demonstrate the effectiveness of GSP clinically, to map the national spread of GSP activities, and to investigate the perceptions of GSP amongst healthcare workers and the public. The project is supported by a robust evaluation, which will help in learning lessons in order to be more confident in scaling up GSP nationally."
        },
        {
            "text": "There are a rich and diverse range of activities being offered as part of the project, as demonstrated by the Canal and Rivers Trust's Wellbeing Waterways project in Nottingham and Open Minds Active wild swimming programme in North Somerset."
        },
        {
            "text": "These are both projects where people are benefitting from more positive mental health and wellbeing through wild swimming and ‘blue’ spaces.  As quoted by one of the participants for the Open Minds wild swimming group:"
        },
        {
            "text": "These projects are crucial to help individuals, and the acknowledgement of their importance for our mental health and wellbeing is a leap forward in creating community-embedded, nature-based, person-centred care."
        },
        {
            "text": "Whether you’re interested in getting involved in GSP projects directly or learning about the important work Natural England is doing, take a look at our gov.uk page for more information."
        },
        {
            "text": " "
        },
        {
            "heading": 4,
            "text": "Rachel Cook, Green Social Prescribing Pilot Lead,"
        },
        {
            "text": "Natural England"
        }
    ]
}