{
    "url": "https://insideDIO.blog.gov.uk/2022/04/12/stress-awareness-month-2022-how-we-can-support-each-other-to-combat-stress/",
    "title": "Stress Awareness Month 2022: how we can support each other to combat stress",
    "authors": [
        "Laura Brown"
    ],
    "categories": [
        "Mental health",
        "Wellbeing",
        "Working at DIO"
    ],
    "pub_date": "2022-04-12T14:16:12+00:00",
    "content": [
        {
            "text": "Stress Awareness Month has been held every April since 1992 to raise awareness about what stress is, how it can affect us and what tools and support mechanisms are available to help those who need it. A little bit of stress can be good for you, but too much can lead to burnout. Some of the signs of stress or burnout include feeling overwhelmed, trouble sleeping, racing thoughts, and eating more or less than usual."
        },
        {
            "text": "As someone who has had stress creep up on me without noticing the signs and symptoms until it was too late, I care passionately about this topic, and I'm very pleased to be able to share some of the things DIO is doing to support colleagues during Stress Awareness Month."
        },
        {
            "heading": 2,
            "text": "How DIO is supporting Stress Awareness Month"
        },
        {
            "text": "Employee wellbeing is a key part of our culture in DIO, and a number of resources and events are taking place which encourage us to come together, to think about, and to talk about, what causes us stress and anxiety."
        },
        {
            "text": "We kicked off the month with a session delivered by the Charity for Civil Servants that highlighted tools and tips for dealing with stress, anxiety and burnout. Nearly 500 staff attended the call and shared the different things they do to de-stress, ranging from going for a run, reading a book, and laughing with family and friends, to listening to the birds, singing in a choir and working with animals. My particular favourite was the calming effect of listening to wind chimes - I will have to invest in some for my own garden!"
        },
        {
            "text": "We have a network of Mental Health First Aiders who are available to colleagues at any time if they need help, support or just someone to talk to about their mental health. All our staff are also encouraged to complete an e-learning mental health and resilience training course, as well as take part in additional activities such as meditation. We also share wellbeing toolkits with links to further resources and support services, including the NHS, The Stress Management Society and charities such as Mind."
        },
        {
            "text": "Stress is defined as any type of change that causes physical, emotional or psychological strain [Copyright/Pixabay]Later in the month senior leaders and wellbeing champions will be hosting a coffee and chat call, which is a brilliant opportunity for all staff to take some time out of their day to grab a tea or coffee and discuss the topic of burnout. A senior leader and one of our mental health first aiders will be sharing their own experiences and things they have found useful in helping cope with stress. I particularly enjoy the opportunity to take a break and often dial into the conversation while going for a walk to help get me away from my desk and out in nature (one of my own stress-busting tools!)."
        },
        {
            "heading": 2,
            "text": "The importance of recognising stress in the workplace"
        },
        {
            "text": "As part of DIO’s strong safety culture, we have shared a number of ‘Safety Moments’ to be used at the beginning of team meetings, highlighting top tips to deal with stress and burnout. These include splitting up big tasks, challenging your thoughts, planning ahead, and practicing positivity and gratitude."
        },
        {
            "text": "However you are feeling, it is important to be aware of how stressed you are and notice the signs that you might need to take some time for self-care. Whether you are someone who enjoys being active, find breathing exercises beneficial or loves meeting up with friends, don’t forget to make time for yourself to re-charge your batteries and increase your resilience against stress."
        }
    ]
}