{
    "url": "https://defrafarming.blog.gov.uk/2022/04/12/the-uk-agriculture-partnership-reflections-on-the-first-meeting/",
    "title": "The UK Agriculture Partnership: reflections on the first meeting",
    "authors": [
        "The Devolution and International Team"
    ],
    "categories": [
        "Farming across the UK"
    ],
    "pub_date": "2022-04-12T12:42:32+01:00",
    "content": [
        {
            "text": "Even though agricultural policy in the UK is devolved, each country in the union can benefit by working together."
        },
        {
            "text": "The UK Agriculture Partnership (UKAP) is a forum which meets to share technical information on common challenges."
        },
        {
            "text": "The subject of our first meeting was water quality. "
        },
        {
            "text": "Our aim was to understand the nature and scale of the challenges, and how we could address them together."
        },
        {
            "text": "We were joined by representatives from the devolved administrations, universities, research institutes and farming organisations."
        },
        {
            "text": "Speakers included senior academics and researchers from the universities of Bristol, Durham, Exeter, Lancaster and Leeds. We were also joined by the Agri-Food and Biosciences Institute, the Rothamsted Research Institute and the British Geological Survey. "
        },
        {
            "text": "There were also speakers from Wales Water (Dŵr Cymru) and Yorkshire Water, the Linking Farming and Environment (LEAF) organisation, and Natural England. "
        },
        {
            "text": "In this post, we'll share some insights from our first meeting and a video of the event."
        },
        {
            "heading": 2,
            "text": "Agriculture and water quality"
        },
        {
            "text": "Agriculture has a significant impact on water quality and water-dependent ecosystems. With the right support, farmers have the potential to help improve water quality across the UK."
        },
        {
            "text": "A range of issues associated with water quality were discussed. We covered:"
        },
        {
            "heading": 2,
            "text": "Understanding and applying the science "
        },
        {
            "text": "The latest research evidenced by the universities of Bristol, Durham and Lancaster in their presentation gave participants valuable insights into the growing problem of nutrient pollution affecting ecosystems and reducing biodiversity."
        },
        {
            "text": " In particular, organic and particulate nitrate and phosphorous were having a significant impact on watercourses and ecosystems."
        },
        {
            "text": "Levels of nitrate and phosphorous in watercourses had a significant impact on water quality. This underlined the importance of using nutrients and fertilisers responsibly and efficiently. "
        },
        {
            "heading": 2,
            "text": "Working together "
        },
        {
            "text": "Water quality is linked to issues including soil health and the effects of climate change which exacerbate nutrient pollution problems affecting the ecosystem and human health. "
        },
        {
            "text": "Participants heard from the good practice that is already happening with water companies, landowners and government agencies working in collaboration."
        },
        {
            "text": "The event also highlighted the role of the agriculture and food industry and how a systems-based approach can help engage businesses to take action. "
        },
        {
            "heading": 2,
            "text": "The role of farmers"
        },
        {
            "text": "Farmers must be supported with the right information, tools and resources to manage land in a way that reduces the impact on water quality. "
        },
        {
            "text": "We discussed the work Natural England has been doing to roll out a national programme of farm advice. This advice is designed to help farmers and others through the transition. A network of advisers supported future business decisions while addressing the impact of farming on water quality."
        },
        {
            "text": "By building on the good work many farmers are already doing and learning from them about approaches that do and don’t work, we can find practical solutions to water quality issues. "
        },
        {
            "heading": 2,
            "text": "Watch the launch event"
        },
        {
            "heading": 2,
            "text": "Looking ahead "
        },
        {
            "text": "As well as understanding the nature and the scale of common agricultural challenges such as water quality, UKAP needs to concentrate on identifying and sharing solutions. We'll blog about our progress. "
        },
        {
            "text": "We recently held our second UKAP meeting in Northern Ireland at the College of Agriculture, Food and Rural Enterprise (CAFRE)."
        },
        {
            "text": "The subject of this meeting was soil health which is closely linked to water quality. We’ll blog about this event very soon, so do subscribe to the blog."
        }
    ]
}