{
    "url": "https://grantscommunity.blog.gov.uk/2022/04/12/the-first-gov-uk-release-of-the-find-a-grant-pilot-is-now-open-for-everyone/",
    "title": "The first GOV.UK release of the Find a Grant pilot is now open - for everyone",
    "authors": [
        "Lucia Webster"
    ],
    "categories": [
        "Civil Service",
        "Digital transformation",
        "Government Grants Management Function",
        "Grants Applicant Programme",
        "User research"
    ],
    "pub_date": "2022-04-12T14:00:05+01:00",
    "content": [
        {
            "text": "Today marks a big milestone for everyone who is supporting the Grants Applicant Programme. "
        },
        {
            "text": "Seven months ago, we started making a reality of the vision to make finding and applying for grants simpler, faster and fairer by co-creating and piloting a single online place for everyone."
        },
        {
            "text": "I vividly remember the surprise followed by an immediate offer of support from one of now almost 450 Government Grant Community members. He said: “Wow. Really? You are going to get something up and running in a matter of months? How can we help you!!’  "
        },
        {
            "heading": 2,
            "text": "A truly co-created service"
        },
        {
            "text": "At breakneck speed, we actually managed to get a prototype together in 12 weeks, which we have been putting through its paces with our newly formed Community."
        },
        {
            "text": "Today, we are very proud to say that we are launching our public beta service on GOV.UK today.  Yes, the pilot Find a Grant service is officially open for business - to everyone."
        },
        {
            "text": "Now, it doesn’t have every government grant on it - yet.  We have started with 23 schemes so that we can co-create, test and develop - and keep on co-creating, testing and developing between now and March 2023. And, we are working across government to get more grants added during this pilot phase.  "
        },
        {
            "text": "But, if you like it - and it works - this time next year we will make the case, on your behalf, to have it rolled out across government."
        },
        {
            "heading": 2,
            "text": "But back to right now"
        },
        {
            "text": "Over the last three months we have worked with the Government Grants Community - from the voluntary, community and social enterprise sector and small to medium-sized businesses - on the early functionality. In today’s release (and yes, many more releases will come) you can test the ability to browse, search and filter for a grant - and sign up for basic notifications. "
        },
        {
            "text": "All of these grants are live or are about to open, covering a wide range of schemes from support for workplace electric car chargepoints to support with international trade."
        },
        {
            "text": "Should you wish to apply for any, you can. At the moment, you will be taken to the existing grant maker’s application site. "
        },
        {
            "heading": 2,
            "text": "What's to come"
        },
        {
            "text": "But to whet your appetite, this is what we have planned, based on what the Government Grants Community has said to us, so far:"
        },
        {
            "text": "We are also keen to understand the support that grant makers can offer via a single platform and what support grant applicants would like to be made available too. "
        },
        {
            "heading": 2,
            "text": "Data. Data. Data."
        },
        {
            "text": "As part of our Grants Applicant Programme work we are also starting to look into the extent and availability of demographic and equality data for the allocation of grants across government. With evidence and data, we can continue to create a more level playing field for everyone. "
        },
        {
            "text": "I hope to report back on our progress in a few months. "
        },
        {
            "heading": 2,
            "text": "Check it out and keep co-creating with us"
        },
        {
            "text": "Please check out Find a Grant. Please sign up for notifications for things that are important to you.  Please share the link across your networks.  Also, do tell us what you think. What’s good, what’s missing, what could make it even better? "
        },
        {
            "text": "And, please be kind! This is the pilot phase; not a fully functioning, fully populated platform. It is a genuine prototype. "
        },
        {
            "text": "But, hopefully, like us you can see some very healthy, green shoots starting to appear.  And, together we will develop this work over the next year, as we listen to and learn from each other on the features you want and need to make it simpler, faster and fairer to find and apply for government grants.  "
        },
        {
            "text": "If you haven’t joined the Government Grants Community as yet - you can sign up here. Come and co-create with us. "
        },
        {
            "text": "I also want to thank colleagues in the team and also the Government Grants Community."
        },
        {
            "text": "Getting to today is a real and significant achievement. My sincere thanks are due to you for your support, time and creative input for getting us here.  But we are not done yet. I know we can co-create a first-rate Find a Grant and Apply for a Grant service. We have under 12 months left. Are you with me? "
        },
        {
            "text": "Lucia Webster"
        },
        {
            "text": "Delivery Director, Grants Applicant Programme"
        }
    ]
}