{
    "url": "https://socialcare.blog.gov.uk/2022/04/12/wres-stories-the-race-for-equality-is-on/",
    "title": "WRES stories: the race for equality is on",
    "authors": [
        "Shola Sonola",
        "Nasay Franklin",
        "Jackie Wu",
        "Liz Fergus"
    ],
    "categories": [
        "Leadership",
        "Workforce",
        "WRES"
    ],
    "pub_date": "2022-04-12T16:07:03+00:00",
    "content": [
        {
            "heading": 2,
            "text": "Liz Fergus, Diversity and Inclusion Project Manager"
        },
        {
            "text": "I started my role as Adult Care Services (ACS) Project Manager for Diversity and Inclusion as we were applying to be one of the first SCWRES sites. Choosing to be one of the first local authorities to be part of the SCWRES represented a huge commitment by senior leaders in adult social care, children’s services and Hertfordshire County Council (HCC) to create meaningful change."
        },
        {
            "text": "Starting the work was daunting, being part of the SCWRES challenges and encourages all involved to question what is normal and taken for granted. It requires us to be disruptors. I was hopeful the SCWRES would bring change, aware it would not be straightforward and that it would take too long for change to be experienced."
        },
        {
            "text": "The SCWRES seeks to bring systemic and structural change. Some are sceptical about whether this will happen, following previous false dawns, others are concerned about what change will mean for them, some are hopeful and expectant."
        },
        {
            "text": "Having worked in social care for many years, I have seen the demographic make-up of our local workforce change, experienced personal challenges and seen other people face them too. Being part of the SCWRES is already having a positive impact and contributing to the work we’re doing in HCC to celebrate our diversity and become an organisation where all feel included and that they belong. I will continue to do all I can to create sustainable, lasting change as a member of our SCWRES project team."
        },
        {
            "heading": 2,
            "text": "Jackie Wu, Diversity and Inclusion Project Manager"
        },
        {
            "text": "I am inspired and impressed with how far the project team has come with all the hard work and commitment it has taken to bring SCWRES to life at HCC. It has been really challenging to hear from so many colleagues sharing personal experiences related to their race. For me, I’m excited to be a part of this and to be one of 18 councils to trailblaze SCWRES in England. It’s a step in the right direction, and hopefully will bring better awareness and support to race equality in social care for staff and service users."
        },
        {
            "heading": 2,
            "text": "Nasay Franklin, Performance & Development Manager – Diversity & Inclusion"
        },
        {
            "text": "For me, being part of the social care WRES is a great opportunity to make the change we want and need to see, as it is a commitment which also holds us accountable, both internally and externally. We have recently held forums with colleagues across both children's services and adult social care, where we shared the draft action plan and gave colleagues an opportunity for them to share their reflections and experiences."
        },
        {
            "text": "It was truly eye opening and inspiring to hear from my colleagues within these sessions, however it is clear more work needs to be done. I will continue to listen and work with colleagues from the SCWRES project team, as well as wider services, and continue to raise awareness. It is everyone’s responsibility to take ownership of this project to create long lasting change."
        },
        {
            "heading": 2,
            "text": "Shola Sonola, Senior HR Manager and Business Partner"
        },
        {
            "text": "I have thoroughly enjoyed attending and participating in the SCWRES forums. I came into this experience, not as the HR Manager for Adult Care Services, but as a member of the workforce ready and willing to learn and grow – as any other attendee. The forums had been attended by colleagues of all ethnic backgrounds and I felt that this gave the discussions a vibrant, enriched atmosphere. They showcased an interesting mix of experiences, thoughts and reflections which were refreshingly, sometimes brutally, honest."
        },
        {
            "text": "It is this level of honesty which is needed to propel change in adult social care. We must continue to have these conversations, no matter how uncomfortable they get. Forums discussing the cultural and recruitment experience of staff from different ethnic backgrounds was particularly of interest as they promote active discussions in HR on how to improve our processes for staff."
        }
    ]
}