{
    "url": "https://deframedia.blog.gov.uk/2023/03/13/coverage-following-wild-isles-documentary/",
    "title": "Coverage following Wild Isles documentary",
    "authors": [
        "Defra Press Office"
    ],
    "categories": [
        "Nature",
        "Weekly stories"
    ],
    "pub_date": "2023-03-13T16:12:35+00:00",
    "content": [
        {
            "text": "There is coverage in the Sunday Times, The Guardian and The Sun (p.48) following the airing of the first episode of the BBC documentary series ‘Wild Isles’ last night (12 March 2023), presented by Sir David Attenborough. The series looks at the natural history of the British Isles and the pressures facing wildlife."
        },
        {
            "text": "The Secretary of State Therese Coffey wrote about her enthusiasm for the new series and the wonderful showcase it is for UK nature in the Daily Express. The programme features a number of Natural England’s reserves, including Shapwick Heath on the Somerset Levels. One of Natural England’s reserve managers spoke to the Guardian about our work to restore nature in Somerset."
        },
        {
            "text": "In addition to the five-part documentary series, the National Trust, RSPB and WWF have today (13 March 2023) launched their Save Our Wild Isles campaign, which urges people to create space for nature and call for further action on nature recovery."
        },
        {
            "text": "Nature has been in long-term decline and we have laid foundations to turn this around: In 2021, the government passed the Environment Act which sets legally-binding targets to improve the environment and created a legally binding target for species abundance for 2030. The Act also supported the creation of a Nature Recovery Network, a legal duty for new developments to deliver a Biodiversity Net Gain and created Local Nature Recovery Strategies which will increase investment for nature. We also recognise that farming and the environment must go hand-in-hand, which is why we have designed a new system to reward farmers for their stewardship of our countryside and nature-friendly farming."
        },
        {
            "text": "We are building on these achievements with our new Environmental Improvement Plan published earlier this year, which includes creating and restoring at least 500,000 hectares of new wildlife habitats; transforming the management of 70% of our countryside by incentivising farmers to adopt nature-friendly practices; a new multi-million pound Species Survival Fund targeted at protecting our rarest species; and introducing the first set of Highly Protected Marine Areas (HPMAs)."
        },
        {
            "text": "On reviewing our retained EU law, we want to ensure that environmental law is fit for purpose and able to drive positive environmental outcomes. This will not come at the expense of the UK’s already high standards - we can keep protections in place and make reforms tailored to our needs."
        },
        {
            "text": "Environment Secretary Thérèse Coffey said:"
        },
        {
            "text": "Follow Defra on Twitter, and sign up for email alerts here."
        }
    ]
}