{
    "url": "https://ukhsa.blog.gov.uk/2023/03/13/empowering-young-people-with-science-information-that-can-protect-the-nations-health/",
    "title": "Empowering young people with science information that can protect the nation’s health",
    "authors": [
        "Blog Editor"
    ],
    "categories": [
        "UKHSA science"
    ],
    "pub_date": "2023-03-13T10:25:17+01:00",
    "content": [
        {
            "text": "This year’s British Science Week theme is “connections” and throughout the week we’re looking at how UKHSA science is carried out in partnership with a wide range of organisations. In this blog UKHSA’s Donna Lecky and Brieze Read discuss partnering with schools through our e-Bug programme which educates young people on infection prevention and control and how to prevent antimicrobial resistance."
        },
        {
            "text": "Antimicrobial resistance occurs when bacteria, viruses, fungi and parasites change over time and no longer respond to medicines, making infections harder to treat. It is one of the biggest health threats facing the world."
        },
        {
            "text": "But the good news is that we can take action. By preventing infections and using antimicrobials appropriately, we can contain and control antimicrobial resistance."
        },
        {
            "text": "And this action can be taken at every level of society, from decision makers in health and government, to front line clinicians, through to families and individuals."
        },
        {
            "text": "The e-Bug programme was set up to support the critical role children and young people play in preventing infections and responding to the threat of antimicrobial resistance."
        },
        {
            "text": "This includes following good hygiene at school and in the home, recognising the signs and symptoms of infections and understanding when to self-care or seek professional advice."
        },
        {
            "text": "Education about the risks and benefits of antimicrobials is also vital, for instance only taking antibiotics when directed by a healthcare professional."
        },
        {
            "text": "These are messages that young people can take on board immediately but also provide lessons for life."
        },
        {
            "text": "UKHSA’s e-Bug team have worked closely with schools, young people, and education authorities to develop a wide range of learning resources created for different stages of school life (from Early Years to Key Stage 4), all mapped against the curriculum and all providing this crucial public health information."
        },
        {
            "heading": 3,
            "text": "Making connections to tackle AMR"
        },
        {
            "text": "Since e-Bug’s establishment, partnerships as well as co-creation of messages and resources has been vital."
        },
        {
            "text": "We’re very proud that e-Bug is a truly international project, initially set up with a number of European partners. Our international collaborations have gone from strength to strength and we now work with countries all over Europe and further afield to share best-practice on tackling AMR and create resources in multiple languages so they can benefit children all over the world."
        },
        {
            "text": "In recent years we’ve made formal links with 27 countries who share our goal to ensure that every child and young person is empowered to prevent infection and respond to antimicrobial resistance."
        },
        {
            "text": "Closer to home, local authorities are also key partners, and a recent example of collaboration involved a train the trainer pilot in the North West working alongside local government colleagues in Cheshire and Merseyside, Lancashire and Cumbria and Greater Manchester."
        },
        {
            "text": "This was set up to ensure that local authorities can maximise their strong relationships with schools in their area, sharing vital messages about how positive behaviour change among children and young people can prevent infections and protect antibiotics."
        },
        {
            "text": "And of course, collaboration with teachers and young people is vital. Our resources are co-created with a steering group of public health experts and teachers who ensure they are usable and effective within schools. This includes alignment with the school curriculum and the way teachers like to teach, including setting learning objectives and outcomes and using techniques like quizzes, games and debate kits."
        },
        {
            "heading": 3,
            "text": "Getting involved"
        },
        {
            "text": "Please do take a look at e-Bug. If you are a teacher, we have a huge resource library on our website for children in Early Years settings and Key Stage 1,2,3 & 4."
        },
        {
            "text": "For community educators and leaders we also offer a ‘Beat the Bugs’ community course. This is a six-week community hygiene programme that aims to equip people who take part with information on how to keep themselves and others healthy by preventing the spread of infection and learning about treating infections."
        },
        {
            "text": "Training is also available for educators and for those who would like to train others online and in person."
        }
    ]
}