{
    "url": "https://cddo.blog.gov.uk/2023/03/13/how-were-working-to-transform-government-services/",
    "title": "How we're working to transform government services",
    "authors": [
        "Ben Tate, Head of Strategy and Standards, CDDO"
    ],
    "categories": [
        "CDDO",
        "Cross-government strategy",
        "Digital strategy",
        "Digital transformation"
    ],
    "pub_date": "2023-03-13T17:00:59+00:00",
    "content": [
        {
            "text": "The Central Digital and Data Office (CDDO) works with central government organisations to achieve digital, data and technology transformation at scale."
        },
        {
            "text": "In June 2022 a new cross government digital strategy, Transforming for a digital future, was published. Mission one of that strategy is ‘Transformed Public Services that Achieve the Right Outcomes’. As part of this mission, government has committed to moving at least 50 of its top 75 identified services to a ‘great’ standard, against a consistent measure of service performance, by 2025."
        },
        {
            "heading": 3,
            "text": "What we mean and why it’s important"
        },
        {
            "text": "Depending on who you ask in government, transforming services can mean:\n"
        },
        {
            "text": "For us at CDDO, transforming services ultimately means making them more useful and usable for users, which in turn leads to more efficient and effective services for government as a whole. We believe this means improving the whole system so everything works as well as possible. It is, then, a big thing."
        },
        {
            "heading": 3,
            "text": "Why there’s a goal to move 50 of the top 75 services to ‘Great’"
        },
        {
            "text": "Government provides thousands of services. We know we can’t transform them all at once, so we need to start with a smaller selection, based on key criteria. Transforming 50 services is ambitious but realistic. Having a target gives us focus and allows us to see how much progress we are making."
        },
        {
            "text": "We’ve collaborated with government departments to identify the top 75 services, starting with the following criteria:"
        },
        {
            "text": "We will continue to work with departments to review and update the list, as the methodology is refined and more data becomes available"
        },
        {
            "heading": 3,
            "text": "Why are we doing this now?"
        },
        {
            "text": "This is a priority for government for three reasons. The first is that users’ expectations of digital services are the highest they’ve ever been as the private sector redesigns, simplifies and increases its offer. The world is now digitally run and to ensure we meet those expectations, digital is the way forward. "
        },
        {
            "text": "The second is that the COVID-19 pandemic has led to extra investment in digital services and progress in all sectors. We’ve seen brilliant pockets of practice during this time in government, and we need to use this to springboard us into the digital age and beyond. "
        },
        {
            "text": "The third is that government has a priority and a duty to ensure that it’s spending money as efficiently as it can. This often means transforming slow, manual processes into fast end-to-end digital transactions."
        },
        {
            "text": "Now more than ever, government must provide value for money to the taxpayer. By transforming our ways of working, we can enable the Civil Service to work smarter and faster. Through better services we can bolster our economy, bring society closer together and improve services."
        },
        {
            "heading": 3,
            "text": "The approach we’re taking"
        },
        {
            "text": "With the list of 75 services defined and agreed, the next step is to understand how well each of them is working now. To baseline their performance effectively, we need to know what to measure."
        },
        {
            "text": "We began our research with the cross-government performance analysis community, to understand what departments were measuring already. We also took into account common key performance indicators used across other industries."
        },
        {
            "text": "Working alongside services teams, we then completed a series of pilots. These helped us to understand the availability of particular datasets and what they could tell us about a service’s usability and efficiency."
        },
        {
            "text": "Measurements are centred around the services’ primary users (those that need to use the service to achieve a goal). The scope starts with the trigger for the service, all the way through to users getting the right outcome. "
        },
        {
            "text": "With a measurement approach and scope defined, we have begun to baseline the performance of all 75 services listed in the strategy. Our baseline data is providing us with insights into common challenges for service teams across government. "
        },
        {
            "text": "We are also seeing some great examples and approaches to service transformation. We want to scale this best practice, give it visibility across government communities, and build on it by iterating standards and guidance."
        },
        {
            "text": "By working together to tackle these common blockers, we will support government to transform at scale, take us further and faster, and move at least 50 of governments top 75 services to a great standard by 2025. "
        },
        {
            "heading": 3,
            "text": "Coming up "
        },
        {
            "text": "Next week CDDO is leading Services Week, a cross-government, week-long event that focuses on delivering the very best of services to the public."
        }
    ]
}