{
    "url": "https://homeofficemedia.blog.gov.uk/2023/03/13/national-protective-security-authority/",
    "title": "National Protective Security Authority begins work",
    "authors": [
        "Home Office news team"
    ],
    "categories": [
        "Press release"
    ],
    "pub_date": "2023-03-13T10:24:00+00:00",
    "content": [
        {
            "text": "A new body has been created to help the UK combat national security threats."
        },
        {
            "text": "State-sponsored attempts at stealing sensitive research and information can undermine UK businesses and harm our country’s competitiveness on the world stage."
        },
        {
            "text": "As part of the Integrated Review Refresh, the government has today (13 March 2023) announced the creation of the National Protective Security Authority (NPSA) to help businesses and organisations defend themselves against national security threats."
        },
        {
            "text": "This new body, which is part of MI5, will increase the UK’s resilience to state threats as well as terrorism, and will play an important part in strengthening our country’s economic security."
        },
        {
            "text": "NPSA has absorbed the responsibilities of the Centre for the Protection of National Infrastructure but with a broader remit, reflecting the fact that the threats the UK faces today extend far beyond critical national infrastructure."
        },
        {
            "text": "Advice will be provided in an accessible and informative way so that it can be understood and used by a broad range of private and public sector organisations, including tech start-ups, businesses, events venues and universities."
        },
        {
            "text": "Security Minister Tom Tugendhat said:"
        },
        {
            "text": "NPSA will work closely with key partners such as the National Cyber Security Centre and the National Counter Terrorism Security Office to provide joined-up, holistic protective security advice."
        },
        {
            "text": "Working with these and other partners, it will provide training and advice on the protective security measures that businesses and organisations can put in place to help stop a terrorist attack while also increasing the focus on the growing state threats the UK faces."
        },
        {
            "text": "Last year MI5 explained the emerging threat to businesses posed by espionage activity by the Chinese state. This included examples of the theft of intellectual property, exploiting academic research and the deceptive use of professional networking sites to acquire sensitive information."
        },
        {
            "text": "Among other areas of work, NPSA will offer advice to businesses on how to harden their defences against this type of threat. The Think Before You Link app is already available to help avoid the deceptive exploitation of professional networking platforms."
        },
        {
            "text": "The new body’s training, guidance and advice will be informed by world-class research and the very latest secret intelligence. It will reach many more organisations by:"
        },
        {
            "text": "Visit the new NPSA website for more information."
        }
    ]
}