{
    "url": "https://socialcare.blog.gov.uk/2023/03/13/nursing-associate-stories-a-journey-of-personal-discovery/",
    "title": "Nursing associate stories: a journey of personal discovery",
    "authors": [
        "Mercy Sharp"
    ],
    "categories": [
        "Care and support",
        "Workforce"
    ],
    "pub_date": "2023-03-13T11:43:01+00:00",
    "content": [
        {
            "heading": 2,
            "text": "A rewarding role"
        },
        {
            "text": "In the Philippines, I worked as a public servant. When I came to this country, the only work I was able to do was in the care sector. I found a job close to me, which was ideal."
        },
        {
            "text": "What I wasn’t expecting was how much I’d enjoy caring for other people. It was completely different to my work in the Philippines and I loved it."
        },
        {
            "text": "I joined Royal Star & Garter as Lead HCA (healthcare assistant). It’s a very rewarding role. I get to know the residents and support their day-to-day needs, which they’re very grateful for and that makes my day. At the end of each day, I’m very satisfied I’ve been able to help them."
        },
        {
            "text": "When I joined the charity, I asked the home manager if they would support me getting an NVQ 4 and 5. She told me the Nursing Associate programme would be best for me."
        },
        {
            "text": "About a year later, I was given the chance to apply for the programme, but I waited until the last moment to put my name forward. English isn’t my first language and it had been more than 20 years since I was in education, so I doubted whether I could go back to university. I wondered if I still had the knowledge and the capacity to cope with the schedule, especially as I was combining it with my job and family life."
        },
        {
            "heading": 2,
            "text": "Positive decision"
        },
        {
            "text": "I decided to go for it. I wanted to progress my career and learn new skills, and I also wanted to make a difference. It was as much about being able to help other people as it was career progression."
        },
        {
            "text": "My course started in March 2020 but was almost immediately stopped by the COVID-19 pandemic, before beginning again in October that year. I’m nearly qualified now and just waiting to sit my functional skills exams. It’s been exciting and challenging but I’m enjoying it. At the start it was a struggle, because of the doubts I had in myself, but it’s gone very well and been an exciting journey."
        },
        {
            "text": "The placements have been enjoyable too. My first was in a surgical ward, which was totally different to what I’m used to, because the patients’ needs and our interactions with them are much shorter. Most of them were in for a day and then they’d go home. It’s not like Royal Star & Garter, where you get to know residents over months and years."
        },
        {
            "heading": 2,
            "text": "Personal development"
        },
        {
            "text": "I learnt new skills, including how to communicate with residents and colleagues. I also experienced new ways of working and learned a lot about myself as I moved through my placements. I now realise I’m able to push myself to do things I didn’t think I could before. I’ve conquered my fears and it’s boosted my confidence."
        },
        {
            "text": "I’ve had a lot of help from Royal Star & Garter. My colleagues, especially the nurses, have been really supportive. Every time I’ve asked a question, they’ve been amazing. I’m also grateful for the charity putting me forward and supporting me over the whole programme."
        },
        {
            "text": "I have been thinking of topping up and becoming a registered nurse. But right now, I’m focussed on being an NA, rather than looking too far into the future. But whatever I do going forward, whether it’s as a NA or registered nurse, I hope it will be with Royal Star & Garter."
        }
    ]
}