{
    "url": "https://insidehmcts.blog.gov.uk/2024/05/10/behind-the-scenes-of-justice-my-experience-as-a-juror/",
    "title": "Behind the scenes of justice – my experience as a juror",
    "authors": [
        "Jemima Adcock"
    ],
    "categories": [
        "Court and tribunal reform",
        "General",
        "User experience and research"
    ],
    "pub_date": "2024-05-10T11:30:33+01:00",
    "content": [
        {
            "text": "[English] - [Cymraeg]"
        },
        {
            "text": "When I received the jury summons in the post, I had mixed feelings. As someone who works in the Ministry of Justice, I was intrigued to see justice in action, but I was also worried about how it might disrupt work and my personal life – especially as I did my jury service the week before Christmas."
        },
        {
            "text": "I was apprehensive on the first morning waiting to see if I would be selected. I wasn’t sure what to expect but the HMCTS court staff were friendly and reassuring and kept us all up to date as best they could. As soon as I walked into the juror’s waiting room, I was greeted by a jury officer who signed me in. All the new jurors had a briefing from the head of the jury team, who gave us details of what would happen over the next few days. She acknowledged that it was the week before Christmas and that we all probably had plans, but reassured us that our jury service wasn’t going to interfere."
        },
        {
            "text": "I was surprisingly nervous walking into the courtroom for the first time. I’d been in courtrooms before but walking in as a juror was very different. Everyone was looking at us, the whole experience felt very formal and solemn. The judge did an excellent job of talking us through the process and explaining what was asked of us in a very clear way."
        },
        {
            "text": "The main challenge was when it became clear we couldn’t agree on a verdict and the case ended in a hung jury. There was a lot of debate, I had to consider my position and then communicate my points thoughtfully. Everyone around the table in the deliberation room brought a different perspective based on their background and experiences – and all were equally valid."
        },
        {
            "text": "Jury service is very serious, which I think makes you look for humour and enjoy the more light-hearted moments. A funny moment during my service was when we were waiting for about 20 minutes for one of the jurors to come back from lunch but it turned out he’d got lost in the building looking for the courtroom!"
        },
        {
            "text": "I was surprised by the scale of the operation, how many jurors there were and how many different cases the jury team needed to coordinate all at once. Some courts deal with hundreds of jurors each week, they have to ensure everyone is in the right place at the right time – it’s no mean feat! That process relies so much on the individual court staff to make sure jurors have a positive experience; they do an incredible job with a smile on their faces."
        },
        {
            "text": "Serving on a jury gave me an insight into a process that you don’t normally see, it felt like I was going behind the scenes of the justice system. It really is democracy in action – people of all backgrounds and perspectives are represented and are making decisions that impact our society. My biggest learning was just how different people’s perspectives can be. That’s something that has stuck with me, and that I hope will inform my future work at MoJ. I found the process absolutely fascinating, it’s sparked a new interest in frontline justice and made me think about becoming a magistrate in the future."
        },
        {
            "text": "My time as a juror has left me with a newfound appreciation for the complexities of the justice system and the dedication of those who work within it. It’s an experience I won’t soon forget."
        },
        {
            "text": "[English] - [Cymraeg]"
        },
        {
            "heading": 1,
            "text": "Y tu ôl i lenni cyfiawnder – fy mhrofiad fel rheithiwr"
        },
        {
            "text": "Pan gefais y wŷs rheithgor yn y post, roedd gen i deimladau cymysg. Fel rhywun sy’n gweithio i’r Weinyddiaeth Gyfiawnder, roeddwn yn chwilfrydig i weld cyfiawnder ar waith, ond roeddwn hefyd yn poeni am sut y gallai amharu ar fy ngwaith a fy mywyd personol – yn enwedig gan imi wneud fy ngwasanaeth rheithgor yr wythnos cyn y Nadolig."
        },
        {
            "text": "Roeddwn yn bryderus ar y bore cyntaf yn aros i weld a fyddwn yn cael fy newis. Nid oeddwn yn siŵr beth i’w ddisgwyl ond roedd staff llys GLlTEF yn gyfeillgar ac yn galonogol ac yn rhoi’r wybodaeth ddiweddaraf i ni i gyd hyd y gorau y gallent. Cyn gynted ag y cerddais i mewn i ystafell aros y rheithwyr, cefais fy nghyfarch gan swyddog rheithgor a wnaeth fy llofnodi i mewn. Cafodd yr holl reithwyr newydd sesiwn friffio gan bennaeth tîm y rheithgor, a roddodd fanylion i ni o’r hyn a fyddai’n digwydd dros y dyddiau nesaf. Mi wnaeth gydnabod ei bod hi’r wythnos cyn y Nadolig a bod gennym ni i gyd fwy na thebyg gynlluniau, ond rhoddodd sicrwydd i ni nad oedd ein gwasanaeth rheithgor yn mynd i ymyrryd â hynny."
        },
        {
            "text": "Roeddwn i’n rhyfeddol o nerfus yn cerdded i mewn i’r llys am y tro cyntaf. Roeddwn i wedi bod yn y llysoedd o’r blaen ond roedd cerdded i mewn fel rheithiwr yn wahanol iawn. Roedd pawb yn edrych arnom ni, roedd yr holl brofiad yn teimlo’n ffurfiol ac yn ddifrifol iawn. Roedd y barnwr yn ardderchog wrth siarad â ni drwy’r broses ac egluro’r hyn a ofynnwyd gennym mewn ffordd glir iawn."
        },
        {
            "text": "Y brif her oedd pan ddaeth yn amlwg na allem gytuno ar reithfarn a daeth yr achos i ben mewn rheithgor crog. Bu llawer o ddadlau, bu’n rhaid imi ystyried fy safbwynt ac yna cyfleu fy mhwyntiau’n feddylgar. Daeth pawb o amgylch y bwrdd yn yr ystafell drafod â safbwynt gwahanol yn seiliedig ar eu cefndir a’u profiadau - ac roedd pob un yr un mor ddilys. Roedd Beili’r Rheithgor wrth law y tu allan i’r ystafell drafod i gael cymorth a chyngor, gan gynnwys pryd i ofyn am gyfarwyddyd gan y barnwr."
        },
        {
            "text": "Roedd yr wybodaeth a ddarparwyd cyn y treial yn ddefnyddiol iawn, yn enwedig y fideo briffio. Cyn cael fy newis ar gyfer gwasanaeth rheithgor doedd gen i ddim syniad y gallem ni ysgrifennu nodiadau at y barnwr yn ystod y treial, neu y byddai angen i ni ddod â phecyn bwyd gyda ni ar gyfer y cyfnod trafod. Dyma’r manylion nad ydych chi’n eu gweld ar y teledu! Ar ôl y treial, roedd y staff gweinyddol yn wych wrth egluro sut i hawlio treuliau ac roedd e-bost dilynol yn ymdrin â phethau eraill fel cyrchu unrhyw gymorth iechyd meddwl."
        },
        {
            "text": "Mae gwasanaeth rheithgor yn ddifrifol iawn, sydd yn fy marn i yn gwneud ichi chwilio am hiwmor a mwynhau’r adegau mwy ysgafn. Rhywbeth doniol yn ystod fy ngwasanaeth oedd pan oeddem yn aros am tua 20 munud i un o’r rheithwyr ddod yn ôl o gael cinio ond daeth yn amlwg ei fod wedi mynd ar goll yn yr adeilad yn chwilio am y llys!"
        },
        {
            "text": "Cefais fy synnu gan faint yr holl beth, faint o reithwyr oedd yno a faint o achosion gwahanol yr oedd angen i dîm y rheithgor eu cydlynu i gyd ar unwaith. Mae rhai llysoedd yn delio â channoedd o reithwyr bob wythnos, mae’n rhaid iddyn nhw sicrhau bod pawb yn y lle iawn ar yr amser iawn – sy’n dipyn o gamp! Mae’r broses honno’n dibynnu cymaint ar staff unigol y llys i wneud yn siŵr bod rheithwyr yn cael profiad cadarnhaol; maen nhw’n gwneud gwaith anhygoel gyda gwên ar eu hwynebau."
        },
        {
            "text": "Roedd gwasanaethu ar reithgor wedi rhoi cipolwg i mi ar broses nad ydych chi’n ei gweld fel arfer, roedd yn teimlo fel fy mod yn mynd y tu ôl i lenni’r system gyfiawnder. Democratiaeth ar waith yw hi mewn gwirionedd - mae pobl o bob cefndir a safbwynt yn cael eu cynrychioli ac yn gwneud penderfyniadau sy’n effeithio ar ein cymdeithas. Y peth mwyaf a ddysgais oedd pa mor wahanol y gall safbwyntiau pobl fod. Mae hynny’n rhywbeth sydd wedi aros gyda mi, ac rwy’n gobeithio y bydd yn llywio fy ngwaith yn y Weinyddiaeth Gyfiawnder yn y dyfodol. Roedd y broses yn hynod ddiddorol i mi, mae wedi ennyn diddordeb newydd mewn cyfiawnder rheng flaen ac wedi gwneud i mi feddwl am ddod yn ynad yn y dyfodol."
        },
        {
            "text": "Mae fy nghyfnod fel rheithiwr wedi fy ngadael â gwerthfawrogiad newydd o gymhlethdodau’r system gyfiawnder ac ymroddiad y rhai sy’n gweithio ynddi. Mae’n brofiad na fyddaf yn ei anghofio’n fuan."
        }
    ]
}