{
    "url": "https://vets.blog.gov.uk/2024/05/10/bluetongue-virus-risk-set-out-for-the-year-ahead/",
    "title": "Bluetongue virus risk set out for the year ahead",
    "authors": [
        "Dr Christine Middlemiss BVMS MRCVS"
    ],
    "categories": [
        "Disease outbreak"
    ],
    "pub_date": "2024-05-10T11:06:28+01:00",
    "content": [
        {
            "text": "This week, the Animal and Plant Health Agency published its latest risk assessment of bluetongue virus entering Great Britain during 2024. It confirmed a very high probability of a new introduction of bluetongue virus serotype 3 (BTV-3) into GB livestock through infected biting midges being blown over from northern Europe. Biting midges are most active between April and November and the timing of a potential incursion will depend on the temperature and wind patterns."
        },
        {
            "text": "Bluetongue virus is primarily transmitted by biting midges (Culicoides species) and affects cattle, sheep, and other ruminants such as goats and deer, and camelids such as llamas. The virus does not affect people or food safety."
        },
        {
            "text": "BTV-3 was first reported in the Netherlands in September last year and rapidly spread to Belgium and Germany before being detected in South East England in November. Since then, there have been 126 bluetongue cases confirmed in England across 73 premises in 4 counties, with the last case confirmed on 8 March. All cases confirmed to date have been detected through active surveillance, with the animals likely infected in late autumn."
        },
        {
            "text": "As temperatures rise after winter, we have now entered the period where biting midges are more active. The current risk of transmission has not changed but we know the likelihood of bluetongue virus entering GB is increasing, and APHA’s latest assessment underlines how important it is to proactively plan and prepare for any potential incursion and outbreak."
        },
        {
            "text": "This new season will be monitored closely. Surveillance of midges continues through the use of traps across the country and we have been working closely with a wide range of stakeholders to review the government’s bluetongue virus control strategy."
        },
        {
            "text": "This is likely to include the use of disease Control Zones surrounding premises where infection is confirmed to restrict the long-distance movement of susceptible animals and germinal products potentially spreading disease. Moves to slaughter will be allowed. Once bluetongue is known to be circulating in the domestic midge population, culling of livestock is not an effective control measure to deal with disease."
        },
        {
            "text": "The APHA risk assessment explains that the risk of importing infected livestock is very low. All imports of susceptible livestock from BTV affected counties are required to comply with the health certificate requirements including the appropriate vaccination."
        },
        {
            "text": "We are actively engaging with vaccine manufacturers on the development of a BTV-3 vaccine for use in the UK but there are currently no authorised vaccines available for BTV-3 in the UK or Europe."
        },
        {
            "text": "The vaccine approved by the Dutch authorities has emergency use approval but not market authorisation. We are working hard to facilitate safe access to a vaccine as soon as possible, but it is vital that any vaccine has the confidence of industry, consumers and our trading partners. This means that we need to understand the efficacy of any vaccine we choose to deploy across all species, together with potential impacts on trade - a view shared by industry. We are actively monitoring vaccine data from EU countries and will continue to work with industry on any decisions on use of a deployable vaccine."
        },
        {
            "text": "The timing of any potential incursion of infected midges this year will depend on the extent of bluetongue reemerging in Europe, temperature and wind patterns. In the meantime, I am urging farmers to remain vigilant and monitor their animals frequently. Any suspicion of disease in GB must be reported to APHA promptly, and any changes will be carefully considered with regards to risk management."
        }
    ]
}