{
    "url": "https://defrafarming.blog.gov.uk/2024/05/10/changes-to-permitted-development-rights/",
    "title": "Changes to permitted development rights",
    "authors": [
        "The Team"
    ],
    "categories": [
        "Farming and Countryside Programme"
    ],
    "pub_date": "2024-05-10T10:02:53+01:00",
    "content": [
        {
            "text": "We want to make it easier for farmers to strengthen their businesses. To that end, several changes to permitted development rights are coming into effect from 21 May.  "
        },
        {
            "text": "The changes are the result of a consultation undertaken by the Department for Levelling Up, Housing and Communities (DLUHC) between July and September last year.  "
        },
        {
            "text": "The consultation sought to understand where additional flexibility could support the agricultural sector. The views of all 977 respondents were considered. "
        },
        {
            "text": "The order that followed, The Town and Country Planning Amendment Order (General Permitted Development, etc) 2024, makes changes to 4 existing permitted development rights that allow for agricultural development and the use change of agricultural buildings.  "
        },
        {
            "text": "Permitted development rights are a national grant of planning permission. They provide flexibility and planning freedoms to businesses, local authorities, communities among others."
        },
        {
            "text": "They support growth and incentivise different types of development by providing certainty and removing the need to spend time and money submitting a planning application. "
        },
        {
            "text": "From 21 May, farmers will no longer be required to submit a planning application for specific types of development. "
        },
        {
            "text": "This includes converting agricultural buildings to a wider range of commercial uses, such as larger farm shops, buildings for agricultural training and sporting facilities. "
        },
        {
            "text": "Use of these permitted development rights remain subject to their existing approvals by the local planning authority. This allows planning matters to be considered in consultation with the local community. "
        },
        {
            "text": "For example, to change agricultural buildings to homes and flexible commercial use, individuals must seek prior approval from the local planning authority for specific issues and risks including transport and flooding."
        },
        {
            "text": "These prior approvals vary across permitted development rights. For example, to extend or erect agricultural buildings, individuals must seek approval for the building's design and external appearance instead. "
        },
        {
            "text": "A third of all farmland is managed by tenant farmers and we recognise the importance of tenanted holdings being able to access the opportunities that these planning changes provide. Tenant Farmers should check the terms of their tenancy agreement and consult with their landlord on any proposals they may have to use these changes to permitted development rights. "
        },
        {
            "text": "We encourage all tenants and landlords to follow the recently launched Agricultural Landlord and Tenant Code of Practice which promotes clarity, communication and collaboration in the tenanted sector. "
        },
        {
            "text": "The code sets out guidance for tenants and landlords to discuss new schemes and diversification opportunities openly and constructively.  "
        },
        {
            "heading": 2,
            "text": "Further detail on the changes "
        },
        {
            "text": "We are extending existing permitted development rights to give farmers greater flexibility to convert agricultural buildings to commercial uses.  "
        },
        {
            "text": "The changes will allow farmers to convert larger buildings to a wider range of uses.  "
        },
        {
            "text": "We are also allowing for larger agricultural buildings and extensions to be erected, allowing farmers to respond to changing agricultural practices. "
        },
        {
            "text": "In addition to this, we are extending permitted development rights so farmers can use agricultural buildings to process raw goods produced on site and which are to be sold on site (excluding livestock) and we are allowing them to develop and extend larger buildings for agricultural purposes. "
        },
        {
            "text": "Finally, we are allowing farmers to convert buildings on agricultural units and former agricultural buildings to a larger number of homes, more suited to rural needs. "
        },
        {
            "heading": 3,
            "text": "Increased floorspace "
        },
        {
            "text": "The amount of floorspace that can change from agricultural use to ‘flexible commercial use’ will increase from 500 square metres to 1,000 square metres. "
        },
        {
            "text": "The amount of floorspace that can change from a building on an agricultural unit and a former agricultural building to a home will increase from 865 square metres to 1,000 square metres. "
        },
        {
            "heading": 3,
            "text": "Wider range of commercial building uses "
        },
        {
            "text": "The range of uses agricultural buildings and land within their curtilage can be used for will widen. This will fall under ‘flexible commercial use’ to include: "
        },
        {
            "heading": 3,
            "text": "Changes to agricultural buildings "
        },
        {
            "text": "We are also increasing the ground area limit of new buildings or extensions erected on farms over 5 hectares in size from 1,000 square metres to 1,500 square metres. "
        },
        {
            "text": "For farms under 5 hectares in size we are increasing the ground area limit for extensions to existing agricultural buildings from 1,000 square metres to 1,250 square metres. "
        },
        {
            "text": "We are also increasing the cubic content limit of an agricultural building. This will extend from 20% to 25% above the original building cubic content. "
        },
        {
            "heading": 3,
            "text": "Supporting rural housing "
        },
        {
            "text": "To encourage conversion of agricultural buildings to more homes suited to rural needs, we are introducing a single maximum floorspace per house limit of 150 square metres. "
        },
        {
            "text": "We are also allowing up to 10 homes (increased from 5) to be delivered and allowing up to 1,000 square metres of floorspace to change use overall. "
        },
        {
            "text": "Housing delivered through this right must meet the national space standard and receive prior approval from the local planning authority that they have adequate natural light. "
        },
        {
            "text": "Individuals cannot use this permitted development right in protected landscapes (this includes National Parks and National Landscapes). However the other rights can be used in protected landscapes. "
        },
        {
            "heading": 3,
            "text": "Scheduled monuments "
        },
        {
            "text": "We are removing the ability for extensions and the erection of new buildings where there is a designated scheduled monument, to ensure that these nationally important monuments are preserved for the benefit of current and future generations. "
        },
        {
            "heading": 2,
            "text": "Next steps "
        },
        {
            "text": "Subject to the agreement of Parliament, these permitted development rights will be available after secondary legislation (law created by ministers or other bodies under powers given to them by an Act of Parliament) comes into force on 21 May 2024.   "
        },
        {
            "text": "Colleagues at DLUHC will continue to monitor permitted development rights. They will make changes in order to ensure that the intended outcomes are achieved.  "
        },
        {
            "text": "Recognising the importance of the food and farming sector to our nation, the Prime Minister will host the second UK Farm to Fork Summit at 10 Downing Street on 14 May. This event will bring together industry across the food supply chain to explore further opportunities to support the sector. "
        },
        {
            "heading": 2,
            "text": "Learn more"
        },
        {
            "text": "The amendments deliver on one of the pledges made by the Prime Minister at the Farm to Fork Summit in May last year, to cut red tape and streamline the planning system for farmers. Learn more about the pledges."
        }
    ]
}