{
    "url": "https://nda.blog.gov.uk/how-nws-is-making-sure-the-right-waste-is-in-the-right-place-with-safe-sustainable-and-cost-effective-solutions/",
    "title": "How NWS is making sure the right waste, is in the right place with safe, sustainable and cost effective solutions",
    "authors": [
        "Chris Macey, Waste Services, Nuclear Waste Services"
    ],
    "categories": [
        "Innovation/savings",
        "Mission delivery",
        "Supply Chain",
        "Sustainability",
        "Waste management"
    ],
    "pub_date": "2024-05-10T15:28:41+01:00",
    "content": [
        {
            "text": "Chris Macey, Service Lead for Treatment and Conditioning Services at Nuclear Waste Services (NWS), speaks about how his team is safely diverting huge quantities of nuclear waste away from permanent disposal at the UK’s Low Level Waste (LLW) Repository in Cumbria, saving millions of pounds of taxpayer money and supporting the circular economy by recycling waste. "
        },
        {
            "text": "This has been achieved through a range of characterisation and treatment services, ensuring that only wastes which require the protection of an engineered vault are disposed of at the Repository site. In 2022 to 2023, 1689te of metallic waste was treated, 98% of that waste was released for recycling and diverted from the Repository..."
        },
        {
            "text": "I’ve been working in the waste services team at Nuclear Waste Services for two years now, but we’ve been running our treatment services for about 15 years. When LLW Repository Ltd was set up, part of the mission was to look after the capacity of the engineered vaults where low level radioactive waste is safely, and permanently disposed. We’ve achieved this, and much more."
        },
        {
            "text": "Transformative work undertaken over the last 15 years has enabled monumental cost savings to the taxpayer and provided environmental benefits with huge amounts of nuclear waste being recycled and CO₂ production avoided. In 2008, a suite of waste treatment services and alternative disposal methods, which were more sustainable, environmentally friendly and cost efficient, were introduced. In parallel, the National Waste Programme was launched to coordinate the initiative (now superseded by the Integrated Waste Management Programme)."
        },
        {
            "text": "This work, fuelled by innovation, collaboration across the NDA group and industry, and the use of new technologies, means that the UK’s Low Level Waste Repository (LLWR) in Cumbria won’t reach capacity as quickly, saving nearly £870m of taxpayer money and supporting the circular economy by recycling waste. This is due to waste being diverted away from the Repository and its engineered disposal vaults with the introduction of the treatment services and alternative disposal methods."
        },
        {
            "text": "The UK creates a wide range of hazardous wastes generated by the nuclear industry, ranging from Very Low-Level Waste (VLLW), for example lightly contaminated rubble, all the way up to Higher Activity Waste (HAW), that originates from reprocessing of spent nuclear fuel. All of this hazardous waste needs to be managed safely and securely, both now and for the future. More than 90% of the UK’s radioactive waste is Low Level Waste, so our services to safely manage and dispose of this waste are of vital, national importance, as we work to clean up the UK’s nuclear legacy."
        },
        {
            "text": "The creation of a centralised waste services division to provide and manage a ‘One-stop-shop’ for all UK radioactive waste customers has led the way in developing and offering services to the industry. Services which take advantage of alternative waste management routes demonstrating real application of the waste hierarchy and processing wastes sooner into their final safe state."
        },
        {
            "text": "This work has been a total gamechanger for the Repository.  We’ve totally flipped our stats for how much waste goes into our vaults for final disposal, and how much waste is diverted and recycled. We now only dispose of around 2% of low-level waste into the vaults, which is an excellent step forward. We used to dispose of around 95% of the waste we managed into the vaults, so they would have filled up in a very short space of time."
        },
        {
            "text": "So, how are we doing this? Through incineration, sending lower activity waste to permitted landfill, super-compaction and metal decontamination for recycling.  All of these treatment and disposal methods come at a lower cost than placing the waste in our vaults."
        },
        {
            "text": "Firstly, our route to permitted landfill sites which take the very low activity waste. This waste  doesn’t need the engineered controls we have at the Repository site, and it doesn’t need any treatment. The waste can just go to normal landfill sites that are permitted by the Environment Agency (EA) to accept it. This is the largest amount of waste we generate as a nuclear industry. It’s all waste that can’t be recycled and isn’t combustible."
        },
        {
            "text": "Next, we can burn some of the waste in specialised incinerators. The resulting ashes can go to landfill, equating to 100% diversion from the vault. The incineration not only destroys the hazardous nature of waste but reduces the waste volume.  Materials like rubber, plastic, oils, solvents, chemicals, wood, and contaminated PPE can all go in the incinerator."
        },
        {
            "text": "Another of our treatments is super-compaction, which is a volume reduction technique. This sees drums of waste being literally squashed and compacted into small pucks meaning we can place a lot more waste into a container, a highly effective space-saving treatment method."
        },
        {
            "text": "The final service is the most environmentally friendly and sustainable process - metallic treatment. We are now utilising this method as much as possible.  We work with our suppliers who use a range of special technologies to clear the radioactivity off a range of metals that can be reused and recycled. We separate the radioactivity, and that small amount of contaminated material then goes to landfill or comes back to the vault in a much smaller volume."
        },
        {
            "text": "The waste will only head to the vaults if it can’t follow one of these routes, if the radioactivity levels are too high or it just can’t be treated.  Our services line of business is making a huge difference to decommissioning work. Whilst safety is always our number one priority in everything we do, as we move forward our work is becoming more efficient, more sustainable and is saving money through innovations."
        },
        {
            "text": "Looking forward, we are continuing to lead a number of ‘Safe Sooner’ projects, which are geared towards re-evaluating wastes currently destined for GDF disposal to see if they can be disposed of at the Repository now.  Examples of this include the disposal of Winfrith TRS Drums and Sellafield WAGR Boxes."
        },
        {
            "text": "Through our ambition and action-oriented nature, we collaborate with customers and the supply chain to make nuclear waste permanently safe, sooner. As decommissioning activity increases across the UK nuclear industry this work is more important than ever."
        },
        {
            "text": "With over 15 years’ experience in this specific field of work with waste services, we aim to be first choice for waste solutions, a ‘one stop shop’ providing integrated radioactive waste treatment, logistics and disposal services to support the UK’s radioactive waste programmes. And as technology moves forward and we are becoming more aligned as a sector, we have exciting plans to do much more!"
        }
    ]
}