{
    "url": "https://teaching.blog.gov.uk/2024/05/10/keeping-pupils-active-to-support-their-wellbeing/",
    "title": "Keeping pupils active to support their wellbeing",
    "authors": [
        "Andrew Aalders-Dunthorne"
    ],
    "categories": [
        "Curriculum best practice",
        "Primary schools",
        "Pupil wellbeing and behaviour",
        "Secondary schools"
    ],
    "pub_date": "2024-05-10T09:30:27+01:00",
    "content": [
        {
            "text": "The Consortium Trust is a multi-academy trust based in Suffolk and Norfolk."
        },
        {
            "text": "CEO, Andrew Aalders-Dunthorne shares insight about the Trust’s curriculum, which is based around supporting young people to become well-rounded and active individuals."
        },
        {
            "text": "We know how much physical activity and participation in sports can have a positive impact on children’s mental health, as well as help them develop resilience and build communications skills. Our PE and outdoor learning curriculum plays an integral role in supporting our students to become well-rounded individuals."
        },
        {
            "text": "We encourage friendly competition through competitive sports, but we also aim to make our curriculum inclusive by ensuring a wide range of non-competitive sports and activities are available, so that we meet the needs and interests of every child."
        },
        {
            "text": "We ensure the children have  2 hours of physical education each week. As well as P.E lessons every week, our pupils take part in an active daily mile. We have found this break from the classroom has a positive impact on their performance in other subjects."
        },
        {
            "text": "We also incorporate weekly ‘forest school’ and outdoor learning sessions in many of our settings where the children are getting physically active through nature walks, orienteering, climbing and even archery."
        },
        {
            "text": "Out of the 10 schools in the Trust, several of them are set in rural and remote settings, which presents challenges in accessing external resources such as sporting venues and external competitions. We are working as a trust to continuously create opportunities for schools to collaborate and create events together."
        },
        {
            "text": "For example, we have established trust-wide swimming galas and cross-country sessions, and we hope to expand the trust-wide sporting events over the next few years. Being rural may have disadvantages, but we always try and find the positives. A huge positive is how the open space allows us to get active in nature, which has a huge impact on students’ physical and mental health."
        },
        {
            "text": "The Consortium Trust is an ever-growing, living and breathing community and we take pride in knowing that every decision we make is in the hope that we have a positive influence on the pupils. Developing a broad and engaging sporting and  outdoor curriculum is just part of that commitment."
        },
        {
            "text": "Further reading "
        }
    ]
}