{
    "url": "https://naturalengland.blog.gov.uk/2024/05/10/natural-englands-nutrient-mitigation-scheme-expects-to-enable-around-3700-homes-and-help-nature-recovery-in-dorset/",
    "title": "Natural England’s Nutrient Mitigation Scheme expects to enable around 3,700 homes and help nature recovery in Dorset",
    "authors": [
        "Mike Burke"
    ],
    "categories": [
        "Nature-based solutions",
        "Nutrient Neutrality"
    ],
    "pub_date": "2024-05-10T10:42:34+01:00",
    "content": [
        {
            "text": "In October last year we provided reassurance that Natural England will not only continue to deliver the Nutrient Mitigation Scheme but seek to accelerate and widen it. That hard work has brought us to our next major milestone – launching our Nutrient Mitigation Scheme in Poole Harbour, Dorset."
        },
        {
            "text": "Natural England and Dorset Wildlife Trust have joined together and acquired more than 800 acres of chalk downland and farmland at Lyscombe Farm. The site is expected to enable around 3,700 homes to be built in the Poole Harbour catchment over the next few years. We will publish more details on how and when to apply for nutrient credits in the coming months."
        },
        {
            "text": "This work through our Nutrient Mitigation Scheme will enable new homes to be built in the catchment whilst still protecting the numerous rare bird species that rely on the nationally and internationally protected habitats within Poole Harbour from additional pollution. Poole Harbour itself is one of England’s unique natural wonders, providing recreation, tourism and cultural heritage as well as amazing wading bird sightings. All of which combines to make it a great place to live, work and invest."
        },
        {
            "text": "Sadly, it is also a place where pollution has taken its toll, with nutrient pollution from inland sources flowing through the rivers and feeding into the harbour. Nature recovery for Poole harbour needs concerted action across sectors to safeguard its multiple benefits for people, nature and economy. Today we are announcing an important step towards protecting this fantastic place using our nutrient mitigation scheme."
        },
        {
            "text": "With nature in decline and wildlife under so much pressure, we have had to think big and strategically about how we deliver nutrient solutions. Lyscombe Farm is an example of big picture thinking. The change in land use will provide nutrient credits for homes, improve water quality to protect Poole Harbour, but also create a new wildlife rich, high nature value habitat, and enhance the existing area of SSSI and priority habitats found on the farm."
        },
        {
            "text": "The land will be managed for nature conservation and environmental restoration using natural regeneration and nature restoration techniques such as grazing animals. Our joint ambition is for Lyscombe Farm to become a wildlife rich National Nature Reserve embedded into the rural farmed landscape."
        },
        {
            "text": "Lyscombe Farm will act as a hub, improving the quality of the protected site (Lyscombe and Highdon SSSI) and connecting vital habitats together, which in turn will support wildlife across the wider landscape. Alongside these benefits, it will provide space for people to reconnect with nature and experience the wonders of this stunning landscape."
        },
        {
            "text": "Brian Bleese, chief executive at Dorset Wildlife Trust said:\n“The acquisition of Lyscombe is an excellent example of a blended finance initiative, bringing together statutory, charitable and private funding to deliver benefits for nature, people and sustainable development.  Making space for nature and people is vital in addressing climate change and the ecological crises, projects like Lyscombe ensure that development also contributes to environmental improvements.”"
        },
        {
            "text": "We will achieve so many benefits from just one site by working in partnership and using a combination of tools and funds - no single fund or partner could have delivered this outcome alone. We need to think big and collaboratively, if we are to deliver nature recovery and sustainable development hand in hand, which is what society wants and needs."
        }
    ]
}