{
    "url": "https://socialcare.blog.gov.uk/2024/05/10/social-care-nursing-at-the-heart-of-international-nurses-day-2024/",
    "title": "Social care nursing at the heart of International Nurses Day 2024",
    "authors": [
        "Deborah Sturdy"
    ],
    "categories": [
        "Care and support",
        "Communities",
        "Events",
        "Leadership",
        "Workforce"
    ],
    "pub_date": "2024-05-10T15:48:12+00:00",
    "content": [
        {
            "heading": 2,
            "text": "Pride and recognition"
        },
        {
            "text": "I’ve been in this profession for decades, but only in recent years has the wider world begun to realise the full range, experience and contribution social care nursing colleagues bring to the health and wellbeing of our communities."
        },
        {
            "text": "I understand the tendency to think of nursing purely in the context of hospital wards and clinics, but nursing is so much more than that. We operate across a much wider range of settings and offer a broad yet person-focused skill set, unmatched by other health and care disciplines. Recognition of this important truth is growing."
        },
        {
            "text": "That’s why this year, following International Nurses Day on Sunday 12 May, I am so pleased we will see Emily Pimm, from St Monica’s Care Home in Bristol, be the lamp carrier at the Florence Nightingale Commemoration Service procession at Westminster Abbey on Wednesday 15 May."
        },
        {
            "text": "For the first time in 59 years, social care nursing will be represented at the heart of the service, bringing huge pride to all of us working in this sector."
        },
        {
            "text": "Alongside her will be Royal Star and Garter's Walter Chikanya, who will walk behind the lamp in support. It might have taken 59 years but it demonstrates how our profession is being recognised for the skilled specialism it is and why we can be proud to shine a light on nursing leadership."
        },
        {
            "heading": 2,
            "text": "The true value of our contribution"
        },
        {
            "text": "This year’s theme for International Nurses Day is the ‘economic power of care’. It’s a powerful concept when you consider our role in supporting others to remain physically, mentally and economically active. It also helps prove the lie we only care for older people or those with the most complex needs."
        },
        {
            "text": "Consider the role we play in respite care, helping those with caring responsibilities at home to maintain careers in the workplace, pursue higher education or take a well-earned break to manage their own physical and mental health."
        },
        {
            "text": "A healthy nation is a happier, more productive nation and, in theory, we should all be the beneficiaries of that. Likewise, spare a thought for the role we play in minimising wasted time, manpower and resource, helping to prevent unnecessary hospital admissions and maintaining the independence of those we care for."
        },
        {
            "text": "In keeping with the international scope of this day, we are also a profession proud to celebrate our cultural diversity and the wealth of unique perspectives, experiences and innovations our global majority nurses bring to our practice."
        },
        {
            "heading": 2,
            "text": "Strength in diversity"
        },
        {
            "text": "Last month, I attended the celebration event of the second cohort of Florence Nightingale Foundation BME nurse leadership graduates from social care and it was heartening to see how they have grown. I was so impressed with the quality improvement projects they presented."
        },
        {
            "text": "Their innovation and creativity demonstrated social care nursing at its best: responsive, person-centred solutions to issues that impact positively on the lives of people in our care."
        },
        {
            "text": "In more good news, Salford University has now appointed the UK’s first Professor of Social Care Nursing, Dr Claire Pryor, in a position funded by the Royal College of Nursing Foundation. I am delighted as I know she will be both a champion for the sector and a great asset to the growing profile of nurses in social care."
        },
        {
            "text": "So, enjoy International Nurses Day but remember we should be celebrating the amazing work of social care nurses every day."
        },
        {
            "text": "And if you or someone you know is considering a nursing role in health or social care, encourage them to check out the many courses available on the UCAS website. There’s always room for more wonderful colleagues with the skills, desires and ambition to transform the lives of others."
        }
    ]
}