{
    "url": "https://stratcommand.blog.gov.uk/2024/05/10/we-are-strategic-command-with-jules-despres/",
    "title": "We Are Strategic Command with Jules Després",
    "authors": [
        "HeatherS"
    ],
    "categories": [
        "Uncategorized"
    ],
    "pub_date": "2024-05-10T14:53:33+01:00",
    "content": [
        {
            "text": "To celebrate International Nurses Day, Captain Jules Després reflects on his nursing career and the most rewarding part of being the Chief Nursing Officer for Defence."
        },
        {
            "text": "Interviewer: Could you introduce yourself and explain a little about your role?"
        },
        {
            "text": "Captain Jules Després: I’m Captain Jules Després, the Chief Nursing Officer for Defence."
        },
        {
            "text": " "
        },
        {
            "text": "Interviewer: What has led you to your current role?"
        },
        {
            "text": "Captain Jules Després: My journey has been quite interesting. I originally trained in the NHS as a nurse, then worked in London for about four years. In 2001, I joined the Royal Navy and have been working as a nurse clinically for most of my career."
        },
        {
            "text": " "
        },
        {
            "text": "Interviewer: What does your current role entail?"
        },
        {
            "text": "Captain Jules Després: I work with the Chief Nurses for the Navy, Army, Air Force, and civilian workforce to bring all matters related to nursing workforce and nursing capability together."
        },
        {
            "text": "One of the unique aspects is how we bring the medical pathway, operational patient care pathway, Defence Primary Health Care, and civilian nursing workforce together, alongside our military nursing workforce and supporting the NHS components."
        },
        {
            "text": "Working alongside our military nursing workforce and supporting the NHS genuinely means we offer a unique service in Defence."
        },
        {
            "text": " "
        },
        {
            "text": "Interviewer: What do you find most rewarding in your current role?"
        },
        {
            "text": "Captain Jules Després: For me, the most rewarding aspect is being able to shape and influence change, especially in facing challenges in nursing globally and in the UK."
        },
        {
            "text": "I'm very much focused on tomorrow and into the future, particularly in setting up and developing the Defence Functional Nursing Strategy. This initiative brings to life what nursing is all about and what we can offer Defence as a whole, including investing in our people and driving their future careers."
        }
    ]
}