{
    "url": "https://stratcommand.blog.gov.uk/2024/05/10/we-are-strategic-command-with-sarah-hudson/",
    "title": "We Are Strategic Command with Sarah Hudson",
    "authors": [
        "HeatherS"
    ],
    "categories": [
        "Uncategorized"
    ],
    "pub_date": "2024-05-10T15:04:22+01:00",
    "content": [
        {
            "text": "To celebrate International Nurses Day, CPONN Sarah shares how her role as Lessons and Clinical Data Manager brings the best possible care to the frontlines."
        },
        {
            "text": "Interviewer: Can you tell us about your current role and responsibilities within the military?"
        },
        {
            "text": "Sarah: I am a Chief Petty Officer Naval Nurse Sarah Hudson and I work within the Defence Medical Services Organisational Learning team as Lessons and Clinical Data Manager."
        },
        {
            "text": " "
        },
        {
            "text": "Interviewer: Can you share what you do in your role?"
        },
        {
            "text": "Sarah: My main role is clinical data management and within the team, we focus on lessons identified on operations and exercises."
        },
        {
            "text": "The lessons from operations and exercises are invaluable for improving our preparedness for worst-case scenarios and ensuring the proper care and protection of our service personnel."
        },
        {
            "text": "What I have found through my role, is that I can make a difference in using the lessons identified and learned to drive improvement in healthcare delivery, whether it be command, control, equipment, staffing and training."
        },
        {
            "text": " "
        },
        {
            "text": "Interviewer: How did you start in your career in the Navy?"
        },
        {
            "text": "Sarah: I originally joined the Reserves in 2009 because my husband was in the Navy, and I felt like I was missing out on all the fun things that he was doing."
        },
        {
            "text": "Now, as a full-time Chief Petty Officer, I do lots of teaching because if you don't do it, you lose it. And the whole point of me being in the military is being in a deployable emergency nurse. So, those skills are maintained through my teaching."
        },
        {
            "text": " "
        },
        {
            "text": "Interviewer: What has been your experience as a nurse in the military?"
        },
        {
            "text": "Sarah: I've been really fortunate with my experiences as a nurse. It's an amazing place to be able to share knowledge and understanding."
        },
        {
            "text": " "
        },
        {
            "text": "Interviewer: As we celebrate International Nurses Day, can you share what advice you’d give to a younger Sarah as she embarks on her nursing career?"
        },
        {
            "text": "Sarah: I would advise Sarah in her thirties to get started in her twenties and tell younger Sarah join the military earlier."
        }
    ]
}