{
    "url": "https://ukhsa.blog.gov.uk/2024/05/10/whooping-cough-one-mothers-story-of-love-loss-and-action/",
    "title": "Whooping cough: One mother's story of love, loss and action",
    "authors": [
        "Blog Editor"
    ],
    "categories": [
        "Children and Young people",
        "immunisations",
        "Uncategorized"
    ],
    "pub_date": "2024-05-10T12:21:49+01:00",
    "content": [
        {
            "text": "Credit: Catherine Hughes"
        },
        {
            "text": " \nRiley Hughes was born a gorgeous and healthy baby boy on February 13th, 2015. He was our second child and we were so delighted to have him in our family. At three weeks of age, he started displaying mild cold-like symptoms, and developed an occasional cough."
        },
        {
            "text": "We called out a doctor, who assured us he was fine. However instincts took over, and after a night where he slept a lot and barely woke for his usual two-hourly breastfeed, we knew something wasn't right. We took him straight to our local children's hospital."
        },
        {
            "text": "Credit: Catherine Hughes. Riley peeking at us from his hospital bed. He didn't even seem that sick when he was first admitted. He wasn't needing oxygen or anything. It all went downhill so quickly."
        },
        {
            "text": "Riley was admitted that afternoon, and at first it was thought he had bronchiolitis. Pretty quickly, the doctors suspected pertussis (whooping cough) and began treating him for it. On the 4th day of his hospital stay, he was taken to pediatrics intensive care unit (PCIU) with pneumonia."
        },
        {
            "text": "We stood anxiously waiting for an update from Riley’s doctor. While I knew the PICU was the best place for him, I couldn’t ignore the anxious faces of the other parents who walked past Riley’s room, or the draw that said “baptism gowns”. It was a stark reminder that not every child who enters intensive care, leaves."
        },
        {
            "text": "I remember seeing the wall of “PICU graduates” – photos of happy faced kids who had survived and thrived after spending time in the PICU. I imagined the photo we’d send in of Riley, once he was all better. Once he’d learned to smile, once his cough had gone away, once he was all healed."
        },
        {
            "text": "Credit: Catherine Hughes. Riley means courageous, and courageous he was."
        },
        {
            "text": "Feeling nervous, hands sweaty, we listened to Riley’s doctors talk. “Life support will give his little body a chance to rest and heal,” we were told. They also described the plasma exchange he would possibly need later that afternoon, where his blood would be manually removed by a syringe and replaced with a donation of plasma – a procedure that would take hours."
        },
        {
            "text": "I looked at our beautiful boy, who was already connected to so many tubes and wires. This was starting to feel so serious, the doctors who originally were fairly positive now looked worried and concerned. We called up Greg’s Mum who lived in Adelaide, and asked her to fly to Perth that evening, as things weren’t looking all that good"
        },
        {
            "text": "An hour or two later, one of Riley’s doctors pulled us aside for a chat. She kindly – if there is a kind way – told us that we needed to prepare ourselves for the fact that Riley could die. I felt shocked and sickened. I think this is one of the first times I cried in hospital; I had been so positive that Riley would get better. Greg and I gripped each other’s hands and tried to comfort each other, but really there is no way to comfort in this situation. We spent the next hour or two pacing the corridors as we waited for them to administer a new cannula, before we were allowed in."
        },
        {
            "text": "I wish I could remember the last time I saw Riley conscious. We made the decision for me to go to my parents’ house for a sleep, since I had been in hospital for four days with hardly any sleep. We thought we were going to be in it for the long haul, and that I would need my energy. As I left, I know they were preparing him for life support and the plasma transfusion. I just have no memory of looking into his eyes for the last time, or letting him know I loved him. I really hope I did."
        },
        {
            "text": "Greg says it’s a good thing I wasn’t there for his last conscious hours. He was screaming and screaming as they got him ready for life support, I don’t know all the fine details, but I know he hadn’t had any milk in a long time, and that he would have been in a lot of pain from the needles and cannulas they were administering. Greg’s last memory of Riley conscious is of him screaming and distraught. That’s how my baby will last remember the world."
        },
        {
            "text": "Credit: Catherine Hughes. It was 4:45 in the morning when this photo was taken. I'd cried more tears in that room than I had in my previous 29 years to that point."
        },
        {
            "text": "I woke up with a start at 3am the next morning, to the phone call that nobody would ever want to have. “Cath, the doctors say you’ve got to come in, quickly,” Greg urged. I extracted myself from my daughter’s cuddle and asked Mum to drive me to the hospital. We were there within 15 minutes but I got lost trying to find his room and was in a panic. I was greeted by a social worker and as lovely as she was, it was clearly a sign that Riley’s chances had diminished."
        },
        {
            "text": "A nurse asked us if we wanted him baptised, and my heart sank. We agreed and I spent the next couple of minutes choosing out a blanket and christening gown. Due to all his wires and tubes, they could only place the gown on top of him, but he still looked beautiful. Swollen, sick, but beautiful."
        },
        {
            "text": "I remember putting my finger in his hand when he was being baptised, and he still had that reflex were his hand curled around it. Or maybe I imagined it, I’m not sure. But I remember thinking that there was still a chance."
        },
        {
            "text": "At 10 am that morning, we had a meeting with Riley’s doctor, several nurses, and the social worker. Our parents were also there, and supported us as we were told that while they weren’t giving up hope or stopping treatment, it was not looking like Riley was going to survive. His heart was failing, his lungs were filled with thick mucus, as the toxins from the pertussis and the subsequent pneumonia had ravaged his body."
        },
        {
            "text": "My whole world was crumbling, and while I don’t think I was a total mess, inside my heart was breaking. We mentioned that when it was time for him to go, we’d like to be holding and cuddling him, not have him lying alone on the bed. The rest of the morning was spent crying, texting family and friends about what was happening, spending time with Riley, and asking my brother to bring in our three year old daughter so she could say goodbye."
        },
        {
            "text": "Credit: Catherine Hughes. Riley told me he is a bit tired of you and wants to give me a cuddle instead\" is what our daughter would tell us every time she wanted to snuggle with \"her baby\". She was just a bit smitten!"
        },
        {
            "text": "We tried to explain to our daughter what was happening. She gave Riley a quick cuddle and kiss, said goodbye, and asked if she could go play now. She never really understood the finality of his death until several months later."
        },
        {
            "text": "When we saw the nurses dragging the big arm-chair into Riley’s room, we knew that it was “time”. Time to say goodbye, time to do the last thing on earth I wanted to do, and watch my baby die. We all had last cuddles, and then it was time."
        },
        {
            "text": "I asked the doctor if there was any chance, even the slimmest of chances. He was very upset and told me that unfortunately there was no hope. Pink foamy stuff had started to come up out of his lungs, I forget what it was but I knew it wasn’t good."
        },
        {
            "text": "Riley was placed in my arms, and I was shocked at how burning hot and swollen his tiny body was. Greg crouched next to me, holding Riley’s hands. The tubes were slowly and carefully removed, and we cuddled, cried, kissed him, and sang to him a lullaby as the life slowly drained out of him."
        },
        {
            "text": "At 2pm, our beautiful 32-day-old baby left us, left this world, and left us devastated and heartbroken."
        },
        {
            "text": " "
        },
        {
            "text": "Credit: Catherine Hughes. Four weeks with you wasn't enough, but it was enough for me to have fallen completely in love with you"
        },
        {
            "text": "People seemed genuinely shocked that a child in Australia had died from this disease. It’s shocking, too, to see the recent reports that babies have died from it in the UK. These are deaths that could have been prevented with vaccines that have been available for pregnant women for years. But in my case, I wasn’t even informed by my health care providers about the option of pregnancy vaccination for whooping cough."
        },
        {
            "text": "What’s most shocking to me, though, is that there are two million ‘Rileys’ every year – two million other babies or young children around the world who die from whooping cough or other vaccine-preventable diseases. That’s millions of parents each year, who watch their children die from something that could have been easily prevented – if only they had access to vaccination. And that is not OK with me."
        },
        {
            "text": "Ever since Riley died, we wanted to make a difference in his honour.  We are not alone with those feelings – there are many wonderful parent advocates out there who feel like it is their duty to help protect others after their child died from preventable causes, such as pool drownings or household accidents. I guess this is just us trying to do our bit. I feel like we failed to protect him, but if we can protect other children then perhaps some good has come out of something so awful."
        },
        {
            "text": "We think that by donating vaccines in honour of our children, we are not only protecting the lives of other children, we are helping to eliminate diseases from the world – maybe that will be a gift to our children’s children."
        }
    ]
}