{
    "url": "https://environmentagency.blog.gov.uk/2024/05/10/working-in-partnership-to-enhance-approaches-to-surface-water-risk-management/",
    "title": "Working in partnership to enhance approaches to surface water risk management",
    "authors": [
        "Environment Agency"
    ],
    "categories": [
        "Environment Agency",
        "Flood",
        "Flood Maintenance",
        "Flood Planning"
    ],
    "pub_date": "2024-05-10T09:16:22+00:00",
    "content": [
        {
            "text": "In recent years, record rainfall events nationally and internationally have served to underline the threat of surface water flooding, particularly to our cities and urban areas, writes Caroline Douglass, Environment Agency Executive Director of Flood and Coastal Risk Management."
        },
        {
            "text": "Examples including London, New York and more recently Dubai, have all been subjected to widespread disruption from surface water flooding from extreme rainfall. In July 2021, some parts of London received more than twice the average July rainfall in two hours with over 2,000 properties reported flooded with stormwater and sewage. In New York, over the past three years, extreme storms have caused widespread flooding, significant property damage and tragically loss of life. In August 2021, Hurricanes Henri and Ida set records for the most intense rain events in New York’s history. This was recorded as 7.8cm per hour intensity."
        },
        {
            "text": "In the latest UK’s National Risk Register (2023) the impact ‘score’ of surface water flooding has been increased and is now ranked on a par with coastal and river flooding as a Category 4 ‘Significant’ impact. Collectively, these are the highest risk environmental hazards that the country faces. Without further action, the risks will increase as a result of climate change and urbanisation."
        },
        {
            "text": "In England, the Environment Agency are committed to showing bolder strategic leadership and leaning in more to support and enable others to plan for and adapt to surface water flood risks. This particularly means supporting local authorities who are responsible for managing surface water flood risk locally. Another part of our bolder leadership role is playing an active part in strategic partnerships. For example, together with Yorkshire Water, Hull City Council, East Riding of Yorkshire Council and the University of Hull, we are active members of the Living With Water partnership. Through the partnership we are helping to build flood resilience, develop innovative water management systems, and highlight the region as a great place to live, work and visit."
        },
        {
            "text": "In London, we are also piloting new ways of working with the London Surface Water Strategic Group. It’s a partnership between the Environment Agency, Greater London Authority, London Boroughs, Transport for London, London Fire Brigade, Thames Regional Flood and Coastal Committee and Thames Water. Together we’re looking to innovate and find better ways of managing surface water flood risks. The group is overseeing the development and implementation of a strategic surface water flooding risk management strategy due to be published this year."
        },
        {
            "text": "However, it is clear that the challenges we face from surface water flooding are not unique to the UK and need collective action. We need to work in partnership – both domestically and internationally – to enhance our resilience. As a result, we also regularly engage with other international cities to share our work and learn from their experiences."
        },
        {
            "text": "Last month, I had the pleasure of attending a visit with officials from the New York City government to demonstrate surface water interventions in the Royal Borough of Kensington & Chelsea (RBKC) and London Borough of Hammersmith & Fulham (LBHF)."
        },
        {
            "text": "New York City government have been sharing with us their experiences of ‘stormwater management’. This includes how they govern water and sewage management and investment. It’s clear we share many of the same challenges and are pursuing similar approaches in terms of interventions to reduce or slow the flow of water within the cityscape but have different structures and authorities to respond."
        },
        {
            "text": "On the visit, we met with the Boroughs to see how they were using sustainable urban drainage systems (SUDs) to manage surface water flooding in two very different locations. Firstly, in RBKC in Holland Park, where a SUDs scheme has been built into a re-designed playground. The drainage allows water to be held back and also provides a better environment for the children to engage with and learn about the water environment. Secondly, in LBHF we saw an innovative drainage scheme to integrate  school roof drainage with planted basins and raingardens and increased permeable surfaces providing a landscape that is safe for children to play in on a daily basis as well as providing vital drainage to reduce flood risk and climate adaptation benefits."
        },
        {
            "text": "Commenting on the visit and our collaboration, Commissioner for Department of Environmental Protection and Chief Climate Officer in New York Rohit Aggarwala said: “It’s great to share our experiences with cities of a similar scale internationally. By working together, we have found that we experience similar issues. It’s important we share solutions and learn from each other to ensure we better manage surface water flood risk.”"
        },
        {
            "text": "You can read more about the work we’re doing in partnership to drive action on surface water flooding in our blog: Bolder leadership for surface water flooding – Creating a better place (blog.gov.uk)"
        }
    ]
}