{
    "url": "https://marinedevelopments.blog.gov.uk/2018/04/13/how-should-you-contact-the-marine-management-organisation/",
    "title": "How should you contact the Marine Management Organisation?",
    "authors": [
        "Gareth Hern, MMO"
    ],
    "categories": [
        "Digital",
        "MMO corporate"
    ],
    "pub_date": "2018-04-13T13:30:13+01:00",
    "content": [
        {
            "text": "“I’m trying to track down a fishing boat from the year 1900.”"
        },
        {
            "text": "“Are we allowed to paint a crab gold for a school project?”"
        },
        {
            "text": "“I’ve found some whale vomit on the beach. Who do I report it to?”"
        },
        {
            "text": "The Marine Management Organisation (MMO) has a broad remit. We license, regulate and plan marine activities in the seas around England so that they're carried out in a sustainable way."
        },
        {
            "text": "This means a wide range of people need to contact us. So what is the best way to get in touch with us so we can help you quickly and efficiently?"
        },
        {
            "text": "Members of the public"
        },
        {
            "text": "If you have a general enquiry you can contact the MMO’s dedicated helpline on 0300 123 1032. This covers a range of enquiries from marine licence applications to fisheries management to European grant funding. You can also email us at info@marinemanagement.org.uk."
        },
        {
            "text": "For marine licensing you should check if your activity needs a marine licence by using the MMO’s interactive assistance tool in the first instance. You can place an enquiry through the online system for more information on any aspect of the application process."
        },
        {
            "text": "If you need support on using the online system you should email: marine.consents@marinemanagement.org.uk."
        },
        {
            "text": "If you're a company looking to sell your products and services to Government organisations like us please read this guidance before calling."
        },
        {
            "text": "Customer feedback"
        },
        {
            "text": "Effective feedback, both positive and negative, is very valuable to us and helps to continuously improve the service we deliver. You can provide feedback about our work directly via the email address above and/or via our survey, which is open all year round."
        },
        {
            "text": "In addition, if you are not satisfied with a specific aspect of our service we encourage you to let us know and we will do our best to resolve the matter as quickly as possible. Please see our customer complaints process for guidance on how we can help you if you are unhappy with our service."
        },
        {
            "text": "Journalists"
        },
        {
            "text": "The MMO has a media team to handle enquiries from journalists and media organisations. The team can be contacted at media@marinemanagement.org.uk or by dialling the helpline. These contact details should only be used by recognised journalists and media organisations and not by members of the public with general enquiries."
        },
        {
            "text": "For urgent queries out of hours (weekends and 5pm - 9am weekdays) please use email. The auto-response message you will receive includes further instructions on how to contact the duty officer."
        },
        {
            "text": "Freedom of Information "
        },
        {
            "text": "We are committed to promoting and actively developing a culture of openness, transparency and accountability embodied within information rights legislation.  This is why we publish as much information as possible online and actively look at making improvements to this where practical."
        },
        {
            "text": "If you can’t find what you require we encourage you to contact us directly over the phone to see if we can provide you with what you need. However, you can make a request for information under the Freedom of Information Act (2001) and/or the Environmental Information Regulations (2004) by contacting us at:"
        },
        {
            "text": "Tyneside House\nSkinnerburn Rd\nNewcastle upon Tyne\nNE4 7AR"
        },
        {
            "text": "Email: accesstoinformation@marinemanagement.org.uk"
        },
        {
            "text": "Telephone: 0300 123 1032"
        },
        {
            "text": "Before you do so you should read the how to make a request guidance."
        },
        {
            "text": "Consultations"
        },
        {
            "text": "We regularly consult on a variety of subjects so if you want to have your say on an issue that’s important to you check GOV.UK as we may have an open consultation you can take part in."
        },
        {
            "text": "Government policy"
        },
        {
            "text": "The MMO is an executive non-departmental public body of the Department for Environment, Food and Rural Affairs (Defra). This means we can answer questions on our remit but not on wider government priorities, such as EU exit."
        },
        {
            "text": "You can find out more about Defra policies and remit on GOV.UK."
        },
        {
            "text": "Pre-election periods"
        },
        {
            "text": "During periods immediately before elections or referendums we may be quieter than normal with our communications. This is known as the pre-election period or ‘purdah’ and there are certain restrictions on civil servants’ activity during this time."
        },
        {
            "text": "We keep delivering government business in the pre-election period but need to do everything possible to avoid any activity that could call our political impartiality into question and to ensure that public resources are not used for party-political purposes."
        },
        {
            "text": "Anyone who wants to report something in their local area"
        },
        {
            "text": "The MMO has coastal offices across the English coastline from North Shields to Hayle. You can find a full list and contact details on our GOV.UK website."
        },
        {
            "text": "You can also share intelligence with us via social media. If you spot something on social media you would like to report or make us aware of you can tag us on Twitter and Facebook so we can investigate."
        },
        {
            "text": "Available resources "
        },
        {
            "text": "You may be able to find what you need on our website without needing to contact us."
        },
        {
            "text": "The following information is publicly available:"
        },
        {
            "text": "Statistics"
        },
        {
            "text": "Corporate reports"
        },
        {
            "text": "Transparency data"
        },
        {
            "text": "You can also follow us on Twitter @The_MMO."
        },
        {
            "text": " "
        },
        {
            "text": " "
        }
    ]
}