{
    "url": "https://civilservice.blog.gov.uk/2021/11/11/civil-service-awards-2021-shortlist-revealed/",
    "title": "Civil Service Awards 2021: shortlist revealed",
    "authors": [
        "Civil Service Blog Team"
    ],
    "categories": [
        "A Modern Civil Service",
        "A Skilled Civil Service",
        "An Ambitious Civil Service",
        "An Innovative Civil Service"
    ],
    "pub_date": "2021-11-11T10:06:34+00:00",
    "content": [
        {
            "heading": 3,
            "text": "Drumroll... We can now present the shortlisted nominees for the prestigious Civil Service Awards 2021!"
        },
        {
            "text": "Today, the Civil Service Awards 2021 officially unveiled the shortlist ahead of next month’s award ceremony, following a record number of entries."
        },
        {
            "text": "Following a refresh to embody the vision for A Modern Civil Service, there are 13 awards up for grabs. Look out for several exciting new categories including Programme of the Year, One Civil Service and Cabinet Secretary’s Outstanding Leader, alongside trusty favourites such as Rising Star and Diversity and Inclusion. "
        },
        {
            "text": "Delivering for citizens"
        },
        {
            "text": "An expert panel of judges, comprising a mix of grades and professions from locations across the UK, reviewed the nominations to select the contenders. Civil servants drive extraordinary work, delivering for citizens all over the country, and insiders revealed it was a tall order selecting the shortlist in another competitive year."
        },
        {
            "text": "The Civil Service Awards ceremony will be beamed live from London’s historic Lancaster House on 16 December. The ceremony will feature both an in-person event for the hopefuls as well as a virtual audience of their cheering colleagues and teams tuning in for the big event."
        },
        {
            "text": "◼︎Check out the complete list of shortlisted nominees here, then mark your diaries for 16 December. Civil servants can follow coverage live on the day from the Civil Service Awards website, where you can read more about the awards."
        }
    ]
}