{
    "url": "https://insidedvla.blog.gov.uk/2021/11/11/dvla-wants-your-views-on-proposals-to-widen-the-pool-of-medical-healthcare-professionals-needed-to-fill-in-dvla-medical-questionnaires/",
    "title": "DVLA wants your views on proposals to widen the pool of medical healthcare professionals needed to fill in DVLA medical questionnaires",
    "authors": [
        "Dr Nick Jenkins"
    ],
    "categories": [
        "Features"
    ],
    "pub_date": "2021-11-11T12:01:58+00:00",
    "content": [
        {
            "text": "By law, all drivers must meet medical standards for fitness to drive at all times, and there are additional checks for bus and lorry drivers."
        },
        {
            "text": "All drivers are legally obliged to tell DVLA about a medical condition that could impair their ability to drive, such as diabetes, glaucoma and epilepsy. We use this information to decide what further actions to take."
        },
        {
            "text": "We want as many people as possible to enjoy the freedom of the open road for as long as possible, but only if they are safe to do so. Currently this means we need to contact GPs and hospital doctors in certain instances, when a driver tells us about a medical condition that could affect their driving."
        },
        {
            "heading": 2,
            "text": "Impact of coronavirus (COVID-19)"
        },
        {
            "text": "The impact of COVID-19 on the NHS and GP surgeries is unparalleled. We greatly appreciate the significant support of a driver’s doctor, providing vital medical reports to help us decide if it’s safe to issue a driving licence. When an application involves a medical condition, we’re often wholly dependent on receiving this additional information."
        },
        {
            "text": "We know that the ability of NHS doctors and GPs to respond to our queries was impacted by the pandemic. And while the provision of such reports may not be clinically urgent, receiving a driving licence in a timely manner can be vitally important to an individual’s wellbeing and livelihood."
        },
        {
            "text": "In addition to helping the ordinary motorist, making sure bus and lorry drivers stay safe and legal on the road is of particular importance for us. This will help drivers delivering essential goods and transporting passengers throughout the UK."
        },
        {
            "heading": 2,
            "text": "New proposals "
        },
        {
            "text": "We’re very much aware of the need for GP practices and hospital teams to prioritise and manage their resources in such times. With the support of the Department for Transport and Department of Health and Social Care (DHSC) we propose amending current legislation to increase the pool of healthcare professionals authorised to fill in medical questionnaires and we want your views on doing so."
        },
        {
            "text": "Only registered medical professionals - doctors with full general medical council (GMC) registration are currently authorised to provide medical reports to DVLA."
        },
        {
            "text": "Changing the law to allow an appropriate registered healthcare professional, other than a doctor, to fill in a medical questionnaire, will give surgeries greater flexibility and improve turnaround times. This proposal also supports DHSC’s aim to reduce bureaucracy in general practice."
        },
        {
            "heading": 2,
            "text": "We’re seeking your views"
        },
        {
            "text": "We want to involve you in decisions that affect you and welcome your views, thoughts, and insights on this proposal."
        },
        {
            "text": "The consultation will run between 8 November and 6 December 2021 and will only take you 25 minutes to read and provide feedback. After the consultation the results will be analysed and details of the outcome of the consultation will also be published."
        },
        {
            "text": "Follow DVLA on Twitter, follow us on Facebook and connect with us on LinkedIn. You can also subscribe to the DVLA digital services blog."
        }
    ]
}