{
    "url": "https://educationhub.blog.gov.uk/2021/11/11/exams-in-2022-everything-you-need-to-know/",
    "title": "Exams in 2022 – everything you need to know",
    "authors": [
        "mediaofficer"
    ],
    "categories": [
        "A Level",
        "Exams and qualifications",
        "GCSE",
        "Schools",
        "Vocational education"
    ],
    "pub_date": "2021-11-11T00:01:59+00:00",
    "content": [
        {
            "text": "This year students will sit exams, but we recognise they have faced disruption over the last two years and we’ve taken measures to make sure they aren’t disadvantaged."
        },
        {
            "text": "TO NOTE: This article was first posted on 30 September 2021 but updated on 26 January 2022 to reflect the latest information on exams."
        },
        {
            "text": "Here we answer your questions."
        },
        {
            "heading": 3,
            "text": "Why are you bringing exams back?"
        },
        {
            "text": "Exams are the best and fairest form of assessment. But we recognise the disruption the pandemic has caused, so there will be a number of adaptations for this years’ exams to ensure fairness for students."
        },
        {
            "text": "Across January, students have sat more than 500,000 exam papers for vocational and technical qualifications – giving confidence that schools and colleges can host exams smoothly, despite Covid infection rates during winter."
        },
        {
            "heading": 3,
            "text": "What measures will be in place to make sure they are fair when different students have missed different amounts of time?"
        },
        {
            "text": "Students will benefit from a range of adaptations to GCSE, AS and A level exams in England – these adaptations will help them reach their potential following the disruption they’ve faced."
        },
        {
            "text": "They include:"
        },
        {
            "text": "Some of these changes will also apply to the November 2022 GCSE English language and mathematics re-sit exams. There will be advance information deployed for both subjects in July, and a formulae sheet will be available for mathematics."
        },
        {
            "text": "These adaptations are in response to a consultation we ran with the exams regulator, Ofqual, in summer 2021."
        },
        {
            "text": "The consultation gathered more than 6,000 responses – with almost a quarter from students – and showed that more than 90 per cent of students and parents were in favour of giving advance information on the focus of exams next summer to support students with revision, and around 80 per cent or more agreed with offering choices of topics in some GCSE subjects."
        },
        {
            "heading": 3,
            "text": "When will advance information be made available for GCSE and AS and A level students?"
        },
        {
            "text": "Advance information on the focus of summer exam content for the majority of GCSE, AS and A level subjects will be published by the exam boards on 7 February."
        },
        {
            "text": "The information will help students focus their revision for the final months and will give an indication of some of the content, texts, topics, themes and skills that students can expect in their exams."
        },
        {
            "text": "For English language and maths GCSE exams in November 2022, advance information will be given in July."
        },
        {
            "heading": 3,
            "text": "What about grading – are you making any changes to that?"
        },
        {
            "text": "For the past two years, summer exams haven’t been able to take place and, instead, students have been awarded grades by their teachers. Due to the difference in assessment approach, we have seen higher outcomes."
        },
        {
            "text": "As we return to exams, we want to get back to the pre-pandemic standard, but in the interests of fairness, Ofqual (who take the decisions on grading) won’t do so in one jump."
        },
        {
            "text": "Instead, 2022 will be a transition year to reflect that we are in a pandemic recovery period and students’ education has been disrupted. In 2022 the aim, therefore, will be to move grading to a point close to midway between 2021 and pre-pandemic profiles."
        },
        {
            "text": "Results are likely to be higher than in 2019, but not as high as in 2020."
        },
        {
            "text": "Ofqual aims to return to results that are in line with pre-pandemic years in 2023."
        },
        {
            "heading": 3,
            "text": "When will GCSE exams happen in 2022?"
        },
        {
            "text": "GCSE exams will happen in May and June, as normal, and the exam boards have now published their final summer exam timetables."
        },
        {
            "heading": 3,
            "text": "When will A level exams happen in 2022?"
        },
        {
            "text": "A level exams will happen in May and June as normal, and the exam boards have now published their final summer exam timetables."
        },
        {
            "heading": 3,
            "text": "What is being done for vocational and technical qualifications in 2022?"
        },
        {
            "text": "It is the Government’s firm intention that exams and assessments for VTQs and other general qualifications, including T Levels and Functional Skills qualifications, should go ahead in 2021/22 academic year. Many thousands of students have already sat VTQ assessments this year."
        },
        {
            "text": "Adaptations for Vocational and Technical Qualifications have been confirmed, following consultation. Colleges and schools have been made aware of these changes by their awarding organisations."
        },
        {
            "heading": 3,
            "text": "When will students get their results?"
        },
        {
            "text": "A and AS level results day will be held on 18th August 2022."
        },
        {
            "text": "GCSE results day will be held on 25th August 2022."
        },
        {
            "text": "VTQs most similar to GCSEs and A levels, that are used for progression, should be awarded on or before GCSE and A level results day. Other types of qualifications such as Functional Skills Qualifications, and those that are not tied to an academic year will continue to be awarded throughout the year."
        },
        {
            "heading": 3,
            "text": "What are your contingency plans in the event that exams cannot go ahead?"
        },
        {
            "text": "On 11 November, we confirmed that in the unlikely event that exams cannot go ahead, students will receive teacher assessed grades instead. These grades would be based on a range of work – similar to what happened last summer."
        },
        {
            "text": "It’s important to be clear, though, that this is very much a last resort in the unlikely event that the pandemic means that exams cannot go ahead."
        },
        {
            "text": "The plans follow a consultation we ran jointly with Ofqual earlier this autumn."
        },
        {
            "text": "We have also published our contingency plans for VTQs, which seek to achieve parity and consistency where relevant with the arrangements proposed for GCSEs and AS/A levels."
        }
    ]
}