{
    "url": "https://vets.blog.gov.uk/2021/11/11/finding-balance-working-in-the-animal-and-plant-health-agency/",
    "title": "Finding Balance - Working in the Animal and Plant Health Agency",
    "authors": [
        "Sion Rowlands"
    ],
    "categories": [
        "Jobs and Experiences"
    ],
    "pub_date": "2021-11-11T10:30:41+00:00",
    "content": [
        {
            "text": "You’ll find it on most job adverts these days: work-life balance, it is so important and yet, for many it would seem, it can be difficult to achieve. I’ve been very fortunate in my veterinary career to date, I’ve had variety upon variety, and I continue to enjoy my work and the balance it affords me."
        },
        {
            "text": "Many years ago, I would have been the one questioning working as a vet in government. What would I be doing? Would I get the stimulus I’d had in practice? Yet here I am, years later with skills and experiences that I could only have gained from working first in the State Veterinary Service and now the Animal and Plant Health Agency (APHA)."
        },
        {
            "text": "That balance I mentioned, well that has meant I have not only continued to work in practice part-time (companion animals), I have also agreed working hours that fits around my needs and, more importantly, the ferrying needs of my two sons."
        },
        {
            "text": "I enjoy, although I am less inclined to think at the time, taking part in races and events that aren’t always what most would consider normal. Less park runs and more sleeping in a tent out in the middle of nowhere midway through a cycle race. With the temperature being a chilly -5c outside."
        },
        {
            "text": "Not that long ago I took part in the highest mountain bike race in the world. Eight days of cycling in the Himalayas with almost unimaginable scenery and at literally breathtaking altitude. There was of course a lot of cycling, plenty of lentil curry and hours spent trying to describe to everyone and anyone where Wales is."
        },
        {
            "text": "I’ve included a picture of me having to push my bike the part of one day, nearing the highest climb of the race, and another image of me having finally reached the top, around 5,400mtrs. Working in APHA, with the approach to flexible working and leave, meant that I could not only train in preparation for the event, but also take over two weeks off to visit one of the most magical and inspiring sites in the world."
        },
        {
            "text": "In May of this year APHA launched the vet recruitment microsite. The new advert is a great addition in publishing the range of roles as well as capturing the benefits of working as a vet for APHA. There are details on the site about our recruitment process, a list of current vacancies and even an opportunity to register your interest. There is also an intention to add some short videos soon, providing even more insight into how life working in APHA may look for you."
        },
        {
            "text": "The vet recruitment microsite not only advertises our vacancies, you can also find out what we do: the vital roles performed by staff and the different roles available. From safeguarding animal welfare, controlling borders to surveillance and responding to notifiable diseases, to name only a few areas."
        },
        {
            "text": "The range of work and the variety of roles are extensive. Why not visit the site and have a look for yourself?"
        },
        {
            "text": "Home - Careers as an APHA Vet (aphavets.co.uk)"
        }
    ]
}