{
    "url": "https://digitaltrade.blog.gov.uk/2021/11/11/make-hybrid-working-work-for-you/",
    "title": "Make hybrid working work for you!",
    "authors": [
        "Michał Poręba, Chief Data Architect",
        "Amanda Elmitt, Data Strategy and Capability Lead",
        "Joanne Granton, Capability Lead"
    ],
    "categories": [
        "Culture",
        "Diversity and Inclusion",
        "Flexible working",
        "People and Skills"
    ],
    "pub_date": "2021-11-11T09:19:36+00:00",
    "content": [
        {
            "heading": 6,
            "text": "A team meeting with some of the team together in a meeting room and others dialed-in on a screen. "
        },
        {
            "text": "In the Digital, Data and Technology (DDaT) team at the Department for International Trade (DIT), we champion hybrid working and recognise the importance of having a flexible approach. We now have offices in London, Cardiff, and Darlington where DDaT colleagues can be based. This hybrid nature allows us to recruit more talented people to our team.   "
        },
        {
            "text": "Hybrid working allows colleagues to work in the office and remotely. To understand what hybrid working is like, we spoke to DDaT colleagues based in Wales, the Southwest, and the Northwest about their experiences of working in different parts of the UK.  "
        },
        {
            "heading": 3,
            "text": "Michał Poręba, Chief Data Architect  "
        },
        {
            "text": "For more than a decade now, I have lived in Swansea. While the location has many advantages, the job opportunities in IT is not one of them. Not willing to move, I experimented with remote and hybrid work with teams and on projects worldwide. At the time, it wasn’t easy.  "
        },
        {
            "text": "When the pandemic hit and overnight remote work became the norm, I was well prepared. When we all began experimenting with hybrid work, I felt at home with it. But 2020 has changed things for me too. I wanted to try something outside the private sector. If it wasn’t for the hybrid work, I don’t think I would be able to join the Civil Service and do what I do now.   "
        },
        {
            "text": "I joined DIT as a hybrid employee. Most of the time, I work remotely from home. All the meetings are virtual or hybrid, and I don’t feel like I am missing anything from not being in the same room. In fact, assistive technology means online meetings can be more inclusive. But there is a natural trade-off. Most of our communication is non-verbal. That is where the “hybrid” comes in.  "
        },
        {
            "text": "Every few weeks I go to our London office for a couple of days, to meet others face to face. The in-person meetings have a very different dynamic. Brainstorming, discussing ideas and sharing visions is much easier, and so is making connections that will later facilitate remote collaboration. Then I go back home and can take advantage of home working. It is easier to focus or have one-to-one interactions to fill in the details on the big plans we sketched in the office.  "
        },
        {
            "text": "Hybrid work can be challenging but has so many benefits when done right. I think we are doing it well at DDaT DIT already and we still keep improving. "
        },
        {
            "heading": 3,
            "text": "Joanne Granton, Capability Lead  "
        },
        {
            "text": "I started at DIT as Capability Lead for the DDaT function in June, transferring from the Department for Environment, Food and Rural Affairs (Defra) where I worked for nearly 6 years. I was interviewed on Microsoft Teams and have worked online since. I find this works very well. Through regular calls and catch ups, my team and I know each other well, despite having never met each other face to face in the first few months.  "
        },
        {
            "text": "I live in the Southwest of England, and before the national lockdown and staff being asked to work at home, I felt that living away from London was a disadvantage. However, I feel much more equal and included now, as nearly everyone is spending at least some of their time working remotely.  "
        },
        {
            "text": "To support our hybrid working, we are following our team charter we wrote together. This is something that DDaT’s senior management team (SMT) are championing. Staff are being encouraged to create team charters that ensure every team works the way that suits them. "
        },
        {
            "text": "In our team, we have people who live in, or near to, London and prefer to be in the office as much as they can. But we also have others who live far away and choose to work in a hybrid way. Our team charter allows for us to do this. For example, when my team are all in the office, we will allow ourselves time to have ‘culture catch ups’ where we learn about each other and what we like, and how we like to work. "
        },
        {
            "text": "The way we all choose to work compliments each other so we can successfully deliver our objectives with a truly hybrid and inclusive approach."
        },
        {
            "heading": 3,
            "text": "Amanda Elmitt, Data Strategy and Capability Lead "
        },
        {
            "text": "While the pandemic has changed the way we work, it has also changed the way we learn and network. I live close to Manchester and many of my colleagues are in London. Working virtually for 20 months has increased my collaboration with people outside of Northwest England. My networks have been strengthened by this.  "
        },
        {
            "text": "Working from home means there is more time for our learning and Continuous Professional Development (CPD). Classroom based learning can be treated as the main or predominant way to learn but with people working from home, learning has become creative with a mix of virtual delivery styles. Our geographical location is no longer a barrier to group or individual learning."
        },
        {
            "text": "The pandemic opened doors for capability teams to follow best practice from the Learning and Development industry, and shift learning to be flexible in approach and delivery. Learning should be taken in bite-size chunks and at the right time for the individual. "
        },
        {
            "text": "This shift in learning is something that my team promote throughout DDaT. The DDaT Capability Team are responsible for supporting colleagues with their CPD. We promote the message that learning is lifelong, comes in many shapes and sizes, and is available to all our people. By supporting colleagues to develop or learn new skills, we can continue to support and grow talent throughout DDaT in DIT.  "
        },
        {
            "text": "There are lots of ways to approach hybrid working, as everyone’s individual circumstances are different. At DDaT we support this and will continue to support colleagues to perform their best while at home and in the office.  "
        }
    ]
}