{
    "url": "https://defrafarming.blog.gov.uk/2021/11/11/meet-the-team-policy-adviser-emma-and-her-background-in-agriculture/",
    "title": "Meet the team: Policy Adviser Emma and her background in agriculture",
    "authors": [
        "Emma Bailey-Beech"
    ],
    "categories": [
        "environmental land management schemes",
        "Farmers in Defra",
        "Things we've learned"
    ],
    "pub_date": "2021-11-11T14:05:37+00:00",
    "content": [
        {
            "text": "In this post, I'd like to share how my background in agriculture led me to work in the Future Farming and Countryside Programme."
        },
        {
            "text": "My grandparents were farmers in Staffordshire, but sadly the farm was long gone by the time I came along. Not being born directly into farming continues to be a source of disappointment to me! "
        },
        {
            "text": "Although I was mostly brought up in a town, I spent a lot of time in the countryside. I spent weekends feeding the lambs and calves at local farms. That soon turned into holiday work milking cows. Once I was at university, I had holiday jobs lambing, harvesting, milking, and at the local abattoir. "
        },
        {
            "heading": 3,
            "text": "Learning more about the thing I loved "
        },
        {
            "text": "When I spoke to the careers adviser at school, I remember feeling excited that there were actual agriculture colleges where I could learn more about what I loved. "
        },
        {
            "text": "I signed up for a Youth Training Scheme (YTS) which shows my age! I was thrilled with my first wage of £17.50 plus petrol money. It covered the 35-mile round journey to the tenanted dairy and chicken farm I’d been placed on.  "
        },
        {
            "text": "The YTS offered a terrific apprenticeship. The lecturer at Rodbaston College was an excellent teacher and had us doing all sorts of things.  "
        },
        {
            "text": "Adding this practical experience and entry level agricultural qualification to my good GCSE results, I was accepted into Harper Adams – which just happened to be one of the biggest agricultural universities and my local – things were coming together!  "
        },
        {
            "text": "My YTS had given me a love of pigs, so my degree was based largely around them. My dissertation explored pork eating quality. It was sponsored by the local abattoir.  "
        },
        {
            "heading": 3,
            "text": "Working with pigs "
        },
        {
            "text": "I had always envisaged I’d get a nice job on a pig farm once I’d finished university, but as some of you might recall, the pig industry was at the start of a massive downturn around 1998, so I needed to find something else. "
        },
        {
            "text": "Being young and carefree was an advantage, as I was happy to be flexible. I secured a role as a meat inspector in the south-west. "
        },
        {
            "text": "Given I’d only just left university, I wasn’t fazed by all the study and exams, and 9 months later became a dual qualified meat inspector, which basically meant I could do ante and post-mortems on any kind of animal to determine if it was fit for the human food chain. "
        },
        {
            "heading": 3,
            "text": "A move into policy"
        },
        {
            "text": "I enjoyed this job, but there were few opportunities to progress, so when a pig policy job came up in The Ministry of Agriculture, Fisheries and Food (MAFF), a precursor to Defra, I jumped at the chance. "
        },
        {
            "text": "I guess having a degree about farm animals helped, as I thrived and stayed in London for the next decade working on lots of different farm animal policy roles. "
        },
        {
            "text": "In 2011 I was pregnant with my first child and there was a restructure at work, so I left my post and I  moved to mid-Wales.  "
        },
        {
            "text": "I then spent 4 years at the Agriculture and Horticulture Development Board working on improving pork safety. I spent more time in abattoirs.  "
        },
        {
            "text": "I then worked for a company that carried out traceability and welfare audits for a leading supermarket – the job was to review inspector’s reports about farms all over the word and helping the clients remedy any non-conformances. "
        },
        {
            "text": "I loved reading about all the different practices on-farm and in abattoirs and would have stayed there forever, but sadly I was made redundant.  "
        },
        {
            "text": "Fortunately, Defra was taking on staff again to accommodate the huge policy undertaking that occurred due to Brexit, so in 2019 I applied and got back in! "
        },
        {
            "text": "I was keen to return to farming policy, and that’s where I am now.  "
        },
        {
            "heading": 3,
            "text": "The Sustainable Farming Incentive Pilot "
        },
        {
            "text": "At the moment, I’m working on the Sustainable Farming Incentive Pilot. Specifically, I’m exploring how membership of environmental assurance schemes could help inform our risk profile for compliance or eligibility. I'm writing a separate blog post on that, so stay tuned!"
        },
        {
            "text": "The Sustainable Farming Incentive scheme is one of 3 schemes we’re developing to encourage environmental land management. The other schemes are Local Nature Recovery and Landscape Recovery. "
        },
        {
            "text": "It’s a fascinating policy area that has the capacity to make a real difference on-farm. "
        },
        {
            "text": "The scheme will reward farmers for managing their land in an environmentally sustainable way. The full scheme will launch in 2022, initially for farmers in England who are eligible for the Basic Payment Scheme (BPS). "
        },
        {
            "text": "We’ll be releasing more details about the Sustainable Farming Incentive at the end of this month, so do subscribe to the blog for an alert when we do.  "
        },
        {
            "text": "There are 3 others with agricultural backgrounds in my small team. It’s nice to share stories and bring our experience to bear on policy decisions. That’s why I’m so supportive of our co-design work, getting the views and opinions of farmers out there is so important if our plans are to work. I encourage farmers and land managers to get in touch and share their thoughts. "
        },
        {
            "text": "Although I’ll probably never live or work on a farm again, I’ve still had a most enjoyable career in agriculture and am thrilled to be back in Defra – long may it last! "
        },
        {
            "text": " "
        }
    ]
}