{
    "url": "https://ipa.blog.gov.uk/2021/11/11/my-story-told-karina-singh/",
    "title": "My Story Told: Karina Singh",
    "authors": [
        "Karina Singh"
    ],
    "categories": [
        "Uncategorized"
    ],
    "pub_date": "2021-11-11T14:09:46+00:00",
    "content": [
        {
            "text": "I must admit I haven’t always been proud to be ‘other’ – I’ve not always fitted in, looked or sounded like others around me in the Civil Service, and have had to build this confidence up over time. This is something I talked about as part of a recent project delivery ‘women in leadership’ conference and will be sharing with colleagues at a webinar later this month."
        },
        {
            "text": "You see, I am a third-generation immigrant. By this I don’t mean that I am the second generation of someone who immigrated to the UK. I am the third generation of my family who has chosen or been forced to immigrate between countries."
        },
        {
            "text": "Generation one – a forced migration"
        },
        {
            "text": "My grandfather, Iqbal Singh, born in 1919 was the third of nine children of the local land registrar, in an area of the Indian subcontinent called Punjab – the land of the five rivers. Leaving school at 16, he found an admin job to support himself and continued his education in the evenings. By 1947 he was married with four sons and had a job as a stenographer (a PA in today’s language) in the Civil Service in the city of Lahore. In June 1947, Viscount ‘Dickie’ Mountbatten announced the boundary of the new countries of India and Pakistan, which cut right through the centre of Punjab - home to substantial Muslim, Hindu and Sikh populations. The date of transfer was set as 15 August – 10 weeks away. This announcement provoked the greatest migration of people in history, with an estimated 10-20 million displaced and nearly 2 million killed in the resulting riots and chaos. My grandfather and his family had to leave everything – his home, job and community behind in Lahore and migrate to the new, smaller country of India. In the chaos of the journey, my uncle Tej who was three at the time, got separated from the family. Luckily, four days later, a distant relative spotted him and brought him back. Despite having lost everything and having to re-establish his family, livelihood and career afresh, my grandfather made sure his five children were all educated well, worked hard and were successful."
        },
        {
            "text": "Generation two – a planned but reluctant immigration"
        },
        {
            "text": "“My father was involved in the construction of the M4, M40 and the runway at Heathrow airport”"
        },
        {
            "text": "My father, Jasbir Singh, who was eight at the time of the partition, had a very disjointed education, moving between towns and schools, as my grandfather and the wider family struggled to keep food on the table and give the children as much stability as they could. My grandfather, who worked away from the family for long periods of time, insisted that the children wrote to him in English to enhance their education. Dad excelled at school, going on to gain a degree in engineering. In the mid 1960s, the UK government was recruiting for recent graduates, especially doctors, teachers and engineers, from India and elsewhere, to help address skill shortages and help rebuild the economy. My father, like many other young men in their mid 20s were tempted to see the world. He applied for and got a permanent visa, but then changed his mind about coming over. After lots of family debate, he finally arrived at Heathrow airport on 6 June 1965, two days before his visa was due to expire. Once again, as an immigrant he was in an unknown environment, with no friends, little money, but with a sense of adventure and the determination to work hard and make a better life for himself and his family. He joined forces with a group of young men who were in a similar position. They learnt to cook together, helped each other out financially and to find houses to rent and buy. They became each other’s family. He worked with construction companies in the Reading area and was involved in the construction of the M4, M40 and the runway at Heathrow airport. A few years later he was joined by my Mum from India and soon my brother and I came along."
        },
        {
            "text": "Generation three – an unplanned emigration and a return"
        },
        {
            "text": "“Unlike my grandfather’s and father’s experiences, my immigration experience was very different”"
        },
        {
            "text": "By the mid-70s, things were quite uncomfortable for south Asians in the UK, with political objection to non-white immigration. This along with other family reasons, meant my parents decided to move back to Punjab. My brother and I had no choice but to emigrate with them. I was seven and remembered finding the transition pretty difficult. I didn’t speak any Indian languages, so was bemused about what was going on for a few years. They were pretty fed up with me at school, as I cried a lot and took a long time to make any friends. Unlike my grandfather’s and father’s experiences, my immigration experience was very different. I was cushioned by financial and family security. I looked like everyone else, even if I didn’t quite sound like them for a while. I had a normal happy childhood and eventually did ok at school and university. When I was 21, I decided to come to the UK for a holiday and ended up joining the civil service for a summer job."
        },
        {
            "text": "Present day working in government project delivery"
        },
        {
            "text": "“I didn’t appreciate at the time how lucky I was to find a job with such a fantastic employer in project delivery, who has invested in me, given me lots of opportunities and, importantly, is focused on making the UK and the world a better place to live in”"
        },
        {
            "text": "32 years later, I am still here! I didn’t appreciate at the time how lucky I was to find a job with such a fantastic employer in project delivery, who has invested in me, given me lots of opportunities and importantly is focused on making the UK and the world a better place to live in. This time my immigration experience was more similar to my grandfather and father. Having to adapt to a new culture, build a new friendship circle and get on my own feet financially has been an adventure, just like theirs. Like them, I value the continued investment in education, a hard work ethic and a positive outlook that travels with you – as none of us know where we will end up in life. The more I learn about my family’s history, the more I realise that my resilience and work ethic has been instilled in me by several generations. And that land registration and project delivery is in my blood! So, I am proud to be a third-generation immigrant!"
        }
    ]
}