{
    "url": "https://planninginspectorate.blog.gov.uk/2021/11/11/virtual-casework-events-planning-for-the-future/",
    "title": "Virtual casework events: Planning for the future",
    "authors": [
        "Rebecca Phillips"
    ],
    "categories": [
        "Appeals",
        "Applications",
        "Digital",
        "Examinations",
        "Service improvement"
    ],
    "pub_date": "2021-11-11T10:20:11+00:00",
    "content": [
        {
            "text": "Rebecca Phillips (Professional Lead for Planning Appeals) writes about the future of casework events and reflects on what we’ve learned from the Covid-19 pandemic when our hearings and inquiries moved online. Rebecca leads the work to create a sustainable and robust ‘operating model’ for the future."
        },
        {
            "text": "When the Covid-19 pandemic brought a halt to physical contact, we adapted by moving our casework events online and running them completely virtually."
        },
        {
            "text": "By “casework events”, we are talking about the hearings and inquiries that the Inspectorate holds for planning and other types of appeals, national infrastructure applications and local plan examinations."
        },
        {
            "text": "Like the rest of the world, our reliance on video conferencing surged. But, as Martin O’Brian our Head of Digital Services set out in his blog in May, what started as a short-term response to keep our casework moving during the COVID-19 pandemic has accelerated our ambitions to be a more digital and innovative organisation."
        },
        {
            "text": "With COVID restrictions now lifted, we have handed back the practical running of events to Local Planning Authorities, which can now include face to face elements."
        },
        {
            "text": "Whilst we have been adapting to changes in COVID restrictions, my team at the Planning Inspectorate has been working to develop a new operating model for events using insight gathered from extensive research."
        },
        {
            "text": "Our goal is to build a sustainable model for the future that:"
        },
        {
            "heading": 3,
            "text": "Our research"
        },
        {
            "text": "Over the summer, we conducted research with staff for an internal perspective. Our staff are clearly central to the model that we develop, and inspectors are the ones reviewing the evidence and should have a say in how that evidence can and should be heard."
        },
        {
            "text": "We have considered the needs of others involved at events (such as appellants, legal professionals, local planning authorities and interested parties). We have been collecting ongoing feedback from participants of virtual events and to complement this we commissioned the Royal Town Planning Institute (RTPI) to conduct further research on our behalf."
        },
        {
            "text": "As the only body in the UK that confers Chartered Status to planners, and with over 25,000 members in the private, public, academic and voluntary sectors, the RTPI was ideally placed to use their expertise and research to bring evidence and thought leadership to shape planning policies and thinking."
        },
        {
            "text": "We asked the RTPI to conduct research with a wide range of stakeholders and make recommendations to inform our future operating model."
        },
        {
            "text": "This technical note accompanies the following key findings and sets out the survey data limitations."
        },
        {
            "heading": 3,
            "text": "Key findings: A strong case for virtual events having a permanent role"
        },
        {
            "text": "The findings from approximately 300 Planning Inspectorate staff revealed:"
        },
        {
            "text": "Our ongoing customer research from approximately 600 event participants tells us:"
        },
        {
            "text": "RTPI’s research and analysis of our customers’ and stakeholders’ views found that:"
        },
        {
            "text": "The RTPI report recommends that virtual events should form an integral part of the operating model going forward, but the format of the event should be decided on a case-by-case basis."
        },
        {
            "heading": 3,
            "text": "What next?"
        },
        {
            "text": "Over the next few months, we will be developing and testing scenarios based on the themes emerging from the research."
        },
        {
            "text": "Following adoption of our environmental policy, we are carrying out an environmental impact assessment against each of the scenarios to inform our recommendations."
        },
        {
            "text": "These will feed directly into the development of our future operating model."
        },
        {
            "text": "This model will incorporate process and guidance on how and where a hearing or inquiry takes place. This will cover virtual, blended or face to face, taking into consideration the factors like:"
        },
        {
            "text": "We will be sharing our new operating model in early 2022."
        }
    ]
}