{
    "url": "https://socialcare.blog.gov.uk/2021/11/11/why-i-chose-to-have-my-winter-vaccinations/",
    "title": "Why I chose to have my winter vaccinations",
    "authors": [
        "Selina Morris"
    ],
    "categories": [
        "Care and support",
        "coronavirus",
        "Workforce"
    ],
    "pub_date": "2021-11-11T18:13:52+00:00",
    "content": [
        {
            "heading": 2,
            "text": "Research brings reassurance"
        },
        {
            "text": "My colleagues have asked me many times if I have had the flu jab. My answer has always been “No, I don’t need the flu vaccine, I’m not a sickly person, I never get ill. I have a good immune system.” I then decided to read up on flu and why I should have the vaccine."
        },
        {
            "text": "I was very surprised to discover that, even if a person has a good immune system and gets the odd cold now and then, they can pass on the virus to others and potentially make someone very ill or, even worse, they could die."
        },
        {
            "text": "I may not get poorly very often, but the environment in which I work means there are many people who could get very ill or die if they caught the flu. I suddenly felt very selfish and very shocked at the potential dangers I could be putting another person in."
        },
        {
            "text": "If having the vaccine could save a life, why wouldn’t you? There are no guarantees with anything but like they say prevention is always a better option. I now have the flu vaccine, if it saves lives, why wouldn’t I?"
        },
        {
            "heading": 2,
            "text": "No hesitation"
        },
        {
            "text": "When the vaccine first came out, I didn’t think twice, I work in care and have witnessed first-hand the devastation this cruel virus causes, the lives it’s taken and the pain and suffering it has caused."
        },
        {
            "text": "The thing that scared me the most was seeing people struggling to breath, and on top of that, being on their own with no family to comfort them through it all. Not being able to have your family there to hold your hand or just to sit with you is the loneliest feeling in the world and no one should have to go through that."
        },
        {
            "text": "Test results showed that, at some point, I had caught covid-19. I am glad to say I was one of the lucky ones. I had no real symptoms, just the feeling of tiredness, which I am very grateful for. I do regular testing at work, so if I do contract it again, I can isolate myself straight away."
        },
        {
            "text": "Even though I have had two COVID-19 vaccinations and the booster, I am aware I can still get the virus and pass it on to others. However, getting vaccinated has given me the reassurance I may not get as poorly as I might have done otherwise."
        },
        {
            "text": "People are often scared of the unknown and there was a lot of talk about a perceived lack of testing of the vaccine. Some said they didn’t want to put something into their body that they were unsure about, but how many of us has actually seen the test results on other vaccines or medicines we put in our bodies?"
        },
        {
            "text": "There was no doubt in my mind, when the booster came out, I was going to have it. The thought of contracting COVID-19 is very scary as is the possibility I may pass it on to someone vulnerable who hasn’t had the vaccine."
        },
        {
            "text": "It is a matter of choice, but if that choice is between life and death, I’ll choose the former."
        }
    ]
}