{
    "url": "https://deframedia.blog.gov.uk/2023/08/11/environment-secretary-holds-roundtable-on-improving-the-river-deben/",
    "title": "Environment Secretary holds roundtable on improving the River Deben",
    "authors": [
        "Defra Press Office"
    ],
    "categories": [
        "water",
        "Weekly stories"
    ],
    "pub_date": "2023-08-11T11:05:13+01:00",
    "content": [
        {
            "text": "Environment Secretary Thérèse Coffey and Water Minister Rebecca Pow met with local community groups, environmental regulators, farming representatives, water company representatives and local councillors in Suffolk this week (Thursday 10 August 2023) to discuss actions to improve the River Deben."
        },
        {
            "text": "There is positive regional coverage on BBC Radio Suffolk, BBC Suffolk Online and East Anglian Daily Times on the roundtable following an interview with the Environment Secretary."
        },
        {
            "text": "The roundtable, chaired by the Secretary of State and the Water Minister, provided a forum for local partners to raise concerns and explore solutions to improve the health and sustainability of the river and to discuss delivery of the Plan for Water, which will bring increased investment, tougher enforcement and tighter regulation to the water sector."
        },
        {
            "text": "Key areas of discussions included the designation of bathing sites in the area; pollution resulting from storm overflows, wastewater treatment and agriculture and water resources. They also covered how these issues may be addressed through river catchment plans, targeting actions where they will deliver the greatest impact for water quality, flood management, and nature recovery."
        },
        {
            "text": "Environment Secretary Thérèse Coffey said:"
        },
        {
            "text": "Water Minister Rebecca Pow said:"
        },
        {
            "text": "The meeting is part of a series of local conversations to improve water quality and increase water supply at rivers across England."
        }
    ]
}