{
    "url": "https://hodigital.blog.gov.uk/2023/08/11/our-digital-career-development-programme-fast-track-your-digital-career/",
    "title": "Our Digital Career Development Programme: Fast-track your digital career",
    "authors": [
        "Stephanie Longden, Interaction Designer"
    ],
    "categories": [
        "Digital Career Development Programme",
        "Recruitment"
    ],
    "pub_date": "2023-08-11T10:12:44+01:00",
    "content": [
        {
            "text": "Our Digital Career Development Programme is now open. Apply for the following roles at the links below: "
        },
        {
            "text": "Junior User Researcher (closes 18 August) "
        },
        {
            "text": "Accessibility Consultant (closes 18 August) "
        },
        {
            "text": "Junior Automation Developer (open to Home Office employees, closes 18 August) "
        },
        {
            "text": "DevOps Associate (closes 20 August) "
        },
        {
            "text": "Associate Developer (closes 20 August) "
        },
        {
            "text": "Product Manager (closes 20 August) "
        },
        {
            "text": "IT Operations (closes 21 August) "
        },
        {
            "text": "Junior Interaction Designer (closes 21 August) "
        },
        {
            "text": "Junior Service Designer (closes 21 August)"
        },
        {
            "text": "Associate Content Designer (closes 21 August) "
        },
        {
            "text": "The Home Office Digital Career Development Programme (DCDP) offers an 18-month paid accelerated learning experience to those with a passion for user-centred digital services.  "
        },
        {
            "text": "The programme is designed for graduates, or individuals with some digital experience, but who have not had the chance to work in a large government organisation like the Home Office.  "
        },
        {
            "text": "Learners follow a structured learning and development path, tailored to enhance their chosen role, with access to senior mentors, project rotations and recognised qualifications. After the first 12 months (sometimes earlier), learners will be able to apply for a permanent position at the Home Office.  "
        },
        {
            "text": "Salaries for DevOps, Developer, Interaction Design, Service Design and User Research roles are £32,000 (National, minimum) and £36,000 (London, minimum). Salaries for Accessibility Consultant, Content Design, IT Operations and Product Manager roles are £25,750 (National, minimum) and £29,750 (London, minimum).  "
        },
        {
            "text": "Stephanie Longden secured a permanent position as a Junior Interaction Designer within a year of starting the DCDP. She’s since been promoted to Interaction Designer. She tells us more about her experiences on the programme below.  "
        },
        {
            "heading": 2,
            "text": "My pathway into a digital career "
        },
        {
            "text": "I discovered my passion for User Experience (UX) design while creating a website in a previous role at an Arts charity. I then studied UX design on an evening course. "
        },
        {
            "text": "I knew I wanted to pursue a career in designing digital products. The DCDP seemed tailor-made for me. I was keen to learn from experienced designers while being well guided and supported by a dedicated team. My project mentors have helped me understand my role and team and my career mentor has supported me in achieving my long-term goals.  "
        },
        {
            "text": "I’ve really enjoyed working on both internal and public-facing projects, and in the process have learnt a lot about the challenges of the different phases of project delivery. "
        },
        {
            "heading": 2,
            "text": "Dedicated time for learning and development "
        },
        {
            "text": "The programme is committed to learning and development. I’ve been able to carve out time to attend training and learn new coding skills. I’ve particularly enjoyed working on a project for a charity with my team where I developed my leadership skills and thrived on the challenge of designing a new app in a short period of time.   "
        },
        {
            "heading": 2,
            "text": "Many opportunities to work on interesting projects "
        },
        {
            "text": "My first placement on the DCDP was in the Police and Public Protection Technology Portfolio. I designed an internal case management system. I learnt how to prototype using the GOV.UK Prototype Kit and how to work in an agile delivery team of user-centred designers.  "
        },
        {
            "text": "In my second placement in the Migration and Borders Technology Portfolio I created a web and app journey for a public-facing service. I created user journeys to understand where services needed to be improved.  "
        },
        {
            "heading": 2,
            "text": "Clear pathways for promotion  "
        },
        {
            "text": "It’s possible to apply for a permanent position in the Home Office while on the DCDP. I applied to become a Junior Interaction Designer as soon as I was ready.   "
        },
        {
            "text": "I’ve continued to learn new skills and take on greater design responsibility. I’ve contributed patterns to the Home Office Design System, undertaken agile courses and attended industry events such as UX London and a Women in Tech conference.  "
        },
        {
            "text": "The programme and the broader community have provided me with invaluable support - I’ve recently been promoted to Interaction Designer! There are incredible prospects for growth and development in Digital Data and Technology at the Home Office and I’m excited to continue my journey here.  "
        }
    ]
}