{
    "url": "https://supportingfamilies.blog.gov.uk/2023/08/11/starting-well-in-stockport-an-integrated-early-years-model/",
    "title": "Starting Well in Stockport: An integrated early years model",
    "authors": [
        "ballypahal"
    ],
    "categories": [
        "Data Sharing",
        "Early Help",
        "Education",
        "Employment",
        "Evaluation",
        "Health",
        "Multidisciplinary Teams",
        "News",
        "Policy links",
        "Reducing Parental Conflict",
        "Transformation"
    ],
    "pub_date": "2023-08-11T12:19:56+01:00",
    "content": [
        {
            "text": "Stockport Metropolitan Borough Council has invested in developing an integrated Start Well model which brings together services that work with families to support children’s development from pre-birth to 5 years and help them to get ready for school. Start Well teams work together with other services to make sure that all children in Stockport receive the right support at the right time to help their early development. Local Start Well teams are made up of health visitors and early years workers. Family Help coordinators also undertake work with families who require a ’team around the family,’ or a set of services coordinated together to support the whole family. This can include families who need more complex early help assessments and support. This means that whole family working, rather than one service working with different family members at a time, is a key part of the approach."
        },
        {
            "text": "The Start Well team structure as part of Stockport Family "
        },
        {
            "text": "The Start Well team is part of a Stockport-wide local system of help for families with a spectrum of needs. Unique to Stockport is the leadership, management structure and delivery of the Start Well model. Start Well operates under joint governance arrangements between Stockport Council and Stockport NHS Foundation Trust with an overarching twin ambition of improving child development outcomes and school readiness outcomes at reception age."
        },
        {
            "text": "          "
        },
        {
            "text": "Of particular concern locally is the health inequality in Stockport that means children in the most disadvantaged areas have much poorer outcomes than those from affluent communities. The model provides support to families and undertakes early identification of babies and children’s developmental needs. Alongside the Start Well approach is a Family Help service delivery model in Stockport which is a 0-19 early help model of Family Help coordinators who support early help. They support the coordination required at an early help level through early help assessment for the increasing complexity in need for many babies and their families on Health Visitors’ named caseloads. We work closely with our Children’s Social Care colleagues, and a dedicated vulnerable children’s safeguarding team managed by the Stockport Foundation Trust supports health visitors, school nurses and FNP nurses in their safeguarding supervision."
        },
        {
            "text": "In this Start Well integrated structure, Band 7 health and early years team leaders manage Start Well teams, overseen in a neighbourhood model by Locality Leads who are either health or council staff. Stockport’s children’s centre (Start Well) offer is coordinated through these Band 7 health leads. Families in Stockport are supported by one of 44 Band 6 named Health Visitors rather than cases being held centrally in a corporate system. These Health Visitors are supported by a small group of Band 5 nurses – many of whom are gaining experience and skills on their journey to applying for Specialist Community Public Health Nurse (SCPHN) qualifications."
        },
        {
            "text": "A group of Band 4 Early Years workers (traditionally nursery nurses) support this skills mix. Band 3 Administration Assistants keep the team’s daily business, diary and office management requirements running smoothly."
        },
        {
            "text": "The integration of coordinating, nursing and early years roles allows Health Visitors to lead universal and targeted work. It also provides career progression opportunities for early years workers (council and health) into Family Help coordinator roles, for nurses into SCPHN qualification and Health Visitors into team leader or specialist roles and onwards. Stockport are also currently looking at options to develop apprenticeships for Family Help Coordinators."
        },
        {
            "text": "This structure is overseen by three Band 8A Locality Leads and one 8A Governance lead. Locality leads come from different background disciplines in council early years and health visiting. They work jointly under agreed Start Well managerial arrangements which sit across both NHS and local authority services. Start Well has a suite of bespoke job descriptions that draw on both health and early years skills to reflect the integrated work being undertaken, however the team’s staff remain under separate accountability arrangements according to their discipline."
        },
        {
            "text": "There is a rolling programme of shared e-learning for NHS and local authority staff from a ‘learning pool’ offer, while different tiers of specialist training are on offer through a Stockport’s competency framework. This framework sets out both core and specialist skills elements that relate to perinatal mental health, public health nursing and more, in a modular approach. Stockport aims to ‘reclaim universalism’ for all staff, training a varied workforce that is confident and competent to deliver for families."
        },
        {
            "text": "Wider partnerships and principles of practice "
        },
        {
            "text": "The Start Well offer links closely to the Stockport’s borough-wide services. Specialist children’s therapy services, SEND, midwifery and education services are close collaborators with Start Well. Services like Children’s Social Care, those delivering evidence-based parenting courses, and local community organisations are all trusted partners. Stockport has a system-wide model of restorative practice which is recognised by all, which helps to bind different professional principles and priorities together under a common understanding. Stockport have also recently established a Start Well and Family Hub workforce development manager to support the integration of the models locally."
        },
        {
            "text": "‘Continuity of care’ is central to Stockport’s offer. Family Help Coordinators works alongside the Health Visitor to offer and complete early help assessment where family needs require more coordination of care. They provide a plan of care with the family to ensure the right support is given at the right time, through the delivery of evidence-based interventions in a group and family home setting. Health Visitors are the overall accountable practitioner to oversee this work and provide assessment and care."
        },
        {
            "text": "Conversations with other parts of the local system for babies routinely take place with partners like Children’s Social Care or within the wider Greater Manchester perinatal mental pathway. These conversations are to identify whether intervention can continue to be supported at the local level or whether a family requires an additional specialist (for example in safeguarding or psychotherapeutic support) to join their plan."
        },
        {
            "text": "This approach is underpinned by the Greater Manchester early years delivery model which is an eight-stage pathway designed to increase the number of children who are ready for school. By making the best use of resources, Greater Manchester Combined Authority aims to improve outcomes for all children in their early years and close the gap in performance for the Early Years Foundation Stage Profile between all children and the bottom 20%. Start Well is an integral part of this overarching ambition in Stockport."
        }
    ]
}