{
    "url": "https://companieshouse.blog.gov.uk/2023/08/11/understanding-the-roles-of-board-members/",
    "title": "Understanding the roles of board members",
    "authors": [
        "Stephen Conmy - Head of Content, The Corporate Governance Institute"
    ],
    "categories": [
        "Company guidance"
    ],
    "pub_date": "2023-08-11T11:07:12+01:00",
    "content": [
        {
            "text": "A board of directors is meant to provide strong governance to organisations, including non-profits."
        },
        {
            "text": "Board members (directors) should be able to give valuable insights into the various aspects of running a business, such as:"
        },
        {
            "text": "Board members are expected to act in the company’s best interests and align the interests of shareholders and managers."
        },
        {
            "heading": 2,
            "text": "A board of directors"
        },
        {
            "text": "An elected board of directors is a group of individuals responsible for the strategic management of a company or organisation. The board should meet at least 4 times a year to set policies for management."
        },
        {
            "text": "It’s a legal requirement for public companies to have a board of directors, but many non-profit organisations also have boards of directors."
        },
        {
            "heading": 2,
            "text": "The titles and descriptions of board members"
        },
        {
            "text": "The number of members on a board depends on many factors, including the:"
        },
        {
            "heading": 3,
            "text": "Chair of the board"
        },
        {
            "text": "The chair is the highest-ranking person on the board. Since they’re responsible for leading large teams of people, this individual must be a strong leader. Chairs work closely with the chief executive officer (CEO) to make sure board resolutions are carried out."
        },
        {
            "text": "The chair is also responsible for:"
        },
        {
            "text": "In line with their country’s company’s law, the chair:"
        },
        {
            "text": "They work alongside CEOs and executive directors to shape an organisation’s culture."
        },
        {
            "heading": 3,
            "text": "Vice-chair"
        },
        {
            "text": "Generally, the vice-chair serves directly under the chair. They support the chair in performing their duties and responsibilities. They also perform the chair’s duties when the chair is absent, so they must be capable of handling the role of acting chair effectively."
        },
        {
            "text": "Working closely with the board chair and CEO, vice chairs help with:"
        },
        {
            "text": "They may be asked to resolve any conflicts of interest that arise on the board."
        },
        {
            "heading": 3,
            "text": "Company secretary"
        },
        {
            "text": "Company secretaries are responsible for administrative, communication, and legal compliance tasks."
        },
        {
            "text": "It's the main responsibility of the company secretary to record, document, and distribute meeting minutes, which serve as a record of the discussion and any votes taken. They’re also responsible for keeping these records safe and accurate."
        },
        {
            "text": "The secretary keeps track of the organisation’s activities to make sure all actions conform to company law. Their responsibility usually includes notifying all members and stakeholders of regularly scheduled and additional meetings."
        },
        {
            "heading": 3,
            "text": "Board members – executive directors and non-executive directors"
        },
        {
            "text": "Two different types of directors sit on boards: those who are part of the executive management team and those who are independent, non-executive directors."
        },
        {
            "text": "Non-executive directors should serve on boards as ‘critical friends’. They’re there to act as unbiased advisors, giving objective advice to the board."
        },
        {
            "text": "Directors who do not hold one of the previously mentioned positions often volunteer to serve as committee chairs. Committee meetings are held where motions can be made and matters of the board are discussed and voted on."
        },
        {
            "text": "A typical board of directors has 9 members, but some have 3, and others have 31. Typically, private companies have between 3 and 7 directors on their boards. To avoid voting ties, boards are usually an odd number."
        },
        {
            "heading": 2,
            "text": "The responsibilities of a board member"
        },
        {
            "text": "Director duties and responsibilities typically include:"
        }
    ]
}