{
    "url": "https://gfie.blog.gov.uk/2020/10/22/going-beyond-a-lived-experience/",
    "title": "Going beyond a Lived Experience.",
    "authors": [
        "Lisa Jackson"
    ],
    "categories": [
        "connect",
        "Ex-offenders",
        "Inclusion",
        "Life Chances",
        "Prison Leavers",
        "Social mobility"
    ],
    "pub_date": "2020-10-22T18:56:42+01:00",
    "content": [
        {
            "text": "Walking out of the prison gate, there is often a lot to take in. Prison leavers need to think about where they are going to live following their release, what they need in order to move forward with their new life (such as valid ID, which can be a barrier to accommodation and employment) and also how they are going to resettle into the community. "
        },
        {
            "text": "For many, there is also the question of employment - how am I going to earn a living, and make a contribution to society? "
        },
        {
            "text": "Similarly, if you don’t serve time in prison, but instead receive a community sentence, you must apply for roles in the knowledge that your unspent conviction is unspent and could lead to future rejection."
        },
        {
            "text": "It is always difficult and nerve-wracking to apply for a job - you are putting yourself out there to be judged and assessed. Having an unspent conviction on your criminal record means that applying for roles can bring with it fears and doubts about how you will be treated by potential employers, or whether your background will act as a barrier to hiring you. Many employers, including the Civil Service, have signed up to initiatives such as Ban the Box, which aim to reduce the stigma faced by ex-offenders during the recruitment process."
        },
        {
            "text": "We know that people with convictions can be unemployed following their sentence for a number of reasons, whether that’s because of barriers they face when applying for roles or their own personal barriers, such as confidence. Prison leavers have much lower levels of employment than the general population. Approximately 17% of prison leavers in 2011/12 were in employment one year after release, and much of this work is part-time or at very low wages (Gov.uk).  Yet the opportunity of meaningful employment could be the turning point that someone needs in order to make a change to their lives, for the better."
        },
        {
            "text": "In a previous blog, we explained how we partner with New Futures Network to match prison leavers to suitable Civil Service roles. "
        },
        {
            "text": "We are now excited to announce that we are expanding these life chance opportunities further into the community, to those who have left prison within 2 years and remain on licence, or whom are being supervised by Probation services following a community sentence. "
        },
        {
            "text": "By opening up our GFiE opportunities even further, our reach extends to a wider range of people, and this brings benefits both to the Civil Service through an increased pool of candidates with a broader range of skills and experiences and also to the people who want to overcome their individual barriers to start a new opportunity with the Civil Service. "
        },
        {
            "text": "As Going Forward into Employment continues to build on its success by developing new life-chance opportunities, promoting social mobility and challenging perceptions, we are looking for forward-looking sponsors who are keen to support the Diversity & Inclusion strategy by providing work opportunities to support those who are unemployed following a conviction. "
        }
    ]
}