{
    "url": "https://ipa.blog.gov.uk/2023/04/24/a-day-in-the-life-leadership-learning-coordinator/",
    "title": "A day in the life - IPA Leadership and Learning Coordinator",
    "authors": [
        "Lyle Anderson"
    ],
    "categories": [
        "Construction",
        "Infrastructure",
        "Major Projects Leadership Academy"
    ],
    "pub_date": "2023-04-24T14:45:40+01:00",
    "content": [
        {
            "text": "Lyle Anderson tells us about a typical day as a Leadership and Learning Coordinator and why he chose to work in government learning and development."
        },
        {
            "text": "I am a Leadership & Learning Coordinator at the Infrastructure and Projects Authority (IPA) and joined the organisation in September 2019. My team manages the delivery of our project delivery leadership development programmes, including the Major Projects Leadership Academy (MPLA), Project Leadership Programme (PLP) and Orchestrating Major Projects (OMP)."
        },
        {
            "text": "What is a Leadership & Learning Coordinator?"
        },
        {
            "text": "As Leadership and Learning Coordinator, my role is to ensure that the PLP, MPLA and OMP programmes are delivered to a high standard, and support the learning and development of the government project delivery profession. "
        },
        {
            "text": "I also work on the procurement and mobilisation of new contracts for the PLP, MPLA and OMP, that look to refresh and develop existing and new content."
        },
        {
            "text": "Why did you choose learning and development? "
        },
        {
            "text": "Prior to the IPA, I worked for the NHS as a domestic assistant in a local trust, before moving into roles supporting the delivery of leadership development programmes for NHS staff across the country. I then moved into a small project team within Cabinet Office/IPA to procure the contracts for the PLP, MPLA and OMP, and more recently was appointed in the service delivery role."
        },
        {
            "text": "I enjoy working in learning and development as it enables me to speak to a variety of people across the public sector, gaining knowledge and insights into how they work."
        },
        {
            "text": "Describe a typical day? "
        },
        {
            "text": "I wake up at 7am and get ready for work, then I feed my cat before he starts shouting at me. On this day, I was working from home. At the IPA, we operate under hybrid working to allow staff the flexibility of the benefits of home working, while still having an office base. "
        },
        {
            "text": "My day began with responding to emails in our MPLA inbox. The MPLA is the IPA’s flagship programme, aimed primarily at developing the skills of senior responsible owners and directors of projects on the Government Major Project Portfolio. Our Leadership & Learning Support Team handle the day to day enquiries, however, some of the more complex enquiries had been flagged that the support team can’t resolve and require my response."
        },
        {
            "text": "I then spent the rest of the morning attending a workshop on one of our programmes - something I really enjoy about the role is the opportunity to observe different learning interventions. The workshop was around different thinking styles of leaders. During the workshop we discussed the variation of each other’s results. This ranged from whether we were more adaptive (prefer to improve on current systems, respect rules and norms and get stuck into the detail) or more innovative (like to break the mould, challenge the rules and look at the bigger picture). This was valuable learning and something that I can take back into my role."
        },
        {
            "text": "In the afternoon, I put together some data for a government department who wanted information on the total number of participants that had enrolled and graduated from our programmes. Following this, I had a meeting with my line manager to look at the participant feedback on our programmes to check if there were any areas for improvement - we regularly look at this to ensure the programmes are providing the learning that participants need."
        },
        {
            "text": "I then began forward planning the applications for our next cohort of the MPLA by blocking out time for my team to sift and review, before organising the admissions panel between the Oxford Saïd Business School Programme Director and the IPA Director of Function, Profession and Standards, Karina Singh."
        },
        {
            "text": "At the end of the day, I had a meeting with one of our suppliers to discuss how we could streamline the application process for our programmes. I finished by organising my inbox ready for the following day. "
        },
        {
            "text": "What’s the best thing about working for the IPA?"
        },
        {
            "text": "Working in the IPA, I’ve been able to develop my knowledge and understanding of project delivery within government and the wider public sector. This has enabled me to pick up more challenging work, while also leaving me feeling that I’m making a positive impact on the professional capabilities of the Civil Service and wider public sector."
        },
        {
            "text": "Does a role in learning and development appeal to you? The IPA Function, Profession and Standards (FP&S) team is recruiting a Leadership and Learning Support role. Click here to find out more. "
        },
        {
            "text": "To learn more about the IPA, click here. "
        }
    ]
}