{
    "url": "https://insolvencyservice.blog.gov.uk/2023/04/24/a-z-of-terms-used-in-bankruptcy/",
    "title": "A – Z of terms used in bankruptcy",
    "authors": [
        "mediaofficer"
    ],
    "categories": [
        "Bankruptcy"
    ],
    "pub_date": "2023-04-24T09:45:30+01:00",
    "content": [
        {
            "text": "If you can’t pay your debts, there are various solutions that can help, ranging from: informal solutions like a consolidation loan or a debt management plan to formal like a debt relief order, individual voluntary arrangement (IVA) or bankruptcy."
        },
        {
            "text": "One way of dealing with debt is bankruptcy."
        },
        {
            "text": "Bankruptcy can be an option that some people choose as a solution for dealing with problem debt. In some cases, bankruptcy can be a route that is brought about as a solution by a person’s creditors – that is, the people or organisations to whom you owe money – can apply to make you bankrupt, rather than it being your choice."
        },
        {
            "text": "In our bankruptcy blogs we’ve been taking a look at the fears, facts and features of bankruptcy as a choice of solution by someone in debt, to help you understand whether it might be the right or wrong way out of debt for you."
        },
        {
            "text": "Here we provide an A-Z overview and definition of the common terms you may often hear associated with bankruptcy."
        },
        {
            "heading": 3,
            "text": "A"
        },
        {
            "heading": 4,
            "text": "Adjudicator"
        },
        {
            "text": "A government official who works for the Insolvency Service, and whose role is to review people’s bankruptcy applications and decide whether you can be made bankrupt. The Adjudicator is not a judge but he can make a bankruptcy order like a judge."
        },
        {
            "heading": 4,
            "text": "Assets"
        },
        {
            "text": "Anything that you own or have a financial interest in. This includes your house or flat if you are a homeowner. It also includes your car and any money that might be owed to you including a claim for compensation. Your assets could be sold to pay off your debts as part of the bankruptcy. Certain assets can be exempt from being sold, including essentials such as household equipment, furniture, bedding, clothes and tools/equipment needed for your job."
        },
        {
            "heading": 3,
            "text": "B"
        },
        {
            "heading": 4,
            "text": "Bankruptcy Order"
        },
        {
            "text": "An order made by the Court or the Adjudicator, stating that a person has been made bankrupt."
        },
        {
            "heading": 4,
            "text": "Bankruptcy restrictions"
        },
        {
            "text": "These are things you are not allowed to do when you’re bankrupt, including borrowing £500 or more without letting the lender know you’re bankrupt, running or managing a company or working as an insolvency practitioner."
        },
        {
            "text": "If you are self-employed or are going to start your own business (sole trader), you must use the same name(s) the bankruptcy order was made in. Or you must clearly show that name in all correspondence, invoices or advertising. It’s a criminal offence to break the restrictions and you might be prosecuted if you do."
        },
        {
            "text": "The restrictions last until the end of your bankruptcy (discharge) which usually happens after 12 months. However, restrictions can be extended beyond the end of your bankruptcy if you don’t carry out your duties as a bankrupt or are found to have acted carelessly or dishonestly. The restrictions will be extended by you signing a bankruptcy restrictions agreement or the court making a bankruptcy restrictions order."
        },
        {
            "heading": 3,
            "text": "C"
        },
        {
            "heading": 4,
            "text": "Citizens Advice"
        },
        {
            "text": "A network of independent charities offering free and confidential advice, either in person, online or by phone. They offer advice to help you make the right choices for dealing with money issues."
        },
        {
            "heading": 4,
            "text": "Creditor"
        },
        {
            "text": "A person, company or other entity – to whom you owe a debt including certain debts due in the future. In bankruptcy, the Official Receiver will notify your creditors of your bankruptcy.  If you have sufficient assets, payments will be made from those assets by the trustee to your creditors."
        },
        {
            "heading": 4,
            "text": "Credit rating"
        },
        {
            "text": "A score system that lenders use to work out how reliable you are at paying back money. Bankruptcy affects your credit rating. It will stay on your credit file for six years after the bankruptcy order is made. The three main UK credit agencies are Equifax, Experian and TransUnion. A person’s credit rating can also be affected by other insolvency measures, such as Individual Voluntary Arrangements (IVAs), Bankruptcy Restriction (BRUs/BROs) and Debt Relief Restriction Orders (DRRUs/DRROs). In these cases, your details are listed on the Individual Insolvency Register until the measure ends."
        },
        {
            "heading": 3,
            "text": "D"
        },
        {
            "text": "Discharge"
        },
        {
            "text": "Officially being freed from bankruptcy restrictions and most of your bankruptcy debts. You will usually be discharged after 12 months. Discharge ends the bankruptcy restrictions, unless you are subject to a bankruptcy restrictions order or undertaking and releases you from most of the debts you had when the bankruptcy order was made. However, assets which you had when you were made bankrupt or claimed by your trustee during bankruptcy can still be used to pay debts once the bankruptcy has ended."
        },
        {
            "heading": 3,
            "text": "E"
        },
        {
            "heading": 4,
            "text": "Equity"
        },
        {
            "text": "The value of the property you own after deducting any secured debts (like a mortgage). If you jointly own your home the equity is usually split between the joint owners. Your interest in your home will be part of the bankruptcy and can be used to pay your creditors."
        },
        {
            "heading": 3,
            "text": "F"
        },
        {
            "heading": 4,
            "text": "Frozen bank accounts "
        },
        {
            "text": "When a bankruptcy is made, your bank accounts will most likely be frozen by the bank. You will not be able to access money in your bank account if it is frozen. This is because any money in your account may be an asset and may be claimed by the trustee. The trustee can ask the bank release some money for your daily living needs or to the other person if you are in a joint account.  The bank may keep the money if you owe other debts to them."
        },
        {
            "heading": 3,
            "text": "H"
        },
        {
            "heading": 4,
            "text": "Hearing for a bankruptcy order "
        },
        {
            "text": "In the past, you had to attend court to make yourself bankrupt. Since 2016 you no longer have to attend a hearing and can apply online to be made bankrupt."
        },
        {
            "text": "Your creditors may apply to court for a bankruptcy petition to make you bankrupt. In this case, there will be a court hearing, which you should attend. The judge may make a bankruptcy order at the hearing."
        },
        {
            "heading": 3,
            "text": "I"
        },
        {
            "heading": 4,
            "text": "Income Payments Agreement (IPA)"
        },
        {
            "text": "A payment – usually made monthly – which you make towards your debts if you earn enough to have money left over after paying your essential living costs. You could be asked to pay money towards your debts through an IPA, during and for up to three years after bankruptcy."
        },
        {
            "heading": 4,
            "text": "Income Payments Order (IPO)"
        },
        {
            "text": "A court order for payments towards your debts (if you can afford it) during your bankruptcy. Your trustee can apply for an IPO if you can’t agree on payment amounts for an IPA (see IPA, above). However, the court won’t make an IPO if it leaves you without enough money to meet reasonable everyday needs. If you do get an IPO and don’t meet the payments, the trustee can apply to extend your bankruptcy."
        },
        {
            "heading": 4,
            "text": "Individual Insolvency Register (IIR)"
        },
        {
            "text": "The Individual Insolvency Register shows details of people who are in formal arrangements (including bankruptcy) to deal with their debts in England and Wales. It also lists details of individuals who have extended bankruptcy restrictions or debt relief restriction. Anyone can search the insolvency register on the internet."
        },
        {
            "heading": 3,
            "text": "L"
        },
        {
            "heading": 4,
            "text": "London Gazette/The Gazette"
        },
        {
            "text": "Bankruptcies are published in The Gazette. The Gazette is the combination of three publications: The London Gazette, The Belfast Gazette and The Edinburgh Gazette. The Gazettes are official journals of record. The Gazette consists largely of statutory notices where there is a legal requirement to advertise an event or proposal in The Gazette."
        },
        {
            "heading": 3,
            "text": "N"
        },
        {
            "heading": 4,
            "text": "National Debtline"
        },
        {
            "text": "The National Debtline is a charity that provides free, impartial and confidential debt advice to people in England, Scotland and Wales. You can phone, webchat or use their Digital Advice Tool to get free debt advice from the charity’s expert debt advisers."
        },
        {
            "heading": 4,
            "text": "Nil tax code"
        },
        {
            "text": "HMRC will apply a ‘nil tax code’ (which will show as NT on your pay details) when you’re bankrupt. This tells your employer not to take any further income tax from your wages for the rest of the tax year (ending on 5 April). The extra money in your pay that results from this can be claimed by the trustee to form part or all of an IPA or IPO."
        },
        {
            "text": "The NT will not tell your employer you’re bankrupt as an NT can be applied for a number of reasons."
        },
        {
            "heading": 3,
            "text": "O"
        },
        {
            "text": "Official Receiver"
        },
        {
            "text": "A civil servant employed in the Insolvency Service and an officer of the court, who will manage at least the first stage of your bankruptcy. Official Receivers do not give debt advice, but will:"
        },
        {
            "text": "A person in bankruptcy has a legal duty to co-operate with the Official Receiver."
        },
        {
            "heading": 3,
            "text": "P "
        },
        {
            "heading": 4,
            "text": "Person at risk of violence (PARV) order"
        },
        {
            "text": "If having your address published will put you at risk of violence, you can apply to the court for a person at risk of violence (PARV) order. Your name will still be published, but your address will not be. You can apply for the PARV order before the bankruptcy order is made"
        },
        {
            "heading": 4,
            "text": "Petition"
        },
        {
            "text": "An application to the court for a person to be made bankrupt by their creditors. Creditors can present a bankruptcy petition to the court against someone who owes them £5,000 or more."
        },
        {
            "heading": 3,
            "text": "R"
        },
        {
            "heading": 4,
            "text": "Realise assets"
        },
        {
            "text": "This means to sell your assets to raise money to pay your debts to your creditors. Your trustee will realise your assets as part of their duties to pay your creditors."
        },
        {
            "heading": 3,
            "text": "T"
        },
        {
            "heading": 4,
            "text": "Trustee"
        },
        {
            "text": "Someone who manages the bankruptcy. The assets transfer to the trustee who collects or sells them to make payments to creditors. The Official Receiver can act as trustee, but trustees can also be private sector insolvency practitioners – usually accountants or solicitors – who are authorised by a regulator. A person in bankruptcy has a legal duty to co-operate with the trustee."
        },
        {
            "heading": 3,
            "text": "V"
        },
        {
            "heading": 4,
            "text": "Vested assets"
        },
        {
            "text": "The assets that belonged to you, but whose ownership has now passed to your trustee. These do not include exempt belongings that you need for essential household and day-to-day living."
        },
        {
            "text": "Remember: It is important to seek free debt advice from a money adviser before making any decision on problem debt solutions."
        },
        {
            "text": "You can find out where to find free, expert debt advice here."
        }
    ]
}