{
    "url": "https://ukhsa.blog.gov.uk/2023/04/24/protecting-your-children-through-vaccination/",
    "title": "Protecting your children through vaccination",
    "authors": [
        "Vanessa Saliba"
    ],
    "categories": [
        "immunisations"
    ],
    "pub_date": "2023-04-24T09:14:27+01:00",
    "content": [
        {
            "text": "Vaccines save lives. They prevent around three million deaths worldwide every year and the World Health Organization states that after clean water, vaccination has the greatest impact on health globally."
        },
        {
            "text": "In the UK, we are incredibly fortunate to be able to offer our children the best protection against serious and life-threatening infections through our routine childhood immunisations. The immunisation programme is designed to offer us the best protection throughout our lives, with more vaccines such as shingles and flu offered to our elderly population now."
        },
        {
            "heading": 2,
            "text": "The NHS vaccine programme"
        },
        {
            "text": "The NHS vaccination programme is a world-leader and designed to protect us throughout our lives, for free."
        },
        {
            "text": "When you have a baby, keeping them safe and well is a priority. Vaccination is one of the most important things we can do to protect their health, and shortly after they are born, you’ll be given information about their first immunisations, which take place when the baby is 8 weeks old."
        },
        {
            "text": "These first jabs protect against a number of infections that can cause pneumonia, meningitis and sepsis. The vaccines offered to babies and toddlers protect them from serious illness such as whooping cough and diphtheria that used to cause so much suffering to families, but thanks to immunisation are now rare."
        },
        {
            "text": "As your child gets older, they’ll be offered more appointments to get vaccinated, right up until they are teenagers. When they are little, these tend to be done at their GP surgery, but as they grow up some vaccines will be offered at school. It’s important to look out for and return consent forms for vaccines that are given at school."
        },
        {
            "text": "The full childhood immunisation programme protects your child against many different illnesses. It’s best to have vaccines on time, but you can still catch up on most vaccines if you miss them. You can see the full schedule here, and if you are concerned that your child, or any family member, has missed out on certain vaccines you can speak to your GP practice about catching up. You can also use your child’s red book to look back at which vaccines they have received and if there are any gaps."
        },
        {
            "heading": 2,
            "text": "Keeping each other safe"
        },
        {
            "text": "We now see far less cases of some very nasty infections that used to cause a lot of suffering and death, such as whooping cough, rubella and polio. However, the key to keeping cases low, controlling outbreaks and keeping our children well is to ensure they are vaccinated."
        },
        {
            "text": "By vaccinating your child you give them protection, but this also helps to build herd immunity and protect others who may not be able to get vaccinated or have weaker immune systems."
        },
        {
            "text": "Remember that your child will be offered vaccines into their teenage years, with the HPV vaccine, the teenage booster (Td/IPV - offering protection from tetanus, diphtheria, and polio) and MenACWY vaccines offered to adolescents in schools."
        },
        {
            "text": "When your child grows up and enters into new environments, such as university, they mix with a new, wide group of people and can be more at risk of some infections. Keeping up with the full vaccination schedule and ensuring your child has caught up with any missed vaccines can help to keep them well as they go off and build their adult lives."
        },
        {
            "text": "More information"
        },
        {
            "text": "The NHS website has lots of information about the free vaccines on offer. By clicking on each vaccine you can see detailed information about it, such as safety, side effects and catching up on missed doses."
        }
    ]
}