{
    "url": "https://defrafarming.blog.gov.uk/2022/12/06/apply-for-a-slurry-infrastructure-grant/",
    "title": "Apply for a Slurry Infrastructure grant",
    "authors": [
        "Thomas Proudfoot"
    ],
    "categories": [
        "Payments for equipment, technology and infrastructure"
    ],
    "pub_date": "2022-12-06T11:19:23+00:00",
    "content": [
        {
            "text": "A fortnight ago, we made full guidance for the new Slurry Infrastructure grant available on GOV.UK.  "
        },
        {
            "text": "I said I’d blog again when it was time to apply. I’m pleased to say that the first round is now open for applications and it will stay open until 31 January 2023.  "
        },
        {
            "text": "Before applying, take a look at the guidance. It sets out who can apply, what the grant can pay for and the information you’ll need to provide when you apply. "
        },
        {
            "heading": 2,
            "text": "A recap of the application process "
        },
        {
            "heading": 3,
            "text": "1. Online checker"
        },
        {
            "text": "The first stage of the applications process is an online checker. You can find it on the Slurry Infrastructure grant page on GOV.UK. "
        },
        {
            "text": "We developed the checker to give you an easy way of checking you’re eligible for a grant and how much funding you could get. The checker also tells Defra how many farmers want a grant and the size of projects across the country. "
        },
        {
            "text": "This helps us control how many people we invite to submit a full application in this round. It also means you won't waste time filling in an application if we can’t prioritise you in this round. "
        },
        {
            "text": "As you use the checker, it's important to be as accurate as you can about your slurry storage needs and project plans.  "
        },
        {
            "text": "The Rural Payments Agency (RPA) and the Environment Agency have created guidance to help plan your slurry storage. "
        },
        {
            "text": "Once the online checker closes, the RPA will look at how many projects can be funded.  If the scheme is oversubscribed, RPA will identify which applications have a higher environmental benefit based on the priority areas shown in MAGIC."
        },
        {
            "text": " This will be based on location and proximity to areas where action is most needed to reduce pollution from agriculture."
        },
        {
            "text": " You can read about how we’ll do this in detail. You can still apply for the scheme even if you are not within these priority areas. "
        },
        {
            "heading": 3,
            "text": "2. Full application"
        },
        {
            "text": "Those invited to make a full application will need to submit details about their project.   "
        },
        {
            "text": "It's important that you don’t start your project until you’ve made a grant funding agreement with the Rural Payments Agency. "
        },
        {
            "text": "You can, for example, get quotes and apply for planning permission, but you cannot pay for any eligible items or start construction. "
        },
        {
            "text": "Full details about what you can and can’t do are available on GOV.UK. "
        },
        {
            "text": "If you aren’t ready to apply for a grant this round don’t worry, there will be more opportunities to apply. "
        },
        {
            "heading": 2,
            "text": "Join our webinar"
        },
        {
            "text": "If you want to know more before applying, register to attend our live webinar tomorrow: Wednesday 7 December 2022 at 2:30pm."
        },
        {
            "text": "I’ll be joined by colleagues from Defra, RPA, Environment Agency and Catchment Sensitive Farming to answer your questions.  "
        },
        {
            "text": "If you can’t attend, we’ll post a link to the recording in this blog post as soon as it’s ready.  "
        }
    ]
}