{
    "url": "https://educationhub.blog.gov.uk/2022/12/06/how-we-are-supporting-schools-and-colleges-to-be-energy-efficient/",
    "title": "How we are supporting schools and colleges to be energy efficient",
    "authors": [
        "mediaofficer"
    ],
    "categories": [
        "Uncategorized"
    ],
    "pub_date": "2022-12-06T00:02:20+00:00",
    "content": [
        {
            "text": "It’s important that schools and colleges are energy efficient so they can provide the best possible learning environments for young people, minimise operating costs and reduce carbon emissions."
        },
        {
            "text": "That’s why we’re investing £500million to help state schools and colleges with energy efficiency upgrades, helping to manage energy consumption and save on bills."
        },
        {
            "text": "Here’s how we are supporting schools and colleges to become more energy efficient."
        },
        {
            "heading": 3,
            "text": "How will schools and colleges be able to use this money?"
        },
        {
            "text": "Making investments to improve energy efficiency will help schools and colleges manage their costs. Schools and colleges will know their local circumstances best and can choose how to invest this funding to improve energy efficiency."
        },
        {
            "text": "For example, this money could be used to install better heating controls, insulation to reduce heat loss from pipes or switching to energy efficient lighting like LEDs."
        },
        {
            "text": "This funding comes on top of £1.8billion of capital funding already committed this year for improving the condition of school buildings, and the extra £2 billion revenue funding going to into our school budgets next year and the year after."
        },
        {
            "heading": 3,
            "text": "What other support are you providing?"
        },
        {
            "text": "Schools and colleges will continue to benefit from the Government’s Energy Bill Relief scheme over the winter months, reducing how much they need to spend on their energy and giving them greater certainty over their budgets."
        },
        {
            "text": "This support will run until March, in line with the support offered to the public."
        },
        {
            "text": "We have also published new guidance for schools and colleges to help them reduce energy usage and maximise energy efficiency this winter and beyond. It includes guidance on how to:"
        },
        {
            "text": "We also provide guidance for schools and those responsible for school buildings on managing energy and water use, undertaking capital projects and strategic estate management in good estate management for schools (GEMS)."
        },
        {
            "heading": 3,
            "text": "How else are you making sure the school estate is energy efficient?"
        },
        {
            "text": "Across the country, our School Rebuilding Programme will rebuild or refurbish buildings at 500 schools. These are prioritised according to the condition of the buildings. All new buildings in the programme will be energy efficient and designed to be net zero carbon in operation."
        },
        {
            "text": "We are also helping schools improve ventilation and so far, we have provided half of state-funded schools, nurseries, early years and further education settings in England with 386,000 carbon dioxide monitors in England, and 8,026 air cleaning units."
        },
        {
            "text": "From half-term onwards we will now be providing around 360,000 additional CO2 monitors for the remaining 50% of teaching spaces, to help balance ventilation with energy costs."
        },
        {
            "text": "You can find out more about what the department’s long-term plans to support schools to reduce their emissions by reading the department’s Sustainability and Climate Change strategy."
        },
        {
            "text": "From half-term onwards we will now be providing around 360,000 additional CO2 monitors for the remaining 50% of teaching spaces, to help balance ventilation with energy costs."
        }
    ]
}