{
    "url": "https://ukhodigital.blog.gov.uk/2022/12/06/the-importance-of-ocean-science-and-the-role-it-plays-in-shaping-uk-marine-policy/",
    "title": "The importance of ocean science and the role it plays in shaping UK Marine Policy",
    "authors": [
        "David Parker"
    ],
    "categories": [
        "Data Science"
    ],
    "pub_date": "2022-12-06T08:57:27+00:00",
    "content": [
        {
            "text": "Ocean Science is at the core of our day-to-day activity at the UK Hydrographic Office (UKHO). Our world renown experts harness the latest data science innovations and marine data insights to collect, process, verify and share the foundational data that measures and describes the physical features of the world’s oceans and coastal areas."
        },
        {
            "text": " At the UKHO we consider hydrography, or seabed mapping, to be the foundation data set essential for almost every activity undertaken in the marine domain. This includes safe and efficient maritime trade, securing our marine estate and critical national infrastructure, and helping to conserve and improve the health of our oceans."
        },
        {
            "text": " On Thursday 24 November, UKHO Chief Executive Peter Sparkes spoke and took part in a panel discussion at the Royal Society Ocean Science Policy Programme launch, on the importance of ocean science and the role it plays in informing policy. The Programme, established to support the UN Decade of Ocean Science, aims to provide early career marine researchers with insight, experience and networks into policy, and policymakers with evidence to inform UK marine policy."
        },
        {
            "text": "The UK Hydrographic Office role within government, providing the foundation data set essential for almost every activity undertaken in the marine domain. And as a member of the UK government Geospatial Commission, allows the UKHO the opportunity to work across government and with other public bodies to deliver better outcomes on a range of policy matters and support policymaking. These areas include national security, transport and trade, international development aid, and environmental and climate policy for safe, secure and thriving oceans."
        },
        {
            "text": "In his plenary Peter highlighted scientific evidence as a pre-requisite for good maritime policy and gave examples of how the foundational disciplines of hydrography, bathymetry and oceanography underpin existing policy and statutory monitoring. Sighting the Kiribati Outer Island Transport Infrastructure Project (KOITIP) and the Cayman Islands survey data to demonstrate how ocean science can provide impartial evidence-based advice on a range of issues."
        },
        {
            "text": "Peter also took part in a panel discussion alongside Gideon Henderson, Chief Scientific Advisor at the Department for Environment, Food and Rural Affairs and Lowri Griffiths, Head of the Oceans Policy unit at the Foreign Commonwealth and Development Office. They discussed, along with established experts and approximately 100 early career professionals in attendance, how scientists and policy makers can work together to develop science influenced policy for our oceans."
        },
        {
            "text": "Throughout the day representatives from UKHO attended workshops, with other ocean professionals, discussing improving collaboration and policy input. Giving the UK Centre for Seabed Mapping (UK CSM) as a working example of improving cross-sector policy collaboration."
        },
        {
            "text": "The UK CSM seeks to bring coherence to the seabed mapping community, optimising collection, improving management, enhancing access to and the sharing of publicly funded data, and championing a more integrated marine geospatial sector in the UK. The UK CSM is a key enabler in the new 'UK National Strategy for Maritime Security', is now a UK Government Voluntary Commitment to the 'United Nations Decade of Ocean Science', and supports policy makers, providing a unified voice with the ability to draw upon a wider network of stakeholders and enable meaningful cross-government coordination."
        },
        {
            "text": "Research to form policymaking is not without its challenges, but by cooperating to secure consistent funding, we can harness fresh thinking, technological innovation, and a collaborative spirit in pursuit of a better understanding of our oceans."
        }
    ]
}