{
    "url": "https://digitaltrade.blog.gov.uk/2022/12/06/the-civil-service-recruitment-process-explained-part-2/",
    "title": "The Civil Service recruitment process, explained: part 2",
    "authors": [
        "Helen Redmond, DDaT Resourcing Manager",
        "Anthony Coyne, Head of Data Science",
        "Michelle Brake, Digital Workplace Lead, Technology team",
        "Imogen Barker, Engagement and Strategic Adoption Officer"
    ],
    "categories": [
        "People"
    ],
    "pub_date": "2022-12-06T13:56:33+00:00",
    "content": [
        {
            "text": "The Civil Service recruits using a system called Success Profiles. This means for each role we advertise we consider what you will need to demonstrate in your application and interview for us to assess whether you will be successful in the job. This makes the interview process fair and straightforward to prepare for, gives us the best possible chance of finding the right person for the job, while improving diversity and inclusivity. Success Profiles is a ‘competency-based’ assessment framework. It assesses candidates against a combination of 5 elements – behaviours, experience, ability, technical skills and strengths.  "
        },
        {
            "text": "In the Digital, Data and Technology (DDaT) directorate, we have a specific DDaT Profession Capability Framework which lists the technical skills needed for each job. In this mini blog series, our DDaT recruitment team, recent hiring managers and joiners will explain the DDaT recruitment process and share tips for success at each stage. This blog focuses on technical assessments. Check out our previous blog to read more about nailing statements of suitability and the Civil Service behaviours. "
        },
        {
            "heading": 2,
            "text": "Technical assessments "
        },
        {
            "heading": 3,
            "text": "Helen Redmond, DDaT Resourcing Manager "
        },
        {
            "text": "Most interviews for roles in our DDaT directorate will have a section to assess your technical skills as the majority of DDaT roles require specialist skills and experience. These can be tested through questions, presentations or technical exercises during interview. For example, Software Developer or Data Analyst applicants have completed programming or coding assessments. Questions asked will encourage you to demonstrate your specific professional skills and knowledge related directly to the job role. Technical skills are marked out of 3 and you will be awarded a proficiency level. You can prepare for technical skills questions by reading the skills required for the role as listed on the Capability Framework page on GOV.UK. For example, see the skills needed to be an IT service manager.  "
        },
        {
            "heading": 3,
            "text": "A hiring manager’s perspective: Anthony Coyne, Head of Data Science and Data Analysis  "
        },
        {
            "text": "Candidates should try to familiarise themselves with the Capability Framework for the profession they are applying to as much as possible. For applicants who are already well established in their profession, a lot of the skills should be things you are comfortable talking about and answering questions on. However, it is important to understand that we don’t expect candidates to have the same skill level across all sections of the Capability Framework. Even the strongest candidates are usually better in some areas than others! For some skills, you might be able to brush up on or learn about ahead of the interview, while other technical skills might be trickier.  "
        },
        {
            "text": "The interview panel want you to do well, so it is important you try to give answers across all sections of the interview that reflect you at your best. If you completely give up on a section, the panel won’t be able to give you any marks, which affects your overall score. If you are unsuccessful in the interview there are only two real causes: either you did not have the relevant skills, or you did have the skills but did not fully demonstrate them during the process. "
        },
        {
            "text": "If the job advert talks about specific skills that are important for the role, you should try to bring them out in your application and interview. For example, a lot of data and technology roles in DDaT have Python as a requirement. If you don’t demonstrate your knowledge of Python in the interview and application, it is likely that you won’t be able to demonstrate you can carry out the role. "
        },
        {
            "heading": 3,
            "text": "Technical assessment tips from a recent joiner: Michelle Brake, Digital Workplace Lead, Technology team  "
        },
        {
            "text": "Before my interview, I read through the DDaT Capability Framework page on GOV.UK to familiarise myself with some of the expectations at “Lead” level. I made notes about experiences I had which I felt related to the listed capabilities.   "
        },
        {
            "text": "The panel made it clear when they were asking me a question relating to the Civil Service behaviours and when they were asking me a technical assessment question.  My technical assessment was a series of scenario-based questions. They were designed to check I had the relevant knowledge of technology, standards and processes needed to meet the requirements of the role. As the questions were asked, I made short notes to help me structure my answers. I would advise candidates to keep some paper handy and not be afraid to ask the panel to repeat the question if needed. "
        },
        {
            "text": "Traditional interviews focus on finding out about what you’ve done in the past. The technical assessment is a great opportunity to show what you can bring to the role moving forward. "
        },
        {
            "heading": 2,
            "text": "Top tips from our latest recruits "
        },
        {
            "heading": 3,
            "text": "Advice from a recent joiner: Imogen Barker, Engagement and Strategic Adoption Officer "
        },
        {
            "text": "Take the time to understand what is expected of you at each stage of the recruitment process and use this blog to help you. It is really important that you know what to prepare and how to plan your time. Consider why you are interested in working for DDaT and the specific role you are applying for. How can you reflect this in your statement of suitability? Think about what your interview will involve, such as behaviour questions, technical questions and the completion of a practical task. Working for DDaT is a great opportunity and preparing for the recruitment process is key to success! "
        }
    ]
}