{
    "url": "https://defradigital.blog.gov.uk/2022/12/06/volunteering-part-one-trees-and-canals/",
    "title": "Volunteering: Part one - trees and canals",
    "authors": [
        "Tom Metcalf",
        "Mat Banks",
        "Hannah Newbold, Defra Content Designer"
    ],
    "categories": [
        "Defra content design",
        "Defra digital",
        "User centred design"
    ],
    "pub_date": "2022-12-06T15:50:04+00:00",
    "content": [
        {
            "text": "To mark international volunteering day, Defra’s user centred design (UCD) team talk about what inspired them to take part in volunteering days and how they went. This is our first instalment of a two-part blog on volunteering."
        },
        {
            "text": "As civil servants, we have the opportunity to take paid volunteering leave each year. This year, the UCD team at Defra arranged team volunteering opportunities that colleagues could easily join. Our content designers tell us more and how it went."
        },
        {
            "heading": 2,
            "text": "Hannah Newbold at the Bow Locks"
        },
        {
            "text": "I particularly appreciated our team arranging these days, as it's something I’d always intended to do but didn’t know where to start."
        },
        {
            "text": "Inspired by watching the ‘canal boat diaries’ on BBC4, I chose to volunteer for the Canal & River Trust on the Bow Locks in Bromley-by-Bow, London. The Trust cares for a 2,000-mile-long, 200-year-old, network of canals, rivers, reservoirs and docks in the UK."
        },
        {
            "text": "I’ve always enjoyed being near water and looked forward to a day surrounded by nature and enhancing our waterways so others could enjoy them too."
        },
        {
            "text": "When the day came, my dream of enjoying the outdoors was slightly ruined by the fact it was pouring with rain. Dressed in my most comfortable and waterproofed clothes, I braved the weather."
        },
        {
            "text": "I’m glad I did, as I enjoyed meeting Defra UCD colleagues and other volunteers (all dressed for the weather)."
        },
        {
            "text": "The Trust provided us with life jackets (in case we fell in not for the rain) and the appropriate tools to do the jobs. We cleared the area of litter and cut back the vegetation. It was oddly satisfying to see all the rubbish in one place and not all over the canal paths."
        },
        {
            "text": "My experience with the Trust has really inspired me to do more. I’ve continued volunteering in my home village, clearing the countryside of litter. It’s a simple way we can all make a positive impact on our local environments."
        },
        {
            "heading": 2,
            "text": "Tom Metcalf at the Bridgwater and Taunton Canal"
        },
        {
            "text": "I must admit I’d never given much thought to how hedges are made until a couple of weeks ago."
        },
        {
            "text": "It turns out there’s a real art to it, and I was given a brief introduction during a day volunteering with the Canal & River Trust on the Bridgwater and Taunton Canal in Somerset."
        },
        {
            "text": "Under the careful supervision of two trust staff members, a colleague and I got to work hacking and sawing our way through a dense jumble of bushes, brambles and trees at the edge of a field."
        },
        {
            "text": "The trick is to cut most of the way through a tree’s trunk, near the base, then bend it over and weave it together with the others. This might sound damaging, but it actually creates a neat hedgerow which provides a habitat for wildlife and stops livestock escaping. As long as you don’t cut all the way through the trunk, the tree will keep growing."
        },
        {
            "text": "It was hard, physical work – my shoulders were certainly feeling it afterwards – but it was great being out in the fresh air and satisfying to look back on the progress we’d made at the end of the day."
        },
        {
            "text": "It’s fantastic that Defra gives us three days of volunteering leave a year to do things like this. The trust staff said they wouldn’t be able to do as much as they do without volunteers, and I was able to learn a new skill while making a small contribution to the environment."
        },
        {
            "text": "Next stop – the National Hedgelaying Championships!"
        },
        {
            "heading": 2,
            "text": "Mat Banks at Wheldrake Ings, York"
        },
        {
            "text": "For my volunteering day, I chose the Wheldrake Ings nature reserve near York. As the nature reserve is partly owned by Natural England, it was an opportunity to see first-hand how important the work we do at Defra is in terms of protecting our natural environment. I’ve done conservation volunteering in the past and really enjoyed it, - it’s such a good way to take a step back and remind ourselves of the impact our work has and the difference we make."
        },
        {
            "text": "After a quick safety briefing, we set off and started clearing willow branches to encourage nesting birds. The reserve sees nearly 40,000 birds visiting every winter; from marsh harriers to spotted crake. Staggeringly, some of the birds arrive on the very same day each day - even on a leap year!"
        },
        {
            "text": "It was good to see how Defra group staff work in the field, and to meet new colleagues from right across the Defra group. After a day clearing branches and learning how to ring wild birds to track their migration I was exhausted! It made a wonderful change to be out in nature, under big skies and away from my screen!"
        },
        {
            "heading": 2,
            "text": "Ways to volunteer or make a difference"
        }
    ]
}