{
    "url": "https://valuationoffice.blog.gov.uk/2022/12/06/why-your-propertys-rateable-value-might-change/",
    "title": "Why your property’s rateable value might change ",
    "authors": [
        "izzyclark1"
    ],
    "categories": [
        "Revaluation 2023"
    ],
    "pub_date": "2022-12-06T09:44:27+00:00",
    "content": [
        {
            "text": "At a revaluation, we reassess the rateable values of all non-domestic properties in England and Wales. Non-domestic properties are properties that are not private homes. As well as shops and offices, we also value properties such as hospitals and airports for business rates. "
        },
        {
            "text": "Rateable values are usually the annual rent a property could have been let for on a set date. A property’s rateable value might change when we undertake a revaluation to reflect changes in the property market. "
        },
        {
            "text": "Your local council will then calculate your bill by multiplying your rateable value by an agreed multiplier. They apply any reliefs you are eligible for, such as small business rate relief. "
        },
        {
            "text": "A rise in your rateable value does not necessarily mean your business rates bill will go up by a similar amount. In fact, many people’s business rates bills decrease or stay the same.  "
        },
        {
            "text": "Revaluations help to redistribute the total amount of business rates paid by businesses. Those who have seen an upturn in their market value since the last revaluation will pay more, whilst those who have seen a downturn will pay less. "
        },
        {
            "text": "The rental property market "
        },
        {
            "text": "Out of the 2.1 million properties we value, over 1.8 million are valued by analysing rental evidence for similar properties. "
        },
        {
            "text": "To maintain fairness, all rateable values are based on market values at a single date set in law. This is known as the Antecedent Valuation Date (AVD).  "
        },
        {
            "text": "The last revaluation was based on the rental values of properties on 1 April 2015. The next revaluation will come into effect on 1 April 2023 and will be based on values on 1 April 2021. This means that new rateable values will reflect changes in the rental property market over the six years between those two dates. "
        },
        {
            "text": "We collect and analyse rents at this date to compare similar properties. As demand for property goes up, rents tend to increase. As demand decreases, so do rents.  "
        },
        {
            "text": "For example, demand for warehouse and distribution properties have increased since the last revaluation as more people shop online. This has led to an increase in the rateable values of many warehouses. Conversely, demand for some types of shops has decreased. This has been reflected in their rateable values. "
        },
        {
            "text": "Your property "
        },
        {
            "text": " Valuations also depend on physical factors such as: "
        },
        {
            "text": "Changes in the local area may impact the valuation. For example, a new housing development may have increased a shop’s customer base and the amount it could be rented for. These factors are all reflected in your rateable value. "
        },
        {
            "text": "Income, expenditure and construction costs"
        },
        {
            "text": "Most properties are valued by comparing rental evidence. However, for types of properties where there is little or no rental evidence available, we use a different approach. "
        },
        {
            "text": "For properties where the rent is dependent on the revenue they generate, we use the Receipts and Expenditure method. This method is used in the absence of good quality rental information where the purpose of the business or building is to generate a profit. We value hotels and cinemas in this way. "
        },
        {
            "text": "However, the pandemic meant that accounts taken from around the AVD (1 April 2021) were not reliable evidence of future trade and profitability. We have reflected this in the valuation of these properties by looking at trading levels in previous years, the year of the pandemic, and how long the trade may take to recover. "
        },
        {
            "text": "When there is no reliable rental evidence and where the purpose the property is being occupied for isn’t for profit, we use a method called the Contractor’s Basis. "
        },
        {
            "text": "The value of the land and replacement building costs (adjusted for age and quality) are converted to an annual rate. This is called the ‘decapitalisation rate’ and is used to provide an estimated rent and rateable value. "
        },
        {
            "text": "The rate in Wales is set by the Welsh Government. In England it is set by the Department for Levelling Up, Housing and Communities. For most property types, the Welsh decapitalisation rate for Revaluation 2023 is 3.4% and the English decapitalisation rate is 4.4%. "
        },
        {
            "text": "Changes to a rateable value following a revaluation may therefore reflect changes to construction costs, land values or to the decapitalisation rate. Hospitals and libraries are examples of properties valued using the Contractor’s Basis. "
        },
        {
            "text": "Updating your property details "
        },
        {
            "text": "Sometimes your valuation might change even if a revaluation is not taking place. When this happens, it is usually because your property has changed. For example, an extension may have been added, you may have changed the amount of space you occupy, or the way you use the property might have changed. "
        },
        {
            "text": "It is important that you ensure the details we hold about your property are accurate and up to date.  "
        },
        {
            "text": "If you want to report a change to your property in England, sign in to your business rates valuation account. "
        },
        {
            "text": "If your property is in Wales, use our Find a Business Rates Valuation service. "
        },
        {
            "text": " "
        }
    ]
}