{
    "url": "https://environmentagency.blog.gov.uk/2021/10/21/achieving-net-zero-keeping-people-and-nature-in-mind/",
    "title": "Achieving Net Zero: Keeping people and nature in mind",
    "authors": [
        "Doug Wilson"
    ],
    "categories": [
        "Climate change",
        "Regulated industry"
    ],
    "pub_date": "2021-10-21T12:34:02+00:00",
    "content": [
        {
            "text": "This month we’ll see world leaders come together in Glasgow for COP26 and I hope they are able to agree bold carbon targets to limit future climate change.  The evidence is clear: the climate is already changing, and it is human activity that is causing it."
        },
        {
            "text": "The extent and pace of change needed to meet net zero by 2050 is very significant and will touch most aspects of daily life. According to the Climate Change Committee, the UK will need to fundamentally change how we generate and use energy.  For example, by at least doubling electricity supply from clean sources, electrifying most road and rail transport, building a new hydrogen economy, decarbonising industry, rolling out carbon capture and storage, improving agricultural management, managing waste better and removing greenhouse gases from the atmosphere. It’s going to be a big change for all of us."
        },
        {
            "text": "The good news is that scenarios using existing technologies and measures can take us about 95% of the way, but these will have to be deployed at scales and in combinations we’ve not seen before. The Government’s Energy White Paper estimates that the installation of heat pumps will grow from 30,000 to 600,000 per year by 2028, that four clusters of carbon capture and storage facilities will be operating by 2030, and that we need 5 gigawatts of hydrogen capacity by 2030.  The remaining 5% needed to meet the net zero target, will mean adopting some measures that currently have low levels of technology readiness, high costs, or barriers to public acceptability. Examples of these include removing greenhouse gases direct from the air or the production of synthetic fuels. These are complex challenges, and it will be vital to avoid causing other environmental problems along the way."
        },
        {
            "text": "At the Environment Agency we have made our own commitment to achieve net zero by 2030. We recognise the important role we’ll play in enabling society to meet emissions targets through our regulation and advice in key sectors including industry, water, waste and agriculture. We are already thinking about how lower carbon technologies and approaches may need to be regulated and the evidence we will need to do this. We have published two reports today as a contribution to this understanding."
        },
        {
            "text": "One report considers the range of environmental impacts that could result from subsurface activities such as exploiting geothermal energy and the underground storage of energy, such as hydrogen, and carbon dioxide. Existing regulation can be used to identify and control most of these risks, but there are important knowledge gaps to be filled before some activities could be permitted safely. The second report is an initial review of ways to measure ‘whole-site’ methane emissions from onshore oil and gas sites. Methane has a much higher global warming potential than carbon dioxide so knowing where it is being emitted is important for reducing releases. We are already building on this work to identify measurement methods that would be appropriate for different purposes, from research to regulation, ensuring that the level of confidence in measurements is fit for purpose."
        },
        {
            "text": "But this is just the start. We are thinking about the evidence needed to understand the net zero system, and what different combinations of low carbon technologies and approaches could mean for nature and our natural resources. For example, what are the best ways to mitigate the unintended consequences to air pollution from some net zero interventions? Do we understand the multiple and competing demands that a move to net zero could have on water supplies, from increasing cooling for energy generation and storage, to irrigation for energy crops?  Against a backdrop of climate change driving changing patterns of rainfall, how can these demands be balanced with public water supplies and nature? Similarly, what about conflicting demands for land from agriculture, biofuels, carbon sequestration, wildlife, and recreation? Or where might the subsurface need to be prioritised for the multiple net zero storage technologies that are planned?"
        },
        {
            "text": "Issues and choices like these are at the heart of the Environment Agency’s mission and purpose. Working as part of a Government-wide effort we’ll be using science and evidence to ensure that the environment is part of a sustainable and equitable transition to a low-carbon economy."
        }
    ]
}