{
    "url": "https://insidedvla.blog.gov.uk/2021/10/21/celebrating-5-years-of-unity-at-dvla/",
    "title": "Celebrating 5 years of Unity at DVLA",
    "authors": [
        "Robia Ali",
        "Rebecca Tinsley"
    ],
    "categories": [
        "Features"
    ],
    "pub_date": "2021-10-21T15:26:34+01:00",
    "content": [
        {
            "text": "We are Unity, one of several Staff Network Groups (SNGs) at DVLA that aim to support and connect staff throughout the agency. We celebrate the ethnic and cultural diversity within DVLA, while providing a safe and supportive environment for members to talk about race, religion, and culture."
        },
        {
            "text": "Unity was founded on 21 March 2016, the International Day for the Elimination of Racial Discrimination, to provide a strong voice for DVLA’s minority ethnic staff."
        },
        {
            "text": "As the co-chairs of Unity, we’re both passionate about diversity and inclusion, and we’ve always been interested in different cultures. To us, Unity provides a space not only to meet new people, but to support them. We are, after all, one community at DVLA."
        },
        {
            "text": "And it’s been a great journey for us so far! We want to share with you some highlights from the past 5 years."
        },
        {
            "heading": 2,
            "text": "5 years of Unity"
        },
        {
            "text": "Our story began with a staff poll to see how many people would join an SNG to support and encourage inclusivity and diversity at DVLA. The response was incredibly positive and, following discussions with DVLA’s Diversity team, Unity was born!"
        },
        {
            "text": "Since then, we’ve helped make sure DVLA is an inclusive and diverse place to work. From ‘Time to Talk’ days to coffee-time discussions, we aim to change perceptions around race inequality through conversations. After all, the smallest things can sometimes have the biggest impact."
        },
        {
            "text": "With the support of the agency’s Diversity team and our Human Resources (HR) colleagues, we’ve successfully raised awareness of vital issues with senior management. Last year saw the launch of race awareness training for DVLA staff, along with workshops to highlight unconscious biases. To support this, we developed a toolkit and etiquette guide for managers and colleagues, with information about different cultures and religions."
        },
        {
            "text": "As a group, we’ve worked with departments across the agency to improve policies and practices. This includes promoting facilities on site to support those who need them, such as a multi-faith prayer room."
        },
        {
            "text": "We’ve also tapped into DVLA’s strong learning and development culture by signposting staff to mentoring schemes, both within the Civil Service and in the wider community. This includes supporting staff in attending events like the BAME Into Leadership conference, which is a key event for individuals interested in improving and enhancing leadership opportunities for minority ethnic individuals within the Civil Service."
        },
        {
            "heading": 2,
            "text": "Building community "
        },
        {
            "text": "At Unity, we build relationships through education and discussion. That’s how change happens – by supporting those who wish to become allies. Perhaps one of our most visible advocates is our director champion, Andrew Falvey, DVLA’s Commercial Director."
        },
        {
            "text": "Andrew spoke about the importance of having a diverse workforce at DVLA:"
        },
        {
            "text": "We couldn’t agree more. At Unity, we want people to feel included and supported at work. One of the ways we do this is by organising events and activities for staff to get involved in."
        },
        {
            "heading": 2,
            "text": "Events and activities "
        },
        {
            "text": "Unity is run by a steering group, made up of colleagues from different business areas who are passionate and dedicated to championing our cause. As co-chairs, we oversee the steering group and aim to meet up at least every 6 weeks to plan our events and campaigns."
        },
        {
            "text": "Over the past year, the pandemic has made it difficult for us to run our usual activities and we’ve had to adapt. We’ve used video conferencing to stay in contact with our members and emails to keep them up to date with our activities. Despite working remotely, we’ve still managed to recruit new members – this was a big achievement for us and shows how valued the group is at DVLA!"
        },
        {
            "text": "Over the years, we’ve organised a variety of events, from food tasting sessions to dancing classes. One of our proudest achievements was working with the Swansea Humanitarian Aid Response Project (SHARP) for staff to donate items for homeless people and refugees. We managed to collect over 10 cages full of donations!"
        },
        {
            "text": "Another highlight was welcoming Farhana Ali, Swansea’s award-winning make-up artist, to DVLA to speak about how she overcame barriers to establish her successful career. Thanks to the success of these events, we now have around 50 members from across the agency actively engaged in the group."
        },
        {
            "text": "We run as many diversity and charity events as we can. Our fifth anniversary occurred during lockdown and we held 2 virtual photo competitions for staff to share their favourite cultural experience and recipes. It was heartening to see so many staff members from across the agency get involved and celebrate different cultures."
        },
        {
            "text": "This month, we’re promoting Black History Month 2021 via our staff intranet. In the spirit of this year’s ‘Proud To Be’ theme, we’ll be recognising the achievements and contributions that Black communities and individuals make, and have made, to our society."
        },
        {
            "heading": 2,
            "text": "Unity outside DVLA"
        },
        {
            "text": "While Unity exists to support staff at DVLA, we also actively support our local community."
        },
        {
            "text": "We’ve worked with many local groups to support people with job applications and recruitment advice, including the Ethnic Minorities & Youth Support Team (EYST), African Community Centre (ACC), and Swansea Council for Voluntary Service (SCVS). By supporting our local community, we aim to inspire support from local businesses with our activities."
        },
        {
            "text": "But learning from others is just as important. We visited the Driver and Vehicle Standards Agency’s (DVSA) staff group, Embrace, at their Nottingham branch to share best practice and see how their organisation works. We’re always keen to learn – after all, that’s how we grow!"
        },
        {
            "heading": 2,
            "text": "Making DVLA a great place to work"
        },
        {
            "text": "It’s important that DVLA reflects the society in which we live. Seeing the positive impact Unity has had on DVLA, and the people who work here, makes us incredibly proud to be a part of it. But we’re not doing it alone – we’re just one of 6 SNGs helping to ensure DVLA is a supportive and inclusive environment."
        },
        {
            "text": "We’ve been lucky enough to watch Unity grow and evolve over the past 5 years, thanks to the dedication of our members and the support of our colleagues. But of course, there’s always more work to be done!"
        },
        {
            "text": "Our future plans will see us commemorating Holocaust Memorial Day in January 2022, and we’re also looking to increase our steering group membership."
        },
        {
            "text": "Visit DVLA’s 3-year strategic plan to see what the agency is doing to make sure we’re a great place to work."
        }
    ]
}