{
    "url": "https://hmlandregistry.blog.gov.uk/2021/10/21/digital-applications-making-the-future-a-reality/",
    "title": "Digital applications – making the future a reality ",
    "authors": [
        "Eddie Davies, Deputy Director – Digital Services"
    ],
    "categories": [
        "Buying and selling property",
        "Digital services"
    ],
    "pub_date": "2021-10-21T16:03:40+01:00",
    "content": [
        {
            "text": "Crane Hall and the Chantry near Ipswich was the first title registered in 1863 by its owner the MP Sir Fitzroy Kelly, under the first Chief Land Registrar Brent Spencer Follett. Now the Land Register contains more than 26 million registered property titles. "
        },
        {
            "text": "Since that first registration we've gone from face to face, to postal, then to electronic applications and now we are digital. We receive 18,000 applications per day covering a wide range of changes from the simple discharge to a complex purchase. Digital applications will make registering land and property quicker and easier by making error checking and processing times faster."
        },
        {
            "heading": 2,
            "text": "What are digital applications? "
        },
        {
            "text": "Digital applications mark a slight change in how we receive applications to change or update the register. Currently, most of our applications are received electronically as PDFs or scanned copies through our online channels, portal and Business Gateway."
        },
        {
            "text": "We’ve developed functionality within the portal and Business Gateway to accept digital applications alongside the electronic ones. Rather than a scan or a PDF, the details of the application are entered directly into our services or via a case management system and are automatically checked against the register and for fee errors before they are submitted. This reduces the chance of a requisition being raised against an application and enables us to automate and speed up many of the manual tasks traditionally required to review and process an application.   "
        },
        {
            "text": "By automating where possible, we free up more of our people’s time and expertise to work on complex cases which will aid us in reducing the backlog and improving service speeds. Digital applications are currently seeing a 25% drop in requisitions for charge/transfer and transfer-only applications – and we expect to improve that even further. "
        },
        {
            "text": "Ultimately, this is what our work on digital applications has been about: improving our speed of service, reducing the backlog, and making application submission quicker and easier."
        },
        {
            "heading": 2,
            "text": "Transforming today for tomorrow’s future "
        },
        {
            "text": "We launched our Business Strategy in 2017 with bold ambitions to become the world’s leading land registry for speed simplicity and an open approach to data. In the time since the launch, we’ve been working hard to turn transformation projects and ideas into something tangible – and we’re pleased to say that a lot of the outcomes of these projects are now reality.  "
        },
        {
            "text": "Earlier this year our digital mortgage service 'Sign your mortgage deed' enabled automatic updates to the register. Previously each submitted deed would need to be checked by a caseworker. Now the register can be updated automatically in a matter of seconds from the time of application and this work on automation has provided a foundation to expand automation amongst other transaction types.  "
        },
        {
            "text": "We’ve also seen over 100,000 applications submitted digitally via our customer portal using our new Digital Registration Service feature. This was launched as a test service to all customers in April and we’re using this opportunity to listen, reflect and refine in order to make this the primary application channel for our customers.  "
        },
        {
            "text": "This is all fed into our new digital casework engine, which is already streamlining the way we process certain applications. "
        },
        {
            "text": "Our work on electronic signatures has shown that they have a major role to play in the future of land registration. When combined with a digitally produced deed and digitally validated identity check where necessary, they will streamline the application and registration process. "
        },
        {
            "text": "On their own these projects have achieved a lot but put together they are all feeding into our wider transformation and the use of digital applications today.  "
        },
        {
            "text": "Ultimately, we want to build a service that enables quick and easy applications, tailored to the needs of our customers and based on digital processes, not paper ones. We’ve recently published our 18-month roadmap to give an early view of what we’re working on and what you can expect to see in 2022. "
        },
        {
            "heading": 2,
            "text": "What does HM Land Registry need from its customers and the industry? "
        },
        {
            "text": "We know that this new way of submitting applications will mean a bit of a change for everybody, but we’re committed to being open and supportive as we all move to a more digital registration process.  "
        },
        {
            "text": "If you already use a case management system or forms provider to create your AP1, please contact us about connecting to our Business Gateway platform. By connecting to Business Gateway, either directly or via your technology partner, you can automate the submission of applications to us. "
        },
        {
            "text": "We are committed to improving the land registration process and moving to digital applications is a critical part of this. At the moment we’re focusing on digitising simpler applications, so our experts can focus on applications that are more complex. Ultimately, as well as giving us the flexibility to move with how the industry will change in the future, we believe that this will lead to improved service times and a reduction of the backlog and we hope the changes we’re implementing will lead to a smoother process for everyone.  "
        }
    ]
}