{
    "url": "https://deframedia.blog.gov.uk/2021/10/21/environment-bill-strengthened-to-protect-nature-and-tackle-waste/",
    "title": "Environment Bill strengthened to protect nature and tackle waste",
    "authors": [
        "Defra Press Office"
    ],
    "categories": [
        "Weekly stories"
    ],
    "pub_date": "2021-10-21T15:03:16+01:00",
    "content": [
        {
            "text": "The Government has brought forward changes to help improve and strengthen the Environment Bill, making sure we continue to build back greener and remain a global leader in tackling environmental issues ahead of COP26."
        },
        {
            "text": "We have tabled a number of amendments which include measures that would allow ministers to introduce charges on all single-use items, not just plastics – helping to cut waste and put an end to throwaway culture. There has been widespread positive coverage of this announcement in the Times, Telegraph, Daily Mail and Daily Mirror."
        },
        {
            "text": "We have already made huge progress turning the tide on plastic, banning the supply of plastic straws, stirrers and cotton buds, while our carrier bag charge has cut sales by 95% in the main supermarkets. But new powers will mean we can target any single use item destined for landfill."
        },
        {
            "text": "Speaking in the House yesterday, Environment Minister Rebecca Pow said:"
        },
        {
            "text": "New measures will also help landowners to secure long-term environmental benefits through conservation covenants and better protect ancient woodland in England."
        },
        {
            "text": "Our ancient woodlands are not only iconic parts of the nation’s countryside but their complex ecosystems harbour countless species and woodland wildlife, as well as reducing flood risk and improving water quality. Measures announced yesterday will underline the importance of these valuable habitats and make clear the government’s view of ancient woodland as irreplaceable habitat."
        },
        {
            "text": "New measures include:"
        },
        {
            "text": "The Government has also released further information through a Written Ministerial Statement about the upcoming, new Soil Health Action Plan. This Action Plan will provide a single, strategic approach to driving improved soil health across England. It will focus on preventing soil degradation and improving soil health by looking at how land management practices and planning can be adapted to help protect soil from the impact of climate change."
        },
        {
            "text": "Our Environment Bill will ensure we deliver the most ambitious environmental programme of any country - transforming how we protect our natural environment, make better use of our resources and clean up our air and water."
        },
        {
            "text": "The Government has previously made amendments that set a new, historic legally-binding target to halt species decline by 2030, and place numerous new duties on water companies and government to tackle storm overflows and improve water quality."
        },
        {
            "text": "The Environment Bill is expected to complete parliamentary passage shortly."
        },
        {
            "text": "Follow Defra on Twitter, and sign up for email alerts here."
        }
    ]
}