{
    "url": "https://educationhub.blog.gov.uk/2021/10/how-education-plays-a-key-role-at-cop26-and-in-the-fight-against-climate-change/",
    "title": "How education plays a key role at COP26 and in the fight against climate change",
    "authors": [
        "media officer"
    ],
    "categories": [
        "Schools"
    ],
    "pub_date": "2021-10-21T16:51:26+01:00",
    "content": [
        {
            "text": "Next month the COP26 climate change conference will be hosted in Glasgow, with leaders from across the globe, joining to discuss ways to combat the effects of climate change. The UK government will be taking a leading role in this conference, with the Department for Education leading the conversation on how to fight climate change through education, as part of an international effort to reduce carbon emissions and protect our planet."
        },
        {
            "heading": 3,
            "text": "What role does Education play in supporting positive climate action?"
        },
        {
            "text": "Education is a vital tool in raising awareness and equipping future generations with the skills and knowledge needed to tackle climate change."
        },
        {
            "text": "Starting from primary school, pupils in the UK are taught about the effects and causes of climate change, with GCSE students later studying the environment as part of the science, citizenship, and geography curriculum. Over 140 universities have now committed to proactively tackling climate change, as we champion green skills as a cornerstone of post-16 education."
        },
        {
            "text": "The engagement shown by young people in this struggle is so important, and we want to nurture this passion through learning. By sharing our practices with other nations, we’ll be influencing environmental global action through education."
        },
        {
            "heading": 3,
            "text": "So what will we be doing at COP? "
        },
        {
            "text": " Building a more sustainable future is central to our plans as we build back better from the pandemic. Education is key to this goal, and Education Secretary Nadhim Zahawi has made clear that we want our nurseries, schools colleges and universities to be cleaner and greener."
        },
        {
            "text": "At this year’s COP26 conference we’ll be working with departments across government, to lay out our vision to education and environment ministers from across the globe, on how to further integrate sustainable development into education, and engage young people in climate education."
        },
        {
            "text": "As the host nation, COP26 provides a unique opportunity for the UK education sector to showcase its role in positively responding to climate change and inspiring and calling on international partners to act. Through this, the UK is helping to drive forward a global agenda to prepare the next generation to respond to climate change, and to ensure that the voices of our leaders, teachers, and young people are heard."
        },
        {
            "heading": 3,
            "text": "Calling all Education and Environment Ministers to pledge for change!"
        },
        {
            "text": "We know that young people are the leaders of tomorrow, which is why we want our world class education system to be a leader in tackling climate change through education, as we encourage our international partners to do the same."
        },
        {
            "text": "At COP26, the UK in partnership with Italy, UNESCO and youth partners Mock COP and Youth4Climate will lead the way by bringing together Education and Ministers responsible for climate change from around the world. This summit marks an unprecedented opportunity for greater international links between education and the environment ministries, as part of a collective effort to empower citizens to take climate action and create real change."
        },
        {
            "heading": 3,
            "text": "How can you get involved? "
        },
        {
            "text": "The fight for a more sustainable future starts with you and your community, which is why it is so important that you get involved and help us make a positive impact on our environment. The changes start with all of us which is why we’re asking you to get involved through the #OneStepGreener campaign."
        },
        {
            "text": "We could all do more to tackle climate change, whether that’s through organising a local litter picking event in your community, or just being more mindful of what we eat. Visit the website to see how you could get involved, and don’t forget to show us how you’re going #OneStepGreener."
        },
        {
            "text": " "
        }
    ]
}