{
    "url": "https://publicpolicydesign.blog.gov.uk/2021/10/21/innovating-public-services-at-scale/",
    "title": "Innovating public services at scale",
    "authors": [
        "Rachel Hope",
        "Andrew Knight"
    ],
    "categories": [
        "Case study"
    ],
    "pub_date": "2021-10-21T12:00:21+01:00",
    "content": [
        {
            "text": "Innovations in government can be difficult to scale when their focus is too narrow, or when they address siloed policy problems or a small part of a bureaucratic process. This can be made even worse if policy initiatives deliver prescribed solutions founded on untested assumptions. "
        },
        {
            "text": "In 2017, the Department for Education launched a fresh, systems-thinking based review and re-imagination of what education services might look like if they were designed using the perspective of frontline workers such as teachers. It was led by a multidisciplinary team of policy experts and technical experts like researchers, analysts, designers and delivery experts."
        },
        {
            "text": "The policy design team found that policymakers were doing their very best to provide services that focused on the delivery of government priorities and were generally good at making their services as efficient as possible. But policymakers were frustrated, surprised and disappointed when initiatives had poor take-up."
        },
        {
            "heading": 2,
            "text": "Understanding how people use public services"
        },
        {
            "text": "The policy design team worked with teachers to understand the system from their perspective. What this revealed was a knotty mess of publicly-funded services, information and obligations from central government, local government, public bodies, charities and commercial organisations, all competing for teachers’ attention. Overlaying this challenge were unrelenting ‘waves’ of change that hit schools. One former teacher described it as ‘like being on a beach, being hit by a big wave and before you can get up to take a breath, another big wave hits’. Teachers are at the eye of a storm where they must prioritise who to listen and respond to because they have limited capacity. "
        },
        {
            "text": "DfE decided to prioritise the re-design of services that support the recruitment and retention of teachers in the profession. This was a priority area for teachers, and public anxiety about the supply of teachers featured regularly in the press."
        },
        {
            "text": "The workforce recruitment system, with its multiple entry points and different training initiatives, was extremely difficult to navigate for people who wanted to become a teacher. Many found the application process onerous and off-putting. Prior to 2017, over a quarter of a million people visited the information website for teaching careers every month, but 50% of people dropped out between registering their interest and applying for a course."
        },
        {
            "text": "“I had to jump through lots of hoops to get into teacher training” School Direct trainee. "
        },
        {
            "text": "The government was spending £700m annually with a view to training 35,000 teachers each year, but had failed to meet its own target every year for 5 years."
        },
        {
            "text": "The policy design team also found that moving qualified teachers around the education system had become a huge business for recruitment agencies. Without a reliable, recognised marketplace for teachers to move between jobs, schools were relying on recruitment agencies to navigate a complex market and were spending about £75million annually to advertise teaching roles. "
        },
        {
            "heading": 2,
            "text": "Make a map of how innovations relate to each other"
        },
        {
            "text": "The policy design team conducted an exercise envisioning how services for teachers might look if they were designed by teachers. They mapped out all publicly-funded services and made an assessment of how valuable they were to teachers and government. They reorganised the services in a way that would make sense to a teacher as they progress through their career."
        },
        {
            "text": "Each headline service broke down into a number of service parts. DfE analysed this structured picture of the system to prioritise where the highest value would be returned on investment, and which parts of the system would respond best to more detailed innovative design. Because there is a clearly articulated case for how each service part relates to the rest of the system, senior leaders can be assured that innovations lock together and deliver better public value."
        },
        {
            "text": " "
        },
        {
            "heading": 2,
            "text": "Overhauling teacher recruitment"
        },
        {
            "text": "One of the outputs of this exercise was a programme to radically improve the end-to-end journey for those seeking to become a teacher. The team replaced a complex journey split across three organisations, and instead created a joined-up service, designed to inspire, attract and support potential teachers. "
        },
        {
            "text": "Previously, the journey into teaching was fractured across different organisations, and information didn’t flow freely between the different services that candidates and providers used. For example, candidates could register an interest in teaching on a DfE marketing website, before applying through UCAS, with information candidates and providers inputted at each stage not linking up. Equally, information submitted as part of the candidate registration process was regularly duplicated elsewhere in the journey, creating additional administrative burdens. Candidates were also not being signposted to the most relevant information to support them on their journey."
        },
        {
            "text": "The new service has changed this. Now, information flows much more smoothly between stakeholders, and information provided in certain parts of the system is automatically used to populate other parts of the system. Candidates also get bespoke guidance at each stage of their journey, dependent on their experience and progress through the system.  "
        },
        {
            "text": "During their pilot, the team has already seen a reduction in the number of people dropping out of the journey, with the potential for 600 more trainees extra to successfully enter the teaching profession each year. "
        },
        {
            "text": "The new service is also providing rich data. Teams now have access to information on which candidates are being accepted onto teacher training courses by which providers. This allows them to continually analyse the service, identify problems and deliver improvements. "
        },
        {
            "text": "They can also be smarter about where they invest money and time. Previously, marketing teams were unaware of who had already applied for teacher training as this information sat with a third-party, UCAS. This meant that they would send marketing materials to candidates who had already applied for teaching, something that was both annoying for candidates and wasted money for the department. The new, real-time data now supports more targeted and effective communications."
        },
        {
            "text": "“It is so much more user-friendly than UCAS. The interface is clear and intuitive, the email notifications give us just the right amount of information and the applications are much clearer and more useful” Provider feedback"
        },
        {
            "heading": 2,
            "text": "A new model for scaling innovation"
        },
        {
            "text": "After 5 years, 2021 is a milestone year for teacher services because we are bringing the final external part of the service in-house. Looking back, we really knew this innovative way of working was working when DfE teams began to restructure themselves to reflect the teacher service lines. They let go of the idea that 'policy' and 'delivery' are separate things, and created multidisciplinary teams with singular ownership of each problem and service: from concept, to implementation, to continuous improvement. This allowed the policy and delivery to iterate and evolve as the teams learnt more about the people that use their services and how the system worked for them. "
        },
        {
            "text": "DfE previously had a history of years of failed innovations in the teaching workforce space. Its ‘let a thousand flowers bloom’ model had produced a lot of failed public services, and in an already highly pressurised environment, this contributed to teachers feeling overwhelmed and undervalued.  By taking a systems-thinking approach and bringing policy and delivery into single teams, DfE was able to see challenges from the perspective of service users and develop a systems map as a framework for future policy design innovation. Considering each innovation in the context of how it relates to other parts of the system allows innovations to become more than the sum of their parts."
        },
        {
            "text": "Our top tips for scaling innovations within a system are:"
        }
    ]
}