{
    "url": "https://civilservice.blog.gov.uk/2021/10/21/leadership-truth-is-there-never-were-normal-times-and-probably-never-will-be/",
    "title": "Leadership: Extraordinary is the new ordinary",
    "authors": [
        "Sarah Munby, Pemanent Secretary of BEIS"
    ],
    "categories": [
        "A great place to work",
        "A Modern Civil Service",
        "A Skilled Civil Service"
    ],
    "pub_date": "2021-10-21T15:12:42+00:00",
    "content": [
        {
            "heading": 3,
            "text": "Spike in gas prices, fuel queues plus a global climate crisis is all in a day’s work for BEIS. It’s why Sarah Munby puts agility and teamwork at the heart of modern leadership."
        },
        {
            "text": "I’m a year and a bit into being Permanent Secretary at the Department for Business, Energy and Industrial Strategy (BEIS). I started in the depths of the pandemic, and I remember fondly imagining that the sense of uncertainty was temporary – COVID-19 would retreat, I would get my feet under the table, and things would get ‘back to normal.’  "
        },
        {
            "text": "But what is ‘normal’?"
        },
        {
            "text": "Of course, the lesson of the recent past has been that change, ambiguity and unpredictability are part of life, and certainly part of leadership. In the last few months in BEIS, we have been dealing with an unexpected and dramatic spike in global gas prices, fuel queues at the pumps and a shortage of CO2, not to mention the slings and arrows that come your way when you’re about to set out the country’s plan to meet its long-term climate ambitions. The truth is that there never were ‘normal times’, and there probably never will be."
        },
        {
            "text": "Rolling with the punches"
        },
        {
            "text": "Leadership, as much as we all talk about strategy, is also about agility. We all need to be able to ‘roll with the punches’, and even to enjoy doing so. Short-term challenge can be exciting (especially if, like me, you actually quite enjoy being a little bit adrenaline-fuelled), but when we face ongoing challenge and unpredictability, it can become wearing and stressful. So, for me, much of the last year has been spent thinking about how we hold each other strong in times of change, and bring out the positives and the growth. "
        },
        {
            "text": "First, communication is everything. It’s easy to forget that one of the privileges of seniority is better visibility – you tend naturally to see and hear more about the context, and about what might happen next. Share it!"
        },
        {
            "text": "I think one of the real upsides of the pandemic has been that we have all found new ways of communicating with our teams, involving less use of enormous conference rooms and their slightly malfunctioning microphones. Neither of these really lend themselves to honest and transparent sharing of information - or indeed emotion, which can be just as important to share."
        },
        {
            "text": "All about people"
        },
        {
            "text": "Second, of course, it’s all about the people. When things are stable you can, if you really want to, probably get away with an autocratic style of leadership: set the goal, hand out the plan, ensure tasks are fulfilled. But I think that’s now long gone as a smart way to lead in A Modern Civil Service."
        },
        {
            "text": "We all need to understand our purpose and goals, but the detail of how we get there will be established in a complex web of interactions across the system (inside and outside the Civil Service!) and in a way that we probably can’t predict at the outset. Trusting our teams and developing our people so they can navigate the inevitably choppy waters has to be at the heart of our role as leaders. I feel incredibly lucky at BEIS: I’m surrounded by a brilliant and collaborative team in whom I have an enormous amount of faith – and I know I couldn’t do my job without that."
        },
        {
            "text": "Including inclusion!"
        },
        {
            "text": "And finally, I wanted to say something about inclusion in all its forms. One of the challenges of leading in interesting times is that you don’t always know what you are doing - nobody does. Mistakes happen, especially when you are having to act fast, and you don’t have time to look at all the angles. We inevitably rely more on heuristics and judgement – and that’s a problem if our teams are all the same. We need diversity of perspectives and backgrounds to be in the room (virtual or physical) when decisions are made; and that becomes more important, not less, when we are operating under stress or at pace."
        },
        {
            "text": "I feel enormously privileged to be a leader in the Civil Service. I see open, collaborative and inclusive leadership around me every day. Let’s keep challenging ourselves to do even better – because we have an incredible journey of change coming at us, with all the opportunity and challenge that will bring."
        }
    ]
}