{
    "url": "https://lifeathmrc.blog.gov.uk/2021/10/21/our-graduate-programme-ashelys-experience/",
    "title": "Our graduate programme: Ashley’s experience",
    "authors": [
        "Ashley Jones",
        "Mems Bangura"
    ],
    "categories": [
        "General",
        "Graduate",
        "Guest blog"
    ],
    "pub_date": "2021-10-21T11:06:33+00:00",
    "content": [
        {
            "text": "Our Tax Specialist Programme (TSP) is an intensive, three-year scheme for high-potential graduates looking to tackle the most challenging aspects of tax work in HMRC. The programme enables all graduates, even those with non-tax related backgrounds to develop a good base of technical knowledge and professional skills needed through an enriching mixture of formal study and ‘on the job’ practical training."
        },
        {
            "text": "Ashley Jones joined HMRC in 2019 through our TSP as an external candidate and is currently in his third year. Read on to find out more about his experience on the programme."
        },
        {
            "text": "My learning experiences  "
        },
        {
            "text": "Throughout the first two years on the programme trainees are required to complete formal learning and exams. The first stage of the programme is designed to give you a broad knowledge base across multiple compliance tax regimes, so I was able to take on work across a range of teams to gain insight into what each one does."
        },
        {
            "text": "I initially had some fears around having to sit exams again, but I’ve found the formal learning to be extremely helpful in giving me time to gradually learn the tax legislation that I will need to be aware of in my future roles at HMRC."
        },
        {
            "text": "Typically, a small proportion of my working week is spent on formal study, with most of my time being spent acting as a genuine investigator. Within the first few months, I was allocated my own enquiries involving both individuals and companies, covering a range of taxes from Capital Gains Tax to Corporation Tax. Being responsible for my own enquiry so early on seemed daunting at first, but the management team are incredibly supportive, and I was able to use the buddy system and receive guidance from a trainee from the previous year’s cohort."
        },
        {
            "text": "It was the perfect amount of responsibility, as it allowed me to develop, without feeling like I was out of my depth at any point. Working on multiple cases during the year proved to be really engaging, and as cliché as it sounds, no single day was ever the same. Sometimes I would be interviewing sole traders, and on other days I would be reviewing the tax return of a multi-national company, it was an extremely enjoyable experience."
        },
        {
            "text": "Opportunities for development "
        },
        {
            "text": "During my first year as a Tax Professional, I volunteered to be the project lead for a national scheme enquiring into Stamp Duty Land Tax returns involving mixed-use claims, which covers properties with both residential and non-residential elements. Being given such responsibilities so early on in my career was a good challenge and helped me feel like a valued team member. I presented to senior stakeholders within HMRC and delivered training to more experienced colleagues, all within 6 months of me joining. It really was a fantastic experience that helped me discover skills I never knew I had. The opportunities for development at HMRC are vast, as you can get involved in projects outside of the TSP."
        },
        {
            "text": "There have been plenty of chances to learn more about how tax policy is written and trainees that I started with have now taken on permanent roles in policy teams. Some trainees become specialists in one specific area of legislation, while others provide guidance to caseworkers across the country. That’s why the TSP is so good, if during stage one of the programme you identify that one area of tax isn’t suited to you, there are plenty more areas of tax that the TSP can give you access to."
        },
        {
            "text": "Starting my permanent role"
        },
        {
            "text": "During stage two of the programme, you join your permanent team and develop your tax knowledge in that specific tax regime. I was able to join the Fraud Investigation Service and I’m now working as an investigator for the Offshore, Corporate and Wealthy team. I really liked getting to grips with some incredibly interesting casework involving taxpayers who we suspect have committed tax fraud. It is a step up from stage one of the programme in terms of complexity and the cases can often involve significant amounts of money. It’s challenging but ultimately rewarding."
        },
        {
            "text": "Why apply for the TSP?"
        },
        {
            "text": "The TSP is certainly challenging, but it is one of the best things that I’ve ever been involved with. It is intense, fast paced and I’ve never been given so many opportunities to grow. There is plenty of support on offer and the programme allows you to explore every part of tax that you can think of. If you want to push yourself and enjoy learning something new every day, then I would certainly recommend applying to join the programme."
        }
    ]
}