{
    "url": "https://gds.blog.gov.uk/2021/10/21/weve-created-a-new-guide-for-content-design-recruitment/",
    "title": "We’ve created a new guide for content design recruitment",
    "authors": [
        "Jane van de Ban - Lead Content Designer for GOV.UK, Government Digital Service"
    ],
    "categories": [
        "Content design",
        "People and skills"
    ],
    "pub_date": "2021-10-21T11:55:12+01:00",
    "content": [
        {
            "text": "GOV.UK as a website is read by millions of people, worldwide, every day. You are among them - even if you didn’t realise it. The content we publish is really important."
        },
        {
            "text": "At the Government Digital Service (GDS), we aim to hire great people who can help us make our content as good as it can be, and accessible to everyone."
        },
        {
            "text": "We want to make sure we are drawing from as wide a pool of candidates as possible - people with experience of life and work both inside and outside the Civil Service, because people rely on our information to make decisions affecting all aspects of their lives."
        },
        {
            "heading": 2,
            "text": "Guidance to help potential applicants"
        },
        {
            "text": "Getting great people in to work on content starts with the pipeline of candidates who apply for our jobs. We aim to recruit using an open and transparent process, to make sure we are recruiting fairly. But our recruitment process may be very different to the process people are used to, and this can, sometimes, be a barrier to people applying."
        },
        {
            "text": "In 2020, GDS Content Design Community set up a working group specifically to look at recruitment, to see if we could support applicants better. As part of this, we reviewed our application process, and we realised we could do more to help our applicants submit good applications."
        },
        {
            "text": "So we wrote a recruitment guide for potential applicants, where we addressed a range of questions, including the below."
        },
        {
            "heading": 3,
            "text": "What does a content designer do?"
        },
        {
            "text": "Although the term ‘content designer’ is gaining traction, and more employers are using it, many people aren’t clear about what it means. So we’ve explained it in our recruitment guide."
        },
        {
            "heading": 3,
            "text": "What is GOV.UK style?"
        },
        {
            "text": "Our style and design guidelines are used by governments and institutions around the world, as well as by publishing staff across government departments and agencies. They are a set of rules and guidelines on how to create user-centred content and publish it to GOV.UK. Read our recruitment guide to find out more."
        },
        {
            "heading": 3,
            "text": "What skills do you need to become a content designer?"
        },
        {
            "text": "If you have good editing skills and know how to write and present digital content, you already have some of the skills we’re looking for, and we’re interested. But that’s not all you need and we have added some information to our recruitment guide to explain this."
        },
        {
            "heading": 3,
            "text": "What is the application and sifting process at GDS?"
        },
        {
            "text": "Our application and reviewing process follows the wider Civil Service process, and is designed to ensure that we recruit candidates fairly and objectively. We don’t ask you to fill out an application form - we just ask for a CV and a supporting statement, which are reviewed through an objective shortlisting process. We explain this more fully in our recruitment guide."
        },
        {
            "text": "We hope this guide helps future applicants understand our processes better and that it encourages you to apply."
        },
        {
            "heading": 2,
            "text": "Apply now"
        },
        {
            "text": "We run recruitment campaigns throughout the year, but there are actions you can take right now!"
        }
    ]
}