{
    "url": "https://deframedia.blog.gov.uk/2022/05/12/coverage-of-oep-report-on-25-year-environment-plan/",
    "title": "Coverage of OEP report on 25 Year Environment Plan",
    "authors": [
        "Defra Press Office"
    ],
    "categories": [
        "Weekly stories"
    ],
    "pub_date": "2022-05-12T14:09:56+01:00",
    "content": [
        {
            "text": "Today the Office for Environmental Protection (OEP) published its first monitoring report on the Government’s 25 Year Environment Plan."
        },
        {
            "text": "Coverage in the Times, Daily Mail, BBC News Online, Guardian, Western Daily Press and the Express and Star report on the OEP’s assessment that the 25 Year Environment Plan has ambition, but that progress has been slow."
        },
        {
            "text": "The OEP was established through our landmark Environment Act to protect and improve the environment by holding Government and other public authorities to account."
        },
        {
            "text": "Since the Environment Act gained Royal Assent six months ago, we have made great progress, having carried out consultations on the first suite of legally binding targets on air, water, waste and nature, including our world leading target to halt species decline in 2030."
        },
        {
            "text": "We have also consulted on due diligence requirements to tackle illegal deforestation overseas, and on biodiversity net gain in development, which will mean developments must create 10% more nature than was there at the outset."
        },
        {
            "text": "We have taken action to deliver the largest programme in history to tackle storm sewage discharges. Our Storm Overflows Discharge Reduction Plan proposes a target that will see 70% fewer discharges into our bathing waters by 2035. We are the first government to set out our expectation that water companies must reduce the harm caused by storm sewage overflows and in February our Strategic Policy Statement to the water regulator, Ofwat, made clear the importance of protecting the environment. These will work alongside new duties in the Act to restore our rivers."
        },
        {
            "text": "We have laid our draft Principles Policy Statement, which will mean the environment is given more weighting in policy making, and we have announced we are reforming the licensing system, introducing mandatory digital waste tracking, investing in fly-tipping and supporting people to dispose of their waste correctly."
        },
        {
            "text": "As well as this, we have consulted on bans on a number of single-use plastics, and we have recently published the response to our consultation on Extended Producer Responsibility for packaging, which will ensure businesses rather than consumers are responsible for the cost of dealing with packaging when it becomes waste. We have conducted Local Nature Recovery Strategy pilots, as well as fully establishing the independent OEP."
        },
        {
            "text": "Environment Minister, Rebecca Pow, said:"
        },
        {
            "text": "Follow Defra on Twitter, and sign up for email alerts here."
        }
    ]
}