{
    "url": "https://veteranstoday.blog.gov.uk/2022/05/12/end-of-an-era-for-war-pension-customers/",
    "title": "End of an era for war pension customers",
    "authors": [
        "michaelball"
    ],
    "categories": [
        "Veterans Today"
    ],
    "pub_date": "2022-05-12T13:10:40+01:00",
    "content": [
        {
            "text": "This month marks the end of an era for Veterans UK war pensions customers after the final tranche of 41 customers were migrated from Post Office card accounts as their method of payment."
        },
        {
            "text": "The move on May 4 closes an association with the Post Office as the lead payment organisation dating back to the use of payment order books, giro cheques and latterly Post Office card accounts (POca) for customers to receive war pension or war widow(er)s pension payments."
        },
        {
            "text": "The final POca conversion exercises began in 2019, when more than 2,800 war pension customers were recorded on the system as using such accounts. Despite the onslaught of Covid, a number of conversion exercises were run, with the aim of converting these customers to direct banking."
        },
        {
            "text": "Veterans UK needed to do this as the DWP let payment contract with Post Office Ltd for POca payments was due to end last November, although an extension to November this year was negotiated. There was a requirement to migrate any remaining customers who had not converted to direct banking on to the POca replacement service known as Payment Exception Service (PES) by the end of this month (May 2022). This would then allow for the contractual drawdown and closure of the POca contract."
        },
        {
            "text": "More than 2,700 Veterans UK customers have converted to direct banking, leaving just over 100 customers migrating to PES, a service provided under contract to DWP and OGDs by i-movo Ltd, a member of the PayPoint group."
        },
        {
            "text": "The PES system operates in a number of ways: customers will have either a payment card, default option for former POca customers, which is loaded with electronic vouchers, or they can opt to receive either an email pdf voucher or SMS text message voucher. Vouchers can be cashed in the 15,000 PayPoint outlets in the UK or over the counter in a post office. Unlike a POca account, customers cannot build up a balance."
        },
        {
            "text": "Whichever delivery method the customer opts for, they will receive vouchers that equate to their payment. These vouchers have a 90-day validity. Expired vouchers can be re-issued, but customers would undergo a method of payment discussion to ensure this is the right service for them."
        },
        {
            "text": "The PES is not intended to be a long-term method of payment, as customers are expected to open a bank account as soon as possible and then to convert to this. The only exception is for those legally disbarred from holding a bank account in the UK."
        }
    ]
}