{
    "url": "https://educationhub.blog.gov.uk/2022/05/everything-you-need-to-know-about-the-schools-bill/",
    "title": "Everything you need to know about the Schools Bill",
    "authors": [
        "mediaofficer"
    ],
    "categories": [
        "Schools"
    ],
    "pub_date": "2022-05-12T00:02:24+01:00",
    "content": [
        {
            "text": "The new Schools Bill announced this week in the Queen’s speech will underpin the government’s ambition for every child to receive a world-class education, no matter where in the country they live."
        },
        {
            "text": "Below is everything you need to know about the important new legislation."
        },
        {
            "heading": 3,
            "text": "What is the Schools Bill? "
        },
        {
            "text": "A bill is a proposal for a new law that is presented for debate before Parliament."
        },
        {
            "text": "Through the new Schools Bill, the government will raise education standards across the country via a range of measures including supporting schools to join strong, multi-academy trusts, introducing registers for children not in school and giving Ofsted more powers to crack down on unregistered schools operating illegally."
        },
        {
            "heading": 3,
            "text": "How is it different from the Schools White Paper? "
        },
        {
            "text": "White Papers are policy documents produced by the Government that set out their proposals for future policy change, including through legislation."
        },
        {
            "text": "The Schools White Paper set out our long-term vision for a school system that helps every child to fulfil their potential by ensuring they receive the right support, in the right place, at the right time – founded on achieving world-class literacy and numeracy."
        },
        {
            "text": "The Schools Bill provides the legislation required to make this vision a reality. It delivers the primary legislation needed to strengthen the school system, as well as essential measures to keep children safe. The White Paper also sets out a wide-range of non-legislative steps to realise this ambition, such as the Parent Pledge, a new curriculum body and Education Investment Areas."
        },
        {
            "heading": 3,
            "text": "Why is becoming an academy so important?"
        },
        {
            "text": "We have a decade of evidence that academy trusts can transform underperforming schools."
        },
        {
            "text": "We want all schools to be part of a strong academy trust so they can benefit from the trust’s support in everything from teacher training, curriculum, financial planning and inclusivity towards children with additional needs, to excellent behaviour and attendance cultures. This lets schools focus on what parents and children want and need – great teaching for every child."
        },
        {
            "text": "You can find out more about what an academy is and its benefits here."
        },
        {
            "heading": 3,
            "text": "How are you changing school funding? "
        },
        {
            "text": "This bill also delivers on the government’s commitment to move to a direct National Funding Formula, increasing fairness by making sure every school receives funding on the same basis, wherever it is in the country."
        },
        {
            "text": "This is all backed by huge government investment – core school funding will rise by £4 billion in 2022/23 compared with 2021/22, which represents a 7% increase per pupil."
        },
        {
            "text": "Making sure that revenue funding is distributed fairly is a complicated issue. Every child, school and area is different and it means the funding system has to reflect that. For example, some pupils will be eligible for free school meals, or will have other additional needs that can cost schools more to meet"
        },
        {
            "text": "That’s why we have a national funding formula to make sure schools are funded fairly."
        },
        {
            "heading": 3,
            "text": "What are you doing about attendance?"
        },
        {
            "text": "Face-to-face education is of paramount importance for children’s academic, social and emotional wellbeing."
        },
        {
            "text": "We’ve carried out a consultation – which means we’ve been speaking to parents, teachers, local authorities, and others – about how we can help pupils overcome whatever is stopping them from going to school regularly."
        },
        {
            "text": "As part of the bill, we are introducing legislation to bring into force new statutory guidance on attendance, including a requirement for every school to publish a clear attendance policy to improve support."
        },
        {
            "text": "By setting clear expectations for staff, pupils, and parents they will know what processes should be followed in cases of absence and what support should be offered. For parents this should result in greater consistency and improved, earlier support where required."
        },
        {
            "text": "We will also make it easier for schools to understand individual attendance patterns and for trusts, local authorities and DfE to identify problems more quickly."
        },
        {
            "heading": 3,
            "text": "How will registers of children not in school help?"
        },
        {
            "text": "While the vast majority of home educating parents do an excellent job, it’s important that home education doesn’t result in children dropping off the radar and becoming vulnerable to poor standards of education or risks to their safety and wellbeing."
        },
        {
            "text": "The creation of local authority administered registers for children not in school will allow us to support local authorities to make sure they know where every child is being educated, that it is of the right quality, and that support is offered to home educating families."
        },
        {
            "heading": 3,
            "text": "What are you doing about unregistered schools?"
        },
        {
            "text": "The bill, published today (Thursday 12 May), includes new powers for Ofsted to gather evidence which will support prosecutions against those running unregistered, unlawful independent schools and registered independent schools which are not meeting the required standards."
        },
        {
            "text": "Changes are being made to the registration requirements for independent schools so that more settings which provide education to children on a full-time basis need to register as independent schools and meet the standards. This change follows the consultation on this topic, the Government response to which is published here."
        },
        {
            "text": "These changes make it easier to identify and act against educational settings which are ignoring the Department’s rules and regulations. Through ensuring that more children are receiving their education in regulated settings which are subject to regular inspection is an important safeguarding measure which is intended to keep children safe."
        },
        {
            "heading": 3,
            "text": "How are you expanding the Teaching Regulation Agency’s powers and why?"
        },
        {
            "text": "The aims of the teacher misconduct arrangements for regulating the teaching profession are to protect children and young people, to help maintain public confidence in the teaching profession, and to uphold proper standards of conduct."
        },
        {
            "text": "It is important that the teacher misconduct regime keeps in step with current policy and practice, so we are proposing changes to the teacher misconduct regime to ensure that it can continue to operate efficiently and effectively."
        },
        {
            "text": "Changes to teacher misconduct legislation will expand the remit of the Teaching Regulation Agency, enabling it to consider serious misconduct and prohibit unsuitable teachers from the profession, regardless of whether they were teaching at the time of their misconduct, and across a broader range of education settings."
        },
        {
            "text": "The changes will also enable the Teaching Regulation Agency to consider referrals of serious misconduct uncovered by DfE officials, in the course of their normal duties, without the need for an external referral."
        }
    ]
}