{
    "url": "https://socialcare.blog.gov.uk/2022/05/12/international-nurses-day-our-leadership-matters/",
    "title": "International Nurses Day: our leadership matters",
    "authors": [
        "Deborah Sturdy"
    ],
    "categories": [
        "Care and support",
        "Events",
        "Leadership",
        "Social care reform",
        "Workforce"
    ],
    "pub_date": "2022-05-12T09:09:46+00:00",
    "content": [
        {
            "heading": 2,
            "text": "Nursing is a broad church"
        },
        {
            "text": "Today is International Nurses Day and, while many outside the caring professions tend to think of nursing in a purely clinical context, for those of us working in the adult social care sector, we know it is so much broader in scope, complexity and provision."
        },
        {
            "text": "This year’s theme is all about leadership, respecting professional skills and rights, and empowering nurses everywhere to deliver improved global health. It’s a focus I fully endorse."
        },
        {
            "text": "In my role as Chief Nurse for Adult Social Care, I would be failing in my duty if I did not emphasise, encourage and otherwise extol the virtue of social care nurses as professional leaders. We are every bit the equal of our brilliant NHS counterparts, with the broadest of skill sets, lived and professional experience, and a tireless drive to do the very best for people in our care."
        },
        {
            "text": "There remains, however, a cultural and institutional gap between perception and reality – a gap I am determined to close. The recent government investment in training, continuous professional development and the opening up of new career pathways (including making it easier for nurses to move between NHS and care service roles) is very welcome, but we need a wholesale cultural shift to make the most of this funding."
        },
        {
            "text": "Likewise, the momentum building around social care reform and the primary driver of closer integration between health and care services, makes me more hopeful that social care nurses will be accorded the respect they deserve as voices of expertise and professional challenge."
        },
        {
            "heading": 2,
            "text": "We have always been leaders in care"
        },
        {
            "text": "It can be argued that registered nurses already demonstrate the kind of leadership I’m talking about, the kind that not only motivates their colleagues to be the best, but also gives piece of mind to residents, patients, friends and families. I want to go further. I want to see the entire social care nursing profession achieve registration – and make our value to the health and care system official at all levels."
        },
        {
            "text": "There is, of course, more than one way to achieve this parity of esteem. The Infection Prevention and Control (IPC) Champions Network, which I launched last year in association with the Queens Nursing Institute, is a perfect example."
        },
        {
            "text": "It demonstrates our expertise in a critical area of nursing, and one not exclusive to our equally skilled NHS colleagues. Reducing infection risks, limiting or preventing disease outbreaks – not just coronavirus – is a real benchmark of our effectiveness. Indeed, by creating champions within individual care settings, this is another way we demonstrate leadership, share learning and evolve IPC practice to keep everyone safe."
        },
        {
            "heading": 2,
            "text": "Credit where it has long been due"
        },
        {
            "text": "Research and recognition are two further areas where our leadership skills and talents can be authenticated and celebrated. I have long advocated for a strong evidence base to demonstrate the value social care nursing brings to the sector – we need to prove what works to advocate its adoption elsewhere in the system."
        },
        {
            "text": "Likewise, the Chief Nurse for Adult Social Care Awards, shine a light on exceptional colleagues leading the way in person-centred, empathic care. Leadership, in this sense, is not about control, but about inspiring others. It’s also my way of proving to award recipients – and those around them – that what they do really matters. The best care colleagues transform lives for the better and, in the case of their colleagues, unlock their potential to transform many more."
        },
        {
            "text": "On International Nurses Day, let’s remember we bring out the best in our profession when we nurture, recognise and celebrate who we are. That’s how we empower our nursing leaders to inspire others to deliver even greater health outcomes – at home and abroad."
        }
    ]
}