{
    "url": "https://dfedigital.blog.gov.uk/2022/05/12/interaction-design/",
    "title": "Principles for doing interaction design in DfE",
    "authors": [
        "Anne Chan, senior interaction designer and local design community lead"
    ],
    "categories": [
        "community of practice",
        "interaction design"
    ],
    "pub_date": "2022-05-12T14:53:25+01:00",
    "content": [
        {
            "text": "Have you ever wondered how to do interaction design? What principles are there? What about good practice? How could we be more consistent?"
        },
        {
            "text": "We have the high level, and excellent UK government design principles, which we know, love and follow."
        },
        {
            "text": "Within my local community of practice (sometimes called a ‘clan’) our interaction designers bring with them a rich variety of approaches and backgrounds."
        },
        {
            "text": "We need principles based on these collective design experiences–ones that not only compliment the government design principles, but also give our community collective direction and consistency."
        },
        {
            "heading": 2,
            "text": "Our 9 principles"
        },
        {
            "text": "Here’s more detail on the principles with good practice recommendations for each one. These factor in psychology, behaviours, memory and how to better support user"
        },
        {
            "heading": 2,
            "text": "Next steps and the longer term outcome"
        },
        {
            "text": "These principles were prototyped and shared with our design community to get their feedback."
        },
        {
            "text": "We also presented them to our delivery teams to give them a better understanding of how our profession work"
        },
        {
            "text": "A content designer will review our principles to check clarity and understanding. We’ll iterate if we need to."
        },
        {
            "text": "Our goal is for all interaction designers to use these standards when designing content. This will lead to design consistency and predictability. Consistent and predictable services lead to familiar services, and this means users will find our services easier to use."
        },
        {
            "heading": 2,
            "text": "Tell us what you think"
        },
        {
            "text": "Have you created principles or sets of standards in your community? Will this blog post help you to do that? Let us know or leave a comment below. Alternatively, you can get in touch on Twitter."
        }
    ]
}