{
    "url": "https://dwpdigital.blog.gov.uk/2022/05/12/meet-the-engineer-james/",
    "title": "Meet the engineer: James",
    "authors": [
        "James Tolley, infrastructure engineer, DWP Digital"
    ],
    "categories": [
        "DWP Digital",
        "Engineering",
        "Infrastructure engineering"
    ],
    "pub_date": "2022-05-12T09:30:54+01:00",
    "content": [
        {
            "heading": 3,
            "text": "Tell us a little bit about your role "
        },
        {
            "text": "I work on the Specialist Devices team, managing and enhancing the platforms that our team is responsible for. This includes anything that isn’t Windows or production network-based, such as the DWP Secure MacBook Service and the customer computers that are in every jobcentre.  "
        },
        {
            "text": "Our team works in sprints, and we prioritise our workload for the month ahead. My current open tickets are to design a better backup process for our users with OneDrive, migrating 2,500 users over to a new version of Zscaler 2.0 and device attestation testing on our beta platform,    "
        },
        {
            "heading": 3,
            "text": "How long have you been working at DWP Digital and what roles have you done? "
        },
        {
            "text": "I’ve been in DWP Digital for 4 years now. I started as a tech support manager providing first line support in the Newcastle hub. The variety of queries was a little daunting at first, but the team around me were supportive and the culture meant there was less emphasis on knowing the answer and more on knowing where to find it. This was my first Civil Service job and it helped me understand the breadth of technology that DWP uses.  "
        },
        {
            "text": " Before DWP Digital, I worked at Apple as a ‘Genius’, where I would repair hardware and software and educate users on new features. I championed the in-built accessibility features and hosted workshops on things like voice-over and switch control. I think this experience combined with my time as a tech support manager helped me get my current role in infrastructure engineering.  "
        },
        {
            "heading": 3,
            "text": "What do you like most about your job? "
        },
        {
            "text": "I enjoy scripting, troubleshooting and packaging applications - all the nuts and bolts of what makes our platform what it is, with an eye on how any changes will enhance our users’ experience. "
        },
        {
            "heading": 3,
            "text": "What’s the best thing about DWP Digital? "
        },
        {
            "text": "There's a big drive to support people to develop their skills and expertise so that you can thrive in your role or if you’d like to progress. I have completed a range of training courses, both internal and external, since joining the organisation. "
        },
        {
            "heading": 3,
            "text": "What are your career goals for the next few years? "
        },
        {
            "text": "I’d like to work towards a Senior Infrastructure Engineer position, whether that’s in my current team or a different team or different discipline.  "
        },
        {
            "heading": 3,
            "text": "What do you enjoy doing in your spare time? "
        },
        {
            "text": "I have 2 young children, so they take the lion’s share of my time. I live near the beach so try and go paddle-boarding when the conditions are good. My actual favourite thing to do is wash the car though - it’s like therapy! "
        },
        {
            "text": " To find our more about a career in engineering at DWP Digital visit our Careers site."
        }
    ]
}