{
    "url": "https://governmentscienceandengineering.blog.gov.uk/2022/05/12/mental-health-support-at-the-intellectual-property-office/",
    "title": "Mental Health Support at the Intellectual Property Office",
    "authors": [
        "Kelsey Lewis"
    ],
    "categories": [
        "Diversity & Inclusion",
        "Guest Blog"
    ],
    "pub_date": "2022-05-12T12:37:15+01:00",
    "content": [
        {
            "text": "Mental Health Awareness Week began on Monday 9 May, an annual event that encourages the people of the UK to focus on achieving good mental health. The campaign is owned by the Mental Health Foundation which states that prevention is at the heart of its work. In a time where mental health problems are sadly the leading cause of sickness absence in the UK, preventing work-related wellbeing issues needs to be a priority for all organisations."
        },
        {
            "text": "The theme for this year’s Mental Health Awareness Week is loneliness. Since the start of the pandemic, loneliness has been a focus for our wellbeing team. This week the mental health first aid group is hosting a workplace wellbeing session to discuss mental health and how the office can improve its support. We’re also hosting an onsite ‘Coffee Connect’. This is an initiative that offers staff the chance to pair up with a random colleague they may not have met to help people make new friends and build meaningful connections with one another."
        },
        {
            "text": "My name’s Kelsey and I’m one of the mental health first aiders at IPO. I applied for the role because poor mental health is something I’ve experienced myself, particularly after I lost a family member through suicide. I was keen to use my experiences to help IPO create and maintain an environment where mental health is discussed openly, something we’ve made great strides towards in recent years. It’s great to be a part of an organisation that is so passionate about supporting colleagues who are struggling."
        },
        {
            "text": "IPO has a goal is to become an organisation where mental health issues are truly understood and de-stigmatised. Our first mental health strategy was launched in 2016 to support the Government priorities for health & wellbeing in the Civil Service. In this strategy we pledged to support wellbeing through a range of activities including:"
        },
        {
            "text": "Let’s explore these initiatives a little further…"
        },
        {
            "text": " "
        },
        {
            "text": "Staff counselling service"
        },
        {
            "text": "We’re extremely lucky at IPO to have a team of staff counsellors who are a great source of support for anyone and everyone in the organisation. Equal to counsellors outside of the workplace, they are fully qualified to support staff with mental health or emotional issues, as well as personal or work-related difficulties. Clients can personalise this service, opting for a one-off session or book regular appointments - whatever suits them best. Our counsellors also lead and advise the mental health first aider group, supporting them through difficult scenarios or working together to record any trends that may crop up amongst staff."
        },
        {
            "text": " "
        },
        {
            "text": "Manager training"
        },
        {
            "text": "As well as providing in-house training to improve confidence in handling mental health problems, IPO has developed a toolkit as a source of information and support for managers. Our staff counsellors run regular sessions where leaders can openly discuss general managerial concerns in a safe environment. This helps us understand if certain areas are experiencing more issues than others. This allows for more targeted support. Managers can also request  fora mental health first aider to attend team meetings to explain the support available at IPO and offer colleagues the chance to ask questions."
        },
        {
            "text": " "
        },
        {
            "text": "Mental health first aiders"
        },
        {
            "text": "The mental health first aider group consists of specially trained volunteers from different areas of IPO, all with varied backgrounds. We comfort and signpost colleagues with wellbeing concerns, as well as support line managers at times of distress or crisis. It’s a completely confidential listening service that can be offered in person, over the phone or via email/message. Recently, we started hosting regular ‘workplace wellbeing sessions’ for staff to learn how to better prioritise their wellbeing at work. These have proven very popular and help us identify themes that might be causing worry. To ensure we’re offering the best service possible, we attend regular training courses on topics such as mental health conditions, addiction, and domestic abuse."
        },
        {
            "text": " "
        },
        {
            "text": "Employee assistance programme"
        },
        {
            "text": "Our employee assistance programme is a brilliant service provided by Health Assured to help staff deal with personal and professional problems that could be affecting their home or work life, health, and general wellbeing. This 24/7 service comes in handy outside the typical working hours and is open not only to all IPO employees, but to their immediate family members (spouse/partner and children living under the same roof). It provides telephone counselling, a smartphone app full of information and wellbeing tools and an online wellbeing portal which hosts a library of resources."
        },
        {
            "text": " "
        },
        {
            "text": "Peer-to-peer support"
        },
        {
            "text": "For those that may not want the formality of counselling or a one-on-one meeting with a mental health first aider, the peer-to-peer group provides staff with a supportive network of colleagues who can share their lived experiences and how they are managing or overcoming their difficulties. It’s very casual so staff can dip in and out of the weekly sessions as and when they need to without the pressure of having to participate themselves. These are run by our office mental health champion who is an avid campaigner for mental health support in and outside of IPO."
        },
        {
            "text": " "
        },
        {
            "text": "Wellbeing action plans"
        },
        {
            "text": "Wellbeing action plans offer a way for managers to support and track the mental health of their team members. The template we use at IPO was created by the charity Mind and the focus is shifting from reactive management of sick absence to a proactive way of prevention through wellbeing and improving employee engagement. These plans have been essential for managers throughout the pandemic providing them an easy, fuss-free way to check in on their staff (especially those who struggle to speak about their issues in person). They also allow staff to take notice and control their own wellbeing."
        },
        {
            "text": " "
        },
        {
            "text": "Virtual relaxation sessions"
        },
        {
            "text": "Meditation can be an effective way to reduce stress, relieve anxiety, and create a safe mental space for the person in practice. Our daily online mindfulness and meditation sessions are held by volunteers from our patents department and take place on Teams. Staff are invited to join, switch off their cameras and microphones and listen to a guided meditation shared by the host. This has been particularly beneficial to those in our operations areas who have worked tirelessly over recent years to reduce historic backlogs of casework, offering them the opportunity to break up their day and improve awareness of their own feelings."
        },
        {
            "text": " "
        },
        {
            "text": "The Haven"
        },
        {
            "text": "For lots of people at IPO the office space can be distracting particularly if they work within an analytical or technical environment.  Roles in these areas typically require periods of intense concentration and ambient noise can cause discomfort for some. The Haven was created as a safe place for staff to use if they have an urgent need for space and calm. It’s not to use as a private meeting room but to close the door on the busyness of work for however long needed. There’s also a phone available inside with useful numbers for mental health support."
        },
        {
            "text": " "
        },
        {
            "text": "Further support"
        },
        {
            "text": "As well as the above provisions, we encourage staff to talk to our HR Advisors, Harassment Contact Officers or Trade Unions for support. We also share support resources from the Charity for Civil Servant’s online hub which provides information on workplace wellbeing, stress, and burnout. We have a wellbeing group on Yammer where colleagues can openly share information, experiences, and best practises on a more casual/social basis."
        },
        {
            "text": "To benchmark ourselves against other Government departments, we’ve taken part in the Mind Workplace Wellbeing Index which we made a Ministerial target for 2018/2019. We were proud to achieve the ‘gold award’ each time we’ve taken part, meaning we’ve successfully embedded mental health into our policies and priorities. This is a huge step to IPO reaching its corporate goal to become a brilliant place to work."
        }
    ]
}