{
    "url": "https://mattersoftesting.blog.gov.uk/mot-fraud-a-risk-to-road-safety/",
    "title": "MOT fraud, a risk to road safety",
    "authors": [
        "Marian Kitson"
    ],
    "categories": [
        "News and updates"
    ],
    "pub_date": "2022-05-12T13:49:50+01:00",
    "content": [
        {
            "text": " "
        },
        {
            "text": "The MOT test checks that your vehicle meets road safety and environmental standards."
        },
        {
            "text": "MOTs are carried out by 60,000 privately employed MOT testers carrying out tests in around 23,000 testing stations in Great Britain. DVSA is responsible for regulating MOTs and their providers to ensure they are conducted to the correct standards."
        },
        {
            "text": "Almost all the 30 million MOTs carried out annually are conducted to the appropriate standard."
        },
        {
            "text": "For vehicles 3 or more years old, it is a roadworthiness safety net. While vehicles should be roadworthy all year round, the MOT test helps ensure your vehicle is not going to cause you, or other road users, harm."
        },
        {
            "text": "Testament to the success of the test is how few mechanical issues lead to road accidents. Only 2% of road incidents are due to mechanical failings and we are proud of this proven tool that helps to keep Britain’s roads safe."
        },
        {
            "text": "However, this hasn’t stopped people trying to cheat the system."
        },
        {
            "heading": 3,
            "text": "What’re we doing about it? "
        },
        {
            "text": "DVSA monitors the industry closely and acts on poor and fraudulent practice. This is through both proactive work and in response to reports from the public and official bodies."
        },
        {
            "text": "Increasingly, we are discovering cases where vehicles aren’t even entering a garage but still being issued pass certificates. This is allowing potentially dangerous vehicles to be driving on Britain’s roads."
        },
        {
            "text": "The latest technology and intelligence-based targeting allows us to track vehicle movements, meaning we know where vehicles are, and where they’re not. We can then compare this with MOT test data to ensure the right outcome"
        },
        {
            "heading": 3,
            "text": "What’ve we found?"
        },
        {
            "text": "In 2021 to 2022 we saw 1324 total counts of MOT Fraud. 710 of those, were the most serious cases relating to dishonesty and negligence. To put this into perspective, in 2017 to 2018 there were less than half this figure (351). In these most serious cases, we’re able to use the full force of the law. In 2021 to 2022 we prosecuted 20 cases (involving 24 defendants) - a 900% increase from 2018 to 2019."
        },
        {
            "text": "This may appear low in comparison to the total counts of fraud, but a number of individual cases may form part of a singular prosecution. It is these individuals we are targeting."
        },
        {
            "text": "We can also ban people from testing. In 2021, we banned a total of 127 Authorised Examiners from running Vehicle Testing Stations, and 288 from the MOT scheme."
        },
        {
            "text": "This included bans for 85 Authorised Examiner and 185 Tester cases relating to the most serious offences including dishonesty, and gross negligence."
        },
        {
            "heading": 3,
            "text": "Cases to prove a point"
        },
        {
            "text": "We investigated Thornton-Granville of Mitcham, following a complaint about an MOT conducted on a vehicle in a shocking state of disrepair by member of the public."
        },
        {
            "text": "An inspection of the vehicle revealed 21 faults, including missing brake pads and missing anti-roll bar. Corrosion on the car was so severe that the security of the body to the chassis was reduced by more than 50%, critically endangering the driver in any impact scenario. This led to a DVSA investigation. When presented with DVSA’s evidence the tester admitted and subsequently pleaded guilty to issuing 152 fraudulent MOT pass certificates at City of London Magistrates Court in March."
        },
        {
            "text": "He was sentenced to 18 months imprisonment for the charges, suspended for 2 years on the condition he completes 240 hours unpaid work within that period and ordered to pay a contribution towards prosecution costs of £5,000."
        },
        {
            "text": "138 vehicle MOT certificates issued by Thornton-Granville were cancelled and removed. This meant vehicle owners needed to complete a valid MOT test before their vehicle could return to the road."
        },
        {
            "text": "Elsewhere, in Hampshire, Paul Rafferty, of Havant was given a prison sentence of 36 weeks in Worthing Magistrates Court on 28 February 2022 following a DVSA investigation. The sentence was suspended for 12 months for 47 falsely issued MOT certificates over a 3-month period."
        },
        {
            "text": "Rafferty had been issuing the certificates despite the vehicles never entering the two garages he worked at in Petersfield, between November 2020 and January 2021."
        },
        {
            "text": "All the MOTs of the 47 potentially dangerous vehicles were cancelled. The owners were warned that their vehicles must pass a legitimate MOT before they could return to the road. Rafferty was also given the full 5-year term ban from MOT testing."
        },
        {
            "text": "We also wrote advisory letters to the owners of a further 113 vehicles who had received MOT certificates from Rafferty."
        },
        {
            "text": "If you believe an MOT test or centre is committing fraud you can report them."
        },
        {
            "heading": 3,
            "text": "A message of warning"
        },
        {
            "text": "These cases demonstrate we will not allow qualified testers who we entrust to carry out MOTs to abuse a system designed to keep the public safe for their own personal gain."
        },
        {
            "text": "We are fortunate to have so many compliant, trustworthy, and honest garages who deliver the MOT safely. We want to ensure they are not unfairly disadvantaged by the greed and criminality of the dangerous few individuals seeking to dupe the system."
        },
        {
            "text": "The MOT test is designed to keep you and others safe. Don’t risk road safety, don’t cheat the system, choose a valid MOT."
        }
    ]
}