{
    "url": "https://publicpolicydesign.blog.gov.uk/2022/05/12/new-strategy-for-policy-design/",
    "title": "New strategy for policy design",
    "authors": [
        "Andrew Knight"
    ],
    "categories": [
        "Events"
    ],
    "pub_date": "2022-05-12T12:00:20+01:00",
    "content": [
        {
            "text": " "
        },
        {
            "text": "The UK Government’s Policy Design Community has agreed ambitious new plans to build a thriving network for design experts and to embed design into government’s normal way of working."
        },
        {
            "text": "Our community is still young. In its modern incarnation, policy design established a foothold with the birth of Policy Lab about 10 years ago. Since then, the concept has spread and evolved with many exciting variations in approach."
        },
        {
            "text": "Over the past 18-months, the community has seen exponential growth in membership and our events now include practitioners from over 40 organisations in the UK’s central and local government."
        },
        {
            "heading": 2,
            "text": "New sponsorship"
        },
        {
            "text": "Given our tight fit with government thinking on reform of civil service, operational delivery, public value and place – plus commentary from government observers (like Institute for Government and KCL Institute for Policy) – and the strong appetite for a community of practice from our technical policy design experts, Civil Service is for the first time ever sponsoring the Policy Design Community."
        },
        {
            "text": "Our sponsorship comes through the Policy Profession who support over 30,000 policymakers in the UK. We have built strong links with the Policy Profession over the past couple of years and many of our design experts rallied to spearhead Policy Profession’s ‘Policymaking Reform’ research."
        },
        {
            "text": "Richard Banks, who heads up the UK Policy Profession Unit, said “Policy Profession has a renewed leadership role in government that aspires to improve the capability of policymakers, explore a greater role in staffing across the Policy Profession, and to transform policymaking systems. Our sponsorship of the Policy Design Community is an important part of that agenda. We are investing in the build-up of this community of practice to promote the diverse nature of policy professional work”."
        },
        {
            "heading": 2,
            "text": "Community plans for this year"
        },
        {
            "text": "Members of the Policy Design Community have collaborated on setting out an exciting agenda for the coming year."
        },
        {
            "text": "They intend the downstream outcomes of their work to benefit citizens (who’ll get more meaningful outcomes and better public services), civil servants (who’ll make policy and services are more effective), and government (who’ll get more public value from its investments)."
        },
        {
            "text": "It not only aims to build a thriving technical community, but also to embed design as core business for government."
        },
        {
            "text": "Five strands of work have emerged: advocacy and embedding design; design community and events; design training; future design workforce; future design practice."
        },
        {
            "text": "Each strand of work will be managed by a leader from the community who will all meet regularly as part of a new delivery board."
        },
        {
            "heading": 2,
            "text": "Making the case for policy design"
        },
        {
            "text": "As a young community, we are still defining what we do and finding compelling ways to tell the story to others. So we have set out our areas of research interest too. We hope to crystalise our thinking on these issues, both within our community of practice and in partnership with communities of research in universities."
        },
        {
            "text": "Our areas of research interest are:"
        },
        {
            "heading": 2,
            "text": "Working together to deliver"
        },
        {
            "text": "There’s no denying that this is a big to-do list. We need everyone that can help to participate. Working groups are being established or refreshed. If policy design is your passion and practice, then now is the time to help consolidate what we do already and grow. Government is ready and we need to seize this moment and respond."
        },
        {
            "text": "You can download our 2022-23 strategy and if you want to get involved, then simply send a message to policy.design@policyprofession.gov.uk"
        }
    ]
}