{
    "url": "https://insidedio.blog.gov.uk/2022/05/12/showcasing-our-procurement-pipeline-at-the-2022-defence-procurement-research-technology-and-exportability-conference/",
    "title": "Showcasing our Procurement Pipeline at the 2022 Defence, Procurement, Research, Technology and Exportability conference",
    "authors": [
        "Lee Taylor"
    ],
    "categories": [
        "Commercial",
        "Commercial Strategy",
        "Procurement"
    ],
    "pub_date": "2022-05-12T16:53:07+00:00",
    "content": [
        {
            "text": "Lee Taylor presenting his speech at DPRTE 2022 [Crown Copyright / MOD 2022]DIO relies on its suppliers to deliver 95% of our infrastructure services and with an annual spend of around £3bn across design, build, facilities management and specialist technical services, our suppliers have the opportunity to add true value to our national Defence requirements."
        },
        {
            "text": "As a commercial team, we believe in being as transparent as possible in our procurements and are actively seeking to encourage new suppliers, especially small and medium sized enterprises (SMEs). As Supplier Relationship Management (SRM) lead, it is my role to bring this to life."
        },
        {
            "heading": 2,
            "text": "Building a broader and more diverse supply base"
        },
        {
            "text": "Our Commercial Director, David Poole, challenged me last year to make suppliers love doing business with DIO. Since then, we have published our 2022-25 Supplier Relationship Management strategy and have recently revamped our Procurement Pipeline."
        },
        {
            "text": "The Procurement Pipeline is our planned schedule of tendering activity to facilitate Defence’s investment in its estate. It details the works and services that we require on each procurement, along with their value and geographic region. We originally published the pipeline back in 2020 but since then, we have listened to our industry partners and have increased the transparency, frequency, and volume of the detail within the document."
        },
        {
            "text": "We’ve added longer descriptions of our procurements in simplified language to facilitate a greater understanding of DIO’s wants and needs and the value threshold for inclusion in the document has been reduced to £2m to offer more opportunities for SMEs. It is our intent to update the pipeline quarterly to give the industry a greater understanding of future opportunities."
        },
        {
            "text": "The DIO stand at DPRTE 2022 [Crown Copyright / MOD 2022]We remain the only Defence organisation to publish a procurement pipeline and believe these changes will encourage new suppliers, including SMEs, to engage with DIO, bringing new ideas and increased value for money for our Armed Forces customers. We will continue to drive further improvements, in collaboration with our supply chain partners, as we continue with our ambition to become a great business to work with."
        },
        {
            "heading": 2,
            "text": "Promoting contract opportunities at DPRTE 2022 and beyond"
        },
        {
            "text": "At the Defence Procurement, Research, Technology & Exportability event (DPRTE) last year, I outlined our Supplier Relationship Management ambition to make DIO a more transparent organisation and I was proud to be able to present our pipeline to the DPRTE 2022 event last week. The event gave us a great opportunity to connect with our current suppliers and we also had lots of interest from businesses interested in working with us for the first time; both directly or as a 2nd tier supplier through our prime contractors."
        },
        {
            "text": "Luckily, we’d already thought about this – on the 27 June 2022 at our DIO Headquarters, DMS Whittington, we are hosting a specialist event at which our key suppliers, and DIO commercial buyers, will be present and available to discuss sub-contracting opportunities."
        },
        {
            "text": "We run these industry days regularly to provide information to potential suppliers about future contract opportunities and to share our requirements. We invite any companies who have expressed an interest in working with us, so please get in touch at DIOComrcl-PGSRMTeam@mod.gov.uk to find out more."
        }
    ]
}