{
    "url": "https://civilservice.blog.gov.uk/2022/05/12/uncovering-learning-in-learning-at-work-week/",
    "title": "Uncovering learning in Learning at Work Week",
    "authors": [
        "Pamela Dow, Executive Director, Government Skills and Curriculum Unit"
    ],
    "categories": [
        "A Modern Civil Service",
        "A Skilled Civil Service",
        "An Ambitious Civil Service",
        "An Innovative Civil Service"
    ],
    "pub_date": "2022-05-12T08:51:09+00:00",
    "content": [
        {
            "heading": 3,
            "text": "Pamela Dow on why we needed a comprehensive and meaningful curriculum for the Civil Service, and the campus to deliver it.  "
        },
        {
            "text": "Next week is Learning at Work Week (16 to 22 May), celebrating lifelong learning: the knowledge, skills and networks to be effective in your chosen career (or a future career). "
        },
        {
            "text": "In government, we talk about the importance of vocational training. We discuss the right policies to address our national need for skilled workforces, to improve productivity, growth, equality and wellbeing. Yet there’s still more we need to do to improve ourselves, the 450,000 plus workforce responsible for some of the most important challenges of our time! The Declaration on Government Reform committed to change that, with specific goals in leadership, early talent (the Fast Stream and apprenticeships), and establishing the Government Campus for skills. "
        },
        {
            "text": "The theme for this year’s Learning at Work Week is ‘Learning Uncovered’. We’ve interpreted that as an opportunity to make it easier for you to understand the emerging Government Campus. We’re hosting live events which cover what the curriculum is and where to go to access it. You’ll hear directly from the people involved in designing and developing training products and programmes."
        },
        {
            "text": "Every day's a learning day"
        },
        {
            "text": "Every day in the Civil Service is, or should be, a learning day. The value of a huge, varied, sector like ours is the opportunity to acquire both breadth and depth of expertise. To know what, and to know how. I’ve worked in the private sector and in charities, but no professional development offer can compete with the potential the Civil Service has for incomparably valuable vocational training, both formal and informal. "
        },
        {
            "text": "I never take for granted the privilege I’ve had in my career to understand how government works, and how to work in government. The opportunity to specialise, or apply transferable skills across different policy and delivery challenges. As I get more senior, I see it as my duty to ‘pay it forward’. All senior civil servants are responsible for ensuring the generation to come are suitably equipped to be effective. "
        },
        {
            "text": "Learning from the past "
        },
        {
            "text": "When I joined the Cabinet Office in 2019 and started working on the skills agenda, I spent a long time studying official reports into Civil Service training. I looked at the last 30 years of leadership development, including the different programmes offered at the National School of Government. I looked at the evolution of the Fast Stream programme, and its huge growth, from 300 people in 2013 to 2,000 now. All of the changes made sense in isolation and in context, but no-one had ever tried to define a meaningful, specific curriculum for the whole Civil Service - and use that to provide assurance and consistency in all the places where people learnt their trades. "
        },
        {
            "text": "Great challenge"
        },
        {
            "text": "It was always going to be a challenge to be comprehensive and applicable to every civil servant, while ensuring central cohesion and local autonomy. But just because it's hard doesn't mean that we shouldn't have a go."
        },
        {
            "text": "This Learning at Work Week, please take the opportunity to explore the strands and join us at one of our live events. Chat with your line manager about where you think you might need or want to enhance existing skills or learn something new."
        },
        {
            "text": "We want to have the best training and development offer so every civil servant, wherever they are, whatever they do, will get the skills and knowledge required to match their commitment to delivering public service. This is how we will build a competent, capable, confident Civil Service that delivers for the government and the country. Skilled, Innovative, Ambitious. "
        },
        {
            "text": "For more information on the Government Campus, visit gov.uk/gscu. Follow us on Twitter and LinkedIn and subscribe to Campus News."
        }
    ]
}