{
    "url": "https://environmentagency.blog.gov.uk/2022/05/12/update-on-environment-agency-investigation/",
    "title": "Update on Environment Agency Investigation",
    "authors": [
        "Environment Agency"
    ],
    "categories": [
        "Ofwat",
        "Water"
    ],
    "pub_date": "2022-05-12T09:17:03+00:00",
    "content": [
        {
            "text": "On 18 November 2021, the Environment Agency (EA) and Ofwat announced major investigations into potential widespread non-compliance by water and sewerage companies at wastewater treatment works."
        },
        {
            "text": "The investigations were launched after companies revealed to us that they may be in breach of their permit conditions. This issue was brought to light following the EA’s requirement of companies to improve how they monitor and manage flow-to-full treatment at wastewater treatment works through the installation of new monitors."
        },
        {
            "text": "The EA is currently driving a multi-million pound programme requiring water and sewerage companies to improve how they monitor and manage flows at wastewater treatment works – this will also introduce tighter permit conditions that will help us better regulate flow-to-full treatment processes."
        },
        {
            "text": "The Flow to Full Treatment (FFT) investigation is likely to be the largest of its kind for the EA. This is a criminal regulatory investigation and as such must be conducted in accordance with criminal rules and procedures. The standard of proof in criminal proceedings is much higher, and complex, compared to Ofwat’s own regulatory investigation. The criminal investigation into all ten water companies is expected to take at least two years to complete."
        },
        {
            "text": "More than 2200 sewage treatment works spanning all water and sewerage companies with wastewater treatment works that discharge into English waters are being scrutinised by EA experts. Our investigation team is working through hundreds of documents received from the Water companies – and we are expecting to analyse up to 2 billion data points. Our initial analysis of the information collected to date has confirmed that there may have been widespread and serious non-compliance with the relevant regulations."
        },
        {
            "text": "Once we have completed our initial assessment, further investigative work will be needed to confirm whether breaches of permit have occurred, the level of culpability, the reason any breaches have occurred and what the impact of the breaches might have been on the environment. Any enforcement action will be taken in line with the EA’s Enforcement and Sanctions Policy depending on the nature and severity of any offence/s which come to light. Of course, prosecution isn’t the only possible outcome – we will look at all available enforcement options depending on what we find."
        },
        {
            "text": "Whilst these investigations are complex and will take time to complete, they do not, and will not, impact our day-to-day regulation of the water industry. We are continuing to operate as normal –carrying out routine visits at sites we regulate and will take action when it is required."
        },
        {
            "text": "While the investigation progresses, the EA, government and Ofwat are working closely together to ensure water and sewerage companies take immediate action where potential breaches of permit conditions are identified. It is the water and sewerage companies’ responsibility to bring their sites back within compliance as soon as possible and they will be held to this by the regulators."
        }
    ]
}