{
    "url": "https://naturalengland.blog.gov.uk/2022/05/12/wildfire-why-following-the-countryside-code-is-essential-in-reducing-the-risk-of-fires-in-the-countryside/",
    "title": "Wildfire: Why following the Countryside Code is essential in reducing the risk of fires in the countryside",
    "authors": [
        "Natural England"
    ],
    "categories": [
        "Farming",
        "Landscapes and access",
        "Mental health and wellbeing",
        "Natural England",
        "Parks, trails and nature reserves",
        "Peat",
        "Protected sites and species",
        "Site of Special Scientific Interest"
    ],
    "pub_date": "2022-05-12T17:40:31+01:00",
    "content": [
        {
            "text": " "
        },
        {
            "text": "Wildfire. The term conjures up images of raging fires and smouldering forests, something we would usually expect to see on television from international news stations, caused by freak weather events. Unfortunately, so-called wildfires are all too common in England as well, but here they are often caused by people and are rarely natural events. The damage caused by these fires in the countryside and parks can be devastating and the areas affected can take years to recover. Firefighting and recovery costs run into millions of pounds, including regenerating habitats and helping the species lost from those sites to repopulate."
        },
        {
            "text": "Some of the biggest risks of wildfires here in England come from a lack of understanding of how our behaviour can affect our natural spaces. Portable BBQs, campfires and cigarette butts can contribute to wildfire. In 2020 alone Natural England staff recorded a staggering 42 wildfires on Sites of Special Scientific Interest (SSSI’s) with a combined area of 773 hectares of National Nature Reserve (NNR) sites being burnt."
        },
        {
            "text": "The Humberhead Peatlands National Nature Reserve (NNR) in South Yorkshire is a site quite familiar with wildfire. The Reserve lies in an area where peat used to be extracted for horticulture and despite our restoration work there are still areas of dry peat which are particularly vulnerable to fire.  In May and June 2020, parts of the reserve were devastated by wildfires that burned for more than 10 days, damaging important habitat and wildlife, forcing closure to visitors and threatening important infrastructure."
        },
        {
            "text": "A great number of Natural England staff, Fire and Rescue Service crews and workers are often drafted in to help tackle these blazes. Here are accounts from two National Nature Reserve managers on their experiences with wildfire over the years:"
        },
        {
            "text": " "
        },
        {
            "heading": 2,
            "text": "Hatfield Moors, May and June 2020"
        },
        {
            "text": "“In May 2020, my Natural England colleagues and I were plunged from the isolation of peak-Covid-lockdown into a battle to save Hatfield Moors and our neighbours’ homes and livelihoods. The experience of wildfire is like no other; there are fronts, firefights, drones and helicopters. Thankfully, due to the immense professionalism of the Fire and Rescue Services there were no human casualties, and nobody’s home was damaged. Afterwards, shell-shocked, we were left to count the cost."
        },
        {
            "text": "The irony is that the people who likely brought a BBQ to Hatfield Moors on that hot, dusty day probably never realised the damage and chaos they caused – they will have likely gone home by then. They won’t have seen the flames, that the little bit of smoulder in the peat which their BBQ may have caused, went on to ignite. They didn’t smell the thick smoke that hung in the air. They didn’t hear the crackling of the flames or feel the heat of that destructive force. They didn’t witness what the hundreds of firefighters from Yorkshire, Humberside, Derbyshire and beyond saw and what they did. They weren’t aware of the tears shed by grown men rescuing an orphan deer from the flames."
        },
        {
            "text": "…And what was the cost? It’s difficult to calculate fully. At least half a million pounds of tax-payer’s money went into the firefight. We had a wildfire that burnt across about 500 hectares of internationally important bog habitat, damaging about half of that area. It killed or damaged the habitat of a wide range of reptiles, birds and other wildlife. Some areas of peat were completely burnt away leaving permanent scars. The fire also led to the release of at least 160k tonnes CO2eq, which is equivalent to the annual greenhouse emissions of at least 30,000 people. It’s hard to quantify the mental damage and stress that the incident caused too. For all of us that were involved in the battle, our neighbours, whose properties were at risk at the peak of the fire, and for all of those who care about the fantastic landscape and wildlife of the Humberhead Peatlands NNR; the impact was huge. "
        },
        {
            "text": "That first lockdown reinforced for everyone the importance of being able to spend time outdoors, to feel the wind on our skin and the birdsong in our ears. Those that may have lit a BBQ that day were as desperate as the rest of us for some relief from lockdown. But if everyone followed the Countryside Code and took time to read the signs when arriving at a site, there would be peace and the NNR would have been spared its scars that year.”"
        },
        {
            "text": "Julian Small, Senior Reserve Manager, Humberhead Peatlands NNR"
        },
        {
            "text": " "
        },
        {
            "heading": 2,
            "text": "Thorne Moors 2010"
        },
        {
            "text": "“It was a Sunday afternoon when I received the call.  A local farmer informed me of a fire on Thorne Moors, part of the Humberhead Peatlands NNR. My family and I were celebrating my daughter’s birthday so I telephoned colleagues and contractors who would be able to support, and soon had them accompanying the fire brigade on site to try and contain the blaze. "
        },
        {
            "text": "I remember the following morning when heading down the M62 at first light. As I neared Goole the smell of smoke in the air hit me and I could see what looked like a heavy fog in the distance. On site I connected with the fire crews and received the latest information on the size of the area that was affected: about 70 acres. "
        },
        {
            "text": "We had nine fire engines on site from a number of local stations across the area - engines that should have been parked up waiting for any other emergency calls. Instead, they each were summoned to our site to tackle the crisis that had arisen. We then learnt that some locals had been racing quad bikes on the boundary the previous day and it was likely that the hot exhausts may had triggered dry bracken to light up in flames."
        },
        {
            "text": "It took a team effort of three weeks to put the fire out. Tens of fire and rescue personnel, local contractors and farmers, pumps on hire to move water to the fire site, hundreds of metres of pipe, equipment from several other National Nature Reserves and lots of blood, sweat and tears. "
        },
        {
            "text": "Natural England staff worked shifts of around 14 hours each day and the clean-up operation afterwards took over a week. Whilst we worked tirelessly to save what we could, the damage caused was devastating and the peat that was burnt will take hundreds of years to regrow, even in ideal conditions.  "
        },
        {
            "text": "Relationships on and around National Nature Reserves and the wider countryside are so important.  Vigilance from the public, neighbours and staff is vital in protecting our natural spaces.”"
        },
        {
            "text": "Chris Evans, Natural England Area Senior Advisor"
        },
        {
            "text": "The risk of more frequent wildfires is very real. With predictions of increasing summer temperatures and more periods of dry weather, our local natural spaces are vulnerable. That’s why, as part of the Countryside Code, Natural England and Natural Resources Wales are working to ensure that guidance on BBQs and not lighting fires in the countryside continues to remain up to date. This includes:"
        },
        {
            "text": "You can find out more on the Countryside Code by visiting our webpages. It’s important we all work together to ensure that we look after our natural world. By following the Countryside Code, you can help respect, protect and enjoy the great outdoors and avoid incidents such as those described above."
        },
        {
            "text": "\n"
        }
    ]
}