{
    "url": "https://defradigital.blog.gov.uk/2022/10/24/a-day-in-the-life-of-a-senior-user-researcher/",
    "title": "A day in the life of a Senior User Researcher",
    "authors": [
        "Fran Redman"
    ],
    "categories": [
        "Defra content design",
        "User centred design",
        "User research"
    ],
    "pub_date": "2022-10-24T11:22:40+01:00",
    "content": [
        {
            "text": "\nThinking of applying for a role as a User Researcher at Defra? Fran Redman shares a typical (or not so typical) day in the life of a Senior User Researcher."
        },
        {
            "heading": 2,
            "text": "Tell us about your role at Defra "
        },
        {
            "text": "I’m a Senior User Researcher on the Future Farming and Countryside Programme (FFCP). I’ve been here four months. Before that I was at the Ministry of Justice. "
        },
        {
            "text": "My role is to find out what people need from our services and content on GOV.UK, so that our teams create services based on user needs. "
        },
        {
            "heading": 2,
            "text": "What’s a user researcher? "
        },
        {
            "text": "Users are people. We call them ‘users’ because it reminds us that people use the services and content that we provide on GOV.UK to do something. A user researcher speaks with users to find out what they need to know and do. It’s a vital part of making sure we give people the right information at the right time. "
        },
        {
            "heading": 2,
            "text": "Why did you choose user research? "
        },
        {
            "text": "I chose user research because I love hearing people’s stories. I’m a real introvert but I find it so rewarding to give our users the chance to influence the policies and systems that will be part of their lives. "
        },
        {
            "heading": 2,
            "text": "What are you working on now? "
        },
        {
            "text": "I’ve just started work on Defra’s new local nature recovery scheme. My role is to speak with users and find out what they need to know and do. Content designers will use this information to create guidance for people who want to take part in the scheme. "
        },
        {
            "heading": 2,
            "text": "Describe a typical day  "
        },
        {
            "text": "One of the things I love about user research is there’s no such thing as a typical day. Although it does follow a sort of pattern - I know I’ll be scoping and designing research, recruiting participants, carrying out research, and then analysing and presenting my findings. But the things I work on, and the people I meet, are different every week. "
        },
        {
            "text": "I have a 3-year-old son, so every day starts early. My partner is in the RAF, which means my work schedule needs to be super flexible to accommodate his strange working patterns. I work part time, on a term-time working pattern.  "
        },
        {
            "text": "I always do a round robin to start the day and check my calendar, emails, MS Teams, and Slack messages. "
        },
        {
            "text": "Today I’m meeting a new colleague who’s starting work as an accessibility consultant. I’m looking forward to welcoming them into my team and making sure they know they can come to me for support when they need it.  "
        },
        {
            "text": "Next, it’s the first stand-up of the week. This is a chance to find out how my colleagues are doing and share my own updates, followed by a wider team check in. "
        },
        {
            "text": "After lunch about 12pm I’m going to meet my new mentee. We’re going to talk about what they want to achieve over the next few months. They’re going to give me a crash course in integrated pest management - a much more interesting way to learn about a new subject than an internet search! "
        },
        {
            "text": "Towards the end of my day I’m catching up with some content design colleagues who’ve given me some tips on high impact writing. Then I’ll wind down the day putting their advice into practice (with a podcast to keep me going).  "
        },
        {
            "text": "It’s going to be an interesting day. I enjoy learning about new topics, and there’s lots of learning to do! "
        },
        {
            "heading": 2,
            "text": "Why do you want to work for Defra? "
        },
        {
            "text": "The work we do covers so much more of the world around us than just farming. The environment is very important to me, and sustainable farming is an important part of FFCP. I also enjoy the opportunity to learn about the world around me and talk to people with very different experiences from my own. "
        },
        {
            "text": "User research in Defra is so varied. It’s exciting to hear updates from colleagues working on things like flood information, vet visits and even slurry. "
        },
        {
            "heading": 2,
            "text": "What’s the best thing about working for Defra? "
        },
        {
            "text": "I love being part of the User Centred Design (UCD) community. We have regular team events to share knowledge - monthly drop-in sessions with the accessibility team, and ‘show and tells’ on MS Teams where content designers show us what they’ve been up to. We also have a UCD operations team who’ve recently been organising activities for a UCD volunteering week. "
        },
        {
            "text": "It’s great to be part of our growing FFCP user research team – there’s always someone around in our team's group if we want advice. It’s great to be part of such a supportive team. "
        },
        {
            "heading": 2,
            "text": "What’s the most valuable thing you’ve learned while working here? "
        },
        {
            "text": "We’re very keen on co-design at Defra. Co-design means involving people affected by our work. I’ve been learning more about that since I joined. I really value the opportunity to learn more about how co-design is used across the organisation and put theory into practice. "
        },
        {
            "heading": 2,
            "text": "What advice would you give to someone wanting to apply for a user research role at Defra? "
        },
        {
            "text": "Go for it! The work is varied and the people are lovely. You won’t regret it!"
        }
    ]
}