{
    "url": "https://vets.blog.gov.uk/2022/10/24/british-veterinary-nursing-association-bvna/",
    "title": "British Veterinary Nursing Association (BVNA)",
    "authors": [
        "kenmeger"
    ],
    "categories": [
        "Government Veterinary Services"
    ],
    "pub_date": "2022-10-24T11:09:25+01:00",
    "content": [
        {
            "text": "Defra is proud to collaborate with the British Veterinary Nursing Association (BVNA) to highlight the incredible work veterinary nurses do. As the representative body and collective voice of veterinary nurses, the BVNA strive for positive changes that benefit veterinary nursing through promoting the shared interests of its members and supporting them through their careers."
        },
        {
            "text": "As BVNA President, Alexandra Taylor, comes to the end of her presidency, she has kindly agreed to share her reflections as a veterinary nurse and on the profession itself."
        },
        {
            "text": "“The BVNA started in 1965 and has proudly continued with its initial vision to represent, support and champion the veterinary nursing profession for these many years. Now, more than ever, the BVNA engages with its members, the wider profession, government and the public to make sure that the voice of the veterinary nurse is heard."
        },
        {
            "text": "It takes a very special sort of person to become a veterinary nurse. The hours can be long, it's very physical, fast paced and, at times, emotionally challenging. These are also the reasons why I love my job.  I began my veterinary nursing journey in 1994, when I was just 18 years old. I was employed as a kennel assistant in a large, East London, first opinion and referral hospital for small animals. I then began training as a student veterinary nurse in 1995, before qualifying in 1997."
        },
        {
            "text": "If you had told me then that not only would I qualify and eventually become a registered veterinary nurse (doing a job that I love), go on to be voted onto the BVNA Council and become Association President, I would not have believed you. However, here I am, almost at the end of my Presidential Year and into my fifth year on the BVNA Council."
        },
        {
            "text": "My story is not unique, there are thousands of committed veterinary nurses out there who have the drive, passion and ability to give the best nursing care to their patients and do so on a daily basis. Veterinary nurses are an integral part of the veterinary team, the ‘backbone’ of the practice. Some veterinary nurses come out of clinical practice and diversify into other roles, such as teaching, practice management, research or as a sales representative, to name a few."
        },
        {
            "text": "This year marks a quarter of a century since I qualified as a veterinary nurse; an achievement I am immensely proud of. Since then, there have been a lot of positive changes in the veterinary nursing profession.  Significant milestones include the introduction of the Code of Professional Conduct in 2012 that, for the first time, required a declaration to be made by the veterinary nurse on their professional registration. All Registered Veterinary Nurses (RVNs) have to abide by the Code and are subject to disciplinary action in the event they fall short of its Principles of Practice and their Professional Responsibilities."
        },
        {
            "text": "The 2015 Supplemental Royal Charter, granted RVNs associate membership of the Royal College of Veterinary Surgeons (RCVS), confirming veterinary nursing as a legally recognised profession. VN Futures, the joint initiative between the BVNA and RCVS, launched in 2016. Centred around finding solutions to the challenges faced by the veterinary nursing profession, VN Futures also looks at how to enhance career opportunities for veterinary nurses and maximize their potential."
        },
        {
            "text": "The profession has come a long way, with RVNs being recognised as highly skilled, knowledgeable and respected professionals in their own right.  With the Veterinary Surgeons Act almost 60 years old, any new legislation needs to correctly reflect and provide for RVNs."
        },
        {
            "text": "Despite how far the profession has come, the title ‘veterinary nurse’ is not protected by law. This means that anyone (regardless of any training or experience) can call themselves a veterinary nurse and this poses a risk to animal welfare and public health, as well as contributing to workforce issues, where veterinary nurses may feel undervalued."
        },
        {
            "text": "The BVNA and British Veterinary Association (BVA) have long called for the protection of the title ‘veterinary nurse’ and I should like to share here the BVNA surveys to gauge how the veterinary profession and public feel about this issue, and how it may affect them."
        },
        {
            "text": "Veterinary nursing is a wonderful profession, it’s very rewarding and we’ve come a long way since I qualified, but for the sake of our patients, pet owners and the veterinary nursing profession itself, our title needs protecting.”"
        },
        {
            "text": "https://bvna.org.uk/"
        },
        {
            "text": "https://www.vnfutures.org.uk/"
        }
    ]
}