{
    "url": "https://medregs.blog.gov.uk/2022/10/24/increasing-the-efficiency-of-your-clinical-trial-authorisation-cta-application-and-reducing-the-need-for-subsequent-substantial-amendments/",
    "title": "Increasing the efficiency of your clinical trial authorisation (CTA) application and reducing the need for subsequent substantial amendments",
    "authors": [
        "Graham McNaughton",
        "Martin O'Kane"
    ],
    "categories": [
        "Behind the Scenes",
        "Clinical Trials"
    ],
    "pub_date": "2022-10-24T17:20:36+01:00",
    "content": [
        {
            "text": "In this blog we describe ways to facilitate the review of your initial application, how to avoid unnecessary amendments and, where substantial amendments are necessary, how to submit these so that the review is as efficient as possible, leading to improved chances of approval."
        },
        {
            "heading": 2,
            "text": "Don’t reinvent the wheel "
        },
        {
            "text": "If certain documents contained in your CTA application, namely the investigational medicinal product dossier (IMPD) and investigator brochure (IB), have already been reviewed and authorised by MHRA for one of your previous studies, or a study from a different sponsor, this should be highlighted in the application and a trial identifier (e.g. IRAS ID) for the previous trial provided. This helps assessors with the review and can lead to shortened approval times. Whilst there is no need for a copy of IMPD to be submitted if a previous trial is being cross referenced to for this document, a copy of the IB should always be provided as this is required for research ethics committee (REC) review."
        },
        {
            "text": "If you are cross referring to approved information submitted by a different sponsor, you will need a letter from them allowing you to cross reference to their data. Note also that some supporting documents, such as manufacturer’s authorisations, QP declarations and IMP labelling, cannot be cross referenced to and must be submitted for each trial."
        },
        {
            "heading": 2,
            "text": "Avoid common mistakes "
        },
        {
            "text": "We estimate that more than half of all applications we receive require additional information to be submitted before they are considered approvable. Many of the requests for further information or ‘grounds for non-acceptance’ (GNA), are common and are avoidable if available guidance is followed or if a satisfactory justification for not following the applicable guidance is provided in the application."
        },
        {
            "text": "To prevent avoidable rejections, sponsors are advised to review the MHRA advice regarding Common issues identified during clinical trial applications - GOV.UK (www.gov.uk)"
        },
        {
            "heading": 2,
            "text": "Avoiding the need for submission of a substantial amendment "
        },
        {
            "text": "The need for substantial amendments can be minimised by writing protocols and IMPDs with in-built resilience and flexibility. For example, sponsors can avoid the need for substantial amendments to extend the shelf life of the investigational medicinal product (IMP) by including a shelf-life extension proposal in the IMPD. This should ideally be done at the time of initial application but can be added as a subsequent amendment to ongoing studies."
        },
        {
            "text": "One of the lessons learnt from COVID-19 is that protocols are often written too prescriptively, leading to unnecessary substantial amendments when a change needs to be made. We have published Guidance on minimising disruptions to the conduct and integrity of clinical trials of medicines during COVID-19 - GOV.UK (www.gov.uk) and would encourage sponsors to embed these in normal practice."
        },
        {
            "text": " "
        },
        {
            "heading": 2,
            "text": "Critically assess if your amendment is ‘substantial’"
        },
        {
            "text": "A perennial question trial sponsors (and indeed regulators!) grapple with, is whether a change to an approved trial should be considered “substantial” and therefore submitted for authorisation to the licensing authority."
        },
        {
            "text": "The reality is that most sponsors take a conservative approach and over-report amendments to regulators. This can lead to unnecessary delays to the progress of a trial and is completely avoidable if the definition of a substantial amendment is followed and good internal records are kept on the sponsor’s determination of the change as ‘substantial’ or not."
        },
        {
            "text": "The legal definition of a “substantial amendment to the clinical trial authorisation” means an amendment to the clinical trial authorisation which is likely to affect to a significant degree (emphasis added) –"
        },
        {
            "text": "It is the sponsor’s responsibility to decide if a proposed change will “affect to a significant degree” the considerations above, based on a case-by-case assessment of the change(s) to their trial. The views of investigators and/or the Qualified Person should be sought, as appropriate.  In case of doubt, the regulator can be contacted for advice; however, it is recommended that in these cases the sponsor’s opinion and reasoning on their own determination should be included in any request for the regulator’s view."
        },
        {
            "text": "Examples of amendments that are considered substantial and non-substantial are provided in paragraphs 119 to 124 of the Communication from the Commission — Detailed guidance on the request to the competent authorities for authorisation of a clinical trial on a medicinal product for human use, the notification of substantial amendments and the declaration of the end of the trial (CT-1) (europa.eu), whilst specific examples relating to the IMPD are provided in Chapter 9 of the Guideline on the requirements to the chemical and pharmaceutical quality documentation concerning investigational medicinal products in clinical trials - Rev. 2 (europa.eu)."
        },
        {
            "text": "However, it is impossible to provide an exhaustive list covering all scenarios. Therefore, sponsors are asked to use their regulatory experience, together with knowledge of their IMP and trial, to critically appraise whether a proposed change constitutes a substantial amendment according to the legal definition."
        },
        {
            "text": "A sponsor may make an amendment to a clinical trial authorisation, other than a substantial amendment, at any time and without the need for licensing authority approval, but they must keep records of the amendments made and have these available to provide, if requested by the licensing authority."
        },
        {
            "text": "MHRA assessors will make a comment in the outcome letter where an amendment submitted is clearly not substantial."
        },
        {
            "heading": 2,
            "text": "Facilitating Assessment of Amendments"
        },
        {
            "text": "Updated documents should be submitted in clean and track changes format, together with a summary of changes. For the IMPD, it is acceptable to only submit sections of the dossier that have been substantially updated. This will assist the assessment team in identifying the changes, allowing a targeted assessment and a faster approval for sponsors."
        },
        {
            "text": "If the amendment includes both substantial and non-substantial changes, these should be clearly separated, and the substantial updates identified as only these require assessment and approval."
        }
    ]
}