{
    "url": "https://actuaries.blog.gov.uk/2022/10/24/liability-driven-investments/",
    "title": "Liability Driven Investments",
    "authors": [
        "Christophor Ward - Actuary"
    ],
    "categories": [
        "Actuary",
        "Analysis",
        "Finance",
        "Investment"
    ],
    "pub_date": "2022-10-24T17:56:44+01:00",
    "content": [
        {
            "text": "In late September, the UK’s corporate defined benefit pension schemes entered a period they haven’t experienced for more than 10 years - government bond yields were over 4%."
        },
        {
            "text": "This was a challenging time for schemes that had Liability Driven Investments (LDI), but also a period that has seen funding levels reach record highs. I write this in mid-October 2022 knowing that markets are volatile, and the situation could rapidly and significantly shift."
        },
        {
            "heading": 2,
            "text": "What happened?"
        },
        {
            "text": "In the latter part of September 2022 government bond yields increased by a large amount over just a few days."
        },
        {
            "text": "Many corporate defined benefit pension schemes that invest in LDI funds had to provide their investment manager with collateral. Although schemes did have collateral plans in place, many struggled to provide collateral to their LDI manager quickly enough."
        },
        {
            "text": "LDI funds cater for this and can reduce hedging if sufficient collateral is not received in time."
        },
        {
            "text": "The problem in this case was that so many schemes and other investors were selling gilts (often the most liquid investment held by a pension scheme.) It meant very few investors wanted to buy gilts with gilt prices tumbling."
        },
        {
            "text": "Figure 1: Bank of England nominal spot rates (gilts) 1987-2022"
        },
        {
            "text": "The immediate challenge was liquidity, so a struggle to be able to sell an asset promptly at what the seller believes to be a fair value."
        },
        {
            "text": "On 28 September the Bank of England pledged to buy long-dated government bonds. This helped to ease the liquidity pressures on pension funds that held LDI and led to a modest reduction to yields giving some respite from collateral requests."
        },
        {
            "text": "This provided relief for many schemes, allowing them to maintain their LDI positions and review their collateral arrangements."
        },
        {
            "heading": 2,
            "text": "Rising yields are good for pension scheme funding"
        },
        {
            "text": "Let’s look beyond the liquidity issue that some pension schemes faced. Most corporate defined benefit pension schemes benefited from higher gilt yields. That leads to a lower value being placed on their liabilities and will generally improve funding levels."
        },
        {
            "text": "That’s good news for pension schemes and their members. This is because most corporate defined benefit pension schemes are closed to new members and will eventually want to secure all benefits with an insurer. Most schemes are now closer to achieving that goal."
        },
        {
            "text": "Figure 2: Funding level in the PPF 7800 index for DB schemes, 2006-2022"
        },
        {
            "text": "Longer term, if higher yields and higher funding levels persist the pensions landscape is likely to look different to recent years, but much is uncertain."
        },
        {
            "text": "We could see:"
        },
        {
            "heading": 2,
            "text": "Pension scheme trustees - risk managers"
        },
        {
            "text": "Corporate defined benefit pension schemes operate under trust law with a group of trustees overseeing the governance of the scheme. The role of a trustee is similar to a company’s board of directors. However, a trustee’s duty is not to do with profits, but to ensure that members receive their pension."
        },
        {
            "text": "Trustees can be responsible for a multi-billion-pound portfolio and a payroll of tens of thousands of members. Many trustees take on that role with purely altruistic motives. However, the recent market volatility may have led some trustees to reflect on what’s being asked of them and the personal time and risk they take."
        },
        {
            "text": "This risk and complexity of pensions is why there are a growing number of professional trustees. These are people with relevant backgrounds and accreditation who charge for being a trustee. It may mean recruiting lay trustees is likely to be harder than ever."
        },
        {
            "heading": 2,
            "text": "LDI liquidity issue"
        },
        {
            "text": "Schemes carry out stress tests and have collateral plans in place, although the speed and amount by which gilt yields increased was unprecedented."
        },
        {
            "text": "This meant many schemes couldn’t provide collateral quickly enough. They were limited by the speed that they could free up their other assets, talk to their advisers and place dealing instructions."
        },
        {
            "text": "Under this scenario, LDI managers can reduce a scheme’s hedging position until further capital is available - to do this they sell down some of the LDI fund’s gilts."
        },
        {
            "text": "If yields had continued to increase, leading to further sales of gilts, it could have meant some LDI funds running out of collateral and potentially closing. Their clients could have lost the assets they’d invested in those funds and needed to find an alternative LDI provider."
        },
        {
            "text": "Even under this scenario, members’ pensions would have still been paid. Any shortfall would have been identified and allowed for in the usual manner when considering scheme funding."
        },
        {
            "heading": 2,
            "text": "What happens now?"
        },
        {
            "text": "Since the events started on 28 September, schemes and advisers have worked to ensure they have additional collateral in place for any further significant volatility. Some schemes and LDI managers will have reduced leverage levels to reduce collateral requirements."
        },
        {
            "text": "Schemes will also be reviewing their risk registers with an increased focus on some of the operational risks of running a pension scheme."
        },
        {
            "text": "This is an important point: risk registers will run to many pages, with risks typically assessed on a ‘likelihood’ and ‘impact’ basis. The difficult judgement for trustees and their advisers is to make these assessments and accept that they do have to take some risks."
        },
        {
            "text": "The most comfortable position is to consider those risks fully using a wide range of data, know the possible mitigations, and understand what the catalyst is for reviewing the risk."
        },
        {
            "text": "In the case of September gilt yield rises, most schemes would have identified this as a risk but underestimated the potential pace and level of yield rises. This risk will now be mitigated, and the challenge is to identify the next risk."
        },
        {
            "heading": 2,
            "text": "The role of government"
        },
        {
            "text": "There is a range of UK government departments that work with the pensions and investment industry. People in these departments are motivated by enabling pensions that are secure and aim to provide long-lasting value."
        },
        {
            "text": "The government has the same challenge as trustees, it must balance risk with the perceived return. It’s not possible to remove all risks, but government is uniquely placed to make those assessments and intervene where it believes mitigations must be imposed."
        },
        {
            "text": "The general shift towards a liability focused approach to investing for UK defined benefit schemes has led to one of the healthiest sets of defined benefit schemes in the world. The challenge some schemes faced with quickly raising collateral LDI could be resolved in several ways that preserves the healthy funding position. This could include more flexibility in the type of assets that can be posted as collateral and how trustees manage their operational risks and stress test."
        },
        {
            "text": "These are areas where the Government Actuary’s Department has experience of both working with schemes and considering how legislation and guidance is formulated."
        },
        {
            "text": "We were pleased to be a trusted partner to the departments that have been involved in the recent yield increase and LDI liquidity processes. We look forward to continuing those discussions on improving the security of the UK defined benefit pension landscape."
        },
        {
            "heading": 3,
            "text": "Disclaimer"
        },
        {
            "text": "The opinions in this blog post are not intended to provide specific advice. For our full disclaimer, please see the About this blog page."
        }
    ]
}