{
    "url": "https://prisonjobs.blog.gov.uk/2022/10/24/my-day-as-a-catering-supervisor/",
    "title": "My day as a catering supervisor",
    "authors": [
        "Ministry of Justice"
    ],
    "categories": [
        "Personal stories",
        "Prison catering"
    ],
    "pub_date": "2022-10-24T17:31:24+01:00",
    "content": [
        {
            "text": "This is not your average catering job. It’s a great chance for you to put your catering skills and qualifications into practice. From working with the team to prepare meals for the entire prison, to helping prisoners learn new skills for employment on release – your impact will go far beyond the kitchen."
        },
        {
            "text": "Mark is a catering supervisor at HMP Grendon and shares his insight into his role."
        },
        {
            "text": "Visit our website to find out more about working in prison catering."
        },
        {
            "text": "Not your average catering job"
        },
        {
            "text": "I don’t think many people really understand catering in prisons. There’s very few catering jobs where you’re home in time to have dinner with your family*. At HMP Grendon, there are also no split shifts, just 5 days out of 7 and then alternative weekends – again, unheard of in catering."
        },
        {
            "text": "My day at the prison starts at 7.30am, arriving at the main gatehouse to collect my keys and radio. Even after nearly 10 years, it’s still a little bit strange walking through the prison unlocking and locking 8 different doors on the way to the main kitchens. As with all catering jobs when you have got changed into your whites, the first priority is to get the kettle on for the morning coffee. Once we’ve dropped off the breakfast to the wings, we start the day’s task of preparing the food for lunchtime and evening meal."
        },
        {
            "text": "Teaching prisoners valuable skills"
        },
        {
            "text": "Coming from a background of pubs and restaurants, catering for all different backgrounds and ethnicities was something that wasn’t new to me. HMP Grendon have mini kitchens on the wings where prisoners take it in turns to have the responsibility of cooking for the rest of the wing. My role is to support them and teach them valuable skills which are vital for when they leave prison – that's the most rewarding part of the job."
        },
        {
            "text": "\"I have never felt at risk\""
        },
        {
            "text": "The catering sector has been affected by the COVID pandemic, however I’ve been lucky that I have been to work every day and have had support from my workplace and colleagues during that time."
        },
        {
            "text": "The prison service can, at times, be stressful and you can have confrontation with prisoners when they don’t like what you’re explaining to them, but I have never felt at risk. I know that if needed, prison officers are always around to help."
        },
        {
            "text": "\"You feel like you're making a difference\""
        },
        {
            "text": "Even though I don’t work with officers on a regular basis, we always take the time to speak to each other, this includes the Governor and managers. For a prison that has over 350 staff, all the management know your name and you do feel like you’re part of a team. You do feel like you’re making a difference to hopefully help prisoners lead productive lives when they’ve completed their sentence."
        },
        {
            "heading": 6,
            "text": "* This blog post is specific to working at HMP Grendon. Shift patterns for prison caterers vary across prisons."
        }
    ]
}