{
    "url": "https://ssac.blog.gov.uk/2022/10/24/the-future-of-working-age-contributory-benefits-for-those-not-in-paid-work/",
    "title": "The future of working age contributory benefits for those not in paid work",
    "authors": [
        "Carl Emmerson"
    ],
    "categories": [
        "Contributory benefits",
        "Disabled People",
        "DWP",
        "New style ESA",
        "New style JSA",
        "social security",
        "SSAC Independent Work Programme",
        "SSAC Occasional Papers",
        "Universal Credit"
    ],
    "pub_date": "2022-10-24T11:26:38+01:00",
    "content": [
        {
            "text": "The Social Security Advisory Committee’s latest detailed report looks at the two contributory benefits for those of working age who are not in paid work: New Style Jobseeker’s Allowance and New Style Employment and Support Allowance."
        },
        {
            "text": "These have not received much attention over the last decade as, perhaps understandably, the main focus of the Department for Work and Pensions has been on the nationwide roll out of Universal Credit. This follows several decades where successive governments have been content to allow these contributory benefits to shrink in their importance relative to means-tested parts of the system."
        },
        {
            "text": "Our study has found much that works well with these benefits. Generally those receiving them are treated respectfully and compassionately by those administering the system. It is clear that many of those receiving New Style Jobseeker’s Allowance are well-motivated to make a swift return to paid work."
        },
        {
            "text": "But we have also identified a number of areas where too often the system does not work as well as it should, leading to a poor service for those qualifying for contributory benefits. Our view is that this stems from a lack of attention to, and a lack of investment in, these benefits; and with Universal Credit now operating nationwide the time is right for a clearly articulated long-term vision for the role that these benefits should be playing."
        },
        {
            "text": "One option would be move towards integrating these benefits into Universal Credit – so that part of Universal Credit would be available to those with a sufficient contribution record without being means-tested against, for example, their financial assets or their partners earnings. This would improve take-up and, by moving to a single system, eliminate many of the problems that stem from separate systems struggling to work well alongside each other."
        },
        {
            "text": "While such a reform might not be achievable in the near-term having this as a long-run goal would set a clear direction of travel. Reforms and operational changes could then be made gradually over time in order to deliver improvements to how the system works for claimants and how it is administered that brings us closer to the ultimate destination."
        },
        {
            "text": "Our report is with the Secretary of State for Work and Pensions, and we await her response with interest. In the meantime, I hope you find it useful and of interest."
        },
        {
            "text": "You can find our report here."
        }
    ]
}