{
    "url": "https://insideDIO.blog.gov.uk/2022/10/24/when-your-heart-is-in-the-country-understanding-what-makes-the-training-estate-tick/",
    "title": "When your heart is in the country: understanding what makes the training estate tick",
    "authors": [
        "Matt Gillespie"
    ],
    "categories": [
        "Salisbury Plain Training Area",
        "Training Estate Public Safety",
        "Working at DIO"
    ],
    "pub_date": "2022-10-24T16:50:20+00:00",
    "content": [
        {
            "text": "Having recently joined DIO as a Campaigns and Marketing Officer in our Communications team, one of my main responsibilities is to work on our Training Estate Public Safety (TEPS) campaign. "
        },
        {
            "text": "Being new to DIO and the Ministry of Defence as a whole, it would be easy for me to imagine the heart of the organisation is in Main Building in London where I am based. A recent away day was a perfect way to prove otherwise and learn more about our training estate, which will be enormously helpful as we develop our public safety campaign.  "
        },
        {
            "heading": 2,
            "text": "Learning about the Defence Training Estate "
        },
        {
            "text": "I originally thought I understood the size of MOD training estate areas before this visit to Salisbury Plain; I was incorrect. The day started with a briefing about the training areas across the South West – what facilities they have, what sort of training is done there and so on. To see the maps of the different locations stretching from where we were in Wiltshire all the way down to Cornwall was enlightening as it truly put into context the scale of our role in supporting the training estate. The reveal of staff numbers and size and scope of the work we carry out to support training was truly impressive.  "
        },
        {
            "text": "This was followed by a briefing on Salisbury Plain Training Area itself. The history of the area, the use it has for units in specific training scenarios, and the logistical maintenance carried out by our staff and contractors provided for a very informative and impressive briefing. It revealed aspects of DIO and the training estate’s role that I had previously not considered; what falls within our purview is a myriad of responsibilities. It was a fascinating and exciting experience to see one of our most famous training areas, and the largest in the UK in person. Our tour took us across Salisbury Plain, a beautiful landscape which includes both numerous live and dry training zones. Being taken through it I could immediately see the benefits for the units training there. The flexibility the estate offers in creating scenarios is especially striking. "
        },
        {
            "heading": 2,
            "text": "Urban training at Copehill Down "
        },
        {
            "text": "We primarily spent our time on the tour at Copehill Down village. This is a purpose-built urban training facility, designed to replicate a village so personnel can practise attacking or defending on various levels, from the whole village to a single building. It was great to hear from one of the training safety officers about the upgrades being put in place for the village and the facility’s utility for different training goals. "
        },
        {
            "text": "For example, there are smoke machines and piles of rubble which can be moved to block access on the streets, to provide a sense of realism. It’s an incredibly popular training facility which is used very frequently. "
        },
        {
            "heading": 2,
            "text": "Training Estate Public Safety "
        },
        {
            "text": "The briefings also highlighted the challenges facing those trying to ensure public safety on the training estate. Our current campaign, Respect the Range, encourages the public to respect the dangers associated with accessing the training areas with the aim of decreasing near misses and what we call ‘incursions’ which are members of the public being on the training estate when they shouldn’t be. This could be because the area is closed to enable safe training, or perhaps an area which is permanently off limits, such as artillery impact areas. Incursions can be dangerous, with risks including unexploded ordnance and fast-moving vehicles, as well as disruptive to training.   "
        },
        {
            "text": "As the campaign evolves, I will be heavily involved with its roll out and this tour provided me with an on-the-ground introduction to the very real issues faced by our staff. I was given real-life examples of near misses and incursions. These incursions are motivated by different reasons, and to have the Salisbury Plain reasons explained to me was extremely useful. I also gained a deeper understanding of who the national and local stakeholders are that we need to engage with if we are to continue the campaign’s impact and encourage safe access. Safety on the ground is a key priority for us here at the DIO and the opportunity to tour one of our training estates only increases my desire for us to play our part in ensuring that these areas are safe for both our service personnel and the local public.   "
        },
        {
            "heading": 2,
            "text": "Other benefits "
        },
        {
            "text": " My colleagues are based in several UK locations and while we are all now used to virtual collaboration through hybrid working, to meet them in person not only has helped educate me about my role within the organisation, but also underpinned the enthusiasm of my colleagues. An away day like this gives me the opportunity to develop my working relationships and bond with my teammates, which in turns makes us all more effective."
        }
    ]
}