{
    "url": "https://medregs.blog.gov.uk/2022/10/24/world-polio-day/",
    "title": "World Polio Day",
    "authors": [
        "Javier Martin"
    ],
    "categories": [
        "Conferences and events"
    ],
    "pub_date": "2022-10-24T11:34:57+01:00",
    "content": [
        {
            "text": "The global fight to eradicate polio is one of the most successful public health stories in recent years.   "
        },
        {
            "text": "Polio was once one of the most feared childhood illnesses in the world.  It can be contracted at any age, but it overwhelmingly affects children under the age of five.  One in every 200 cases leads to irreversible paralysis in a matter of hours from when it is contracted and, of those, it is estimated that 5-10% die when their muscles essential for breathing lock up.  "
        },
        {
            "text": "From an estimated 350,000 wild poliovirus cases in 1988 to just six reported globally last year, the efforts of public health authorities, regulatory agencies and scientists worldwide have seen incidence rates of the wild virus plummet.  However, given how infectious the virus is, potential resurgence is always a concern. "
        },
        {
            "text": "This is why many countries have developed sophisticated surveillance and immunisation systems, and researchers around the world have together produced a huge body of work in an effort to better understand and therefore overcome the viruses that cause polio. "
        },
        {
            "heading": 2,
            "text": "Our research role "
        },
        {
            "text": "We are a part of that global community and have worked closely with the World Health Organisation since 1971, contributing key research that has underpinned the Global Polio Eradication Initiative (GPEI), leading to greater understanding of aspects such as the antigenic nature of the virus, the genetic basis of attenuation of Sabin’s polio vaccines and the reasons for their genetic instability.   "
        },
        {
            "text": "We have been instrumental in the development and global implementation of non-animal molecular assays for vaccine testing (tests based on the genetic material of the vaccine virus which removes the need for tests in animals).  We also led on designing three new novel oral polio vaccines (nOPV) with greater genetic stability than their forebears.  "
        },
        {
            "text": "Over 500 million doses of the nOPV2 vaccine have been administered in 23 countries since March 2021 alone (with evidence showing it has limited the impact of outbreaks there), and another 16 countries are now verified to use it in the event of an outbreak, from October 2022. "
        },
        {
            "text": "We are also currently leading on the development of the next generation of inactivated polio virus (IPV) vaccines, which are more commonly used in the UK, US and EU, based on hyper-attenuated strains. Working with colleagues at the Universities of Leeds and Oxford, we are also helping develop IPV-like vaccines that do not contain any live virus.  These would not pose any risk of causing a resurgence of polio after its eradication and production would not need to be contained. "
        },
        {
            "text": "We’ve been one of only five WHO Collaborating Centres for Reference and Research on Poliomyelitis since November 1989 as well as one of six WHO Global Specialised Polio Laboratories in the world since January 2000.   "
        },
        {
            "text": "All in all, our research has sat at the heart of polio eradication efforts for over 40 years. "
        },
        {
            "heading": 2,
            "text": "Our surveillance role"
        },
        {
            "text": "However close we are to global eradication of the polio virus, there is always the risk of resurgence, which we saw in London this summer.   "
        },
        {
            "text": "This knowledge was down to the routine environmental surveillance that we have been carrying out in a major sewage site in London since 2016, which we then expanded to more than 30 sites across London following the detection of related poliovirus strains in sequential samples between February and April 2022.  "
        },
        {
            "text": "In essence, sewage samples are collected from each of the sites every fortnight and are transported to our laboratories, where they undergo extensive testing to monitor and track the poliovirus that has been shed by those who are infected, who would mostly be asymptomatic individuals. "
        },
        {
            "text": "This has a real-world impact. It led to the early detection of poliovirus transmission occurring in the UK for the first time since 1984 which instigated a rapid public health response, including enhanced surveillance and an inactivated polio vaccine campaign among children aged 1–9 years, and formed the basis of this paper in the Lancet journal.   "
        },
        {
            "text": "Thanks to the success of this sewage testing, sites outside of London are planned to be added to our environmental surveillance, to provide a broader view of polio throughout Britain. "
        },
        {
            "text": "We do not just test sewage for poliovirus, but also to monitor levels of other viruses such as those that cause serious neurological conditions like acute flaccid myelitis and hand, foot and mouth disease or those causing aseptic meningitis, as well as tracking COVID-19 outbreaks by quantifying the presence of different virus variants during the pandemic. "
        },
        {
            "text": "Domestically, we continue to work closely with partners such as the UK Health Security Agency (UKHSA) and the Joint Committee on Vaccination and Immunisation (JCVI), to provide them with the knowledge they need to make evidence-based policy decisions for polio and other immunisations across the UK.   "
        },
        {
            "heading": 2,
            "text": "Eradication is possible"
        },
        {
            "text": "Our work is crucial, but it is only impactful through both domestic and international collaboration.  We each have a part to play in developing and delivering surveillance and immunisation strategies as well as carrying out the crucial clinical research that has been instrumental in combatting a disease that has caused so much pain to those affected for so many years. "
        },
        {
            "text": "Our work has been, and will continue to be, vital in supporting these global efforts until such a time as we have no more need for a World Polio Day. "
        }
    ]
}