{
    "url": "https://digitalpeople.blog.gov.uk/2025/07/17/how-we-transformed-the-service-owner-role-on-the-capability-framework/",
    "title": "How we transformed the service owner role on the Capability Framework",
    "authors": [
        "Olivia Helliwell, Senior Content Designer, GDS",
        "Jonathan Forman, Head of the Digital Function, Professions, Skills and Communications, Ministry of Defence"
    ],
    "categories": [
        "Capability Framework"
    ],
    "pub_date": "2025-07-17T10:48:05+01:00",
    "content": [
        {
            "text": "Service owners play an important role in the day-to-day activity of teams delivering high quality public services - from passport renewal to providing identification. "
        },
        {
            "text": "These professionals, of which there are currently just over 340 in digital and data roles across government, ensure services meet user needs while navigating the complex intersection of policy, digital and operations."
        },
        {
            "text": "The digital and data roles needed to deliver services in government are defined in the Government Digital and Data Capability Framework. The framework plays a significant role in establishing how departments work, how government attracts high quality talent, and how people are assessed for their level of skill."
        },
        {
            "text": "The service owner role is especially important in government, and particularly in delivering the blueprint for modern digital government. The blueprint emphasises designing services around user needs and creating seamless experiences across organisational boundaries - areas where service owners play a crucial role. "
        },
        {
            "text": "By strengthening this function, we're taking a significant step toward realising the blueprint's vision of digital public services that are efficient, accessible, and truly designed around the needs of the people who use them. Recent data also shows growing numbers of service owners operating at senior levels, meaning improvements to this role are likely to substantially benefit an increasing number of services, and citizen experiences, across the UK."
        },
        {
            "heading": 3,
            "text": "Our collaborative approach to design"
        },
        {
            "text": "Roles on the framework are community-led. This means that the content is developed with subject matter experts who work in these roles. "
        },
        {
            "text": "We assembled a cross-government working group that quickly identified three key challenges:"
        },
        {
            "text": "Meeting every other week from September 2024, the group tackled these issues head on. A key challenge was to reduce the potential for confusion and duplication between the service owner and product manager roles. These roles typically work closely together but have a different focus. By collaborating throughout the development of both roles, we made important changes, such as removing some shared skills, like ‘product ownership’, that didn’t accurately reflect what both roles do."
        },
        {
            "text": "Early on in the process, we created a new short description of the service owner role, which helped us focus our thinking throughout the rest of the work:"
        },
        {
            "text": "‘A service owner is accountable for the quality, performance, benefits and outcomes of a service. They provide clear end-to-end direction, prioritisation and decision making for teams in line with department, policy and user outcomes.’"
        },
        {
            "heading": 3,
            "text": "The refreshed skill set"
        },
        {
            "text": "With this sharpened focus, we redefined the skills required by service owners:"
        },
        {
            "heading": 3,
            "text": "Keeping the framework up to date"
        },
        {
            "text": "With an engaged working group in place, we plan to continue to meet on a regular basis to review feedback and make appropriate, user-informed changes. We are also actively exploring a Senior Civil Servant (SCS) service owner role - there are currently nearly 80 professionals working at this role level across government. "
        },
        {
            "text": "This collaborative effort highlighted the value of sharing experiences as service owners - one of the greatest benefits of our cross-government community. We're now exploring ways to create more opportunities for this knowledge exchange."
        },
        {
            "text": "If you have any feedback on the changes, please contact digitaldatacapabilityframework@dsit.gov.uk.  "
        },
        {
            "text": "The Government Digital and Data Capability Framework works with communities across government to ensure it is up to date and reflects government needs. We encourage you to propose a change to the framework or contact digitaldatacapabilityframework@dsit.gov.uk to find out more."
        }
    ]
}