{
    "url": "https://environmentagency.blog.gov.uk/2025/07/17/inclusive-access-to-work-experience-for-young-people-the-environment-agencys-new-virtual-work-experience-programme/",
    "title": "Inclusive access to work experience for young people: The Environment Agency's NEW Virtual Work Experience Programme",
    "authors": [
        "Environment Agency",
        "Mark Garratt: Environment Agency Deputy Director for Capabilities, Stakeholder Management and Engagement."
    ],
    "categories": [
        "Environment Agency",
        "Flood"
    ],
    "pub_date": "2025-07-17T09:41:19+00:00",
    "content": [
        {
            "text": "Engaging our future workforce"
        },
        {
            "text": "The Environment Agency, working with Defra, has launched our first Virtual Work Experience programme. It introduces young people to the Environment Agency and specifically the work we do in flood and coastal risk management (FCRM). It’s a ground breaking initiative that will benefit the environmental workforce of tomorrow by helping to:"
        },
        {
            "text": "Register an account here."
        },
        {
            "text": "Access for all and social impact"
        },
        {
            "text": "The statistics tell us a powerful story. The Youth Voice Census 2024 revealed that only 36% of young people in secondary school accessed work experience. An estimated 12.5% of all people aged 16 to 24 years in the UK were not in education, employment or training (NEET) in January to March 2025. Young people are missing out on crucial opportunities to prepare for the workplace and could be benefiting from inclusive and impactful work experience."
        },
        {
            "text": "There are barriers to traditional, in-person work experience – geographical distance, transport costs, family circumstances, self-confidence or simply not knowing which employers to approach. Our virtual work experience programme aims to overcome these obstacles. Through any device with a browser, young people can now access high-quality, professionally designed content from homes, schools, or libraries."
        },
        {
            "text": "With this scalable virtual work experience solution, we’re reaching young people far and wide in a truly inclusive way. Encouraging all young people to engage with our organisation, increase their awareness of climate science and the positive impact of choosing green careers.  "
        },
        {
            "text": "What’s included in the programme"
        },
        {
            "text": "We’ve collaborated closely with Defra, in partnership with Springpod, to offer the programme. Our educational specialists have designed 8 comprehensive modules for the target audience of 13- to 18-year-olds. They feature pre-recorded speaker sessions, interactive quizzes, and engaging tasks and will help young people learn about:"
        },
        {
            "text": "Josie Bateman, Director of Innovation, Systems and Services in the FCRM Directorate, explains:"
        },
        {
            "text": " \"Providing a pathway into environmental careers is essential for fostering a diverse and skilled workforce. The Environment Agency's Virtual Work Experience programme equips young people with the knowledge, confidence, and skills to contribute meaningfully to flood and coastal risk management.\""
        },
        {
            "text": "Education, skills and strategic impact: Aligning with Our Mission"
        },
        {
            "text": "This initiative directly supports Ambition 3 of our Flood and Coastal Erosion Risk Management Strategy Roadmap to 2026, which calls for more people to have the education and skills needed for careers in flood and coastal risk management. It's also a key action in our Business Plan 2025 to 2026, helping us become a place where people from all backgrounds can thrive and fulfil their potential."
        },
        {
            "text": "Careers advisors, teachers, lecturers and other educators can signpost young people, with an interest or passion in the environment, science or geography, to our virtual work experience programme. They will gain insights into our organisation, develop knowledge of green careers, and visualise their own career with the Environment Agency.  "
        },
        {
            "text": "Young people who complete the programme will receive a certificate of completion, which demonstrates engagement with their own development and can be added to their CV or personal statement. Young people will develop greater career confidence, enhanced employability and be motivated to make a difference. It will also help improve the visibility and accessibility of the Environment Agency as an employer of choice for the next generation. "
        },
        {
            "text": "Spread the word"
        },
        {
            "text": "The programme is freely available and open for registrations. Whether you're an educator, parent, careers advisor, or someone who simply believes in empowering young people, please encourage the young people in your networks to register now. Share this opportunity with schools, colleges, and youth organisations and help us reach those who might not otherwise discover these pathways into environmental careers."
        },
        {
            "text": "Relevant links: "
        },
        {
            "text": "Environment Agency Opportunities - Your Environment, Your Career | Springpod "
        },
        {
            "text": "Defra | Hub powered by Springpod "
        }
    ]
}