{
    "url": "https://sustainableict.blog.gov.uk/2025/07/17/introducing-our-new-recommendations-paper-for-government-on-the-circular-economy/",
    "title": "Introducing Our New Recommendations Paper for Government on the Circular Economy",
    "authors": [
        "Emily Watson-Breeze"
    ],
    "categories": [
        "Circular economy",
        "GDSA",
        "Sustainable ICT"
    ],
    "pub_date": "2025-07-17T13:48:55+01:00",
    "content": [
        {
            "text": "Emily Watson-Breeze is a Sustainability Activation Manager at BT and is a member of the Government Digital Sustainability Alliance (GDSA) circular economy working group. The views in this post are their own and not the UK government’s."
        },
        {
            "heading": 2,
            "text": "Driving Circularity in Government: New Recommendations from the GDSA circular economy working group"
        },
        {
            "text": "Circular economy principles are gaining traction across all industries—but within government departments and large organisations, adoption remains limited. That’s why the GDSA circular economy working group is proud to release our recommendations paper, a practical guide to overcoming the barriers that hinder circularity in public sector ICT."
        },
        {
            "text": "This paper not only identifies the key challenges but also offers actionable solutions to help organisations transition from linear to circular models of technology use."
        },
        {
            "heading": 2,
            "text": "About the paper"
        },
        {
            "text": "The recommendations paper is the result of a collaborative effort by the circular economy working group, co-authored by:"
        },
        {
            "text": "Their insights, first presented at the GDSA summit in March 2024at the London Science Museum, laid the foundation for this work. Their leadership and insights have been instrumental in shaping this paper, which builds on those discussions. Since then, the group has expanded, welcoming new voices from industry and academia."
        },
        {
            "text": "We’re also excited to share that Ishmael Burdeau (Lead Sustainability Business Architect, DWP) and Ellie Richardson (Head of Donations, DSIT) have joined the conversation, bringing fresh perspectives on end-of-life hardware and e-waste."
        },
        {
            "heading": 2,
            "text": "Why circularity in tech matters"
        },
        {
            "text": "In our digital age, the responsible management of technology is more important than ever. Circularity in tech means designing products with their full lifecycle in mind—so they can be reused, refurbished or recycled instead of ending up in landfills."
        },
        {
            "text": "This approach:"
        },
        {
            "text": "Whether you’re an individual or an organisation, it’s time to rethink what happens to your old devices. Let’s stop letting them gather dust and start putting them back into use, through our collective resource bank."
        },
        {
            "heading": 2,
            "text": "Barriers to circularity"
        },
        {
            "text": "Our research, based on primary research from interviews with government employees and industry peers, highlights 6 critical barriers and opportunities:"
        },
        {
            "text": "We refer to these as parts of a “sustainability engine”—and overcoming each one brings us closer to a truly circular economy."
        },
        {
            "heading": 2,
            "text": "What’s next?"
        },
        {
            "text": "This paper is just the beginning. Our working group will now:"
        },
        {
            "heading": 2,
            "text": "Join the movement"
        },
        {
            "text": "We invite central government departments, public bodies and industry partners to explore the paper and get involved."
        },
        {
            "text": "If your organisation is facing challenges with tech disposal, procurement or sustainability, we want to hear from you. Let’s work together to build a more circular, responsible future for public sector ICT."
        },
        {
            "text": "For more information, read the GDSA recommendations paper."
        }
    ]
}