{
    "url": "https://ofqual.blog.gov.uk/2025/07/17/shedding-new-light-on-access-arrangements-data/",
    "title": "Shedding new light on access arrangements data",
    "authors": [
        "Tom Bramley"
    ],
    "categories": [
        "A levels and GCSEs"
    ],
    "pub_date": "2025-07-17T12:00:00+01:00",
    "content": [
        {
            "text": "I want to explain why we have withdrawn our official statistics on access arrangements today, and what we plan to do next. "
        },
        {
            "text": "We know that these statistics are important for understanding how the exam system works, and have been the subject of some discussion. That is why we are keen to share what we have found and start the process of setting the record straight as soon as possible."
        },
        {
            "text": "Let me start by saying that this problem is about data collection and reporting, not the access arrangements system itself. No student has been or will be affected. "
        },
        {
            "text": "Here’s what you need to know."
        },
        {
            "heading": 2,
            "text": "What are access arrangements?"
        },
        {
            "text": "Access arrangements are based on students’ needs. They fall into 2 categories: “reasonable adjustments” for disabled students and arrangements for those with temporary injuries or other access needs. "
        },
        {
            "text": "Schools and colleges apply to exam boards for access arrangements to help ensure that those students can sit their exams without being unfairly disadvantaged. "
        },
        {
            "text": "The most common form of exam board-approved access arrangement is the granting of 25% extra time in exams.  "
        },
        {
            "heading": 2,
            "text": "What happened?"
        },
        {
            "text": "In 2023 we started considering trends in access arrangements data and began research into how the arrangements were used and perceived in the education sector. As part of this work we requested more detailed data from exam boards, which we received at the end of 2024."
        },
        {
            "text": "We have always recognised that there are limitations to these figures. Our analysis has now revealed that they have led to a significant overstatement of approved access arrangements in place for the exam cohort in each year."
        },
        {
            "text": "The issue was not with how arrangements were granted, but with how the data was recorded and reported. For example:"
        },
        {
            "text": "Initial findings from our analysis suggest that the proportion of students receiving access arrangements – including 25% extra time – is more closely aligned than previously reported to the proportion of students with special educational needs (SEN) reported in the school population."
        },
        {
            "heading": 2,
            "text": "Important points to remember about access arrangements"
        },
        {
            "text": "Our analysis gives a more accurate picture of access arrangements in place for students actually taking an examination in any given academic year. In doing so, it has not revealed any evidence of misuse or systemic failure. This has been a technical issue with reporting rather than how the system has been used."
        },
        {
            "text": "The approach to access arrangements remains unchanged. Schools and colleges should continue to apply for access arrangements as they always have, following the same JCQ guidance."
        },
        {
            "heading": 2,
            "text": "What’s next?"
        },
        {
            "text": "We will publish revised statistics in late 2025, covering the academic years from 2020 to 2021 onwards. These will be designated as “official statistics in development” and will include confidence ranges to reflect the complexity of the data."
        },
        {
            "text": "They won’t be perfect, but they will give a much more accurate picture than previously. We will be working with exam boards to improve the quality of the data they give us in future so that the quality of the overall statistics continues to improve."
        },
        {
            "text": "We also plan to publish a report explaining our review of evidence (including the new data analysis), as well as research into perceptions of 25% extra time in exams."
        },
        {
            "text": "This long-term research, as well as our work to improve the official statistics, shows our commitment to improving the understanding and transparency of this important part of the qualifications system."
        },
        {
            "text": "Tom BramleyExecutive Director, Research and Analysis, Ofqual"
        }
    ]
}