{
    "url": "https://extremismcommission.blog.gov.uk/2022/11/09/commissioner-robin-simcox-visits-wales-to-meet-the-welsh-government-and-leading-counter-extremism-academics-and-professionals/",
    "title": "Commissioner Robin Simcox visits Wales to meet the Welsh Government and leading counter-extremism academics and professionals",
    "authors": [
        "timparker"
    ],
    "categories": [
        "Blog",
        "Latest news",
        "Uncategorized"
    ],
    "pub_date": "2022-11-09T15:39:42+00:00",
    "content": [
        {
            "text": "Engagement is a key element of the CCE’s work, helping us develop a broad understanding of the overall impact and threat of extremism."
        },
        {
            "text": "As part of this ongoing effort, the Commissioner for Countering Extremism, Robin Simcox, travelled to Wales recently to engage the Welsh Government and leading counter-extremism academics and professionals on the challenge of extremism."
        },
        {
            "text": "Robin was first hosted at a roundtable event by Cyber Threat Research Centre (CYTREC) at Swansea University, which focused on research projects being undertaken to better understand extremism. The discussion raised the importance of offline relationships in the radicalisation process and highlighted how the distinction between online and offline was not always as pronounced as some research suggests."
        },
        {
            "text": "The next morning, Robin travelled to Cardiff Bay to meet Welsh Minister for Social Justice, Jane Hutt MS. The MSJ reflected on the impact of Hate Awareness Week and the role of the Victim Support Hate Crime Centre in Wales as well as understanding the presence of extremism in relation to hate fuelled ideologies. Robin highlighted the importance of the CCE as a partner to the Welsh government."
        },
        {
            "text": "In the afternoon, Robin held a roundtable with counter extremism professionals in Cardiff County Hall. This included representatives from the council’s Prevent team, hate crime officers, local law enforcement and probation leads."
        },
        {
            "text": "Robin explained the role of the CCE and the benefits of collaboration with the Commission and our networks. They gave Robin an understanding of the local risk priorities and their approach for tackling them."
        },
        {
            "text": "Robin’s final engagement was with Civil Society Organisations (CSOs) who work in the Cardiff community. Robin wanted to hear about the local challenges they face in countering extremist narratives while being able to discuss opportunities for collaboration."
        },
        {
            "text": "Reflecting on his visit, Robin says:"
        },
        {
            "text": "“Some of the challenges Wales faces from extremism are similar to those elsewhere. Others have a unique, localised component."
        },
        {
            "text": "On both fronts it was encouraging to meet so many dedicated professionals who are focused on tackling extremism. I was impressed by their commitment to disrupting and preventing those who seek to cause harm to individuals and wider society."
        },
        {
            "text": "I was pleased to be able to share our insights and very much value ongoing engagement with our partners in Wales.”"
        }
    ]
}