{
    "url": "https://competitionandmarkets.blog.gov.uk/2022/11/09/do-you-have-a-ppi-policy/",
    "title": "Do you have a PPI policy?",
    "authors": [
        "Adam Land"
    ],
    "categories": [
        "Consumer protection",
        "Remedies"
    ],
    "pub_date": "2022-11-09T15:01:31+00:00",
    "content": [
        {
            "heading": 3,
            "text": "What is PPI? "
        },
        {
            "text": "PPI is a form of insurance. It is usually sold with products taken out on credit, including mortgages and credit cards.  "
        },
        {
            "text": "PPI policies cover your mortgage or credit repayments for a period of time and in certain circumstances where you are unable to make them yourself, such as if you are made redundant or cannot work due to an accident or illness.  "
        },
        {
            "text": " "
        },
        {
            "heading": 3,
            "text": "The obligation to provide an Annual Review Statement "
        },
        {
            "text": "In most circumstances, the provider of your PPI policy must send you an Annual Review Statement. "
        },
        {
            "text": "The statement will tell you: "
        },
        {
            "text": "The statement reminds you of your PPI policy and of its costs and benefits. It helps you decide whether you wish to keep the policy with your existing provider, switch to a different provider or cancel your policy. "
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "heading": 3,
            "text": "Cancelling your PPI policy "
        },
        {
            "text": "You have the right to cancel your PPI policy at any time and it will not affect the linked credit product that is being insured, such as your mortgage or credit card.  "
        },
        {
            "text": "At the bottom of your Annual Review Statement, more details should be provided on how you can cancel your PPI policy. Your PPI provider cannot charge you to cancel your policy.  "
        },
        {
            "text": " "
        },
        {
            "heading": 3,
            "text": "The Order "
        },
        {
            "text": "Providers must send you an Annual Review Statement by law. In 2011, The Competition and Markets Authority (CMA) introduced the Payment Protection Insurance Market Investigation Order (the Order) after it found that consumers faced higher prices and fewer choices than they should. The Order introduced a package of remedies to address the problems identified in our Market Investigation, including some significant restrictions on what parties selling PPI and credit can do.  "
        },
        {
            "text": " "
        },
        {
            "heading": 3,
            "text": "Report a PPI provider "
        },
        {
            "text": "If you have a complaint about a possible breach of the Payment Protection Insurance Market Investigation Order 2011 contact us at RemediesMonitoringTeam@cma.gov.uk. The Order requires that: "
        }
    ]
}