{
    "url": "https://deframedia.blog.gov.uk/2022/11/09/flood-action-week-2/",
    "title": "Flood Action Week",
    "authors": [
        "Defra Press Office"
    ],
    "categories": [
        "Environment Agency"
    ],
    "pub_date": "2022-11-09T13:58:18+00:00",
    "content": [
        {
            "text": "There has been widespread coverage of Environment Agency warnings to be prepared for possible flooding this winter, as it continues its awareness campaign - Flood Action Week - to encourage those who live in areas at risk of flooding to act now to protect their home, possessions and family."
        },
        {
            "text": "Coverage has appeared in print, online and broadcast with The Guardian, The Daily Telegraph, The Daily Star, BBC News Online, The Mirror, iNews, Daily Express, The Independent and Press Association all highlighting the need for people to be aware of their flood risk and be prepared to act if flooding hits this winter."
        },
        {
            "text": "Separately, Caroline Douglass, Executive Director of Flooding at the Environment Agency, carried out interviews with Times Radio and BBC Radio 4’s Today Programme in which she highlighted the need for people to be aware of flood risk wherever they live in England and that people check their flood risk online."
        },
        {
            "text": "There has also been significant regional coverage of Flood Action Week, with publications including The Yorkshire Post, Lancashire Evening Telegraph, Shropshire Star, Northamptonshire Telegraph, Kingsbridge & Salcombe Gazette and Dartmouth Chronicle all highlighting Environment Agency warnings for England to plan and prepare for increasingly extreme events."
        },
        {
            "text": "As we have seen across the globe, the effects of climate change are becoming clearer, with wildfires raging across Europe; China experiencing its worst heatwave in decades; and devastating floods in Pakistan ripping through communities killing more than 1500 people and displacing millions."
        },
        {
            "text": "This Flood Action Week (7 November – 13 November) the Environment Agency is urging people to take three simple steps:"
        },
        {
            "text": "Caroline Douglass, Executive Director of Flooding at the Environment Agency, said:"
        },
        {
            "text": "Floods Minister Rebecca Pow said:"
        },
        {
            "text": "With over 250 mobile pumps and 5,000 trained staff across the country, the Environment Agency is ready to take action wherever it is needed this winter. The construction and repair of flood defences has also continued throughout the year as part of the record £5.2 billion government investment in flood and coastal defences."
        },
        {
            "text": "These preparations have already helped to protect communities from flooding. During the storms earlier this year, despite some 400 properties sadly flooding, around 35,000 were protected by Environment Agency schemes."
        },
        {
            "text": "Will Lang from the Met Office said:"
        },
        {
            "text": "Follow Defra on Twitter, and sign up for email alerts here."
        }
    ]
}