{
    "url": "https://gdsgeospatial.blog.gov.uk/2022/11/09/global-britain-leading-the-geospatial-way/",
    "title": "Global Britain leading the geospatial way",
    "authors": [
        "Jamie Clark, Deputy Director, Geospatial Commission"
    ],
    "categories": [
        "Data",
        "Technology"
    ],
    "pub_date": "2022-11-09T13:00:58+00:00",
    "content": [
        {
            "text": "The Integrated Review of Security, Defence, Development and Foreign Policy set an aim to secure the UK’s status as a science and technology superpower. The UK’s geospatial community is doing its bit towards this goal with a very successful trip to the UN World Geospatial Information Congress and external recognition as the UK retained its position as second in the world for geospatial capability."
        },
        {
            "text": "In October, the UK sent a diverse delegation to the second UN World Geospatial Information Congress (UNWGIC) in Hyderabad, India. Led by Thalia Baldwin and David Henderson, the UK delegation included representation from the Foreign, Commonwealth & Development Office, Ordnance Survey, Office of National Statistics, British Geological Survey, UK Hydrographic Office and the Geospatial Commission. The UK’s representation was further supported by a range of private sector colleagues from across the geospatial ecosystem."
        },
        {
            "text": "The congress was convened by the United Nations Committee of Experts on Global Geospatial Information Management (UN-GGIM), organised by the Department of Economic and Social Affairs of the United Nations, and hosted by the government of India."
        },
        {
            "text": "Held every four years, the UNWGIC is an opportunity to promote collaboration and conversation on the use of location data services and technology globally. Relevant governments, non-governmental organisations, academia and the private sector were involved, engaging the younger and the under-represented in society with an overarching theme: “Geo-Enabling the Global Village: No one should be left behind.”"
        },
        {
            "heading": 2,
            "text": "UK participation at UNWGIC"
        },
        {
            "text": "Presentations from the UK delegation covered a range of topics that showcased the UK’s work and leadership on geospatial, data and technology. There was significant international interest in the role of the Geospatial Commission itself and how we set direction through the UK’s Geospatial Strategy, uniting various aspects of the UK ecosystem together. We presented our work on the policy aims of the Q-FAIR (quality, findable, accessible, interoperable and reusable) framework, the National Underground Asset Register (NUAR), location data ethics and measuring the value of location data."
        },
        {
            "text": "The conversations around data ethics and the value of data were of particular interest to UNWGIC audiences, with barely-contained excitement from several of the attendees which gave the session moderators a really nice challenge! It was great to see and a moment which made me appreciate, what an honour it is to work with the colleagues that I have in the Geospatial Commission and to be part of such a great UK delegation."
        },
        {
            "text": "The number, quality and breadth of all of the UK presentations really demonstrated the UK’s expertise right across the geospatial ecosystem. It confirmed that we are amongst those nations leading the way in terms of the global conversation about geospatial and helping others to develop their capabilities."
        },
        {
            "heading": 2,
            "text": "UK retains second place"
        },
        {
            "text": "This view is further supported by the publication of the Geospatial Knowledge Infrastructure Readiness Index and Value Proposition for World Economy, Society, and Environment’ which was launched by Stefan Schweinfest, Director of the United Nations Statistics Division, at the UNWGIC. This index ranks the countries based on Integrated Geospatial Information Framework (IGIF) adoption, foundation data, partnerships and collaboration, industry leadership, application and user adoption of data, and finally data access, capability building and digital readiness. The index places the UK as number two in the world, behind the USA."
        },
        {
            "text": "This conveniently brings me to my first take away from UNWGIC - it is almost like I planned it this way – which is that as we strive to further improve the quality, access, and use of geospatial data it is easy to focus on the negative elements of our ecosystem that need to be addressed and to lose sight of the fact that the UK ecosystem is world-leading. As a result, others are looking to the UK for leadership and guidance as they build and develop their own geospatial capabilities."
        },
        {
            "text": "The fact that you have a) opened this blog at all, and b) have read to this point you are clearly part of the UK geospatial ecosystem in some way shape or form. I would therefore like to propose that once you get to the end of this blog you make a cup of tea (other beverages are available) and take a moment to just reflect with a degree of pride on the current state of the UK ecosystem and your contribution to the UK’s geospatial capability and global standing. Thank you!"
        },
        {
            "heading": 2,
            "text": "Call for evidence to identify geospatial opportunities"
        },
        {
            "text": "However, time waits for no one, and like a good cup of tea if you do not pay attention before you know it has gone cold and ceases to be appealing any longer. This leads me onto my second take away and that is we cannot be complacent. From the range of talks and exhibitions at UNWGIC, it is clear how rapidly other countries are developing their capabilities aided by new technologies and uninhibited by legacy systems. This means they are able to make huge jumps in terms of the data and insights that they are able to realise, which is in turn having a profound impact on their decision-making and their abilities to leverage their respective global competitive advantage."
        },
        {
            "text": "It is therefore critical that as a UK ecosystem we do not rest on laurels and continue to push the envelope in terms of thought leadership, policy development, technological enhancement, data capture and analytical capabilities."
        },
        {
            "text": "The Geospatial Commission currently has a Call for Evidence open for responses as part of its work to refresh the UK’s Geospatial Strategy. This provides an opportunity to share your views on the future of the UK ecosystem, and I would encourage anyone reading this to consider responding and sharing with your networks."
        },
        {
            "text": "The Call for Evidence is open until Monday 12 December 2022. A refresh of the UK’s Geospatial Strategy is due to be published in spring 2023."
        },
        {
            "text": "You can also sign up to get an email notification every time we publish a new blog post. For more information about this and other news see our website, or follow us on Twitter and LinkedIn."
        }
    ]
}