{
    "url": "https://ruralpayments.blog.gov.uk/2022/11/09/improving-the-mapping-experience-for-farmers/",
    "title": "Improving the mapping experience for farmers",
    "authors": [
        "RPA Editor"
    ],
    "categories": [
        "Mapping"
    ],
    "pub_date": "2022-11-09T11:00:34+00:00",
    "content": [
        {
            "text": "As part of our commitment to improve the mapping experience for farmers, Rural Payments Agency (RPA) is making further improvements to the RLE1 mapping process, which is used by farmers and land agents to update land data, land links and entitlements."
        },
        {
            "heading": 2,
            "text": "The current process"
        },
        {
            "text": "RPA uses digital maps to record physical land parcel boundaries and features, so accurate payments can be made to farmers."
        },
        {
            "text": "RPA maps and tracks 2.6million land parcels, using a range of intelligence and technology to keep these as accurate as possible. When we process claims for payments we check this data against the claim data we get from farmers and if there is a difference we have to resolve it. RPA uses aerial photography, satellite imagery and Ordnance Survey information to check against our oldest parcels. A mix of zones are selected each year and digitisers compare the images to the claims and our mapped land parcels and land covers."
        },
        {
            "text": "RPA currently receives over 20,000 RLE1 forms each year requesting mapping changes, with the majority submitted during a two-month window from mid-April to mid-June, and a timely turnaround is reliant on farmers and land managers providing accurate information. This is also important as farmers need to ensure their digital maps correctly show the agricultural land parcels on their holding to apply for, or claim, rural payments. If the data on the RLE1 form is inaccurate or incomplete, or maps are incorrect or missing, this can lead to mapping change delays."
        },
        {
            "text": "We have also increased the use of geospatial data to reduce the visit burden. Geospatial data is geographical data which includes legal boundaries, reference features, land cover types, linear features and background imagery. The RPA’s mapping team is responsible for the delivery of mapping updates to ensure timely payments. We use this information to monitor any issues with scheme controls, concerns from farmers, and areas where advice is being requested. This is helping us to support farmers and land managers to meet outcomes before Field Officers visit."
        },
        {
            "heading": 2,
            "text": "Next steps"
        },
        {
            "text": "Over the next year, we will explore digital options that can be accessed online, whilst ensuring we maintain accessibility for all. We are excited at the difference these changes will make and will be seeking feedback to look at the best way to improve the experience for farmers and land managers."
        },
        {
            "text": "We are exploring options to allow farmers and land managers to amend their land details online which is aiming to reduce the amount of time to submit land changes and improve processing times. Options are currently being reviewed and will be outlined further at a later date. This builds on the RLE1 improvements made in 2020, when a new process was launched, which gave the option of completing a digital RLE1 form. This has proven to be a popular submission route, with over 75% of the forms now being received via email."
        },
        {
            "text": " "
        },
        {
            "text": "Unlike the Basic Payment Scheme (BPS) and Countryside Stewardship (CS) applications, new schemes like the Sustainable Farming Incentive scheme (SFI) can’t proceed if there is outstanding mapping work, so these improvements would shorten turnaround times and streamline the process to meet the needs of farmers in current and new schemes. This will greatly improve the time it takes to submit a land change and there will be continual improvements as we move forward in this area, based on feedback from farmers."
        },
        {
            "text": " "
        },
        {
            "heading": 2,
            "text": "How you can help"
        },
        {
            "text": "You can help us by making sure all the required fields are completed within the RLE1 form, make clear and accurate annotations on any maps, respond promptly to RPA requests for further information and follow the guidance when emailing RLE1 forms. When you send your RLE1 form to RPA to make mapping changes to your registered land, it’s important you send accurate sketch maps. You should use your sketch maps alongside aerial photography and Ordnance Survey map updates to amend your information, rather than the RLE1."
        },
        {
            "text": "You can see digital maps of all the land parcels registered to your holding using the Rural Payments service on GOV.UK. If the digital maps don’t show all your land correctly, you can make changes in the Rural Payments service or by filling in an RLE1 form. An RLE1 form also needs to be used to register a land parcel for the first time or to make any other changes."
        }
    ]
}