{
    "url": "https://healthmedia.blog.gov.uk/2022/11/09/nhs-industrial-action-media-fact-sheet/",
    "title": "NHS industrial action - media fact sheet",
    "authors": [
        "DH Media Centre"
    ],
    "categories": [
        "NHS",
        "Workforce"
    ],
    "pub_date": "2022-11-09T15:00:12+00:00",
    "content": [
        {
            "text": "The Royal College of Nursing has announced the result of their ballot."
        },
        {
            "text": "This fact sheet sets out the Department of Health and Social Care’s position on industrial action, as well as information on the pay offer made to NHS workers for 2022/23 and how the government is working with the NHS to prepare for potential disruption. Full details of the pay award are published here."
        },
        {
            "text": "Health and Social Care Secretary Steve Barclay said:"
        },
        {
            "text": "“We are all hugely grateful for the hard work and dedication of NHS staff, including nurses, and deeply regret that some union members have voted for industrial action."
        },
        {
            "text": "“These are challenging times, which is why we accepted the recommendations of the independent NHS Pay Review Body in full and have given over one million NHS workers a pay rise of at least £1,400 this year. This is on top of a 3% pay increase last year when public sector pay was frozen and wider government support with the cost of living."
        },
        {
            "text": "“Our priority is keeping patients safe during any strikes. The NHS has tried and tested plans in place to minimise disruption and ensure emergency services continue to operate.”"
        },
        {
            "text": "Q&A "
        },
        {
            "text": "Q: What is the Royal College of Nursing asking for? "
        },
        {
            "text": "Q: What is the government offering? "
        },
        {
            "text": "Q: How much are nurses getting paid? "
        },
        {
            "text": " Q: Is this a fair deal? "
        },
        {
            "text": "Q: How is pay decided? "
        },
        {
            "text": "Q: Will patient care be affected? "
        },
        {
            "text": "Q: Will the government go back to the negotiation table with unions? "
        }
    ]
}