{
    "url": "https://insidedio.blog.gov.uk/2022/11/09/supporting-exercise-cerberus-in-germany-all-in-a-days-work/",
    "title": "Supporting Exercise Cerberus in Germany: All in a day’s work",
    "authors": [
        "Lt Col Robert Mather"
    ],
    "categories": [
        "British Army",
        "Explosive Ordnance Clearance",
        "Germany",
        "Military Training",
        "Sennelager"
    ],
    "pub_date": "2022-11-09T09:18:53+00:00",
    "content": [
        {
            "text": "A Warrior leaves after visiting a command post on Exercise Cerberus 2022. [MOD Crown Copyright 2022]Exercise Cerberus 22 was the Army’s largest and most ambitious Field Army exercise in Europe for a decade. With 3,500 soldiers and 800 vehicles involved the exercise provided the opportunity to test the five different Brigade Headquarters within the Warfighting Division to validate them and ensure they are ready to play their part in any warfighting operations."
        },
        {
            "heading": 2,
            "text": "The purpose of Exercise Cerberus"
        },
        {
            "text": "This year the exercise took place in the NATO Forward Holding Base in Sennelager, Germany and involved other NATO members including US, French and German allies."
        },
        {
            "text": "The large-scale command post exercise aims to confirm that the five British Army brigade headquarters that sit within the division are ready for operations. This year the exercise, previously held in the UK on Salisbury Plain Training Area, moved to its new central European location to test its ability to move personnel and equipment on a large scale and to operate in an expeditionary setting rather than being close to home."
        },
        {
            "heading": 2,
            "text": "The role of DIO staff in Exercise Cerberus"
        },
        {
            "text": "DIO staff out in Germany are responsible for the safety and compliance of all built assets on the MOD estate in Germany as well as being responsible for delivering a Safe Place to Train. The area covers 120km2 and we are responsible for 17 in-use live fire ranges. During Exercise Cerberus the team out in Germany were extremely busy!"
        },
        {
            "text": "To prepare for the exercise – as we do for all exercises out here in Germany – the team ensured the availability of suitable living, catering and technical accommodation for troops, and prepared the training area for use by the 3 UK Division staff to conduct a dry training command exercise which, incidentally, was the largest activity for decades on the area."
        },
        {
            "heading": 2,
            "text": "The challenges of supporting such a large exercise"
        },
        {
            "text": "The biggest challenge we faced was the fact that the area has been used as a live fire area for over 130 years, which has inevitably left an explosive legacy. During the preparation phase there was a significant residual Unexploded Ordnance (UXO) risk which we needed to deal with. Working closely with 35 Engineer Regiment (Explosive Ordnance Disposal [EOD] and Search unit) personnel – who deployed their specialists to conduct specific area clearance – and a civilian EOD contractor we were able to make the area safe for the exercise."
        },
        {
            "text": "During the exercise DIO’s Range Control staff were always on hand to offer support either face to face or by telephone or radio. We also conducted regular perimeter patrols to prevent potential incursions by the public which could have potentially disrupted the exercise. We provided logistic and medical advice and guidance throughout too and acted as the liaison with the emergency services in the event of an incident."
        },
        {
            "text": "ATDU Army Trials and Development Unit conduct exercises using new tactics and procedures to test how they would work on Exercise Cerberus 2022. [MOD Crown Copyright 2022]During the exercise there were two critical situations which Range Control assisted with. First was the discovery of two WW1 77mm chemical shells! Together with the German Government (who sent their specialist chemical EOD staff to the site to conduct the assessment) we worked to dispose of the shells which thankfully prevented the exercise from being cancelled. The other situation was dealing with a medical emergency that involved coordinating civilian emergency services access onto the area to collect the casualty."
        },
        {
            "heading": 2,
            "text": "Keeping the training area running: prepare, use and reset"
        },
        {
            "text": "As the exercise began to close down, DIO staff were involved in returning the training areas back to their original state; we conducted damage assessments and repair planning, effectively cleared waste, including contaminated waste, and provided suitable vehicle wash down facilities to the exercising troops."
        },
        {
            "text": "Soldiers on Ex Cerberus 22. [MOD Crown Copyright 2022]While all of the above was going on we were also preparing for the Bundeswehr (German Forces) to arrive for a two week live fire package which included the use of all 17 ranges plus every element of the area, which all required additional focus and resources."
        },
        {
            "text": "There’s never a dull day for the team out here in Germany as we support military training and conduct a continual cycle of prepare, use and reset."
        },
        {
            "text": " "
        }
    ]
}