{
    "url": "https://hmlandregistry.blog.gov.uk/2022/11/09/why-work-in-it-at-hm-land-registry/",
    "title": "Why work in IT at HM Land Registry?",
    "authors": [
        "Richard Horton, Lead Infrastructure Engineer"
    ],
    "categories": [
        "Working at HM Land Registry"
    ],
    "pub_date": "2022-11-09T09:55:47+00:00",
    "content": [
        {
            "text": "IT Operations makes sure that vital land registration work can take place 24 hours a day."
        },
        {
            "text": "Some call it keeping the lights on, others call it business as usual, but to those of us working in IT Operations it can be a passion, a job for life or purely about the pleasure and satisfaction that comes from helping to support our hardworking colleagues within HM Land Registry."
        },
        {
            "text": "I’m Richard, I’m a husband, a father, a volunteer football coach and probably set to become another HM Land Registry “lifer”. I joined back in 2003 and have been lucky enough to work in IT Operations for over 18 years in various roles."
        },
        {
            "heading": 2,
            "text": "Variety and opportunities"
        },
        {
            "text": "IT Operations offers varied, wide-ranging opportunities for all."
        },
        {
            "text": "IT engineering roles within IT Operations are amazingly varied. On a daily basis the staff are building, supporting and maintaining systems and services on a multitude of platforms. We host services in both Amazon Web Services and Microsoft Azure, we have core IBM infrastructure in our secure data centres and we also use hosted software from various multinational vendors as a service solution."
        },
        {
            "text": "Opportunities to develop by working in different teams and technical areas are also encouraged. I started off as a network engineer with limited knowledge on IP addresses and subnetting – I developed into an engineer competent in routing protocols and firewall configurations. But what was great was that I was able to develop relationships with others, learning from those people to become a rounded engineer. Eighteen months ago, an opportunity arose to lead our Azure Platform Team and I saw this as a great time to move across into an exciting new technology. This team was born out of the pandemic but now the organisation has committed to a virtual desktop future, meaning investment in people and technology."
        },
        {
            "heading": 2,
            "text": "What are the benefits?"
        },
        {
            "text": "Other than the chance to learn and excel in various technologies, what is it that has kept me and so many other friends and colleagues working together for nearly two decades?"
        },
        {
            "text": "Yes, there are all the important benefits (below) but to me it’s more than that. HM Land Registry is like a family; when the chips are down, we work together to solve problems. Outside of that we work together to deliver better services to our customers whether internal or external – they all matter."
        },
        {
            "text": "HM Land Registry benefits"
        },
        {
            "text": " "
        }
    ]
}