{
    "url": "https://defradigital.blog.gov.uk/2022/11/09/why-i-enjoy-being-a-business-analyst-in-defra/",
    "title": "Why I enjoy being a business analyst in Defra",
    "authors": [
        "Rose Rothery"
    ],
    "categories": [
        "Defra digital"
    ],
    "pub_date": "2022-11-09T07:30:07+00:00",
    "content": [
        {
            "text": "Rose Rothery shares her passion for business analysis and explains how Defra’s purpose, and the variety of work she does, has kept her wanting more."
        },
        {
            "text": "I’ve worked at Defra in a business analysis capacity for four years. It’s fair to say I’ve taken a somewhat roundabout route to get to where I am now."
        },
        {
            "text": "My journey to become a business analyst (BA) has seen me working in the public, private and third sectors, and not just in business analysis. All the experiences that brought me here have made me even more convinced that I chose the right path."
        },
        {
            "heading": 2,
            "text": "How I got here"
        },
        {
            "text": "It all began when I did a sandwich year at M&S while at university, and then I joined their IT graduate scheme once I finished my studies. During that placement I did stints in project management, software engineering and business analysis, but I decided that business analysis was the role that most interested me."
        },
        {
            "text": "Why? Well, I really enjoyed going out, building relationships, and talking to the business. I particularly enjoyed taking requirements from the business and translating these for technical users."
        },
        {
            "text": "Following that experience, I worked as a business analyst in the public and charity sector for a while, before taking a gap year to go travelling. When I returned, I trained to be a teacher, and I actually worked as a teacher for a few years, before taking time out when my children were young."
        },
        {
            "text": "When I began looking for a return to work, I felt I’d really missed the intellectual challenge and variety of business analysis, and so I decided to try and get back into that profession."
        },
        {
            "text": "I joined Defra 2018; I was looking for a job in an organisation with a purpose, where I could give back and make a difference. I also really liked the office space in Bristol when I went in for an interview!"
        },
        {
            "heading": 2,
            "text": "What a BA does"
        },
        {
            "text": "Business analysis requires you to tease out and analyse business and user requirements. If we’re going to help design, build and deliver services and solutions which meet our user’s needs, we need to engage and collaborate positively. Key tasks include:"
        },
        {
            "heading": 2,
            "text": "What I’ve been working on"
        },
        {
            "text": "I’ve been working on Flood and Coastal Risk Management (FCRM) with the Environment Agency for about three years."
        },
        {
            "text": "To begin with though I worked on the Asset Information Management System Programme Delivery, a large complex business and technology change programme. That involved requirements-gathering and creating documentation, defining the work packages and the programme roadmap."
        },
        {
            "text": "Then I moved to the FCRM Virtual Team. Virtual teams work in the strategic pre-project space, a DDTS and business partnership to deliver their programme. I led on analysis of pipeline initiatives, ensuring that we developed a solid grasp of the business problem, the potential root-cause, and the current/future landscapes."
        },
        {
            "text": "Virtual teams are great because you get to work with even more stakeholders, particularly from across our own Digital, data and technology services function, looking at the incoming ideas from the business to ensure that they align with strategy."
        },
        {
            "heading": 2,
            "text": "What I enjoy about the role"
        },
        {
            "text": "I really enjoy working with people in the business who are passionate about what they are doing, and who are ambitious to make a difference. For example, working on projects that will reduce the risk to homes, people, and habitats from flooding. I also enjoy being part of a strong, friendly and supportive BA community. We have a community of practice that meets regularly to share experiences and best practice."
        },
        {
            "text": "My work is varied – I’ve been on agile teams, where delivery is fast-paced and you see regular outputs going live on government portals, as well as on waterfall projects."
        },
        {
            "text": "The thing that keeps me here is the constant learning, the intellectual challenge – I’m always picking up knowledge from the rest of the project team and the business."
        },
        {
            "text": "Also, there is variety, with lots of opportunities to work on different kinds of projects, and with different arms-length bodies, or to contribute to how the business analysis function operates across the Defra group of organisations."
        },
        {
            "text": "I’m actually currently working as a principal business analyst, which is a grade higher than I normally work, and which of course illustrates my point about there being opportunities here."
        }
    ]
}