{
    "url": "https://nationalscreening.blog.gov.uk/2024/05/28/gregs-passion-for-improving-health-and-following-the-evidence/",
    "title": "Greg’s passion for improving health and following the evidence",
    "authors": [
        "Mike Harris"
    ],
    "categories": [
        "Uncategorized"
    ],
    "pub_date": "2024-05-28T07:57:41+01:00",
    "content": [
        {
            "text": "Greg Fell is Director of Public Health (DPH) for Sheffield, President of the Association of Directors of Public Health (ADPH) and the public health expert member of the UK National Screening Committee (UK NSC)."
        },
        {
            "text": "He grew up in Scunthorpe, enjoyed science at school and studied biochemistry and physiology at the University of Nottingham. After graduating in 1993, Greg realised he did not want to join his peers into careers as biochemists, science teachers or working for pharmaceutical companies. Happily, he found work as a social researcher at Hull University’s Nursing School, investigating smoking and drinking in pregnancy, and sparking his interest and future career in public health."
        },
        {
            "text": "Greg worked in several NHS organisations before becoming a public health programme manager in a primary care trust where he was encouraged to join the public health training programme."
        },
        {
            "heading": 2,
            "text": "The ‘best job ever’"
        },
        {
            "text": "Greg’s traineeship included 9 months with Jenny Carpenter, a senior civil servant and public health consultant responsible for screening and specialised commissioning policy at the Department of Health."
        },
        {
            "text": "During that time, he worked with former UK NSC director Sir Muir Gray and current incumbent Professor Anne Mackie. He said:"
        },
        {
            "text": "After completing his public health training, Greg worked for 7 years as a consultant in public health in Bradford in the primary care trust and then at Bradford council."
        },
        {
            "heading": 2,
            "text": "Success through teamwork"
        },
        {
            "text": "Greg has been DPH for Sheffield since February 2016 and loves the role’s variety."
        },
        {
            "text": "Directors of Public Health are responsible for the health of residents in their area. It’s a complex job that involves protecting communities from outbreaks of disease, promoting good health, measures to improve health, health intelligence and data analysis, and collaborating with many people and organisations. The role requires excellent communication skills and the ability to think on your feet."
        },
        {
            "text": "Greg is particularly proud of the work done to reduce smoking harms."
        },
        {
            "text": "Greg’s work involves deciding how to allocate the public health grant for Sheffield on services ranging from sexual health and drug and alcohol treatment to health visiting and Citizens Advice."
        },
        {
            "text": "Having previously been a member of the board of the ADPH, Greg was appointed President in October 2023."
        },
        {
            "heading": 2,
            "text": "High evidential bar essential for screening"
        },
        {
            "text": "Greg’s long-standing interest in screening led to him applying for the public health role on the UK NSC and he has thoroughly enjoyed it."
        },
        {
            "text": "The UK NSC’s biggest upcoming challenges include assessing new technologies such as polygenic scores and multi-cancer early detection tests. Greg said:"
        },
        {
            "text": "Greg follows Sir Muir’s mantra that all screening does harm, some does good as well and some does more good than harm at reasonable cost."
        },
        {
            "heading": 2,
            "text": "Home life equally busy"
        },
        {
            "text": "Away from work, Greg is married with 3 children (one now at university), 2 dogs, 3 chickens, a duck and 2 bicycles."
        },
        {
            "text": "Like fellow committee members Anneke Lucassen and Anne Slowther, Greg is a keen cyclist who can be found on his bike at weekends and summer evenings. He said:"
        },
        {
            "heading": 2,
            "text": "Keep up to date"
        },
        {
            "text": "The UK NSC blog provides up to date news from the UK NSC. You can register to receive updates direct to your inbox, so there is no need to keep checking for new articles. If you have any questions about this blog article, or about the work of the UK NSC, please email uknsc@dhsc.gov.uk."
        }
    ]
}