{
    "url": "https://defradigital.blog.gov.uk/2022/03/31/being-a-content-designer-six-values-to-consider/",
    "title": "Being a content designer: six values to consider",
    "authors": [
        "Laura Churchill"
    ],
    "categories": [
        "Defra content design",
        "Defra digital",
        "User centred design"
    ],
    "pub_date": "2022-03-31T07:30:32+01:00",
    "content": [
        {
            "text": "Content Designer is the 9th fastest-growing job role in the UK, according to a LinkedIn article from 18 January 2022. Not bad for a role that didn’t exist 10 years ago."
        },
        {
            "text": "And I should know how fast it's growing. Last September, I moved from a small team of content designers at the Office for National Statistics to the rapidly expanding content community at Defra."
        },
        {
            "text": "There were around 60 of us when I started, and we’re aiming for around 100 by April. We’ve had lots of great candidates from both inside and outside government apply for roles, encouraged by our Lead Content Designer Jeni Street in a blogpost last June."
        },
        {
            "text": "The breadth of talent I’ve seen so far at Defra has been amazing. Both in terms of content design skills and experience, but also with things like leadership and how people adapt and develop through content projects and experiences. I feel like I'm involved in something big and important."
        },
        {
            "text": "But my move felt a little strange for a while. I went from a big fish in a small pond to a small fish in a very big pond. I wasn’t used to it, so at times I wasn’t quite sure where I fitted in. This made me think hard about my abilities as a content designer and then, more widely, what makes a good content designer?"
        },
        {
            "heading": 2,
            "text": "Who are the people behind the skills?"
        },
        {
            "text": "The standard skills and tools needed for a content design role are well established. But who are we? What strengths and attributes make us good at what we do? What trends are developing among content designers at Defra, across government and the profession globally?"
        },
        {
            "text": "I’ve written a list of ‘things’. If you’re thinking of moving into content design, you might find my list useful alongside a traditional job specification."
        },
        {
            "text": "This list is not ‘official’; it’s my personal thoughts. And in no way is it exclusive. You don't have to be a 'type' of person or from a certain group – in fact, the more diverse content designers are, the better for the profession and our users."
        },
        {
            "text": "We need to be able to think about the needs of many different types of people to do our job well. To do that we need content designers from a range of backgrounds with differing life experiences."
        },
        {
            "heading": 2,
            "text": "So, to the list. What are content designers good at?"
        },
        {
            "heading": 3,
            "text": "1. We question"
        },
        {
            "text": "A content designer does not just write the words. We start by asking the questions. Often a lot of questions. We ask questions about who the content is for – who are the ‘users’? Why do they need this content? Is it available elsewhere? What’s the best way to deliver it to them? We need answers before we can create successful user journeys."
        },
        {
            "heading": 3,
            "text": "2. We listen"
        },
        {
            "text": "Not only do we listen to the answers to those questions, we listen to the users. That might be through observing user research, listening to feedback or hanging out on social media. We are good at listening to the words of our users and designing content that uses their language."
        },
        {
            "heading": 3,
            "text": "3. We empathise"
        },
        {
            "text": "Understanding human behaviour and a degree of empathy is key to good content design. Paul Cannon, a student from Content Design London’s Academy, refers to “Content Design as a form of digital ethnography”. I’m not saying all content designers need a social science degree like me (although, best 3 years of my life, no doubt!). We do need to be able to consider how a person’s interactions online are affected by their lifestyle, beliefs and situations. By understanding users, and the subject matter experts who help us craft our content, we can put the right content in the right place at the right time."
        },
        {
            "heading": 3,
            "text": "4. We are bold"
        },
        {
            "text": "Content designers need to be the class nerds. If we don’t know what something means, our users probably don’t either. So we need to be brave and stick up our hands. We ask those, often difficult, questions to make sure we get the content right."
        },
        {
            "heading": 3,
            "text": "5. We share"
        },
        {
            "text": "Content design is not a one-person job. Content designers need to be happy to share their ideas and designs. We need to accept feedback from other content designers and user-centred design professionals, stakeholders, our grandmothers (well, maybe not them!) Good content is not created in a vacuum."
        },
        {
            "heading": 3,
            "text": "6. We are resilient"
        },
        {
            "text": "A colleague told me recently that she found it hard moving from another content role into content design. Surprisingly hard. I remember being heartbroken in my early career when a stakeholder ignored all my hard work to publish just what they wanted. It’s not an easy job - we need to be able to bounce back and move on."
        },
        {
            "text": "As I said, this list is not official or exclusive, nor is it the be-all and end-all. Content designers don’t all have these qualities in equal measure. And each one takes practice."
        },
        {
            "text": "Before you take the plunge, check out the supportive content design community on Twitter. Follow #contentdesign to see who's tweeting about it and help decide if it’s for you."
        }
    ]
}