{
    "url": "https://naturalengland.blog.gov.uk/2022/03/31/chief-scientist-report-2021-good-better-best-using-the-best-available-evidence-in-natures-recovery/",
    "title": "Chief Scientist Report 2021. Good, better, best: using the best available evidence in nature’s recovery",
    "authors": [
        "Tim Hill"
    ],
    "categories": [
        "Natural England",
        "Science and evidence"
    ],
    "pub_date": "2022-03-31T15:59:46+01:00",
    "content": [
        {
            "heading": 4,
            "text": "Dr Tim Hill, Chief Scientist at Natural England, tells us about the publication of Natural England’s fourth Chief Scientist Report."
        },
        {
            "text": "Our mission within the Chief Scientist Directorate at Natural England, is to ‘…develop evidence and provide scientific advice to drive decision-making for nature recovery’.  In order for us to move from being an evidence-based organisation to one which is evidence-led, and for us to be able to lead, direct and support action for nature’s recovery – we need high quality, relevant and up to date evidence that is actively, appropriately and confidently applied."
        },
        {
            "text": "This therefore means using the best available evidence up-front to inform our options and priorities, direct our decisions and shape our delivery."
        },
        {
            "text": "One of our core values as an organisation is ‘acting with integrity’ and scientific integrity really is at the heart of who we are and what we do.  We must learn not only what does work, but also what doesn’t and be open and transparent about that.  This signals our maturity, ethics and confidence as an organisation that is building trust and making the right choices for nature’s recovery and people’s enjoyment of it."
        },
        {
            "text": "Much of what we do is through building purposeful partnerships with others - from across other parts of the Defra Group, academia, scientific institutions, voluntary bodies and many more.  This type of collaboration brings huge benefits and allows us to embrace the application of cutting-edge, multidisciplinary science and evidence, to tackle some of the challenges we face in bringing about our organisational vision of ‘Thriving Nature for people and planet’.  I always look forward to publishing the Chief Scientist Report, as it gives me an opportunity to showcase some of this partnership work and also to illustrate the huge range of scientific skills, knowledge and expertise we hold within Natural England."
        },
        {
            "text": "We want to continuously uphold a science and evidence infrastructure that is cross-cutting and accessible, providing services across our organisation and beyond, that is capable of supporting innovative investigations and experimentation. Using the Best Available Evidence enables all our staff to integrate more science and evidence into their work, to nurture scientific skills and be confident in the use of the data available."
        },
        {
            "text": "This report is the fourth on our series and demonstrates just some of the many, many ways in which we are using science and evidence to underpin and support nature recovery.  As an example, you will see how we have assessed the extent and distribution of ‘blue’ carbon habitats in English waters to gain a better understanding into how coastal and marine ecosystems play a crucial role in climate change, the global carbon cycle and the role of the marine environment in climate change mitigation and adaptation.  The potential for recovery and restoration of blue carbon habitats was also explored, alongside some key pressures that are driving habitat loss and inhibiting recovery, to identify opportunities for enhancing carbon storage."
        },
        {
            "text": "We will be continuing this work to further refine the evidence base on carbon stocks and fluxes, and understanding how and where habitat restoration and enhancement will have the most value for carbon storage, climate change adaptation and biodiversity gain."
        },
        {
            "text": "The report also includes feature case studies from right across Natural England, in terms of what science and evidence means to our colleagues, and how it informs everything from on-the-ground delivery to government advice.  And our annual bibliography captures the large amount of peer-reviewed and other published science we do as an organisation."
        },
        {
            "text": "I do hope you enjoy reading the report, which you can find here: Natural England Chief Scientist Report 2021"
        },
        {
            "text": " "
        }
    ]
}