{
    "url": "https://dragonsden.blog.gov.uk/2022/03/31/dragons-den-episode-13-series-19/",
    "title": "Dragons' Den Episode 13 Series 19",
    "authors": [
        "Melissa Murray"
    ],
    "categories": [
        "Business",
        "Designs",
        "International",
        "IP",
        "Licensing"
    ],
    "pub_date": "2022-03-31T21:03:53+01:00",
    "content": [
        {
            "text": "The Dragons were particularly fiery in this week’s episode, which meant hopeful entrepreneurs needed to be hot on their intellectual property (IP) to secure an investment. Maternity wear, summery cocktails, clay crayons and construction accessories were among the inventions debuted, but only two received the Dragons’ seal of approval."
        },
        {
            "text": "First, let me introduce myself. I’ve worked at the Intellectual Property Office for close to a year now and my role is a Policy Advisor within the Places Strategy team."
        },
        {
            "text": "My work focuses on developing policies to support businesses in all regions across the UK. We help them to recognise their IP as a valuable asset, improve their IP skill and confidence and use IP to supercharge their growth. You can find out more about our ambitions to level up IP skills across UK regions in our latest blog."
        },
        {
            "text": "Now on to the pitches…"
        },
        {
            "heading": 3,
            "text": "Baby fever in the Den"
        },
        {
            "text": "The first set of entrepreneurs to catch my attention were sisters, Alex and Jenny, who wowed the Dragons with their sustainable maternity clothing company named Pretty Mama. The duo asked for £30k in exchange for a 20% stake."
        },
        {
            "text": "Sara Davies was moved by Alex and Jenny’s relatable pitch, which highlighted the problem of body confidence after giving birth. The lack of attractive clothing options can often make women feel even worse."
        },
        {
            "text": "The star product was a minimalist pink jumper with an innovative hidden zip on the chest to help new mums breastfeed discreetly. It was music to my ears hearing that this was protected by a registered design!"
        },
        {
            "text": "Watch our video about when to register your designs below."
        },
        {
            "heading": 3,
            "text": "How could Pretty Mama’s registered designs help them monetise their IP?"
        },
        {
            "text": "It’s important to protect your IP so that you can stop counterfeits entering the market, but the team at Pretty Mama could also consider exploiting their IP to help grow their business further. Registering their design gives them plenty of options to consider, regardless of the Dragons’ investment:"
        },
        {
            "text": "The clever zip design and environmentally friendly upcycled materials were a big hit. Pretty Mama secured full investment from four of the Dragons, with Peter Jones telling the sisters: “You’ve basically got the Avengers now!”."
        },
        {
            "heading": 3,
            "text": "Not just a patented pipe dream"
        },
        {
            "text": "Also in the Den, were Chris and Alex, who managed to secure investment from the Dragons with their product, Pipe Snug. The pair asked for £100k investment for a 7.5% stake in the company. The product acts as a water and airtight seal to keep heat in and pests out."
        },
        {
            "text": "The Dragons weren’t completely sold until Chris and Alex told them about an upcoming regulation change in June 2022. Construction workers will need to install pipe sealls and grommets around pipes to help reduce carbon emissions and retain heat."
        },
        {
            "text": "Chris and Alex saw this as their golden ticket to success, convincing the Dragons that the regulation will drive the industry towards solutions such as Pipe Snug."
        },
        {
            "text": "The penny didn’t truly drop in the Den until the pair revealed that this product was completely unique, and internationally patent protected. If Chris and Alex were right about the industry shift due to new regulations, Pipe Snug would be the only ones in the market and clean up sales without a doubt."
        },
        {
            "text": "However, Touker Suleyman questioned the strength of the patent, which is something that can be determined by something as simple as the wording or what the patent covers. This potential for complexity means that careful wording is needed to ensure the correct level of IP protection."
        },
        {
            "text": "Peter and Deborah Meaden were willing to fill Pipe Snug’s finance gap offering the full £100k for a 30% stake. If Pipe Snug floods the market in June, you heard it here first!"
        }
    ]
}