{
    "url": "https://educationhub.blog.gov.uk/2022/03/education-secretarys-open-letter-to-children-and-young-people-on-send-reform/",
    "title": "Education Secretary's open letter to children and young people on SEND reform",
    "authors": [
        "Media Officer"
    ],
    "categories": [
        "SEND"
    ],
    "pub_date": "2022-03-31T15:05:57+01:00",
    "content": [
        {
            "text": "Education Secretary Nadhim Zahawi has written to all children and young people about how he and the Government are going to change the ways that children with special educational needs and disabilities are supported. "
        },
        {
            "text": "Dear children and young people,"
        },
        {
            "text": "My name is Nadhim Zahawi, and I am the Secretary of State for Education, which means the Prime Minister has asked me to be responsible for the education and wellbeing of all children and young people in England."
        },
        {
            "text": "One of the things I care most about is children and young people who have special educational needs and disabilities (SEND) being able to do as well as they can and getting all of the help they need, quickly and easily. However, too many children and young people with SEND have told me that they do not always feel supported and they are frustrated about how long they have to wait to get help."
        },
        {
            "text": "This needs to change – which is why my department has carried out a review of how children and young people with SEND are supported. We have heard from lots of you about what you think would make things better. You said you wanted to be understood and to grow up employed, happy, healthy with good friends and good results. I thank you for your time and thoughtful ideas."
        },
        {
            "text": "We have now published the SEND and Alternative Provision Green Paper. This is a report that sets out our ideas for how we can make sure you get the support you need, no matter where you live or go to school."
        },
        {
            "text": "Whatever your needs, we want to make sure you can get the right support at the right time so you can do well at school and be happy and healthy. We will provide more support to you at school before small issues become big ones. We also want more children and young people who need a special school place to go to one with their friends, and nearer where they live."
        },
        {
            "text": "We want to hear your views on our proposals to make sure we get it right. Please let us know what you think or ask your parents or teachers to help you to tell us, so we can work together to make sure all children and young people fulfil their potential and lead happy, healthy lives."
        },
        {
            "text": "You can find out more about the review and share your views at   sendreview.campaign.gov.uk."
        }
    ]
}