{
    "url": "https://socialcare.blog.gov.uk/2022/03/31/infection-prevention-and-control-forever/",
    "title": "Infection prevention and control forever!",
    "authors": [
        "Deborah Sturdy"
    ],
    "categories": [
        "Care and support",
        "coronavirus",
        "Guidance",
        "Information sharing",
        "Workforce"
    ],
    "pub_date": "2022-03-31T15:20:49+00:00",
    "content": [
        {
            "heading": 2,
            "text": "Working together maximises safety"
        },
        {
            "text": "The coronavirus pandemic has brought infection prevention and control (IPC) into sharp focus. In our daily lives, whether at home or work, IPC measures have received much greater attention as we all learn how to deal with a persistent and evolving threat."
        },
        {
            "text": "Those who provide care and support, and those who receive it, have responded remarkably to the challenge of adhering to IPC and, together, reduced infection risks across all care and clinical settings."
        },
        {
            "text": "Indeed, working together proved to be essential at the height of the pandemic, but as we revert to a more business as usual footing, we must not forget the phenomenal contribution of every person working in adult social care. From cleaners to catering staff, maintenance colleagues to nursing teams and all other social care professionals right across the system, they have all helped to keep people safe and made sure vital services to continue."
        },
        {
            "text": "Social care is delivered by a vast number of different people across a variety of settings and circumstances - be these shared lives, day centres, supported living services, caring for a friend or relative, or services provided by care homes or domiciliary care. Yet germs are indiscriminate and will exploit any opportunity to cause infection, regardless of where people receive their care and support."
        },
        {
            "text": "The threat of infection will never completely go away, of course. New germs and viral variants will emerge - we don’t know where, when, or what the impact will be. Meanwhile, increased resistance to antibiotics remains a global concern. With all this in mind, we have a collective duty to keep infections in check and do all we can to reduce opportunities for germs to spread and evolve."
        },
        {
            "text": "That’s why we must continue to build on what we have learnt and apply that learning to each and every infection outbreak. Regular teaching and learning sessions are vital to keep the wider care workforce updated and remind everyone IPC principles are everyone’s responsibility."
        },
        {
            "heading": 2,
            "text": "Keep pace with IPC"
        },
        {
            "text": "If you haven’t registered already, I encourage you and your colleagues to join the IPC Champions Network to make sure you’re never out of the loop and to find out how you can become an expert in IPC and be an inspiration to others"
        },
        {
            "text": "Meanwhile, an updated IPC resource for adult social care brings together concepts and evidence-based information supporting good practice. Not every part of the resource will be relevant and applicable to every setting. For example, hand washing will be applicable to everyone, whilst having a hand hygiene policy and audit may not. I would encourage you to adapt the information to your own situation and those in your care."
        },
        {
            "text": "Either way, this single resource, with its associated materials, is essential reading for care colleagues and reminds us all that applying the universal principles of IPC really makes a difference."
        },
        {
            "text": "Your skills, experience and adaptability before, during and (hopefully) after this pandemic have been so impressive. Thank you all for the amazing work you do to protect the vulnerable in society from COVID-19, and for further strengthening our culture and practice in IPC. Collectively, you are protecting, sustaining and saving lives. Be proud of yourselves, because I am so proud of you."
        }
    ]
}