{
    "url": "https://deframedia.blog.gov.uk/2022/03/31/largest-programme-on-storm-sewage-discharges-in-history/",
    "title": "Largest programme on storm sewage discharges in history",
    "authors": [
        "Defra Press Office"
    ],
    "categories": [
        "Uncategorized"
    ],
    "pub_date": "2022-03-31T18:38:00+01:00",
    "content": [
        {
            "text": "There has been coverage today (Thursday) of new plans unveiled by the Government to tackle the number of discharges of untreated sewage by water companies."
        },
        {
            "text": "The consultation on the Storm Overflows Discharge Reduction Plan outlines a step change in how water companies tackle the number of discharges of untreated sewage, which the Government and the public have made clear are completely unacceptable."
        },
        {
            "text": "Under the proposed plan:"
        },
        {
            "text": "The Government is already taking action to tackle storm sewage discharges. Between 2020 and 2025, £3.1 billion is being invested specifically in storm overflow improvements. This includes £1.9 billion investment on the Thames Tideway Tunnel super sewer, with the rest used to undertake over 800 investigations and over 800 improvement schemes to storm overflows."
        },
        {
            "text": "However, the Government’s storm overflows plan represents a step-change and goes much further, and will see the largest investment and delivery programme to tackle storm sewage discharges in the history of the water sector."
        },
        {
            "text": "The targets set out in the consultation also deliver on the commitments made in the Environment Act and provide certainty around what government expects water companies to plan for and deliver."
        },
        {
            "text": " Environment Secretary George Eustice said:"
        },
        {
            "text": "“We are the first government to set out our expectation that that water companies must take steps to significantly reduce storm overflows. Today, we are setting specific targets to ensure that those storm overflows are used only in exceptional circumstances – delivering on our Environment Act and building on wider work on water quality.”"
        },
        {
            "text": "The consultation is open from today for six weeks, until 12 May."
        },
        {
            "heading": 4,
            "text": "Ambition of targets"
        },
        {
            "text": "Some of today’s coverage has questioned the ambition and speed at which we intend to meet our targets."
        },
        {
            "text": "These targets will push all water companies to go further and faster. The targets eliminate the ecological harm of overflows, protect bathers and other recreational water users and set clear limits across the country when overflows can be used. Our targets ensure water companies need to fix overflows causing the most ecological harm first and protect our most sensitive and important sites."
        },
        {
            "text": "Our new targets will generate the most significant investment and delivery programme ever undertaken by water companies to protect people and the environment and will revolutionise our sewer system. Results will not be achieved overnight. However, we will be monitoring the business planning of water companies to achieve these targets, and if it is possible to go further and faster while balancing the cost to consumers, we will not hesitate to do so – we have made this clear to the water industry."
        },
        {
            "text": "We want the best solutions with the most benefits to be taken forward, and these will require careful planning by the industry. The targets are ambitious, and time bound, allowing for water industry to deliver traditional solutions and bring forward innovative nature-based solutions where appropriate."
        },
        {
            "text": "Follow Defra on Twitter, and sign up for email alerts here."
        }
    ]
}