{
    "url": "https://movingon.blog.gov.uk/2022/03/31/publishing-our-enforcement-statistics/",
    "title": "Publishing our enforcement statistics",
    "authors": [
        "Marian Kitson"
    ],
    "categories": [
        "Enforcement"
    ],
    "pub_date": "2022-03-31T14:40:43+01:00",
    "content": [
        {
            "text": "I’ll be stating the obvious when I say it has been a difficult two years, but I don’t think it can be said enough. As an industry, operators faced new EU requirements and driver shortages all at the same time as managing the impact of the COVID-19 pandemic."
        },
        {
            "text": "Today, we publish our enforcement statistics up to December 2021 prompting us to reflect on the challenges we’ve overcome."
        },
        {
            "text": "To keep our roads safe, it was vital our enforcement activity continued during the COVID-19 pandemic. With the sudden change in priorities during this period, the preparation and release of our statistics was put on hold which allowed us to concentrate on our frontline work."
        },
        {
            "text": "The impact of the pandemic"
        },
        {
            "text": "The data shows that we were able to maintain vehicle checks at similar levels year on year. There was a slight fall in October to December of 2020-21, which reflected the impact of the pandemic on  DVSA employees and industry. It is testament both to the dedication of our employees in continuing to do their jobs in difficult circumstances, as well as industry for co-operating with our enforcement checks."
        },
        {
            "text": "The fact that enforcement activity continued meant we were able to support the exemptions to vehicle testing, ensuring heavy vehicle compliance was monitored at the roadside."
        },
        {
            "text": "Operators did a great job to keep running during the pandemic and there was no significant change in prohibition rates for either mechanical defects or drivers’ hours offences. This shows that despite exemptions to testing for some operators, there was no meaningful impact on vehicle safety."
        },
        {
            "text": "What we’ve learnt"
        },
        {
            "text": "A minority of operators are continuing to fail their annual test for the same kind of reasons that they’re being stopped at the roadside. All these defects could and should be picked up in regular maintenance inspections. Our guide to maintaining roadworthiness gives advice on vehicle maintenance."
        },
        {
            "text": "This includes the top test failure and roadside defect items - tyres, lights, and brakes."
        },
        {
            "text": "Thank You"
        },
        {
            "text": "As I said, these past two years have been hugely difficult for us all. We would like to thank operators, drivers, and our enforcement colleagues for all their hard work in keeping the country going and keeping Britain’s roads safe during the pandemic"
        },
        {
            "text": "We are working hard to recover all of our services, but by working together we can continue to ensure Britain’s roads stay safe for everyone."
        }
    ]
}