{
    "url": "https://environmentagency.blog.gov.uk/2022/03/31/storm-overflow-spill-data-released-today-shows-no-room-for-complacency/",
    "title": "Storm overflow spill data released today shows no room for complacency",
    "authors": [
        "Environment Agency"
    ],
    "categories": [
        "Water"
    ],
    "pub_date": "2022-03-31T09:13:43+00:00",
    "content": [
        {
            "text": "EDM lifts the lid on storm overflow performance, measuring how often and for how long storm overflows discharge into the environment. The state of our rivers is not in the condition we want. We are still seeing too much pollution from a number of sources, including sewage pollution from storm overflow discharges."
        },
        {
            "text": "The Environment Agency has made water companies fit monitors to their storm overflows in order to capture information on how they are performing. We have a statutory duty under the Environment Act 2021 to publish EDM data for water and sewerage companies operating wholly or mainly in England by 1 April each year."
        },
        {
            "text": "The water companies have rightly come under intense pressure from the government, the Environment Agency, campaigners and the public for allowing far too many sewage spills into rivers and coastal waters. This data is helping us to hold the industry to account on a scale never seen before. While we welcome recent commitments from water companies to reduce their use of storm overflows, the data published today shows there is no room for complacency. They have a very long way to go."
        },
        {
            "text": "This is the second year that we have published the full data and the Environment Agency uses it in different ways, including:"
        },
        {
            "text": "EDM data has also informed the major criminal investigation into potential widespread non-compliance of water and sewerage companies at wastewater treatment works."
        },
        {
            "text": " "
        },
        {
            "text": "Main findings from 2021"
        },
        {
            "text": "The data from the 2021 EDM storm overflow returns from water and sewerage companies is summarised in the table below.  The full dataset and summary tables can be found here."
        },
        {
            "text": " "
        },
        {
            "text": "Around 12,700 (89%) of England’s 14,470 storm overflows now have monitors, with the remainder due to be installed by the end of 2023. Installation on the remaining overflows will take place over 2022 and 2023 to meet the target of having all permitted storm overflows monitored by the end of 2023."
        },
        {
            "text": "The evidence from EDM clearly shows where water companies need to improve and where they should focus their investment to carry out investigations and make improvements. They are obliged under the Environment Act 2021 to publish information about any investigations that have taken place, or improvement works they’ve carried out in relation to storm overflows during that period."
        },
        {
            "text": "We use EDM data to drive planning and investment. Between now and March 2025, about 800 investigations and 800 improvements are planned with further being planned for 2025-2030. Further information can be found here - Water Industry National Environment Programme - data.gov.uk"
        },
        {
            "text": "Event Duration Monitoring data - long-term trends"
        },
        {
            "text": "EDM coverage has significantly increased from 2016 as a result of the Water Industry National Environment Programme (WINEP) focus on EDM installation between 2015 and 2020.  This maturing dataset is becoming a robust evidence base for policy, improvement programmes and local action."
        },
        {
            "text": "It should be noted that prior to 2018, EDM installation was focused upon a small subset of storm overflows: those that discharged to the most sensitive higher-amenity locations such as bathing waters, where a lower spill frequency might be expected due to stricter standards.  As the rollout of EDM programme widened to include all storm overflows, the trend in average number of spill events per overflow initially increased before declining in 2020 and 2021."
        },
        {
            "text": "Storm Overflows Taskforce consultation"
        },
        {
            "text": "The data has also been central to informing Defra’s consultation on its Storm Overflow Reduction Plan to be laid before Parliament in September 2022. The plan has ambitious, longer-term targets:"
        },
        {
            "text": "The consultation has been launched today - Consultation on the Government’s Storm Overflow Discharge Reduction Plan - Defra - Citizen Space"
        }
    ]
}