{
    "url": "https://teaching.blog.gov.uk/2022/03/31/supporting-wellbeing-as-part-of-a-multi-academy-trust/",
    "title": "Supporting wellbeing as part of a multi-academy trust",
    "authors": [
        "Anna Crawte"
    ],
    "categories": [
        "Reducing teacher workload",
        "Teacher mental health",
        "Teacher wellbeing"
    ],
    "pub_date": "2022-03-31T11:38:34+01:00",
    "content": [
        {
            "text": "Anna Crawte is a School Improvement Director for HEART Academies Trust, a growing multi-academy trust in Bedford. Anna shares how her central support team has taken on a key role in helping their schools to reduce workload and support teacher wellbeing. "
        },
        {
            "text": "In HEART Academies Trust, we learnt quickly during the pandemic that we were stronger together. The support we could offer our communities was greater when we pooled all resources. We have continued this close collaboration and identified how our central team can support our schools, especially with regards to the wellbeing of our staff. "
        },
        {
            "heading": 2,
            "text": "Sending support where it’s needed"
        },
        {
            "text": "Our headteachers always prioritise the wellbeing of their pupils and staff, but often their own wellbeing is the last thing on a very long to do list, which includes HR, finance and facilities tasks in addition to their educational responsibilities. Our headteachers want time to focus on the teaching and learning in their schools. This is where our central teams take the pressure off. For example, the school improvement team provides teaching and learning support which includes team teaching, curriculum development and reviews that were requested by the headteacher.  "
        },
        {
            "text": "This kind of support is one of the biggest advantages of being in a trust. The central team provide more than just practical support – they help staff feel they aren’t alone, that there’s always someone there for support and advice. Staff wellbeing is a priority that is woven into the ethos of all our schools. "
        },
        {
            "heading": 2,
            "text": "Making staff feel valued"
        },
        {
            "text": "The greatest lesson we have learnt to support wellbeing is that open, honest communication is the key. We have a weekly meeting with all headteachers and the core team; this is an open and transparent space to ensure everyone is heard, feels supported and understands the priorities for the trust.  "
        },
        {
            "text": "We recognise this has to be underpinned by a cross-trust approach to wellbeing, starting with sustainable work-life balances, cross-trust support bespoke for each school, and a culture of valuing everyone. We like to thank our staff and provide opportunities to celebrate them as part of our wellbeing strategy. Small acts of gratitude and recognition, such as cooked breakfast after a busy Ofsted inspection, help every person feel valued within an organisation. "
        },
        {
            "heading": 2,
            "text": "Recognising individual needs"
        },
        {
            "text": "We are a trust that celebrates our individual communities, and this means we give full autonomy to our headteachers to ensure their schools meet the needs of the pupils in their care. This also extends to the staff, as what works well in one school may not be appropriate in another. HEART Academies Trust offers consistent wellbeing and workload support, but individual schools can decide what they need in the context of this. "
        },
        {
            "text": "In order for any wellbeing strategy to be successful, staff need to be listened to and there needs to be an acknowledgement that one size does not fit all. An overarching directory of support allows our schools to benefit from the range of expertise a central team can offer while also providing opportunities for tailored, school-based strategies. "
        }
    ]
}