{
    "url": "https://insidedvla.blog.gov.uk/2022/03/31/tax-it-dont-risk-it-dvla-hits-the-road-to-highlight-the-risks-of-vehicle-tax-evasion/",
    "title": "Tax it, don’t risk it – DVLA hits the road to highlight the risks of vehicle tax evasion",
    "authors": [
        "Paul Davies"
    ],
    "categories": [
        "Enforcement",
        "Features",
        "Vehicle tax"
    ],
    "pub_date": "2022-03-31T14:44:13+01:00",
    "content": [
        {
            "text": "The law is clear – you must tax your vehicle if you’re using it or keeping it on a public road. If you’re keeping the vehicle off the road, it must either be taxed or have a Statutory Off Road Notification (SORN). You must tax your vehicle, even if you do not have to pay anything."
        },
        {
            "text": "Motorists who do not tax their vehicle can face financial penalties, court action and the risk of having their vehicles clamped or impounded. While more than 98% of vehicles are correctly taxed, it’s right that DVLA takes action against those who continue to break the law and evade taxing their vehicle."
        },
        {
            "text": "As National Wheelclamping and Automatic Number Plate Recognition (ANPR) Manager, I manage a strategic DVLA contract that aims to reduce evasion through wheelclamping and ANPR activity. Our enforcement teams travel around the UK as part of our day-to-day activities and work closely with local authorities and police forces, who can be given devolved powers to remove untaxed vehicles from our roads."
        },
        {
            "text": "Earlier this year, as part of the agency’s long-term strategy to keep vehicle tax evasion low, DVLA’s Communications team launched a campaign with a clear message to evaders – untaxed vehicles are ‘hard to hide, easy to tax’. To support the campaign, I travelled with our wheelclamping partners and press team to some of the areas in the UK with the highest evasion levels. Here’s what we got up to..."
        },
        {
            "heading": 2,
            "text": "Hitting the road"
        },
        {
            "text": "We recently visited Birmingham, Reading, Leeds and Swansea this month, where there were a combined 99,796 enforcement actions taken last year. These included fines, penalties and clamping."
        },
        {
            "text": "As part of the campaign, we organised media opportunities around our usual wheelclamping operations undertaken by NSL on behalf of DVLA. These wheelclamping operations were an opportunity to highlight the risks for motorists in their local area and remind motorists of the real risk if their vehicles are untaxed."
        },
        {
            "text": "This is the first campaign I’ve been involved with, so I undertook media training to prepare for questions from journalists. It was certainly an intense but enjoyable experience, thanks to the support of the agency’s press team."
        },
        {
            "text": "Each wheelclamping operation involved journalists and photographers attending the wheelclamping pound, managed by the press team. I showed them around the facility and answered questions about how our operations are undertaken. They got to see untaxed vehicles returning following an impoundment, before heading out to find an untaxed vehicle to observe a clamping in action."
        },
        {
            "heading": 2,
            "text": "So, what did we find?"
        },
        {
            "text": "We took enforcement action against several vehicles, in all 4 areas we visited. A car was clamped on a neighbourhood street, while another was towed away and impounded. In another case, we identified an untaxed vehicle in a car park using our ANPR data. The vehicle was clamped, and a warning of impoundment was issued to the driver."
        },
        {
            "text": "This is a typical day for our enforcement teams and wheelclamping partners who, last year, took 360,655 enforcement actions across 12 of the highest evading areas in the UK. It only reinforces our message of ‘hard to hide, easy to tax’. So why risk it?"
        },
        {
            "text": "Looking forward, we will continue to take action against untaxed vehicles by carrying out computerised and roadside checks. Part of my role is also to manage our Devolved Partners Power Scheme, which will continue to support a range of local authorities to deliver enforcement activities on our behalf."
        },
        {
            "heading": 2,
            "text": "Tax it, don’t risk it"
        },
        {
            "text": "Taxing your vehicle is always the easiest and cheapest option. It’s never been easier to tax your vehicle, so use GOV.UK to check if your vehicle is taxed. If you need to tax your vehicle, you can do so quickly and securely online 24 hours a day, 7 days a week. You can even pay by Direct Debit to spread the cost of your vehicle tax."
        },
        {
            "text": "So help spread the word to your family and friends – tax it, don’t risk it!"
        }
    ]
}