{
    "url": "https://dataingovernment.blog.gov.uk/2022/03/31/using-the-beneficial-ownership-data-standard-to-support-the-economic-crime-bill/",
    "title": "Using the Beneficial Ownership Data Standard to support the Economic Crime Bill",
    "authors": [
        "Data Standards Authority, CDDO"
    ],
    "categories": [
        "Beneficial Ownership",
        "Data Standards",
        "Open Standards"
    ],
    "pub_date": "2022-03-31T13:30:11+01:00",
    "content": [
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": "The Beneficial Ownership Data Standard is now available to use across government after being endorsed by the Open Standards Board and the Data Standards Authority’s Steering Board."
        },
        {
            "text": "The Beneficial Ownership Data Standard (BODS) creates transparency in corporate governance by giving data about ownership structures of property or companies. This visibility is useful in areas such as procurement, counter-fraud, anti-money laundering and national security."
        },
        {
            "text": "The data standard was selected after consulting with people and organisations across the public and private sectors and academia, in a challenge run by the Data Standards Authority and GDS’s international team."
        },
        {
            "text": "This standard arrives at a perfect time to support new government measures to tackle corrupt elites and dirty money, which has now become UK law through the Economic Crime (Transparency and Enforcement) Bill."
        },
        {
            "text": "It also helps to deliver the government’s commitment to publish beneficial ownership data in a structured, machine-readable format."
        },
        {
            "heading": 2,
            "text": "How can you use BODS?"
        },
        {
            "text": "BODS can be used to create registers of beneficial ownership data, check and review that data with its own dedicated tool, store machine-readable beneficial ownership data for other people to analyse and share data with other government organisations. It can also be used to publish beneficial ownership data."
        },
        {
            "text": "The data standard is developed by Open Ownership, which is a non-profit organisation supported by the Data Standard Working Group. The standard is still in development, and more information about its progress is available on the BODS website."
        },
        {
            "text": "The website also contains a data schema, technical guidance and example data to help people use the standard in a variety of ways."
        },
        {
            "text": "If you’re using BODS in government, you should use guidance published by the Data Standards Authority (DSA) to make sure you use the standard correctly."
        },
        {
            "heading": 2,
            "text": "Help us keep identifying data standards for government"
        },
        {
            "text": "The Data Standards Authority is always working on identifying and defining data standards for use across government. If your department or organisation is using data standards in your work, or have heard of a data standard you think may help you to work better, our team is always on hand to offer advice and assistance."
        }
    ]
}