{
    "url": "https://planninginspectorate.blog.gov.uk/2022/11/08/its-world-town-planning-day-what-does-it-mean-to-be-a-planner/",
    "title": "It’s World Town Planning Day – what does it mean to be a planner?",
    "authors": [
        "pinscomms"
    ],
    "categories": [
        "People",
        "Public service",
        "Recruitment"
    ],
    "pub_date": "2022-11-08T09:30:20+00:00",
    "content": [
        {
            "heading": 3,
            "text": "Today is World Town Planning Day, which celebrates how good planning improves the lives of people and benefits society by creating places where we live, work and play together. "
        },
        {
            "text": "Founded in 1949, by the late Professor Carlos Maria della Paolera, it takes place every year on 8 November to advance public and professional interest in planning.  "
        },
        {
            "text": "To mark the occasion, we wanted to shine a light on some of the types of work our people do, why they became planners and why they think good planning matters.  "
        },
        {
            "heading": 2,
            "text": " "
        },
        {
            "heading": 2,
            "text": "Ifeanyi Chukwujekwu – Appeals Planning Officer "
        },
        {
            "text": "Ifeanyi’s experience spans planning appeals, marine planning and licensing, habitats regulation and environmental impact assessment.   "
        },
        {
            "text": "He was recently elected to the RTPI General Assembly and is also a Member of the Nigerian Institute of Town Planners. He has worked with the Federal Capital Development Authority as well as teaching town planning courses at higher education level"
        },
        {
            "text": "Why did you want to become a planner? "
        },
        {
            "text": "I was good in Geography, Art and Technical Drawing. I’ve always been interested in how cities emerge and the ordering of development. There are a few examples of well-planned towns in Nigeria, however most master plans are out of date and development is quite often haphazard. I decided to become a planner to get involved in reversing this trend. "
        },
        {
            "text": "What are you most proud of in your career so far? "
        },
        {
            "text": "Achieving internationally recognised chartered status as both a town planning and environmental professional (MRTPI, MIEMA and CEnv). I have also been recently elected as a Chartered Member of the General Assembly of the Royal Town Planning Institute. "
        },
        {
            "text": "Why is the work that planners do important? "
        },
        {
            "text": "Because everything that we do, whether it is in design or policy development has an impact on our environment. The work we do is based on the objective to ensure that development meets the needs of the present, without compromising the ability of future generations to meet their own needs. "
        },
        {
            "text": "What advice would you give to aspiring planners starting out in their career? "
        },
        {
            "text": "It is a rewarding career in terms of considering the big picture and seeing that your contribution has resulted in creating sustainable places. This requires patience, as some plans take time to materialise. Planning is also multifaceted, and professionals can come from varied backgrounds. Discover what you are good at and how that can be applied in planning. "
        },
        {
            "heading": 2,
            "text": "Frances Fernandes – Examining Inspector "
        },
        {
            "text": "Frances works in an advisory role for the Planning Inspectorate having recently finished providing pre-application advice for the Lower Thames Crossing Nationally Significant Infrastructure Project. "
        },
        {
            "text": "Her career has taken her from junior planner at local authorities to managing a global advocacy campaign on the Right to Education for an international aid agency.   "
        },
        {
            "text": "She has worked as a planning consultant advising on master-planning, Eco Towns and transport.  "
        },
        {
            "text": "In 2009, she was appointed as a Registered Commissioner for the Infrastructure Planning Commission and then later joined the Planning Inspectorate where she has led the examination of many Nationally Significant Infrastructure Projects including Dogger Bank offshore wind farm, the Richborough Connection Project and, the A14 Cambridge to Huntingdon Improvement Scheme. "
        },
        {
            "text": "Why did you want to become a planner? "
        },
        {
            "text": "The credit is my brother’s to take.   "
        },
        {
            "text": "I remember when I bumped into ‘planning’. I was sitting at home surrounded by an impressive array of university prospectus brochures but I was no further forward in deciding what it was I wanted to study. Meantime, the clock was ticking on the deadline for applying.   "
        },
        {
            "text": "One of my brothers was passing by and after observing my indecisiveness for a while with mounting exasperation, asked me to describe my ideal job.  I muttered something about liking the outdoors, not liking sitting in offices too much and wanting to travel.  He looked at me and said “choose planning” and that was how it all began.   "
        },
        {
            "text": "What are you most proud of in your career so far? "
        },
        {
            "text": "My appointment to the Inspector Panel examining the application for Hinkley Point C new nuclear power station. This was one of the very first highly complex and challenging Nationally Significant Infrastructure Projects to be considered under the Planning Act 2008.   "
        },
        {
            "text": "Working with the team to translate the legislation from theory into a live environment, breaking new ground and setting up an entirely new process was both exhilarating and daunting.  Some 130 projects on, the examination of nationally significant infrastructure projects is now well established.   "
        },
        {
            "text": "Why is the work that planners do important? "
        },
        {
            "text": "Planners are all too often the unsung hero of the design team responsible for shaping how we interact with the world around us.   "
        },
        {
            "text": "That’s odd because as planners, we hold the widest of briefs; listening, considering and balancing the needs of people; of the buildings and places we inhabit and of the environment around us.   "
        },
        {
            "text": "We strengthen the voice of people and the planet in the work that we do.  Everyday decisions soon add up to create an impact on a much broader scale.  Our work is important because getting it right really matters for our collective future.   "
        },
        {
            "text": "What advice would you give to aspiring planners starting out in their career? "
        },
        {
            "text": "Shake off complacency.  Don’t accept the status quo.  Be bold.   "
        },
        {
            "text": "Planning equips you with skills you can apply in many different contexts.  It needs your fresh thinking and it needs your constructive ideas if we are to be successful in taking those necessary steps towards net zero.  "
        },
        {
            "heading": 2,
            "text": "Ahsan Ghafoor – Enforcement Professional Lead "
        },
        {
            "text": "Ahsan is a Professional Lead for planning enforcement within the Planning Inspectorate. Prior to joining the Inspectorate in 2007, he worked as a project manager for a charitable trust coordinating and developing a large portfolio of properties as well as working at a local planning authority.  "
        },
        {
            "text": "Why did you want to become a planner? "
        },
        {
            "text": "Since qualifying as a planner, I always wanted to put into practice my learning. I wanted to shape the urban and rural environment in the public interest. I really enjoyed engaging with the private and public sector.  "
        },
        {
            "text": "I entered the planning profession at local authority level handling applications for minor and major applications. My interest in planning enforcement grew when I became a Principal Planning Officer leading a team of planners and enforcement officers.  "
        },
        {
            "text": "The intellectual challenge combined with the Planning Inspectorate’s reputation as an esteemed professional body attracted me to the planning inspector role. My stint as a housing and planning inspector sparked an ambition to achieve greater goals within the sector.   "
        },
        {
            "text": "What are you most proud of in your career so far? "
        },
        {
            "text": "I’m proud of the decisions I made as an inspector and I’m proud of becoming a Professional Lead. In a sector that is under-represented by ethnic minorities, I’m also proud of my role as a leader and role model. In terms of diversity, there is lots to do but we will raise the profile of planning and enforcement by engaging the communities we serve. "
        },
        {
            "text": "Why is the work that planners do important? "
        },
        {
            "text": "Planning is a crucial function at local and national level. Our work helps shape the environment in which we live. It helps focus minds on important issues like climate change and helps to shape a better built and natural environment.  "
        },
        {
            "text": "What advice would you give to aspiring planners starting out in their career? "
        },
        {
            "text": "In a constantly changing world, your contribution to the shape of the built and natural environment is really valued. You’ll face many challenges when engaging with the development management process but take each day as it comes and focus on your goals. Eventually you’ll help to shape the environment and be proud of your role as a planner. "
        },
        {
            "heading": 3,
            "text": "Kickstart your career in planning! "
        },
        {
            "text": "As the nation’s largest employer of planners, we frequently recruit to a range of different roles.  "
        },
        {
            "text": "Whether you are starting out in your career or you are an experienced practitioner seeking the next challenge, see our job opportunities on Civil Service Jobs (make sure to subscribe to alerts!) and be part of an organisation with a long and proud history in ensuring a fair planning system for England. "
        }
    ]
}