{
    "url": "https://mhrainspectorate.blog.gov.uk/2022/11/08/return-to-international-gmp-inspections/",
    "title": "Return to International GMP Inspections",
    "authors": [
        "grahamcarroll"
    ],
    "categories": [
        "Good manufacturing practice"
    ],
    "pub_date": "2022-11-08T10:55:10+00:00",
    "content": [
        {
            "text": "In March 2020 the MHRA Inspectorate published a blog post in which we announced that until further notice we would only conduct on-site inspections linked to the UK Government’s COVID-19 response or any other potential serious public health risk. In July 2020 we published an update in which we outlined our plans to return to a full programme of UK on-site inspections from October 2020. At the time we were unable to plan for a return to international inspections and we committed to providing further information as the situation developed."
        },
        {
            "text": "The pandemic has continued to raise new challenges for international travel. COVID is clearly something that will affect how we all live and work for some time to come. However, we now have a vastly improved understanding of the virus, a global roll-out of vaccines that are extremely effective in preventing severe disease, and a range of new treatments. Inspectors are rightly extremely proud of the work we have done to support the development, licensing, and availability of these lifesaving medicines, and I would like to take this opportunity to thank my colleagues for their incredible work since March 2020."
        },
        {
            "text": "International travel is now becoming easier to organise and less likely to suffer unexpected disruption, although we take nothing for granted. Since April 2022, GMP Inspectors have been taking part in a pilot programme to evaluate a potential return to international onsite GMP inspections. Considerations include whether the risk to inspectors is acceptable, and whether we can make efficient use of our inspectors’ time."
        },
        {
            "text": "We are pleased to announce that the pilot was successful, and we are now resuming our programme of international onsite GMP inspections. There will still be restrictions on the countries that we are able to travel to, particularly those that still have a requirement for international travellers to quarantine on arrival, so that we can make the most efficient use of limited inspection time."
        },
        {
            "text": "We will be adopting a risk-based approach, prioritising inspections with the greatest impact on UK public health and patient safety. We will do this in conjunction with our product licence assessors and using our existing risk-based inspection (RBI) tools. Whilst we are implementing this return to international inspections, we ask that sites do not contact us asking to arrange a routine inspection or to enquire about when they can expect their inspection to be; we will make contact when we are able to arrange each inspection."
        },
        {
            "text": "It has been over two years since we performed routine onsite international inspections, and therefore many international sites in our risk-based inspection programme have not been inspected in line with the frequency indicated. Throughout the pandemic we have taken a pragmatic approach to the ‘expiry’ of GMP Certificates, with these initially extended to the end of 2021 and then to the end of 2022. I can confirm that the ‘expiry’ of GMP certificates will again be extended until the end of 2023. We will work through the outstanding inspections as quickly as we can, without compromising the integrity or rigour of our inspection process."
        },
        {
            "text": "Inspectors will work with sites to ensure that inspections can be performed with appropriate mitigations in place to reduce the risk of COVID-19 transmission. Examples include ensuring social distancing in meeting rooms, minimising the number of site personnel involved in facility tours, and rigorous health screening for symptoms and infections. Inspectors will also comply with any government or site-specific restrictions in place when visiting international sites."
        },
        {
            "text": "I would finally like to thank our stakeholders for their patience and flexibility during the pandemic, and for their future support as we work together to re-instate our international onsite inspection programme."
        }
    ]
}