{
    "url": "https://nationalscreening.blog.gov.uk/2022/11/08/the-role-of-patient-and-public-voice-members-on-the-uk-nsc/",
    "title": "The role of patient and public voice members on the UK NSC",
    "authors": [
        "Mike Harris"
    ],
    "categories": [
        "General",
        "UK National Screening Committee"
    ],
    "pub_date": "2022-11-08T11:33:24+00:00",
    "content": [
        {
            "text": "Patient and public voice (PPV) members play an important role in informing and improving the work of the UK National Screening Committee (UK NSC)."
        },
        {
            "text": "UK NSC: the role of patient and public voice members, a new publication on GOV.UK, summarises the role of PPVs, why they are needed and how they are recruited."
        },
        {
            "text": "A total of 6 PPVs sit either on the committee, its adult reference group (ARG) or its fetal, maternal and child health (FMCH) expert sub-group."
        },
        {
            "heading": 2,
            "text": "PPVs bring a broad perspective"
        },
        {
            "text": "PPVs bring the perspective of the general public to complex discussions about screening issues relating to a huge range of conditions. They are involved throughout the UK NSC’s evidence review processes and help make sure its recommendations stand up to public scrutiny."
        },
        {
            "text": "Eleanor Cozens, PPV member of the UK NSC, said:"
        },
        {
            "text": "All PPVs are unpaid and are appointed as neutral individuals, not as representatives of any organisation or to campaign for personal interests. The UK NSC appoints individuals whose knowledge, skills and experience mean they can provide constructive challenges and contributions to the committee’s discussions."
        },
        {
            "heading": 2,
            "text": "Full involvement in committee’s work"
        },
        {
            "text": "PPVs help the committee describe screening topics in a way the wider public can understand while being sensitive to people affected by conditions being discussed. This includes helping to identify issues that require careful and clear communication to anyone unfamiliar with the UK NSC and its processes."
        },
        {
            "text": "PPVs also help make sure the workings of the committee are transparent by witnessing the full range of processes involved in carrying out screening evidence reviews and making recommendations."
        },
        {
            "text": "Eleanor added:"
        },
        {
            "text": "The UK NSC will need the input of its PPVs more than ever following the expansion of its remit earlier this year to cover targeted and stratified screening which will mean a larger potential pool of screening topics. The committee is extremely grateful for their contributions, expertise and experience."
        },
        {
            "heading": 2,
            "text": "Keep up to date"
        },
        {
            "text": "The UK NSC blog provides up to date news from the UK National Screening Committee. You can register to receive updates direct to your inbox, so there’s no need to keep checking for new articles. If you have any questions about this blog article, or about the work of the UK NSC, email screeninginformation@dhsc.gov.uk."
        }
    ]
}