{
    "url": "https://charitycommission.blog.gov.uk/2022/11/08/your-new-charity-commission-account/",
    "title": "Your new Charity Commission Account",
    "authors": [
        "Sam Jackson, Assistant Director of Policy"
    ],
    "categories": [
        "News",
        "register"
    ],
    "pub_date": "2022-11-08T13:46:42+00:00",
    "content": [
        {
            "text": "Those of you who attended our Annual Public Meeting or watched the recording will have heard our Chief Executive, Helen Stephenson, talk about our plan to change the way we engage with charities."
        },
        {
            "text": "Our aim in the long term is to build more supportive and meaningful relationships with you as individual trustees. This will begin with the introduction of our new ‘My Charity Commission Account’."
        },
        {
            "text": "As we are about to start inviting charity contacts to set up their accounts, I wanted to explain what this is and what it means for you and your charity."
        },
        {
            "heading": 2,
            "text": "What is ‘My Charity Commission Account’? "
        },
        {
            "text": "Your Charity Commission Account will be the new way you access our online services. Over time, it will also be where we provide you with tailored support and information to help you to run your charity well."
        },
        {
            "text": "In future, anyone who uses our online services – whether a trustee, contact or a professional who works on behalf of your charity – will have their own personal account to access the services and information they need. This means the right people can continue to do what they need to on behalf of your charity, while ensuring the information we hold about you and your charity remains secure."
        },
        {
            "heading": 2,
            "text": "Setting up your accounts "
        },
        {
            "text": "We’ll be inviting charity contacts to set up their Charity Commission Accounts from this November onwards. We’re starting by inviting a small number so we can learn from their experience before we reach out to more charities."
        },
        {
            "text": "We’re starting by inviting charity contacts for a couple of reasons:"
        },
        {
            "text": "You can read more about what it means to have an administrator account in our guidance on Setting up 'My Charity Commission Account' including what authorisation is needed. We’ll also share more about these new administrator processes closer to the time but would like to assure you that they are simple and easy to follow."
        },
        {
            "text": "We’d encourage all charities to have more than one administrator. Although they can only be invited to set up their account when the system is launched, hopefully the additional information in our guidance on Setting up 'My Charity Commission Account' will help you decide who this should be."
        },
        {
            "heading": 2,
            "text": "Benefits of the new system"
        },
        {
            "text": "Moving to a more modern platform makes it easier to access our services and keep information secure."
        },
        {
            "text": "When launched, you’ll also have an option to view all your charities in one place. By using the same email address for each charity, you’ll only need to set up one account as it will link it to all your charities. Find out more about linking your charities in our guidance on Setting up 'My Charity Commission Account'."
        },
        {
            "text": "This is just the beginning. There will be opportunities to help us shape how we use these accounts to best support you in the future."
        },
        {
            "heading": 2,
            "text": "What should you do now?"
        },
        {
            "text": " "
        },
        {
            "text": " "
        }
    ]
}