{
    "url": "https://deframedia.blog.gov.uk/2022/08/18/government-action-against-sewage-discharges-from-storm-overflows/",
    "title": "Government action against sewage discharges from storm overflows",
    "authors": [
        "Defra Press Office"
    ],
    "categories": [
        "water"
    ],
    "pub_date": "2022-08-18T15:17:07+01:00",
    "content": [
        {
            "text": "Untreated sewage can be devastating to human health, local biodiversity and our environment which is why we have been clear that water companies must take urgent action to address sewage discharges."
        },
        {
            "text": "There is currently a risk of surface water flooding in some parts of England, following rain falling on very hard ground after weeks of dry weather. Water quality may be temporarily reduced as a result, reinforcing the need for robust action from water companies to reduce discharges from storm overflows."
        },
        {
            "text": "That’s why we are already taking action. We are the first Government to set an expectation on water companies to significantly reduce sewage discharges from storm overflows."
        },
        {
            "text": "The Strategic Policy Statement, laid in Parliament in February, sets out to Ofwat - the water regulator - our expectations for the sector over the next five year spending cycle and beyond. It makes clear that Ofwat and water companies should prioritise action on the environment, deliver a resilient and sustainable water supply, and significantly reduce the frequency and volume of discharges from storm overflows.We also recently consulted on our Storm Overflows Discharge Reduction Plan, which will revolutionise how water companies tackle the number of discharges of untreated sewage."
        },
        {
            "text": "The plan proposes the most significant infrastructure programme to recover the environment in water company history. Water companies will face strict limits on when they can use storm overflows and must completely eliminate the harm sewage discharges cause to the environment."
        },
        {
            "text": "Water Minister Steve Double said:"
        },
        {
            "text": "The Environment Agency have also significantly driven up monitoring and transparency from water companies and will not hesitate to act to eliminate the harm sewage discharges cause to the environment. They have:"
        },
        {
            "text": "The EA are monitoring the current situation and supporting local authorities where needed."
        },
        {
            "text": "When the potential for a temporary reduction in water quality is forecast, a pollution risk warning is issued with advice against bathing."
        },
        {
            "text": "You can find daily pollution risk forecasts throughout the bathing water season as the EA’s Swimfo website."
        },
        {
            "text": "Follow Defra on Twitter, and sign up for email alerts here."
        }
    ]
}