{
    "url": "https://hmlandregistry.blog.gov.uk/2022/08/18/how-searchland-is-using-our-data-to-help-land-developers/",
    "title": "How SearchLand is using our data to help land developers",
    "authors": [
        "Arthur Goodhart, SearchLand Co-Founder and Head of Data"
    ],
    "categories": [
        "Data"
    ],
    "pub_date": "2022-08-18T09:00:05+01:00",
    "content": [
        {
            "text": "SearchLand was a participant in the Geovation Accelerator Programme in spring 2021 – a programme which provides geospatial and PropTech start-ups with grant funding and 12 months of support, backed by HM Land Registry and Ordnance Survey."
        },
        {
            "heading": 2,
            "text": "SearchLand’s purpose"
        },
        {
            "text": "We started SearchLand to enable property professionals to make better informed property and land decisions."
        },
        {
            "text": "I am one of three co-founders with two of us being software developers. This means that user experience and data integrity is vital to what we offer."
        },
        {
            "text": "We have sourced and combined a whole host of property and land related data from across England and Wales to provide a platform that captures the most reliable and relevant data for anyone looking for property information."
        },
        {
            "heading": 2,
            "text": "The Geovation Programme"
        },
        {
            "text": "We launched in January 2021 and participated in the Geovation Accelerator Programme later that year. The programme gave us 12 months of invaluable support, both financial and practical, in developing our business. Support included workshops on areas such as sales and marketing as well as coaching, mentoring and networking opportunities, all of which has helped us to deliver our solution to challenges that exist in the property market."
        },
        {
            "heading": 2,
            "text": "Our customers"
        },
        {
            "text": "Our customers range from small start-ups to business giants across the property sector. They are usually interested in:"
        },
        {
            "heading": 2,
            "text": "What we offer"
        },
        {
            "text": "As a PropTech (property technology) company we focus on giving insights on all property information. Our entire platform is structured around HM Land Registry title numbers and we also use a number of their datasets, such as:"
        },
        {
            "text": "We combine this data with data from other providers such as the National Grid, Companies House, Environment Agency, Historic England and local planning authorities."
        },
        {
            "text": "When someone clicks on a title, they can see all the information associated with that title from the data that we have combined. This means customers find sites based on their own requirements across any dataset from any provider. For example, users can quickly access planning data and see if planning permission is due to expire. They also have the option of sending personalised letters directly from the platform to the property owner."
        },
        {
            "text": "Price paid data means the users can create accurate valuations and not rely on third parties for this information. This allows them to set realistic expectations with landowners as well as operate in areas that fit their budget."
        },
        {
            "heading": 2,
            "text": "Benefits of our service"
        },
        {
            "text": "Property professionals spend an average of 100 hours per month just collecting data. Finding sites for development can be a time consuming and repetitive task. What’s more, conversion rates are between 3 to 10% for the sites that are found which means that 90% of the work is wasted."
        },
        {
            "text": "We designed SearchLand to save property professionals hundreds of hours doing research and enable them to validate information much more quickly and easily. We do this by combining all the necessary data on our platform and making it searchable according to individual criteria. This means clients have a one-stop-shop rather than having to search multiple sources and platforms."
        },
        {
            "text": "Users can apply filters when searching so they see only the relevant results for them, making their work incredibly quick and easy. For example, they can filter searches to show only brownfield sites within a particular town centre with failed planning permission but in a council that has recently started its local plan review."
        },
        {
            "text": "We know of one new user who was searching for land to build a house on. Within a week he found 30 sites, was able to engage with all landowners in writing immediately and closed a deal without ever getting past the free trial!"
        },
        {
            "text": "So far, our customers have identified and saved over 190,000 sites on the platform. Of these, a small percentage will go through to become tangible deals that ultimately will be used to deliver more housing."
        },
        {
            "heading": 2,
            "text": "Future steps"
        },
        {
            "text": "We have recently completed the huge task of digitising local plans for the South East of England and London. Using this data, we have created a new ‘strategic land tool’. Our future focus is to scale this up by digitising all 350 local plans across England and Wales. This is true to our commitment of releasing new tools for users which is what we’ve done since we launched."
        },
        {
            "text": " "
        },
        {
            "text": " "
        }
    ]
}