{
    "url": "https://forestrycommission.blog.gov.uk/2022/08/18/how-to-help-young-trees-survive-prolonged-hot-dry-weather/",
    "title": "How to help young trees survive prolonged hot dry weather",
    "authors": [
        "Chris Watson"
    ],
    "categories": [
        "Climate change and resilience",
        "Tree Planting",
        "Woodland creation"
    ],
    "pub_date": "2022-08-18T16:54:42+01:00",
    "content": [
        {
            "text": "This year has been particularly challenging for young trees with prolonged spells of hot dry weather, but there are things we can do to help them survive"
        },
        {
            "text": "The first 12 to 36 months after planting are a critical time for young trees as they adapt to new site conditions, develop their roots and get established. During this period, water availability is a critical factor."
        },
        {
            "text": "Prolonged exposure to dry conditions can impact trees in several ways. Initially, trees have natural responses which help them cope with these conditions. These can include increasing root development to encourage uptake of more water and reducing water loss from leaves during the hottest periods. Early signs include wilting of leaves/needles, and in these initial stages trees are usually able to recover from these conditions."
        },
        {
            "text": "As periods of dry weather continue, trees’ responses to the weather conditions can become detrimental to their ability to photosynthesise, their growth may be restricted, and permanent cell damage and loss of whole shoots, branches and roots can occur. In young trees it is likely that extended periods of exposure to drought will result in tree death."
        },
        {
            "heading": 2,
            "text": "A changing climate"
        },
        {
            "text": "Unfortunately, this year has been particularly challenging for young trees with extended periods of hot, dry weather from early spring onwards, leading to drought conditions in some areas of the country. Many young trees will struggle to survive under these conditions. Whilst this summer has been particularly challenging, this is by no means an isolated event."
        },
        {
            "text": "As we see our climate change, we are already experiencing the alteration of seasonal weather patterns with long dry springs being an increasingly common occurrence. We should therefore see this as a timely reminder to plan for increasingly unpredictable and challenging conditions."
        },
        {
            "heading": 2,
            "text": "What can you do?"
        },
        {
            "text": "The good news is that there are things you can do to prepare for such events and alleviate the pressure on trees through hot and dry weather which also increases their overall resilience to pests and disease."
        },
        {
            "heading": 3,
            "text": "Things to do now"
        },
        {
            "text": "The immediate things to do are:"
        },
        {
            "heading": 3,
            "text": "Preparing for next year"
        },
        {
            "text": "Unfortunately, it might be too late to save some trees, but you can prepare for future dry weather and take action to anticipate these challenges:"
        },
        {
            "heading": 3,
            "text": "Planning for the future"
        },
        {
            "text": "Drought is likely to become an ever more present threat to our trees, woods and forests as our climate changes. It is therefore essential that any woodland creation or restocking assesses the potential for changing local conditions over the lifespan of the trees being planted."
        },
        {
            "text": "Choosing the right trees for the site and owner’s objectives has never been more important, as is making sure that trees are sourced from suppliers who meet the requirements set out in the Plant Health Management Standard, such as by being a member of the Plant Healthy Certification Scheme or by obtaining a successful Ready to Plant assessment."
        },
        {
            "text": "Forest Research has developed the Ecological Site Classification system (ESC) which can help you identify the best trees for both current soils and site factors as well as predicted future climate suitability."
        },
        {
            "text": "Right Trees for a Changing Climate was developed to support species choice in an urban environment where a range of characteristics may be important."
        }
    ]
}