{
    "url": "https://forestrycommission.blog.gov.uk/2022/08/18/how-new-funding-will-help-to-support-englands-tree-seed-production/",
    "title": "How new funding will help to support England’s tree seed production",
    "authors": [
        "Megan Shirley"
    ],
    "categories": [
        "Urban trees",
        "Woodland creation"
    ],
    "pub_date": "2022-08-18T11:57:37+01:00",
    "content": [
        {
            "text": "Seed sourcing is an essential part of tree production and one that can sometimes be overlooked. A secure, diverse supply of tree seed is key to creating healthy, resilient woodlands."
        },
        {
            "text": "As part of targets to reach net zero, the government has committed to treble tree planting rates in England by 2025 and increase planting across the UK to 30,000 hectares per year by the end of this parliament. As planting rates increase, so too will the demand for tree seed."
        },
        {
            "heading": 2,
            "text": "Introducing the Seed Sourcing Grant"
        },
        {
            "text": "This Autumn, the Forestry Commission (FC) will be launching a new Seed Sourcing Grant (SSG) to support the sector in increasing the quantity, quality, and diversity of Seed Stands and Seed Orchards in England. The grant forms part of the government’s Nature for Climate Fund, which aims to create, restore and protect vital climate-regulating ecosystems including peatlands and woodlands."
        },
        {
            "text": "The SSG will support projects to increase the quantity, quality, and diversity of Seed Stands and Orchards on the Forest Reproductive Material (FRM) National Register for Basic Material."
        },
        {
            "text": "The funding is designed to boost domestic tree seed production. This will not only help to meet increased demand for trees but will also reduce the need to buy seed from the international market, lowering the risk of importing harmful pests and pathogens."
        },
        {
            "text": "The grant also aims to improve the diversity of England’s seed supply, for example, by increasing the range of species and provenances available. This will be crucial for creating diverse and resilient woodlands, which are better able to adapt to future climate conditions as well as new pests and diseases."
        },
        {
            "text": "The SSG will complement the Tree Production Innovation Fund and the Tree Production Capital Grant, which together seek to enhance the quantity, quality, and diversity of tree planting stock. You can read our Tree Production Innovation Fund - Second spotlight on successful applicants blog post, to learn more about how the Tree Production Innovation Fund has supported the Future Trees Trust to establish Clonal Seed Orchards for oak."
        },
        {
            "heading": 2,
            "text": "What will the funding cover?"
        },
        {
            "text": "SSG funding will be available for the following activities:"
        },
        {
            "text": "Proposals can include a combination of activities from the list above. As some activities will take time to implement, multi-year funding will be available."
        },
        {
            "text": "Defra has worked with technical experts to identify priority species (mostly native broadleaved species) for which Seed Stands and Seed Orchards are most urgently required. Seed sourcing strategies for these species will be published when the grant opens for applications. Projects which deliver against these strategies will be prioritised for financial support and eligible for up to 100% funding."
        },
        {
            "text": "However, we recognise that planting targets will lead to increased demand across all species. Funding will therefore be open to proposals covering any species listed in the UK FRM scheme, including those in the voluntary scheme. Projects designed to enhance the supply of non-priority species will be eligible for funding of up to 50%."
        },
        {
            "heading": 2,
            "text": "Who can apply?"
        },
        {
            "text": "We hope to attract a broad range of applicants, including both organisations already involved in these activities and those who have not previously considered seed sourcing. We will be encouraging applications from any UK-based public, private or third sector organisation that can demonstrate how the grant will be used to create new or improve existing English Seed Stands and Seed Orchards. Individual private landowners may also apply for eligible activities on their own land."
        },
        {
            "heading": 2,
            "text": "Find out more"
        },
        {
            "text": "If you want to find out more about seed sourcing and hear from experts in the sector, The Institute of Chartered Foresters (ICF) are hosting a free one-day webinar on 13 September 2022, Seed Sourcing for Trees of the Future, supported by DEFRA and the Forestry Commission."
        },
        {
            "text": "An overview of the day, including the schedule and speakers, is available on the webinar website."
        },
        {
            "text": "Visit the Institute of Chartered Foresters website to register."
        }
    ]
}