{
    "url": "https://dvladigital.blog.gov.uk/2022/08/18/kickstarting-your-digital-career-at-dvla-a-year-in-industry/",
    "title": "Kickstarting your digital career at DVLA - a year in industry",
    "authors": [
        "Luke Clifton",
        "Phoebe Alderman"
    ],
    "categories": [
        "DVLA Digital Services"
    ],
    "pub_date": "2022-08-18T16:00:27+01:00",
    "content": [
        {
            "text": "At DVLA we are fully committed to maintaining our position as a leading organisation for beginning or enhancing a career in digital and technology."
        },
        {
            "text": "Our Year in Industry (YII) programme, part of our Centre of Digital Excellence (CoDE), is an innovative development opportunity offering university students a 12-month placement at the end of their second year of study to work within DVLA’s IT technical areas. The programme allows students to apply academic theory from their time at university into real work projects."
        },
        {
            "text": "It’s a fantastic opportunity for students and DVLA; the students gain technical working experience in a fast-paced, cutting-edge IT department, and we learn from their skills in the latest emerging technologies and their different perspectives on IT. The scheme helps students develop their wider skills such as teamwork, resilience, communication and problem-solving with the programme also enhancing future employment opportunities."
        },
        {
            "text": "The programme is available to students at all UK universities, with 24 students taking part in the programme since its launch in 2018, each gaining experience in various technical roles."
        },
        {
            "text": "We recently caught up with Luke Clifton and Phoebe Alderman, students from the 2021 to 2022 YII cohort, who reflected on their YII journey at DVLA."
        },
        {
            "heading": 2,
            "text": "Tell us a bit about yourself?"
        },
        {
            "text": "Luke: My name is Luke and I am a computer science student at Cardiff University and will be graduating in 2023. I developed an interest in programming at a young age when I would mess around on the computer with my dad. I have been with DVLA since August 2021, working on the Quality Engineering Team in IT Service Creation as a Software Engineer in Test (SDET)."
        },
        {
            "text": "Phoebe: My name is Phoebe and I study computer science at the University of Exeter. I have been with DVLA since August 2021, taking part in their Year in Industry programme whilst completing my placement year at university. I have been working with the Database Team in ITS but was able to gain two weeks experience in the Mountain Goat Team, one of the agile development teams, which I thoroughly enjoyed."
        },
        {
            "heading": 2,
            "text": "What elements of your time at DVLA did you enjoy most?"
        },
        {
            "text": " Luke: There have been so many highlights! I’ve really loved getting to work alongside countless friendly and talented people on a number of projects. I’ve also enjoyed the huge variety of work that I have been assigned and being entrusted with testing and creating products that will be used by almost every household in the UK."
        },
        {
            "text": "Phoebe: I really enjoyed building a cloud-based database health check to support my team. The project covered both software development and databases which gave me the opportunity to put into practice the skills I learnt at university, whilst giving me a taste of what development in industry is like."
        },
        {
            "heading": 2,
            "text": "Did you achieve what you set out to from your time at DVLA?"
        },
        {
            "text": "Luke: Yes, absolutely. I wanted to understand more about how larger organisations operate, to put my coding knowledge to the test, and to feel that I had contributed to a project that was important and used by many people. I believe that in my short time at DVLA, I have achieved all of these goals and more."
        },
        {
            "text": "Phoebe: Yes, I did. I would have loved to spend more time with the Agile Development Team so I could pick up more skills and really get to grips with industry level coding. However, I was able to further my databases knowledge and as a bonus, was able to test out my software development skills. Overall, I feel like I’ve surpassed my initial goals for my time here."
        },
        {
            "heading": 2,
            "text": "What’s next for you?"
        },
        {
            "text": "Luke: In September I will be returning to Cardiff to complete my third and final year of university. After that, I’m not too sure yet but I know that the knowledge and skills I have gained during my year in industry will be fundamental in my professional development."
        },
        {
            "text": "Phoebe: Next up for me is my final year at Exeter University, where I will be doing a dissertation on diagnosing colorectal cancer from histopathology images using image recognition and machine learning. This year in industry has made me eager to get the ball rolling on my final year and apply both the hard and soft skills I have picked up here to my next academic year."
        },
        {
            "text": " "
        },
        {
            "heading": 2,
            "text": "What will you miss the most?"
        },
        {
            "text": "Luke: It’ll be the people that I have had the pleasure of working with over the course of this placement as well as working with DVLA’s state-of-the-art IT equipment."
        },
        {
            "text": "Phoebe: Learning new skills from the talented IT professionals at the agency and the friendly faces at DVLA!"
        },
        {
            "heading": 2,
            "text": "Join us and kickstart your career in IT"
        },
        {
            "text": "Here at DVLA, we’re proud to be a dynamic, digital organisation. We believe that it’s vital to invest in the development and skills of our people to grow and inspire the next generation of IT professionals."
        },
        {
            "text": "We are excited to welcome the 2022 to 2023 cohort of 4 new Year in Industry students later this month, 3 of which are computer science students and we’ll be welcoming our first digital communications student."
        },
        {
            "text": "If you’re interested in kickstarting your digital career at DVLA, you can find out more about the Year in Industry programme and the various development programmes our ITS department has to offer here."
        }
    ]
}