{
    "url": "https://space.blog.gov.uk/2022/08/18/protecting-big-spacecraft-from-the-harshness-of-space/",
    "title": "Protecting big spacecraft from the harshness of space",
    "authors": [
        "Dr Robin Frances"
    ],
    "categories": [
        "NSTP"
    ],
    "pub_date": "2022-08-18T14:38:28+01:00",
    "content": [
        {
            "text": "Suffolk-based ceramic surface treatment firm, Keronite, is reaching for the stars after discovering how to roll out its optical coating process for larger space structures. Dr. Robin Francis, Chief Technology Officer at Keronite, explains how it works. "
        },
        {
            "text": "We were delighted to report the successful completion of our Ocular project this year. "
        },
        {
            "text": "Supported by the UK Space Agency’s national space technology programme, our aim was to demonstrate a continuous processing method for producing state-of-the-art optical coatings for very large components using our plasma electrolytic oxidation (PEO) technology. "
        },
        {
            "text": "The success of the project will open significant opportunities to extend the use of proven PEO coatings on very large aerospace structures, such as next generation space telescopes, and launch and orbital vehicles. "
        },
        {
            "heading": 2,
            "text": "How does it work? "
        },
        {
            "text": "Keronite’s PEO technology involves creation of a ceramic oxide layer on the surface of metals such as aluminium, titanium and magnesium. "
        },
        {
            "text": "The ceramic layer offers exceptional properties for space applications such as stable thermo-optical properties, thermal barrier and corrosion protection, low outgassing, high durability, and resistance to UV degradation even under the extreme conditions found in space. "
        },
        {
            "text": "Our work has been highly prized for applications such as optical instrument components, and for shielding and thermal control, and our coatings have already been deployed on numerous space missions, including ESA’s BepiColombo, MetImage, Sentinel 2, Sentinel 5, Euclid, Hayabusa 2, FlexFloris, MetImage, and CO3D. "
        },
        {
            "heading": 2,
            "text": "Overcoming the challenges "
        },
        {
            "text": "Conventionally, Keronite coatings are produced by immersing the components in an electrolyte bath and applying a high voltage waveform of a specific form from a power supply unit (PSU). "
        },
        {
            "text": "This approach works well for small to medium sized components, such as those produced for the missions mentioned above. "
        },
        {
            "text": " "
        },
        {
            "text": "However, we’ve seen an increasing demand for thermo-optical coatings for large and extra-large components, including space cargo modules and extra-large telescopes (ESA L-class missions) and these cannot be coated in the traditional way, due to physical constraints of the processing tanks and limits on the amount of current which can be drawn from the PSU. "
        },
        {
            "text": "The Ocular approach overcomes this challenge by only immersing a small section of the part at any given time while rotating the part to ensure full coating coverage. "
        },
        {
            "text": "During the project, we demonstrated proof of concept for the Ocular approach using specially designed and fabricated equipment and an aluminium ring as an exemplar part. "
        },
        {
            "text": "We successfully proved that the approach is feasible, and that components coated using this method are essentially identical to those coated in a conventional way. "
        },
        {
            "text": "Challenges, such as maintaining and coating round the full diameter of the part, and managing interface effects as the part enters and exits the electrolyte, were overcome by appropriate equipment design and applying special processing conditions. "
        },
        {
            "heading": 2,
            "text": "What does this mean for space technology? "
        },
        {
            "text": "Achieving this milestone has given us a unique capability in the field of PEO coating of very large components for space and other applications, opening significant commercial opportunities for Keronite and assisting the development of the space optical instruments supply chain in the UK. "
        },
        {
            "text": "We are now focusing on scaling the process to sizes representative of large commercial components and in extending the range of coatings which can be applied in this way. "
        },
        {
            "text": "We look forward to publishing details of the Ocular approach in academic and industry journals very soon. "
        }
    ]
}