{
    "url": "https://queensawards.blog.gov.uk/2022/08/18/synalogik-receives-queens-award-for-innovation-from-hrh-the-duke-of-gloucester/",
    "title": "Synalogik Receives Queen’s Award For Innovation From HRH The Duke of Gloucester",
    "authors": [
        "The Queen's Awards for Enterprise"
    ],
    "categories": [
        "Advice",
        "Innovation",
        "Lord-Lieutenants",
        "Queen's Award",
        "queensawards",
        "South West",
        "Visits",
        "Winners"
    ],
    "pub_date": "2022-08-18T09:54:39+01:00",
    "content": [
        {
            "text": "SYNALOGiK are a leading provider of data aggregation, automation and risk identification software solutions for compliance and fraud investigations. Following their achievement of a Queen’s Awards for Enterprise for Innovation earlier this year, Synalogik held their presentation ceremony at Hub8 in Cheltenham. The award was presented by HRH The Duke of Gloucester. The presentation ceremony was a great way for the whole company to enjoy the celebrations and be recognised for their success. "
        },
        {
            "text": "Synalogik were recognised with a Queen’s Award for Enterprise in Innovation due to their data aggregation platform, Scout®, and its contribution to fighting financial crime and helping organisations with regulatory compliance across both the public and private sector. Since its creation in 2018, Scout® has quickly gained clients across the insurance, banking, legal and public sector. "
        },
        {
            "text": "Gareth Mussell, CEO at Synalogik, said:"
        },
        {
            "text": "Synalogik’s solution, Scout®, is a unique platform that enables organisations to automate data aggregation from multiple disparate sources, identify risk and report findings in seconds.  Scout® is the “Single Intelligence Environment”; permitting concurrent searches over multiple live data sources to be analysed. The system integrates internal, third party and open-source data into automated workflows so that teams no longer need to log in and out of different data silos before decisions can be made. The result is swifter and more rigorous decision making, whether you’re looking for fraud, money laundering or Regulator-driven compliance checks. "
        },
        {
            "text": "Now in its 56th year, The Queen’s Awards for Enterprise are the most prestigious business awards in the country, with winning businesses able to use the esteemed Queen’s Awards Emblem for the next five years. It is an internationally recognised symbol of excellence that will get your business noticed.  "
        },
        {
            "text": "Has your business got what it takes to achieve a Queen’s Awards for Enterprise?\nApplications are open now and close 1pm 6th September. \nApply here: https://www.gov.uk/queens-awards-for-enterprise "
        },
        {
            "text": "Contact our helpline if you have any questions: queensawards@beis.gov.uk or 020 7215 6880   "
        }
    ]
}