{
    "url": "https://traderemedies.blog.gov.uk/2022/08/18/whats-in-a-name-why-categorising-products-precisely-matters-for-trade-remedies/",
    "title": "What’s in a name – why categorising products precisely matters for trade remedies",
    "authors": [
        "Malcolm Sorrell, Statistician"
    ],
    "categories": [
        "Analysis"
    ],
    "pub_date": "2022-08-18T13:52:49+01:00",
    "content": [
        {
            "text": "What’s the difference between ‘Bicycles, tricycles and quadricycles, with pedal assistance, with an auxiliary electric motor with a continuous rated power not exceeding 250 watts’ and ‘Cycles, with pedal assistance, with an auxiliary electric motor’?"
        },
        {
            "text": "They both have a unique commodity code to identify them when being imported or exported at the UK border. They are also products covered by trade remedy measures that the UK will be investigating to determine whether they should continue following the UK’s departure from the EU."
        },
        {
            "text": "A comprehensive goods classification system is essential for a country to know what is being traded, to collect import duties and prevent trade in controlled goods."
        },
        {
            "text": "Similarly, an effective trade remedies investigation is dependent on being able to identify trade in the goods under investigation."
        },
        {
            "heading": 2,
            "text": "Development of a trade classification"
        },
        {
            "text": "Going back as far as the mid-nineteenth century there were discussions on developing a statistical nomenclature for classifying goods traded internationally. The major impetus was the expansion in trade following the end of the Second World War. The precursor to the current system can be traced back to 1949, leading to the Customs Co-operation Council Nomenclature (CCCN), with several updates over the next twenty years."
        },
        {
            "text": "Developed by the World Customs Organisation (WCO), the Harmonised Commodity Description and Coding System, commonly known as the Harmonised System or HS, was introduced in 1988. Designed as a common nomenclature allowing all types of goods to be assigned a unique code when they cross economic borders. As of December 2018, the HS system is used by over 200 economies and customs or economic areas. Its primary purpose is the classification of goods enabling governments to know what is being traded and enabling collection of import duties."
        },
        {
            "text": "The Harmonised System is hierarchical and organised into sections:"
        },
        {
            "text": "There are 99 2-digit ‘chapters’ expanding to around 5,000 6-digit ‘commodity groups’."
        },
        {
            "text": "Each commodity code is made up of a number of different parts, based on:"
        },
        {
            "text": "As the pattern of trade evolves reflecting changing technologies, so does the need for revisions to the HS. For example, typewriters ceased to need their own code, whilst the development of microelectronics required additional classifications to capture the pattern of trade across a range of new products. Since its inception in 1988 amendments have been introduced approximately every five years, with the current update introduced in January 2022."
        },
        {
            "heading": 2,
            "text": "Countries can go further"
        },
        {
            "text": "Beneath the internationally consistent six-digit codes, countries can introduce further granularity at the eight and 10-digit level reflecting their needs."
        },
        {
            "text": "The UK, prior to departure from the EU, adopted the EU Common Nomenclature (CN) system. This added a further breakdown of eight and 10 digits. These additional digits are used for making customs declarations, providing international trade statistics, and determining which rate of custom duty applies. The UK, having left the EU can introduce changes at the eight and 10-digit level as required. You can search for a commodity code for a good on GOV.UK."
        },
        {
            "text": "Table 1. Example of the CN classification system"
        },
        {
            "heading": 2,
            "text": "Goods classification within trade remedy investigations"
        },
        {
            "text": "Trade remedies investigations can vary in their product breadth and hence the number of HS codes they cover. For example, the current TRA anti-dumping and anti-subsidy investigations into optical fibre cables  cover two 10-digit codes within a single eight-digit code through to the recent TRA biodiesel investigations (anti-dumping and anti-subsidy) based on 36 10-digit codes within 11 eight-digit headings."
        },
        {
            "text": "When the TRA initiates a new investigation, it is the applicant’s responsibility to propose the list of HS codes the goods subject to the investigation fall within. During the pre-application stage, the TRA can explore with the applicant the specific product and how far they can break it down in terms of the codes to meet the initiation requirements."
        },
        {
            "text": "The product classification in the current TRA anti-dumping investigation into ironing boards from China has been chosen to be sufficiently narrow to ensure it only covers the intended product."
        },
        {
            "text": "Table 2. Commodity codes covered by TRA anti-dumping investigation into ironing boards from China"
        }
    ]
}