{
    "url": "https://defradigital.blog.gov.uk/2022/09/23/leaders-blog-colin-banno-thornton-on-the-future-of-digital-delivery-in-defra/",
    "title": "Leader’s blog: Colin Banno-Thornton on the future of digital delivery in Defra",
    "authors": [
        "Colin Banno-Thornton"
    ],
    "categories": [
        "Defra digital"
    ],
    "pub_date": "2022-09-23T07:30:55+01:00",
    "content": [
        {
            "text": "We made some organisational changes in our Digital data and technology organisation earlier in the year to bring together our projects and digital delivery teams into a single, digital delivery portfolio."
        },
        {
            "text": "Why did we do this, you might be asking yourself? Essentially those moves were a necessary prelude to a piece of work aimed at standardising and simplifying our ways of working, which got underway very recently."
        },
        {
            "text": "It's called Future Digital Delivery (FDD), and there are four key outcomes that we will be focusing on:"
        },
        {
            "heading": 2,
            "text": "Why we’re doing this"
        },
        {
            "text": "But first, a bit about the ‘back story’. Stick with me, though this bit might be a little dry, it’s necessary to help you understand why we’re doing all of this."
        },
        {
            "text": "We were previously set up to deliver across Defra as three separate portfolios (Group Infrastructure and Operations, Major Projects, and Digital Delivery). As separate digital portfolios we couldn't effectively prioritise work, according to business outcomes, to enable delivery."
        },
        {
            "text": "Through merging projects and delivery into a single portfolio, we can transform the way that our projects are delivered, realise the full potential of our teams, and increase the level of financial control. With me so far?"
        },
        {
            "heading": 2,
            "text": "The benefits"
        },
        {
            "text": "Let’s look at the benefits we hope to realise from this merging of teams into a single digital delivery portfolio. For me, there are many."
        },
        {
            "text": "The major ones are how this will help create a more joined-up working environment both with our own teams but also with policy and operations teams. Users of Defra services will also benefit from greater join up across those services."
        },
        {
            "text": "For our delivery teams the move will help reduce the amount of duplication, drive greater visibility, transparency, and opportunities for learning."
        },
        {
            "text": "Our portfolio team and the project delivery profession will have a more holistic picture of delivery status, along with clarity as to where we best deploy time and people to add the most value."
        },
        {
            "text": "These changes will also realise increased value from our supplier partners, reduce governance layers and result in faster and more efficient mobilisation and delivery with unnecessary steps simplified. This will be music to the ears of our delivery partners no doubt."
        },
        {
            "text": "And finally, there will be a clearer training and development path for civil servants, as well as opportunities to work across the portfolio."
        },
        {
            "heading": 2,
            "text": "Aligning things together"
        },
        {
            "text": "This work aligns to another piece of work also underway across Defra where we are working alongside the Defra transformation and strategy leads to explore how, collectively, we can work in partnership to progress the digital and service transformation agenda."
        },
        {
            "text": "There was a great discussion at a recent Defra ExCo meeting around setting out a clear vision and operating model for digital transformation, and the need to establish a digital transformation programme. This will be guided by the government’s CDDO Roadmap and aligned to the customer and user services that Defra provides."
        },
        {
            "text": "This is a real milestone in further establishing our role as trusted advisor and partner at the most senior levels of Defra. I recognise that colleagues in our teams are taking huge steps to establish these sorts of strong relationship at all levels of the organisation, and it’s reassuring to know that our partnership approach is supported from the top."
        },
        {
            "heading": 2,
            "text": "How we’re bringing our people along on the journey"
        },
        {
            "text": "A major dependency for all of this to succeed is that everyone in our organisation understands the changes, why they are being made, and how they as individuals and teams can align to the new structure and ways of working, so that everything works as intended."
        },
        {
            "text": "Which is where engagement comes in, and which is why we recently kicked off our fortnightly FDD drop-in sessions. These sessions provide an opportunity for colleagues to ask any questions, and to hear how the programme of work is progressing. They will continue in the months ahead as we seek to build our partnership approach, one which is supported at all levels of the organisation, and not simply from the top."
        },
        {
            "heading": 2,
            "text": "What next?"
        },
        {
            "text": "My delivery leadership team have agreed some priority areas of focus for the next quarter including portfolio analysis, demand and capability mapping and clarifying processes. These will be supported by some principles, for example adapting and learning, leveraging best practice, and working as one team."
        },
        {
            "text": "We want – actually, we need - everyone in Defra to get behind us on this journey. Our proverbial door is open, and we welcome ideas from anyone, including from outside Defra.  So if you’re reading this and you’re thinking ‘I’ve got an idea’ then do please leave me a comment on this post, or reach out to the team who will be happy to hear from you."
        }
    ]
}