{
    "url": "https://socialcareinspection.blog.gov.uk/2022/09/23/piloting-ofsted-inspectors-ois-in-social-care/",
    "title": "Piloting Ofsted Inspectors (OIs) in social care",
    "authors": [
        "Yvette Stanley"
    ],
    "categories": [
        "inspectors",
        "social care professionals"
    ],
    "pub_date": "2022-09-23T09:30:34+01:00",
    "content": [
        {
            "text": "Yvette Stanley, our National Director for Regulation and Social Care, discusses plans to pilot the use of serving social care practitioners as Ofsted Inspectors (OIs)."
        },
        {
            "text": "As an inspectorate and a regulator, we always want to learn from and draw on the expertise of those working in the areas we inspect and regulate. We have done this most visibly through our use of OIs, who are serving practitioners from across the schools, further education and early years sectors. They make up the majority of our workforce in these areas and I know how valuable their first-hand experience and insight into current practice have been over the years."
        },
        {
            "text": "For over 2 years we have employed former and retired social care practitioners as OIs to support our regulatory inspections in children’s social care. But we think now is the right time to consider how currently serving social care practitioners could complement our regulatory workforce. To help us to work through the opportunities and challenges, we have developed a small-scale pilot to run for 6 to 9 months. This feels like the logical next step after the success of including OIs in our other inspection and regulatory remits."
        },
        {
            "text": "We are, of course, acutely aware of the significant recruitment challenges the sector continues to face. The last thing we want to do is to add to those pressures. That’s why, for now, we will only use serving practitioners from some of the largest providers. These providers will have the greatest capacity to release frontline staff and can ensure that there is no impact on the children they are caring for. We would like to have included some local authority staff in the pilot, but their release at this time was too challenging."
        },
        {
            "text": "Following a thorough selection process, we now have a small number of serving practitioners ready to take part in our training programme. As they progress through the programme, they will shadow and work closely with our most experienced, permanent inspectors who will provide substantial oversight and support."
        },
        {
            "text": "Maintaining high standards"
        },
        {
            "text": "Regardless of whether an inspector is permanently employed by Ofsted or contracted as an OI, we will hold them to the same high standards so that our inspection and regulatory activity continues to work in the best interests of children. Maintaining these high standards is our priority."
        },
        {
            "text": "For that reason, none of the OIs involved in the pilot will be inspecting alone until they are fully trained and have passed the necessary checks. We also have well-established procedures in place from our work with OIs in education and early years, and from consultation with provider groups, to help us manage any potential conflicts of interests. If a conflict is identified once an OI is on site, we will address it immediately. We do this for our Social Care Regulatory Inspectors, as many will have previously worked directly with children and for a regulated provider."
        },
        {
            "text": "We will evaluate and share the outcome of the pilot when it ends in spring 2023."
        }
    ]
}