{
    "url": "https://accessibility.blog.gov.uk/2022/09/23/the-accessibility-in-government-blog-returns/",
    "title": "The Accessibility in government blog returns",
    "authors": [
        "Samantha Merrett",
        "Jessica Eley"
    ],
    "categories": [
        "Accessibility",
        "Accessibility Monitoring",
        "Accessibility Regulations"
    ],
    "pub_date": "2022-09-23T10:15:10+01:00",
    "content": [
        {
            "text": "You might have noticed that the Accessibility in government blog had grown a little quiet over the last couple of months but we are pleased to announce that we are now back and the new blog owners - Samantha Merrett, Accessibility Lead at the Food Standards Agency and Jessica Eley, Accessibility Officer at the Government Digital Service - are ready to share their plans for the future of the blog."
        },
        {
            "text": "We are very excited to have the opportunity to blog about accessibility best practice and share interesting information with the wider accessibility community. We thought it might be a good idea to take a moment to introduce ourselves."
        },
        {
            "heading": 2,
            "text": "Samantha Merrett, Accessibility Lead"
        },
        {
            "text": "Hi, my name is Samantha and I work at the Food Standards Agency (FSA). Before starting at the FSA, I worked at the Ministry of Defence, publishing information on GOV.UK, and I learnt a lot about accessibility. I was there during the initial release of the Public Sector Bodies Accessibility Regulations so I had to learn all about it in a very short space of time."
        },
        {
            "text": "I started my first full time role in Accessibility in April 2021 at the FSA. In my current role, I am primarily responsible for our main FSA website; this is where we publish most of our content both scientific reports and important consumer and business guidance."
        },
        {
            "text": "It is of vital importance that the information we publish is easy to understand and access. If a business owner is unable to access and understand our guidance and regulations, this could have major implications for consumer safety."
        },
        {
            "text": "We embarked on our HTML-first/accessible by default-journey about a year ago now, and have made great progress so far. You can read more about how we did this in my previous blog post, Accessible by default at the Food Standards Agency."
        },
        {
            "text": "We are now HTML-by-default when publishing content online, we have made a number of accessibility improvements to our website, and have updated our brand guidelines to ensure they are embedding accessibility at the heart of design."
        },
        {
            "text": "There is still a lot more work to do but we are working to create an equal and inclusive environment internally and continue to publish fully accessible external communications."
        },
        {
            "heading": 2,
            "text": "Jessica Eley, Accessibility Officer"
        },
        {
            "text": "Hi, I’m Jess and, as mentioned, I’m an Accessibility Officer at the Government Digital Service (GDS)."
        },
        {
            "text": "I joined GDS as a Business Apprentice with the Cabinet Office, and the topic of accessibility was completely new to me. I’ve learnt a lot over the past 2 years thanks to my brilliant team and the accessibility community - so I’m excited to be able to give something back by helping run this blog."
        },
        {
            "text": "I’m currently part of the accessibility monitoring and reporting team, so day-to-day I test public sector websites for compliance with the Public Sector Bodies (Websites and Mobile Applications) (No. 2) Accessibility Regulations 2018."
        },
        {
            "text": "Whilst there is a legislative requirement for public sector websites to be accessible, it is also important to appreciate that the public have to use these websites for information and services that cannot be found elsewhere. This means it is vital that the services and content on the websites we test can be used and understood by the widest possible audience."
        },
        {
            "text": "The team has been working hard for the past few years to make the monitoring process as efficient and effective as possible both internally and externally. For example, I have colleagues who have moved on to detailed and mobile app testing, whilst others have been busy building a bespoke platform for the monitoring and reporting team. You can read more about our work in our 2020-2021 end of year report - and hopefully we’ll also appear in some future blog posts!"
        },
        {
            "heading": 2,
            "text": "What’s next?"
        },
        {
            "text": "We’re really excited to be working together to share the excellent accessibility work going on across government and beyond, and the advancements we’re making towards building an accessible future."
        },
        {
            "text": "We can’t run this blog without you so please get in touch if you’d like to share what you’re working on or anything you think would be valuable to the accessibility community."
        }
    ]
}