{
    "url": "https://moderncivilservice.blog.gov.uk/2024/04/12/meet-the-modern-civil-service-jim-harra/",
    "title": "Meet the Modern Civil Service: Jim Harra",
    "authors": [
        "Government Reform"
    ],
    "categories": [
        "A Modern Civil Service",
        "Ambitious",
        "Capability",
        "Data science",
        "Digital and data",
        "Government Reform",
        "Innovation",
        "Modernisation and Reform",
        "Proud Civil Servant"
    ],
    "pub_date": "2024-04-12T11:44:00+01:00",
    "content": [
        {
            "text": " "
        },
        {
            "text": "Hello! Welcome to another interview in the Meet the Modern Civil Service series. The aim of this series is to showcase the people in the civil service who are driving innovation, whether that be through being a learning champion, embracing digital and data into their daily working or helping develop new hubs across the UK."
        },
        {
            "text": "Deepa Thomas-Sutcliffe from the Modernisation and Reform Unit spoke with Jim Harra, First Permanent Secretary and Chief Executive of HMRC, about what A Modern Civil Service means to him, as well as how he sees reform in action and how all civil servants and the public will benefit from change. Jim Harra is also the Civil Service Digital and Data mission sponsor."
        },
        {
            "heading": 2,
            "text": "What does a Modern Civil Service mean to you?"
        },
        {
            "text": "I joined the Civil Service almost 40 years ago and, of course, modernisation has happened throughout that time. What stays consistent is the values of the organisation, so integrity, honesty, objectivity and impartiality, but what changes is how you deliver things."
        },
        {
            "text": "I think a skilled, innovative and ambitious civil service is what we're aiming for. Given the mission that I sponsor, the Civil Service needs to harness the power of digital services, data and technology, and really use those to drive better public services and help ministers make better decisions and better protect the country."
        },
        {
            "heading": 2,
            "text": "How have you seen digital transformation support operational colleagues to be ambitious?"
        },
        {
            "text": "In HMRC especially, a lot of the digital services that we have developed have been about enabling customers to complete the transactions that they need to do, online on gov.uk or the HMRC app. Increasingly, we are expanding that to enabling customers to obtain the information and guidance they need. We still receive a huge amount of contact from customers seeking information or guidance from us over the phone. We receive around 38 million calls a year, for example, to our helplines, and many customers still contact us by post as well."
        },
        {
            "text": "Customers call for a number of reasons, such as checking whether they've filed their taxes right and correcting any errors that they make. The digital transformation that’s happening is about modernising the way people can find out what they need. We’re encouraging customers to use our online digital assistant to find the information they need, and if necessary, get further help from an HMRC webchat advisor."
        },
        {
            "text": "The second area is on managing compliance. We've been implementing a programme called Making Tax Digital, which is about requiring businesses to use business accounting software to keep accurate records, which speak directly to our systems and upload to them. We've implemented that for VAT and we will be implementing it from 2026 for income tax, and that will bring in about 5 billion pounds additional revenue by the end of 2028-29 through helping people make fewer errors."
        },
        {
            "text": "This will enable my colleagues to focus on the higher-end compliance cases and free them up from dealing with that simpler error that can be dealt with through digital solutions. The next stage, I think, is using our own systems and that proprietary accounting software to build on our risk assessment, and our nudges and prompts, to help people get it right and help prevent error."
        },
        {
            "heading": 2,
            "text": "What is your vision for an Ambitious Civil Service that embraces digital and data in the next ten years?"
        },
        {
            "text": "Something that we've talked about for a long time is citizen-centred services, and digital and data solutions nowadays make it a reality that we can deliver. We can achieve this if we are innovative and if we focus on the citizen or the business rather than on our organisational boundaries within the Civil Service."
        },
        {
            "text": "Each department and profession has slightly different needs. but all of it is reliant on us having the skills to handle data confidently and effectively, and having the right ability to exchange it. At the moment, I think two departments exchanging data is much, much more painful than it needs to be. "
        },
        {
            "heading": 2,
            "text": "What's your message about how artificial intelligence will impact their work lives as well as the services they provide customers? "
        },
        {
            "text": "We already use artificial intelligence (AI) a lot in HMRC, obviously the new innovation is generative AI. Some technologies and concepts have come and gone in my career and not all of them have been very useful. But it feels like generative AI really is going to make a difference and that we're on the cusp of a revolution."
        },
        {
            "text": "I think it will help us to be more productive and to do our jobs better and provide better services. We are looking at some use cases in HMRC about how we can use AI internally to help our people be more productive. For example, we've been testing using generative AI to write up the summary at the end of a helpline call, which saves the advisor from having to do that and enables them to get on to helping the next customer. We have also been working with GDS to test a gov.uk chatbot that will use generative AI to help customers even faster."
        },
        {
            "heading": 2,
            "text": "As the digital and data mission sponsor, what is your ambition for how we use data across the Civil Service?"
        },
        {
            "text": "We've got to focus on making sure that we've got sound data that generative AI tools we develop can mine, and that when generative AI gives answers from that data you can actually trace the sources and be able to explain how it has arrived at a specific conclusion. "
        },
        {
            "text": "But we also know that when it comes to operational data there are always challenges with the quality of it, and therefore there are always risks that whatever system you put on top of it will not produce the right answer. I think we'll have to think through as we roll out customer-facing generative AI, what our stance is for when our systems don't give the right answer to the citizen."
        },
        {
            "text": "We have data analysts and they've got to have that really specialist ability to help solve these problems, but realistically, everyone has to be able to use data confidently to some degree. I think we are increasingly moving towards a world where operational colleagues, rather than digital and data professionals, will create services and compose them from low code, no code services, into tools that help us deliver better solutions."
        },
        {
            "text": "Therefore there'll be a wider range of people who need to be able to confidently do that, and One Big Thing is a step towards upskilling everyone to better use data for decision-making and providing better services."
        },
        {
            "heading": 2,
            "text": "What can policy departments learn from large operational departments in using digital and data technology? "
        },
        {
            "text": "I think if you're a policy advisor in government you need to be able to find and use data quickly and efficiently, and a lot of the time the data you want is somewhere in government already. So I think you need to be imaginative about where the data might be that you can use and consider how you can access it confidently."
        },
        {
            "text": "At HMRC, we are used to being the repository of really powerful data that lots of people across government could use. Civil servants need to be confident about sharing it, but more importantly, they need to be proficient in giving people access to it in a simple and easy way."
        },
        {
            "text": "I think we need a streamlined way of sharing data. That means creating a standard process to follow to access it. You demonstrate your use and need for it, and how you will meet all the security and data and protection standards if that's required, and then have a sort of hub for subscribing for that data and picking it up at the moment you need it. Right now, it’s too bespoke and takes too long and costs far too much compared with, I think, an industrialised process of accessing shareable data. "
        },
        {
            "text": "Part of my mission is to make sure that we've got a data and digital profession that can develop its skills and can be properly rewarded and recognised in the Civil Service and that the Civil Service attracts the best people. We've got a lot going for us in terms of the experience that we can give people in the digital and data profession as well as the terms and conditions and the great purpose that they can serve. As an organisation, we've got to keep building on that and keep attracting the brightest and the best people. "
        }
    ]
}