{
    "url": "https://cyberandspecialistoperationscommand.blog.gov.uk/2024/04/12/pd-thor/",
    "title": "The name's Thor - PD Thor!",
    "authors": [
        "abievans"
    ],
    "categories": [
        "Gibraltar",
        "Overseas Bases"
    ],
    "pub_date": "2024-04-12T10:16:51+01:00",
    "content": [
        {
            "text": "Meet Thor, one of Gibraltar Defence Police’s four legged officers who are specially trained and must be healthy, of good temperament and most importantly, be bold and courageous!"
        },
        {
            "text": "The talents of our canine companions are still an invaluable crime-fighting tool for us at the GDP with their different specialist skills, including being able to detect explosives."
        },
        {
            "text": "GDP’s Force Dog Officer, Police Constable (PC) Mario Johnson, attended the Explosive Detection Dog Course at the Defence Animal Training Regiment (DATR) in Melton Mowbray, which is the largest Ministry of Defence dog training facility in the UK."
        },
        {
            "text": "Here, PC Johnson met his new furry pal Thor."
        },
        {
            "text": "“The DATR delivers animal handling training for more than 400 personnel and role specific training for over 300 Military Working Animals per year,” a spokesman for the GDP said."
        },
        {
            "text": "“The military working dogs are deployed around the world in such places as Cyprus, Brunei, Germany, Mali and Gibraltar.”"
        },
        {
            "text": "During the course, the team carried out searches in a multitude of scenarios and environments such as football stadiums, castles, trains and industrial sites to replicate real life situations."
        },
        {
            "text": "Thor, a springer spaniel, at the tender age of 13 months, was the youngest pup in his class of 8."
        },
        {
            "text": "The training was divided into intense low and high risk searches of vehicles, areas and buildings."
        },
        {
            "text": "Once Thor arrived in Gibraltar, he underwent environmental training before being licensed by an independent assessor from the Ministry of Defence Police (MDP)."
        }
    ]
}