{
    "url": "https://defrafarming.blog.gov.uk/2024/04/12/upland-webinar-follow-up/",
    "title": "Webinar follow up: Uplands",
    "authors": [
        "Becky Briggs"
    ],
    "categories": [
        "Countryside Stewardship",
        "Sustainable Farming Incentive",
        "Webinars"
    ],
    "pub_date": "2024-04-12T16:05:30+01:00",
    "content": [
        {
            "text": "On Wednesday 27 March, we held a webinar on the Sustainable Farming Incentive (SFI) and Countryside Stewardship (CS) schemes for upland farmers.  In this post, I’ll summarise what we covered and include links for you to learn more."
        },
        {
            "text": "We were pleased to be joined by Daniel Procter, a 5th generation sheep farmer, farming in the hills between Lancashire and Yorkshire.  Daniel is part of the SFI pilot and he is also an SFI agreement holder. He shared the actions he included in his agreement, how he found the process to apply and that he was eager to add more actions when they’re available. "
        },
        {
            "text": "After his own positive experience, he recommended that farmers take advantage of the free, independent business advice offered through the Farming Resilience Fund. You can find an adviser in your area and contact them directly. You can learn more about Daniel’s approach by watching the recording embedded above or visiting his website, marlfieldfarm.co.uk. "
        },
        {
            "text": "In the session, policy advisers working on the schemes gave a summary of the offer for upland farmers and took questions from attendees. We covered some of the improvements, which include:"
        },
        {
            "heading": 2,
            "text": "Moorland offer "
        },
        {
            "text": "We designed the actions for moorland and upland peat to help: "
        },
        {
            "text": "Moorland covers permanent grassland and certain non-agricultural features, such as scrub, scree, bracken and bog, located above the moorland line. We have listed the main actions which will be available on moorlands below. However, it should be noted that other actions (such as payment for the management of deer) will also be available. "
        },
        {
            "text": "Further information on all the actions is within the Technical Annex. "
        },
        {
            "heading": 2,
            "text": "Moorland assessment "
        },
        {
            "text": "The aim of MOR1 is to support you, the farmer, to understand what environmental benefits your moorland is currently delivering and how it could provide more in the future. The data collected is for you to use to plan your moorland management actions. The assessment has been designed to be suitable for farmers to undertake, and it is not necessary to employ an agent or ecologist to do the survey for you, unless you wish to do so.   "
        },
        {
            "text": "Further information on MOR1 is in the SFI Handbook."
        },
        {
            "text": "We are working to provide an enduring system solution for our commons customers as part of the enhanced SFI offer and we will provide more information as soon as we have this. "
        },
        {
            "heading": 2,
            "text": "Grazing land using native breeds "
        },
        {
            "text": "The native breeds at risk action is a supplement designed to sit on top of other actions. The amount you get paid depends on the percentage of your livestock on the native rare breeds list, which we will provide more information on later this year.  "
        },
        {
            "text": "We utilise an income-forgone plus cost approach to calculate payment rates. The payment rates for grazing with rare native breeds are based on the underlying stocking level for different habitats. "
        },
        {
            "text": "Grasslands can be sustainably stocked at greater densities and therefore the financial impact of grazing with native breeds is higher than on moorland and heathland which are stocked at much lower densities; this is the reason for the higher payment rate on grasslands. "
        },
        {
            "text": "We’re exploring how this action will work on commons, and again we will provide more details later this year.  "
        },
        {
            "text": "Further information on grazing land using native breeds can be found in the Technical annex. "
        },
        {
            "heading": 2,
            "text": "Actions for boundaries"
        },
        {
            "text": "We are improving the existing offer by introducing new actions for maintaining additional types of boundary features beyond the existing actions for hedgerows. Boundaries include hedgerows, dry stone walls, earth banks and stone faced hedgebanks.  You need to have management control of both sides and the entire length that you’re entering. "
        },
        {
            "text": "Existing capital items will continue to be available, for example to support the creation and restoration of earth banks, dry stone walls and stone faced hedgebanks. In addition to the current capital item for restoring drystone walls, we are looking to introduce a new capital item for repairing stone walls. "
        },
        {
            "text": "Further information on boundaries can be found in the Technical annex. "
        },
        {
            "heading": 2,
            "text": "SFI Management Payment "
        },
        {
            "text": "There’s no minimum amount of land you need to enter into SFI to be eligible for the management payment. "
        },
        {
            "text": "We have recently doubled the SFI management payment so those with existing agreements receive up to an extra £1,000, and we are extending it to CS Mid-Tier for the first year of agreements starting by March 2025. "
        },
        {
            "text": "It will apply to all SFI agreement holders with an agreement live on 1 January 2024, starting from the first day of their agreement, and to all new entrants into the SFI from now on, including the expanded offer this summer. We are prioritising increasing the payment in the first year, because this is when costs are highest for farmers. "
        },
        {
            "heading": 2,
            "text": "Transitioning into SFI "
        },
        {
            "text": "You will be able to apply for the expanded Sustainable Farming Incentive (SFI) offer, which will include many of the Countryside Stewardship (CS) Mid Tier options, later this summer.  This will be through a single application service, as announced in January's ATP Update. "
        },
        {
            "text": "We also want to make the process of moving from HLS agreements into SFI as straightforward as possible. "
        },
        {
            "text": "We'll share more guidance on this shortly, so subscribe to the blog. "
        },
        {
            "heading": 2,
            "text": "Further support and guidance "
        },
        {
            "text": "With improved choice and payment rates, now is the time to apply for the SFI. "
        },
        {
            "text": "Our dedicated SFI site is a good place to start your journey. "
        },
        {
            "text": "You can also watch the RPA's how to apply for an SFI agreement video. You can contact the RPA about your SFI agreement. "
        },
        {
            "text": "There’s now a tool for you to check what SFI actions you can get paid to do on your land.  Just select your land type in the SFI filter tool for a list of compatible actions.  It doesn’t commit you to anything, it’s free, and you can print the results. "
        },
        {
            "text": "To help you manage the transition and plan, you can get free advice from an independent provider.  This is available to those who receive Basic Payment Scheme (BPS) payments. "
        },
        {
            "text": "The guidance for every scheme and grant on offer can be found on the Funding for farmers, growers and land managers page on GOV.UK. "
        }
    ]
}