{
    "url": "https://defrafarming.blog.gov.uk/2024/04/12/webinar-follow-up-livestock-and-grassland/",
    "title": "Webinar follow up: livestock and grassland",
    "authors": [
        "Becky Briggs"
    ],
    "categories": [
        "Payments for equipment, technology and infrastructure",
        "Payments to improve animal health and welfare",
        "Sustainable Farming Incentive",
        "Things we're doing",
        "Webinars"
    ],
    "pub_date": "2024-04-12T10:40:13+01:00",
    "content": [
        {
            "text": "We recently held a webinar for livestock and grassland farmers in England. A recording is embedded above."
        },
        {
            "text": "In the webinar, we gave an overview of the Sustainable Farming Incentive (SFI) offer and how the scheme supports both productivity and the environment. We talked through the wide range of actions including for soils, nutrient management and integrated pest management."
        },
        {
            "text": "We also covered the Animal Health and Welfare Pathway and the grants on offer through the Farming Equipment and Technology Fund."
        },
        {
            "text": "We were very pleased to be joined by Mathew Cole, a beef and sheep hill farmer in the SFI pilot.  His native breeds thrive on the wet hills of Dartmoor, with permanent improved grassland and rougher grassland going into moorland. The field systems are surrounded by Devon stone-faced banks with thick hedges and occasional trees on top.  Mathew talked about his experience of SFI, and his ambitious actions to improve grassland and hedgerows.  If you want to hear more about Mathew and his farm, please watch the recording."
        },
        {
            "text": "In this post, I’ll summarise what we covered and include links for you to learn more."
        },
        {
            "heading": 2,
            "text": "Applying for an SFI agreement"
        },
        {
            "text": "Over 17,000 farmers have already applied for an SFI agreement."
        },
        {
            "text": "You can apply for an SFI agreement now and choose from the 23 actions currently on offer. If you apply now, you'll be able to add actions to your agreement annually or have an additional SFI agreement on the same parcel of land, as long as the agreements don’t pay twice for the same action."
        },
        {
            "text": "We announced we are doubling the SFI management payment so those with existing agreements receive up to an extra £1,000 this spring, and we are extending it to Countryside Stewardship (CS) Mid-Tier for the first year of agreements starting by March 2025."
        },
        {
            "text": "It will apply to all SFI agreement holders with an agreement live on 1 January 2024, starting from the first day of their agreement, and to all new agreement holders in SFI from now on."
        },
        {
            "text": "We are prioritising increasing the payment in the first year, because this is when costs are highest for farmers."
        },
        {
            "text": "In the session, we covered the introduction of area limits on the 6 SFI actions that take land out of production."
        },
        {
            "text": "The reason for limiting these 6 is that these actions were designed to be carried out on parts of the farm and smaller areas within land parcels."
        },
        {
            "text": "They are less effective if they are carried out on larger areas or whole parcels and the impact on food production is greater."
        },
        {
            "text": "The limited area actions are:"
        },
        {
            "text": "This blog post goes into more detail about the area limits. "
        },
        {
            "heading": 2,
            "text": "Transitioning into SFI"
        },
        {
            "text": "You will be able to apply for the expanded Sustainable Farming Incentive (SFI) offer, which will include many of the Countryside Stewardship (CS) Mid Tier options, later this summer.  This will be through a single application service, as announced in January's ATP Update. "
        },
        {
            "text": "We also want to make the process of moving from HLS agreements into SFI as straightforward as possible."
        },
        {
            "text": "We'll share more guidance on this shortly, so subscribe to the blog. "
        },
        {
            "heading": 2,
            "text": "Sites of Special Scientific Interest (SSSI) and SFI"
        },
        {
            "text": "Some attendees asked about how the SFI works if you’re applying for an agreement on a Site of Special Scientific Interest (SSSI)."
        },
        {
            "text": "To apply for SFI on an SSSI, you must either give notice to Natural England or you must already have consent from Natural England."
        },
        {
            "text": "The reason for this is that the Rural Payments Agency (RPA) needs to make sure that the actions applicants want to do are compatible with any existing agreements on the land. The RPA can only process an application once Natural England has been in touch with them."
        },
        {
            "text": "Guidance on applying for the SFI on SSSIs can be found on page 118 of the SFI Handbook. "
        },
        {
            "text": "Until recently, applicants needed to provide notice to Natural England where there was an SSSI within a parcel with MOR1 actions. MOR1 no longer requires applicants to gain consent or to notify Natural England. This is part of our commitment to make things as easy as possible for those who want to apply."
        },
        {
            "heading": 2,
            "text": "Managing permanent grassland"
        },
        {
            "text": "We offer a variety of payments for actions that can be carried out on permanent grassland."
        },
        {
            "text": "For example, we offer several soils related actions that seek to boost understanding of soil health and contribute to improving and maintaining the soil’s structure and fertility including SAM1 which pays you to assess your soil, produce a soil management plan and test soil organic matter and then SAM3 pays you to create herbal leys."
        },
        {
            "text": "Other offers applicable to permanent grassland are the LIG1 action which pays you to manage grassland with very low nutrient inputs (outside SDAs) and LIG2 action which pays you to manage grassland with very low nutrient inputs (SDAs) actions. Both these actions could help with minimizing nutrients runoff to watercourses."
        },
        {
            "text": "Use the online SFI checker tool to work out which actions you could include in your agreement. You can print the results."
        },
        {
            "heading": 2,
            "text": "Grassland and agroforestry actions"
        },
        {
            "text": "Agroforestry is designed to be a stackable option without specific requirements for land management."
        },
        {
            "text": "We will publish further guidance on the actions soon, including detail on capital items."
        },
        {
            "text": "Current guidance on agroforestry actions and payment rates can be found in the Technical Annex."
        },
        {
            "heading": 2,
            "text": "The Animal Health and Welfare Pathway"
        },
        {
            "text": "We covered a lot of ground during the webinar concentrating on the Pathway's financial offer."
        },
        {
            "text": "This included the Annual Health and Welfare Review which provides funding for a vet or team chosen by a vet to visit your farm and carry out a health and welfare review of eligible livestock. During the review, you can talk through issues on your farm with a vet of your choice."
        },
        {
            "text": "When we launched the review, we said that we would continue to improve it over time with feedback from farmers and vets, this included opening to non-BPS recipients, bringing BVD testing in line with CHECS and BVD-free requirements."
        },
        {
            "text": "In the coming months, we will introduce multiple reviews for multiple herds/flocks/species and the collection of limited and anonymised information from the farmer."
        },
        {
            "text": "The review is flexible. Agreed actions between the vet and the farmer could include some easy wins and some more ambitious targets."
        },
        {
            "text": "This means that although the review and the Red Tractor vet visit cannot be covered in one visit, they can supplement each other, you could discuss the findings from your Red Tractor visit with your chosen vet."
        },
        {
            "text": "Once you’ve had your animal health and welfare review, you will know the BVD and PRRS status of your flock or herd. From summer 2024, you will then be able to apply for the disease control and eradication programme."
        },
        {
            "text": "The review for sheep is slightly different and will give farmers a choice of 6 different areas to focus on, including areas such as lameness, lamb performance and survival rates. "
        },
        {
            "text": "We also shared the guidance for the equipment and technology grants and we are glad to say that Animal Health and Welfare grants are now available. We keep reviewing these grants and are happy to hear your feedback to make them work best for you."
        },
        {
            "text": "We have noted your feedback that the minimum grant is too high for smaller farms."
        },
        {
            "text": "This grant has been co-designed with farmers and industry representatives. The minimum grant amount was set considering value for public money and affordability for farmers."
        },
        {
            "text": "Finally, we mentioned payments by results by which we mean supporting better stockmanship on farms with an initial plan to launch 2 trial offers on intact pig tails and improved cattle pain management."
        },
        {
            "text": "You might be interested in listening to our podcast on improving animal health and welfare on your farm."
        },
        {
            "text": "Another podcast worth listening to is our podcast with Robin and Christopher Milton. They farm beef and sheep on the Exmoor uplands and, after participating in the pilot, now have an SFI agreement."
        },
        {
            "heading": 2,
            "text": "Grants for livestock and grassland farmers"
        },
        {
            "text": "We recently published a post detailing all the grants available through the Farming and Countryside Programme in 2024. "
        },
        {
            "text": "In particular, livestock and grassland farmers should take a look at the Farming Equipment and Technology Fund, which provides grants for equipment and technology that support improvements in:"
        },
        {
            "text": "You can apply for one grant from each of the 3 themes."
        },
        {
            "text": "The fund is competitive. The Rural Payments Agency (RPA) will allocate funding after all applications within an application window have been received and scored. You may not receive any, or all of the funding you apply for."
        },
        {
            "text": "Successful applicants will receive a grant of:"
        },
        {
            "heading": 2,
            "text": "Further support and guidance"
        },
        {
            "text": "With improved choice and payment rates, now is the time to apply for the SFI."
        },
        {
            "text": "Our dedicated SFI site is a good place to start your journey."
        },
        {
            "text": "You can also watch the RPA's how to apply for an SFI agreement video. You can contact the RPA about your SFI agreement."
        },
        {
            "text": "To help you manage the transition and plan, you can get free advice from an independent provider.  This is available to those who receive Basic Payment Scheme (BPS) payments."
        },
        {
            "text": "The guidance for every scheme and grant on offer can be found on the Funding for farmers, growers and land managers page on GOV.UK."
        }
    ]
}