{
    "url": "https://ukhsa.blog.gov.uk/2024/04/12/what-is-whooping-cough-and-how-can-i-prevent-my-children-catching-it/",
    "title": "What is whooping cough and how can I prevent my children catching it?",
    "authors": [
        "Blog Editor"
    ],
    "categories": [
        "Children and Young people",
        "immunisations"
    ],
    "pub_date": "2024-04-12T11:40:12+01:00",
    "content": [
        {
            "text": "Whooping cough, also known as pertussis, is a highly contagious bacterial infection that mainly affects the lungs and airways. It can affect people of all ages and while it can be a very unpleasant illness for older vaccinated adolescents and adults, young babies who are too young to be fully protected through vaccination are at increased risk of serious complications or, rarely, death. Whooping cough is sometimes known as the 100-day cough because of how long it took to recover from it."
        },
        {
            "heading": 2,
            "text": "What are the symptoms?"
        },
        {
            "text": "The first symptoms of whooping cough are similar to a common cold, with a runny nose and a mild fever. After about a week or two, the characteristic cough develops with uncontrolled bouts of intense coughing that can last for several minutes, sometimes causing vomiting. Coughing is often worse overnight. Coughing fits can cause some people to make a distinctive \"whooping\" sound as they gasp for breath between coughs. Babies under 3 months old who are not fully protected through immunisation are at the highest risk of developing severe complications including pauses in breathing (apnoea), dehydration, pneumonia, or seizures."
        },
        {
            "heading": 2,
            "text": "What can you do to protect your children from whooping cough?"
        },
        {
            "text": "The best defence is to make sure they are fully vaccinated."
        },
        {
            "text": "The whooping cough vaccine is given as part of the routine childhood vaccination schedule in the UK. Babies receive three doses at 8, 12 and 16 weeks old (the 6-in-1 vaccine), followed by a booster at 3 years 4 months. This provides high levels of protection against severe disease."
        },
        {
            "text": "It's also important for pregnant women to get vaccinated against whooping cough, ideally between 20 to 32 weeks of pregnancy. Vaccinating pregnant women allows the protection to pass to their unborn baby in the womb so that babies are protected from birth in their first months of life, before they can receive their own vaccines from 8 weeks of age. Vaccines can be given from as early as 16 weeks and women remain eligible beyond 32 weeks until they give birth. The vaccination of pregnant women has been shown to be over 90% effective in preventing whooping cough cases and hospital admissions in young babies and in preventing deaths."
        },
        {
            "text": "Whooping cough vaccine has been used extensively in pregnant women in the UK since October 2012, and a MHRA's study of around 20,000 vaccinated women published in the British Medical Journal (BMJ) found no safety concerns."
        },
        {
            "text": "Vaccination is crucial, as whooping cough can spread very easily through coughing and sneezing. If your child does catch it, they'll need to stay off school or nursery for 48 hours after starting antibiotics, or 3 weeks from the start of their symptoms if they haven't had the treatment."
        },
        {
            "heading": 2,
            "text": "How common is whooping cough?"
        },
        {
            "text": "One of UKHSA’s responsibilities is collecting numbers of cases of notifiable diseases (including whooping cough) and we publish analyses of local and national trends on a regular basis. In the years since monitoring began, we have seen a huge decline in whooping cough cases from peak years exceeding 100,000 cases in the 1950s."
        },
        {
            "text": "Whooping cough is a cyclical disease that regularly peaks every 3 to 5 years. We are, unfortunately, seeing increasing rates of whooping cough at present, following a prolonged period of very low case numbers due to restrictions, and reduced social mixing patterns during the COVID-19 pandemic. As protection from vaccination declines over time, circulation of infection tends to occurs amongst older children and adults, who tend to get mild infection. But these cases increase the risk of spreading to babies, who may experience severe disease.  "
        },
        {
            "text": "While whooping cough can be unpleasant at any age, it's especially serious for young babies. By ensuring you receive the whooping cough vaccine while pregnant and that your children are fully vaccinated – you can give them the best protection against this potentially dangerous illness."
        },
        {
            "text": "Mums-to-be can contact their midwife or GP surgery if they have reached week 20 of their pregnancy and are unsure whether they have had the vaccine."
        },
        {
            "text": "Parents can also help protect their children by ensuring they receive their vaccines at the right time or catching up as soon as possible if they have missed any. If you are not sure if your child has had all their routine vaccinations, check their personal health record (Red Book) or contact your GP practice."
        },
        {
            "heading": 2,
            "text": "Further reading"
        },
        {
            "text": "Whooping cough - NHS (www.nhs.uk)"
        },
        {
            "text": "Notifiable diseases: historic annual totals  (www.gov.uk)"
        },
        {
            "text": "Pertussis: the green book (www.gov.uk) - for health professionals"
        }
    ]
}