{
    "url": "https://educationhub.blog.gov.uk/2024/02/apprenticeships-early-years-how-to-find-one/",
    "title": "Everything you need to know about apprenticeships in early years and how to find one",
    "authors": [
        "mediaofficer"
    ],
    "categories": [
        "Apprenticeships",
        "Childcare"
    ],
    "pub_date": "2024-02-06T10:54:24+00:00",
    "content": [
        {
            "text": "Early years educators play a vital and rewarding role in helping children get the best start for life and preparing them to begin school. "
        },
        {
            "text": "There are several routes into a role in early years, including apprenticeships. Becoming an apprentice enables you to earn while you learn - you’ll be paid a salary while gaining the qualifications needed for a career in early years.  "
        },
        {
            "text": "Here’s what you need to know about early years apprenticeships and how to apply.  "
        },
        {
            "heading": 3,
            "text": "What early years apprenticeships are available? "
        },
        {
            "text": "There are three early years apprenticeships currently available, two of which are suitable for those with no previous experience. They take between 12 and 24 months to complete."
        },
        {
            "text": "On all three routes, you’ll study towards qualifications that allow you to build a career in early years, while working at the same time. You can start at any level – for example, you don’t need to do Level 2 before Level 3. "
        },
        {
            "text": "Level 2 may be more suitable for those leaving school at 16. It allows you to work in an early years setting under supervision, supporting the planning and delivery of education and care for 0 to 5-year-olds, and is an excellent first role in the sector. "
        },
        {
            "text": "Level 3 may be more suitable for those who want to plan, organise and lead enriching learning activities, and perhaps supervise others. This qualification also enables you to be counted as a qualified member of staff within the staff to child ratio requirements – the number of children one member of staff is responsible for at a time – in the Early Years Foundation Stage (EYFS) framework, which is something employers will be looking for."
        },
        {
            "text": "Level 5 is aimed at highly skilled professionals who are ready to lead the care, learning and development of young children. They are responsible for the quality of learning and development and have responsibility for leading other practitioners in the setting.  "
        },
        {
            "text": "We’re looking at introducing different types of apprenticeships in early years education, including new accelerated apprenticeships and degree apprenticeships, so that everyone, from junior staff to senior leaders, can easily move in and progress in their careers.  "
        },
        {
            "heading": 3,
            "text": "What do early years educators do? "
        },
        {
            "text": "The years before children start school are a vital part of a child’s education – it’s when they develop the cognitive, social, and emotional skills that set them up for life.  "
        },
        {
            "text": "Early years educators are crucial in helping children develop before starting school. They plan and run education, lead activities with children under five years old, and make sure they're safe and happy.  "
        },
        {
            "text": "Private, voluntary and independent nurseries, maintained nursery schools, reception classes, playgroups and hospitals all need to employ early years professionals.  "
        },
        {
            "text": "It's a rewarding job where apprentices will get to see children learn and grow."
        },
        {
            "text": "Typical tasks include: "
        },
        {
            "heading": 3,
            "text": "How much do early years apprentices earn? "
        },
        {
            "text": "As an early years apprentice, you’ll earn at least the minimum wage for apprentices, and many employers offer additional benefits.  "
        },
        {
            "text": "On top of this, they’ll be paying for your training, so you’ll gain important qualifications for free. "
        },
        {
            "heading": 3,
            "text": "What qualifications do you need? "
        },
        {
            "text": "You may need some GCSEs, usually including English and maths, or equivalent, to do an apprenticeship. "
        },
        {
            "text": "However, your grades and existing qualifications are not the most important thing.  "
        },
        {
            "text": "You will also need skills like energy, enthusiasm, and a passion for early years education."
        },
        {
            "heading": 3,
            "text": "How do I apply for a childcare apprenticeship? "
        },
        {
            "text": "You apply to all apprenticeships, including those in early years education, direct with the employer.  "
        },
        {
            "text": "You can search for apprenticeships via the Find an Apprenticeship website or via UCAS.  "
        },
        {
            "text": "Applying for an apprenticeship is similar to applying for a job, meaning you can apply for vacancies at any time.   "
        },
        {
            "text": "Applications will differ depending on the apprenticeship, but it’s likely that you’ll have to submit a CV and do an interview.   "
        },
        {
            "text": "To get personalised advice on your application, you can talk to a careers adviser for free via the National Careers Service. There are lots of ways to get in touch including by phone, webchat or in person. "
        },
        {
            "text": "You can find out more about roles in early years and childcare by visiting the ‘Do Something BIG’ webpage here. "
        },
        {
            "heading": 3,
            "text": "What else are you doing to recruit more early years staff? "
        },
        {
            "text": "We’re taking important steps to deliver the expanded 30 hours free childcare scheme for working parents from when their child turns nine-months-old until they start school, saving them £6,500 a year.  "
        },
        {
            "text": "To prepare for the new offer, we’ve invested an extra £200million in funding to the sector in September 2023 and promised over £400million for 2024-25 to uplift hourly rates for the early year entitlements.   "
        },
        {
            "text": "We’re also trialling a new recruitment offer to increase the number of staff nurseries and early years providers need to offer more childcare places to parents. New recruits will receive a £1,000 bonus when they start their first role in childcare. Find out more here. "
        }
    ]
}