{
    "url": "https://nationalscreening.blog.gov.uk/2024/02/06/jo-and-laura-give-positive-feedback-after-completing-health-screening-module/",
    "title": "Jo and Laura give positive feedback after completing health screening module",
    "authors": [
        "Jo Harcombe"
    ],
    "categories": [
        "General"
    ],
    "pub_date": "2024-02-06T12:27:44+00:00",
    "content": [
        {
            "text": "Screening course bursary winners have described the positive impact that studying the master’s level health screening module has had on their respective roles."
        },
        {
            "text": "The annual course, supported by expert academics and UK National Screening Committee (UK NSC) staff, covers the epidemiological principles, ethics and policy issues involved in health screening."
        },
        {
            "text": "Two of the most recent graduates from the course are Jo Priestley, an Antenatal & Newborn Screening Midwife based in the North East of England, and Laura Macdermott, Programme Coordinator with Antenatal Screening Wales. Both Jo and Laura were successful in securing a bursary to support attendance on the course."
        },
        {
            "text": "Both found the learning extremely useful for their roles and would encourage other screening professionals to take up the opportunity if they can."
        },
        {
            "text": "Jo said:"
        },
        {
            "text": "Laura said:"
        },
        {
            "text": "The health screening module will run again in November 2024 and we will again hope to be able to offer a small number of bursaries. Watch this space for details."
        },
        {
            "heading": 2,
            "text": "Keep up to date"
        },
        {
            "text": "The UK NSC blog provides up to date news from the UK NSC. You can register to receive updates direct to your inbox, so there is no need to keep checking for new articles. If you have any questions about this blog article, or about the work of the UK NSC, please email uknsc@dhsc.gov.uk."
        }
    ]
}