{
    "url": "https://defradigital.blog.gov.uk/2024/02/06/meet-the-apprentice-michael-cheel/",
    "title": "Meet the Apprentice – Michael Cheel",
    "authors": [
        "Michael Cheel"
    ],
    "categories": [
        "Defra digital",
        "Software tools"
    ],
    "pub_date": "2024-02-06T07:30:54+00:00",
    "content": [
        {
            "text": "In National Apprenticeship Week Michael Cheel reflects on his own development journey as he approaches his final apprenticeship assessment."
        },
        {
            "text": "Hi, I’m Michael Cheel and I’m 24 years old. Before joining Defra, I worked in healthcare, training as a paramedic, before moving onto IT and then coming to Defra."
        },
        {
            "text": "I began my ICT Level 3 Apprenticeship in Defra’s Cloud Academy in February last year, and I expect to finish by April. It’s been around a 15-month process in total, with the first year being the main ‘on-the-job’ learning and evidence-gathering, and then around three months for the final assessment period."
        },
        {
            "text": "My apprenticeship has provided me with great experience. Cloud technology is very new to me, and the opportunity to work alongside experienced engineers, working on both familiar and new tasks, has been hugely beneficial, and the extra opportunities provided in the form of certifications and training has been brilliant too."
        },
        {
            "text": "At the end of this journey, I will have gained an ICT Level 3 Apprenticeship qualification, as well as numerous Microsoft certifications as part of other training, though separate from the apprenticeship. The opportunity to gain these certifications, as well as achieving the entry point into Cloud Technology, was a brilliant chance to take."
        },
        {
            "heading": 2,
            "text": "A typical day for me"
        },
        {
            "text": "We start off with our morning meetings, consisting of ‘stand-ups’ (daily team meetings to discuss news or ongoing issues, with the wider team) our project/service desk teams, and colleagues in the Cloud Academy. The day then continues with managing the service desk for any requests that may need priority assisting, and I work on any project-related tasks that have come in."
        },
        {
            "text": "For example, I support the Extended Producer Responsibility for Packaging (EPR) project, so we may have tasks from the development team that require us to troubleshoot any network issues, or create new web applications for their use."
        },
        {
            "text": "These tasks or issues are then further discussed in our project stand-up, and any urgent requests or updates are discussed here too. Time is spent with my mentors on EPR, who are other engineers within the Cloud Centre of Excellence (CCoE), working on tasks or shadowing for further experience. As well as this work, we may also have project releases scheduled in for the day, where at set times we work alongside the wider project team to complete a new feature release/update, ensuring all goes well."
        },
        {
            "text": "As well as this, I also spend my day completing portfolio work for my apprenticeship, utilising my evidence gathered to write up a document explaining the tasks I have completed at work, to show how my knowledge is improving."
        },
        {
            "text": "Finally, I have also taken it upon myself to work on the apprenticeships as part of a personal project for myself. This has included creating resources and knowledge share sessions for my colleagues regarding the apprenticeship requirements and End Point Assessment (EPA), to try and help us all understand the requirements better so we can succeed the best way we can. I have liaised with the apprenticeship provider, and my managers, to try and organise the EPA method, so that we all have a good idea of how we are going to structure the assessment against the provided criteria."
        },
        {
            "heading": 2,
            "text": "The best thing about my apprenticeship experience so far is….."
        },
        {
            "text": "Learning how to utilise Azure DevOps (ADO) to automate tasks and Azure deployments, writing scripts that are compatible with an ADO pipeline, to make everyone’s jobs easier, so that pushing a button can create all the resources required by end-users, has been very interesting. The benefits of automation are endless, as the ideal goal is that one day we will be able to push one single button and deploy whole environments in moments, speeding up project timelines dramatically."
        },
        {
            "heading": 2,
            "text": "And the hardest part………."
        },
        {
            "text": "Completing the certifications against the proposed deadlines, especially the AZ-104 which was the most difficult certification out of all of them, while balancing the rest of my responsibilities, was tricky. The AZ-104 is a certification that requires extensive knowledge of Azure technologies with at least 6 months experience on the job, so learning to balance my responsibilities to project and service desk stakeholders through my on-the-job work, my commitment to the apprenticeship and portfolio work, and my certification training required good organisation and communication with stakeholders."
        },
        {
            "text": "However, this was an opportunity for me to really utilise the skills I have gained in prior work experience both in IT workplaces, and the ambulance environments, so that I could achieve all desired outcomes within the allotted timeframes."
        },
        {
            "heading": 2,
            "text": "The most important lesson I have taken from my experience is……."
        },
        {
            "text": "Learning when to say no. Sometimes I can be guilty of working too hard, as can all of my colleagues within the Cloud Academy. I believe it’s quite common when in a new role, especially one where you are viewed as the ‘trainee apprentices’ that you can feel there is a large expectation on you to perform well and take on as much as you can to show your ability."
        },
        {
            "text": "Through my experience working at Defra, I recognise that there can be a thing as ‘too much’, and although a high clearance rate of work is both incredible and achievable, it is also important to ensure that you achieve a high standard of work too for the benefit of our colleagues and the public."
        },
        {
            "heading": 2,
            "text": "My message to anyone thinking of applying to a talent programme is……"
        },
        {
            "text": "It may seem like a lot of work at first, but truth be told, when you really break the workload down for the apprenticeship, it is very manageable. Even if you feel that you are struggling, your managers, colleagues and apprenticeship providers are an excellent support network that is there to support you."
        }
    ]
}