{
    "url": "https://traderemedies.blog.gov.uk/2024/02/06/national-apprenticeship-week-georgie/",
    "title": "National Apprenticeship Week - Georgie",
    "authors": [
        "Nicola"
    ],
    "categories": [
        "Engagement",
        "People"
    ],
    "pub_date": "2024-02-06T09:38:42+00:00",
    "content": [
        {
            "heading": 3,
            "text": "It's National Apprenticeship Week! We asked Georgie, who is completing her apprenticeship with the TRA Comms team, to tell us what it has been like so far, the highlights and the impressive list of responsibilities she has taken on since joining."
        },
        {
            "text": "I am a new addition to the Comms team and only started in November, but I have been involved with so much already! "
        },
        {
            "text": "The TRA Forum took place the week before I started so I was involved with lots of the post-event comms for that: designing social media posts, organising images, and helping with blog posts.  "
        },
        {
            "text": "I was also involved with our presence at the Electric Vehicle Show. For this, I assisted on banner design, designed and created flyers for us to hand out at our stand and helped with printing them. At the EV Show, I engaged with stakeholders and was responsible for gathering data to help us evaluate our presence there. "
        },
        {
            "text": "In December, I led on creating the festive edition of our newsletter. This involved pulling together the content for that edition, creating a festive TRA logo and Christmas Quiz banner. I designed these materials using our in-house software. This campaign was very successful as we doubled the number of our subscribers as a result. I also lead on our internal newsletter, updates to our Style Guide and I am currently developing a series of staff workshops. "
        },
        {
            "text": "Alongside this, I have been completing tasks and attending seminars for the education side of my apprenticeship. I really enjoy these seminars as it allows me to learn what makes successful content in terms of communications.  "
        },
        {
            "text": "A highlight for me was our TRA Community Day. It was such a great opportunity for me to meet all the lovely staff here at the TRA and learn about our workplace culture.  "
        },
        {
            "text": " I am looking forward to being involved in major events in the TRA calendar, expanding my knowledge on successful internal campaigns and how the TRA brands itself to external audiences. "
        },
        {
            "text": " --------------------------------------------------------------------------------------------------------------------------------------------------------------------"
        }
    ]
}