{
    "url": "https://space.blog.gov.uk/2024/02/06/orion-nebula-and-winter-stars-the-night-sky-in-february-2024/",
    "title": "Orion nebula and winter stars: the night sky in February 2024",
    "authors": [
        "Derek Smale"
    ],
    "categories": [
        "Astronomy"
    ],
    "pub_date": "2024-02-06T17:09:22+00:00",
    "content": [
        {
            "text": "The Orion Nebula lies around 1,400 light years away and is the brightest nebula in our night skies.  Credit: NASA, ESA, M. Robberto (Space Telescope Science Institute/ESA) and the Hubble Space Telescope Orion Treasury Project Team"
        },
        {
            "text": "The constellations of Orion and Taurus both dominate the southern sky, hosting astronomical treats that are visible with the naked eye."
        },
        {
            "text": "Look for the Orion Nebula just below the three stars that form the line of Orion’s belt. It may look similar to a faint star from towns and cities, but darker skies will reveal it to be a larger, fuzzy patch of light. It’s actually an enormous cloud of interstellar gas and dust around 1,400 light years away."
        },
        {
            "text": "Taurus hosts the Pleiades star cluster, a group of around 1,000 stars that lie around 440 light years away."
        },
        {
            "text": "While it’s nicknamed the ‘Seven Sisters’ because of the brighter stars in the cluster, more are visible to the naked eye and the cluster is even more beautiful to look at through binoculars or a telescope. Look at the Pleiades on the evening of 16 Feb as they get a visit from the 50%-illuminated Moon."
        },
        {
            "text": "The constellation of Andromeda is also still high in the south-western sky as darkness falls, with the Andromeda Galaxy visible to the naked eye from darker skies as a faint, fuzzy patch of light. The galaxy lies over two and a half million light years away and is believed to consist of around a trillion stars."
        },
        {
            "text": "There’s a conjunction of Mars and Venus in the pre-dawn skies in the second half of this month."
        },
        {
            "text": "Early risers will see the two planets appearing to move closer to each other in the south-eastern sky over the next couple of weeks, with the planets appearing closest on the mornings of 21 and 22 Feb."
        },
        {
            "text": "The two planets are actually around 120 million kilometres (75 million miles) apart, but will appear close to each other for rest of the month."
        },
        {
            "text": " "
        },
        {
            "heading": 2,
            "text": "Winter Stars (part three)"
        },
        {
            "text": "Over the last couple of months we have looked at some of the prominent stars in our winter night skies."
        },
        {
            "text": "We continue that journey here looking at some of the stars in the constellations of Auriga and Perseus. You can use the sky-map above to locate these stars in the night sky."
        },
        {
            "text": "Capella is the brightest star in the constellation of Auriga (the charioteer) and the sixth brightest star in our skies."
        },
        {
            "text": "Capella is actually a star system of four stars that lie around 40 light years away, where two of the stars, both around 10 times larger than our star, orbit each other at about the same distance as Venus orbits the Sun."
        },
        {
            "text": "There are several notable adventures of Perseus in ancient Greek mythology, and the brighter stars in this constellation are no less remarkable."
        },
        {
            "text": "The brightest star in Perseus is Mirfak, a super-giant star around 60-times the size of our Sun and over 5,000 times as luminous. It lies over 500 light years away and is part of a cluster of around 500 stars, some of which are visible to the naked eye from darker skies, and many of which can be seen through binoculars or a small telescope."
        },
        {
            "text": "One of Perseus’ adventures in Greek mythology was to slay Medusa, a gorgon with snakes for hair."
        },
        {
            "text": "Many constellation artworks depict Perseus holding the head of Medusa, represented by the star Algol, often known as the ‘Ghoul’ or ‘Demon star’. It appears this name arises from the star appearing to ‘blink’ and even change colour regularly, dimming noticeably for around ten hours every two days."
        },
        {
            "text": "Today we understand that Algol is a star system of three (and possibly five) stars, and the ‘blinking’ is due to a large dimmer orange star passing in front of a brighter blue-ish star as the two orbit each other."
        },
        {
            "text": "While the Algol star system is currently around 90 light years away, scientists tracking its path around our galaxy have discovered it passed just 10 light years away just seven million years ago, likely making Algol the brightest star in our skies at that time."
        },
        {
            "heading": 3,
            "text": "Auriga and Perseus"
        },
        {
            "text": "The constellations of Auriga and Perseus both lie within the band of stars that make up the outer spiral arm of our Milky Way Galaxy.  When seen from darker skies (areas less affected by the ground light of our towns and cities), these constellations appear to glow faintly with the sheer number of faint stars and the numerous star clusters that lie within them."
        },
        {
            "text": "If you get chance to view this patch of sky through binoculars or a telescope, particularly from darker skies, see if you can find the wonderful ‘Double Cluster’ (known as NGC 884 and 869), which lies on the border between Perseus and Cassiopeia, and the several star clusters that lie in Auriga (known as messier 36, 37 and 38)."
        },
        {
            "text": " "
        },
        {
            "heading": 2,
            "text": "Space exploration"
        },
        {
            "text": "Three years ago in this blog we touched on the arrival of NASA’s small and autonomous helicopter that accompanied their Perseverance rover to Mars."
        },
        {
            "text": "The 1.8kg experimental helicopter, named ‘Ingenuity’ quickly became the first object to conduct powered, controlled flight on another planet in April 2021, and went on to far exceed its anticipated five-flight mission."
        },
        {
            "text": "Sadly last month, after a remarkable 72 flights on Mars, NASA announced that Ingenuity had conducted its last flight after its rotor blades were damaged in a landing following a malfunction.  The mission far exceeded all expectations, exploring the Jezero Crater, helping to scout areas of interest for the Perseverance rover and providing great information on how such a vehicle can operate in the harsh Martian environment. Congratulations to the Ingenuity team!"
        },
        {
            "text": "You can find out more about this remarkable mission here."
        }
    ]
}