{
    "url": "https://governmentscienceandengineering.blog.gov.uk/2024/02/06/policy-and-capability-lead-to-the-chief-scientific-adviser-department-for-business-and-trade/",
    "title": "Policy and Capability Lead to the Chief Scientific Adviser, Department for Business and Trade",
    "authors": [
        "gseprofession"
    ],
    "categories": [
        "Blog Series",
        "GSE Opportunities"
    ],
    "pub_date": "2024-02-06T15:13:18+00:00",
    "content": [
        {
            "text": "The Department for Business and Trade (DBT) is the department for economic growth. We support businesses to invest, grow and export, creating jobs and opportunities across the country. The UK has a rich history in science and engineering and the Government has set an ambition to become a Science and Technology Superpower by 2030. Business and trade are an important part of realising that policy ambition. The Government has also prioritised the use of science and engineering evidence and the development of capability to deliver its objectives.    "
        },
        {
            "text": "The role "
        },
        {
            "text": "DBT’s Chief Scientific Adviser (CSA), Professor Julia Sutcliffe and her team are responsible for providing expert, independent advice to Ministers and policy teams across DBT, and for developing the department’s system for accessing and using science and engineering evidence. The team form part of the government's senior science advisory network and work with the cross-government network of departmental CSAs and Government Office for Science.    "
        },
        {
            "text": "The CSA team is growing to reflect the prominence of the S&T agenda, and DBT’s role in helping to deliver this. The Grade 7 Policy and Capability Lead is a new role that will work directly with the CSA to shape and then oversee the delivery of a range of strategic projects and interventions across DBT.  "
        },
        {
            "text": "For more information, including the full job description and how to apply please see Civil Service Jobs webpage here. "
        },
        {
            "text": "Apply before 11:55 pm on Monday 19th February 2024."
        }
    ]
}