{
    "url": "https://hodigital.blog.gov.uk/2024/02/06/the-delivery-profession-at-the-home-office/",
    "title": "The Delivery Profession at the Home Office",
    "authors": [
        "Matt Lilley, Head of Role, Delivery",
        "Depak Patel, Senior Delivery Manager"
    ],
    "categories": [
        "Delivery",
        "Recruitment"
    ],
    "pub_date": "2024-02-06T10:36:44+00:00",
    "content": [
        {
            "text": "Home Office Digital, Data and Technology (DDaT) Delivery Managers are accountable for the delivery of products and services, helping teams to select the best ways of working and coaching them to continually improve their processes."
        },
        {
            "text": "Delivery Managers are skilled in:"
        },
        {
            "heading": 2,
            "text": "How the Home Office DDaT Delivery Profession supports Delivery Managers"
        },
        {
            "text": "The Delivery Manager role is recognised under the DDaT Profession Capability Framework. Working within this framework, the Delivery Profession ensures there are clear career paths for every role and access to relevant continuous professional development."
        },
        {
            "text": "All Home Office Technology Delivery Managers are part of the Home Office Delivery community. Members of the Delivery community support each other by sharing knowledge and experience. This includes:"
        },
        {
            "text": "Delivery Managers in the Home Office look to continually improve ways of working in their teams to get the best results possible."
        },
        {
            "text": "The Home Office Delivery Profession is always evolving as we improve and find new ways to support our Technology Delivery Managers."
        },
        {
            "heading": 2,
            "text": "What does a Senior Delivery Manager in the Home Office do?"
        },
        {
            "text": "Hello, I’m Depak Patel. I work as a Senior Delivery Manager in the Automation Centre for the Chief Technology Office within DDaT. Automation is the use of technology to reduce, remove or augment human intervention in tasks or processes and allows people to focus on value-added tasks. The typical timescale for an automation project ranges from 3 to 6 months."
        },
        {
            "text": "I have oversight of a number of automation projects from discovery to implementation. It’s exciting to solve real life operational problems through the innovative use of emerging technology."
        },
        {
            "text": "I deliver a live service that is appropriately security assured and robust. My responsibilities include:"
        },
        {
            "heading": 2,
            "text": "What I enjoy most about being a Technology Delivery Manager"
        },
        {
            "text": "Each day brings a variety of unique challenges."
        },
        {
            "text": "I enjoy supporting and coaching Delivery Managers to ensure multidisciplinary teams deliver automation business products within scope, to time and to quality."
        },
        {
            "text": "I particularly enjoy working with a diverse range of colleagues across different parts of the Home Office to help them remove their biggest pain points by improving processes. It’s satisfying to work together towards a common purpose, using innovative ways to solve problems and challenge the status quo."
        },
        {
            "text": "Through the Delivery Profession community, I’m encouraged to learn new skills as well as maintain current agile methodology. I work in an environment that encourages me to fail fast and incorporate lessons learned into each new project."
        }
    ]
}