{
    "url": "https://ukhsa.blog.gov.uk/2021/07/13/dame-carol-blacks-independent-review-of-drugs-prevention-treatment-and-recovery/",
    "title": "Dame Carol Black's independent review of drugs: prevention, treatment and recovery",
    "authors": [
        "Rosanna O’Connor"
    ],
    "categories": [
        "Health Improvement",
        "Reducing preventable deaths"
    ],
    "pub_date": "2021-07-13T13:20:08+01:00",
    "content": [
        {
            "text": "Dame Carol Black published her report last week on part two of her independent review of drugs, focusing on drug prevention, treatment and recovery. A government response to the report is expected soon. We are pleased to have supported Dame Carol’s review and welcome its powerful findings."
        },
        {
            "text": "The review drew on an impressive wealth and range of expertise. Many drug treatment and recovery stakeholders, including current and former service users, were involved in consultation, roundtable discussions and one-to-one meetings with Dame Carol."
        },
        {
            "text": "They provided invaluable information and feedback on the current state of drug treatment and recovery services and what is needed for their improvement. These contributions were essential to achieve the insights in the report, and I would like to thank everyone who engaged with this process."
        },
        {
            "text": "The review makes it clear that the drug treatment and recovery system in England is not able to operate to the standard needed to address current challenges. However, despite these challenging circumstances, services and local authorities continue to work hard to meet the needs of the communities they serve, and there are some great examples of good practice and innovation around the country."
        },
        {
            "text": "The sector had to respond rapidly to the challenges of the COVID-19 pandemic, continuing to provide support by adapting services in very short timescales. We need to recognise the dedication and commitment of the many people who worked to support service users through this uniquely challenging time"
        },
        {
            "text": "The shortcomings described in the report must be acknowledged as the basis of bringing about much needed longer-term change, in which we all have a part to play."
        },
        {
            "heading": 2,
            "text": "A new era of treatment and recovery in England"
        },
        {
            "text": "The publication of the report and the government’s response present an opportunity for a new era of treatment and recovery in England. Advances are already being made this year with the additional £80 million government funding for drug treatment provided to local authorities."
        },
        {
            "text": "This is the biggest increase in drug treatment funding for 15 years. It is paying for much-needed improvements to pathways into treatment for people in the criminal justice system, for expanded capacity throughout the treatment system (including addressing the shortfall in dedicated inpatient detoxification), and for additional harm reduction and recovery activity."
        },
        {
            "text": "The Accelerator programme is also building on the Project ADDER pilots, which started in 2020-21, taking a whole-system approach in 8 local authority areas by bringing together enforcement, diversion, treatment and recovery (including housing and employment) programmes."
        },
        {
            "text": "Although this £80 million funding is time limited, we hope it sets the scene for more sustained national investment in future, which the review recommends is essential. Dame Carol stresses the need for improved capacity and competence in the sector, and for closer working across physical and mental healthcare."
        },
        {
            "text": "The report proposes changes to commissioning, strengthened accountability and increased funding for treatment services, as well as improvement in employment and housing support which is so critical in helping people sustain recovery."
        },
        {
            "text": "Changes to how the system operates, particularly in relation to accountability and transparency, are as essential as additional investment if we are to make a real and sustained difference."
        },
        {
            "text": "We welcome other recent positive initiatives and investment, including new funding to eligible local authorities to improve drug and alcohol treatment services for people who sleep rough, or who are at risk of sleeping rough."
        },
        {
            "text": "I have my fingers crossed that this funding will continue into future years, as it will make a significant contribution towards the government’s ambition to end rough sleeping by the end of the Parliament, but also provides an invaluable link for those sleeping rough and who struggle to access treatment."
        },
        {
            "text": "The Department for Work and Pensions has also made available additional new funding that builds on the work of the IPS-AD trial to expand access to the innovative Individual Placement and Support approach to employment support. I hope that this too will continue in future years and help to support more people from treatment into stable, sustained employment that will underpin their recovery."
        },
        {
            "text": "We in PHE are ready to play a significant role in implementing the government’s response to the review’s recommendations and I want to assure you that current responsibilities and aspirations we have in this area will be taken on by the Office for Health Promotion from October."
        },
        {
            "text": "However, the impetus for delivering improvements to the system requires a partnership between everyone involved at all levels. We hope the government response will lay the ground for commissioners, providers, experts by experience, and partner agencies to work together, with us and others in government, to drive up the quality and reach of services for people who use drugs, and to improve outcomes for them, their families and their communities."
        }
    ]
}