{
    "url": "https://educationhub.blog.gov.uk/2021/07/did-you-know-swimming-and-water-safety-are-part-of-the-school-curriculum/",
    "title": "Did you know swimming and water safety are part of the school curriculum?",
    "authors": [
        "mediaofficer"
    ],
    "categories": [
        "Curriculum",
        "Physical Education",
        "Schools"
    ],
    "pub_date": "2021-07-13T12:21:15+01:00",
    "content": [
        {
            "text": "Here are four things you didn't know about swimming in schools."
        },
        {
            "heading": 3,
            "text": "All children should be able to swim 25m by the end of primary school"
        },
        {
            "text": "By the end of primary school, all children should be able to swim 25 metres unaided and use a range of strokes effectively."
        },
        {
            "heading": 3,
            "text": "They should also be taught about water safety"
        },
        {
            "text": "Water safety is a vital life skill, which is why it is a mandatory part of the curriculum for PE at primary school."
        },
        {
            "text": "The curriculum says pupils should be taught to perform safe self-rescue in different water-based situations."
        },
        {
            "text": "We work closely with a range of organisations including, Swim England, The Royal Life Saving Society UK, Canal and River Trust and the Association for Physical Education to support pupils being taught how to swim and to be taught water safety."
        },
        {
            "heading": 3,
            "text": "There is funding available to support schools"
        },
        {
            "text": "In February 2021, we announced  £10.1m to iopen up access to school sport facilities including swimming pools. We’ve already provided funding from phase one and two of the initiative to schools."
        },
        {
            "text": "In October 2021 we announced a further nearly £30 million a year to open up school sport facilities in England as well as to improve the teaching of Physical Education at primary school. We are currently procuring a national delivery partner to allocate further funding and advice to schools over the next phase of the programme to open up access to school sport facilities. More detail will be confirmed on the additional investment in primary PE teaching in due course."
        },
        {
            "text": "Schools can also access new virtual water safety lessons from Oak National Academy."
        },
        {
            "heading": 3,
            "text": "All pupils have opportunities to be taught water safety"
        },
        {
            "text": "To support pupils with special education needs and disabilities and increase their opportunities, we have included a specific focus on swimming and water safety in our grant programme."
        },
        {
            "text": "Swim England has a new Inclusion Hub on its website that provides high quality inclusive resources for all pupils."
        },
        {
            "text": "The Department is also working to better understand specific challenges and barriers for children from Black, Asian and Minority Ethnic backgrounds."
        },
        {
            "text": "That’s why we are currently working with the Black Swimming Association to better understand barriers to increased participation and raising awareness of water safety among these pupils."
        },
        {
            "text": "More information on PE and the national curriculum is available on our website: National curriculum in England: physical education programmes of study - GOV.UK (www.gov.uk)."
        }
    ]
}