{
    "url": "https://defencedigital.blog.gov.uk/2021/07/13/engaging-with-the-circular-economy-encouraging-the-re-use-of-devices/",
    "title": "Engaging with the Circular Economy: Encouraging the re-use of devices",
    "authors": [
        "Grant Morley"
    ],
    "categories": [
        "Digital Sustainability",
        "Information Technology"
    ],
    "pub_date": "2021-07-13T12:34:36+01:00",
    "content": [
        {
            "text": "Even end-of-use Information Technology (IT) has a hidden value that organisations may not have considered, and it’s good for the environment too."
        },
        {
            "text": "One element of the Government’s approach to digital sustainability is to move towards a circular economy, where product life is maximised through re-use and re-manufacture. The cost of remanufacturing is about a third of the price of a new device but delivers up to 97% of the performance of the latest models. Cascading end-of-use devices reduces manufacturing needs, a process that emits 50 times the annual CO2 emissions of operating existing equipment. Furthermore, extending the life of existing IT equipment also contributes towards supply chain resilience.  "
        },
        {
            "text": "Defence Digital recently published the Sustainable Digital Technology and Services Strategic Approach 2021-2025 for Defence, outlining how Defence’s digital ambition can be realised in a way that achieves the UK Government’s priorities for climate change and sustainability.  "
        },
        {
            "text": "Defence Digital has already taken initial steps towards embedding circular economy principles into its work by cascading end-of-use devices to users with unfulfilled ICT needs, as the examples below demonstrate."
        },
        {
            "text": " "
        },
        {
            "text": "Supporting Army Cyber Spartan  "
        },
        {
            "text": "More than 400 personnel took part in Army Cyber Spartan, the largest defensive cyber competition undertaken by the British military. To support the exercise, Defence Digital provided 100 previously used workstations for use as access devices and sourced a number of remanufactured laptops from commercial sources.   \n "
        },
        {
            "text": "Educating Cadets "
        },
        {
            "text": "Other beneficiaries of re-used and upgraded devices include cadet units.  "
        },
        {
            "text": "At Gwent and Powys Army Cadet Force, where many cadets don’t have regular access to Information Technology, cadets have enjoyed being able to use laptops provided by Defence Digital to log evidence in support of their Duke of Edinburgh’s Award.  "
        },
        {
            "text": "Moreover, at 2002 (Kingswood) Squadron Air Cadets, the provision of personal computers resulted in a two-fold increase in the number of cadets passing their cadet classification examinations.  "
        },
        {
            "text": " "
        },
        {
            "text": "Developing these initiatives further will help Defence to improve outputs, to save money and to reduce its carbon footprint, helping us to achieve the Government’s 2050 Net Zero goal."
        }
    ]
}