{
    "url": "https://deframedia.blog.gov.uk/2021/07/13/inaccurate-coverage-of-gulls-licensing/",
    "title": "Inaccurate coverage of gulls licensing",
    "authors": [
        "Defra Press Office"
    ],
    "categories": [
        "seabirds"
    ],
    "pub_date": "2021-07-13T12:05:59+01:00",
    "content": [
        {
            "text": "There continues to be inaccurate coverage of nuisance gulls and Natural England’s licence management, with reports claiming that residents concerned about gull activity were required to produce doctors’ notes to prove that they were adversely affected."
        },
        {
            "text": "The Telegraph and Mail Online ran pieces over the weekend, and there is further coverage in the Daily Star today."
        },
        {
            "text": "Natural England (NE) do not require Doctors’ notes to prove that residents are adversely affected by gull activity. In cases where a resident has chosen to submit medical evidence to the Local Authority to accompany an application to control gulls, NE will take this into account when assessing the licence application."
        },
        {
            "text": "We have witnessed serious declines in the populations of Herring gulls and Lesser Black-backed gulls in recent decades (declining by 60% and 48% respectively) and they are now both considered at risk  It’s essential that we do all we can to reverse this worrying trend. This means placing a limit on numbers that can be killed. In line with Government Policy, Natural England has prioritised the protection of human health and safety (including air safety) over other reasons for lethal control of birds."
        },
        {
            "text": "Dave Slater, Natural England’s Director for Wildlife Licensing & Enforcement Cases, said:"
        },
        {
            "text": "All wild birds are protected by law, and where there is a need to control wild birds for preserving public health or other reasons, legal requirements must be met to ensure it does not affect the long term survival of the species being controlled."
        },
        {
            "text": "For more about Natural England’s approach to gull licensing, please see the Natural England blog."
        },
        {
            "text": "Follow Defra on Twitter, and sign up for email alerts here."
        }
    ]
}