{
    "url": "https://civilservice.blog.gov.uk/2021/07/13/inside-policy-laptops-for-learning-in-lockdown/",
    "title": "Inside Policy: Laptops for learning in lockdown  ",
    "authors": [
        "Graham Archer, Director for Qualifications, Curriculum and Extra-Curricular, Department for Education"
    ],
    "categories": [
        "A Modern Civil Service",
        "An Ambitious Civil Service",
        "An Innovative Civil Service",
        "Better policymaking"
    ],
    "pub_date": "2021-07-13T09:09:42+00:00",
    "content": [
        {
            "text": "Graham Archer, Director for Qualifications, Curriculum and Extra-Curricular, Department for Education, speaks about the challenge of delivering more than 1.3 million laptops and tablets to UK pupils in lockdown."
        },
        {
            "text": "It has been a trademark feature of working in this pandemic that the unexpected often becomes the norm. "
        },
        {
            "text": "Suddenly, circumstances change, policy changes, lives change and you find yourself with the spotlight firmly trained on the work you’re doing. This certainly was the case for my team's work on remote education back in January, as schools and colleges closed again to most pupils overnight. "
        },
        {
            "text": "From early in the pandemic, the Department for Education swung into action, working closely with schools and colleges and their senior leaders to ensure high quality remote education was in place for pupils, when schools closed for all but vulnerable and key worker children. Our goal was to ensure that no child or student missed out on learning during lockdown."
        },
        {
            "text": "It all began…"
        },
        {
            "text": "In April 2020, a small group of DfE colleagues came together to form the Get Help with Technology programme, following the first closure of schools due to COVID-19."
        },
        {
            "text": "The goal was to support disadvantaged school children by giving them access to remote education and online social care services. The programme aimed to provide laptops, tablets, and access to the internet and equip schools to set up and get trained in digital education platforms (such as Google Classroom). "
        },
        {
            "text": "Growing together"
        },
        {
            "text": "At the time, no one could have anticipated the sheer scale of the programme or, as a team, how we would learn and grow together. We had to rapidly build an understanding of what was needed and develop a proposal for supporting disadvantaged and vulnerable children while also recognising the spending pressures that the department was facing. "
        },
        {
            "text": "What followed were (several periods of) intense negotiations with HM Treasury to secure the funding needed to buy and deliver the laptops and tablets that schools and vulnerable children desperately needed."
        },
        {
            "text": "Remote education     "
        },
        {
            "text": "An early priority for the Department was clearly setting out the expectations from schools and colleges in terms of what needed to be delivered to pupils for remote teaching to be effective. "
        },
        {
            "text": "Teachers were expected to set meaningful and ambitious work each day in several subjects under a well-planned curriculum. That included recorded or live direct teaching, as well as factoring in time to carry out independent study."
        },
        {
            "text": "Laptops for Learning: Enabling 1.3 million pupils to access provision"
        },
        {
            "text": "The second, equally important part of the Department’s mission was ensuring that pupils could continue to receive a quality education at home by helping schools and colleges to overcome barriers of digital access. "
        },
        {
            "text": "That includes equipping disadvantaged pupils with laptops and tablets where needed. "
        },
        {
            "text": "The Government committed more than £400m to support remote education and access to online social care services and set itself a target to order and deliver 1.3million laptops and tablets to the pupils who don’t already have access to a computer."
        },
        {
            "text": "To date, 1,313,500 devices have been delivered – so we are delighted to have hit our target, with a small bonus number too. "
        },
        {
            "text": "Alongside that, working closely with the major mobile network operators, the department facilitated internet access, including free data to families where it is most needed."
        },
        {
            "text": "2021 and beyond"
        },
        {
            "text": "I’m both grateful and proud of my teams and the whole Department for what’s been achieved. There’s no doubt that fast-tracking laptops and tablets have enabled more than a million students to continue their education and study at home during lockdown."
        },
        {
            "text": "What I’ve learnt from this great enterprise is that the world is constantly changing, and with it, our services need to evolve, but what we achieved allowed students to keep learning and stay connected. "
        },
        {
            "text": "The change from face-to-face education in a real classroom to education delivered remotely has been tremendous, requiring new resources and skills. As we move back to face-to-face teaching, this will require a similar shift and ambition, building on what we’ve learned during the pandemic, as well as our existing skills. But don’t take my word for it. Here’s what some had to say."
        },
        {
            "text": "Lauren Thorpe, Director of Strategy at Ark Schools"
        },
        {
            "text": "“By the beginning of January this year, we had distributed more than 12,000 devices through both the DfE’s Get Help With Technology scheme and other supportive channels to ensure that students across the network had access to a suitable device for remote study. \n\nAll Ark schools can now operate a fully remote learning offer if needed, with a rich timetable of learning activities delivered at home or in their community classrooms. This allows us to continue to support students (and staff) who might be isolating at home, so our children and young people’s education is not disrupted.”"
        },
        {
            "text": "Andrew Beavis, Deputy Head, Copthall School, Barnet"
        },
        {
            "text": "“We were allocated devices through the Get Help with Technology service to support those students who were academically highly vulnerable, or those who just didn't have any access to a device or the internet. These devices quickly enabled us to support a broader range of students and meet all their needs while they were working remotely.”"
        },
        {
            "text": "Katy Bradford, Chief Operating Officer, Outwood Grange Academies Trust"
        },
        {
            "text": "“We have been able to support the home learning of more than 3,000 children across our Trust by providing them with a high quality Chromebook from the government's Get Help with Technology scheme. "
        },
        {
            "text": "“This has enabled our most disadvantaged children to access the fabulous remote learning being delivered every day by our teachers. These children may otherwise have been at risk of disengaging with learning during lockdown. The ordering and delivery process was easy and well managed, with most devices arriving within a couple of days.”"
        },
        {
            "text": "Care Leaver"
        },
        {
            "text": "“I just want to say thank you very much for helping me out with the laptop and the Wi-Fi router. It now gives me the opportunity to do so many things, i.e., looking for work in the future. Thank you.”"
        }
    ]
}