{
    "url": "https://deframedia.blog.gov.uk/2021/07/13/too-many-water-companies-still-failing-to-protect-environment/",
    "title": "Too many water companies still failing to protect environment",
    "authors": [
        "Defra Press Office"
    ],
    "categories": [
        "Weekly stories"
    ],
    "pub_date": "2021-07-13T15:23:41+01:00",
    "content": [
        {
            "text": "There has been widespread media coverage today (Tuesday 13 July) of Environment Agency’s annual report on the environmental performance of England’s nine water and sewerage companies."
        },
        {
            "text": "The report – covered by The Guardian, Independent, BBC, Evening Standard and Financial Times – showed that while five water companies achieved the highest rating (four stars), four still required improvements and no single company achieved all the environmental expectations set out for 2015 – 2020. This includes full compliance for wastewater discharge permits and a 50% reduction in serious pollution incidents compared with 2012."
        },
        {
            "text": "Northumbrian Water, Severn Trent Water, United Utilities, Wessex Water and Yorkshire Water achieved 4 stars, while Anglian Water and Thames Water were rated as 3 star (good). Southern Water and South West Water were rated as 2 star (requiring improvement), with both their performances being flagged as consistently unacceptable."
        },
        {
            "text": "The Environment Secretary and Environment Minister will be meeting both companies to set out the government’s expectations for improvements.  Where commitments are not achieved, companies can also face underperformance penalties, with Ofwat having new powers to levy fines from 2020."
        },
        {
            "text": "Environment Agency Chair Emma Howard Boyd said: "
        },
        {
            "text": "Environment Minister Rebecca Pow said: "
        },
        {
            "text": "The results come the week after Southern Water was sentenced to pay a record-breaking £90m fine after pleading guilty in court to 6971 unpermitted pollution discharges. The successful Environment Agency investigation was the biggest the regulator has ever conducted, making clear that polluters will be made to pay for damage to the environment. Earlier this year Thames Water was also fined £4 million and £2.3 million for separate pollution incidents."
        },
        {
            "text": "Follow Defra on Twitter, and sign up for email alerts here."
        }
    ]
}