{
    "url": "https://companieshouse.blog.gov.uk/2021/07/13/working-for-companies-house-james-fs-story/",
    "title": "Working for Companies House: James F's story",
    "authors": [
        "James Francis - Lead Interaction Designer",
        "Spencer Vignes - Campaigns Manager"
    ],
    "categories": [
        "People and culture",
        "Working at Companies House"
    ],
    "pub_date": "2021-07-13T14:25:44+01:00",
    "content": [
        {
            "text": "At Companies House, we like to think of ourselves as an inclusive, innovative and welcoming employer, one that supports people and encourages them to ‘find their passion’ by developing their skills and careers. But don’t just take our word for it. Here, our series of features in which employees reflect on what makes Companies House so special continues with Lead Interaction Designer, James Francis."
        },
        {
            "text": "“When I first joined the Civil Service, it did have this stuffy image of boring people in bowler hats being very bureaucratic,” recalls James, of his arrival at Companies House in 1998 as a junior member of the Graphic Design Team."
        },
        {
            "text": "“And, if I’m honest, it was like that to some degree - perhaps without the bowler hats! But it has changed dramatically."
        },
        {
            "text": "I used to go to work in a shirt and tie. These days, I’m in a t-shirt most of the time, not just because we’re all working from home at the moment, but because our ‘bring your whole self to work’ culture allows it."
        },
        {
            "text": "“Flexible – that’s the word I’m looking for to describe the way it is now at Companies House. There’s a work/life balance that was not there before, along with this underlying encouragement to better yourself."
        },
        {
            "text": "“We’re an adaptable organisation. We’re a curious organisation. Not only are you encouraged to challenge things, it’s almost expected of you. It’s like ‘This is great, but can we do it differently? Can we make it better?’ That sense of developing as an individual and as a team – that’s the key, for me, to Companies House.”"
        },
        {
            "text": "He'll be the last to admit it, but James’ progression through the Companies House ranks has been almost as marked as the changes within the organisation itself."
        },
        {
            "text": "Back in 1998, the world was a very different place compared to today. Working in the Graphic Design team involved things such as designing paper forms, booklets and magazines."
        },
        {
            "text": "James was there for 10 years, slowly progressing up the ladder, until a job became available in the IT department (or ‘Digital, Data and Technology’ as it’s known today)."
        },
        {
            "text": "Being something of a self-confessed ‘geek’ he took to tech like a duck to water, but that did not stop him feeling a sense of calling when he applied for, and got, an internal position as a Trainee Web Designer."
        },
        {
            "text": "More promotions followed. Now, James is Lead Interaction Designer in charge of a team of 7 people, responsible for all external online services. When it comes to the Companies House ‘user experience’, James is your man."
        },
        {
            "text": "“In 1998 I’d finished doing a business degree at the University of Glamorgan,” he recalls. “While I was waiting to find out what I wanted to do with my degree, someone I knew who worked at Companies House told me about a 6-month job there as a Trainee Graphic Designer."
        },
        {
            "text": "“That was my ‘in’. Twenty-three years later, I’m still here, and I think that’s a common story for quite a lot of people at Companies House."
        },
        {
            "text": "“To begin with, I was like ‘Oh, the money’s not great’ because I was in an admin role. I did actually start applying for jobs elsewhere, which I was not successful with, but then before I knew it, I’d got a promotion. I did apply for other jobs elsewhere after that, but then I got another promotion, then another, and so on."
        },
        {
            "text": "“It's unusual for people to leave, but that’s not to say they don’t. The money is quite often better in the private sector, but then the benefits and the culture are not always the same. The grass might seem greener on the other side. That’s not to say it is though."
        },
        {
            "text": "“I’ve also known people who’ve left for other branches of the Civil Service. They pretty much all end up saying ‘Oh it’s good, but it’s not as good as Companies House’. That’s the measure of the place.”"
        },
        {
            "text": "Regardless of the culture and the people, there’s another vital ingredient that all employees should think about when it comes to the ideal workplace. That's the work itself. Is it stimulating, in other words?"
        },
        {
            "text": "In that department, James is fully satisfied."
        },
        {
            "text": "“The nature of my work has changed not only across all the various roles I’ve had but also with the times, as technology has evolved,” he says."
        },
        {
            "text": "“Today, in my job and that of my team, the focus is mainly online, working closely in particular over the last few years with the Government Digital Service, or GDS as we call them."
        },
        {
            "text": "“The emphasis now is very much on user needs. Our fantastic user research team goes out and speaks to users, which is something we were doing 10 years ago. However, we didn’t do it to the extent that we do now."
        },
        {
            "text": "“Today, we test things with users, then we test them again, then we test them again. We typically might be working on a project for 6 or 9 months, continually testing every few weeks to try and make things better and better, engaging with users to ensure that what we’re building works for them."
        },
        {
            "text": "“So much of it's about working in the open, both in terms of what my team does and Companies House in general. Now, we talk about stuff. We blog about stuff. We didn’t do that years ago. It’s a very different environment to the one I started out in, and that’s a good thing.”"
        }
    ]
}