{
    "url": "https://dvladigital.blog.gov.uk/2024/09/06/2-million-users-and-counting-dvlas-driver-and-vehicles-account-is-growing/",
    "title": "2 million users and counting: DVLA’s Driver and vehicles account is growing!",
    "authors": [
        "Brian Sullivan"
    ],
    "categories": [
        "DVLA Digital Services"
    ],
    "pub_date": "2024-09-06T14:02:53+01:00",
    "content": [
        {
            "text": "We recently celebrated the one year anniversary of the Driver and vehicles account and since its launch in August last year, it has continued to evolve with more DVLA services added."
        },
        {
            "text": "More than 2 million motorists have already signed up to the account and are making use of the various services readily available. It’s a 24 hour online service, so you can access it at a time and place that suits you."
        },
        {
            "text": "The account has already been making things quicker and easier, allowing you to view all your driver and vehicles details in one place for the first time. You can choose to receive vehicle tax reminders by text or email, opt out of receiving paper reminders in the post, view vehicle details such as when your MOT expires, and check your vehicle tax rates. Commercial drivers can also view CPC and tachograph information."
        },
        {
            "heading": 2,
            "text": "Additional services in the account"
        },
        {
            "text": "Since our first blog, we’ve added the option to renew your photocard driving licence and apply for a first provisional licence through your account. These are 2 of our highest volume driving licence transactions. Another 2 services have also been added to the account recently, offering even more functionality, these include:"
        },
        {
            "heading": 3,
            "text": "Change the photo on your driving licence "
        },
        {
            "text": "Once signed up to the Driver and vehicles account, you can choose to change the photo on your full or provisional driving licence photocard at any time. This can be done easily, simply by renewing your licence and uploading your own photo through the account whenever you choose."
        },
        {
            "heading": 3,
            "text": "Share your driving licence "
        },
        {
            "text": "If you need to share your driving licence information with car insurance companies, car hire companies or if you drive a vehicle as part of your employment, you can now get a check code through the Driver and vehicles account."
        },
        {
            "text": "There were 18.9 million check codes generated last year through our existing GOV.UK service. Getting a check code through the Driver and vehicles account is a quicker and easier process, as your details are already in your account. If you share check codes regularly, by using the account you will no longer need to complete identity verification each time."
        },
        {
            "heading": 2,
            "text": "What our customers say"
        },
        {
            "text": "Over the past year, we have been gathering your feedback so we can continue improving your experience using the account."
        },
        {
            "text": "We want to ensure that you can manage your driving licence and vehicle details with full flexibility. Here are some recent comments from users:"
        },
        {
            "heading": 2,
            "text": "Set up your Driver and vehicles account"
        },
        {
            "text": "To take advantage of all these services in one place, you just need to create an account. It only takes 5 minutes, simply:"
        },
        {
            "text": "More services are due to be added to the Driver and vehicles account in the near future. To help us continue developing the new service, we want to hear your feedback – if you have anything you would like to share with us about your experience, please fill in the satisfaction survey upon setting up your account."
        }
    ]
}