{
    "url": "https://deframedia.blog.gov.uk/2024/09/06/coverage-of-the-introduction-of-the-water-special-measures-bill/",
    "title": "Coverage of the introduction of the Water (Special Measures) Bill",
    "authors": [
        "Defra Press Office"
    ],
    "categories": [
        "water"
    ],
    "pub_date": "2024-09-06T16:59:12+01:00",
    "content": [
        {
            "text": " "
        },
        {
            "text": "There has been widespread positive coverage following the introduction of The Water (Special Measures) Bill to parliament on Wednesday 5 September. This major legislation will give regulators new powers to take tougher and faster action to crack down on water companies damaging the environment and failing their customers and includes the most significant increase in enforcement powers in a decade."
        },
        {
            "text": "The Bill delivers on the manifesto pledges to clean up the water sector, including significantly increasing the ability of the Environment Agency to bring forward criminal charges against law-breaking water executives. It will create new tougher penalties, including imprisonment, for water executives when companies fail to co-operate or obstruct investigations."
        },
        {
            "text": "The new legislation will also ban the payment of bonuses to water bosses if they fail to meet high standards to protect the environment, their consumers and their company’s finances."
        },
        {
            "text": "Other measures in the Bill include severe and automatic fines for a range of offences, including allowing regulators to issue penalties more quickly, without having to direct resources to lengthy investigations."
        },
        {
            "text": "The news was reported by a number of national publications including the BBC, Telegraph, Times, Daily Mail, Daily Express, Sun, Sky News, Financial Times, Daily Mirror, Guardian and iNews. The Environment Secretary, Steve Reed, was also interviewed on BBC Breakfast to outline the legislation, with additional broadcast coverage on BBC Radio 4's Today programme, Sky News, ITV News, LBC and BBC Radio 5 Live."
        },
        {
            "text": "Coverage focused on the measures in the Bill, particularly highlighting the tougher penalties for water company bosses. Statements from the Environment Secretary are featured throughout the coverage, alongside a statement from Environment Agency Chair Alan Lovell, who welcomed the new legislation."
        },
        {
            "text": "Secretary of State for Environment, Food and Rural Affairs, Steve Reed, said:   "
        },
        {
            "text": "Alan Lovell, Chair of the Environment Agency, said: "
        }
    ]
}