{
    "url": "https://governmentscienceandengineering.blog.gov.uk/2024/09/06/meet-dr-ted-hayden-director-of-go-science/",
    "title": "Meet Dr Ted Hayden, Director of GO-Science",
    "authors": [
        "gseprofession"
    ],
    "categories": [
        "Blog Series",
        "Guest Blog"
    ],
    "pub_date": "2024-09-06T15:11:20+01:00",
    "content": [
        {
            "heading": 4,
            "text": "Recently, the GSE team had the opportunity to engage in a discussion with Dr Ted Hayden on his career journey and his current position as the Director of the Government Office for Science (GO-Science)."
        },
        {
            "text": "GSE team: Hi Ted, thank you for agreeing to speak with us today about your career. To start, can you tell us a bit about your current role as the Director of GO-Science?"
        },
        {
            "text": "Ted: Absolutely. As Director, I oversee GO-Science, which ensures that excellent science advice is put at the heart of decision-making. This is the main objective for the Government’s Chief Scientific Adviser and central to all our activities. Alongside this, I am responsible for making sure GO-Science is a great place to work and building an organisation where people can flourish and fulfil their potential. I love working in GO-Science and that’s because our people are really invested in their work and passionate about driving towards a common goal. It’s fantastic to get good science advice taken seriously across government and talk about such a wide range of topics with interesting experts."
        },
        {
            "text": "GSE team: That sounds like a significant responsibility but a really interesting role. Can you share your career journey that led you to this position?"
        },
        {
            "text": "Ted: Of course. My entry into government was through the Science and Engineering Fast Stream, over a decade ago. With a PhD in Physical Chemistry, I was eager to apply my scientific knowledge in a new way and bring impact to a wide range of people. I’ve always been fascinated by the integration of science and evidence into government policy, so the Science and Engineering Fast Stream seemed like the perfect fit for me.  After getting through the application process, I was placed into the Department for Energy and Climate Change (DECC)."
        },
        {
            "text": "GSE team: Given your background, it seems like you were quite focused on science from the start?"
        },
        {
            "text": "Ted: Yes, but interestingly, despite my scientific background, my assignments were in strategy and policy rather than direct scientific roles. This trajectory took me through various strategy positions related to energy, infrastructure, industrial strategy, and transport. I was involved in both strategy development, policy, as well as project delivery."
        },
        {
            "text": "GSE team: And how did these experiences prepare you for your current role?"
        },
        {
            "text": "Ted: Each role provided me with a broader understanding of how science underpins effective government policy. When the chance to become the Director of GO-Science presented itself, it felt like a culmination of my career journey. It was a chance to be part of GO-Science, an organisation I had worked closely with a number of times throughout my career, and to support the new Chief Scientific Adviser, Dame Angela McLean, which is a fantastic opportunity."
        },
        {
            "text": "GSE team: You mentioned your career journey, can you walk us through the various roles you’ve held in the Civil Service?"
        },
        {
            "text": "Ted: Certainly. My journey began in the Department of Energy and Climate Change, focusing on renewable energy and leading on various special projects within their strategy team. I then joined the National Infrastructure Commission during its inception under George Osborne, leading the development of the National Infrastructure Assessment. Following that, I transitioned to the newly established Department for Business, Energy and Industrial Strategy (BEIS) to work on the industrial strategy under the then Prime Minister Theresa May, working on both the Green Paper and White Paper and then delivery."
        },
        {
            "text": "GSE team: And after that?"
        },
        {
            "text": "Ted: I moved to the Department of Transport to lead their strategy unit. It was a fantastic role where I got to lead on a range of areas, from managing the general election planning in the department, overseeing multiple Spending Reviews, leading on the department’s strategic priorities and helping steer the department through a Covid-19 recovery programme. Following that role, I then went into a new project delivery job, where I managed a portfolio of local transport infrastructure projects worth around £8 billion, including through the Levelling Up Fund and the City Regional Sustainable Transport Settlements (money that goes to Mayoral Combined Authorities for local transport). And then, just over a year ago, I took on the role of Director at GO-Science."
        },
        {
            "text": "GSE team: That sounds like a varied career in policy and strategy. As you were a STEM graduate though, could you tell us more about your academic background?"
        },
        {
            "text": "Ted: Of course. I hold a PhD in Surface Science from the University of Cambridge. Interestingly, my PhD supervisor was Dave King, a former Chief Government Scientific Adviser. It’s quite funny how things come about!"
        },
        {
            "text": "GSE team: That is remarkable, what a small world. Where did you complete your undergraduate studies?"
        },
        {
            "text": "Ted: I graduated from Cardiff University with a degree in Chemistry. And yes, whilst there as an undergraduate, I did work at various Cardiff high street hotspots – from Schuh to Tiger Tiger."
        },
        {
            "text": "GSE team: It’s quite a path, from Tiger Tiger to government! Your PhD thesis topic sounds particularly interesting. Could you share a bit about it?"
        },
        {
            "text": "Ted: With pleasure. My thesis was titled “A Supersonic Molecular Beam Study of Oxygen Containing Species on Palladium (100) and Copper (311).” It was quite the endeavour and something I am proud to have achieved, particularly as I had to finish writing it up during my first year on the Fast Stream."
        },
        {
            "text": "GSE team: It certainly sounds interesting! As we have spoken about your academic background, what inspired you to pursue a career in government rather than academia?"
        },
        {
            "text": "Ted: My love for science and experiments is matched by my passion for working with people and making a tangible impact on their lives. I wanted to apply my scientific knowledge in a way that directly contributed to making people’s lives better. While academia has its merits, sometimes working alone in a lab didn’t quite deliver on the people aspect, so the prospect of working collaboratively with others and influencing real-world outcomes drew me to the civil service."
        },
        {
            "text": "GSE team: It seems you value practical applications of science. Has this approach influenced your career decisions?"
        },
        {
            "text": "Ted: Absolutely. I’ve always sought roles that offer new challenges and opportunities to innovate. I believe in doing work that excites me, rather than meticulously planning a career path. For me, it’s about the joy of the job and its relevance to my interests, not just its potential to enhance my CV."
        },
        {
            "text": "GSE team: So, would you say that following your interests has been beneficial for your career?"
        },
        {
            "text": "Ted: It has for me. Not having a rigid plan has allowed me to embrace opportunities that align with my passions. This approach has served me well, leading me to fulfilling roles where I have been able do meaningful work and contribute positively to different departments – I hope people I have worked with have felt that too."
        },
        {
            "text": "GSE team: And finally, do you have any career advice for us?"
        },
        {
            "text": "Ted: I can only share what has been effective for me. I recommend seeking roles that genuinely interest you and work with people you enjoy collaborating with.  All roles you undertake have a way you can build, develop and shape the work that will contribute to your skill set. Additionally, engage in activities beyond your primary responsibilities, such as corporate initiatives, which can provide exposure to new areas of work and innovative approaches."
        },
        {
            "text": "GSE team: Great advice which we will take on board!"
        },
        {
            "text": "Thank you, Ted, for sharing your journey with us. If you have any questions, feel free to leave a comment below or email gse@go-science.gov.uk"
        },
        {
            "text": "For more resources on career development, please visit the GSE career framework."
        },
        {
            "text": " "
        }
    ]
}