{
    "url": "https://environmentagency.blog.gov.uk/2024/09/06/the-ipswich-tidal-flood-defence-barrier-after-six-years/",
    "title": "The Ipswich Tidal Flood Defence Barrier: After six years",
    "authors": [
        "Environment Agency"
    ],
    "categories": [
        "Climate change",
        "Environment Agency",
        "Flood"
    ],
    "pub_date": "2024-09-06T10:15:15+00:00",
    "content": [
        {
            "text": "In 2018, the Environment Agency commissioned the Ipswich Tidal Barrier, a critical infrastructure project costing nearly £70 million. Six years on, the Suffolk Asset Performance Team tell us what has happened since."
        },
        {
            "text": "The Ipswich Tidal Barrier consists of a 200-tonne rotating steel Barrier which can be raised in minutes, helping to keep the town safe from North Sea tidal storm surges. It is complemented by other protective flood defences, including 1km of robust steel sheet piled floodwalls, seven floodgates, and two wet lock floodgates. Together, these assets provide tidal flood protection for over 2,400 homes and 300 businesses."
        },
        {
            "text": "As well as reducing flood risk, Ipswich’s flood defence scheme has the added advantage of helping to boost the local economy through freeing up hectares of land for regeneration and creating over 4,000 jobs."
        },
        {
            "text": "In the Suffolk Asset Performance Team we are responsible for the day-to-day management, maintenance and operation of the Ipswich Tidal Barrier. We play a critical role in ensuring the Barrier remains in optimal working condition. We make sure the asset and its components are in a high state of operational preparedness."
        },
        {
            "text": "As well as our planned preventative maintenance throughout the year, we undertake bi-annual detailed inspections and services of the Barrier to ensure continual fit-for-purpose operation. This involves, amongst many other activities, inspection and lubrication of all mechanical components and servicing of the hydraulic and electrical systems. Many of our Barrier inspection and maintenance activities require working from the water in boats and pontoons.  We carry out bi-monthly operational exercises of the Barrier to ensure its reliability and to train our network of skilled professionals within the Barrier Team."
        },
        {
            "text": "Scenario-based training is key to building and maintaining the team’s competency in operation and supervision of the Barrier during deployments. The Barrier Team routinely practices the execution of emergency and contingency procedures to ensure the team is competent and experienced in responding to potential incidents, as well as ensuring proficient operation of equipment provided for redundancy. Also new Barrier Team staff embark on a role-specific onboarding and upskilling training programme focussing on all facets of the Barrier alongside targeted specialisms."
        },
        {
            "text": "The Environment Agency and Associated British Ports partially own the land on Griffin Wharf to the west of the Barrier. In February 2024, Associated British Ports opened Griffin Wharf to the public which serves as a public amenity area for residents and visitors."
        },
        {
            "text": "The Ipswich Tidal Barrier is an example of climate-resilient flood defence infrastructure that continues to protect Ipswich against storm surges tides. Through operation of this tidal Barrier, we are proud to contribute toward a more flood resilient, prospering Ipswich."
        },
        {
            "text": " "
        }
    ]
}