{
    "url": "https://charitycommission.blog.gov.uk/2022/07/12/cryptocurrencies-what-are-they-and-should-charities-use-them/",
    "title": "Cryptocurrencies: what are they, and should charities use them?",
    "authors": [
        "Sam Jackson, Assistant Director of Policy"
    ],
    "categories": [
        "Finance",
        "Risk"
    ],
    "pub_date": "2022-07-12T15:00:58+01:00",
    "content": [
        {
            "text": "Over the course of human history, there have been several developmental leaps in the way in which people trade and exchange. Each has opened the door to transformational benefits, but also created new challenges and risks for society to navigate. And because of this, each one required a conceptual leap – and arguably a leap of faith too."
        },
        {
            "text": "Proponents of cryptoassets, of which cryptocurrencies are the best known, argue that they represent the latest such step. Once the preserve of the internet savvy (and eccentric billionaires!), the use of cryptoassets is growing in the ‘real economy’, and there are signs that they could continue to become a more mainstream route to investing, trading, and moving assets."
        },
        {
            "text": "The Ukrainian government has raised millions of dollars for its war effort via cryptocurrencies in recent months. And earlier this year, the Treasury set out its plans to “make the UK a global cryptoasset technology hub”, and to introduce legislation to regulate a certain type of cryptocurrency, and also announced it will consult on regulation for cryptocurrencies more widely later this year."
        },
        {
            "heading": 2,
            "text": "What does this mean for charities?"
        },
        {
            "text": " Charities have often been at the forefront of innovation, and there is evidence that some charities are considering whether and how they might benefit from working with cryptoassets."
        },
        {
            "text": "The Commission wants to help promote innovation in charities. Indeed, we encourage trustees to consider how they might change what they do, or improve the way they do it, to better deliver on their charitable purpose."
        },
        {
            "text": "But there are real risks in engaging with cryptoassets too, and there is much we don’t yet know about how the world of cryptoassets is likely to develop in the future, and the opportunities and risks that it may harbour."
        },
        {
            "text": " "
        },
        {
            "heading": 2,
            "text": "How are charities using cryptoassets?"
        },
        {
            "text": "The indications we have at this point suggest that relatively few charities are using cryptoassets, and where they are, they are using them for limited and specific purposes, such as to move currencies across borders where there are no reliable regulated banking services available."
        },
        {
            "text": "A number of charities accept cryptocurrencies or assets as donations, but it’s likely that where they do, they, convert them immediately into regulated assets or traditional currencies."
        },
        {
            "text": "Overall, we understand that a very small number of charities engage in holding or trading in cryptocurrency, or are thinking about ways in which they can use this to further a charity’s purposes, all of which pose interesting and complex questions."
        },
        {
            "heading": 2,
            "text": "Looking ahead"
        },
        {
            "text": "One of our strategic objectives is to give charities the tools and understanding they need to succeed. And so we continue to look into this area, and are speaking to experts and charities about how cryptoassets might change how charities work – or not. We will provide further guidance if we think that is appropriate."
        },
        {
            "heading": 2,
            "text": "… and in the meantime "
        },
        {
            "text": "As things stand, we consider that trustees should think very carefully before investing in cryptocurrency, evaluating the benefits and risks as they would do with any important decision about their charity. This includes taking appropriate professional advice. Use our guidance on the core trustee duties, on making effective decisions, and our investment guidance as your guides."
        },
        {
            "text": "It’s also important to know your donor, which can be tricky in the context of cryptoassets, as the blockchain relies on – indeed in some ways is designed to guarantee – anonymity and secrecy."
        },
        {
            "text": "For many, these standard considerations will lead them to err on the side of caution until more is known about the market, and there is more regulation in the UK. Recent plunges in crypto currency values emphasise that such caution is prudent."
        },
        {
            "text": "Trustees who do decide to dip their toes in the crypto water should document their decision-making carefully. Remember that if problems arise, the Commission might need to get involved, and we’ll expect to see evidence that you fulfilled your legal duties and responsibilities and did not put your charity’s assets – including its reputation – at undue risk."
        }
    ]
}