{
    "url": "https://defrafarming.blog.gov.uk/2022/07/12/sustainable-farm-based-proteins-funding-available/",
    "title": "Sustainable farm-based proteins: funding available",
    "authors": [
        "Joss Wallace"
    ],
    "categories": [
        "Payments for research and innovation"
    ],
    "pub_date": "2022-07-12T16:53:32+01:00",
    "content": [
        {
            "text": "We’re inviting farmers, growers, foresters, businesses and researchers to apply for a share of £12.5 million to focus on the research and development of sustainable farm-based proteins."
        },
        {
            "text": "In this post, I’ll share a little bit more about our objectives, the projects we’ll fund and include links to the guidance you’ll need to apply."
        },
        {
            "text": "Our objectives"
        },
        {
            "text": "We want to help the sector meet the challenge of transitioning to more sustainable production of farm-based proteins."
        },
        {
            "text": "This might be achieved by mitigating emissions or reducing the environmental impact of proteins to reduce biodiversity loss and ease pressure on land and water."
        },
        {
            "text": "We will fund a whole range of projects – in feasibility and industrial research categories - from traditional livestock production and plant production to novel animal feeds/supplements, agroforestry and bioeconomy."
        },
        {
            "text": "Projects could include development of new protein crops like legumes or brassicas, as well as enhancing traditional livestock production. "
        },
        {
            "text": "Projects can be led by both businesses and research organisations, but all projects must be collaborative and include at least one business in the team. We’re holding a consortia-building event in August. I’ll share the details at the end of this post. "
        },
        {
            "text": "As before, all projects within the Farming Innovation Programme must benefit farmers, growers or foresters based in England. "
        },
        {
            "text": "What to expect when you apply"
        },
        {
            "text": "Applications will open on 25 July."
        },
        {
            "text": "You'll be asked to explain the challenge you've identified; how your innovation can solve the challenge; and how you will maximise impact across the sector. "
        },
        {
            "text": "The application window closes on 21 September and projects are expected to start from 1 April 2023. "
        },
        {
            "text": "In this competition, we will not fund projects that take protein production away from the farm, for example: cultured meats. "
        },
        {
            "text": "We won’t fund 'post farm-gate' projects involving downstream processing or manufacturing. Wild-caught fisheries and aquaculture for human consumption are also not in scope. "
        },
        {
            "text": "Learn more"
        },
        {
            "text": "How to apply for Feasibility projects"
        },
        {
            "text": "How to apply for Industrial research projects."
        },
        {
            "text": "For detailed instructions on how to apply, Innovate UK KTN are hosting an applicant briefing webinar from 10:00 am on 3 August. This will be followed by a consortia-building workshop, where you can identify potential collaborators for your project, from 12:45 pm on the same day. "
        },
        {
            "text": "You can register to attend the applicant briefing webinar on the Innovate UK KTN virtual conference website. "
        },
        {
            "text": "Visit the UKRI Farming Innovation website for more information."
        }
    ]
}