{
    "url": "https://prisonjobs.blog.gov.uk/2022/07/12/why-i-like-working-as-a-community-payback-supervisor/",
    "title": "“Why I like working as a Community Payback supervisor.”",
    "authors": [
        "Ministry of Justice"
    ],
    "categories": [
        "Community Payback",
        "Personal stories",
        "Probation",
        "Ways of working"
    ],
    "pub_date": "2022-07-12T18:57:10+01:00",
    "content": [
        {
            "text": "Community Payback (CP) supervisors lead teams of people on probation to do unpaid work in the community and make positive changes to get their lives back on track. If you're a people person and looking for a rewarding career, find out more and take a look at our latest vacancies."
        },
        {
            "text": "Hazel, who’s been a CP supervisor for the last 5 years, tells us what the job is like and why she does it. "
        },
        {
            "text": "“People are often shocked when they hear my job involves driving groups of offenders in a minibus and spending up to 7 hours a day out in the community with them. But I love it, and I love challenging the preconceptions some people have about working with people on probation. "
        },
        {
            "text": "Yes, I work with individuals who have committed a wide range of crimes – including some more serious ones. But everyone in a CP working group has been assessed as suitable for supervision in the community. Due to various challenges, including things like homelessness or mental health issues, many live quite chaotic lives. They’re not necessarily bad people – just individuals who’ve made poor choices that have led to them having to do CP as part of a community sentence for an offence. We’re not here to judge them for what they’ve done. Our job as supervisors is to lead from the front and motivate the people in our groups to complete their Community Payback.”"
        },
        {
            "text": "Making the right choices"
        },
        {
            "text": "“The job can be challenging and you have to be constantly alert to what’s going on around you. While we’re out in the community, the people on probation and I are all working as part of a team – and it only takes one person to ruin the group dynamic. You do get some who are disruptive or not pulling their weight, and you sometimes experience anti-social behaviour. But, ultimately, if you handle the situation right you can diffuse it and turn it around – which is satisfying."
        },
        {
            "text": "Often, all you need to do is take the person to one side, talk to them and re-set clear boundaries and expectations. If necessary, you can send them off site. But more often than not, as soon as people hear that’s a possibility, they knuckle down as they’re generally keen to get through their CP hours as quickly as possible.” "
        },
        {
            "text": "Making a difference"
        },
        {
            "text": "“I’m really interested in what makes people act in certain ways, and I make it my job to listen to, and chat with, the people in my groups. It’s a great opportunity to find out what’s going on in their lives and steer them towards services that could help them turn their lives around – such as local education, training and employment opportunities."
        },
        {
            "text": "To be a good CP supervisor, you need to be able to build a rapport with people – to be friendly, but not their friend. And, spending so much time with them, often means I pick up on things they may not necessarily have told their probation officer (PO) – things that could really help with their rehabilitation. So, having a good feedback loop with POs is an important part of the CP supervisor role and making a difference in people’s lives.” "
        },
        {
            "text": "Benefiting individuals and the community"
        },
        {
            "text": "“I enjoy working alongside the people in my groups, and I’m really proud of our work. It’s really satisfying at the end of day, for us all to be able to see what we’ve achieved together for the benefit of the local community – whether that be clearing an allotment plot, or making benches, for example. It’s nice to see people doing something they might not otherwise have had a chance to do and learning new skills that could help them make positive changes in their lives.” "
        },
        {
            "text": "Keeping fit and active"
        },
        {
            "text": "“I like working outside, and it keeps me fit and active. Unless the weather’s particularly bad, we continue working, as the group members and I all have warm clothing and wet weather gear. And there’s generally somewhere to shelter if needed."
        },
        {
            "text": "I love my job and find it incredibly rewarding. If you’re a people person, who enjoys helping others and making a difference to your community, why not apply to be a CP supervisor?”"
        },
        {
            "text": "Apply today and be the difference"
        },
        {
            "text": "Community Payback work is varied and meaningful, and comes with job security, a great pension and employee benefits. You don't need specific experience to be a CP supervisor, and you'll get all the training you need to help you work effectively and safely with people on probation."
        },
        {
            "text": "We’ve currently got vacancies for CP supervisors in a number of areas. Visit our website to find out more and apply today."
        }
    ]
}