{
    "url": "https://civilservice.blog.gov.uk/2022/07/12/why-civil-service-leadership-training-is-changing/",
    "title": "Why Civil Service leadership training is changing",
    "authors": [
        "Natalie Golding"
    ],
    "categories": [
        "A Modern Civil Service",
        "A Skilled Civil Service",
        "An Ambitious Civil Service",
        "An Innovative Civil Service"
    ],
    "pub_date": "2022-07-12T08:08:43+00:00",
    "content": [
        {
            "heading": 3,
            "text": "Want to gain the right skills to tackle the challenges of the 21st Century? Here’s how the Leadership College for Government can help you."
        },
        {
            "text": "How often do you think about what makes an amazing leader or manager? While some people can seem like natural born leaders, none of us arrive in the workplace with all the skills, knowledge, and networks we need. They are carefully nurtured with precise, effective support. And faced with a dizzying array of complex problems to solve and services to deliver for the public, it’s arguably never been more important to invest in the shared knowledge and expertise of our current and future leaders and managers. The recent publication ‘Leading to Deliver: A Leadership and Management Prospectus’ outlines how civil servants can gain and improve the skills they need to face 21st Century challenges."
        },
        {
            "text": "That’s our goal at the new Leadership College for Government. But what exactly does this mean for you?"
        },
        {
            "heading": 4,
            "text": "Modernised leadership training"
        },
        {
            "text": "These improvements are all part of delivering the government’s plans for renewing the education, justice and health sectors, forging a new place for the UK on the world stage, levelling up the country and delivering on Net Zero commitments. To do these things, we need brilliant individuals, but we also need teams with a sense of shared purpose, working together to achieve exemplary outcomes for the UK."
        },
        {
            "text": "Last summer, in her blog post on next-gen leadership in the Civil Service, Caroline Murray touched on the work that was already underway. The Leadership College for Government’s first prospectus sets out our plans in more detail."
        },
        {
            "text": "We want to equip our leaders with skills that have proved to be vital through recent challenges. Data analysis and understanding of the sciences, for example, will help leaders across the Civil Service make effective, informed decisions."
        },
        {
            "text": "Government campus "
        },
        {
            "text": "Modernising and updating the way we develop our leaders’ skills is just one of the ways we are overhauling learning for colleagues across the Civil Service as part of the Government Campus and single skills curriculum. We are building on the success of existing training and networks to make improvements for leaders and create stronger connections, both within the Civil Service and with the wider public sector."
        },
        {
            "text": "Our new curriculum will be universal for leadership and management, updated to reflect current needs across government and informed by understanding about how people learn best."
        },
        {
            "text": "We want to help build teams that can deliver great things, not just skilled individuals. Our challenges need connected, systems-wide responses, and we cannot do that without well-developed networks and teams."
        },
        {
            "text": " Increasing our reach"
        },
        {
            "text": "We’re changing and increasing the reach of our current offer to Director Generals, Permanent Secretaries, and their public sector equivalents. We will also include elective skill-focused modules on certain programmes, to build the technical understanding to deliver government priorities like Net Zero and Levelling Up."
        },
        {
            "text": "Some of this will use virtual methods, which have worked well over the course of the pandemic. The college will also use the Government Campus’ physical locations in the Midlands, North East, and Yorkshire and the Humber. By offering access to in-person learning here, leaders get much-needed face-to-face training that will ideally be closer to the communities in which they work. Our locations will also create opportunities for regionally-focussed network building events."
        },
        {
            "text": "Today, 12 July, we’re holding an event for a range of our current and future delegates in the Ryton site — the College of Policing’s centre in the West Midlands. The event includes highly interactive taster sessions from different parts of the college’s offer, plus a chance to connect, chat, and bond. All things that benefit from being done face-to-face."
        },
        {
            "text": "Watch this space"
        },
        {
            "text": "We are continuing to deliver while we reform. For people already taking training or programmes with the college’s predecessors, your learning will continue as originally planned. But watch this space for future learning opportunities — we want your feedback on how we can create long-lasting alumni connections. Learning shouldn’t stop when you leave the classroom."
        },
        {
            "text": "We’re excited about the changes we’re delivering and what we can do for you as the Leadership College for Government, within the Government Campus. Read more on what we have in store in ‘Leading to Deliver: leadership development and management training for government’. We want to help you reach your full leadership potential so we can improve outcomes for citizens and deliver for government."
        }
    ]
}