{
    "url": "https://environmentagency.blog.gov.uk/2022/01/10/adrian-saunders-senior-advisor-for-fisheries-incidents-and-compliance-reflects-on-a-year-of-enforcement-activity/",
    "title": "Adrian Saunders, Senior Advisor for Fisheries Incidents and Compliance, reflects on a year of enforcement activity",
    "authors": [
        "pressoffice"
    ],
    "categories": [
        "Fisheries and biodiversity"
    ],
    "pub_date": "2022-01-10T17:07:30+00:00",
    "content": [
        {
            "text": "Adrian Saunders, Senior Advisor for Fisheries Incidents and Compliance, reflects on the fisheries enforcement work of the Environment Agency in 2021, and the partnerships that help us to crack down on illegal fishing to protect our fisheries. "
        },
        {
            "text": "It has been another difficult and challenging year for everyone, including our fisheries enforcement officers. But throughout it all, our teams have continued to tread the banks of our rivers and still waters, checking rod licences and targeting poaching hotspots."
        },
        {
            "text": "We will not hesitate to pursue offenders involved in unlawful fishing activity through the courts. In autumn 2021, a Gloucestershire fisherman who illegally caught valuable elvers (juvenile eels) was ordered to pay the Environment Agency costs of £10,425.40, a £300 fine and a £30 victim surcharge. His fishing net was also seized and destroyed."
        },
        {
            "text": "Operation LUNGFISH"
        },
        {
            "text": "In the summer, officers took part in a month-long enforcement campaign, known as Operation LUNGFISH, to crack down on illegal fishing and poaching."
        },
        {
            "text": "Launched on 23 July, enforcement activity ran until the end of August. The aim of the campaign was to detect licence evasion and other illegal activity, such as the use of unauthorised traps. In total, 4,500 licences were checked, and 839 notices were issued for fisheries-related offences."
        },
        {
            "text": "Highlights from Operation LUNGISH included:"
        },
        {
            "text": "During Operation LUNGFISH, officers used the latest technologies, including drones and bikes, to reach difficult terrains. Officers are now using a thermal imaging camera for fisheries enforcement patrols in Cambridgeshire, Bedfordshire, Suffolk, Norfolk, Hertfordshire and Buckinghamshire. The teams also have the ability to record and retain video footage to use as evidence."
        },
        {
            "text": "Autumn enforcement: "
        },
        {
            "text": "Enforcement officers seized more than 20 illegal fish traps and other equipment in the North East. The work is part of the Environment Agency’s North East crackdown, called Operation CREEL, that aims to protect threatened species such as the white clawed crayfish and European eel."
        },
        {
            "text": "Members of the public reported illegal practices including crayfish trapping and fish theft, particularly in the River Skerne and nearby ponds which helped authorities to track the culprits."
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": "In November, Environment Agency officers and the Angling Trust held a training day for the Cumbria Police Rural Task Force to help reduce illegal fish activities in Cumbria."
        },
        {
            "text": " "
        },
        {
            "text": "The training, which was supported by fisheries licence income, was held at Clearwater Fishery, Carnforth. It involved practical workstations focussed on fisheries offences contained in the Theft Act, including the illegal use of gill nets and traps for taking freshwater fish. Other sections included rod licence evasion and how it affects fisheries. Input from Angling Trust coaches was also provided with 1:1 coaching for any police officers that wanted to experience angling and its positive wellbeing benefits."
        },
        {
            "text": " "
        },
        {
            "text": "Working with the police and the Angling Trust:"
        },
        {
            "text": "Our enforcement work is often delivered in partnership with the Angling Trust Voluntary Bailiff Service, councils and local police forces in England to pool resources, skills and powers. Joint patrols have proven to be very effective at tackling a wide range of issues that prevent safe and accessible fishing opportunities."
        },
        {
            "text": "The Voluntary Bailiff Service volunteers are the eyes and ears on the riverbank reporting fisheries crime. So far in 2021, the Angling Trust inducted a further 71 volunteers; the total number across England will be around 600 by the end of 2021."
        },
        {
            "text": "I am particularly excited to announce continued roll out of the second phase of the VBS pilot, which sees existing volunteers trained to use enforcement powers, allowing them to check licences and compliance with byelaws to prevent illegal fishing. Six new volunteers will be working in East Anglia in the Great Ouse catchment. If you would like to join the VBS and help combat illegal fishing, please sign up on the Angling Trust’s website here."
        },
        {
            "text": "In 2022, our enforcement officers will continue to go the extra mile to protect our valuable fish stocks whilst sending a clear message to those who break the law. Illegal fishing won’t be tolerated, and we will continue to crackdown on those who think they can get away with it."
        },
        {
            "text": "We owe a huge thanks to all members of the public for reporting illegal activity. If you see or suspect illegal fishing activity, you can report it to our 24-hour incident hotline on 0800 80 70 60."
        },
        {
            "text": "If you’re thinking of going fishing, don’t forget to buy a rod licence. It’s quick and easy and costs just £30 for a whole year They’re available via the Post Office website,  on www.gov.uk and by phone. "
        },
        {
            "text": " "
        }
    ]
}