{
    "url": "https://dvladigital.blog.gov.uk/2022/01/10/dvla-customers-reap-the-benefits-of-using-their-online-services-over-christmas/",
    "title": "DVLA customers reap the benefits of using their online services over Christmas",
    "authors": [
        "Anthony Bamford"
    ],
    "categories": [
        "DVLA Digital Services"
    ],
    "pub_date": "2022-01-10T15:50:23+01:00",
    "content": [
        {
            "text": "How did you spend Christmas Day? Cooking turkey, eating mince pies, maybe watching the Christmas specials on TV? Some people renewed their driving licence or sold a vehicle!"
        },
        {
            "text": "Figures released today show how many customers used DVLA’s online services on Christmas Day and New Year’s Day - highlighting that they are quick, easy to use and available when you need them."
        },
        {
            "text": "We’re also really glad that drivers over 70 took our advice to keep their money in their pocket at Christmas and used our secure service on GOV.UK. Showing that not only are our online services quick, easy and secure, you can also save money in the process. Perfect, if you’re tightening your belt after Christmas or want some extra cash to spend in the January sales."
        },
        {
            "text": "Here’s how many customers used our online services over the festive period:"
        },
        {
            "text": "On Christmas day:"
        },
        {
            "text": "On New Year’s Day:"
        },
        {
            "text": "We recently launched a marketing campaign to help customers learn about the benefits of going online. If you see any of our adverts on social media, why not share them with your family and friends?"
        },
        {
            "text": "In a recent blog highlighting the top 3 reasons to renew your driving licence online, customers have shared their experience using our online services. Tell us about yours in the comments section below."
        },
        {
            "text": "You can also try our other services which are available online at GOV.UK."
        }
    ]
}