{
    "url": "https://civilservice.blog.gov.uk/2022/01/10/get-ready-for-active-wellbeing-2022-with-cssc/",
    "title": "Get Ready for Active Wellbeing 2022 with CSSC ",
    "authors": [
        "Myrtle Lloyd"
    ],
    "categories": [
        "A Modern Civil Service",
        "A Skilled Civil Service",
        "An Ambitious Civil Service"
    ],
    "pub_date": "2022-01-10T10:33:58+00:00",
    "content": [
        {
            "heading": 3,
            "text": "Active Wellbeing is back, here to help civil servants make positive lifestyle changes and get active at work. Civil Service HR is working with the Civil Service Sports Council to deliver a week-long campaign from 17 January, to encourage all of us to be active."
        },
        {
            "text": "17 to 23 January 2022 will see the Civil Service and CSSC team up for the fourth year to host Active Wellbeing 2022. This initiative is all about having fun with your colleagues and motivating each other to implement a healthy balanced lifestyle. Studies show that making a commitment towards a positive change with colleagues and friends makes it easier to stick to your goals."
        },
        {
            "heading": 4,
            "text": "Small positive changes"
        },
        {
            "text": "At the heart of Active Wellbeing is the pledging platform, which encourages everyone, me included, to make small positive changes to our working days to improve our health, happiness, energy and work-life balance."
        },
        {
            "text": "This year, I’ll be pledging to get out on my bike at least once a week and explore the countryside around me. I’ve always found cycling to be the best way to have fun while staying active, and getting fit while finding new hidden gems to enjoy."
        },
        {
            "heading": 4,
            "text": "Win a prize"
        },
        {
            "text": "Whatever you choose to pledge, you’ll be rewarded for collecting badges for each milestone along the way- because we all need a little motivation."
        },
        {
            "text": "Physical activity can have a huge impact on our health and wellbeing, by boosting our mood, self-esteem, energy levels, and improving how we sleep. Active Wellbeing offers something for everyone. So take the time to work out what’s right for you, your mind and your body. It’s up to you how you get involved."
        },
        {
            "text": "I was flattered to be asked to sponsor the Civil Service Active Wellbeing campaign for 2022, and I’m excited to get involved in the activities."
        },
        {
            "text": "CSSC is here to support your active wellbeing journey, with lots of tools and resources to suit your individual needs. From expert advice, live seminars, classes and new ideas to get you active across the week, you can find a full list of resources on the Active Wellbeing website."
        },
        {
            "text": "Simon Lee MBE, CEO of CSSC has been a keen advocate of Active Wellbeing since the beginning. "
        },
        {
            "text": "“I’m delighted that CSSC is working in partnership with the Civil Service to deliver a fourth Active Wellbeing. Supporting civil servants to nurture their mental and physical wellbeing has never been more important than during these challenging times and I urge everyone to get behind this fantastic initiative.” "
        },
        {
            "heading": 4,
            "text": "Make your pledge"
        },
        {
            "text": "To start off with, those who invite their friends and teammates to make a pledge will have a chance to win a Hello Fresh voucher. So make your pledge today and get active this January! Visit the Active Wellbeing website for more information on how both you and your team can get involved with Active Wellbeing 2022. Here you’ll be able to make your pledge, track your progress, and access the Active Wellbeing 2022 digital pack which includes resources to help promote the initiative within your department."
        },
        {
            "text": "CSSC is an exclusive not-for-profit membership organisation inspiring over 160,000 members across the UK to explore new ways to be active and healthy. Their range of everyday savings, offers and opportunities to have amazing days out will help you do more of the things you love, with the people you love."
        }
    ]
}