{
    "url": "https://lifeathmrc.blog.gov.uk/2022/01/10/introducing-user-research-in-content-design/",
    "title": "Introducing User Research in Content Design",
    "authors": [
        "Jacqui De La Mazière",
        "Sam Wylie",
        "Oliver Kass",
        "James Doyle",
        "David McManus"
    ],
    "categories": [
        "General",
        "User research"
    ],
    "pub_date": "2022-01-10T15:55:16+00:00",
    "content": [
        {
            "text": "We’ve read many stories of meeting user needs in the development of digital services, but what do you do when the user researcher on your team also has accessibility needs?"
        },
        {
            "text": "We spoke to Maz, an autistic user researcher, who joined our content team to explore the challenges and opportunities this situation presents."
        },
        {
            "text": "Maz – User Researcher"
        },
        {
            "text": " "
        },
        {
            "text": "We had a double whammy in a way. I had never worked with HMRC before, or on content, and some of the team hadn’t worked with a user researcher before. I discovered early on that the team would need training, on the importance of user research and establishing processes to record and share insights in line with HMRC’s standard processes around user research planning, ethics and recruitment."
        },
        {
            "text": "On top of that, the team doesn't work in the same way, or use the same software or tools that other researchers in HMRC are using, so we had a real challenge on our hands against a backdrop of delivery deadlines."
        },
        {
            "text": "My starting point was to collaborate with the team to help them understand what user research is, why we do it and what user research means for content. It’s a unique environment in that the content team are not responsible for policy, or the browsing experience on GOV.UK, but find themselves in the middle of those aspects. Although the content team don’t deliver a ‘service’ in a way that user research may be carried out on an end-to-end journey, by the very nature of writing guidance, the user journey has to be considered and this makes the guidance complex with many decision points, links and features to navigate through."
        },
        {
            "text": "We initially came up with some of the key activities and goals users undertake on content, for example: locating, navigating, understanding and sharing it. This helped us frame a backdrop for planning, recruitment and producing discussion guides and scenarios for usability testing."
        },
        {
            "text": "Next, I was given an overview of how work comes into the team, which immediately enabled me to spot where user needs could be identified early on. I also started getting involved in some of the sessions the team use to peer-review content and the software they use to establish if content is readable. This helped my understanding of the environment the team work in, the often-rapid turnaround of requests and the challenges they face."
        },
        {
            "text": "I developed processes to help standardise how the team could work collaboratively with me and ran sessions for the team. As an autistic person, I struggled with some of the wider HMRC user research ways of working. For example, in collaborative sessions where lots of people would potentially talk at once or where topics for discussion were not provided in advance but decided on in a session were a challenge. Similarly, using online interactive collaborative tools such as Miro or Jamboard, where there are multiple channels of input, such as comments, movement, and talking can create a sensory overload. Autistic people struggle to process many channels of input and need advance notice and extra detail, when it comes to tasks, meetings and processes, so establishing ways of working early on between myself and the team, was really useful."
        },
        {
            "text": "One of the most helpful tools has been a Jamboard template, which we used in our planning to individually understand the content and map out the user journey through it. This enabled me to avoid highly interactive sessions while making use of the tools available to visualise journeys which we would then use to plan out our scenarios for testing."
        },
        {
            "text": "Additionally, we did simple things that can make such a difference for autistic people, like turning video cameras off in meetings, as eye contact can be difficult. I was also given a disability passport, using practical examples of some of the challenges I had faced. We held retrospective review sessions whereby team members involved in usability testing would discuss the findings from our research and translate that into actionable insight. These sessions worked well as it’s important for any team, to not just get involved in doing user research, but also to have a voice in how we work together. Throughout, I considered the working patterns, commitments and/or disabilities of colleagues on the team to be as supportive as possible."
        },
        {
            "text": "So, we’re 3 months in now and we’re now in a situation where I see the team having grown in confidence, with volunteers on the team coming forward to act as observers for user research sessions and content designers involved in the planning, conducting, analysis and feedback from sessions, to help develop our capacity. It’s been great. The team created a welcoming environment for me by doing their best to support me as an autistic colleague and they didn’t hesitate in getting stuck in to something they haven’t necessarily done before. I am proud of the team and of myself, for how far we have come in such a short space of time."
        },
        {
            "text": "David, Oli and James –Senior Content Designers"
        },
        {
            "text": "We also spoke to some of Maz’s colleagues for more insight on their experiences. Here’s what they had to say…"
        },
        {
            "text": "“It’s been great to see Maz introducing UX design best practice and ways of working to the team. It can be difficult to join a busy team and establish yourself quickly, but Maz has done it with ease.”"
        },
        {
            "text": "“The research Maz is leading on will give us a good snapshot of how live content is performing with users. I'm looking forward to seeing how we can use the findings to deliver a better user experience.”"
        },
        {
            "text": "“It's a brilliant opportunity for the whole team to get involved in research work. It'll make us all better designers.”"
        },
        {
            "text": "“It has been refreshing to be able to use a user researcher to see how to content is landing with users. Maz been great and brought in processes, explaining best practices completely new to the team.”"
        },
        {
            "text": "“User research gives the team the opportunity to see how their content may affect different users' experiences. It allows us all to develop understanding of user behaviour which will impact our approach to content design for the better going forward.”"
        },
        {
            "text": "Sam – Maz’s line manager"
        },
        {
            "text": "“Our team is all about meeting user needs, so it’s been very exciting having Maz here to help us in that crucial work. In the hectic nature of everyday working life, we don't always have detailed user insight to check that the content we've produced is working as we planned. Maz helps us to do that, which is invaluable."
        },
        {
            "text": "“Along with other members of the team, I’ve helped Maz settle in and get used to HMRC’s ways of working. Through weekly catch ups, we’ve resolved issues and talked about what’s on her horizon. Our shared passion for a certain North West football team has helped us bond too! Having Maz as part of the team will enable us to continue to focus on user needs, and support HMRC to deliver for the government.”"
        }
    ]
}