{
    "url": "https://charitycommission.blog.gov.uk/2022/01/10/looking-to-the-year-ahead/",
    "title": "Looking to the year ahead",
    "authors": [
        "Helen Stephenson"
    ],
    "categories": [
        "Public Trust"
    ],
    "pub_date": "2022-01-10T15:00:53+00:00",
    "content": [
        {
            "text": "Happy New Year! As we enter 2022, I have been reflecting on the year that was 2021. I am proud of what the Commission achieved over the year, and of the way in which we have supported and regulated the charitable sector, during a time when the good work of charity has been more important than ever."
        },
        {
            "text": "Last year, it was encouraging and welcome to see trust in the charitable sector recovering, but there is no room for complacency. Not for charities, and not for the Commission as regulator."
        },
        {
            "text": "The fundamental principles shaping the relationship between charities, the state and the public are unchanged, even after the upheaval of the past 18 months. Our role within this is also unchanged and we must continue to regulate charities proportionately, robustly and transparently, and further improve the experiences charities have when they engage with us."
        },
        {
            "text": "With the ongoing pandemic and its profound impact on the 170,000 charities on our register, the volume of work and demands for our services have also grown. But, as an organisation we continue to plan for the future with confidence, focussing on long-term shifts, and aiming for significant changes that may take longer to realise but that will deliver greater impact."
        },
        {
            "text": "Data – how we collect it, use it and share it – will be a critical feature of activity in the year ahead.  Our work in this area will allow us to be an ever more proactive regulator, intervening at an earlier stage and hopefully avoiding harm and disruption sooner."
        },
        {
            "text": "The Commission is in a unique position to be the source of key information about charities in England and Wales and we are developing ambitious plans to better use the data and information we collect and hold. This is essential, so that we can give the public access to information that helps them make informed choices about charities; identify risks and potential problems or wrongdoing in charities; and provide policymakers with better visibility of the scale and scope of the sector."
        },
        {
            "text": "In the medium term, we also have plans to fundamentally change the way in which we communicate with charities. With time, that will include a new online portal, which will be tailored to trustees’ specific needs and aims to significantly improve trustees’ experiences of engaging with us and receiving relevant and timely support in running their charities."
        },
        {
            "text": "Further to this, the Charities Bill, which is progressing through Parliament, should make life a little more straightforward for trustees, and help them maximise the benefits that their charity delivers. When enacted, the Bill will simplify and modify certain activities that trustees can undertake, such as amending governing documents and using permanent endowment more flexibly."
        },
        {
            "text": "We are on good foundations to further develop these and other ambitions. While we all continue to live with a degree of uncertainty, a few things remain constant: society will continue to depend on the vital work charities do; charity will continue to rely on the active and tacit support of the public; and the Commission’s role in inspiring trust to ensure charity can thrive will be as important as ever."
        }
    ]
}