{
    "url": "https://aphascience.blog.gov.uk/2025/10/21/cattle-bovine-tb-vaccine-field-trials/",
    "title": "Cattle bovine TB vaccine field trials move to next phase",
    "authors": [
        "APHA science blog team"
    ],
    "categories": [
        "Bovine Tuberculosis"
    ],
    "pub_date": "2025-10-21T09:00:00+01:00",
    "content": [
        {
            "text": "Bovine tuberculosis (bTB) remains one of the most challenging animal health issues facing the UK farming industry today. As part of the UK Government’s long-term strategy to eradicate the disease, the Animal and Plant Health Agency (APHA) has been leading a pioneering initiative to develop and test a cattle vaccine and its companion diagnostic tool, the DIVA skin test. These tools represent a significant step forward in the fight against bTB, offering the potential to protect cattle while accurately identifying infected animals."
        },
        {
            "text": "Since the launch of the Cattle Vaccine Project, APHA has made substantial progress through a series of carefully designed field trials. These trials are essential for gathering the scientific evidence needed to support future deployment of the vaccine and skin test across the UK. With Phases 1 and 2 now complete, the project is entering its third phase, expanding the scope and scale of testing to further validate safety, performance, and practical delivery."
        },
        {
            "text": "In this blog, we reflect on the achievements of Phases 1 and 2, and share an update on the launch of Phase 3, bringing us closer to a deployable cattle TB vaccination strategy that could transform disease control efforts and help secure ‘Officially TB Free’ status for England and Wales."
        },
        {
            "heading": 2,
            "text": "From the project management team"
        },
        {
            "text": "Since our last blog, the Animal and Plant Health Agency (APHA) has made significant progress in the development of a cattle vaccine to combat bovine tuberculosis (bTB). With Phases 1 and 2 of the field trials now complete, we are excited to move into Phase 3, and take a moment to reflect on the journey so far."
        },
        {
            "text": "Phase 1: started in June 2021 and focused on testing the performance and safety of the DIVA (Detect Infected among Vaccinated Animals) skin test in cattle that had not been vaccinated and came from herds free of TB. This was a crucial first step to ensure the test could accurately identify animals that were truly infected, without producing false positives."
        },
        {
            "text": "The Phase 1 field trials concluded in May 2022 and enabled APHA to move to Phase 2."
        },
        {
            "text": "Phase 2: started in January 2023 and built on this by evaluating the safety of the cattle Bacillus Calmette-Guérin (BCG) vaccine* and how well the DIVA skin test worked in vaccinated cattle. This phase involved over 600 cattle from seven herds in five farms from the low-risk area in England and provided valuable data on how the vaccine and test perform in real-world conditions."
        },
        {
            "text": "The results from these trials are now being used to support applications for Marketing Authorisations (MAs). If approved, these will allow the vaccine and skin test to be used in the UK, offering a powerful new tool in the national strategy to eradicate bTB."
        },
        {
            "text": "Phase 2 concluded in December 2024."
        },
        {
            "text": "This work is a collaborative effort, relying on the expertise of APHA’s bovine TB scientists, contract managers, field teams, and data analysts. Their continued input is vital as we move forward."
        },
        {
            "text": "*The BCG used for cattle is supplied by AJVaccines, the same company that produces the BCG for use in humans and badgers. Pilot batches of the companion DIVA skin test are supplied by Lionex, a world leading producer of mycobacterial antigens for diagnostics and vaccine developments."
        },
        {
            "heading": 2,
            "text": "Field trials: Phase 3"
        },
        {
            "text": "To allow APHA to gather additional data on the companion DIVA skin tests performance and explore options to optimise this, Great Britain (GB)  administrations have taken the decision to move to an additional phase (Phase 3)."
        },
        {
            "text": "Phase 3 will assess the BCG vaccination and companion DIVA skin test on a larger cohort of cattle to further inform our collective planning for delivery. We are continuing to work at pace but will only deploy the vaccine and companion DIVA skin test when we have all the right steps in place."
        },
        {
            "text": "Our aim is to deliver an effective cattle TB vaccination strategy within the next few years to accelerate our continued progress towards achieving ‘Officially TB free’ (OTF) status for England and Wales."
        },
        {
            "text": "Phase 3 will be taking place on commercial livestock farms across England and Wales and are due to be completed in 2026. Phase 3 will involve at least 10 farms with 750 animals participating. "
        },
        {
            "heading": 2,
            "text": "Next steps"
        },
        {
            "text": "APHA will use data from the trials to support applications for GB Marketing Authorisations for both BCG use in cattle and the companion DIVA skin test. These will be submitted to the Veterinary Medicines Directorate (VMD). If the Marketing Authorisation are granted, we anticipate that BCG for cattle and the companion DIVA skin test could be available for deployment in the field in the next few years."
        },
        {
            "text": "The final approval cannot be provided until we have contracts in place to make the companion DIVA skin test to Good Manufacturing Practice (GMP) standard. These are defined quality standards that ensures medicinal products are consistently safe, of high quality, and suitable for their intended use, only achievable by accredited manufacturers."
        },
        {
            "text": "Further information regarding development of a deployable vaccine against bovine TB can be found on the TB Hub."
        },
        {
            "text": "To find out more about the Government’s strategy to eradicate bovine TB and research leading to the development of a cattle vaccine and companion DIVA skin test, please follow the links below:"
        }
    ]
}