{
    "url": "https://educationhub.blog.gov.uk/2025/10/new-v-levels-and-post-16-qualifications-explained/",
    "title": "New V levels and post-16 qualifications explained ",
    "authors": [
        "mediaofficer"
    ],
    "categories": [
        "Apprenticeships",
        "Further education"
    ],
    "pub_date": "2025-10-21T10:29:13+01:00",
    "content": [
        {
            "text": "We’re transforming post-16 education so every young person can gain the knowledge and skills they need to get a good job, go on to university, or achieve other ambitions. "
        },
        {
            "text": "From 2027, new V levels will be introduced to replace many existing qualifications, simplifying the current system and opening up more high-quality routes for young people. "
        },
        {
            "text": "These reforms will make sure that whatever a student’s interests or strengths, whether academic, technical, or vocational, there’s a clear, high-quality path for them. "
        },
        {
            "heading": 3,
            "text": "What are V levels? "
        },
        {
            "text": "Alongside A levels (the established academic route) and T Levels (the technical route that includes an industry placement), there will soon be a third option called V levels. "
        },
        {
            "text": " V levels will be new Level 3 qualifications that offer a vocational pathway for students who want to explore different sectors before deciding where to specialise. "
        },
        {
            "text": "This new pathway will replace the wide range of qualifications that are not A or T levels and streamline the currently confusing landscape of approximately 900 qualifications at this level.  "
        },
        {
            "heading": 3,
            "text": "What new options are being introduced at Level 2 (GCSE equivalent)? "
        },
        {
            "text": "Two new pathways are being created to better support students at Level 2 — the level broadly equivalent to GCSEs. These pathways will support those aged 16-18, providing clear route that matches their aspirations, whether that is work or moving into further study:"
        },
        {
            "text": "The Occupational Pathway – for those who want to develop the skills and experience needed to move straight into a skilled job or apprenticeship after Level 2. This two-year, employment-focused programme will give students training designed around real jobs and industries, helping them become work-ready and confident about starting in work. "
        },
        {
            "text": "The Further Study Pathway – for students who plan to continue in education and progress onto Level 3 courses like A levels, T Levels, or V levels, but  who may need more time to prepare, building confidence and strengthening their skills first. This pathway will bridge the gap to higher-level study, helping students prepare for their next step in education."
        },
        {
            "text": "These changes will ensure every young person has a route that’s right for them, whether they’re aiming for work, higher education, or further study. We recognise that there may be circumstances as well where students wish to transfer between the pathways and we will consider how best we can support that.   "
        },
        {
            "heading": 3,
            "text": "What if you’re struggling with English and maths GCSEs? "
        },
        {
            "text": "Many young people find themselves stuck repeating English and maths GCSE exams, which can be frustrating and discouraging. "
        },
        {
            "text": "To help, new English and maths qualifications will be introduced for those aged 16-19 to act as a positive step towards achieving a GCSE grade 4 or above. "
        },
        {
            "text": "The new approach will give students more time and tailored support to build confidence before resitting exams. "
        },
        {
            "text": "All providers will still be required to support 16–19-year-olds who haven’t yet achieved a GCSE grade 4 (or equivalent) in English and maths. To strengthen this support, providers will now: "
        },
        {
            "text": "This means students will have more teaching time, more support, and a better chance of success. "
        },
        {
            "heading": 3,
            "text": "How will this improve technical and vocational education? "
        },
        {
            "text": "We’re investing an extra £800 million in 16–19 education and establishing 29 new Technical Excellence Colleges focused on key industries. "
        },
        {
            "text": "This is about giving every young person the opportunity to succeed, while ensuring employers get the skilled workforce they need. "
        },
        {
            "heading": 3,
            "text": "What happens next? "
        },
        {
            "text": "The government has launched a consultation on how the new pathways will work in practice. "
        },
        {
            "text": "The full set of reforms has been outlined in the Post-16 Education and Skills White Paper shortly. "
        }
    ]
}