{
    "url": "https://socialcare.blog.gov.uk/2025/10/21/reaffirming-our-values-in-adult-social-care/",
    "title": "Reaffirming Our Values in Adult Social Care",
    "authors": [
        "Deborah Sturdy",
        "Sarah McClinton"
    ],
    "categories": [
        "Care and support",
        "Diversity"
    ],
    "pub_date": "2025-10-21T12:41:57+00:00",
    "content": [
        {
            "text": "Our values remain fundamental in adult social care"
        },
        {
            "text": "As we have been out and about across the country over the last months, we have heard how the experiences of people working in adult social care and people who draw on care and support have been affected by recent events, including the rise of anti-immigration protests, increased hate crime and the recent horrific attack on the Heaton Park synagogue in Crumpsall."
        },
        {
            "text": "The sense of shock, unease and distress that is spread by these events impacts all of us.  For people who work across our adult care and support services, particularly global majority colleagues, and for people who draw on care and support, many of whom have experienced trauma and exclusion, it can mean that people no longer feel safe doing their jobs and going about their daily lives.   "
        },
        {
            "text": "Social work, occupational therapy and social care nursing and professional care workforce is rooted in the values of respect, dignity, equality, and justice. Our Professionals Leadership Group have come together in a joint statement, to re-state that these values are not optional—they are the foundation of our practice and our shared responsibility.  Every person, regardless of background, ethnicity, faith, or nationality, deserves to feel safe, valued, and supported.   "
        },
        {
            "text": "As the Chief Social Worker and Chief Nurse of adult care, along with our professional leadership colleagues, we are clear that: "
        },
        {
            "text": "We would like to thank colleagues across the whole of the adult social care landscape for your leadership and support to people who draw on care and support and to staff at this time, when communities can be seen as divided and people can feel isolated and afraid.  It is the compassion, care and commitment demonstrated by colleagues each day that is the foundation of adult social care.       "
        },
        {
            "text": "In his recent speech, the Prime Minister underlined the ambition we share to live in ‘a fairer country, a land of dignity and respect where everyone is seen and everyone valued’.  In adult social care these values are central to all of our work. "
        }
    ]
}