{
    "url": "https://defrafarming.blog.gov.uk/2025/10/21/soil-health-and-profit-lessons-from-mixed-arable-and-upland-farms/",
    "title": "Soil health and profit: lessons from mixed, arable and upland farms",
    "authors": [
        "Graham Higgins"
    ],
    "categories": [
        "Future Farming Podcast"
    ],
    "pub_date": "2025-10-21T11:17:57+01:00",
    "content": [
        {
            "text": "In this episode of the Defra Farming podcast, guest host Neil Pickard, an independent farming adviser with more than 45 years’ experience in livestock and mixed farming, talks with Stuart Johnson, Soil Farmer of the Year 2023, and Kyle Richardville from Understanding Ag."
        },
        {
            "text": "They discuss how improving soil health can increase profitability on mixed, arable and upland livestock farms."
        },
        {
            "text": "Stuart farms in Northumberland as a tenant farmer with sheep and cattle. Over time, he has moved from a high-input, conventional system to one that focuses on soil health. "
        },
        {
            "text": "Kyle brings a scientific perspective, drawing on his research into soil microbial populations and his experience advising farmers in the UK and the US."
        },
        {
            "text": "Neil highlights the need to tailor approaches to different systems:"
        },
        {
            "text": "Together, Stuart and Kyle explore how better soil health can reduce reliance on expensive inputs, build resilience and improve whole farm efficiency. They discuss the different challenges for mixed, arable and upland livestock farms, and share practical steps to get started."
        },
        {
            "text": "Stuart recalls his first steps:"
        },
        {
            "text": "He explains how the numbers encouraged him to keep going:"
        },
        {
            "text": "Kyle explains why soil health underpins farm productivity:"
        },
        {
            "text": "The discussion covers practical lessons from Stuart’s farm, the importance of monitoring soil organic matter, and the value of learning continuously from other farmers, advisers and scientific research."
        },
        {
            "text": "Both guests highlight the financial and lifestyle benefits."
        },
        {
            "text": "For Stuart, focusing on soil health has improved profit margins, reduced tractor hours, and created more time for livestock and family. "
        },
        {
            "text": "For Kyle, the science shows that ecological and economic resilience go hand in hand."
        },
        {
            "heading": 2,
            "text": "Share your thoughts"
        },
        {
            "text": "We’d love to hear your thoughts on the podcast. If you’ve tried improving soil health on your farm, or are planning to, leave a comment and share your experiences."
        },
        {
            "text": "Subscribe to the Farming Blog to receive an email notification whenever a new podcast episode or post is published."
        }
    ]
}