{
    "url": "https://ipo.blog.gov.uk/2025/10/21/whats-changing-filing-international-patents/",
    "title": "What’s changing – filing international patents ",
    "authors": [
        "Simeon Bowen"
    ],
    "categories": [
        "Digital",
        "Innovation",
        "IPO",
        "Patents",
        "Transformation"
    ],
    "pub_date": "2025-10-21T14:45:00+01:00",
    "content": [
        {
            "text": "Spring 2026 will see the arrival of our One IPO Patent Service – a digital platform that will transform how you apply for and manage patents. "
        },
        {
            "text": "We're publishing weekly guidance to help you prepare for these changes. Each week covers a different aspect of the new service to ensure you're ready for the transition. "
        },
        {
            "text": "This week we turn our attention to the most imminent change – how you file international patents. "
        },
        {
            "heading": 3,
            "text": "The context "
        },
        {
            "text": "Currently, international patents from UK applicants, otherwise known as Patent Cooperation Treaty (PCT) filings, are typically submitted via the European Patent Office’s online filing service (eOLF). From 1 January 2026, eOLF is no longer being supported by the EPO.  "
        },
        {
            "text": "While we’ll still be accepting UK (GB) patent applications via eOLF until 31 March 2026, the same isn’t true of PCT applications. This is because we will be unable to update eOLF to reflect the new fees for PCT applications (applied annually on 1 January)."
        },
        {
            "heading": 3,
            "text": "Filing PCT applications from 1 January 2026 "
        },
        {
            "text": "There is no facility to submit PCT applications built into UK IPO’s new patents service. As a result, from 1 January 2026 you will have three options for filing PCT applications: "
        },
        {
            "text": "Submitting applications with the UK IPO as a receiving office means that the UK IPO will conduct some initial checks. This will make sure the application is accurate and nothing is missing before sending it to WIPO. "
        },
        {
            "heading": 3,
            "text": "Submitting subsequent documents "
        },
        {
            "text": "Once you’ve submitted a PCT application, you may need to submit subsequent documents. These could include additional information for your application. How you submit those documents from 1 January 2026 will depend on how you submitted your PCT application: "
        },
        {
            "heading": 3,
            "text": "Preparing for the change "
        },
        {
            "text": "We strongly recommend taking some time to familiarise yourself with the ePCT service before 1 January 2026. You can create an ePCT account today – information on how to do this is provided in the ePCT User Guide FAQs. "
        },
        {
            "text": "You can also make use of WIPO’s Demo Environment for Test Filings. This allows you to play with the ePCT service as much as you want without having to worry about making mistakes. "
        },
        {
            "heading": 3,
            "text": "Key features of ePCT "
        },
        {
            "text": "ePCT allows you to: "
        },
        {
            "text": "Unlike eOLF, there is no client to download. ePCT is completely web-based, so you just need to set-up a WIPO account. You won’t need to worry about downloading and installing software. "
        },
        {
            "heading": 3,
            "text": "Find out more about ePCT "
        },
        {
            "text": "We understand that moving to a new digital system can feel daunting. If you're less comfortable with digital processes, support will be available to help you through the transition.  "
        },
        {
            "text": "To find out more about the ePCT updates, you can: "
        },
        {
            "text": "\n\n\nFind out more about the transformation of IPO’s services\n\n\n\ntake a look at our  transformation web pages, which include lots of details about the new patents service  \nwatch our webinar  that was recorded in early 2025 and contains a detailed demo of the new service \nsubscribe to our IPO blog so that you get new blog posts sent directly to your inbox, ensuring you don't miss out on any important information. \n\n\n "
        }
    ]
}