{
    "url": "https://ruralpayments.blog.gov.uk/2015/04/27/bps-2015-what-you-have-been-asking/",
    "title": "BPS 2015 – What you have been asking",
    "authors": [
        "Caroline Carman"
    ],
    "categories": [
        "CAP Reform"
    ],
    "pub_date": "2015-04-27T12:22:09+01:00",
    "content": [
        {
            "text": "The Rural Payments Agency offers a range of support to farmers looking to make their 2015 Basic Payments Scheme claims, including via a helpline."
        },
        {
            "text": "Open seven days a week (including the forthcoming May Bank Holidays) the helpline team is ready to provide answers to the questions you have on how to make your application."
        },
        {
            "text": "We have also had experts out presenting to farmers and agents at events and answering questions. We’ve quizzed them and found out what you have been asking about."
        },
        {
            "text": "The most common topics are sketch maps, ineligible features and where to find land use codes to complete your applications. If these are the questions you are also asking we have some answers for you here."
        },
        {
            "heading": 2,
            "text": "Sketch Maps"
        },
        {
            "text": "If you are growing two separate crops in the same field or have an Ecological Focus Area, there is no need to submit sketch maps for these as part of your application."
        },
        {
            "heading": 2,
            "text": "Ineligible features"
        },
        {
            "text": "Any new BPS permanent ineligible features that need to be deducted from column C4 can be done by completing both an RLE1 and sketch map. However if this is only a temporary ineligible feature for BPS then there is no need to complete an RLE1 form and sketch map. Just deduct the feature from the area shown in column C4 so you show the correct maximum area eligible for BPS."
        },
        {
            "heading": 2,
            "text": "Land use codes"
        },
        {
            "text": "As for land codes, all the codes you need to include as part of your application can be found in our useful ‘How to apply for the 2015 Basic Payment Scheme in England’ booklet (version 2). This can be found with all BPS guidance at GOV.UK/rpa/bps."
        },
        {
            "heading": 2,
            "text": "How to get help"
        },
        {
            "text": "Finally, don’t forget that help is just a phone call or computer click away. If you have any other questions on how to complete your claim the helpline can be called on 03000 200 301 seven days a week: 7am-6pm between Monday-Friday and 8am-4pm on weekends."
        },
        {
            "text": "Our helpline team will be happy to answer your questions. And if you find you need help to register on the Rural Payment service you can book an appointment via them at one of the 50 support centres available across the country. Why not use our interactive map to find out which one is closest to you?"
        }
    ]
}