{
    "url": "https://deframedia.blog.gov.uk/2024/10/08/coverage-of-ofwats-annual-water-company-performance-report/",
    "title": "Coverage of Ofwat’s annual Water Company Performance Report",
    "authors": [
        "defrablogs"
    ],
    "categories": [
        "water"
    ],
    "pub_date": "2024-10-08T13:39:12+01:00",
    "content": [
        {
            "text": "There has been widespread coverage this morning, including in The Guardian, Sky News and The Independent following the publication of Ofwat’s annual Water Company Performance Report today (8 October)."
        },
        {
            "text": "The report shows overall poor performance, with several companies falling short of key targets, including pollution reduction. As a result, Ofwat have imposed a total sector underperformance penalty of £157.6m on water companies. This means that customer water bills will be lower they otherwise would have been in 2025-26, with the exact amount to be finalised in December 2024."
        },
        {
            "text": "Ofwat’s report rates water companies across 12 metrics that cover three broad areas – environmental performance, customer services and drinking water. It categorises companies as ‘leading’, ‘average’ and ‘lagging’."
        },
        {
            "text": "This year, two out of the 15 English companies have been categorised as ‘lagging’.  For the second year in a row, no company has achieved the top rating, although four companies have improved their overall classification, moving from ‘lagging’ to ‘average’."
        },
        {
            "text": "Ofwat’s Chief Executive has warned companies that investment alone will not be enough to achieve a long-term improvement in performance, calling for changes in company culture and leadership."
        },
        {
            "text": "Following today’s report, the Environment Secretary is writing to the Chairs and CEOs of every water company laying out the performance improvements that he expects them to make in the coming year. "
        },
        {
            "text": "Secretary of State for the Environment, Food and Rural Affairs, Steve Reed said: "
        },
        {
            "text": " Follow Defra on Twitter, and sign up for email alerts here."
        }
    ]
}