{
    "url": "https://defradigital.blog.gov.uk/2024/10/08/defra-group-digital-and-data-transformation-strategy-how-were-making-our-services-better/",
    "title": "Defra group digital and data transformation strategy: how we’re making our services better",
    "authors": [
        "David Caldwell"
    ],
    "categories": [
        "Defra digital",
        "Defra services"
    ],
    "pub_date": "2024-10-08T09:28:29+01:00",
    "content": [
        {
            "text": "David Caldwell, Defra’s Deputy Director for Digital Transformation, provides an update on the work underway to transform digital services in Defra."
        },
        {
            "text": "It has been a while since we last shared what we’re doing to transform our services. I took up this role back in March and I’ve been leading the important work to ensure we deliver on the ambitious outcomes, including providing better services, set out in our Digital and Data Transformation Strategy."
        },
        {
            "heading": 2,
            "text": "A time to reflect"
        },
        {
            "text": "Having been in post for six months, I feel now is a good time to reflect on what we’ve achieved, the changes we’ve responded to and how we plan on continuing the good work to ensure we provide the very best outcomes for users."
        },
        {
            "text": "We’ve met the challenge of a new administration and a new mission-led approach head on. It’s been an exciting time to be part of government, and I have thoroughly enjoyed getting the opportunity to immerse myself in Defra and the incredible work we do to support diverse groups of people, from dairy farmers to pet owners, to homeowners facing the threat of flooding."
        },
        {
            "heading": 2,
            "text": "Senior service ownership"
        },
        {
            "text": "In Defra we’re testing a new approach to service ownership, as well as how we understand and map services. This is our priority, to better understand whole services, how they’re performing and how we’ll make strategic decisions about how best to deliver them to our users."
        },
        {
            "text": "In order to robustly test out a new approach of senior service ownership in Defra, we need to first understand all the services we provide and how they connect to form whole services that a user would recognise. For example, ‘plan and develop sustainably’ or ‘export plants abroad’."
        },
        {
            "text": "We can then look at how we make best use of the services, products and technologies we’re using to create that experience. This will enable us to better understand how whole services are performing and enable senior service owners to make informed decisions."
        },
        {
            "text": "As Sarah Hoy explained back in January, we’ve also got a number of other workstreams that we’re pursuing in order to transform our services. The Defra Forms work has made significant progress in the past six months, including transforming multiple paper forms into usable and accessible digital forms."
        },
        {
            "heading": 2,
            "text": "Understanding the complete picture is key"
        },
        {
            "text": "We continue to support our top nine services and have seen great progress towards meeting the ‘great’ standard. But only by gaining a full picture of what our services are, how they all connect from a user’s perspective and how senior service ownership can accelerate our performance, will we unlock true transformation and be able to meet our ambitious environmental outcomes."
        },
        {
            "text": "Over the remainder of this financial year, we’ll be focusing on understanding the extent of our services and creating consistency in how we describe, document and share maps about them. We’re also working closely with the other transformation programmes to demonstrate the value of understanding the full experience of our users, regardless of the part of Defra they interact with, or the individual services they use."
        },
        {
            "text": "Over the coming months we’ll share more about how we’re doing all of this and what we’re learning along the way. We’d love to connect across government to share knowledge and strengthen our network of people taking on similar opportunities. I hope that together we can really drive this critical work forward."
        },
        {
            "heading": 6,
            "text": "If you have ideas or knowledge from your own work transforming digital services that you’d like to share with David and the team, do get in touch."
        },
        {
            "text": "David Caldwell is Deputy Director for Digital Transformation in Defra."
        },
        {
            "text": "Check out our LinkedIn page for all the latest news, stories and job openings. While you're there, why not give us a follow."
        }
    ]
}