{
    "url": "https://defraenvironment.blog.gov.uk/2024/10/08/how-peatland-partnerships-are-transforming-and-restoring-degrading-landscapes-into-healthy-vibrant-peatlands/",
    "title": "How peatland partnerships are transforming and restoring degrading landscapes into healthy, vibrant peatlands",
    "authors": [
        "Sam Joyce"
    ],
    "categories": [
        "Land use",
        "Nature",
        "Peat"
    ],
    "pub_date": "2024-10-08T08:46:45+01:00",
    "content": [
        {
            "text": "England’s upland blanket bogs, lowland fens and valley mires are places of striking natural beauty. They are also valuable carbon dioxide stores and home to a rich variety of rare wildlife. When in good condition, these peatlands help fight climate change and provide wider environmental benefits."
        },
        {
            "text": "However, most of our peatlands are damaged and drying out, meaning they are emitting greenhouse gases instead of storing them."
        },
        {
            "text": "I'm Sam Joyce and I work in the Peatland Restoration policy team at Defra."
        },
        {
            "text": "We’re working to turn the tide on peatland degradation through the Nature for Climate Peatland Grant Scheme. This scheme funds local groups to rewet and restore damaged peatlands. We’ve previously written about what the scheme has achieved, and in this post, we’re going to discuss the importance of partnerships to this success."
        },
        {
            "text": "Taking a partnership approach"
        },
        {
            "text": "The success of peatland restoration requires a collaborative, landscape-scale approach."
        },
        {
            "text": "As a result, peatland partnerships have formed across England’s major peatlands areas. These partnerships are place-based coalitions of National Parks, National Landscapes, environmental charities and other groups united by a passion for restoring peatland. They coordinate conservation efforts at a regional level, and act as local champions for peatland restoration. "
        },
        {
            "text": "Partnerships in action"
        },
        {
            "text": "Being in the team that oversees peatland restoration delivery in England, I’ve been lucky enough to visit partnerships all around the country. I’ve seen first-hand how peatland partnerships work with farmers and landowners to use grant funding to restore habitats, lock in carbon dioxide and improve biodiversity."
        },
        {
            "text": "Moors for the Future are one of the oldest peatland partnerships in England and have been restoring degraded moorland in the Peak District and South Pennines for over 20 years. On a site visit last year, I saw how they had transformed a vast expanse of bare peat, scarred by acid rain from the industrial revolution, into a vibrant, healthy blanket bog, rich in peat forming sphagnum moss."
        },
        {
            "text": "(Sphagnum is a genus of approximately 380 accepted species of mosses, commonly known as bog moss. They store water and help create peat bogs.)"
        },
        {
            "text": "On a different visit, to Dartmoor, I learnt about the challenge the Southwest Peatland Partnership were experiencing with unexploded ordinance. They are restoring peat on an active firing range. Their approach brings together landowners and graziers so that everyone can benefit. I enjoyed seeing tonnes of stone being carried over the moor by helicopter to block drainage channels, raise the water table and restore the bog. "
        },
        {
            "text": "The peatland partnership in the North Pennines National Landscape is aiming to restore some of the most remote and heavily drained peatlands in England. Over the winter, I visited some of their sites and saw first-hand the expertise of the partnership staff. They play an important role in planning and directing works on the ground, working with contractors like Jonny, who previously wrote about a day in his life for this blog."
        },
        {
            "text": "And on a visit to Dorset Peat Partnership, I learnt about the challenges around maintaining peatlands near urban areas. Peatlands are vulnerable to wildfire, and the risk of this is increased near population centres because of activities like barbecues and bonfires. The site I visited had suffered a significant fire in 2022, and local partners had installed a fire hydrant system to mitigate further blazes. Urban peatlands also face pressure from increased recreation, and housing expansion."
        },
        {
            "text": "Most recently, I travelled up to Hadrian’s Wall to meet one of the newer partnerships: Northumberland Peat Partnership. They have surveyed thousands of hectares of habitat, laying the groundwork for restoration projects. This autumn, they are working with a local farmer to restore a degraded bog with funding from the Countryside Stewardship scheme. Farming schemes will play a pivotal role in supporting the restoration of peat and helping us meet our net zero targets."
        },
        {
            "text": "Shared principles"
        },
        {
            "text": "Despite the different contexts peatland partnerships are operating in, what these organisations do have in common is a real passion and expertise for their work. The staff employed by the partnerships are trusted local experts and have an invaluable role throughout the restoration process."
        },
        {
            "text": "They engage landowners and bring them along the restoration journey, they apply for funding, carry out surveys, plan out and monitor restoration works. Without their dedication and enthusiasm, much of the peatland restoration work across the country would never have happened. "
        },
        {
            "text": "Looking ahead"
        },
        {
            "text": "As the Nature for Climate Peatland Grant scheme comes to an end, partnership working will continue to drive forward progress on peatland restoration. Peatland partnerships will have an important role to play in supporting farmers and landowners to effectively restore peatland through Environmental Land Management schemes such as Landscape Recovery."
        },
        {
            "text": "If you're interested in reading more stories like this one, please subscribe to receive an email notification whenever a new post is published."
        }
    ]
}