{
    "url": "https://ukhsa.blog.gov.uk/2024/10/08/marburg-virus-disease-what-you-need-to-know/",
    "title": "Marburg virus disease: what you need to know",
    "authors": [
        "Blog Editor"
    ],
    "categories": [
        "Global health"
    ],
    "pub_date": "2024-10-08T10:00:45+01:00",
    "content": [
        {
            "text": "You may have seen reports about a rise in cases of Marburg virus disease in Rwanda, which we are monitoring closely. "
        },
        {
            "text": "Marburg virus belongs to the filovirus family, along with Ebola. It can cause haemorrhagic fever, meaning it can damage blood vessels and cause bleeding, and its presentation can be hard to distinguish from Ebola virus disease. "
        },
        {
            "text": "It can cause people to become very poorly and while it has a high fatality rate, it does not spread easily. "
        },
        {
            "heading": 2,
            "text": "The symptoms of Marburg virus and how it spreads"
        },
        {
            "text": "Symptoms of Marburg generally appear between 3 to 21 days after close exposure to an infected person. "
        },
        {
            "text": "The symptoms include: severe headache, feeling weak, fever, watery diarrhoea, abdominal pain, bleeding from different sites including under the skin, feeling sick and being sick."
        },
        {
            "text": "It is spread through very close contact with the blood, bodily fluids or secretions from an infected person. This can be from direct contact or from a surface. "
        },
        {
            "heading": 2,
            "text": "The current situation in Rwanda and our response"
        },
        {
            "text": "The outbreak in Rwanda was confirmed in late September 2024 and there have been some deaths. This is the first documented outbreak of Marburg virus in Rwanda and authorities there are investigating its source. Close contacts of cases in Rwanda are being identified and followed up for 21 days. "
        },
        {
            "text": "UKHSA, the NHS and partner organisations have well tested capabilities to detect, contain and treat novel infectious diseases, and healthcare professionals are equipped and prepared to respond to any confirmed cases in this country."
        },
        {
            "heading": 2,
            "text": "Advice for travellers"
        },
        {
            "text": "If you are travelling to Rwanda, stay informed by regularly visiting the Travel Health Pro website for up-to-date information on the areas affected and on precautions you can take to protect yourself and others."
        },
        {
            "text": "If you become ill within 21 days of returning home from Rwanda, Call NHS 111 or contact your GP by phone. Although it is very unlikely you have Marburg virus disease, you should mention your dates and itinerary of travel and any potential exposure to the virus."
        }
    ]
}