{
    "url": "https://buyingforschools.blog.gov.uk/2024/10/08/my-experience-of-using-get-help-buying-for-schools-to-buy-multi-functional-devices-and-more/",
    "title": "My experience of using Get help buying for schools to buy multi-functional devices and more",
    "authors": [
        "Jacqui Whiting, Procurement and Contracts Manager at Our Lady of the Magnificat Multi-Academy Company (MAC"
    ],
    "categories": [
        "Uncategorized"
    ],
    "pub_date": "2024-10-08T10:27:34+01:00",
    "content": [
        {
            "text": "Jacqui Whiting is Procurement and Contracts Manager at Our Lady of the Magnificat Multi-Academy Company (MAC), a family of 17 schools across Warwickshire and Worcestershire.  Jacqui used Get help buying for schools to buy multi-functional devices (MFDs), grounds maintenance and catering services."
        },
        {
            "text": "My role is to manage procurement and contracts across all our MAC schools. I previously worked as a school business professional in several local primary schools, one of which joined the MAC. I’m relatively new to this role in a large multi-academy company. I am currently working to bring all school contracts in line and centralise to share best practice, achieve economies of scale, increase efficiencies, standardise systems and processes, and manage and compare spending."
        },
        {
            "text": "The first contract to be addressed was MFDs. I had been doing some research on running larger, more complex procurement projects when, I came across the Get help buying for schools and decided to get in touch."
        },
        {
            "text": "I spoke to one of the team within a few days of submitting my initial enquiry and I was impressed with the service right from the start. It was the first time I was leading on a large, complex MFD procurement project. Straight away, through the questions that were posed, the team offered valuable insight as to the work needed to initiate this tender exercise."
        },
        {
            "text": "They went on to support me at every stage of the procurement process. They asked more questions – lots of them! They provided a fresh pair of eyes when it was time to issue the ITT and we did a huge amount of work together to check (and re-check!) the detail of the document. Training was provided on how to evaluate bids, which was a real learning curve but provided reassurance that we had done everything correctly and would be well prepared in the event of any challenge."
        },
        {
            "text": "After a robust tendering process, supported by Get help buying for schools we awarded the contract successfully. The contract replaced multiple school contracts with one single MAC agreement that brought all the varying contract end dates to one end date. Schools with contracts expiring during the contract period were able to join the contract upon expiry of their current contract."
        },
        {
            "text": "We are now working with Get help buying for schools on two other tenders. We have just evaluated grounds maintenance; a complicated project involving all 17 schools, with differing requirements. We are also retendering the catering contracts across 12 of our schools, again with a view to bring consistency across the organisation."
        },
        {
            "text": "Working with the service has been, and continues to be, such a positive experience. They’ve asked important questions to support our work and challenged me to think differently about what our requirements really are. The team act on the MAC’s behalf, ensure we are treated fairly, offer guidance and support at any stage during the process, and provided valuable insights to different frameworks and service providers available."
        },
        {
            "text": "The main benefit has been the expert advice provided by the service - this was what I needed most. I couldn’t believe this service was provided free of charge, allowing us to save further."
        },
        {
            "text": "I would highly recommend Get help buying for schools because I’ve been so happy with the service I’ve received. Put simply, this free service has helped us do what we want to do. This gives time back to our schools and ultimately our young people, the reason we come to work every day."
        },
        {
            "text": "If you’ve found this article useful and want to learn more about how we’re supporting schools, click ‘sign up and manage updates’ to subscribe to our blog and receive notifications when we next post."
        }
    ]
}