{
    "url": "https://defrafmp.blog.gov.uk/2024/10/08/online-surveys-to-share-fisheries-management-plan-views/",
    "title": "Online surveys to share fisheries management plan views",
    "authors": [
        "​​Gordon Chittenden - Principal Fisheries Manager, Marine Management Organisation​",
        "​​Rachel Thirlwall - Principal Fisheries Manager, Marine Management Organisation​",
        "Nicholas French - Principal Fisheries Manager, Marine Management Organisation"
    ],
    "categories": [
        "Black seabream FMP",
        "Celtic Sea and Western Channel demersal FMP",
        "Wrasses complex FMP"
    ],
    "pub_date": "2024-10-08T16:00:00+01:00",
    "content": [
        {
            "text": "The Marine Management Organisation’s fisheries management plan (FMP) team has launched a pair of online surveys as they shape up engagement on the current state and future management of a range of key fisheries to engage stakeholders on the current state and future management of a range of key fisheries. "
        },
        {
            "text": "One survey covers the wrasses complex FMP and black seabream FMP and the other focuses on the Celtic Sea and Western Channel demersal FMP. "
        },
        {
            "text": "We are keen to gain a better understanding of the challenges that sea anglers and commercial fishers experience with these fisheries, as well as identifying opportunities, actions and potential management measures that could help over the coming years. "
        },
        {
            "text": "Feedback will also help identify where there are gaps in knowledge and data. "
        },
        {
            "text": "For wrasses and seabream, we will use the survey data to identify a wider group of stakeholders to participate in further rounds of engagement as the FMPs develop. "
        },
        {
            "text": "Stakeholders’ views are vital to developing these FMPs so please take this chance to share your concerns and ideas before the surveys close on 31 January 2025. "
        },
        {
            "text": "Engagement events will be held with interested stakeholders over the coming months so please keep an eye on the blog and MMO’s social media for dates and how you can take part. "
        },
        {
            "text": "For seabream, the FMP focuses on black seabream and gilthead bream in English waters. "
        },
        {
            "text": "For the wrasses complex FMP, the key species are ballan wrasse, corkwing wrasse, goldsinny wrasse, rock cook wrasse and cuckoo wrasse in English waters. "
        },
        {
            "text": "The Celtic Sea and Western Channel demersal FMP focuses on Welsh and English waters (ICES areas 7e, 7f, 7g, 7h) and includes stocks such as pollack, cod, monkfish/anglerfish, nephrops and skates and rays.  "
        }
    ]
}