{
    "url": "https://aphascience.blog.gov.uk/2024/09/19/advancing-avian-disease-diagnosis-in-ghana/",
    "title": "The power of collaboration: advancing avian disease diagnosis in Ghana ",
    "authors": [
        "Cecilia Tat"
    ],
    "categories": [
        "International",
        "Viral diseases"
    ],
    "pub_date": "2024-09-19T09:40:54+01:00",
    "content": [
        {
            "text": "Recently, Drs Joshua Lynton-Jenkins, Joe James and Cecilia Tat visited the Accra Veterinary Laboratory (AVL) in Ghana to provide a training workshop on sequencing techniques used for identifying avian viruses. The visit was part of a wider International Biosecurity Program, aiming to upskill laboratories across West Africa in Avian influenza and Newcastle disease diagnosis."
        },
        {
            "text": "The avian influenza virus (AIV) and Newcastle disease virus (NDV) are responsible for highly contagious respiratory infections in birds, with certain strains leading to mortality rates, reaching as high as 100%. Due to their severe impact, both viruses are categorised as notifiable diseases, necessitating that any confirmed cases of highly pathogenic strains be reported to the World Organisation for Animal Health (WOAH)."
        },
        {
            "text": "AIV and NDV have maintained presence in the West Africa region, with wild birds playing an important role in this, as the region is a key part of the East Atlantic and Black Sea/Mediterranean migratory routes. These diseases pose serious risks in the region, impacting both chicken flocks and wild bird populations, leading to widespread mortality and substantial commercial losses. Moreover, certain strains of AIV can infect humans, making it crucial to enhance our knowledge of the circulating strains to protect global human health and ensure food security."
        },
        {
            "text": "For years, APHA has worked with multiple countries in supporting and strengthening diagnostics of AIV, NDV and swine influenza through the International Reference laboratory, accredited by WOAH and FAO."
        },
        {
            "text": "In Ghana, the AVL had recently benefited from a WOAH twinning project led by the National Centre for Foreign Animal Disease (NCFAD) in Winnipeg, Canada. This provided the laboratory with state-of-the-art sequencing equipment and highlighted the need for additional specialised training. APHA scientists ran a workshop on sequencing of AIV and NDV samples, using whole-genome sequencing (WGS) technology developed by Oxford Nanopore Technologies (ONT)."
        },
        {
            "text": "Through WGS of samples, we can better understand the connections of viruses from different geographical areas or time periods. This technique allows us to analyse the genetic makeup of the identified viruses and pinpoint potential risks to other species, including humans. This is why WGS is an important tool in molecular epidemiology, playing a vital role in both research initiatives and the investigation of disease outbreaks."
        },
        {
            "text": "Our goal was to provide this training over four days. Workshop participants ranging from research, government and laboratory staff, attended the hands-on-training to learn how to perform the ONT sequencing technique. Everyone took part in every phase of the process, exploring the applications and benefits of ONT sequencing in diagnosing and researching national AIV and NDV samples. Despite facing occasional power outages caused by heavy rainfall, the group demonstrated remarkable resilience and dedication, continuing to work effectively through the challenges."
        },
        {
            "text": "The participants showed remarkable engagement throughout the training, clearly eager to maximise their learning experience. At the end of the workshop, Dr Emmanuel Allegye-Cudjoe, Ghana’s Chief Veterinary Officer, delivered a closing speech that emphasised the importance of developing the AVL’s skills in advanced molecular techniques."
        },
        {
            "text": "We received positive feedback throughout the workshop from participants who thought that it was very helpful and an eye-opening experience. In the end, the only critical feedback we received was a wish from one participant that the workshop could have lasted longer!"
        },
        {
            "text": "While in Accra, the team also took the opportunity to tour the laboratory site to learn more about local activities on surveillance of different endemic and notifiable diseases, which was very insightful. Moving forward, the International Reference Laboratory for AI/NDV and the International Development team are committed to ongoing collaboration with Ghana, and we aspire to extend our support for AIV and NDV diagnostics to other countries in the region."
        },
        {
            "text": "We give special thanks to Accra Veterinary Laboratory and the British High Commission in aiding the delivery of this workshop."
        }
    ]
}