{
    "url": "https://environmentagency.blog.gov.uk/2024/09/19/get-the-most-out-of-a-visit-to-a-beach-lake-or-river/",
    "title": "Get the most out of a visit to a beach, lake or river ",
    "authors": [
        "josiestoneman"
    ],
    "categories": [
        "Uncategorized"
    ],
    "pub_date": "2024-09-19T15:01:06+00:00",
    "content": [
        {
            "text": "In this blog, we explain where you can find information to help inform your decisions on where and when to bathe and how we monitor bathing water quality over the summer months.  "
        },
        {
            "text": "TOP TIP: Check water quality by visiting Swimfo before heading to a beach, lake or river "
        },
        {
            "text": "To get the most out of your visit to a beach, lake or river, check out the Environment Agency’s free Swimfo service for the latest information on 451 designated bathing waters across England. When a bathing water is designated, it means it’s monitored according to bathing water regulations. Designated bathing waters are sampled by the Environment Agency during the bathing water season which runs from May to the end of September, when most bathers are expected there. Importantly, designation also means that information is provided to the public to help inform decisions on where and when to bathe.  "
        },
        {
            "text": "It is important to note that designation does not guarantee clean water for swimming. Any newly designated bathing water will be monitored over the bathing season in order to produce a classification. There are four bathing water classifications: Excellent, Good, Sufficient and Poor. "
        },
        {
            "text": "On Swimfo, you can search by name or location to look for any incidents or predictions of reduced water quality levels, as well as review whether a bathing water is classed as Excellent, Good, Sufficient or Poor. Annual classifications are based on up to four years' worth of data. This helps you understand what water quality is typically like and means you can compare between sites as well. "
        },
        {
            "text": "Swimfo also shows water quality sample results. From May to the end of September, more than 7,000 water samples will be taken by the Environment Agency and the results fed into Swimfo. Water samples taken from designated bathing waters are sent off to the Environment Agency’s lab and tested for two types of bacteria, E coli and intestinal enterococci which will show if there is any faecal matter in the water. The most common sources of faecal matter are from certain types of livestock, urban drainage and sewage, but it can also come from birds, wildlife and pets. "
        },
        {
            "text": "In addition, we provide a service through Swimfo called pollution risk forecasting. This lets you know that on some days at some sites, water quality can be temporarily reduced due to factors such as rainfall, wind and high tides. Water users may be at a higher risk of becoming ill when using a bathing water at this time. "
        },
        {
            "text": "Swimfo is an excellent source of information to use ahead of an open water swim, when going on holiday or enjoying a day out during the summer. Bathing water quality has significantly improved over the last three decades, but we know there is much more to do. "
        },
        {
            "text": "TOP TIP: Understand the risks "
        },
        {
            "text": "Of course, as open water swimming gains popularity, many people enjoy time in or on lakes and rivers and places around our coasts which are not designated bathing water sites. These places are managed for the purpose of protecting fish and wildlife, not people, so don’t need to achieve bathing water bacterial standards. It’s important to recognise that health risks from using these locations may be higher than at designated bathing waters. Rivers are closer to sources of bacteria than the sea, and don’t have the benefit of dilution that occurs by the time bacteria reach the sea. "
        },
        {
            "text": "Visit Swimfo for more information, or Swim Healthy which includes further advice from UKHSA for before, while and after you swim.  "
        },
        {
            "text": "For wider advice about safe swimming and water use, follow guidance from police, Public Health England, the Royal Society for the Prevention of Accidents, Royal Lifesaving Society UK and the Royal National Lifeboat Institution. Their messages are clear: vigilance can save lives, and water-related accidents can be avoided by knowing how to stay safe. The Environment Agency, which manages many locks, weirs and bridges across England, wants people to remember the hazards under the water in rivers while spending time with friends and family. People should not jump or dive into water and stay away from weirs, locks and pipes. There can be unseen hazards in the water, and cold-water shock can affect even strong swimmers on warm days. If you’re swimming in waters with boats, keep a look out for boat traffic, stay vigilant, and take steps to enhance your visibility. "
        }
    ]
}