{
    "url": "https://ruralpayments.blog.gov.uk/2024/09/19/get-funding-to-improve-animal-health-and-welfare-your-questions-answered/",
    "title": "Get funding to improve animal health and welfare - your questions answered",
    "authors": [
        "RPA Editor"
    ],
    "categories": [
        "Grants",
        "Health and welfare grant"
    ],
    "pub_date": "2024-09-19T16:52:05+01:00",
    "content": [
        {
            "text": "On 19 June we introduced the new get funding to improve animal health and welfare service providing eligible keepers of cattle, sheep and pigs with access to two different types of funded vet visits;"
        },
        {
            "text": "We’ve been listening to feedback from farmers and vets since the service launched and have written this blog to provide answers to some common questions that have been raised. We hope this will help farmers to get the most out of the support available."
        },
        {
            "text": "Please also take the time to read the guidance on GOV.UK - https://www.gov.uk/government/collections/funding-to-improve-animal-health-and-welfare-guidance-for-farmers-and-vets"
        },
        {
            "text": "I signed up for an annual health and welfare review before 19 June. What should I do?"
        },
        {
            "text": " If you’ve already had your review, you should:"
        },
        {
            "text": "If you have not had your review, you could:"
        },
        {
            "text": "You may have a follow-up in the expanded service within 10 months of the review. If your review claim was rejected, you can apply for a new agreement in the expanded service. You must wait until 10 months after the date of your last review before doing a new review. This is the date the vet last visited your farm for the review."
        },
        {
            "text": "What is the ‘vet summary’ that a farmer needs to provide when they’re claiming funding?"
        },
        {
            "text": "The vet summary is a document that contains the specific information that the vet must provide a farmer after each review and follow-up visit. This allows the farmer to complete a claim for funding."
        },
        {
            "text": "Full information about what's required in a vet summary is set out in the official guidance on GOV.UK:"
        },
        {
            "text": "The guidance includes a standard template for a vet summary for each type of visit. Vets don’t have to use this template, but it is intended to make sure no important information is missed.  "
        },
        {
            "text": "You can download these templates by following the relevant links below: "
        },
        {
            "text": "When can I arrange my first vet visit?"
        },
        {
            "text": "Once your application has been processed you will be offered an agreement which you must accept before arranging a vet visit.  "
        },
        {
            "text": "Any visit carried out before the date you accepted your agreement will not be eligible for funding under the scheme."
        },
        {
            "text": "How much time do I need to leave between each visit?"
        },
        {
            "text": "As part of the service farmers can have up to three review visits and three follow-up visits before 19 June 2027. The experiences of farmers and vets show that maintaining regular visits ensures farmers get the maximum benefit from the support available."
        },
        {
            "text": "To help plan your visits we have three rules covering how visits should be sequenced. It’s important to make sure your visits comply with these rules as otherwise you may not be eligible for a funded visit."
        },
        {
            "text": "You must: "
        },
        {
            "text": "Every farmer’s calendar is different. You can carry out your visits at any time of the year if they comply with these timing rules, and any other specific requirements set out in the guidance on GOV.UK. "
        },
        {
            "text": "You may find it helpful to plan your visits to make sure they fit these rules. An example of a three-year schedule of visits that would comply with this timeline is shown below: "
        },
        {
            "text": "If you have any queries which were not covered in this blog, please read the full guidance on GOV.UK. If you can’t find the answer to your query, please call us on 03000 200 301 or send an email to ruralpayments@defra.gov.uk.   "
        }
    ]
}