{
    "url": "https://mhclgmedia.blog.gov.uk/2024/09/19/major-step-forward-in-governments-devolution-revolution-as-new-powers-agreed-for-english-regions/",
    "title": "Major step forward in government’s devolution revolution as new powers agreed for English regions",
    "authors": [
        "mhclgpress"
    ],
    "categories": [
        "Devolution"
    ],
    "pub_date": "2024-09-19T15:39:07+01:00",
    "content": [
        {
            "text": "There has been widespread coverage of the government’s announcement this week that four devolution agreements will progress in Hull and East Yorkshire, Greater Lincolnshire, Lancashire, and Devon and Torbay."
        },
        {
            "text": "Subject to parliamentary approval and local consent, the devolution agreements will mean local leaders can make decisions that benefit their communities and harness the unique potential of their areas."
        },
        {
            "text": "The deals will mean Hull and East Yorkshire and Greater Lincolnshire will have elected mayors, with elections planned for May 2025, while combined county authorities will be established in Lancashire and Devon and Torbay."
        },
        {
            "text": "The announcement received substantial and widespread positive coverage in regional media, including a front-page splash and supportive editorial in the Yorkshire Post. The paper featured an exclusive quote from the Deputy Prime Minister who described it as the ‘final piece in the jigsaw’ for devolution in Yorkshire."
        },
        {
            "text": "BBC News reported on all four devolution deals, including supportive quotes from local leaders and the Deputy Prime Minister’s comment that the deals were all about “rebalancing the power between Westminster and our communities”. There was further positive coverage of various aspects of the announcement by Business Live, BBC Devon, BBC Lancashire, Local Government Chronicle,Burnley Express,Lancashire Evening Post,Lancs Live,Hull Live,Blackpool Gazette, Grimsby Live,Lincolnshire Today, Lincolnshire World, Lincs Online, Lincolnshire Live and the Northern Agenda newsletter. Regionalised quotes from the Deputy Prime Minister for each devolution deal were carried."
        },
        {
            "text": "The announcement also received widespread positive broadcast coverage. The story featured on BBC Breakfast and Times Radio as well as BBC Devon, BBC Lancashire, BBC Humberside and other regional BBC radio stations. Heart, Viking FM, Capital, Rock FM and Smooth also covered the announcement."
        },
        {
            "text": "The government has also confirmed that it is minded to progress with the four non-mayoral 'Level 2' Single Local Authority devolution agreements with Cornwall Council, Buckinghamshire Council, Warwickshire County Council, and Surrey County Council, subject to further statutory tests being met."
        },
        {
            "text": "Deputy Prime Minister Angela Rayner said: “This is only the first step of our major ambition to drive forward our devolution revolution, and ensure we empower more communities and strengthen the existing powers of our brilliant mayors.”"
        }
    ]
}