{
    "url": "https://deframedia.blog.gov.uk/2024/09/19/misleading-coverage-on-the-water-special-measures-bill/",
    "title": "Misleading coverage on the Water (Special Measures) Bill",
    "authors": [
        "Defra Press Office"
    ],
    "categories": [
        "Uncategorized"
    ],
    "pub_date": "2024-09-19T10:52:05+01:00",
    "content": [
        {
            "text": "There has been misleading coverage in The Daily Telegraph relating to the Water (Special Measures) Bill. The article claims the Government is “planning to allow water bills across the country to be raised to pay for a Government bailout of Thames Water”."
        },
        {
            "text": "This is not the case. The government has no plans to raise customer bills as a result of the unlikely event of a Special Administration Regime (SAR)."
        },
        {
            "text": "The Water (Special Measures) Bill includes a new provision to protect taxpayers. It will enable the Government to recover any shortfall resulting from a Special Administration Regime."
        },
        {
            "text": "The new powers will ensure an effective, efficient SAR for the water sector – bringing it into line with Special Administration Regimes in other essential service sectors such as energy. "
        },
        {
            "text": "The Secretary of State has been clear he will always act to protect consumers as a priority. These powers would never be used to pay bondholders, shareholders or creditors."
        },
        {
            "text": "A Special Administration Regime (SAR) enables a company which provides vital public services (e.g. water, energy, rail) to be put into administration to ensure that the public service will continue to be provided pending rescue or transfer to new owners. There is a high bar for the imposition of a SAR. If a water company were to become insolvent, the use of a SAR would ensure that there is no disruption to customers’ water or wastewater services.  "
        },
        {
            "text": "The Telegraph article also contains figures estimating the cost of a SAR – we do not recognise nor endorse any of these figures."
        },
        {
            "text": "A Defra spokesperson said:"
        },
        {
            "text": "“This is highly sensationalist. We have no plans to raise bills as a result of the unlikely event of a Special Administration Regime and we do not expect customers to pay the price for water companies’ mismanagement."
        },
        {
            "text": "“The new measures in the Water Bill will protect taxpayers. This Government will always act to protect customers and the public.”"
        },
        {
            "text": "Follow Defra on Twitter, and sign up for email alerts here."
        }
    ]
}