{
    "url": "https://cddo.blog.gov.uk/2024/09/19/the-civil-service-data-challenge-an-exhilarating-grand-finale/",
    "title": "The Civil Service Data Challenge: An exhilarating grand finale",
    "authors": [
        "Central Digital and Data Office"
    ],
    "categories": [
        "CDDO",
        "Cross-government strategy",
        "Data",
        "Digital transformation",
        "Government Digital and Data"
    ],
    "pub_date": "2024-09-19T09:23:00+01:00",
    "content": [
        {
            "text": "Now in its third year, the Civil Service Data Challenge is a competition that is open to all civil servants, in any department, or at any grade. Competitors are invited to submit data-led project ideas or join a team, to offer a solution to a technical issue or societal challenge. The best idea will receive £50,000-worth of technical support and the backing of senior leaders, pushing it down the road towards implementation; and every participant will gain new skills, experiences and contacts."
        },
        {
            "text": "The grand finale took place in London last week and saw the four teams pitch their ideas one last time to an array of judges from across government and beyond. Each team outlined their data-led solution and the next steps for making it a reality followed by 15 mins Q&A by the judges. "
        },
        {
            "heading": 3,
            "text": "The finalists "
        },
        {
            "text": "You can learn more about the route to the final and detail on the four finalists in a recent blog, but a quick recap they include:"
        },
        {
            "text": "GENIE: Streamlining the NHS-DWP death data exchange, entered by Corey Lankovits, Lead Service Designer, from the Department for Work & Pensions, in conjunction with the NHS. This project will automate how data surrounding deceased individuals is shared between the NHS and DWP. It will reduce overpaying any benefits, stop civil servants from contacting partners to recover any extra payments, and streamline systems. "
        },
        {
            "text": "Project Constellation: optimising prison space management, submitted by John Saunders, Product Manager, from the Ministry of Justice. The scheme sets out to use algorithms and data analytics to create a prison system that predicts, in real-time, when and where prison spaces will become available."
        },
        {
            "text": "RoutePlanner: NHS geospatial planning tool, submitted by Paul Caroll, Principal Data Scientist, from the Department of Health and Social Care. This tool will use open-source software and publicly accessible datasets to support NHS workers, in planning visits to patients’ homes, reducing emissions from travel, and ensuring wider coverage across GP practices."
        },
        {
            "text": "POSUM: Policy summarisation with Gen AI, submitted by a colleague from the Home Office. This project will introduce generative AI to revolutionise how governmental agencies harness data, by strengthening staff tools, minimising administration time, as well as saving taxpayers’ money and improving outcomes for citizens."
        },
        {
            "heading": 3,
            "text": "And finally, the winners"
        },
        {
            "text": "All four finalists demonstrated enormous passion for their area and uniquely compelling arguments, with much discussion the seven judges whittled it down to a decision between two teams - with Project Constellation achieving first place. "
        },
        {
            "text": "The Project Constellation team was made up of colleagues from the Ministry of Justice, Ofgem, Ministry of Defence and the Department for Business and Trade."
        },
        {
            "text": "The team was led by John Saunders, Product Manager, from the Ministry of Justice. The winning entry focused on using algorithms and data analytics to create a prison system that predicts, in real-time, when and where prison spaces will become available."
        },
        {
            "text": "The judging panel included Vicki Chauhan, Head of Public Sector, NTT DATA UK (Chair of Judges); Simon Bourne, Chief Digital, Data and Technology Officer (CDDaTO), Home Office; Gina Gill, Chief Strategy Officer, at CDDO; Sue Bateman, Chief Data Officer, DEFRA; Fiona James, Chief Data Officer & Director of Data Growth & Operations, ONS; Aydin Sheibani, Chief Data Officer, HMRC; and John Quinn, CIO, NHS England."
        },
        {
            "text": "The Civil Service Data Challenge is led by the Global Government Forum, NTT Data, Cabinet Office and ONS."
        }
    ]
}