{
    "url": "https://geospatialcommission.blog.gov.uk/2024/09/19/the-un-ggim-14th-session-flying-the-flag/",
    "title": "The UN-GGIM 14th session: Flying the Flag",
    "authors": [
        "Isabella McGuinness, Senior Policy Advisor, Geospatial Commission"
    ],
    "categories": [
        "Data",
        "International"
    ],
    "pub_date": "2024-09-19T16:45:45+01:00",
    "content": [
        {
            "text": "Isabella McGuinness, Senior Policy Advisor at the Geospatial Commission, shares her experience attending the UN Committee of Experts on Global Geospatial Information Management (UN-GGIM) 14th Session in New York. "
        },
        {
            "text": "The United Nation’s Committee of Experts on Global Geospatial Information Management’s (UN-GGIM) operates under a formal mandate from the United Nations (UN) Economic and Social Council. UN-GGIM's mission is to make accurate, reliable and authoritative geospatial information readily available to support national, regional and global developments. "
        },
        {
            "text": "The Fourteenth Session of UN-GGIM took place from 5th to the 9th of August, UN-GGIM hosted at the UN Headquarters in New York. I was looking forward to a week of fruitful discussions which started with a series of side events and finished with the formal 14th session which saw 75 Member States discussing and agreeing the meeting agenda items. "
        },
        {
            "text": "The UK has played an active role within UN-GGIM from its original concept through to its growth and development into the leading forum to discuss geospatial information on a global state. The UK delegation was made up of representatives from Ordnance Survey and the Geospatial Commission and is an opportunity for the UK to demonstrate geospatial leadership and capability.  Ordnance Survey acts as the Secretariat for the UK Delegation, leads and coordinates UK involvement, and acts as Head of UK Delegation during the Committee of Expert meetings on behalf of the Geospatial Commission. "
        },
        {
            "text": "The side events at the start of the week included the meeting of the High-level Group for their Fourth Plenary meeting. The High-level Group leads the Committee of Experts work on the UN Integrated Geospatial Information Framework (UN-IGIF) and provides strategic guidance which enables countries to prepare and implement geospatial action plans. "
        },
        {
            "text": "Onto the formal 14th session, there were a lot of discussions and sharing of knowledge and experiences amongst the Member States.  "
        },
        {
            "text": "Over the three days, the UK delegation made four interventions on the following topics:​ "
        },
        {
            "text": "Highlights: "
        },
        {
            "text": "UN-GGIM is a globally important forum to enable countries to work together as a collective to promote all things geospatial and share knowledge. It is also an opportunity to create and strengthen connections with other which as I mentioned earlier, was one of my highlights. A key thing I took from the week is that there is a need for collaboration within our ecosystem.  "
        },
        {
            "text": "On behalf of the UK delegation, I would like to thank the UN-GGIM Secretariat, Bureau, Co-Chairs and all Member States on a successful 14th session and I look forward to contributing to future deliverables.  "
        },
        {
            "text": "For more information on the UN-GGIM 14th session, please visit the UN-GGIM website.  "
        },
        {
            "text": "You can also sign up to get an email notification every time we publish a new blog post. For more information about this and other news see our website, or follow us on LinkedIn and X (formerly Twitter). "
        }
    ]
}