{
    "url": "https://forestrycommission.blog.gov.uk/2024/09/19/unlocking-potential-products-people-and-possibilities/",
    "title": "Unlocking potential: products, people and possibilities",
    "authors": [
        "Emma Bramley"
    ],
    "categories": [
        "Events"
    ],
    "pub_date": "2024-09-19T13:21:33+01:00",
    "content": [
        {
            "text": "The future of forestry lies in its ability to adapt and innovate through its products, people and possibilities. Each year the National Forestry Conference, organised by the CLA, Forestry Commission and Grown in Britain covers a highly topical theme."
        },
        {
            "text": "So set aside the 9 October in your diary and grow your business this autumn!"
        },
        {
            "text": "This will be my second year as part of organising team. A couple of years in terms of forest and woodland rotations is no time at all, but the day is truly a collaborative effort and I’m alongside lots of experienced conference planners. So, I’m excited to be here in a front row seat, helping to make it happen."
        },
        {
            "text": "On the day, the Forestry Minister, Mary Creagh, will be on stage as our keynote speaker to tie products, people and possibilities for forestry together, and share her views. Here’s what to expect from some of the speakers that will be joining us:"
        },
        {
            "heading": 2,
            "text": "Products: more than just timber"
        },
        {
            "text": "Forestry products extend beyond timber, offering a wide range of resources that benefit industry and community alike. From construction materials to sustainable innovations, forests deliver value in unexpected ways."
        },
        {
            "text": "The day will start by exploring this very topic. Richard Stanford and Anna Brown will speak about how the Forestry Commission plays its part in creating and maintaining thriving, resilient treescapes that provide sustainable products, not only for today but for the future. Forest Research’s Adam Ash will talk about a recently published report looking at the timber properties of larch as well as exciting upcoming research projects."
        },
        {
            "text": "Neil Macdonald, Forestry Commission Woodland Ambassador, will talk about diversification and how to create a thriving multi-layered business operation. He has combined timber and fruit production with ways to create non-timber income whilst the crop is maturing. Neil will cover how the businesses on farm complement each other, and how he’s inviting people on to his land to benefit from trees."
        },
        {
            "heading": 2,
            "text": "People: the heart of forestry"
        },
        {
            "text": "Forests are spaces that connect people to nature and each other. People in forestry are central to managing, preserving and innovating in these landscapes."
        },
        {
            "text": "John Deakin, Head of Trees and Woodlands at the National Trust, will speak about building connections between people, nature and woodlands. We’ll also hear from Guy Neville of Birling Estate about the ways people can be enthused by trees and their products and how they’ve created a house design as part of a research project using sweet chestnut coppice to demonstrate the importance of trees in construction."
        },
        {
            "text": "Rob Penn, journalist, broadcaster and Woodland Heritage Trustee, will reflect on how integral people are, and have always been, to the future success of our woodlands."
        },
        {
            "heading": 2,
            "text": "Possibilities: innovating for tomorrow"
        },
        {
            "text": "Throughout the day we’ll have heard about innovation with a focus on products and people, bringing a wealth of possibilities to the future of forestry."
        },
        {
            "text": "From new technologies like drones and AI, to ongoing scientific developments, providing deeper insights into out work, there has never been a more exciting time to work with trees. Dan Geerah, Director of Growth at LandApp, will discuss data insights and its integral role in land management."
        },
        {
            "text": "If you are eager to learn more about these topics, the National Forestry Conference is an excellent opportunity to dive into the details, explore recent research and connect with experts. Whether you’re interested in sustainable products, community engagement or the future potential of our forests, now is the time to get involved."
        },
        {
            "heading": 2,
            "text": "What to expect from the National Forestry Conference"
        },
        {
            "text": "The conference is a unique event that brings together a community of people who love trees to delve into forestry and woodland topics. The couple of hundred people in the room bring so much enthusiasm and knowledge on the subjects discussed; it is as interactive as it gets!"
        },
        {
            "text": "Whether you’re attending to hear fresh ideas, share your own insights, or connect with like minded individuals, the conference provides a lively and informative setting. If you can join us this year, bring your curiosity and your notebook, or however you organise your thoughts (look out for technology and data insights on this year’s timetable!)."
        },
        {
            "text": "Both seasoned foresters and students can participate, making it a perfect opportunity for those at any stage of their career to get involved and expand their networks. Hearing the way newcomers are welcomed and experienced foresters share their understanding of management techniques, new technology and how they’re approaching the latest challenges – has been a constant positive of joining the world of forestry."
        }
    ]
}