{
    "url": "https://ipo.blog.gov.uk/2024/09/19/vika-the-next-chapter-in-publishing/",
    "title": "VIKA, the next chapter in publishing",
    "authors": [
        "nathanllewellyn"
    ],
    "categories": [
        "Copyright",
        "Design",
        "Digital",
        "Inclusion and diversity",
        "Innovation",
        "Licensing",
        "Patents"
    ],
    "pub_date": "2024-09-19T12:43:22+01:00",
    "content": [
        {
            "text": "Led by graphic designer, Victoria Forrest, educational book creator VIKA Books combines graphic arts, fine art publishing and creative technologies to create new reading experiences. "
        },
        {
            "text": "Victoria, the founder of VIKA Books, embarked on her journey driven by a passion for making books more accessible and engaging. Victoria sought to create visually captivating books that catered to diverse learning styles and embraced new technologies. "
        },
        {
            "heading": 3,
            "text": "The vision behind VIKA "
        },
        {
            "text": "Victoria's journey with VIKA stems from a deeply personal place. As someone with dyslexia, she understands the struggle of accessing traditional text-heavy books.  "
        },
        {
            "text": "This realisation sparked an idea for Victoria – the idea of creating “Connected Books” - books where printed pages blend seamlessly with creative technologies like video, audio, and Augmented Reality (AR) to enrich the reading experience."
        },
        {
            "text": "Victoria explains her inspiration:"
        },
        {
            "heading": 3,
            "text": " From concept to creation "
        },
        {
            "text": "The inception of VIKA Books took a significant leap when Victoria had her son. Through teaching him sign language, she uncovered a profound communication tool that bridged gaps between thought and speech. Recognising the potential to merge sign language with printed material, Victoria developed “Where is the Bird?”, a book utilising augmented reality to teach sign language to children. "
        },
        {
            "text": "Victoria's journey underscores the intersection of innovation and inclusivity, with VIKA Books pioneering the integration of sign language and multimedia elements into traditional print media. By harnessing AR technology, VIKA Books opens doors to a new realm of interactive storytelling, where readers can engage with content beyond the confines of the printed page. "
        },
        {
            "text": " "
        },
        {
            "heading": 3,
            "text": "Protecting IP "
        },
        {
            "text": "As VIKA Books ventured into uncharted territory, it became paramount to safeguard its innovations. Victoria emphasises the importance of IP protection, saying, \"Everything I do is essentially intellectual property. At its core, I own the copyright of all my designs. But when I created 'Where is the Bird,' I knew it was something special that needed full IP protection.\""
        },
        {
            "text": "VIKA books boast trade marks and registered designs. Victoria has recently received confirmation that the patent she applied for has been granted, ensuring Vika's pioneering technologies remain exclusive. "
        },
        {
            "text": "However, Victoria's journey also highlights the challenges of navigating the IP landscape, emphasising the need for IP support for SMEs. Over the past four years, Victoria has learned to decipher complex legal documents and advocate for quality control. Victoria underscores the need for accessible IP resources and supportive networks. From protecting copyrights to obtaining patents for her processes, Victoria has worked hard to safeguard her innovations."
        },
        {
            "heading": 3,
            "text": " IP funding support *"
        },
        {
            "text": "VIKA Books received IP Audit funding from the IPO in 2021, to help the business identify its IP portfolio and develop a strategy to maximise value from its IP.  "
        },
        {
            "text": "The resulting IP audit report highlighted areas where VIKA Books should focus its attention over the short term, as well as setting out a range of recommendations to be considered for future implementation as part of a broader IP strategy."
        },
        {
            "text": "VIKA subsequently received follow-on funding from the IPO under its IP Access scheme, to implement recommendations from the IP audit. It received the maximum IP Access funding of £5,000. Both grants were delivered in partnership with Innovate UK EDGE (now Innovate UK Business Growth). "
        },
        {
            "text": " "
        },
        {
            "heading": 3,
            "text": "The next chapter "
        },
        {
            "text": " For VIKA Books, the horizon is filled with opportunities. Victoria aims to expand internationally, license technologies, and build partnerships to make sign language integration in publishing mainstream."
        },
        {
            "text": "As VIKA Books continues to push boundaries, it stands as a testament to the transformative impact of innovation and the significance of safeguarding intellectual property, paving the way for a more inclusive and accessible future in publishing. "
        },
        {
            "heading": 4,
            "text": "*Would you like IP help for your business?"
        },
        {
            "text": "The IPO is committed to providing support to inventors and entrepreneurs to help them identify, protect and commercialise their IP. We provide a range of free-to-use online training tools to help understand how IP works and how to manage and use IP."
        },
        {
            "text": "To learn more about the IPO’s online support tools visit: Welcome to IPO’s online support tools. These have been designed to help you: | Intellectual Property Office"
        },
        {
            "text": "We also signpost to organisations within the UK that can help inventors and entrepreneurs bring ideas, products and services to market. We work with the network of Patent Libraries and Business and IP Centres (BIPCs) across the country, which offer free and low-cost IP information services and one-to-one support. A number of the centres also offer referrals for pro-bono support from an IP Professional. Information on the services provided through the BIPC National Network can be found here: https://www.bl.uk/bipc/"
        },
        {
            "text": "The IPO also partners with Innovate UK Business Growth, Scottish Enterprise, Welsh Government and Invest Northern Ireland, who provide a range of services to help innovate businesses. The IPO offers financial support to eligible high-growth potential businesses on business support programmes run by these partners to help businesses identify and manage their IP. More information on the support offered can be found at the websites of the partners here:"
        },
        {
            "text": "Innovate UK Business Growth (ukri.org) "
        },
        {
            "text": "Our organisation | Scottish Enterprise (scottish-enterprise.com)"
        }
    ]
}