{
    "url": "https://planninginspectorate.blog.gov.uk/2024/09/19/what-do-our-future-innovators-and-leaders-look-like/",
    "title": "What do our future innovators and leaders look like? ",
    "authors": [
        "Sarah North"
    ],
    "categories": [
        "Uncategorized"
    ],
    "pub_date": "2024-09-19T11:32:31+01:00",
    "content": [
        {
            "heading": 2,
            "text": "“What do you want to be?”  "
        },
        {
            "text": "Do you remember being 16 or 17 years old and being asked this question incessantly? Did you know the answer? "
        },
        {
            "text": "35 young people from across the UK embraced the opportunity to visit PA Consulting’s offices in London during August to explore the future for themselves. They all met for the first time, some staying away from home for the first time – and were encouraged to develop the skills and talents they possess. They built lasting relationships and grew in confidence throughout the week, whilst devising and presenting creative solutions to real world problems. "
        },
        {
            "text": "Springboard Programme, launched by PA Consulting, in 2018, has given more than 300 young people hands-on work experience of consulting. The programme gives disadvantaged students the opportunity to develop valuable skills to ‘springboard’ their careers by devising ingenious solutions to the world’s toughest challenges, in collaboration with the Social Mobility Foundation (SMF).  "
        },
        {
            "heading": 2,
            "text": "Participants' feedback: In their own words "
        },
        {
            "text": "Our team shared their feedback : "
        },
        {
            "heading": 2,
            "text": "Tackling real-world challenges "
        },
        {
            "text": "We asked them to plan the kind of community they would like to live in; where it should be built  - and how?  The types of infrastructure they felt would be desirable and necessary -  and how the new government’s priorities impacted their ideas. "
        },
        {
            "text": "In the United Kingdom, the relationship between innovation and social mobility is increasingly recognised as vital for economic and societal progress. Innovation fosters economic growth and can generate new jobs and even industries. Conversely, a lack of social mobility will in turn stifle innovation, as talented individuals with valuable lived experience may miss out on opportunities to develop their talent and potential. "
        },
        {
            "heading": 2,
            "text": "Impressive final presentations "
        },
        {
            "text": "Our team’s final in-person presentation blew us away.  Many adult professionals would admit to a few butterflies before standing up and pitching a brand new idea to a room full of executives.  "
        },
        {
            "text": "But their confidence and enthusiasm shone through! They dived into the details and  evaluated continuously how their plans would work – right down to their excitement in discovering new sustainable building materials . The inclusivity they applied to their consideration of the future communities they want to live in was exceptional. All the clients, who included the Royal Navy, Water Aid and  the Department for Education felt convinced that these future innovators and leaders brought a wealth of lived experience and fresh ideas to the table, as well as the enthusiasm to learn, to build new relationships and have the assurance to tackle some pretty weighty world problems with integrity  and kindness.  "
        },
        {
            "heading": 2,
            "text": "Be part of the next generation of innovators "
        },
        {
            "text": "Are you a student aged 16-17 looking to kickstart your career and make a real difference in the world? The Springboard Programme could be your launchpad to success. This unique opportunity offers hands-on experience in consulting, helps you develop valuable skills, and allows you to tackle some of society's most pressing challenges.  "
        },
        {
            "text": "To learn more about the programme and how to apply for the next cohort, visit  https://www.paconsulting.com/culture/pa-in-the-community/springboard . Your journey to becoming a future innovator and leader starts here! "
        }
    ]
}