{
    "url": "https://disabilityunit.blog.gov.uk/2021/07/27/disability-and-access-ambassador-blog-on-the-role-of-being-a-public-servant-in-the-financial-sector/",
    "title": "Disability and Access Ambassador blog - on the role of being a public servant in the financial sector",
    "authors": [
        "Johnny Timpson, Disability and Access Ambassador for the Insurance Sector 2018-21"
    ],
    "categories": [
        "National Strategy for Disabled People"
    ],
    "pub_date": "2021-07-27T08:00:19+01:00",
    "content": [
        {
            "text": "As the inaugural Disability and Access Ambassador for the Insurance sector, I was able to make significant changes across the industry for disabled people."
        },
        {
            "text": "I welcomed both the opportunity and platform that the public appointment gave me to raise awareness, engage, inform and educate within my industry. Particularly in being able to advance the social model of disability in financial sectors that have tended to view disability through a medical model lens. "
        },
        {
            "text": "Awareness of non-visible or hidden disability was low. The culture has been greatly influenced by a regulatory and compliance focus on “customer vulnerability”. I hope I have made a noticeable change to this agenda, and this has been reflected in awards I have received."
        },
        {
            "text": "My most significant work in the role has been to build and lead a highly collaborative cross insurance sector coalition, the Access to Insurance Working Group. This is supported by a lived experience reference group that has developed and delivered an ‘inclusive by design’ change programme. "
        },
        {
            "text": "Despite the challenges of Covid-19, this has resulted in improved consumer and colleague awareness, inclusion, access, opportunity and outcomes for disabled consumers and employees."
        },
        {
            "text": "In this role, and with the support of my Access to Insurance Working Group and network of colleagues, I am proud to have delivered insurance industry underwriting and signposting agreements. These will significantly improve consumer transparency and give disabled customers the ability to access the insurance guidance, advice products and services that they require. "
        },
        {
            "text": "I am also pleased to have had the opportunity to work with Mental Health UK, the National Aids Trust and various other disability and medical charities. We have worked to share consumer lived experience of applying for insurance, and to improve industry awareness, and as a consequence consumer support, experience and outcomes. This has had a particular focus on consumers with mental health lived experience, and those living with HIV. "
        },
        {
            "text": "I have supported the development of i.DAWN, the Insurance Disability and Ability Awareness Network, and GAIN, the Group for Autism, Insurance and Neurodiversity. I have also contributed to numerous Government Green Papers and regulatory consultations.  "
        },
        {
            "text": "I have also worked closely with the sector professional and trade bodies to improve professionalism with a refocus on hierarchies of consumer needs and access. We have increased awareness of the Disability Confident scheme, developed inclusive workplace guidance and improved access to insurance via the workplace. "
        },
        {
            "text": "I leave my Ambassador roles a vastly more experienced, rounded and networked financial services professional. I am even more committed to changing and removing barriers as well as improving inclusion, intersectionality, access and outcomes for consumers and colleagues with disabilities and health conditions, both visible and nonvisible. "
        },
        {
            "text": "In doing this, we improve inclusion, access, opportunity and outcomes for all. I am confident my successors will further develop the roles and, importantly, make them their own."
        },
        {
            "text": "Johnny Timpson spent three years as the inaugural Cabinet Office Disability and Access Ambassador for the Insurance Industry and Profession (this also encompassed the FinTech, InsureTech and HealthTech sectors). He was also, on an interim basis, the Banking Sector DAA, between 2020 and 2021."
        }
    ]
}