{
    "url": "https://disabilityunit.blog.gov.uk/2021/07/27/disability-sector-champion-for-arts-and-culture-2018-21/",
    "title": "Disability Sector Champion for Arts and Culture 2018-21",
    "authors": [
        "Andrew Miller MBE, Disability and Access Ambassador for Arts and Culture"
    ],
    "categories": [
        "National Strategy for Disabled People",
        "Uncategorized"
    ],
    "pub_date": "2021-07-27T08:00:27+01:00",
    "content": [
        {
            "text": "The Disability and Access Ambassador programme (previously known as Sector Champions) offered me a powerful platform to inspire progress and deliver positive change for disabled people in the cultural sector. The scheme also offered the Government valuable insight and a proximity to lived experience of disability."
        },
        {
            "text": "During my three years in the role I was able to raise the profile of creative disabled people in the arts, museum and film sectors. The role enabled me to shine a spotlight on the key issues, using the platform to get behind great innovation such as the National Theatre’s Smart Caption Glasses or to call out outdated and poor practice."
        },
        {
            "text": "I was able to embed disability more deeply into national arts policy through my work with the four UK Arts Councils. This was evidenced by several commitments made including: "
        },
        {
            "text": "In film I was able to support the creation of the BFI Disability Screen Advisory Group and shape their Press Reset campaign. Collectively this work has pushed disability up the agenda for these funding bodies."
        },
        {
            "text": "The platform enabled me to respond swiftly to the global pandemic through the creation of the UK Disability Arts Alliance and our We Shall Not Be Removed campaign in 2020. This was aimed at raising the profile of creative disabled people and advocating for a more inclusive recovery in the creative sector. It attracted more than 700 members and gained widespread support.  "
        },
        {
            "text": "I am especially proud of #WSNBR's Seven Principles for an Inclusive Recovery publication, its immediate policy impact (now endorsed by the Secretary of State for Culture and incorporated within the DCMS Reopening Guidance) and its role in mainstreaming the concept of anti-ableism in the arts and film sectors."
        },
        {
            "text": "However, the real legacy of my time in post will be in the creation of a free National Arts Access Scheme for disabled audiences, designed to standardise ticketing terms and conditions, improve quality of customer service at venues and to build back confidence in attendance at mass gatherings. This initiative will have a tangible and long lasting impact on disabled people’s everyday engagement with culture. The measure has the support of all four UK Arts Councils and it will be needed more than ever as arts venues build back audiences after the pandemic. "
        },
        {
            "text": "Andrew Miller MBE spent three years as the Sector Champion/Disability and Access Ambassador for Arts and Culture from 2018 to 2021. "
        }
    ]
}