{
    "url": "https://governmentscienceandengineering.blog.gov.uk/2021/07/27/gse-opportunities-seo-lead-energy-and-products-engineer-x2/",
    "title": "GSE Opportunities : SEO Lead Energy and Products Engineer ×2",
    "authors": [
        "Leon Kennedy"
    ],
    "categories": [
        "GSE Opportunities"
    ],
    "pub_date": "2021-07-27T11:56:49+01:00",
    "content": [
        {
            "text": "The Office of Product Safety and Standards (OPSS) are recruiting 2× SEO Lead Construction and Standards Engineer in the Testing Strategy team delivers across the whole portfolio of OPSS regulatory and testing requirements. The team holds responsibility for the testing strategy and chairs the testing oversight panel, both of which feed into the overall OPSS strategies and high-level decision making. To continue to increase our product safety capabilities, we are spending over £5 million to develop our site at Teddington and that includes growing our laboratories to cover key elements of product safety testing needs. We are looking to recruit candidates with passion and experience who enjoys working in a team to deliver projects for a range of clients."
        },
        {
            "text": "And to be part of a dynamic and collaborative team to carry out the technical aspects for projects spanning the OPSS portfolio."
        },
        {
            "text": "You will lead and deliver on a wide range of testing projects and provide technical advice to support OPSS regulatory activities."
        },
        {
            "text": "Further information can be found on our Careers Website or by contacting the Organisational Growth team by email."
        },
        {
            "text": "Vacancy reference: 136693, Teddington / London; closing date: 23:55 on Sunday 15th August 2021"
        },
        {
            "heading": 4,
            "text": "Do you have an opportunity to share?"
        },
        {
            "text": "If you would like to publicise an opportunity in the next GSE Opportunities blog post, please send a summary of no more than 100 words with contact details or a link and a closing date to: gse@go-science.gov.uk"
        }
    ]
}