{
    "url": "https://socialworkwithadults.blog.gov.uk/2021/07/27/homes-not-hospitals/",
    "title": "Homes not hospitals",
    "authors": [
        "Liz Howard"
    ],
    "categories": [
        "Autism",
        "Guidance",
        "Information and access",
        "Knowledge and skills",
        "Learning disabilities"
    ],
    "pub_date": "2021-07-27T14:46:23+00:00",
    "content": [
        {
            "heading": 2,
            "text": "Some lessons learned but more progress needed"
        },
        {
            "text": "It’s been ten years since BBC Panorama exposed the Winterbourne View scandal. Here at the British Association of Social Workers (BASW England), we are taking action to make sure human rights abuses suffered by people with learning disabilities and autistic people are never forgotten and history does not repeat itself."
        },
        {
            "text": "Too many people are admitted to secure settings, with over 2055 autistic adults and people with learning disabilities in inpatient settings. Issues with funding and huge delays to discharge mean that these citizens are not getting access to the right housing and support, to help them to live independent and fulfilled lives."
        },
        {
            "text": "Preventative, community-based services should be in place to avoid this from happening. We know from people with lived experience, and the Care Quality Commission (CQC) report ‘Out of sight – who cares?: Restraint, segregation and seclusion’, that in-patient hospital environments, when not therapeutic, are actively damaging to people. This reinforces the justification for restraint and ongoing detention."
        },
        {
            "heading": 2,
            "text": "View from inside"
        },
        {
            "text": "Where the person is already subject to this type of care and treatment regime, support is needed to help them move to a place they want to live, with the right support in place. This viewpoint is further supported by Andrea Attree, a parent and family carer to her daughter Danielle, who is still in the system:"
        },
        {
            "text": "\"We need to stop thinking we need more hospitals. We wouldn’t need these places that cost millions of pounds to build and run if we had the community services. If we don’t break that cycle, we are just investing in a broken model.\""
        },
        {
            "text": "With this in mind, earlier this year, the team at BASW England launched new resources for social workers, as part of the Homes not hospitals campaign, created with the input of families with lived experience and our partners from across the sector."
        },
        {
            "text": "Through supported co-production, resources to strengthen social work practice from a human rights-based perspective and promote person centred approaches were created. It is our hope these tools can help adult social workers prevent or reduce the amount of time adults with learning disabilities and/or autistic adults spend in restricted settings, including hospital assessment and treatment units (ATUs)."
        },
        {
            "text": "Read to the end of this blog to find out more about the resources available."
        },
        {
            "heading": 2,
            "text": "Named social workers – time to expand their role?"
        },
        {
            "text": "Building on learning from the Department of Health and Social Care (DHSC) pilots we are also advocating for the role of named social worker to be implemented across the country, in relation to people with learning disabilities and/or autistic people."
        },
        {
            "text": "Named social workers have a vital role to play in building trust and positive relationships, promoting human rights based practice and retaining oversight of the person’s care and treatment whilst in hospital, in or out of area."
        },
        {
            "text": "Finally, we campaign for urgent publication of the cross-government plan to improve the lives of people with learning disabilities and autistic people, now and for years to come."
        },
        {
            "heading": 2,
            "text": "‘Home not hospitals’ resources"
        },
        {
            "text": "Visit the Home not hospitals site where you’ll find all the resources in one place. They include information on how social workers can support people with learning disabilities and/or autistic people (who may also have mental health problems), a guide to legal frameworks, duties and responsibilities, and best practice commissioning examples."
        },
        {
            "text": "You can also get in touch with me to find out more: liz.howard@basw.co.uk"
        }
    ]
}