{
    "url": "https://ukhsa.blog.gov.uk/2021/07/27/how-we-can-continue-to-protect-ourselves-each-other-and-reduce-the-spread-of-covid-19/",
    "title": "How we can continue to protect ourselves, each other and reduce the spread of COVID-19",
    "authors": [
        "Richard Amlôt",
        "Susan Hopkins",
        "Renu Bindra"
    ],
    "categories": [
        "Coronavirus (COVID-19)"
    ],
    "pub_date": "2021-07-27T13:16:41+01:00",
    "content": [
        {
            "text": "Updated 16 August 2021"
        },
        {
            "text": "In February 2021, the Government published a roadmap out of lockdown. This set out a four-stage process for lifting coronavirus restrictions and returning to a more normal way of life."
        },
        {
            "text": "On July 19, the Government moved to stage four of the roadmap and most restrictions have now been lifted. However, the pandemic is far from over, and it is crucial that we move forward with caution to protect ourselves, each other and especially the most vulnerable in our society."
        },
        {
            "heading": 2,
            "text": "Restrictions have lifted but we are still in a pandemic "
        },
        {
            "text": "Our lives have changed in many ways during the pandemic and we have sustained a very difficult way of living for a long time. Many people are keen to do things that have not been possible in the past year - seeing friends and loved ones and enjoying favourite sports and activities with other people that haven’t been possible since restrictions started."
        },
        {
            "text": "However, as we start to do all these things, it is important we remember that the virus is circulating. Unfortunately, it remains a real possibility that you could catch COVID-19 and become severely unwell and that you could pass it on to others, in some cases unknowingly as not everyone shows symptoms."
        },
        {
            "text": "Of course, the big difference between previous COVID-19 waves and now is that we have rolled out the vaccine widely, which is estimated to have prevented around 22 million infections and 60,000 deaths in England alone. Whilst the vaccine has weakened the link between infection and hospital admissions and deaths, a rise in cases will mean hospitalisations and deaths increase, putting pressure on the NHS that is very busy dealing with the needs of people waiting for other essential treatments and requiring emergency care."
        },
        {
            "text": "While COVID-19 vaccines are very effective, no vaccine is 100% effective and some people, especially older adults or those with weakened immune systems may be less protected. We all have a duty to do what we can to protect each other."
        },
        {
            "heading": 2,
            "text": "What can we do to stay safe and protect others?"
        },
        {
            "text": "There is still a lot we can do help keep coronavirus case numbers as low as possible. While the legal requirement for social distancing and wearing face-coverings has lifted in most settings, it will still be very beneficial to continue to use these interventions in indoor, crowded spaces especially with people who you do not know."
        },
        {
            "text": "In some settings where people are especially vulnerable, these protective measures will remain in place. For example, NHS and social care visitor guidance will stay in place in healthcare settings such as care homes, hospitals, GP practices and other places where health and care is delivered to ensure patients and staff are protected."
        },
        {
            "text": "In our everyday lives, there are steps we can take to help protect ourselves, other people and particularly the most vulnerable in our communities:"
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "heading": 2,
            "text": "What to expect throughout summer"
        },
        {
            "text": "There is much to be optimistic about as we return to many of the activities that have not been possible until now.  The extraordinary efforts that we have all made to arrive at this point in the roadmap are a reason to be proud, and the continuing success of the vaccination programme shows what we can achieve when we work together towards the common goal of keeping our communities safe."
        },
        {
            "text": "Now that most restrictions have lifted and people mix together at a higher level than since the start of the pandemic, more people will catch and pass on the virus, and so it is right that we think carefully about how we can continue to reduce these risks and protect those around us.  Continuing to take the steps described in the coronavirus guidance and in this blog will help to protect you, our friends and loved ones, our colleagues, communities and especially those who remain vulnerable to the virus."
        }
    ]
}