{
    "url": "https://civilservice.blog.gov.uk/2021/07/27/power-of-collective-wisdom/",
    "title": "Power of Collective Wisdom!",
    "authors": [
        "Philip Humphries"
    ],
    "categories": [
        "A Skilled Civil Service",
        "Uncategorized"
    ],
    "pub_date": "2021-07-27T08:44:27+00:00",
    "content": [
        {
            "text": "More than 5,000 civil servants were hungry to learn why ‘Knowledge is Power’ at this summer's Civil Service Live. Philip Humphries explains how the the Knowledge and Information Management  profession can help all civil servants best manage their knowledge and information.  "
        },
        {
            "text": "There are some traditional library and records roles in Knowledge and Information Management. They can easily be labelled as ‘mundane’ or ‘old-school’, but actually that reputation can’t be further from the truth. "
        },
        {
            "text": "Records managers simply have to move with the times and are now starting to use cutting edge technologies, including Artificial Intelligence. "
        },
        {
            "text": "Artificial Intelligence has the potential to help us find, sort and extract value from the billions of documents held across Government.  "
        },
        {
            "text": "We cannot ignore the importance of good Data Protection governance and the dangers when things go wrong. There are not only financial and reputational impacts, but the sheer ‘noise’ and distraction of being under the Information Commissioner’s microscope is incredibly draining. It reaps dividends to simply do things properly in the first place. Your Data Protection colleagues can help you manage that."
        },
        {
            "text": "I’m a real advocate of Microsoft365, but UK Government is spending £-hundreds-of-millions on Microsoft and Google platforms each year and yet we’re still not using all applications to the max. "
        },
        {
            "text": "Furthermore, we’re often seeking alternative solutions when our corporate platforms will do the job and preserve the corporate memory. KIM professionals in your organisation can help you to store, share and exploit information in the safest and most efficient way using your platform of choice."
        },
        {
            "text": "Corporate memory"
        },
        {
            "text": "It's an elusive thing, the ‘corporate memory.’ Much of it is stored in our collective heads. It’s almost sacrilege in our profession to say “write less, talk more,” because we traditionally manage information that’s written down."
        },
        {
            "text": "But it’s still necessary to record, write down and store properly those key policies and decisions. Especially those relating to Covid decisions, because they will be called upon by the public inquiry next year and we need to find evidence easily. But it’s also true that we write down and store too much."
        },
        {
            "text": "There is a well-known ‘Data-Information-Knowledge-Wisdom pyramid’ model, which describes how collected data is our foundation layer; information is the data put into context and explained; by referring to information you gain knowledge and with knowledge, and understanding the “why?,” we acquire wisdom. With wisdom we make good decisions!"
        },
        {
            "text": "The ‘K’ in KIM is for Knowledge Management, where we teach, encourage and facilitate a variety of tools and techniques designed to get us collaborating better and talking more. "
        },
        {
            "text": "Windrush Lessons"
        },
        {
            "text": "A great example is the way the Home Office is using storytelling to help mend the wounds caused by the Windrush scandal. These stories were used as part of the powerful testimony published in the Windrush Lessons Learned Review."
        },
        {
            "text": "Finding a KIM professional in your organisation who can advise you about good Knowledge Management is especially important in these times with a high rate churn in our workforce. As people come and go, we need to get better at transferring or bottling their knowledge, so we’re not continually leaking the corporate memory."
        },
        {
            "text": "100 years experience"
        },
        {
            "text": "The pyramid made me think about the collective wisdom of our profession. Just thinking about our panel, we boast more than a century’s worth of experience in Government and decades of KIM knowledge. Multiply that by 500 and you can get a measure of the KIM professional in Government.  And think for a minute about the collective wisdom of the Civil Service; that’s mind blowing!  "
        }
    ]
}