{
    "url": "https://rpc.blog.gov.uk/2021/07/27/reforming-the-better-regulation-framework/",
    "title": "Reforming the Better Regulation Framework",
    "authors": [
        "Stephen Gibson"
    ],
    "categories": [
        "Uncategorized"
    ],
    "pub_date": "2021-07-27T18:00:41+01:00",
    "content": [
        {
            "text": "The government has launched a consultation on a new approach to making regulation, including proposals for a revised Better Regulation Framework."
        },
        {
            "text": "The UK’s recent exit from the EU provides an opportunity to ensure that the UK has an approach to regulation that is as effective as possible, and promotes innovation and growth in the economy."
        },
        {
            "text": "The Better Regulation Framework is the system within which government departments and regulators have to operate when ministers propose new regulation. It is an important element of good government and ensures that both regulatory and deregulatory proposals are based on robust evidence and analysis; while assessing the impacts on business and civil society organisations to avoid unnecessary burdens."
        },
        {
            "text": "The RPC – the independent Better Regulation watchdog – plays an important role in the current framework by:"
        },
        {
            "text": "We welcome the government’s consultation. It asks some important questions about how the regulatory process might operate in future."
        },
        {
            "heading": 2,
            "text": "Scrutiny of regulatory proposals"
        },
        {
            "text": "The consultation asks about the role that scrutiny plays in ensuring policy decisions are based on robust evidence and analysis, and whether scrutiny earlier in policy-making process could encourage alternative options to regulation. The consultation also asks whether scrutiny should be conducted independently from government."
        },
        {
            "text": "We believe that independent scrutiny of regulatory proposals ensures that policy making is based on the best evidence and promotes better regulation. We agree with the proposition that there should be strong challenge early in the process to ensure alternative options are considered before a regulatory solution is chosen – see our previous post."
        },
        {
            "text": "We see a role for technical scrutiny, conducted by experts, which we believe supports and strengthens democratic scrutiny. Our current role provides constructive technical challenge to government, to support Parliament in its democratic scrutiny and to reassure external stakeholders that the wider impacts are being properly considered as regulatory decisions are made."
        },
        {
            "text": "We also believe that scrutiny itself needs to be delivered transparently and we encourage the government to allow independent scrutiny of the full range of regulation with the minimum number of exemptions – again, see our previous post."
        },
        {
            "heading": 2,
            "text": "Focus of assessment"
        },
        {
            "text": "The consultation asks whether the process of assessment and scrutiny can be streamlined and focused on areas of core economic impact, with separate guidance on wider impacts (for example, impacts on trade or on innovation)."
        },
        {
            "text": "We believe that policy makers’ assessment of regulatory proposals needs to assess the direct, indirect and wider impacts of the policy options (so include, for example, impacts on trade or on innovation) and communicate these in a way that is transparent for those affected and to Parliament."
        },
        {
            "heading": 2,
            "text": "Evaluation after implementation"
        },
        {
            "text": "The consultation suggests a mandatory review of regulation after 2 years’ performance (sooner than the current 5 years), together with a requirement to revise, replace or sunset the regulation, where expected outcomes are not being met or are more costly."
        },
        {
            "text": "We support a rigorous approach to learning lessons from how regulation works in practice, and assessing the actual impacts of regulation. We also believe that conclusions from the review of regulation should be acted upon."
        },
        {
            "heading": 2,
            "text": "Accountability for regulation"
        },
        {
            "text": "The consultation questions whether the current approach to calculation of the business impact target (BIT) score is appropriate in assessing the overall impact of regulation. It also discusses techniques from the past (‘one-in, two-out’) and from abroad (baselining the stock of regulation) to target the appropriate level of regulation."
        },
        {
            "text": "We believe that government should be transparent about, and accountable for, the total impact of regulation. We acknowledge that there are different methods for accounting for the impact of regulation and that the government needs to decide how much regulation it wants to create."
        },
        {
            "heading": 2,
            "text": "Role of regulators"
        },
        {
            "text": "The consultation includes a number of proposals about making independent regulators more flexible in their approach; more focused on competition and innovation; with greater delegated authority, but also accountability."
        },
        {
            "text": "We believe that independent regulators have a significant role to play in ensuring efficiency in the economy, but with the responsibility to uphold the principles of better regulation. Given the significant impact of independent regulators across the economy, we believe that the government should ensure that regulators can be effective, but also face appropriate scrutiny and accountability for their decisions."
        },
        {
            "text": "The consultation presents important questions that will affect those impacted by regulation for many years to come. We encourage such stakeholders to respond to the consultation by 1 October 2021, to help the government to finalise a new Better Regulation Framework that is fit for the future."
        },
        {
            "text": "Stay up-to-date by signing up for email alerts from this blog."
        }
    ]
}