{
    "url": "https://insidedio.blog.gov.uk/2021/07/27/staying-safe-on-the-defence-estate-this-summer/",
    "title": "Staying safe on the Defence estate this summer",
    "authors": [
        "Brigadier Jonathan Bartholomew OBE"
    ],
    "categories": [
        "Salisbury Plain Training Area",
        "Training Estate Public Safety"
    ],
    "pub_date": "2021-07-27T12:45:51+00:00",
    "content": [
        {
            "text": "Soldiers training on the Salisbury Plain Training Area. The 'Respect the Range' campaign encourages visitors to check training times before visiting the Defence estate. [Crown Copyright/MOD2021]The summer holidays are here and with lockdown restrictions easing many of you may look to explore the Defence training estate with your family and friends."
        },
        {
            "text": "Much of the Ministry of Defence (MOD) training estate is accessible to the public, offering exciting opportunities to explore some of the most beautiful, unique and rural areas in the UK. We understand the physical and mental benefits of being outside and encourage people to make best use of MOD land, but only when and where it is safe to do so."
        },
        {
            "text": "The summer is a great time to have BBQs, get your camping gear out and have picnics, however these activities are not permitted anywhere on the Defence estate. The good weather that we’ve been enjoying recently has also increased the risk of wildfires, which can start easily, spread fast and cause serious damage, in addition to putting you at risk and interrupting military training."
        },
        {
            "text": "Camping is also not allowed anywhere on the training estate. Our military train at all times of the day and night and it is important that sites remain clear for vehicles and personnel. Picnics are not permitted for similar reasons, many areas contain unexploded ordnance, so although it may be tempting to stop to camp or bring a picnic, for everyone’s safety, we kindly ask you not to."
        },
        {
            "heading": 2,
            "text": " ‘Respect The Range’ whilst visiting MOD land "
        },
        {
            "text": "You may have seen our ‘Respect the Range’ campaign which launched last year. It aims to remind people about the dual use of military land and the risks posed by accessing it at the wrong times."
        },
        {
            "text": "Whilst the Defence estate offers many beautiful walks and captivating scenery, remember that our training sites are shared spaces that can go from “calm to combat” in an instant! As much of our land is used for tactical training, you may not see or hear any activity until it is too late."
        },
        {
            "text": "There are many dangers on the training estate, whether you're in a vehicle, on foot, or on a bicycle. [Crown Copyright, MOD]As well as the risk to you, your family and friends, accessing the military training land when it is unsafe to do so also puts Service personnel at risk and often interrupts vital training exercises, impacting the Armed Forces’ ability to prepare to deploy in real-life situations."
        },
        {
            "text": "So, if you’re planning to go for a walk, run, cycle or see the Defence training estate over the summer holidays, you are more than welcome to visit, but please remember that the training area isn’t a playground. Armoured vehicles, live firing, unexploded ordnance and fast-moving vehicles are all a part of military training."
        },
        {
            "text": "What to do before setting out"
        },
        {
            "text": "Access to the training estate is regulated by bye laws. Always comply with local signs and flags. Rights of way in danger areas are closed when red flags fly [Crown Copyright/MOD2017]Before visiting any of our training areas, please check firing times before leaving home and observe safety information including red flags, signs and byelaws while you are there. If a red flag is flying, it means that training is taking place and you should not enter the area. By abiding by these simple rules, everyone can play their part in helping to ensure that we can all enjoy the land safely, and the military can train uninterrupted."
        },
        {
            "text": "Whether you’re on holiday, exploring on a day out, or you are a local resident making the most of the scenery on your doorstep, please enjoy these lovely spaces and follow the rules, to protect yourself and others this summer."
        }
    ]
}