{
    "url": "https://environmentagency.blog.gov.uk/2021/07/27/taking-a-step-forward/",
    "title": "Taking a step forward",
    "authors": [
        "Environment Agency"
    ],
    "categories": [
        "agriculture"
    ],
    "pub_date": "2021-07-27T16:28:40+00:00",
    "content": [
        {
            "text": "In my first few months at the Environment Agency working in Devon and Cornwall back in 2008, I quickly realised that farmers were struggling to manage and store their slurry. This was often leading to significant pollution incidents and putting a great deal of stress on the farmers themselves. Thirteen years on and I have moved from being an officer with 'boots on the ground' to working in the national agriculture team where slurry storage remains a big issue for farmers."
        },
        {
            "text": "The farmers we work with are keen to protect the environment, so the challenge for us is helping them to understand the regulations so they can take steps to comply."
        },
        {
            "text": "A successful project ran from 2016 to 2019 in the River Axe catchment in East Devon to do just that. An agricultural officer worked for three years carrying out targeted advice-led regulation. The rate of compliance when we first visited farms was low, however, giving targeted advice has had amazing results. We continue to have a presence in the area and farmers have now invested in 46 new slurry stores. This is a double win - fantastic for the environment as well as for the farmers who can now spread their nutrients at the right time and save money on chemical fertilisers and diesel costs and protect their land from compaction by avoiding winter spreading of slurry."
        },
        {
            "text": "As a result of the success of the Rive Axe project we put a case to government for funding to roll out this approach on a bigger scale across the country.  We've now secured funding for more 'boots on the ground' to work with farmers to protect the environment and improve their ways of working."
        },
        {
            "text": "These new roles will ensure that farmers are able to access more advice and guidance, as well as being better placed to benefit from future funding opportunities as new schemes and sustainable incentives for farm businesses are rolled out. We are also continuing to engage and work with Catchment Sensitive Farming and Wildlife Trusts, as well as the NFU and the CLA."
        },
        {
            "text": "We are now recruiting 50 new staff with the aim of undertaking 1,500 advice led regulatory visits to farms before the end of March 2022. This is a fantastic opportunity to work at the forefront of agricultural regulation. We welcome applications from the agricultural community, particularly agronomists, farmers and consultants. These staff will carry out prearranged farm visits looking at farm infrastructure and land management practices such as spreading of nutrients and will advise farmers how to protect the environment and comply with regulations."
        },
        {
            "text": "As well as targeted site visits by Officers, we are innovating the way we regulate by using drone surveys and other remote sensing techniques to identify where the environment may be at risk from agricultural harm. Officers working on this project will be taking part in workshops ranging from testing our advisory approach to identifying if tenant farmers find it hard to invest."
        },
        {
            "text": "We are very excited about this opportunity to help farmers and the environment at this pivotal time for farming policy outside the EU and to help continue our aim of creating a greener, healthier environment today and into the future."
        }
    ]
}