{
    "url": "https://defrafarming.blog.gov.uk/2021/07/27/the-environmental-land-management-engagement-group/",
    "title": "The Environmental Land Management Engagement Group",
    "authors": [
        "Catherine Boyd"
    ],
    "categories": [
        "Conversations we're having"
    ],
    "pub_date": "2021-07-27T12:06:23+01:00",
    "content": [
        {
            "text": "Environmental land management needs to deliver for farmers, foresters and land managers. Because it’s a big and complex area, it’s tempting to consider these groups of people separately, but for our policies and schemes to truly work, we need to bring the expertise from these groups together. "
        },
        {
            "text": "So that’s what we did. The Environmental Land Management Engagement Group (EEG) is another way that we’re doing co-design. "
        },
        {
            "text": "We set it up back in 2019, to ensure that stakeholders had a seat at the table during our early discussions and thinking. Since then, we’ve met over 20 times. Our meetings continued virtually during lockdown."
        },
        {
            "text": "In between those meetings, we hosted lots of workshops to look at the details of our schemes – such as designing the standards for how an online application form might look. "
        },
        {
            "text": "Now that we’re well-established and we have a place to talk about our work here on the blog, I'd like to give a bit of an introduction to the group."
        },
        {
            "text": "As with any group, not everyone always agrees and members have different priorities, but we believe that by looking at a subject from multiple perspectives, we will reach a better outcome."
        },
        {
            "text": "The group is an invaluable sounding board. Members are generous with their insights. They challenge us, in a constructive way, on proposed approaches to the design and development of schemes. They are experts who have many years of knowledge and experience that we can draw on."
        },
        {
            "text": "We regularly review membership to ensure it is diverse and represents the sector. We also include members in wider programme briefings to provide context and links between our work. "
        },
        {
            "text": "Members are, in turn, part of other networks. This makes it easier for us to find even more farmers and land managers with whom we can co-design our schemes and policies."
        },
        {
            "text": "We’ve recently changed how we work. We meet for a whole day once every 3 months. We look at everything: from the Sustainable Farming Incentive to Landscape Recovery, including our tests and trials and piloting."
        },
        {
            "text": "This group helps us to see the big picture and guide us. The ability of this group to jump between big thinking to specific detail is the biggest value. We meet with them all individually, to understand their concerns and priorities. This puts us in a stronger place when we relay our responses to the programme’s policy teams. "
        },
        {
            "text": "Although the group is not the only method of co-design that we use, we want to share more of our activity with you. We will blog about it regularly, so do subscribe to the Future Farming Blog."
        },
        {
            "heading": 4,
            "text": "Our members "
        },
        {
            "text": "We are constantly working to improve how we work with people to co-design environmental land management schemes, so if you would like to be involved we’d love to hear from you. "
        },
        {
            "text": "If you have any questions about the group, do leave a comment below or email ELMengagement@defra.gov.uk ."
        }
    ]
}