{
    "url": "https://hmlandregistry.blog.gov.uk/2021/07/27/time-saving-tips-to-speed-up-your-applications/",
    "title": "Time-saving tips to speed up your applications",
    "authors": [
        "Darren Standring, Customer Policy Executive"
    ],
    "categories": [
        "Law and practice"
    ],
    "pub_date": "2021-07-27T14:28:41+01:00",
    "content": [
        {
            "text": "We know that delays cause frustrations for everyone. In order to speed up the time to process applications and reduce delays, we’ve collated some top tips for our customers."
        },
        {
            "text": "1. To save time when submitting applications and reduce common errors, use our Digital Registration Service (DRS) service, available on our portal. It has been designed to guide you through making applications step-by-step, avoiding basic mistakes through automated error checking and calculating fees for you. Proprietor names are also instantly checked against the register. If everyone starts using this service, we could see a significant reduction in requisitions (requests for information), saving both you and us time."
        },
        {
            "text": "2. Rather than spending time in a telephone queue, you can use our free View My Applications service within the portal to:"
        },
        {
            "text": "3. If necessary, you can ask us to process your application urgently. The expedite (fast-track) process is available for applications, either residential or commercial, where a delay would:"
        },
        {
            "text": "4. Requisitions are a significant cause of delays. Currently we need to issue a requisition in about one in five cases. You can make sure your application is processed as quickly as possible by double-checking that it’s ready to be registered before lodging it. If we have all the information and documentation we need, and it’s correct, we won’t have to issue a requisition.  Our Application checklist: avoiding requisitions gives examples of common requisitions and how to avoid them.Or you can watch our series of videos on how to avoid requisitions."
        },
        {
            "text": "5. If you need to request more time to reply to a requisition, portal users should use ‘Reply to Requisition’. All other users can contact us at gov.uk/guidance/contact-hm-land-registry."
        },
        {
            "text": "6. In order to receive a reminder to respond to any requisitions before the cancellation date, make sure you include an up-to-date email address when lodging applications. Warnings of cancellation are sent after 40 days in most cases. For more details, see practice guide 50."
        },
        {
            "text": "Where an application was lodged using the electronic Document Registration Service (e-DRS), requisitions are sent to the email address chosen by you in the e-DRS submission. Where the application was lodged by post, requisitions are sent to the email address provided on the application form."
        },
        {
            "text": "7. In the last year, we issued approximately 40,000 requisitions after receiving the wrong fees. Application fee information can be found in our Registration services fee order. We also have a handy fee calculator to help you."
        },
        {
            "text": "8. Our free webinars will help you prepare and send us quality applications.You can watch recordings and sign up for email alerts to be notified about our latest live webinars. Our most popular webinars include:"
        },
        {
            "text": "9. We have around 150-200 instances a week of undelivered post returned to us because a customer has changed address or is no longer using a DX address. If you wish to amend the address for anything that needs to be posted to you, please update your key number. This can be done by emailing a request for change to e-receivables@landregistry.gov.uk."
        },
        {
            "text": "10. When starting a complex commercial or infrastructure development project application for registration, you can use the Pre-submission Enquiry Service and Application Management Service to ask us for guidance."
        },
        {
            "text": "11. Sign up to receive our monthly newsletter Landnet for our latest news and practice guidance. Landnet provides a round-up of our blogs, news stories and practice guide changes. You can also sign up to receive an email whenever we publish or update practice guides."
        }
    ]
}