{
    "url": "https://companieshouse.blog.gov.uk/2021/07/27/working-for-companies-house-daisys-story/",
    "title": "Working for Companies House: Daisy's story",
    "authors": [
        "Daisy Sanson - Apprentice Software Developer",
        "Spencer Vignes - Campaigns Manager"
    ],
    "categories": [
        "People and culture",
        "Working at Companies House"
    ],
    "pub_date": "2021-07-27T12:04:37+01:00",
    "content": [
        {
            "text": "At Companies House, we like to think of ourselves as an inclusive, innovative and welcoming employer, one that supports people and encourages them to ‘find their passion’ by developing their skills and careers. But don’t just take our word for it. Here, our new series of features in which employees reflect on what makes Companies House so special continues with Daisy Sanson, discussing how her digital apprenticeship provides a perfect balance of the ‘why’ and ‘how’."
        },
        {
            "text": "Daisy Sanson, 24, is an apprentice software developer at Companies House. After graduating from the University of Sheffield, where she studied History and Russian, Daisy decided she wanted to continue to pursue languages, but not in the traditional sense."
        },
        {
            "text": "She explains: “After studying Russian at university I wanted to maintain my passion for linguistics while furthering my interest in technology and the ‘behind-the-scenes’ of software, so I started looking for roles in the digital space. I soon found that most jobs required some level of understanding of programming, which I did not have."
        },
        {
            "text": "“A friend of a friend worked at Companies House and directed me to the apprenticeships scheme. At first I really wasn’t sure, the Civil Service does not immediately jump out as a digital employer and I was concerned they would be a bit corporate."
        },
        {
            "text": "Having worked at Companies House I can say with confidence that this is not the case at all. It feels just like working at an independent software company. You use sought-after programming languages and they adopt the same agile ways of working as the likes of Google and Facebook."
        },
        {
            "text": "“The recruitment process took around 2 months in all. Initially there was an online application process which was designed to ascertain your level of interest in technology. You were asked questions about apps you liked, what kind of software you’d like to build if you had the skills and the tools."
        },
        {
            "text": "But the second stage almost put me off applying altogether. I was invited to an assessment centre and that phrase conjured up images of a room full of people competing for attention and silent assessors with clipboards judging you on predetermined criteria."
        },
        {
            "text": "“In reality, I’m so glad I went because my preconceptions could not have been more wrong. The assessors were chatty and were involved in the process, so it felt more like a team activity rather than a test. Plus, a few members of my now team were there so I could see who I might end up working with, which really helps you get a feel for the employer."
        },
        {
            "text": "“The best bit about the whole recruitment process was that after each stage I was given contact details if I had any questions, and I was kept informed throughout the whole process. It really made me feel like I was already part of the team and Companies House already cared about me."
        },
        {
            "text": "“When I first started the apprenticeship, I was a bit intimidated. There’s a lot of tech jargon that you need to learn even before you start learning programming languages which was like learning a different language in itself."
        },
        {
            "text": "I have been here just over a year now and I’ve got the hang of quite a lot of it, and I love that there’s so much more to learn – I know I’ll never get bored and every day will bring something new."
        },
        {
            "text": "“When I created my first program that worked, I was a bit shocked. It was only a basic game, but it required pages and pages of code which could have had so many errors. I’ll probably look back on it in a few more months and consider it so rudimentary, but to have something tangible that proves you’re learning feels like such a great achievement."
        },
        {
            "text": "“Companies House are really keen to encourage more people into the digital directorate, because they want to be challenged."
        },
        {
            "text": "“Looking around the digital team, I’m impressed by the amount of talent there. For example, my manager is someone I really aspire to be like – she’s a true expert. She can just glance at a piece of code and see errors or ways to improve without even running the program. It’s really cool to watch."
        },
        {
            "text": "“Having experienced both degree-learning and apprenticeships, I believe apprenticeships are the best way to get in to work – especially in the tech sector. You get the perfect balance of learning the ‘why’ through classroom learning, and also the ‘how’ through on-the-job learning. You can shape your own development by choosing the modules that interest you and directing your job role to fit your passions."
        },
        {
            "text": "“If anyone is considering a digital apprenticeship or another career at Companies House, I’d have one bit of advice – just go for it. It’s a great opportunity to carve out your niche.’’"
        }
    ]
}