{
    "url": "https://naturalengland.blog.gov.uk/2024/03/07/building-partnerships-for-natures-recovery-in-the-north/",
    "title": "Building Partnerships for Nature’s Recovery in the North",
    "authors": [
        "Natural England"
    ],
    "categories": [
        "Biodiversity",
        "Climate change",
        "Natural England",
        "Nature Recovery Network"
    ],
    "pub_date": "2024-03-07T14:47:00+00:00",
    "content": [
        {
            "text": "By David Renwick, Regional Director for the North at Natural England"
        },
        {
            "text": "Last week saw a momentous week for nature across the north with the second annual Nature North conference in Newcastle and the Convention of the North in Leeds."
        },
        {
            "text": "As a proud Northerner, North Regional Director for Natural England and board member for Nature North, I believe the amazing nature we have in the North needs us, as much as we need it."
        },
        {
            "text": "Working for Natural England – we have a vision of thriving nature for people and planet – and a mission to build partnerships for nature’s recovery. The Nature North partnership is a shining example of how we can achieve that, at scale."
        },
        {
            "text": "Nature North 2024 saw delegates attending from the conservation sector, farming, business, finance, culture, NHS, Local Government and Government Agencies. The day brought together the north’s nature leaders and pioneers to share ideas and learning, join up and drive ambition so we can secure new investment and unlock the many benefits of large-scale nature recovery for people and places across the North of England."
        },
        {
            "text": "It was great to hear the rich discussion focused around the 7 Investable Propositions which will build a more coherent, strategic and investment-focused approach to enhancing nature in the north, including how we develop the ambition for resilient northern farming with farmers, land managers and nature organisations working together to deliver a range of outcomes from landscapes, including high quality food, rich nature, benefits for water and people."
        },
        {
            "text": "We announced plans for the ‘Nature North Strategic Investment Plan’ which will help build scalability, confidence and visibility to such investment. Connecting investors with projects and providing businesses the opportunity to invest in Northern nature."
        },
        {
            "text": "Throughout 2024, Nature North will be working with stakeholders from all sectors across the North, to create the Strategic Investment Plan, which will launch in Spring 2025."
        },
        {
            "text": "One thing that is clear is that nature recovery will happen on the ground, in places where people live and work, and can enjoy nature, across our cities and towns, and rural landscapes."
        },
        {
            "text": "Local Nature Recovery Strategies are being developed across the North setting out priorities for nature and helping develop pipelines of projects that can become investible. These LNRS could add up to a bigger vision for nature across the North and align with wider plans that mayors and local authorities have for their areas. We want functional and resilient nature at a bigger scale – essential as we see the effects of climate change take hold."
        },
        {
            "text": "With nearly 90% of the North soon to be covered by a devolution deal, we have the opportunity to work with leaders across the north to ensure nature can deliver outcomes for others – health and wellbeing, green jobs and investment."
        },
        {
            "text": "As part of the Northern Place and Culture partnership, we are working with NP11, the Northern group of Local Enterprise Partnerships, together with Arts Council England, Environment Agency, Historic England and National Lottery Heritage Fund to drive forward the Place Strategy for the North."
        },
        {
            "text": "Arts, culture, heritage and nature make important contributions to economic growth and job creation across the North, as well as other major national priorities such as meeting net zero targets, regenerating town and city centres and boosting pride and wellbeing among communities."
        },
        {
            "text": "We are working through this partnership to collaborate with northern place leaders to ensure nature is part of the emerging plans and further position nature as a crucial ingredient in a more devolved and confident North."
        },
        {
            "text": "The Convention of the North is the North of England’s flagship annual gathering for business, political and civic society leaders, to debate the challenges and opportunities facing the region. This year the Convention was held in Leeds at the Royal Armouries, but there was no battle or war to get people to recognise the value of nature to the north."
        },
        {
            "text": "I'm delighted that after five years of work from a range of partners, since the 2019 Convention of the North in Rotherham, we have made significant progress in positioning nature and as threads in the Manifesto for the North, and specifically as part of both the Net Zero and Place and People priorities. The Manifesto is aimed at all parties and helps articulate what public, private and third sectors think the North needs for it to prosper."
        },
        {
            "text": "The policy input for the Manifesto propositions can be found here:"
        },
        {
            "text": "https://www.conventionofthenorth.org.uk/publications/"
        },
        {
            "text": "The convention of the North allowed us to drive forward this ambition. Here, nature alongside culture, heritage and the wider environment connected with other key sectors – trade and investment, clean growth, digital, innovation and place making."
        },
        {
            "text": "The year ahead holds exciting opportunities to work with our pan-northern partnerships, with leaders, sector organisations, business and communities across the north to not only ensure we can create improved resilience and better outcomes for nature, but that nature can help secure a thriving place for people and the economy."
        }
    ]
}