{
    "url": "https://dragonsden.blog.gov.uk/2024/03/07/dragons-den-ip-blog-series-21-episode-10/",
    "title": "Dragons’ Den IP Blog - Series 21 Episode 10",
    "authors": [
        "Christina Watts"
    ],
    "categories": [
        "Business",
        "Patents",
        "Trade secrets"
    ],
    "pub_date": "2024-03-07T21:00:52+00:00",
    "content": [
        {
            "text": "It’s hard to believe that we are already on Episode 10 of Season 21 of Dragons’ Den. This series certainly hasn’t disappointed with its impressive display of intellectual property, and this episode is no different. "
        },
        {
            "heading": 3,
            "text": "Milky Business "
        },
        {
            "text": "First into the Den is entrepreneur Nick King and his sons Daniel and Ricky, with their family run business, Goats of the Gorge. They asked for £30,000 in exchange for 10% of their business. "
        },
        {
            "text": "When diagnosed with osteoporosis, dad Ricky was advised by a hospital consultant to start drinking goats' milk to help with his calcium intake. After some further research the businessman discovered goats’ milk contains lactic acid which helps to break down dead skin cells and vitamin A which helps to repair damaged skin tissue. This is where the trio's idea for goats' milk skincare products began. "
        },
        {
            "text": "Unfortunately, the trio failed to get the Dragons to invest this time, but they left the Den more determined than ever. "
        },
        {
            "text": " "
        },
        {
            "heading": 3,
            "text": "Angled solutions "
        },
        {
            "text": "Next into the Den was business ‘Zebedee Any Angle’ with their innovative solution for maximising storage space in a room with a sloping ceiling. Inventor Diane Challender came up with the idea after she failed to find any angled hanging rails for her own bedroom. Determined to find a resolution to her problem, she set about designing her own. "
        },
        {
            "text": "“After a few versions, I hit upon the idea of using a spring around a rod. I drew what I wanted and took it to a local engineer to be made.” "
        },
        {
            "heading": 4,
            "text": "Hanging in the balance"
        },
        {
            "text": "A quick search of our database showed that Diane has a patent registered on the function of the pole. A patent protects your invention and lets you take legal action against anyone who makes, uses, sells or imports it without your permission.    "
        },
        {
            "text": "Diane was asking for £75,000 in return for 10% of her business. Sara saw potential in the space saving business but felt that it would need to be restructured and rebranded to be successful. With Diane happy to do whatever it takes, Sara made her an offer, all the money in return for 40% of the business - four times the equity Diane wanted to give away.  "
        },
        {
            "text": "After a ‘talk to wall’ the pair finally settled on 40% equity within the business. They agreed on paying Sara back the investment within 18 months with the Dragon’s shares in the company dropping to 30%. "
        },
        {
            "text": "Have you enjoyed exploring the IP in tonight's episode? Don’t miss out, subscribe to our Dragons' Den IPO blog to get the latest updates sent straight to your inbox! Sign up (link): Subscribe - Dragons' Den: the Intellectual Property blog "
        },
        {
            "text": " "
        },
        {
            "text": "Disclaimer:"
        },
        {
            "text": "The purpose of the IPO's Dragons' Den IP blog is to help identify the IP in entrepreneurs’ pitches and highlight how IP works, or could work, in the real-life examples featured. IPO’s authorship of this blog does not constitute its endorsement or sponsorship of any products, individuals or businesses referenced within it."
        }
    ]
}