{
    "url": "https://defraenvironment.blog.gov.uk/2024/03/07/improving-biodiversity-and-tackling-poverty-new-international-research-grant-competition-launches/",
    "title": "Improving biodiversity and tackling poverty: new international research grant competition launches",
    "authors": [
        "Caroline Bolhoven"
    ],
    "categories": [
        "Uncategorized"
    ],
    "pub_date": "2024-03-07T15:17:30+00:00",
    "content": [
        {
            "text": "I'm Caroline Bolhoven, head of International Sustainable Land Use at Defra. "
        },
        {
            "text": "Many people around the world, especially those in marginalised communities, are already experiencing the impact of climate change. This is forecast to worsen, unless urgent and transformative action is taken. "
        },
        {
            "text": "In this post I’ll tell you about a new research grant competition to help developing countries better protect, restore and manage biodiversity – in ways that also tackle poverty and improve resilience to climate change.  "
        },
        {
            "text": "The competition has been launched by Defra’s Global Centre on Biodiversity for Climate (GCBC). The GCBC, announced at COP26 with £40 million funding, is part of the government’s commitment to spend £3 billion of its International Climate Finance on nature and biodiversity between 2021 and March 2026. "
        },
        {
            "text": "The GCBC supports the United Nation’s Sustainable Development Goals, Global Biodiversity Framework and Paris Agreement, and helps countries achieve a nature-positive future. Those countries must be eligible for UK Official Development Assistance funding, within Latin America and the Caribbean, sub-Saharan Africa, and South-East Asia and the Pacific (including Small Island Developing States). "
        },
        {
            "text": "The GCBC is unique in comparison to other Defra international research and development programmes because, on top of its environmental priorities, it focuses on approaches that improve development and alleviate poverty. "
        },
        {
            "text": "The idea is to develop these innovative and scalable methods in partnership with scientists, academics, and research institutions in the Global South and North – and build a long-term evidence base to help more people adopt these approaches. "
        },
        {
            "text": "We will build this evidence base by funding research through annual research grant competitions. "
        },
        {
            "text": "The GCBC launched its first competition in May 2023, inviting applications to conduct research on the role of biodiversity in agriculture and natural resources management. We have since allocated £9.3 million to 13 organisations across 16 countries.  Read our Evidence Synthesis Report for 2023 for more information on the progress and achievements of GCBC funded projects in its first year of operation. "
        },
        {
            "text": "Our second grant competition – as referenced above - is now live. The theme for this round is ‘Unlocking the potential of nature to support climate resilience and improve livelihoods through practice and governance’. Read this paper about the theme for more information. "
        },
        {
            "text": "We are keen to see submissions of novel and innovative approaches to address this theme. Projects must have a total budget between £100,000 and £1 million and a duration of 12 to 36 months, starting 1 November 2024. "
        },
        {
            "text": "Different grants sizes are available depending on the type or nature of the research to be funded, from £100,000 to £1million. The projects could range from smaller desk-based and locally focused projects to larger initiatives. We are looking for projects that address evidence gaps, and from which the learning, solutions, tools, and methodology can be upscaled and replicated in other regions or countries.   "
        },
        {
            "text": "The closing date for submissions for the first application stage is 17:00GMT on 17 March 2024. "
        },
        {
            "text": "We are excited to receive applications. Through the GCBC and the work of current and future projects, we are helping countries across the world to preserve our most precious asset, nature. And, in doing so, we’re also supporting those that depend on nature – economies, livelihoods and people’s wellbeing. "
        },
        {
            "text": "For more information, please visit the GCBC website.  "
        },
        {
            "text": "To receive an email notification when a new blog post is published, please subscribe to the blog.  "
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        }
    ]
}