{
    "url": "https://ipo.blog.gov.uk/2024/03/07/mickeys-adventure-into-the-public-domain/",
    "title": "Mickey’s adventure into the public domain ",
    "authors": [
        "Christina Watts"
    ],
    "categories": [
        "Business",
        "Copyright",
        "International",
        "Trade marks"
    ],
    "pub_date": "2024-03-07T09:00:53+00:00",
    "content": [
        {
            "text": "This year Disney is celebrating its 100th anniversary. Like most people, I grew up on the magic of Disney, often watching my favourite Disney films on VHS video (that’s a blast from the past) or playing dress-up in one of my many Disney Princess costumes. "
        },
        {
            "heading": 3,
            "text": "Oh boy! It’s copyright "
        },
        {
            "text": "Did you know that the original version of one of Disney’s most iconic and popular characters, Mickey Mouse, has recently been released from its copyright worldwide? "
        },
        {
            "text": "The character that went on to capture the heart of children and adults alike was created on October 1, 1928 by the Walt Disney Company, first appearing in Disney’s cartoon ‘Steamboat Willie.’ The black and white show was ahead of the times with its innovative idea to synchronise sound effects and music to the animations on the screen.  "
        },
        {
            "text": "The length of copyright protection in the UK may vary depending on the type of work. Artistic works are protected by UK copyright law for the lifetime of the creator and for an additional 70 years. "
        },
        {
            "text": "However, Mickey Mouse was created in the United States (US). The character's copyright protection in the US has lasted for 95 years. The loveable mouse was first expected to enter the public domain in 1984, but the length of copyright protection was extended by the US Congress by 20 years. Mickey’s copyright protection was next expected to expire in 2004 but the Sonny Bono Copyright Term Extension Act extended the length of  protection again for another 20 years.   "
        },
        {
            "text": "For countries who have signed up to the Berne convention, such as the US, if a work is still within copyright in the country of origin, it would also be protected in the UK for the same length of time. But if a work has a shorter term in another country (like the early Mickey Mouse images in the US), protection also stops in the UK. "
        },
        {
            "heading": 3,
            "text": "The ‘bare necessities’ of intellectual property "
        },
        {
            "text": "Although the copyright for the ‘Steamboat Willie’ version of Mickey Mouse has lost its copyright protection, it should be noted that the mascot is still protected as a registered trade mark. While people are free to share, copy and adapt the early version of the mouse they cannot do this in a way that causes consumers to think that their work is sponsored by, or produced by, Disney. "
        },
        {
            "text": "It is also important to remember that copyright has expired only for the 1928 version of Mickey Mouse. Newer versions of the animation - such as Mickey in his famous red shorts and white gloves - will still be protected. "
        },
        {
            "text": "Mickey will not be alone on his trip to the public domain - he will be joined by the original designs of pal Minnie and arch-nemesis Pete. "
        },
        {
            "heading": 3,
            "text": "Dreams can come true with licensing "
        },
        {
            "text": "Two years after the famous animation was created, Disney published a book through Bibo and Lang. The first Disney-licensed book, The Mickey Mouse book, was a hit, selling out before the end of the year. This book was followed up by many more from Disney which continue to be made and sold today. "
        },
        {
            "text": "Like other businesses, Disney can grant permission for others to use their IP by using a licensing agreement. A licence is an agreement between an IP right owner and another party. It grants the other party permission to do something that would, otherwise, be an infringement of the IP owner’s rights. "
        },
        {
            "text": "Every World Book Day, and all year round, Disney character costumes appear in the shops ready for little ones to experience the magic of Disney themselves."
        },
        {
            "text": "I think it's great how generations of families can continue to enjoy the antics of Disney's iconic mouse and his intellectual property as he lives happily ever after. "
        },
        {
            "text": "That's all folks. "
        },
        {
            "text": "The End."
        }
    ]
}