{
    "url": "https://stratcommand.blog.gov.uk/2024/03/07/national-protective-security-authority-training-for-gdp-officers/",
    "title": "National Protective Security Authority Training for GDP Officers",
    "authors": [
        "abievans"
    ],
    "categories": [
        "Gibraltar",
        "Overseas Bases"
    ],
    "pub_date": "2024-03-07T12:34:12+00:00",
    "content": [
        {
            "text": "Three Gibraltar Defence Police (GDP) officers have returned to Gibraltar after spending a week conducting National Protective Security Authority Training near Bedford, United Kingdom."
        },
        {
            "text": "During the course, Police Constable (PC) Seleen Celecia, PC Joe Martinez and Police Sergeant Jansen Guy were taught the importance of preparedness in relation to delivering an effective response during a terrorist related incident."
        },
        {
            "text": "Delegation and teamwork whilst dealing with such incidents are crucial and this course taught the officers how to delegate tasks and roles that work in unison to maximise information gathering and response."
        },
        {
            "text": "The officers understood the signs and behaviours of possible hostile reconnaissance which would play a vital role in the deter, detect, delay, mitigate and response security principles which could disrupt such attack from happening."
        },
        {
            "text": "The week-long course, which was both theory and practical based, involved informative slideshows with end of section exams and questionnaires as well as immersive practical based scenarios in which the three officers needed to undertake the role of a CCTV Operator, PA announcer/Radio Communicator and Supervisor."
        },
        {
            "text": "On completion of the course, officers received the Security Control Room Operator’s Certificate and will now have further advanced training in the specialisation of the GDP Control Room."
        },
        {
            "text": "GDP’s PC Seleen Celecia said: \"The Responding to Terrorist Incidents - Security Control Room Course was a fantastic course because it allowed me to learn about the importance of an effective response when dealing with terrorist incidents."
        },
        {
            "text": "We were able to learn various roles and skills in live scenario based exercises and we can now confidently say we are able to deliver the most effective response if we were to be faced with such incident\" - 'Acting fast will save lives.”"
        }
    ]
}