{
    "url": "https://defradigital.blog.gov.uk/2024/03/07/spotlight-on-talent-development-meet-fast-streamer-gianmarco-zenzola/",
    "title": "Spotlight on talent development: Meet Fast Streamer Gianmarco Zenzola",
    "authors": [
        "Gianmarco Zenzola"
    ],
    "categories": [
        "Defra digital",
        "Defra service design"
    ],
    "pub_date": "2024-03-07T07:00:27+00:00",
    "content": [
        {
            "text": "In the latest of our personal stories from colleagues who are on a talent development programme here in Defra, we meet Fast Streamer Gianmarco Zenzola."
        },
        {
            "text": "Hi, I’m Gianmarco and I’m a first year Digital, Data, Technology and Cyber Fast Streamer currently in my first placement working as a Product Manager in the Enterprise Collaboration team within Digital, Data and Technology Services at Defra."
        },
        {
            "text": "I joined the Fast Stream as an existing Civil Servant, having worked briefly as a HR Officer in the Department of Health and Social Care in 2018, before moving to HMRC as an AO Caseworker and later progressing to a HEO Tax Compliance Officer role."
        },
        {
            "text": "I first heard about the Fast Stream via an article about development opportunities on the intranet at HMRC. I then visited the Fast Stream website to learn more."
        },
        {
            "heading": 2,
            "text": "Why I joined the Fast Stream"
        },
        {
            "text": "What initially attracted me to the Fast Stream was the opportunity to gain diverse work experience in different government departments and advance my career. I chose the Digital, Data, Technology and Cyber scheme because it resonated with me due to my previous background in computing and IT."
        },
        {
            "text": "I started the scheme last October, beginning with a week-long Fast Stream induction event, or ‘Base Camp’ as it’s known. Base Camp was an intense mix of induction events and training sessions, but also a fantastic experience."
        },
        {
            "text": "I got to work with other new starters from different backgrounds to complete interesting challenges, designed to simulate the role of a policy official. This was a great way to prepare ourselves for what the Fast Stream had to offer, whilst also building up a support system of other Fast Streamers."
        },
        {
            "text": "I then moved straight into my first placement, here in Defra Digital Data and Technology Services, as a Product Manager in the Enterprise Collaboration team. In my first three months here, I’ve taken a lead role on a project to define a strategy for apps within Microsoft Teams and implement the relevant process in collaboration with colleagues across many different teams."
        },
        {
            "heading": 2,
            "text": "A typical day"
        },
        {
            "text": "My typical day involves a blend of strategic planning, cross-functional collaboration, and continuous learning. This could mean team meetings to discuss progress, share updates, and address any immediate challenges, followed by a learning session to study relevant product management frameworks, or deepen my understanding of the Microsoft Teams' ecosystem."
        },
        {
            "text": "At the end of each day, I take some time to document progress, update project plans, and track any action items. This enables me to apply my skills in project management, stakeholder engagement, and effective communication, and I'm proud of the impact I have made so far."
        },
        {
            "text": "Although there is no formal qualification on the Digital scheme, the Fast Stream provides structured training and development opportunities throughout. This includes workshops, seminars, and on-the-job training."
        },
        {
            "text": "We also get informal support through access to a range of peer networks, such as the Carers Network, Regional Network, and Science & Technology network, as well as being assigned a \"buddy\" (a second or third year Fast Streamer who can give advice about how to make the most of your time on the scheme)."
        },
        {
            "text": "Already, I've engaged in so many professional development opportunities, including training sessions and workshops on advising and briefing ministers, parliamentary capability, and big data."
        },
        {
            "heading": 2,
            "text": "What I’ve learned so far"
        },
        {
            "text": "One of the most valuable lessons I've taken from my Fast Stream experience so far (and the Civil Service in general) is the power of collaboration. It may sound cliched, but I've learned that seeking help and input from colleagues and/or managers not only improves your decision-making, but also helps you build stronger relationships and take the pressure off in particularly intense moments."
        },
        {
            "text": "Once my placement here ends next Autumn, I’ll go on to do two more year-long placements in different government departments as part of the Fast Stream. I don’t really have a fixed idea of what I want to do after the scheme ends yet (I’ve still got just over two and a half years to decide), but my goal is to continue advancing within the Civil Service, using the experience I gain on scheme to drive positive change and innovation."
        },
        {
            "text": "Looking further ahead, I am keen to move into leadership roles, where I could apply the leadership skills honed during the Fast Stream to guide teams and/or departments. If my career path leads me back to Defra, all the better – everyone has been so supportive and it’s been a great culture to start my Fast Stream journey in."
        },
        {
            "text": "If anyone reading this is thinking of applying to the Fast Stream, I would absolutely encourage you to do so. My experience has been both stretching and rewarding, and there hasn’t been a dull moment since I started!"
        },
        {
            "text": "One thing in particular that I found really helped me to feel prepared for this next step in my career was getting myself a mentor, someone who had experience in a related field. They provided me with guidance and offered valuable advice on career development."
        }
    ]
}