{
    "url": "https://medregs.blog.gov.uk/2023/11/21/antimicrobial-resistance-how-were-supporting-innovative-solutions-to-a-looming-global-health-emergency/",
    "title": "Antimicrobial resistance: How we’re supporting innovative solutions to a looming global health emergency",
    "authors": [
        "George Mitchell"
    ],
    "categories": [
        "antimicrobial resistance (AMR)"
    ],
    "pub_date": "2023-11-21T11:22:26+00:00",
    "content": [
        {
            "text": "World AMR Awareness Week (WAAW) is an annual global campaign from 18-24 November that raises awareness and understanding of antimicrobial resistance (AMR), a global health issue worsened by the misuse of antimicrobial agents such as antibiotics. "
        },
        {
            "text": "AMR can lead to infections becoming impossible to treat, increasing the risk of severe illness and death. Below, we take a look at how experts at the Medicines and Healthcare products Regulatory Agency (MHRA) South Mimms Laboratories, are supporting the development of potentially lifesaving alternatives."
        },
        {
            "text": "Since Sir Alexander Fleming’s chance discovery of penicillin almost 100 years ago, in some contaminated Petri dishes he forgot about on his holidays, we’ve lived safe in the knowledge that any bacterial infection can be cured with a course of antibiotics. However, through the misuse of antibiotics and other antimicrobials, we’ve unknowingly wandered into a biological arms race against bacteria a century in the making, and we’re losing."
        },
        {
            "text": "Our overreliance on antimicrobials has accelerated the resistance of bacteria, fungi and parasites, reducing their effectiveness against infections to as little as zero in some cases. With the development of new antimicrobials being a lengthy and complex process, time is running out to find solutions to this global health issue, which is expected to be a bigger killer than cancer by 2050."
        },
        {
            "text": "From new diagnostic techniques that ensure antibiotics are only used for bacterial infections, to new bacterial vaccines reducing the need for antimicrobial therapies, we need truly novel cross-functional approaches to tackle the problem."
        },
        {
            "text": "Our world-leading scientists at our South Mimms Laboratories are taking a proactive approach to supporting innovation in addressing this urgent issue. Through the supply of 95% of all World Health Organization International Standards and Reference Reagents (materials that help manufacturers measure the quality of their products), we’re supporting the research and development of novel antimicrobial therapies and alternative treatments in the UK and around the world."
        },
        {
            "text": "Our activities to support solutions to AMR include close collaboration with the emerging microbiome research community, bacteriophage innovators, novel diagnostics developers, and those making new bacterial vaccines."
        },
        {
            "text": "The microbiome is a whole microscopic world living inside and on our bodies. The microbiome is complex and dynamic network of microorganisms, and its unique position between our bodies and the environment means it can frequently change in response to internal and external factors. These changes can have a huge impact on our health and on the effectiveness of the treatments we receive."
        },
        {
            "text": "Harnessing the potential of this network of trillions of microorganisms could help inform the way drugs are delivered, where they’re targeted and even lead to the development of novel medicines."
        },
        {
            "text": "The microbiome also has the potential to be a key tool in the fight against antimicrobial resistance. Research supported by our scientists has discussed how using faecal transplants to introduce good bacteria to the body, can provide an alternative treatment for bacterial infection when faced with antimicrobial resistant strains."
        },
        {
            "text": "Despite the demonstrated potential of microbiome research to provide solutions for overcoming AMR, amongst other diseases, the field is still in its early stages, raising concerns over lack of consistency and alignment across studies. To support this, we’ve developed and manufactured DNA and whole cell standards for the microbiome, to ensure research is of the highest quality, providing assurance of the performance of assays to analyse the safety of future products."
        },
        {
            "text": "Beyond the development of new therapies, we may have some natural allies in the fight against AMR in the form of bacterial predators called bacteriophages. These are viruses, but not as you may know them. Naturally occurring in the environment wherever bacteria exist, bacteriophages are hugely abundant and can be adapted to target specific bacteria."
        },
        {
            "text": "Bacteriophage technology is of great interest globally and we recently contributed to the UK Parliamentary enquiry into the potential of bacteriophage therapies to tackle AMR. As part of this select committee, we highlighted the challenges and gaps in bacteriophage regulation, and what we can do to ensure their safety and effectiveness for patients."
        },
        {
            "text": "An unexpected potential solution to AMR could come in the form of bacterial vaccines, the most well-known being outer membrane vesicle vaccines, or OMVs. By removing the internal structures within a bacterium and delivering only its shell in the form of the OMV into the body, our own immune system could raise a response and then recognise these bacteria in the future and fight infection for us."
        },
        {
            "text": "Our use of vaccines will be vital in combating AMR, either directly by targeting infections which are resistant to antibiotics or indirectly in combination with accurate diagnostics by targeting viral diseases for which antibiotics are often wrongly prescribed. We’re also supporting vaccine innovators with investigations into novel, needle-free delivery of vaccine candidates such as those against group A and B streptococci. This could support with global accessibility to vaccines, especially in low and middle-income countries where needle-free delivery can be conducted without the need for specialist training. Through the development of new standards and quality assays, we can also provide a benchmark for manufacturers to measure vaccine effectiveness."
        },
        {
            "text": "As the UK medicines regulator, the MHRA plays a vital role in providing guidance to support innovators through the regulatory process towards product authorisation, ensuring our high standards for quality, safety and effectiveness are met."
        },
        {
            "text": "Regulatory guidance is based on years of research, evidence and experience, but with so many solutions to the AMR problem being new, this evidence is lacking, and regulatory guidance remains immature. A lack of guidance for innovators can create delays in assessment, increasing the time taken for novel therapies to reach patients. Time that’s swiftly running out."
        },
        {
            "text": "To address this issue now, we’re engaging with innovators as early as possible in the development of novel treatments and diagnostics, to identify what products they’re developing so we can have the right guidance ready for them before they make a submission for authorisation."
        },
        {
            "text": "AMR is a complex problem, and not just a human one. Therefore, the MHRA is actively working with regulators across the world to tackle it, recently joining the Transatlantic Taskforce on Antimicrobial Resistance (TATFAR), as well as with other agencies in the UK such as the Food Standards Agency, Veterinary Medicines Directorate, and UK Health Security Agency to ensure we’re taking an holistic, One Health approach."
        },
        {
            "text": "These activities are many and broad, so we’ve now launched our own AMR working group to bring together all the expertise from across our network at the MHRA and with our partners so we can tackle AMR together."
        },
        {
            "text": "We want to support innovation and collaborate with scientists from around the world to deliver the highest quality scientific research and you can see examples of our work in the open access publications on our website."
        }
    ]
}