{
    "url": "https://defrafarming.blog.gov.uk/2023/11/21/apply-now-for-a-slurry-infrastructure-grant/",
    "title": "Apply now for a Slurry Infrastructure grant",
    "authors": [
        "Thomas Proudfoot"
    ],
    "categories": [
        "Payments for equipment, technology and infrastructure"
    ],
    "pub_date": "2023-11-21T10:49:58+00:00",
    "content": [
        {
            "text": "I’m pleased to say you can now apply for a Slurry Infrastructure grant. "
        },
        {
            "text": "In this round, Round 2, £74 million of grant funding is available. This is more than double the funding available in Round 1.  "
        },
        {
            "text": "With more funding available, we’d strongly encourage everyone who wants to improve their slurry storage to apply for a grant. There will be one further round in 2024. "
        },
        {
            "text": "Round 2 has been significantly improved on feedback from industry and farmers who applied last year. I blogged about these changes in October. "
        },
        {
            "text": "In this post, I’ll set out process to apply links to learn more. And, if you haven’t already signed up, we’re hosting a webinar to walk through the application process, share tips and answer your questions. Register to attend the webinar on 23 November. If you can’t attend, don’t worry. We’ll share a recording of the webinar in this post once it ends.  "
        },
        {
            "heading": 2,
            "text": "Applying for a Slurry Infrastructure grant "
        },
        {
            "text": "The Slurry Infrastructure grant guidance for Round 2 sets out who can apply, what the grant can pay for and the information you’ll need to provide when you apply.  "
        },
        {
            "heading": 3,
            "text": "1. Online checker "
        },
        {
            "text": "The first step to apply is the online checker. You can find it on the Slurry Infrastructure grant Round 2 page on GOV.UK. "
        },
        {
            "text": "The checker will tell you if you’re eligible to apply and how much grant funding you could get based on your storage needs.  "
        },
        {
            "text": "It’s been designed to be simple to use. You will need some important bits of information before you start, including details about your business, planned project and slurry storage capacity. "
        },
        {
            "text": "Make sure you use the latest version of the slurry wizard tool when calculating how much slurry storage you need.  "
        },
        {
            "text": "This has been through a comprehensive update, based on feedback from Round 1 applicants. We’ve also put together guidance to help you plan your slurry storage. "
        },
        {
            "text": "You will have until 17 January 2024 to use the checker. "
        },
        {
            "text": "Applications aren’t first-come-first-served, so take the time to get your details right. "
        },
        {
            "text": "If you applied in Round 1 but weren’t shortlisted, you won’t be automatically put forward for a grant in Round 2. So, make sure you reapply, updating any details that have changed over the last year. "
        },
        {
            "text": "Once applications close, we’ll look at how many projects we can fund. If necessary, we’ll run a shortlisting exercise. You can read about how we’ll do this in the guidance on GOV.UK."
        },
        {
            "text": "We’ll let everyone know whether their project has been shortlisted or not shortly after online applications close. "
        },
        {
            "heading": 3,
            "text": "2. Slurry store location and design check "
        },
        {
            "text": "If your project is shortlisted, the Rural Payments Agency (RPA) will send you a slurry store location and design check form.  "
        },
        {
            "text": "You’ll need to complete this by 30 September 2024.  "
        },
        {
            "text": "This will ask for details about your current and planned storage system. A team of specialists in the Environment Agency will review this to check your project will provide enough storage and comply with regulations.  "
        },
        {
            "text": "RPA or the Environment Agency may discuss changes with you to make sure your final project protects the environment and meet regulations.  "
        },
        {
            "text": "The check is designed to help you get your project right, and to prevent wasting time or money later. "
        },
        {
            "heading": 3,
            "text": "3. Full application "
        },
        {
            "text": "Once you’ve completed your slurry store location and design check, RPA will ask for some final details about your project and financing plans. You’ll also need to show that you’ve received planning permission. Submit your full application as soon as you’re ready, and by 27 June 2025 at the latest. "
        },
        {
            "heading": 3,
            "text": "4. Build and claim "
        },
        {
            "text": "Once all the checks are complete, you’ll receive a grant funding agreement setting out the amount of grant you could claim and the outputs agreed for your project. Make sure you don’t incur any eligible costs before your project start date.   "
        },
        {
            "heading": 2,
            "text": "Get advice "
        },
        {
            "text": "If you apply for a Slurry Infrastructure grant, you will be offered free advice from Catchment Sensitive Farming (CSF) about tackling pollution from slurry.  "
        },
        {
            "text": "This advice is optional, and there is a range of advice available to help you make the right decisions to improve slurry management on your farm.  "
        },
        {
            "text": "If you’re interested in advice before submitting an expression of interest, contact CSF by following the links to your area on GOV.UK, using the subject heading ‘Tackling pollution from slurry’. "
        },
        {
            "text": "You can also get free, independent business advice for your farm from a local provider in your area through the Farming Resilience Fund. "
        }
    ]
}