{
    "url": "https://earlyyears.blog.gov.uk/2023/11/21/getting-the-right-dbs-when-registering-with-ofsted/",
    "title": "Getting the right DBS when registering with Ofsted",
    "authors": [
        "Alex Magloire, Deputy Director, Early Years Regulatory Practice"
    ],
    "categories": [
        "Childminder registration",
        "Early years",
        "Nannies"
    ],
    "pub_date": "2023-11-21T15:10:55+00:00",
    "content": [
        {
            "text": "Childminders and childcare workers, such as nannies, are responsible for the safety and well-being of children in their care. Ofsted is legally required to check an applicant’s suitability at the point of registration. For daycare providers, it is the provider’s responsibility to carry out suitability checks on members of staff.  An enhanced criminal record check is an essential part of the suitability checking process."
        },
        {
            "text": "We recently published a blog about the work we are doing to speed up the registration process. But some applications still take longer than they should. Applicants often select the wrong type of DBS check, which can then delay submitting their application to Ofsted while they reapply for the correct one. We always encourage getting your DBS check from Matrix Security Watchdog."
        },
        {
            "text": "Common issues"
        },
        {
            "text": "Here are some of the most common issues we find with DBS checks for childcare registration:"
        },
        {
            "text": "1) Incorrect option selected under ‘position applied for’"
        },
        {
            "text": "You need to select the option closest to the role you’re applying to register as. The option selected may change the wording of the certificate. For example, if you’re applying to register as a childminder or live-in nanny, your certificate must state that it is for a ‘home-based’ role. Some applicants have worked in other parts of the early years sector before but have the wrong DBS check for these roles."
        },
        {
            "text": "2) Outdated DBS Checks"
        },
        {
            "text": "DBS checks provide a snapshot of a person’s criminal record at the time the certificate is issued. If your certificate is more than 3 months old, we cannot accept it unless you have subscribed to the update service, as the information contained with the check is no longer current. Although not mandatory, we strongly recommend subscribing to the update service."
        },
        {
            "text": "3) Lack of an enhanced check or barred lists check"
        },
        {
            "text": "These checks provide comprehensive information, including police records and other relevant information. Without an enhanced check or barred lists check, important details may be overlooked."
        },
        {
            "text": "4) Name and address history discrepancies"
        },
        {
            "text": "Mismatches between any previous names and the address history on your DBS certificate compared with the information you have given us can lead to confusion and delays. Make sure to include all previous names and addresses on both your DBS and Ofsted application forms and ensure these align."
        },
        {
            "text": "5) Providing the right identification"
        },
        {
            "text": "Once you apply for your criminal records check, you must progress your application through all the steps, including providing the right ID. We find that some applicants, especially household members turning 16, do not have appropriate ID ready when applying and this slows down the application process. There is full guidance available to help you with this."
        },
        {
            "text": "Common myths about DBS checks"
        },
        {
            "text": "We process around 30,000 forms every year and each applicant and person connected to an application or registration requires a DBS check. We take a proportionate and risk-based approach to information contained in a DBS check. Some certificates that we process contain previous convictions, but this does not necessarily mean you are not suitable to provide childcare or be in regular contact with children. Our priority is to always consider what is right for children, and to reduce any risk of harm, as set out in our enforcement policy."
        },
        {
            "text": "Impact on application timeliness"
        },
        {
            "text": "The application timescale does not start until the completed form is accepted, along with any accompanying forms from assistants or household members. However, we know a lot of applicants struggle to get to this stage due to having the wrong DBS."
        },
        {
            "text": "To make sure you get the right DBS, we encourage you to do this via the Ofsted DBS application website and read our full guidance on how to get the right one for the role you’re applying for."
        },
        {
            "text": "Errors in DBS applications can significantly affect the application process. We aim to register applicants within 12 weeks, but this time only starts once we have accepted your application to register. If you use Matrix Security Watchdog to get your DBS, it will usually take around 4 or 5 weeks to receive your DBS through the post, so please factor this into your planning. Sometimes it is quicker, but it often depends on whether you're able to complete the stages quickly."
        },
        {
            "text": "Child protection is paramount for all childcare professionals, and enhanced criminal record checks are an essential aspect of ensuring a safe environment for children. By resolving issues related to DBS checks, such as non-home-based checks, outdated certificates or lack of an enhanced check, we can make sure we are helping those who want to join the childcare sector to register without delay."
        }
    ]
}