{
    "url": "https://rpc.blog.gov.uk/2023/11/21/how-the-rpc-produces-its-opinions/",
    "title": "How the RPC produces its opinions",
    "authors": [
        "Stephen Gibson"
    ],
    "categories": [
        "Better regulation",
        "Independent scrutiny"
    ],
    "pub_date": "2023-11-21T17:13:35+00:00",
    "content": [
        {
            "text": "Every year, the RPC reviews over 100 impact assessments and post-implementation reviews to assess whether they are fit for purpose and how they could be improved. I am often asked about the process that the RPC committee and secretariat use to produce our opinions."
        },
        {
            "text": "Of course, the Government’s launch of the reformed Better Regulation Framework in September will make a difference to our work, but whether it is Impact Assessments, Options Assessments or Post-implementation Reviews, the broad stages that we follow remain the same."
        },
        {
            "text": " "
        },
        {
            "heading": 6,
            "text": "(right-click \"open in new tab\" should offer a larger version which may be more legible)"
        },
        {
            "text": " "
        },
        {
            "text": "We aim to complete the full process in 30 days. Where we issue an ‘Initial Review Notice’ (IRN – see below), this is extended to account for revisions to assessments and an extra 15 days for scrutiny. We prioritise particularly urgent cases to ensure that they are handled as quickly as possible."
        },
        {
            "heading": 3,
            "text": "Ongoing engagement with departments"
        },
        {
            "text": "The RPC’s involvement starts before anything is submitted for review. The RPC secretariat maintains ongoing engagement with departments through ‘Account Managers’, who meet with the departmental Better Regulation Units (BRUs) across Whitehall regularly. These meetings are to offer guidance on the Better Regulation Framework, consider methodological issues, advise departments on when RPC scrutiny is required and flag when assessments will be submitted for scrutiny, so that we can manage our workload."
        },
        {
            "text": "In some cases, we hold specific ‘pre-submission’ meetings for departments – ideally as early as possible before submission. These are an opportunity for departments to raise any specific issues or methodological questions ahead of submission."
        },
        {
            "heading": 3,
            "text": "Secretariat Lead review"
        },
        {
            "text": "When an assessment is submitted to the RPC, the secretariat first assigns a casework team. This includes a Committee Lead together with a lead economist and lead policy official (normally the departmental ‘Account Manager’) from the secretariat."
        },
        {
            "text": "The lead economist reviews the assessment in line with the requirements of the Better Regulation Framework and the Green Book. They are supported in doing so by a policy official who provides the policy context to the regulation being proposed and ensures consistency with previous, related submissions. A draft opinion (or IRN, if the assessment is not considered to be fit for purpose) is produced by the secretariat leads. Further information on how we scrutinise assessments is available here."
        },
        {
            "text": "In parallel with its review, the secretariat provides the Committee Lead with the assessment and relevant information relating to the case in question."
        },
        {
            "heading": 3,
            "text": "Secretariat peer review"
        },
        {
            "text": "Once the secretariat leads have agreed upon a first draft, this is shared across the secretariat to provide checks on accuracy and consistency. A final draft opinion (or IRN, where appropriate) is signed off by both the Senior Economist and the Head of the RPC Secretariat. This secretariat-level approved draft is then sent as a recommended response to the Committee Lead to consider and comment upon."
        },
        {
            "heading": 3,
            "text": "Committee Lead review"
        },
        {
            "text": "Committee Leads then have a five working day window to review the recommended draft shared with them by the secretariat leads. This recommendation will advise issuing a fit-for-purpose opinion, an IRN, or a not-fit-for-purpose opinion. During this time the Committee Lead may either endorse the recommendation made by the secretariat or challenge aspects and request that the secretariat provide a revised draft for their consideration."
        },
        {
            "heading": 3,
            "text": "Full committee review, sign-off, issue and publication"
        },
        {
            "text": "Once a final draft opinion has been signed off by the Committee Lead, it is circulated to the entire committee for ‘Collective Agreement’ - typically the committee have two working days to provide their comments."
        },
        {
            "text": "As soon as it has been agreed and signed-off, the final opinion is issued to the department. It is subsequently published on our website, either in parallel with the publication of the assessment, or when the Bill or SI is laid before Parliament (irrespective of whether or not the assessment has been published). A full list of published RPC opinions is available here."
        },
        {
            "text": " "
        }
    ]
}