{
    "url": "https://environmentagency.blog.gov.uk/2023/11/21/internships-with-the-regulated-industry-team-tushals-story/",
    "title": "Internships with the Regulated Industry team – Tushal’s story.",
    "authors": [
        "Environment Agency"
    ],
    "categories": [
        "Environment Agency",
        "Waste"
    ],
    "pub_date": "2023-11-21T12:23:01+00:00",
    "content": [
        {
            "text": " "
        },
        {
            "text": "About me:"
        },
        {
            "text": "In a world facing unprecedented environmental challenges, the choices we make can shape the future of our planet. In this blog, I'll take you through why I chose the Environment Agency and why I believe it's a crucial step towards creating a sustainable and thriving world."
        },
        {
            "text": "I am a newly trained graduate from Royal Holloway University of London graduating in BSc environmental geoscience. For the last three years I have been an active member of the Royal Geology Programme London, where I have participated in lectures about the issues facing our modern-day climate and geology. I interned as a Regulated Industries officer in the East Midlands team for three months, as part of the summer internship programme by the environment agency."
        },
        {
            "text": "The next step in my journey is completing my master’s degree in Geo-energy at the University of Edinburgh."
        },
        {
            "text": "Why the Environment Agency?"
        },
        {
            "text": "I really resonated with the purpose that lies at the heart of the Environment Agency – people seeking to create positive change."
        },
        {
            "text": "Working here means I get to be a part of a mission that goes beyond the ordinary 9-to-5 routine. Every task, every decision, and every effort made is geared toward ensuring the health and sustainability of our environment. It’s an inspiring and purpose-driven workplace."
        },
        {
            "text": "Also, the flexible work-life balance the Environment Agency offers was a huge bonus. Being able to work from home or alter the time a shift starts creates a sense easiness around the workspace."
        },
        {
            "text": "What have you been up to?"
        },
        {
            "text": "Honestly, the broad range of internship roles at the environment agency available left me spoiled for choice. My passion is the conservation of the environment, and through a placement with the Regulated Industry team I have been able to pursue my passion through many different ways."
        },
        {
            "text": "The Regulated Industry team operates in various sectors and through shadowing officers, I have travelled all over the East Midlands to visit lots of different sites."
        },
        {
            "text": "Site visits allow for a more hands-on experience. I’ve had the chance to physically experience how companies are trying to combat the environmental issues that affect our everyday lives."
        },
        {
            "text": "Over three months I was able to see a wide range of industries which the EA team regulate."
        },
        {
            "text": "We went on-site at an installation to understand how large chemical facilities comply safely with industry standards. We also visited a waste transfer station to look at dust suppression technologies, and how municipal waste is sorted and used, and a car garage within the local area to understand how to identify the storage and transfer of hazardous waste. We also went to landfill sites, both closed and still in operation, and saw how they monitor gas emission rates using a gas probe."
        },
        {
            "text": "All were very fascinating and very different, but I very quickly learnt that even the smallest of business has a significant impact on the environment."
        },
        {
            "text": "How was your experience?"
        },
        {
            "text": "Being a regulatory officer provides a spectrum for a broad career pathway. The Environment Agency has allowed me the opportunity to be a part of multiple support packages from food and drink, to landfill and hazardous waste. There is something for everyone."
        },
        {
            "text": "Day-to-day, as an officer you never focus on just one task. From scoring compliances, to handling emergency duty desk calls or working closely with enforcement teams; regulated industries always have something to offer."
        },
        {
            "text": "By sitting in on weekly meetings I saw first-hand the teams’ professionalism. Watching how officers handle clients was like a crash course in splendid customer engagement."
        },
        {
            "text": "Working at the Environment Agency is an opportunity to merge passion with profession, to be part of an organisation that holds the planet's well-being as its highest priority. Over the last 3 months the EA has created a supportive environment for me to tap into the reality of working life and build a networking platform of like-minded colleagues. Whether you're an advocate for clean water, a guardian of biodiversity, or a steward of natural resources, the Environment Agency offers a platform to turn your passion into a meaningful and fulfilling career. It's a journey of purpose, impact, and a commitment to leaving the world a better place for our future generations."
        },
        {
            "text": "What advice would you give to anyone considering an internship with the EA?"
        },
        {
            "text": "Welcome to the Environment Agency! As future interns, you're stepping into an organization dedicated to protecting and preserving our environment. Your 3-month journey here will be an exciting and impactful one. There is plenty of opportunity to learn, collaborate, and contribute to vital environmental initiatives. Embrace the variety of unique sectors that the EA has to offer and try imagining your future self, working within one of the many teams you will be part of during your time at the EA."
        },
        {
            "text": "Are you interested on an internship at the EA? "
        },
        {
            "text": "Find out more information about the early career opportunities, including internships, industry placements and apprenticeship opportunities at the Environment Agency by visiting Early careers - Environment Agency (environmentagencycareers.co.uk)."
        }
    ]
}