{
    "url": "https://food.blog.gov.uk/2023/11/21/path-safe-taking-a-one-health-approach-to-antimicrobial-resistance/",
    "title": "PATH-SAFE: Taking a “One Health” approach to Antimicrobial Resistance",
    "authors": [
        "Dr Shona O’Rourke, PATH-SAFE Research Programme Manager"
    ],
    "categories": [
        "Science"
    ],
    "pub_date": "2023-11-21T08:53:34+00:00",
    "content": [
        {
            "text": "Cymraeg"
        },
        {
            "text": "For World Antimicrobial Resistance Awareness Week, the Pathogen Surveillance in Agriculture, Food and the Environment programme (PATH-SAFE)  will be showcasing some of the antimicrobial resistance research activities that are underway across the programme. "
        },
        {
            "text": "Check out our PATH-SAFE page for more info and updates on our innovative work as the week progresses!"
        },
        {
            "text": "While the rapid detection, identification and tracking of pathogens has always been fundamental to public health, recent advances in DNA-based methods have provided a step-change in our ability to do this."
        },
        {
            "text": "Modern genome sequencing offers the means to identify pathogen and resistance strains rapidly and cheaply with a high resolution. From this, we can reconstruct chains of transmission and trace outbreaks to their source. Coupling this step-change with a collaborative One Health approach (taking a systems-based view, integrating human, animal, and environmental health) to complex cross-sector research allows for a dynamic and innovative space. Within this space we can generate new evidence and knowledge in ways we have not been able to achieve before."
        },
        {
            "text": "The PATH-SAFE programme is a £19.2m Shared Outcomes Fund (SOF) research programme which will pilot the development of a national surveillance network. This will use the latest DNA-sequencing technology and environmental sampling to improve the detection, and tracking of foodborne disease and antimicrobial resistance (AMR) through the whole agri-food system from farm-to-fork."
        },
        {
            "heading": 2,
            "text": "Building on existing initiatives from across the UK to tackle AMR"
        },
        {
            "text": "Due to conclude in March 2024, the programme aims to provide better data to identify the prevalence, source and pathways of foodborne disease and antimicrobial resistance (AMR), helping to prevent the spread by enhanced targeting of interventions. To do this, it has brought together and built on existing initiatives from across the UK. We’ve developed new activities and worked to understand what end-users need to improve how they work in this space."
        },
        {
            "text": "PATH-SAFE has explored the application of advanced genomic technologies to improve control and reduce disease via routes such as:"
        },
        {
            "text": "​Through this pilot project, we have taken a One Health approach via the establishment of a cross-sector collaboration, which includes:"
        },
        {
            "text": "Data interoperability and shared best practice not only allows for the tracking of pathogens across government departmental boundaries of responsibility but also offer major efficiencies in terms of future procurement and resource needs."
        },
        {
            "text": "The programme is made up of four workstreams (WS):"
        },
        {
            "text": "The AMR research activities within these workstreams can be described in three categories:"
        },
        {
            "heading": 3,
            "text": "AMR and Data Systems"
        },
        {
            "text": "The data systems category includes the development of two data systems in WS1a and WS4. The WS1a system aims to establish a new data platform that will allow for the analysis and sharing of pathogen sequence and source data, collected from multiple locations across the UK by government departments and public organisations."
        },
        {
            "text": "This single system will enable rapid identification and tracking of foodborne disease and AMR, improving public health and minimising the economic and environmental impact of outbreaks. The system will be focusing on Salmonella as an exemplar pathogen for the pilot conducted within this programme."
        },
        {
            "text": "The WS4 system has been developed in a modular format, with this pilot phase focusing on the development of a prototype environmental AMR data module. Future development of the system could see additional modules developed to encompass additional data types and encompass the full One Health system.​"
        },
        {
            "heading": 3,
            "text": "AMR and Novel and enhanced surveillance:"
        },
        {
            "text": "The novel and enhanced surveillance category includes six projects:"
        },
        {
            "heading": 3,
            "text": "Filling knowledge gaps on AMR:"
        },
        {
            "text": "The filling knowledge gaps category includes four projects:"
        },
        {
            "text": "The outputs from the PATH-SAFE programme will contribute to the current five-year National Action Plan (NAP - 2019-2024)  and are expected to underpin activities proposed in the NAP refresh in 2024, as well as contributing to wider government strategies (e.g. Biological Security Strategy). Lessons learned and best practice will also be shared following our experience of developing a large-scale, complex programme taking a One Health approach."
        },
        {
            "heading": 2,
            "text": "WAAW, APHA, and us"
        },
        {
            "text": "For World Antimicrobial Awareness Week (WAAW) our programme partners will be showcasing some of the AMR work they have undertaken across the programme."
        },
        {
            "text": "The Animal & Plant Health Agency (APHA) will be publishing social posts which cover their work on the PATH-SAFE programme."
        },
        {
            "text": "The Environment Agency will also be promoting five newly published reports on environmental AMR surveillance, all of which were funded by PATH-SAFE workstream 4."
        },
        {
            "text": "Please check our website throughout World Antimicrobial Resistance Awareness Week for further information and links to exciting updates as the week progresses."
        },
        {
            "heading": 1,
            "text": "Teitl: PATH-SAFE: Defnyddio dull ‘Iechyd Cyfunol’ gydag Ymwrthedd Gwrthficrobaidd"
        },
        {
            "text": "Ar gyfer Wythnos Ymwybyddiaeth y Byd o Ymwrthedd Gwrthficrobaidd, bydd y rhaglen Cadw Gwyliadwriaeth ar Bathogenau mewn Amaethyddiaeth, Bwyd a’r Amgylchedd (PATH-SAFE) yn arddangos rhai o’r gweithgareddau ymchwil ym maes ymwrthedd gwrthficrobaidd sydd ar y gweill ar draws y rhaglen."
        },
        {
            "text": "Bwriwch olwg dros ein tudalen PATH-SAFE am fwy o wybodaeth a diweddariadau ar ein gwaith arloesol wrth i’r wythnos fynd yn ei blaen!"
        },
        {
            "text": "Er bod canfod, enwi ac olrhain pathogenau’n gyflym wedi bod yn hanfodol i iechyd y cyhoedd erioed, mae datblygiadau diweddar mewn dulliau seiliedig ar DNA wedi darparu newid sylweddol yn ein gallu i wneud hyn."
        },
        {
            "text": "Mae’r dulliau cyfoes sydd gennym ni o ddilyniannu genomau yn cynnig modd i adnabod straeniau pathogenau ac ymwrthedd yn gyflym ac yn rhad gyda chydraniad uchel. Ar sail hyn, gallwn ail-greu cadwyni trosglwyddo ac olrhain brigiadau o achosion (outbreaks) i’w tarddiad. Mae cyfuno’r newid sylweddol hwn â dull cydweithredol Iechyd Cyfunol tuag at ymchwil draws-sector gymhleth (hynny yw trwy feddwl ar sail systemau, gan integreiddio iechyd pobl, anifeiliaid a’r amgylchedd) yn caniatáu amgylchedd gwaith deinamig ac arloesol. Yn y fath amgylchedd gwaith, gallwn gynhyrchu tystiolaeth a gwybodaeth newydd mewn ffyrdd nad ydym wedi gallu gwneud o’r blaen."
        },
        {
            "text": "Rhaglen ymchwil gwerth £19.2m drwy’r Gronfa Canlyniadau a Rennir (SOF) yw PATH-SAFE a fydd yn treialu’r gwaith o ddatblygu rhwydwaith gwyliadwriaeth cenedlaethol. Bydd hyn yn defnyddio’r dechnoleg dilyniannu DNA ddiweddaraf a samplu amgylcheddol i wella’r gwaith o ganfod ac olrhain clefydau a gludir gan fwyd ac ymwrthedd gwrthficrobaidd (AMR) drwy’r system fwyd-amaeth gyfan, o’r fferm i’r fforc."
        },
        {
            "heading": 2,
            "text": "Adeiladu ar fentrau presennol o bob rhan o’r DU i fynd i’r afael ag AMR"
        },
        {
            "text": "Disgwylir i’r rhaglen ddod i ben ym mis Mawrth 2024, a nod y rhaglen yw darparu data gwell i nodi pa mor gyffredin yw clefydau a gludir gan fwyd ac AMR, yn ogystal â nodi tarddiad a llwybrau’r rhain, gan helpu i atal lledaeniad trwy dargedu ymyriadau’n well. I wneud hyn, mae wedi dwyn ynghyd ac adeiladu ar fentrau presennol o bob rhan o’r DU. Rydym wedi datblygu gweithgareddau newydd ac wedi gweithio i ddeall beth sydd ei angen ar ddefnyddwyr terfynol i wella sut maen nhw’n gweithio yn y maes hwn."
        },
        {
            "text": "Mae PATH-SAFE wedi archwilio’r defnydd o dechnolegau genomig datblygedig i wella rheolaeth a lleihau clefydau trwy lwybrau fel:"
        },
        {
            "text": "​Drwy’r prosiect peilot hwn, rydym wedi mabwysiadu dull Iechyd Cyfunol drwy fynd ati i drefnu cydweithrediad traws-sector, sy’n cynnwys:"
        },
        {
            "text": "Mae sicrhau gallu data i ryngweithredu a rhannu arferion gorau yn caniatáu olrhain pathogenau ar draws ffiniau cyfrifoldeb adrannau’r llywodraeth, yn ogystal â chynnig cryn effeithlonrwydd o ran anghenion adnoddau a chaffael yn y dyfodol."
        },
        {
            "text": "Mae’r rhaglen yn cynnwys pedair ffrwd waith (FfW):"
        },
        {
            "text": "Gellir disgrifio’r gweithgareddau ymchwil AMR o fewn y ffrydiau gwaith hyn mewn tri chategori:"
        },
        {
            "heading": 3,
            "text": "AMR a systemau data"
        },
        {
            "text": "Mae’r categori systemau data’n cynnwys datblygu dwy system ddata yn FfW1a ac FfW4. Mae’r system ar gyfer FfW1a yn ceisio sefydlu llwyfan ddata newydd a fydd yn caniatáu ar gyfer dadansoddi a rhannu dilyniannau pathogenau a data tarddiad, a gesglir o amryfal leoliadau ledled y DU gan adrannau o’r llywodraeth a sefydliadau cyhoeddus."
        },
        {
            "text": "Bydd y system unigol hon yn sicrhau bod modd nodi ac olrhain clefydau a gludir gan fwyd ac AMR yn gyflym, gan wella iechyd y cyhoedd a lleihau effaith economaidd ac amgylcheddol brigiadau o achosion. Bydd y system yn canolbwyntio ar salmonela fel pathogen enghreifftiol ar gyfer y peilot a gynhelir o fewn y rhaglen hon."
        },
        {
            "text": "Mae’r system ar gyfer FfW4 wedi’i datblygu ar ffurf fodiwlaidd, gyda’r cyfnod peilot hwn yn canolbwyntio ar ddatblygu modiwl data arbrofol ar gyfer AMR amgylcheddol. Wrth ddatblygu’r system yn y dyfodol, efallai y bydd modd datblygu modiwlau ychwanegol i gwmpasu mathau ychwanegol o ddata ac i gwmpasu’r system Iechyd Cyfunol gyfan."
        },
        {
            "heading": 3,
            "text": "AMR a gwyliadwriaeth newydd a gwell:"
        },
        {
            "text": "Mae’r categori gwyliadwriaeth newydd a gwell yn cynnwys chwe phrosiect:"
        },
        {
            "heading": 3,
            "text": "Llenwi’r bylchau mewn gwybodaeth am AMR:"
        },
        {
            "text": "Mae’r categori llenwi bylchau mewn gwybodaeth yn cynnwys pedwar prosiect:"
        },
        {
            "text": "Bydd yr allbynnau o’r rhaglen PATH-SAFE yn cyfrannu at y Cynllun Gweithredu Cenedlaethol pum mlynedd presennol (NAP – 2019-2024), a disgwylir iddynt fod yn sail i weithgareddau a gynigir yn y diweddariad i’r Cynllun Gweithredu Cenedlaethol yn 2024, yn ogystal â chyfrannu at strategaethau ehangach y llywodraeth (er enghraifft y Strategaeth Diogelwch Biolegol). Bydd gwersi a ddysgwyd ac arferion gorau hefyd yn cael eu rhannu yn dilyn ein profiad o ddatblygu rhaglen gymhleth ar raddfa fawr sy’n defnyddio dull Iechyd Cyfunol."
        },
        {
            "heading": 2,
            "text": "Wythnos Ymwybyddiaeth y Byd o Ymwrthedd Gwrthficrobaidd, yr Asiantaeth Iechyd Anifeiliaid a Phlanhigion, ac y ni"
        },
        {
            "text": "Ar gyfer Wythnos Ymwybyddiaeth y Byd o Ymwrthedd Gwrthficrobaidd, bydd ein partneriaid yn y rhaglen yn arddangos peth o’r gwaith AMR y maen nhw wedi’i wneud ar draws y rhaglen."
        },
        {
            "text": "Bydd yr Asiantaeth Iechyd Anifeiliaid a Phlanhigion (APHA) yn cyhoeddi negeseuon ar ei chyfrifon cyfryngau cymdeithasol a fydd yn trafod ei gwaith ar y rhaglen PATH-SAFE."
        },
        {
            "text": "Bydd Asiantaeth yr Amgylchedd hefyd yn hyrwyddo pum adroddiad sydd newydd eu cyhoeddi ar wyliadwriaeth AMR amgylcheddol, y cafodd pob un ohonynt eu hariannu gan ffrwd waith 4 y rhaglen PATH-SAFE."
        },
        {
            "text": "Cadwch olwg ar ein gwefan trwy gydol Wythnos Ymwybyddiaeth y Byd o Ymwrthedd Gwrthficrobaidd i gael mwy o wybodaeth a dolenni i ddiweddariadau cyffrous wrth i’r wythnos fynd yn ei blaen."
        }
    ]
}