{
    "url": "https://traderemedies.blog.gov.uk/2023/11/21/whats-the-cost-the-economic-case-for-trade-remedies/",
    "title": "What’s the Cost? – The Economic Case for Trade Remedies",
    "authors": [
        "Joshua Parker, Head of Economics Unit"
    ],
    "categories": [
        "Analysis"
    ],
    "pub_date": "2023-11-21T12:02:15+00:00",
    "content": [
        {
            "text": "Trade remedies protect domestic businesses against injury caused by dumped or subsidised imports, or unforeseen surges in imports. They usually take the form of ad valorem tariffs. The Trade Remedies Authority (TRA) conducts investigations to determine whether to apply trade remedies on certain imports."
        },
        {
            "heading": 2,
            "text": "To impose or not to impose, that is the question "
        },
        {
            "text": "Economic theory says free trade leads to increased welfare. Countries can specialise in producing things they are relatively better at making and more things can be produced overall."
        },
        {
            "text": "Conversely, economists argue that tariffs, including trade remedies, reduce total welfare by increasing trade barriers. Domestic producers benefit from reduced competition from international producers. The government also benefits due to increased tax revenue because . However, the benefits to the government and domestic producers are expected to be outweighed by the costs to domestic consumers who pay higher prices because of tariffs."
        },
        {
            "text": "So, if trade remedies are expected to reduce total welfare, why would we ever impose them?"
        },
        {
            "heading": 2,
            "text": "The case for trade remedies"
        },
        {
            "text": "Firstly, while the overall economy might benefit from reduced tariffs, some local areas may lose out. Where shrinking industries employ a significant proportion of the local population , a reduction in protection that tariffs afford could result in a localised loss in employment and increased deprivation."
        },
        {
            "text": "Where imports have been made cheaper due to government subsidies, international producers may have an unfair advantage over domestic producers. Trade remedies may help to correct for distortions caused by subsidies and create a more level playing field between domestic and international producers."
        },
        {
            "text": "Trade remedies may provide temporary protection and allow industries to adjust to changing circumstances. This is particularly true for safeguard measures which can only be in place for a maximum of eight years and require UK producers to include an adjustment plan showing how they intend to adapt to remain competitive once the measure is removed. It may also be true in cases where a domestic industry needs time to develop, such as with new technologies."
        },
        {
            "text": "Trade remedies may help to deter or correct for international predatory pricing. This is where a business dumps goods at low prices to force other businesses to exit the market. Such anti-competitive behaviour could lead to lower welfare in the future if they result in fewer businesses. However goods may be dumped for reasons other than predatory pricing and the empirical evidence on predatory pricing is weak."
        },
        {
            "text": "Trade protection can help to promote greater diversity of supply in situations where one country would otherwise have an overwhelming production advantage over others. Recent shocks to the global economy, such as the COVID pandemic and the Russian Invasion of Ukraine, have demonstrated some of the problems caused by over-reliance on individual countries for particular products. Sanctions imposed on Russian exports have led to substantial increases in energy costs due Europe’s dependence on oil and gas from Russia. More diversified supply chains can increase resilience in the face of external shocks. They can also increase the level of competition and reduce the risk of monopolies developing."
        },
        {
            "text": "Finally, trade remedies can act as a safety valve in certain areas whilst allowing for wider reductions in tariffs and other trade barriers. It is often true that liberalizing trade leads to concentrated losses and dispersed gains. This means the voices arguing against liberalisation may be more entrenched and organised than those in favour even though the benefits are greater than the costs. Trade remedies provide targeted protection which may help ease business concerns about the risks of reducing trade barriers."
        },
        {
            "heading": 2,
            "text": "How this affects the work of the TRA"
        },
        {
            "text": "While economic theory suggests there are benefits of reducing trade barriers and increasing free trade, there are arguments in favour of trade remedies in some situations. To ensure trade remedies are only used where needed, we conduct an Economic Interest Test on any potential measures to assess whether they are in the interests of the UK economy. We only apply measures for a limited period (up to five years) and review them regularly. We also use the Lesser Duty Rule to ensure that measures are no larger than necessary to correct for the level of dumping/subsidy, or to prevent to injury to UK producers."
        },
        {
            "text": "For more information on how we assess the economic impacts of potential trade remedy measures, please see our public guidance on the Economic Interest Test."
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        }
    ]
}