{
    "url": "https://defradigital.blog.gov.uk/2023/11/21/world-fisheries-day-2023-how-were-conducting-research-to-better-understand-recreational-freshwater-fisheries-in-wales-and-england/",
    "title": "World Fisheries Day 2023 – How we're conducting research to better understand recreational freshwater fisheries in Wales and England",
    "authors": [
        "Dr Dominic Berry"
    ],
    "categories": [
        "Defra digital",
        "Defra services",
        "User research"
    ],
    "pub_date": "2023-11-21T07:30:05+00:00",
    "content": [
        {
            "text": "On World Fisheries Day Dr Dominic Berry, a member of the Environment Agency’s’ ‘I Want to Fish’ team, reflects on a recently completed research project concerning recreational freshwater fisheries in Wales and England."
        },
        {
            "text": "For many people around the world, World Fisheries Day is about large-scale commercial fishing. But recreational fisheries are important in their own right. One million anglers in England and Wales, and three million throughout the UK, enjoy a very wide variety of settings in which to learn, relax and compete."
        },
        {
            "text": "Recreational fisheries are central to angling communities and rural economic development. Each fishery can differ drastically in size, the species they stock, permit costs, whether they complete sales online or in-person, and staff numbers, amongst many other things."
        },
        {
            "text": "Their variety makes it challenging for us to create new services to help fisheries because there is no ‘average’ fishery, and few safe assumptions which apply to them all. I want to share some key findings from recent research that we’ve been doing directly with fisheries, on behalf of the Environment Agency (EA)."
        },
        {
            "text": "The project put understanding the needs of fisheries at its centre to help the EA scope out new possible services that might help fisheries owners and managers to enjoy a fairer regulatory environment, one that also increases angler confidence."
        },
        {
            "heading": 2,
            "text": "A reel problem - not everyone buys a rod licence"
        },
        {
            "text": "Every year a minority of freshwater anglers fail to purchase their rod licence. In order to fish inland in Wales and England one must have both a rod licence, issued by a government body, and also a permit for those particular waters, which will be issued by whichever private entity owns the fishing rights."
        },
        {
            "text": "The relationship between fishing rod licences and fishing permits is similar to needing a driving licence to use the roads, but having to pay some particular person or company if you want to park somewhere.  Those who fish illegally enjoy all the benefits of the rod licence income, such as improvements to fishing environments, river works, fish stocking, etc., without making the same contribution as everyone else."
        },
        {
            "text": "From the outset the EA wanted to know how to aid fisheries that encounter anglers failing to purchase a rod licence. We knew that some sites were:"
        },
        {
            "text": "To begin with, three fishery operators were invited to take part in an hour-long interview session. Questions focused on what each fishery thought when it came to rod licence compliance, what they cared about when it came to an angler’s experience on their site, and whether there were further ways the EA could help them achieve their compliance goals."
        },
        {
            "text": "From these interviews we learned that even fisheries who check licences relatively regularly typically do so at the discretion of the water keeper, as a way to deal with anglers who they think might cause trouble or damage to their fish stocks. Others have been proudly checking rod licences prior to each purchase for many decades and enjoy the reputation that this brings them amongst anglers."
        },
        {
            "text": "Some of the fisheries always completed their sales in person, whereas some fisheries who were interested in asking for licence details only sold permits via a website. However, we had no idea how many fisheries conformed to any aspect of these descriptions."
        },
        {
            "heading": 2,
            "text": "We needed to dig a little deeper"
        },
        {
            "text": "We therefore needed to get a clearer understanding of the number of fisheries who completed sales online or in-person, and the number of fisheries asking for rod licences at any point during an angler’s visit. These were questions best answered by market research."
        },
        {
            "text": "Five-minute telephone interviews were subsequently carried out with 50 fisheries covering 39 different counties in Wales and England.  We know that there are around 10,000 sites listed as fishing waters in England and Wales, covering everything from the largest fishery to the smallest pond or stretch of river. So this market research exercise has probably engaged around 1% of the entire commercial fishery market."
        },
        {
            "text": "Consequently, the results can only be taken as indicative, but they are valuable for giving a rough idea of the number of locations where our previously gathered insights might apply."
        },
        {
            "text": "When it came to licence checking at the point of sale, we learned that this was far more likely to happen in person because few fisheries are mainly completing sales online. Many offered customers multiple ways to buy a fishing permit, but the majority are selling them either when doing the rounds on the bank, or in the fishery shop."
        },
        {
            "text": "Those who answered ‘something else’ either believed they sold just as many permits online as they did in-person or completed sales mainly over the telephone. One even required bank transfers prior to arrival because their fishery is first and foremost a camping and caravanning destination."
        },
        {
            "text": "We also learned that only 15 of the 50 fisheries we spoke to are currently doing some kind of licence checking, most commonly when they felt someone was likely to cause trouble on their site. A very significant proportion were unaware that they could actually ask to see licences, provided they had included this rule in the terms and conditions for the permits they sold."
        },
        {
            "text": "Fisheries that adopt the latter approach and include the ability to check licences within their terms and conditions have no associated powers or actions. Nor is there an expectation on the club/fishery to do these checks or record them formerly. The EA would not want to put fishery staff or fishery bailiffs in a place of conflict, so the decision to make a check is always one they make themselves."
        },
        {
            "text": "From just these points we can arrive at some useful insights about any rod licence compliance service which the EA might consider designing in future. Many more questions were asked of these fisheries, and exactly the same set of questions were posed to 50 fishing clubs, so that we could learn about differences in compliance approaches at different kinds of organisation, but there is no room to discuss the entire project . If there is interest we would be glad to write further posts in future."
        },
        {
            "text": "In summary, it’s exceptionally important that fisheries continue to engage with the EA in this kind of research project.  We want to put on record how thoroughly grateful we are to those who have given us the benefit of their time and expertise through both rounds of this research activity. Unless fisheries and fishing clubs are open to talking to our researchers, it is near impossible to learn about how the industry functions, the values and the interests which drive it, the problems that undermine it, and how these might be solved."
        },
        {
            "text": " "
        },
        {
            "text": " "
        }
    ]
}