{
    "url": "https://stratcommand.blog.gov.uk/2024/01/31/british-forces-gibraltar-personnel-in-the-alps/",
    "title": "British Forces Gibraltar Personnel in The Alps",
    "authors": [
        "abievans"
    ],
    "categories": [
        "Gibraltar",
        "Overseas Bases",
        "Uncategorized"
    ],
    "pub_date": "2024-01-31T15:39:28+00:00",
    "content": [
        {
            "text": "In the last week, 11 British Forces (BF) Gibraltar personnel travelled 1800 km to enjoy a challenging and educational trip to the picturesque French Alps to join over 1000 other Royal Navy personnel participating in the 2024 Royal Navy (RN) Winter Sports Association Festival."
        },
        {
            "text": "Skiers and snowboarders from beginner to expert, took to the slopes of the Les Deux Alps for lessons and to race against other participants from Ships, Submarines, The Fleet Air Arm and Shore Units from around the globe."
        },
        {
            "text": "The training provided by Royal Navy Adventurous Training Team is part of the Adventurous Training offer that the Royal Navy provides for its personnel with the aim of improving personal development, team cohesion and individual resilience."
        },
        {
            "text": "It is believed that this is the first time that BF Gibraltar personnel have attended this event as a team."
        },
        {
            "text": "Achievements from the BF Gibraltar Snow Sports Team included a 5th place finish in the Expert Alpine Grand Slalom Race against stiff competition from members of the RN Ski Team, and a silver in the Intermediate Grand Slalom."
        },
        {
            "text": "The team kit was kindly sponsored by MH Bland Group of Companies, a long-established Gibraltarian Company with strong links to the maritime community. Honorary Captain John Gaggero Royal Navy, Chairman of MH Bland, attended a meeting at The Tower, HMNB Gibraltar where the team thanked him for his support and to discuss the fantastic experiences they had all enjoyed."
        }
    ]
}