{
    "url": "https://naturalengland.blog.gov.uk/2024/01/31/environmental-improvement-plan-one-year-on-driving-nature-recovery-on-land-and-sea/",
    "title": "Environmental Improvement Plan one year on: Driving Nature recovery on land and sea",
    "authors": [
        "Alan Law"
    ],
    "categories": [
        "Biodiversity",
        "Environment Act",
        "Environmental Improvement Plan",
        "Landscapes",
        "Marine environment",
        "Natural England",
        "Nature Recovery Network",
        "Protected sites and species",
        "Species recovery",
        "Wildlife"
    ],
    "pub_date": "2024-01-31T09:26:15+00:00",
    "content": [
        {
            "heading": 4,
            "text": "By Alan Law, "
        },
        {
            "heading": 4,
            "text": "Deputy Chief Executive, Natural England"
        },
        {
            "text": "This time last year, Defra’s Secretary of State launched the Environmental Improvement Plan to an audience of nature conservation bodies and the media in the nature rich setting of Camley Street Natural Park, an urban nature reserve in the heart of London’s King Cross area."
        },
        {
            "text": "Camley Street was once a disused piece of land owned by the railways where Nature slowly flourished. In 1985, the London Wildlife Trust successfully campaigned to secure its future. Now, nearly forty years later, nestled amongst the new streets, homes, offices, restaurants, schools and leisure facilities of King’s Cross, the Natural Park remains a haven for people and wildlife. "
        },
        {
            "text": "As Camley Street demonstrates, conserving and restoring Nature doesn't happen by accident, it takes foresight, evidence, investment and time. If we are to do this at scale and with urgency, we need legally binding targets. With the Environmental Improvement Plan that’s what we have: 10 stretching goals, plus the overarching goal of halting the decline in our biodiversity so we can achieve thriving plants and wildlife.  "
        },
        {
            "text": "Tony Juniper, our Chair, said at the time: "
        },
        {
            "text": "“The result we have before us today is an ambitious and integrated plan, setting out a package that is broad and geared towards hitting targets. What is required now is a concerted effort across government and society to translate its intent into action.” "
        },
        {
            "text": "In the last 12 months we’ve made huge strides. In numbers we’ve delivered; 245 miles of King Charles III England Coast Path, grants to 74 organisations to help restore populations of rare species, funding for a further 34 Landscape Recovery projects enabling farmers and landowners to play a key role in recovering nature, two super National Nature Reserves as part of the King’s Series, one site of special scientific interest (SSSI) and a Green Infrastructure Framework that’s enabling local authorities and developers to bring Nature to the heart of communities. "
        },
        {
            "text": "See Tony Juniper’s New Year blog for a more extensive review of what we delivered last year and the plans for 2024 "
        },
        {
            "text": "The momentum continues. As part of today’s anniversary, Steve Barclay, Secretary of State, announced a package of measures to safeguard our marine ecosystems. "
        },
        {
            "text": "The English North Sea ecosystem faces a range of factors that need to be balanced, including climate change, commercial fishing, offshore wind and marine aggregate extraction. Alongside these, Avian Influenza has severely impacted some seabird populations, including guillemots and razorbills. "
        },
        {
            "text": "As we saw in the BBC’s Wild Isles, seabirds are integral to our identity as an island nation and an important indicator of a healthy coastal ecosystem. They play a crucial role in balancing our fragile marine environments. They can help us to understand what’s going on beneath the waves and how climate change and other impacts are affecting marine species.   "
        },
        {
            "text": "This is why, in line with the overarching goal of the EIP and based on our evidence, Defra will be closing English waters of the North Sea to fishing for sandeel.  "
        },
        {
            "text": "Closing the fishery ahead of the sandeel fishing season in April will bring many ecosystem benefits. Our work indicates that seabirds, such as puffin and kittiwake, would be the biggest beneficiaries with model simulations predicting an increase in seabird biomass of around 7% in 10 years. Mammals, particularly harbour porpoise, would benefit too.  "
        },
        {
            "text": "The government has also announced it will be protecting an additional 13 Marine Protected Areas with a new byelaw restricting the use of damaging bottom-towed fishing gear. This work has been supported by evidence from Natural England.  "
        },
        {
            "text": "Natural England has been working closely with JNCC to provide the Marine Management Organisation with the conservation advice they have used to draft 13 new fisheries byelaws that will protect sensitive features, such as rocky and biogenic reef, from the effects of bottom trawling in these Marine Protected Areas. This new management will cover roughly 4,000km2, an area slightly larger than Suffolk. "
        },
        {
            "text": "Back on land, Steve Barclay also announced today that Defra is awarding just under £7 million for pilot projects to protect lowland peat as well as setting ambitious targets for Protected Landscapes so they deliver on their huge potential for nature, climate, people and places. Natural England has been working closely with Defra to develop the Targets and Outcomes Framework for Protected Landscapes. Following publication, we will support the 44 Protected Landscape bodies and their partners to apportion targets between them. We will also help ensure the targets are embedded in statutory management plans to drive collaborative action. Natural England will collate data annually to enable progress to be tracked against the targets.   "
        },
        {
            "text": "Finally, we’re delighted to see that Biodiversity Net Gain, a requirement for developers to provide 10% more or better-quality natural habitat than there was before development, will go live on 12 February.  "
        },
        {
            "text": "The whole package of measures can be read here: Nature recovery to be accelerated as the government delivers on measures to protect land and sea - GOV.UK (www.gov.uk)"
        },
        {
            "text": "From the depths of the North Sea to our iconic national landscapes and in the heart of our towns and cities, the EIP goals are driving Nature recovery. There’s a lot to do in four years, but we’re rising to the challenge."
        }
    ]
}