{
    "url": "https://deframedia.blog.gov.uk/2024/01/31/media-coverage-on-new-border-controls/",
    "title": "Media coverage on new border controls",
    "authors": [
        "Defra Press Office"
    ],
    "categories": [
        "Food"
    ],
    "pub_date": "2024-01-31T15:09:34+00:00",
    "content": [
        {
            "text": " "
        },
        {
            "text": "There has been widespread media coverage today (Wednesday 31 January) on the introduction of new border controls for animals, plants and plant products imported to Great Britain from the EU. From today, products which present a ‘medium risk’ to biosecurity and health will now require export health certificates and phytosanitary certificates, where currently they enter the UK without them"
        },
        {
            "text": "As a global trading nation, diseases carried from imported animals, animal products, plants and plant products pose a serious risk to the UK’s biosecurity. Risk-based border controls are therefore essential to manage this and ensure that we only import safe, high-quality products. Risk-based controls also mean that imports from all countries will be assessed the same way, where ‘high-risk’ products undergo necessary checks, and ‘low-risk’ products are imported more freely when it is safe to do so."
        },
        {
            "text": "The controls coming into effect today are part of the Border Target Operating Model, which has been designed to minimise burdens for traders by making smart use of data and technology."
        },
        {
            "text": "Biosecurity Minister Lord Douglas-Miller said:"
        },
        {
            "text": "Are traders and businesses prepared for these changes and will they face additional costs?"
        },
        {
            "text": "The government has worked extensively with traders to ensure the new controls and requirements are clear and that they have ample time to prepare."
        },
        {
            "text": "We are taking a phased approach – including initially not requiring pre-notification and inspections for EU Medium Risk fruit and vegetables and other medium risk goods - to support businesses and ensure the efficient trade is maintained between the EU and Great Britain. This will ensure business do not face any unnecessary burdens and we will continue to work closely with firms across the UK as the controls are implemented."
        },
        {
            "text": "Government modelling estimates that the BTOM will reduce costs to businesses by around £520m per annum when compared to the GB import model originally proposed."
        },
        {
            "text": "Are there enough vets in Europe to issue the Export Health Certificates now required for meat imports?"
        },
        {
            "text": "While EU member states are responsible for providing officers to approve any certification, we have been engaging closely with them to ensure they are prepared for these changes and EU member states have expressed a high level of confidence in their capacity."
        },
        {
            "text": "What further checks will be introduced this year?"
        },
        {
            "text": "From 30 April 2024, Government will introduce documentary, physical and identity checks at the border for medium risk animal products, plants and plant products imported to Great Britain from the EU, except goods that enter Great Britain via West Coast ports."
        },
        {
            "text": "31 October 2024, Government will further simplify traders’ management of Sanitary and Phytosanitary requirements. Safety and Security declarations will also be required for all goods moving from the EU to Great Britain."
        },
        {
            "text": "Will there be delays and disruption at our borders when physical checks commence in April?"
        },
        {
            "text": "We are confident that existing and new Border Control Post (BCP) infrastructure will have sufficient capacity and capability to handle the volume of expected checks, with robust, dynamic, and effective operational measures ready to call upon if needed. We will continue to work with existing BCP operators to ensure they are prepared, and the Government has built new infrastructure to serve the Short Straits."
        },
        {
            "text": "Will Kent border checks be consolidated at Sevington and is this safe?"
        },
        {
            "text": "Following careful consideration of the options for border control posts in Kent, we announced our intention to consolidate physical controls at the inland border facility at Sevington. We are confident that Sevington will have the necessary measures in place to appropriately mitigate biosecurity risks that relate to this facility being located away from the point of entry. African Swine Fever (ASF) safeguard checks will be conducted with Border Force at the point of entry (Dover Port)."
        },
        {
            "text": "How are you dealing with the risk of African Swine Fever (ASF)?"
        },
        {
            "text": "Preventing an outbreak of African swine fever (ASF) in the UK remains one of our key biosecurity priorities. Whilst the UK has never had an outbreak of ASF, we are not complacent. We continue to work closely with the Devolved Administrations on outbreak response contingency planning, and on preventing an incursion from imported goods."
        },
        {
            "text": "Will the new controls affect food prices?"
        },
        {
            "text": "The inflationary impacts on food for consumers will be at most less than 0.2 percentage points over a 3-year period.   The consequences of a major outbreak of a plant or animal disease on the economy could be far more severe."
        },
        {
            "text": "When will you publish the final rate for the Common User Charge for checks at BCPs?"
        },
        {
            "text": "We are now carefully considering the responses to our consultation from the sector and businesses to ensure we take the fairest approach, while also facilitating the safe movement of goods into the country."
        },
        {
            "text": " Follow Defra on Twitter, and sign up for email alerts here."
        }
    ]
}