{
    "url": "https://deframedia.blog.gov.uk/2024/01/31/new-announcements-to-boost-nature-recovery-one-year-on-from-the-launch-of-the-environmental-improvement-plan/",
    "title": "New announcements to boost nature recovery one year on from the launch of the Environmental Improvement Plan",
    "authors": [
        "defrablogs"
    ],
    "categories": [
        "Nature"
    ],
    "pub_date": "2024-01-31T18:23:24+00:00",
    "content": [
        {
            "text": " "
        },
        {
            "text": "Today (Wednesday 31 January), there has been national coverage of the Government’s package of announcements to boost nature recovery, marking one year since the Environmental Improvement Plan in the i, The Guardian and BBC Radio 4’s Today programme."
        },
        {
            "text": "These announcements mark another important step forward for nature, building upon progress already made through the Environmental Improvement Plan, as the government has already delivered more than 50 commitments set out in the plan and the Environment Act."
        },
        {
            "text": "The measures announced include the permanent closure of the sandeel fisheries in English waters of the North Sea from April, 13 new Marine Protected Areas with restrictions on damaging bottom trawling and a new framework for national parks and protected areas to help them better deliver for nature."
        },
        {
            "text": "This additional protection for sandeels will help to safeguard an important food source for marine mammals and seabirds, such as puffins and the harbour porpoise. This comes alongside the announcement that 13 new MPAs will be created to protect the habitats of our marine animals."
        },
        {
            "text": "The Protected Landscapes Outcomes Framework will help pave the way for ambition for England’s 44 Protected Landscapes to contribute to national environment targets, such as the goal to protect 30% of land and sea by 2030."
        },
        {
            "text": "The government also announced the recipients a combined £7 million, funded by the Nature for Climate Fund, for 34 projects which will restore lowland peat to help in the effort to deliver on our Net Zero goals and provide environmental co-benefits."
        },
        {
            "text": "Environment Secretary Steve Barclay said:   "
        },
        {
            "text": "Tony Juniper, Chair of Natural England, said: "
        }
    ]
}