{
    "url": "https://defraenvironment.blog.gov.uk/2024/01/31/new-actions-to-support-seabirds-wildlife-and-net-zero/",
    "title": "New actions to support seabirds, wildlife and Net Zero",
    "authors": [
        "Mike Dowell"
    ],
    "categories": [
        "Biodiversity Net Gain",
        "Climate change",
        "Marine",
        "Nature",
        "Peat",
        "Protected Landscapes"
    ],
    "pub_date": "2024-01-31T11:07:05+00:00",
    "content": [
        {
            "text": "Today, one year exactly since the publication of the Environmental Improvement Plan (EIP), we are taking further actions to halt and reverse the decline of nature in our country."
        },
        {
            "text": "Firstly, to protect an important forage fish for a range of marine life, including seabirds, we will be closing English waters of the North Sea to fishing sandeel. This permanent closure will begin before the start of this year’s sandeel fishing season on 1 April."
        },
        {
            "text": "As we saw in the BBC’s Wild Isles, seabirds are integral to our identity as an island nation and are also an important indicator of a healthy coastal ecosystem. Better protection of the marine ecosystem is an important step towards boosting seabird resilience from increasing negative impacts, including avian influenza."
        },
        {
            "text": "Secondly, we are protecting an additional 13 Marine Protected Areas (MPAs) with a new byelaw restricting the use of bottom-towed fishing gear."
        },
        {
            "text": "The MMO byelaw is part of an ambitious programme to protect all MPAs from harmful fishing activity. The measures in the 13 MPAs will protect marine ecosystems in an area of almost 4,000 square kilometres, bringing the total area of offshore waters protected from bottom-towed gear to just under 18,000 square kilometres – that’s more than Yorkshire and Norfolk combined."
        },
        {
            "text": "We have also made tangible progress on Net Zero and our other environmental commitments."
        },
        {
            "text": "Today, we are awarding just under £7 million to pilots to protect lowland peat, funded by the Nature for Climate Fund. Taking action as part of our response to the Lowland Agricultural Peat Task Force report, published in June 2023, our pilots will help to deliver on our Net Zero ambitions and wider environmental co-benefits."
        },
        {
            "text": "These projects will support local collaborations to deliver our ‘mosaic', or mixed, approach to land use and preserving peat soil carbon. For example, farmers and landowners may wish to undertake a regime that includes peat restoration, wetter farming (which is farming with higher water tables, with either paludicultural or traditional crops), and some continued farming on drained soils. This mosaic approach will not only have benefits for carbon, but also biodiversity, food security, water quality, and flood and drought risk."
        },
        {
            "text": "They will also support Internal Drainage Boards to update and install water management infrastructure, leading to better water management for peat and the environment."
        },
        {
            "text": "Finally, following our announcement in November that there will be a new National Park, we have today published ambitious targets for Protected Landscapes. These targets will help National Parks and National Landscapes (the new name for AONBs) to deliver on their huge potential for nature, climate, people and place."
        },
        {
            "text": "Today’s actions complement our other initiatives, such as Biodiversity Net Gain (BNG). We recently confirmed that BNG will go live from 12 February for major developments. This policy will create and improve natural habitats, that in turn will help us meet our target to halt the decline in species abundance by 2030. BNG requires new developments to be ‘nature positive’, by delivering at least a 10% net gain for nature."
        },
        {
            "text": "We’ll be publishing more updates like this, as well as in-depth looks at particular funds and policies, on this blog. To receive an email notification whenever we publish a new post, please subscribe to the blog."
        }
    ]
}