{
    "url": "https://supportingfamilies.blog.gov.uk/2024/01/31/norfolk-a-county-where-children-young-people-flourish/",
    "title": "Norfolk – a county where children & young people FLOURISH.",
    "authors": [
        "ballypahal"
    ],
    "categories": [
        "Data Sharing",
        "Early Help",
        "Education",
        "Employment",
        "Evaluation",
        "Health",
        "Multidisciplinary Teams",
        "Reducing Parental Conflict",
        "Transformation"
    ],
    "pub_date": "2024-01-31T17:29:12+00:00",
    "content": [
        {
            "text": "Norfolk – a county where children & young people FLOURISH. "
        },
        {
            "text": "Norfolk has a shared ambition to be a county where every child and young person can flourish.  Through the work of the Children & Young Peoples Strategic Alliance (CYPSA) Norfolk has developed an outcomes framework and partnership approach, which aligns with the key principles of the Supporting Families programme.  "
        },
        {
            "text": "The Strategic Alliance  "
        },
        {
            "text": "The Strategic Alliance (CYPSA) brings together senior representatives from Social Care, Health, Education, Criminal Justice safeguarding partnerships sectors to collaborate and respond to the needs of children, young people, and families. Communities and the delivery of a shared Children and Young People Partnership Strategy was built on the  https://delta.communities.gov.uk/document-repository/public/download?uri=/document-repository/Flourishing-in-Norfolk-strategy-(1).pdf "
        },
        {
            "text": "Flourish Pledge "
        },
        {
            "text": "Commitment to flourish is evolving, partnerships have developed a Flourish pledge initiative where teams and organisations achieve the outcomes of the framework through their practice.    "
        },
        {
            "text": "The pledge ambition has been taken up by over 200 teams and organisations across all sectors. The first Flourish Awards were held in September 2023 and celebrated some of the amazing work taking place across the county. "
        },
        {
            "text": "Prevention & Early Help offer. "
        },
        {
            "text": "A key element of the strategy is focused upon prevention and early help, which reflects ambitions and priorities from the Department of levelling up housing and communities (DLUHC) and Department for Education (DfE) Early Help System Guide Supporting Families: Early Help System guide - GOV.UK (www.gov.uk) and are focused upon:  "
        },
        {
            "text": "Priority 1: Building Resilient Communities   "
        },
        {
            "text": "Priority 2: Improving Early Identification  "
        },
        {
            "text": "Priority 3: Strengthening Whole Family & Whole System working. "
        },
        {
            "text": "Priority 4: Building Collaboration & Capacity "
        },
        {
            "text": "Communities and Partnerships support partners to identify children, young people, families, and communities that would benefit from early help. In addition, Family Support Teams focus on providing targeted early help to families with more multiple and complex needs.  "
        },
        {
            "text": "A collective offer of services supports everyone and delivered through, Digital self-help, Online communities, Integrated Commissioned Services, Voluntary, Community & Social Enterprise Sector, District Help Hubs, Community and Partnership support and the Family Support Team.  "
        },
        {
            "text": "Whole council approach  "
        },
        {
            "text": "The multi-agency prevention & early help board, alongside a supporting families sub-group has oversight of the evaluation and development of the early help offer.  The council has continued to build strong foundations of providing Early Help and develop an ever-evolving offer to respond to needs of children, young people, and families earlier. "
        },
        {
            "text": "Supporting Families Programme  "
        },
        {
            "text": "The links made between Norfolk’s ‘Flourish’ approach and the national Supporting Families Outcomes Framework has helped the council ensure that there is unity between both, therefore eradicating the need for the workforce to favour one over the other.   "
        },
        {
            "text": "Practitioners considering Flourish outcomes will by doing so have also considered the relevant outcome from the Supporting Families Outcomes framework.   "
        },
        {
            "text": "The Norfolk Flourish infographic shows specific links and key building blocks between Flourish and Supporting Families frameworks. https://delta.communities.gov.uk/document-repository/public/download?uri=/document-repository/Norfork-Florish-and-Supporting-Families-programme.pdf "
        },
        {
            "text": "The guidance for the programme can be accessed: https://www.gov.uk/government/publications/supporting-families-programme-guidance-2022-to-2025/chapter-3-the-national-supporting-families-outcome-framework "
        },
        {
            "text": " Flourish Outcomes  "
        },
        {
            "text": "The Flourish Outcomes Framework was developed with young people and stakeholders and reflects the aspects of children and young people’s lives that they have told us are important to them: "
        },
        {
            "text": " Success "
        },
        {
            "text": "“You have always been there, just to help out constantly, if I needed you, you always supported my family and me.” [parent] "
        },
        {
            "text": "\"I finally got back into school because of you, without you I wouldn’t have been able to enter the school at all.” [young person] "
        },
        {
            "text": "Conclusion   "
        },
        {
            "text": "Norfolk’s partnership approach aims to understand vulnerabilities in families and communities and respond effectively by strengthening whole system approaches to prevention and streamlining pathways to support. The supporting families dashboard will provide the workforce with information to inform their analysis and approaches to practice when working with families.  "
        },
        {
            "text": "They will continue to drive data governance and transformation at a strategic level across the partnership and provide direction on how data should be used to ensure services are effective. "
        },
        {
            "text": "By building capacity through the development of a family hub approach, they will continue to support community resilience. "
        },
        {
            "text": "They are establishing 15 new School and Community Zones, with each zone having a new team with an initial focus on supporting children, young people and families with inclusion and early help needs.   "
        },
        {
            "text": "They continue to develop the maturity of prevention & early help approach, moving resource upstream to achieve the priorities of the Prevention & Early Help Strategy 2021-2025.   "
        },
        {
            "text": " "
        }
    ]
}