{
    "url": "https://publicguardian.blog.gov.uk/2024/01/31/power-of-attorney-stories-shirley/",
    "title": "Power of Attorney Stories: Shirley",
    "authors": [
        "rebeccaparker1"
    ],
    "categories": [
        "Future planning",
        "lasting power of attorney",
        "LPA",
        "YourVoiceYourDecision"
    ],
    "pub_date": "2024-01-31T14:01:52+00:00",
    "content": [
        {
            "text": "[English] - [Cymraeg]"
        },
        {
            "text": "A Lasting Power of Attorney (also known as an LPA) is a legal document. It allows you to nominate someone you trust to step in and make decisions about your health and welfare and property and finance if you lack mental capacity to do so.  "
        },
        {
            "text": "Shirley Lawton lives in South Wales, near Chepstow. She worked in HR and compliance in financial planning and retired in December 2020. "
        },
        {
            "text": "Shirley helped both her mother and sisters set up their LPAs and has now made her own. She shares her story here… "
        },
        {
            "text": " "
        },
        {
            "heading": 3,
            "text": "Why did you decide to make an LPA? "
        },
        {
            "text": "I’ve always known the importance of having an LPA from my experiences working in financial planning. It was always a subject we talked about with clients. I know that pensions, investments and financial planning can be confusing and daunting for some people, and I’ve always tried to help friends and family understand their affairs and the importance of planning. "
        },
        {
            "text": " "
        },
        {
            "heading": 3,
            "text": "How has having an LPA helped you and your family?"
        },
        {
            "text": "After my dad died suddenly in 2014, I supported my mum to set up her LPA. As her attorney I was able to help her with arranging finances and paying bills until she died in 2016. "
        },
        {
            "text": "When my sister Jenny suddenly got ill in January 2022, my sister Suzy and I became attorneys on her LPA. It enabled Suzy and I to manage her affairs as she was going through treatment. Sadly, Jenny died in June 2022. "
        },
        {
            "text": "I also helped Suzy and her son with their LPA application, not knowing that she too would be diagnosed as terminally ill in January 2023. Having an LPA in place meant her son could get her finances in order before she died in June 2023. This was what Suzy wanted, especially knowing that Jenny hadn’t had that opportunity. It all happened very quickly and knowing that we had LPAs in place removed the additional worries around bills and arranging healthcare. "
        },
        {
            "text": " "
        },
        {
            "heading": 3,
            "text": "How did you bring up the subject of LPAs? "
        },
        {
            "text": "I am very organised with my own pensions and finances, so friends have come to me in the past for support. I’ve found it easy to ask them whether they have LPAs in place because I’m comfortable about my knowledge and experience, and I know it’s so important. "
        },
        {
            "text": " I try to give people examples of what might happen if they had an accident, and explain how easy it is to set up LPAs themselves online without a solicitor. It’s really a very simple application process now which is why I tell everyone I know to do it or let me help them get started! "
        },
        {
            "text": " "
        },
        {
            "heading": 3,
            "text": "What is your relationship with your attorneys?"
        },
        {
            "text": "For some of my friends and family, choosing an attorney is straightforward. For my husband and I who don’t have children, it’s not so easy to decide.   "
        },
        {
            "text": "We have decided on two nephews to act as attorneys. This gives us time to spend with them and explain how we run our finances, what’s important to us, and what we would like to happen should either of us lose mental capacity. We have a good relationship with them, and they have enough life experience to take on this important role. "
        },
        {
            "text": " "
        },
        {
            "heading": 3,
            "text": "Why would you recommend setting up an LPA? "
        },
        {
            "text": "Having an LPA gives me control over what I want and need as a donor. Without an LPA, there would be inevitable difficulties to deal with, and there isn’t always the time. Setting up an LPA is easy and something you can do yourself, for little time and cost, giving you peace of mind. "
        },
        {
            "text": " "
        },
        {
            "text": "Shirley is one of the many people across England and Wales who have made an LPA. It's never too early to talk about lasting powers of attorney with someone you trust. "
        },
        {
            "text": "Start a conversation today. "
        },
        {
            "text": "Find out more at https://powerofattorney.campaign.gov.uk/. "
        },
        {
            "text": " "
        },
        {
            "text": "[English] - [Cymraeg]"
        },
        {
            "text": "Mae Atwrneiaeth Arhosol (a elwir hefyd yn LPA) yn ddogfen gyfreithiol. Mae’n caniatáu i chi enwebu rhywun rydych chi’n ymddiried ynddo i gamu i mewn a gwneud penderfyniadau am eich iechyd a’ch lles, eich eiddo a’ch cyllid os nad oes gennych chi alluedd meddyliol i wneud hynny.  "
        },
        {
            "text": "Mae Shirley Lawton yn byw yn Ne Cymru, ger Cas-gwent. Bu’n gweithio ym maes Adnoddau Dynol a chydymffurfiaeth ym maes cynllunio ariannol ac ymddeolodd ym mis Rhagfyr 2020. "
        },
        {
            "text": "Mae Shirley wedi helpu ei mam a’i chwiorydd i sefydlu eu hatwrneiaeth arhosol ac mae hi bellach wedi gwneud ei hatwrneiaeth arhosol ei hun. Mae hi’n rhannu ei stori yma... "
        },
        {
            "text": " "
        },
        {
            "heading": 3,
            "text": "Pam wnaethoch chi benderfynu gwneud atwrneiaeth arhosol? "
        },
        {
            "text": "Rwyf wastad wedi bod yn ymwybodol o bwysigrwydd cael atwrneiaeth arhosol, a hynny o ganlyniad i’m profiadau yn gweithio ym maes cynllunio ariannol. Roedd yn bwnc roeddem bob amser yn ei drafod gyda chleientiaid. Rydw i’n gwybod bod pensiynau, buddsoddiadau a chynllunio ariannol yn gallu bod yn ddryslyd ac yn frawychus i rai pobl, ac rydw i bob amser wedi ceisio helpu ffrindiau a theulu i ddeall eu materion a phwysigrwydd cynllunio."
        },
        {
            "text": " "
        },
        {
            "heading": 3,
            "text": "Sut mae cael atwrneiaeth arhosol wedi eich helpu chi a’ch teulu? "
        },
        {
            "text": "Ar ôl i fy nhad farw’n sydyn yn 2014, cefnogais fy mam i sefydlu ei hatwrneiaeth arhosol. Yn fy rôl fel atwrnai iddi, roeddwn yn gallu ei helpu i drefnu cyllid a thalu biliau nes iddi farw yn 2016. "
        },
        {
            "text": "Pan aeth fy chwaer Jenny yn sâl yn sydyn ym mis Ionawr 2022, daeth fy chwaer Suzy a minnau’n atwrneiod ar ei hatwrneiaeth arhosol. Roedd yn galluogi Suzy a minnau i reoli ei materion wrth iddi fynd drwy driniaeth. Yn anffodus, bu farw Jenny ym mis Mehefin 2022. "
        },
        {
            "text": " Fe wnes i hefyd helpu Suzy a’i mab gyda’u cais atwrneiaeth arhosol, heb wybod y byddai hi hefyd yn cael diagnosis o salwch angheuol ym mis Ionawr 2023. Roedd cael atwrneiaeth arhosol yn golygu bod ei mab yn gallu cael trefn ar ei harian cyn iddi farw ym mis Mehefin 2023. Dyma oedd dymuniad Suzy, yn enwedig gan wybod nad oedd Jenny wedi cael y cyfle hwnnw. Digwyddodd y cyfan yn gyflym iawn ac roedd gwybod bod Atwrneiaethau Arhosol wedi ei sefydlu yn cael gwared â’r pryderon ychwanegol ynghylch biliau a threfnu gofal iechyd. "
        },
        {
            "text": " "
        },
        {
            "heading": 3,
            "text": "Sut gwnaethoch chi fynd ati i gychwyn siarad am gael atwrneiaethau arhosol? "
        },
        {
            "text": "Rwy’n drefnus iawn gyda’m pensiynau a’m cyllid fy hun, felly mae ffrindiau wedi dod ataf yn y gorffennol i gael cymorth. Mae wedi bod yn hawdd gofyn iddyn nhw a oes ganddyn nhw atwrneiaethau arhosol oherwydd fy mod i’n teimlo’n gyfforddus am fy ngwybodaeth a’m profiad, ac rydw i’n gwybod ei fod mor bwysig. "
        },
        {
            "text": "Rwy’n ceisio rhoi enghreifftiau i bobl o’r hyn a allai ddigwydd pe baen nhw’n cael damwain, ac yn egluro pa mor hawdd yw sefydlu atwrneiaethau arhosol eu hunain ar-lein heb gyfreithiwr. Mae’n broses ymgeisio syml iawn nawr, a dyna pam rwy’n dweud wrth bawb fy mod i’n gwybod sut i wneud hynny neu gallaf roi help llaw iddyn nhw ddechrau arni! "
        },
        {
            "text": " "
        },
        {
            "heading": 3,
            "text": "Dywedwch wrthym am eich perthynas â’ch atwrneiod"
        },
        {
            "text": "I rai o’m ffrindiau a’m teulu, mae’n hawdd dewis atwrnai. I’m gŵr a minnau sydd heb blant, dydy hi ddim mor hawdd penderfynu.  "
        },
        {
            "text": " Rydyn ni wedi penderfynu ar ddau nai i weithredu fel atwrneiod. Mae hyn yn rhoi amser i ni dreulio amser gyda nhw ac egluro sut rydyn ni’n rheoli ein cyllid, beth sy’n bwysig i ni, a beth fydden ni’n hoffi ei weld yn digwydd petai’r naill neu’r llall ohonom yn colli galluedd meddyliol. Mae gennym berthynas dda â nhw, ac mae ganddynt ddigon o brofiad bywyd i ymgymryd â’r rôl bwysig hon. "
        },
        {
            "text": " "
        },
        {
            "heading": 3,
            "text": "Pam fyddech chi’n argymell sefydlu Atwrneiaeth Arhosol? "
        },
        {
            "text": "Mae cael Atwrneiaeth Arhosol yn rhoi rheolaeth i mi dros yr hyn rwyf ei eisiau a’i angen fel rhoddwr. Heb atwrneiaeth arhosol, byddai anawsterau anochel i ddelio â nhw, ac nid oes wastad amser i hynny. Mae’n hawdd sefydlu atwrneiaeth arhosol. Gallwch ei wneud eich hun – nid yw’n cymryd llawer o amser nac yn costio llawer – a bydd yn rhoi tawelwch meddwl i chi. "
        },
        {
            "text": " "
        },
        {
            "text": "Mae Shirley yn un o’r llu o bobl ledled Cymru a Lloegr sydd wedi gwneud atwrneiaeth arhosol. Dydy hi byth yn rhy gynnar i siarad am atwrneiaeth arhosol gyda rhywun rydych chi’n ymddiried ynddo. "
        },
        {
            "text": "Dechreuwch sgwrs heddiw. "
        },
        {
            "text": "Cewch ragor o wybodaeth yn https://powerofattorney.campaign.gov.uk/. "
        }
    ]
}