{
    "url": "https://socialworkwithadults.blog.gov.uk/2024/01/31/so-long-and-thanks/",
    "title": "So long and thanks...",
    "authors": [
        "Lyn Romeo"
    ],
    "categories": [
        "Care and support",
        "Co-production",
        "Communities",
        "Innovation",
        "Knowledge and skills",
        "LGBTQ+",
        "Mental health",
        "Our profession",
        "Society",
        "Viewpoint"
    ],
    "pub_date": "2024-01-31T13:46:24+00:00",
    "content": [
        {
            "heading": 2,
            "text": "...for all the amazing adult social work"
        },
        {
            "text": "This is my farewell post before I step down as Chief Social Worker for Adults."
        },
        {
            "text": "It was a privilege and an honour to take on this role over 10 years ago, the first of its kind in England. I am so very grateful for all the support I have received from so many people in the sector, especially those who draw on care and support and those who care for them."
        },
        {
            "text": "And of course, I must thank and praise the many wonderful social workers, social care and NHS colleagues who, day in and day out, make such a positive difference to the lives of those we are all here to serve."
        },
        {
            "text": "I must also pay tribute to the civil servants with whom I have worked. Their values, skills, knowledge aptitude and commitment to deliver policies and legislation to support improvements in social care, often in very challenging circumstances, have been remarkable."
        },
        {
            "text": "Overall, social work has come a long way over the last 10 years, especially in adult social care and the wider health sector, where its profile is much higher."
        },
        {
            "text": "This improved visibility for social workers was, in part, a consequence of the Care Act 2014. This legislation recognised and positioned relational strengths and rights based social work practice, rather than process and procedure, as the keystone in supporting best outcomes for people. It tied this into the imperative of people with lived experience co-designing care services and helping shape a vision of social care fit for the 21st Century."
        },
        {
            "heading": 2,
            "text": "A point of 'principal'"
        },
        {
            "text": "The Care Act guidance put the role of Principal Social Worker (PSWs) on a statutory footing. PSWs have grown in influence and their national network has positioned them as key influencers."
        },
        {
            "text": "I am very proud of all they have achieved so far, especially in promoting social workers’ unique combination of knowledge and skills, underpinned by a relentless commitment to upholding people’s rights. A shining example of this is the work they have led on the Social Care Workforce Race Equality Standards, helping to reflect, enable and empower the rich diversity of our care sector colleagues."
        },
        {
            "text": "They have supported the championing of social workers expertise in communication and relationship skills, together with their broad and specialised knowledge of law, entitlements, and the system. Their leadership and coordination in multi-agency settings, making sure voices and wishes of those we support are heard and respected, has been inspirational."
        },
        {
            "text": "Elsewhere, we have seen the fruits of investment in:"
        },
        {
            "text": "The establishment of a specialist regulator for social workers, Social Work England, has also given more prominence to social work as a vital public service. We now have more social workers in the NHS, bringing holistic and inclusive outcome approaches to working with people who have long term and/or multiple health conditions."
        },
        {
            "text": "We have trained more social workers to work with people with mental health related needs and, alongside sector partners, supported improvements in practice working with people with learning disabilities; autistic people, people with acquired brain injuries and older people. We have also improved safeguarding responses for people experiencing homelessness, through publication of good practice guidance and top tips."
        },
        {
            "text": "More broadly, I am proud of the advances we have made, both as a profession and as a society, in our recognition and support of the LGBTQ+ community, especially in respect of older people, for whom care services have not always reflected the totality and validity of their experiences."
        },
        {
            "heading": 2,
            "text": "There when it matters"
        },
        {
            "text": "Meanwhile, our support in multiple crises in an increasingly uncertain world has never been more valued, vital and, in some cases, ongoing. From the tragedy of Grenfell, to the privations of the pandemic, from war in Europe to the rising cost of living, we have and continue to be advocates, supporters and champions of those whose circumstances increase their vulnerabilities. I thank all of you for being there when our communities needed you the most."
        },
        {
            "text": "Throughout all this time, one of my personal priorities has been the improvement of the research and evidence base for social work with adults and our pipeline of social work researchers and academics. We now have significant investment from NIHR in this area, as well as support for a research capability within the social care workforce in local authorities."
        },
        {
            "text": "Lastly, having the Chief Social Worker for Adults role in central government, advising and supporting ministers and officials, providing professional leadership, and working in collaboration with everyone in the sector, has given social work greater recognition and value."
        },
        {
            "text": "There is much more to do of course. We live in tough and challenging times. However, your empathy, relentless focus on human rights and the primacy of the relationships you make with those you serve will, I am sure, continue to achieve great things. At its best, social work is truly transformative. It's been an honour to play my part in helping others be agents of that transformation."
        },
        {
            "text": "Many thanks to you all for your support and very best wishes for the future."
        }
    ]
}