{
    "url": "https://defraenvironment.blog.gov.uk/2024/01/31/the-environmental-improvement-plan-our-progress-one-year-on/",
    "title": "The Environmental Improvement Plan: Our progress one year on",
    "authors": [
        "Rob Reid"
    ],
    "categories": [
        "Access and engagement",
        "Air quality",
        "Biosecurity",
        "Chemicals and pesticides",
        "Climate change",
        "Environmental Improvement Plan",
        "Nature",
        "Resources and waste",
        "Water"
    ],
    "pub_date": "2024-01-31T11:04:41+00:00",
    "content": [
        {
            "text": "My name is Rob, and I work in the Environmental Strategy division at Defra. It’s a treat to be writing the first ‘proper’ post on our new blog."
        },
        {
            "text": "Part of my role involves tracking our activity against the environmental commitments we’ve made."
        },
        {
            "text": "Since the publication of the Environmental Improvement Plan (EIP) 12 months ago today, government has made lots of progress on its commitments."
        },
        {
            "text": "In fact, we’ve delivered over 50 of them since January 2023."
        },
        {
            "text": "But this isn’t a solo endeavour. We’ve achieved these through working in partnership with stakeholder organisations, local authorities, businesses and more. We’ll continue to do this as we work towards meeting our environmental targets."
        },
        {
            "text": "Below is a list of our top achievements, grouped according to the most relevant goal in the EIP. Of course, some of them fit under multiple areas – and all will ultimately contribute to its apex goal, thriving plants and wildlife."
        },
        {
            "text": "Goal 1: Thriving plants and wildlife"
        },
        {
            "text": "We have:"
        },
        {
            "text": "Goal 2: Clean air"
        },
        {
            "text": "We have:"
        },
        {
            "text": "Goal 3: Clean and plentiful water"
        },
        {
            "text": "We have:"
        },
        {
            "text": " Goal 4: Managing exposure to chemicals and pesticides"
        },
        {
            "text": "We have:"
        },
        {
            "text": "Goal 5: Maximise our resources, minimise our waste"
        },
        {
            "text": "We have:"
        },
        {
            "text": " Goal 6: Using resources from nature sustainably"
        },
        {
            "text": "We have:"
        },
        {
            "text": " Goal 7: Mitigating and adapting to climate change"
        },
        {
            "text": "We have:"
        },
        {
            "text": "Goal 8: Reduced risk of harm from environmental hazards"
        },
        {
            "text": " Goal 9: Enhancing biosecurity"
        },
        {
            "text": "We have:"
        },
        {
            "text": "Goal 10: Enhancing beauty, heritage and engagement with the natural environment"
        },
        {
            "text": "We have:"
        },
        {
            "text": "Over the coming years, we will do more to meet its environmental targets. For example, we’ll continue to roll out and scale up our environment land management schemes, bring forward actions to achieve our Plan for Water ambitions, and complete the English Coastal Path to give everyone full access to our amazing coastline."
        },
        {
            "text": "Please subscribe to this blog to receive an email notification every time we publish a new post."
        }
    ]
}