{
    "url": "https://deframedia.blog.gov.uk/2024/12/10/coverage-of-reforms-to-bin-collections/",
    "title": "Coverage of reforms to bin collections ",
    "authors": [
        "Defra Press Office"
    ],
    "categories": [
        "waste"
    ],
    "pub_date": "2024-12-10T15:51:15+00:00",
    "content": [
        {
            "text": "There has been coverage in recent days around the government’s Simpler Recycling proposals for bin collections, which will make recycling easier for households and businesses. "
        },
        {
            "text": "In particular, coverage has focused on the publication of non-statutory guidance for local authorities on factors to consider, within their existing and new legal obligations, to ensure they continue to provide reasonable waste collection services to households. "
        },
        {
            "text": "To be clear, there is absolutely no change to the current rules at local authorities operate under. As is currently the case, authorities will continue to decide collection frequency of waste collections in a way that suits the needs of their local community. There has never been a statutory requirement regarding the frequency of bin collections for local authorities, under any government. "
        },
        {
            "text": "However, our proposals will bring in weekly food waste collections for every home in the country – ensuring that the most unpleasant waste is dealt with quickly and reliably. "
        },
        {
            "text": "This guidance suggests that local authorities implement waste collection services which ensure that: "
        },
        {
            "text": "Our latest data suggests around 97% of local authorities in England collect residual waste – in other words, the non-recyclable, black bin bag waste – at least fortnightly, if not more frequently, without any statutory requirement to do so. "
        },
        {
            "text": "Our proposals will bring in weekly food waste collections for every home in the country – ensuring that the most unpleasant waste is dealt with quickly and reliably. "
        },
        {
            "text": "We expect councils to continue to provide reasonable waste collection services to households. Any changes to make collections less frequent should be considered carefully, and local authorities will need to justify that decision to local residents. "
        }
    ]
}