{
    "url": "https://deframedia.blog.gov.uk/2024/12/10/coverage-following-reforms-to-electrical-waste-regulations/",
    "title": "Coverage following reforms to electrical waste regulations",
    "authors": [
        "Defra Press Office"
    ],
    "categories": [
        "waste"
    ],
    "pub_date": "2024-12-10T16:14:25+00:00",
    "content": [
        {
            "text": "There has been widespread positive coverage following our announcement to make online giants pay their fair share for the treatment of electrical waste."
        },
        {
            "text": "Outlets such as The I, BBC News, Reuters, ENDS Report, and Radio 4 amongst others have covered the announcement that online marketplaces and vape producers will soon be paying their fair share towards the cost of recycling waste electricals."
        },
        {
            "text": "Before now, UK-based firms were shouldering the majority of costs around collection and processing of electronic waste and operating at a disadvantage. With 100,000 tonnes of household electricals binned every year, the changes will for the first time make sure the burden of these costs does not unduly fall on UK based retailers compared to their online rivals."
        },
        {
            "text": "Acting on these important issues now will help address unfairness and deliver on our commitment to kick-start the push towards a circular economy.   "
        },
        {
            "text": "The Circular Economy Minister Mary Creagh was in Newark on Monday, visiting the Currys Repair Centre to understand how they are responsibly treating electrical waste, so it can be used repeatedly and help deliver our circular economy goals.  "
        },
        {
            "text": "Circular Economy Minister Mary Creagh said:   "
        },
        {
            "text": "“Electrical equipment like vapes are being sold in the UK by producers who are failing to pay their fair share when recycling and reusing of dealing with old or broken items. "
        },
        {
            "text": "“Today we’re ending this: creating a level playing field for all producers of electronics, to ensure fairness and fund the cost of the treatment of waste electricals.   "
        },
        {
            "text": "“As part of our Plan for Change, we are helping UK businesses compete and grow, and we continue to get more households recycling, cracking down on waste and ending the throwaway society.”"
        },
        {
            "text": "Alex Baldock, CEO at Currys, said:"
        },
        {
            "text": "“We believe that if you sell something, this comes with a commitment to help keep it working, and then to recycle it responsibly when it reaches the end of its life. We continue to do everything we can to give tech a longer life, but there are many who don’t."
        },
        {
            "text": "“We welcome the Government’s new measures to help level the playing field for responsibility for waste, making online marketplaces do their part. Low value, low quality and unsustainable tech is piling up in landfills, and it’s good to see Government doing something to tackle that. We’ll continue to work with them to help ensure our industry performs its important role in helping protect our planet and be a force for good.”"
        },
        {
            "text": "Scott Butler, Executive Director at Material Focus, said:  "
        },
        {
            "text": "“We welcome the Government’s vital new reforms to the waste electrical regulations.  FastTech items such as vapes, have swamped the UK market, with half a billion items bought in the past year alone. These small, cheap and too easily thrown away items contain valuable materials such as copper, gold, and lithium which are lost forever and could instead power our tech future. "
        },
        {
            "text": "“These changes to regulations will mean that online marketplaces, many of which are selling FastTech and other electricals, must take on their producer responsibilities and contribute their share of the costs of recycling them. Creating a separate category for vapes also means that those who have been profiting from the boom in their sales can be held responsible for providing public takeback, communications and most importantly pay for recycling them.”"
        },
        {
            "text": "Justin Greenaway, Commercial Manager at SWEEEP, said:"
        },
        {
            "text": "“Well done Department for Environment, Food and Rural Affairs this is a long time coming but excellent things are now in hand. Regardless of where you sell something it is only fair and proper that producer responsibility requirements are the same."
        },
        {
            "text": "“103,000 tonnes of electricals tonnes of electricals thrown away per year – mainly small electricals for obvious reasons. The UK recycled 131,000 tonnes of small electrical in 2023 – so nearly binned as many as we recycled!“These reforms will ensure on-line marketplace giants pay towards their fair share of electrical waste.”"
        },
        {
            "text": "Nigel Harvey, Recolight CEO, said:"
        },
        {
            "text": "“It is great to see this important change announced.  For far too long, many online marketplaces have been able to avoid WEEE costs.  That in turn has meant that legitimate UK businesses pay more than their fair share.  This change is a vital step to make sure that compliant UK companies are not put at a competitive disadvantage by non-compliant imports."
        },
        {
            "text": "“Recolight has campaigned to close the online marketplace WEEE loophole for many years.  We’ve undertaken research that has shown the huge proportion of non-compliant product sold via such platforms.  For example, one analysis showed that 76% of LED lightbulbs sold by a leading online marketplace were not WEEE compliant.  For the 220 companies in the Recolight WEEE scheme, this change cannot come too soon. “"
        }
    ]
}