{
    "url": "https://enablingdigitalidentity.blog.gov.uk/2024/12/10/data-use-and-access-bill-committee-debate-in-house-of-lords/",
    "title": "Data Bill: committee debate in House of Lords ",
    "authors": [
        "Devon Troup"
    ],
    "categories": [
        "Digital identity"
    ],
    "pub_date": "2024-12-10T16:45:43+00:00",
    "content": [
        {
            "text": "The Data (Use and Access) Bill will underpin the Government’s plans to ensure that digital identity products and services offered in the UK can be trusted by those that want to use them.  "
        },
        {
            "text": "The measures relating to digital identity – which are referred to as “Digital Verification Services” in legislation – form Part 2 of the Bill and were debated by House of Lords Grand Committee on Tuesday 3 December 2024.  "
        },
        {
            "text": "The debate marked the start of Committee Stage in the House of Lords, which enables Peers to scrutinise and debate the Bill from start to finish.   "
        },
        {
            "text": "Peers can table amendments to the Bill in the weeks leading up to the Committee Stage debate, and those amendments are debated between the Bill Minister (Baroness Jones of Whitchurch), the Peer that tabled the amendment(s), and any other interested Peers.  "
        },
        {
            "text": "The debate, which you can watch on the Parliament TV website or read on Hansard, included amendments to the Digital Verification Services measures, as well as various other parts of the Bill.  "
        },
        {
            "heading": 2,
            "text": "What was discussed"
        },
        {
            "text": "The debate included discussion on various topics relating to Digital Verification Services: "
        },
        {
            "text": "Baroness Jones, Minister for the Future Digital Economy and Online Safety, responded with a speech (available on Hansard) aiming to reassure peers of the Bill’s intents and safeguards."
        }
    ]
}