{
    "url": "https://mhclgdigital.blog.gov.uk/2024/12/10/funding-service-how-digital-innovation-will-help-us-to-deliver-grants-faster-better-and-cheaper/",
    "title": "Funding Service: How digital innovation will help us to deliver grants faster, better and cheaper  ",
    "authors": [
        "Natasha Healey, Head of Product, Funding Service"
    ],
    "categories": [
        "Funding Service",
        "Strategy"
    ],
    "pub_date": "2024-12-10T09:44:38+00:00",
    "content": [
        {
            "text": "The Funding Service is a multidisciplinary team in MHCLG transforming the way the department delivers grants to councils and communities.  "
        },
        {
            "text": "In this blog post, we share how our service aims to make MHCLG’s grant delivery more cost-effective, consistent and user-focused, and what we’ve achieved so far.  "
        },
        {
            "text": "This piece forms part of a series of case studies bringing to life MHCLG Digital’s objectives and guiding principles. These examples demonstrate how digital ways of working, collaboration and innovation support the delivery of our departmental objectives and outcomes, offering better, faster and cheaper services to citizens. "
        },
        {
            "heading": 2,
            "text": "Our mission in Funding Service "
        },
        {
            "text": "MHCLG is one of the biggest grant funders in government, delivering over £7 billion in general grant funding in 2022/23 to a wide range of organisations, including local authorities, housing associations and community groups. Our job is to enable the department to deliver funding quickly, more efficiently and at lower cost. "
        },
        {
            "text": "This aligns with the government’s wider commitment to simplify the local government funding landscape and reduce the burden on local authorities, as outlined in the Local Government Finance Policy Statement 2025/26. "
        },
        {
            "text": "We are responsible for ensuring every step of the grant process is optimised – from design and launch, up until close. Our goal is to provide a consistent user experience, whether for council officers submitting monitoring data or for grant teams assessing impact.  "
        },
        {
            "text": "MHCLG Digital’s new strategic vision and the objectives and principles it sets out will be key to this. As well as helping to spark conversations and training opportunities, it will enable us to support teams within the department (and beyond!) as we: "
        },
        {
            "heading": 2,
            "text": "Actions we’re taking to drive change  "
        },
        {
            "heading": 3,
            "text": "Getting senior buy-in "
        },
        {
            "text": "Securing a mandate from our executive team has ensured that the Funding Service becomes a core part of the department's operations. By integrating our digital solution into policy-making, we’re creating a seamless and more effective system for distributing funding. "
        },
        {
            "heading": 3,
            "text": "Driving operational excellence "
        },
        {
            "text": "In Funding Service, we have developed reusable tools and are establishing data standards. These will reduce the time taken to onboard funds onto digital services, ease the burden on our users, and improve consistency and quality. "
        },
        {
            "heading": 3,
            "text": "Putting our users first "
        },
        {
            "text": "Key to our efforts is the creation of a user-centric service that simplifies funding applications, assessments and post-award monitoring data collections. By placing user experience at the forefront of our design, we aim to make the funding process easier, quicker and more accessible for all those involved.  "
        },
        {
            "heading": 3,
            "text": "Embedding digital in policy  "
        },
        {
            "text": "In the Funding Service, we champion ‘codesign’ – a design approach which involves users and stakeholders right from the beginning of a project through to rollout. In a nutshell, this means we start working with grant teams in policy early on to understand what their grant is about and what their requirements are, and then collaborate with them over the following weeks and months to launch the grant within given timelines. "
        },
        {
            "heading": 2,
            "text": "Our aims and outcomes to date "
        },
        {
            "text": "Digital is about bringing together people, processes, tools and data to be efficient and effective. Our service aims to: "
        },
        {
            "text": "We've already made efficiencies, with both proven results and projected savings, including: "
        },
        {
            "heading": 2,
            "text": "Find out more about the Funding Service "
        },
        {
            "text": "We’re excited about the innovative changes the Funding Service will bring to how MHCLG delivers grant funding. Follow our progress by subscribing to the MHCLG Digital blog or email fundingservice@communities.gov.uk to speak to the team. "
        },
        {
            "text": "Read more about MHCLG Digital's objectives and guiding principles and the work digital teams are doing to improve outcomes across MHCLG."
        }
    ]
}