{
    "url": "https://forestrycommission.blog.gov.uk/2024/12/10/into-the-woods-enhancing-local-history-with-woodland-and-green-space/",
    "title": "Into the woods: enhancing local history with woodland and green space",
    "authors": [
        "Tab Robinson"
    ],
    "categories": [
        "Into the woods series",
        "Nature",
        "Urban trees"
    ],
    "pub_date": "2024-12-10T09:00:00+00:00",
    "content": [
        {
            "text": "A short drive from St Helens town centre stands Sutton Manor Community Woodland. This iconic site, easily recognisable from the M62, offers visitors the chance to enjoy a winding series of pathways through young woodland and open meadows and up the gentle sloping hill to the iconic 'Dream' sculpture by Jaume Plensa."
        },
        {
            "text": "Walkers are invited to appreciate the sights and sounds of nature and the wide views across to Warrington and the Mersey. The woodland boasts a wide range of flora and fauna, and at the right time of year birds of prey can be seen hovering overhead. If you don’t get your fill of woodland from Sutton Manor, Clockface Country Park is only a few minutes’ walk away."
        },
        {
            "heading": 2,
            "text": "An industrial history"
        },
        {
            "text": "Rewind fifty years and the views would be very different. Sutton Manor Community Woodland is located on the former spoil heap of a colliery that hired over a thousand miners at its peak operation. Clockface Country Park was also the site of a colliery, which produced over 160,000 tonnes of coal a year."
        },
        {
            "text": "Eagled-eyed visitors might notice the ‘hidden in plain sight’ history scattered throughout the woodland: from gates to the former sites and the aptly named Miners Way, to the vents hidden in the trees connected to mining shafts that remain underground. Links between the industrial past and the wooded present become obvious when you know what to look for, and there are information signs across the sites to help visitors spot the signs."
        },
        {
            "text": "These links are an important part of the area. Modern day St Helens is in many ways a product of the Industrial Revolution. With its ties to early locomotion and boasting the first canal, the population multiplied. The town grew, collecting nearby hamlets like Rainhill and Haydock together. Mining, brickmaking and glass industries also relied on the resources in the area, supporting the population boom. These industries continued to support the community up until the 1990s."
        },
        {
            "text": "These mines, factories and collieries played a major role in the lives of the residents. Beyond providing an income, the mining and related industries contributed to the spirit of St Helens, its sense of community and the town’s economy. Their outputs were also a source of pride and recognition for the town. The glassmaking company Pilkington was founded under the name 'St. Helens Crown Glass' and is still a brand you can see on many car windows across the country."
        },
        {
            "heading": 2,
            "text": "Turning post-industrial sites into green spaces"
        },
        {
            "text": "Over the decades, the natural resources that supported these industries began to deplete or become unviable, and sites were left unused. Since the 1980s, communities, local businesses and government have joined together to restore these sites through conservation and regeneration projects like Operation Groundwork. It has preserved their importance and significance to the town through conversion to public green space."
        },
        {
            "text": "In the 1990s Clockface Country Park was opened on the site of the former colliery, complete with woodlands, footpaths, meadows and a pond. In 2001 the former spoil heap of Sutton Manor Colliery was transformed into the community woodland we know today. Over 2 million trees were planted, creating a haven for wildlife, the local community and visitors."
        },
        {
            "text": "These new green spaces enable future generations to engage in this important local history. Locations that once contributed to the area through mining and industry continue to provide benefits to the local community through recreation, improved air quality and local tourism. Alongside providing a connection to the past, the town now has an enviable footprint of green space haloing the town centre."
        },
        {
            "heading": 2,
            "text": "Look for signs of the past"
        },
        {
            "text": "Urban green spaces often have a complex and contrasting history. Next time you are on a walk to your local park or woodland, look for information signs and hidden clues between the trees. By looking for signs of the past along woodland walks, you can deepen your connection to local spaces, and maybe even learn something you never knew about a place you regularly walk through with the dog or on your commute."
        }
    ]
}