{
    "url": "https://naturalengland.blog.gov.uk/2024/12/10/new-nature-connection-website-brings-together-policy-practice-and-research/",
    "title": "New Nature Connection website brings together   policy, practice and research",
    "authors": [
        "Natural England"
    ],
    "categories": [
        "Coast and access",
        "Connecting People with Nature",
        "Mental health and wellbeing",
        "Natural England",
        "Parks, trails and nature reserves"
    ],
    "pub_date": "2024-12-10T08:05:00+00:00",
    "content": [
        {
            "text": "The University of Derby and Natural England have been developing a Nature Connectedness Network and it has now gone public with the launch of its website!"
        },
        {
            "text": "CLICK HERE  www.natureconnectedness.net "
        },
        {
            "text": "As society becomes more aware of the mutual dependency between people and nature, there is a growing understanding of how nurturing a connection with the natural world can benefit individual health, strengthen communities, and encourage environmentally friendly behaviours."
        },
        {
            "text": "The Nature Connectedness Network is open to everyone, including government staff. It provides the opportunity to explore how spending time in and connecting with nature can play a role in different areas of work."
        },
        {
            "text": "Dr Carly Butler, Researcher in Nature Connectedness, University of Derby"
        },
        {
            "text": "\"The network enables me to connect with practitioners, professionals, policy makers, and academics with a shared interest in enriching people’s relationships with nature. I get to learn about the innovative and powerful ways people across the health, education, arts and culture, environment, and academic sectors are connecting people with nature for the wellbeing of both humans and the natural world. The network offers opportunities to keep up-to-date with latest nature connection research and applications, discuss challenges and opportunities in the field, share best practice, and develop new collaborations.”"
        },
        {
            "text": "There is strong, consistent evidence highlighting the benefits of spending time in nature and connecting with it more deeply which positively impacts mental wellbeing, physical health, pro-environmental behaviour and conservation efforts.  These findings have the potential to align with a range of government priorities. For example:"
        },
        {
            "text": "Find out more about Nature Connection"
        },
        {
            "text": "Join the Nature Connectedness Network to gain insight into the role nature connection has in creating a safer, healthier and more prosperous society and explore how it could be relevant to your role. The network aims to enable members to collaborate, share, and make use of evidence for growing closer relationships between people/society and nature."
        },
        {
            "text": "www.natureconnectedness.net"
        },
        {
            "text": "You can also contact the NE team for more info: "
        },
        {
            "text": "lara.pike@naturalengland.org.uk"
        },
        {
            "text": "martin.gilchrist@naturalengland.org.uk"
        }
    ]
}