{
    "url": "https://nationalscreening.blog.gov.uk/2024/12/10/sma-ise-partnership-board-updated-on-very-useful-modelling-study-workshop/",
    "title": "SMA ISE partnership board updated on very useful modelling study workshop",
    "authors": [
        "Mike Harris"
    ],
    "categories": [
        "General",
        "NHS Newborn Blood Spot Screening Programme"
    ],
    "pub_date": "2024-12-10T17:16:33+00:00",
    "content": [
        {
            "text": "The Spinal Muscular Atrophy (SMA) Screening In-service evaluation (ISE) Partnership Board met on 28 November."
        },
        {
            "text": "The remit of the partnership board is to oversee the planning elements for the ISE of newborn screening for SMA, a rare inherited condition (see minutes of UK NSC’s June 2023 meeting)."
        },
        {
            "text": "The board heard that a stakeholder workshop had been held on 26 November when the Sheffield Centre for Health and Related Research (ScHARR) presented interim results of a new modelling study into SMA screening for the UK context."
        },
        {
            "text": "This model, in conjunction with the ISE of screening in NHS services, will inform the UK NSC’s recommendation on whether SMA should be screened for."
        },
        {
            "text": "Board members heard that the workshop had been very useful, and stakeholders had provided the ScHARR team with extensive and constructive feedback. That feedback will be used to help change and improve the model, and the ScHARR team still has work to do to finish its analysis."
        },
        {
            "text": "Sign-off for approval and publication of the National Institute for Health and Care Research’s (NIHR’s) research study brief is awaited. This will inform details of the ISE."
        },
        {
            "heading": 2,
            "text": "News from the expert sub-groups"
        },
        {
            "text": "The chairs of the partnership board’s 3 expert sub-groups gave updates on their respective workstreams."
        },
        {
            "text": "Laboratory sub-group chair Jim Bonham explained that it is a working assumption that the ISE would start by using the 6 English screening labs that can already test for SMA using the SCID testing platform."
        },
        {
            "text": "David Elliman gave an update on the work of the clinical pathway sub-group. He said it had been agreed that all SMN2 copy numbers should be reported to parents at the first consultation following a positive screening result. A smaller task and finish group is continuing to work on the core content of information on SMA screening that the ISE will provide to parents and on training materials for staff."
        },
        {
            "text": "Joan Morris gave an update on the work of the data and methodology sub-group."
        },
        {
            "text": "The board heard that the National Institute for Health and Care Excellence (NICE) had not reached a decision on the use of 2 of the 3 SMA drug treatments, nusinersen and risdiplam, that had been available under a managed access agreement (MAA)."
        },
        {
            "text": "NICE was concerned about several significant issues raised by stakeholders after reading the report of an external assessment group (EAG). NICE has now brought a new EAG on board and the 2 drugs will continue to be available in England under MAA arrangements while the new appraisal takes place."
        },
        {
            "text": "The UK NSC secretariat is aiming to speak to NICE about these issues. The UK NSC would not want to make a recommendation that conflicts with NICE guidance, but it is possible that the SMA screening ISE might help to resolve some of the issues from the recent evaluation report."
        },
        {
            "text": "NHS England reported that preparatory work continues to plan for the ISE, with the expectation that it will start some time in 2025."
        },
        {
            "text": "The board also heard an update from Genomics England (GEL) on the Generation Study, which aims to recruit 100,000 newborn babies and screen them for more than 200 genetic variants, including SMA. GEL clarified that its role was to follow existing national pathways, not develop new ones, while board members stressed the importance of ensuring that there are nationally agreed clinical pathways that are aligned between the planned ISE and the Generation Study."
        },
        {
            "heading": 2,
            "text": "Keep up to date"
        },
        {
            "text": "The UK NSC blog provides up to date news from the UK National Screening Committee. You can register to receive updates direct to your inbox, so there’s no need to keep checking for new articles. If you have any questions about this blog article, or about the work of the UK NSC, email uknsc@dhsc.gov.uk."
        }
    ]
}