{
    "url": "https://educationhub.blog.gov.uk/2024/12/teacher-pay-what-does-the-evidence-mean-for-schools/",
    "title": "Teacher pay: what does the pay evidence mean for schools?",
    "authors": [
        "mediaofficer"
    ],
    "categories": [
        "Funding",
        "School spending",
        "Schools",
        "Secondary schools",
        "Teacher pay"
    ],
    "pub_date": "2024-12-10T17:32:38+00:00",
    "content": [
        {
            "text": "The Education Secretary has written to the School Teachers’ Review Body (STRB) providing evidence ahead of the body making recommendations on the teacher pay award for the 2025/26 academic year.  "
        },
        {
            "text": "The STRB is an independent group that makes recommendations on the pay of teachers and leaders in maintained schools in England and reports to the Secretary of State for Education and the Prime Minister. "
        },
        {
            "text": "Each year the STRB recommends a pay award based on different factors including the economy, school workforce data and evidence from organisations including the Department for Education, and the teaching unions. "
        },
        {
            "text": "The government then considers the recommendations in depth and decides on the pay award teachers receive for the coming year. "
        },
        {
            "heading": 2,
            "text": "What does the department’s evidence say on pay? "
        },
        {
            "text": "The department recognises that high quality teaching is the factor within school that makes the biggest difference to a child’s education, giving them the knowledge and skills to succeed throughout life. We are committed to supporting teachers to stay in the profession and thrive. "
        },
        {
            "text": "In the context of the challenging national economic picture, the department has set out that a 2.8% pay award would be appropriate."
        },
        {
            "text": "This is following a 5.0%, 6.5% and 5.5% increase over the last three years, meaning with this further pay proposal teachers could receive a pay rise of over 21% in four years."
        },
        {
            "text": "Most recently, the government agreed a 5.5% fully-funded pay award for 2024/25. For the average teacher, this would mean an increase of over £2,500 in their pay packet over the year, bringing their salary to over £49,000 a year. "
        },
        {
            "heading": 2,
            "text": "How will this pay award be funded? "
        },
        {
            "text": "All public services are feeling the impact of the current strain on finances, but the government’s commitment to education was laid out in the Autumn Budget when schools were given an additional £2.3 billion for next year. "
        },
        {
            "text": "Schools will be expected to fund this pay award from the additional investment provided at the Budget, alongside their existing funds. For many schools this will mean reprioritising some of their budget – to go towards new pay costs as well as more generally ensuring best value from overall resources. "
        },
        {
            "text": "The department is providing a package of support to help schools do this. This is in line with asks to the rest of the public sector to help get our public services back on an even footing. "
        },
        {
            "heading": 2,
            "text": "Why are you publishing this evidence now? "
        },
        {
            "text": "We are giving schools as much notice as possible to ensure they can plan ahead. Schools have asked us for this, which is why we have shared our evidence as early as possible.  "
        },
        {
            "text": "The department will publish its usual estimate of what is affordable for the average school in the new year. This information will be published in the department’s annual School Costs Technical Note (SCTN). "
        },
        {
            "text": "While the SCTN will set out what the increases from the Autumn Budget mean on average for schools, the 2.8% pay increase proposed in written evidence is the figure schools will want to consider when they are planning their budgets for next year. "
        },
        {
            "heading": 2,
            "text": "What support is there for schools to make savings and ensure they are securing best value from their budgets? "
        },
        {
            "text": "Getting value for money from existing services is a key part of ensuring the public sector can meet the challenges the country is facing in the current financial climate. "
        },
        {
            "text": "Overall core school funding will be almost £63.9bn next year, but schools – like all parts of the public sector – are being asked to get more out of their budgets.  "
        },
        {
            "text": "In addition to the new funding from the Autumn Budget, the department will support schools to ensure they are getting the best value for money. "
        },
        {
            "text": "To help, we are offering new support to make budgets go further across technology, buying, banking services and energy contracts. "
        },
        {
            "text": "For example: "
        },
        {
            "text": "- Supporting schools to access the department’s energy contracts. This is already being piloted and has enabled schools involved in the pilot to reduce their next energy contracts by 36% on average. "
        },
        {
            "text": "- Securing banking solutions for schools to access better interest rates. "
        },
        {
            "text": "- Publishing digital and technology standards to help schools and colleges make more informed decisions about technology leading to safer, more cost-efficient practices and new learning opportunities for students. To support schools to meet these standards we have invested in connectivity infrastructure and developed a digital support service .   "
        },
        {
            "text": "This is on top of existing support including the School Resource Management Adviser programme and the Get Help Buying for Schools service, which help schools to manage their resources as efficiently as possible.  "
        },
        {
            "text": "All available support can be accessed on our GOV.UK page.  "
        },
        {
            "heading": 2,
            "text": "Does this 2.8% pay proposal also apply to support staff?  "
        },
        {
            "text": "This proposal only applies to teachers, but we would expect schools to plan for pay awards across all staff when setting their budgets. The department will be assuming that whatever level of award a school absorbs from its budget for teachers it can also absorb for support staff. "
        },
        {
            "text": "Unlike teachers, most school support staff are currently employed on the pay and conditions of the National Joint Council for Local Government Services. The National Joint Council is a negotiating body made up of representatives from trade unions and local government employers. "
        },
        {
            "text": "The reinstatement of the School Support Staff Negotiating Body from next year will allow for better alignment in the timing of support staff and teacher pay award processes, which should make budget planning easier for school leaders.  "
        },
        {
            "heading": 2,
            "text": "What else is in the written evidence? "
        },
        {
            "text": "The wider written evidence document provides further information to the STRB to support the development of their recommendations and views. "
        },
        {
            "text": "It also provides more information about the school budget context for the 2025/26 award which schools will want to consider to further aid their planning. "
        },
        {
            "text": "The evidence includes patterns and trends in teacher recruitment and retention and the steps the government has already taken and plans to take to address this.  "
        },
        {
            "text": "The evidence also asks the STRB for their views on how the pay and conditions framework can best support teachers from all backgrounds and those with protected characteristics, including how flexible working can be better supported in schools. Teaching should be a supportive and inclusive profession, and it is vital that we attract and retain talented teachers from all backgrounds to deliver on our mission to break down barriers to opportunity for all children. "
        }
    ]
}