{
    "url": "https://stratcommand.blog.gov.uk/2024/12/10/wargaming-wisdom/",
    "title": "Wargaming Wisdom",
    "authors": [
        "HeatherS"
    ],
    "categories": [
        "Wargaming"
    ],
    "pub_date": "2024-12-10T12:10:44+00:00",
    "content": [
        {
            "heading": 4,
            "text": "As part of the Defence Experimentation and Wargaming Hub’s People in Wargaming series we recently spoke to a panel of people/experts about their experiences in the field of wargaming."
        },
        {
            "text": "Interviewer: Can you briefly introduce yourself?  "
        },
        {
            "text": "Tom: I’m Tom Mouat, I'm the Officer in Charge of the Defence Modelling, Simulation and Wargaming School at the Defence Academy of the UK.  Of course, being head of a school implies personnel, resources and money."
        },
        {
            "text": "Interviewer: Can you briefly describe your experience in wargaming?  "
        },
        {
            "text": "Tom: I’ve always been interested in wargaming, ever since I was in school, but never really delved into it - it was just a pastime. When I went to Sandhurst, I was taught war studies by Dr Paddy Griffiths, and he used wargaming to help illustrate the classes he was teaching. It was the first time I'd really seen serious wargaming used for education and understanding. "
        },
        {
            "text": "Years later, I fell in with a crowd who took Wargaming quite seriously and designed their own games. They did actual research and asked me to help on a serious wargame for the Ministry of Defence (the Unmanned Underwater Vehicle project) which went incredibly well."
        },
        {
            "text": "Interviewer: Can you explain your role within the Defence Experimentation and Wargaming Hub?   "
        },
        {
            "text": "Tom: The Hub is a bit of a kick-starter to develop wargaming across the MOD; it's a really important organisation as wargaming has risen in popularity. The Defence Experimentation and Wargaming Hub gives people an opportunity to seek advice and build understanding wargaming. My role is linked to the Hub - my position at the Defence Academy is to provide courses that will complement and feed into what other parts of Defence are doing. "
        },
        {
            "text": "The Defence Experimentation and Wargaming Hub is doing the educational and the training side of wargaming with some experimentation.  "
        },
        {
            "text": "The Defence Wargaming Centre at Dstl concentrate on the analytical aspect. My job is to get Military Units and the Hub the trained people they need."
        },
        {
            "text": "Interviewer: What are some of the key skills required for success in wargaming?  Tom: Wargaming is a set of tools and techniques that can illuminate and help when dealing with a problem (not necessarily even a military one). You need to understand when a wargame isn't the appropriate answer to a problem, in some cases it should be just a bit of planning, applying some military common sense and red teaming a problem. So, understanding when it's not appropriate is very important. "
        },
        {
            "text": "The key skill is to realise that wargaming is a model of whatever it is you're looking at. Which is why it is important to use simple models that give you useful insights - as opposed to complex AI driven computer simulations that recreate all the problems of the real world, which can leave you none the wiser. Lastly, listening is another key skill, you have to be able to understand what your customer wants, and often they may not always understand it themselves. "
        },
        {
            "text": "This isn't the case that the customers always right, because if the master question isn’t right, then we're just going to waste time and money. So it's very important to be able to listen and get behind the question that's being asked to what is the problem and what we are trying to solve. "
        },
        {
            "text": "Interviewer: What current trends are you seeing in the wargaming industry?  Tom: A lot of people say we're reaching the golden age of wargaming.  The trend has been that games are becoming more sophisticated, designed to a purpose and designed to a time span making it even more accessible to the participants.  "
        },
        {
            "text": "People want to move away from expensive and complex computer simulations. They want to be able to interact with each other and provide structure to that interaction. So we're getting games different subjects, the games are better designed and not as open-ended. Monopoly, for example, which is a ghastly game, was specifically designed to show the evils of capitalism and things like Risk, which are open-ended, are zero-sum games where only one person can win. It's quite obvious who's going to win about halfway through, and it's just a tedious flog for everyone else who isn't winning. "
        },
        {
            "text": "So the modern trend is to design games in a more realistic and nuanced way, with many games specifically designed to last a certain time. They have mechanisms in them to balance the game and the objectives to prevent it being obvious to see who's winning and to get the game finished within a time scale. All these makes games more accessible and useful."
        },
        {
            "text": "Interviewer: How do you think wargaming will evolve over the next five years?  "
        },
        {
            "text": "Tom: I think wargame is going to evolve through the use of what I would call peripheral technology. I have to say I’m not a fan of all of them, but this is the direction of travel. Many people think it will be VR type games; but VR is an extremely difficult bit of technology."
        },
        {
            "text": " All of the experimentation, research and reports has been done with a self-selecting group of fans and we still don't have a clear understanding of how users will interact with VR for wargaming (let alone the issues of VR sickness). "
        },
        {
            "text": "The peripheral technology I'm talking about is the ability to make components, maps and cards very quickly. Using 3D printing for game pieces, there are companies who will deliver bespoke items to you very quickly indeed. You can order printed counters that are quite beautiful and make a game look very professional.  "
        },
        {
            "text": "The development of prototype games can be produced cheaper and in a shorter time. One of the overriding features of wargaming, is that it's available at short notice to look at really serious problems. Computing maybe be useful for briefings and preparatory work. If you've got a stack of information, you can get AI to efficiently summarise that into a briefing pack, because busy people need to have effective Summaries. Digital Mapping is an interesting area, there are ways of making digital maps as accessible as a paper map, but they are quite complex (and expensive). If necessary, in austere conditions, you may still have to resort to using an old pizza box and a pair of scissors to make the components."
        },
        {
            "text": "Interviewer: What is your favourite wargame and why?  "
        },
        {
            "text": "Tom: I don't have a favourite game, because if you keep playing in a game that you know how to win, you are simply being a bully,  but I do have a few highlights.  One game is Advanced Squad Leader, which is hideously complex, and impossible to play in a reasonable time. It serves as a fantastic example of how not to design an effective game for military use. "
        },
        {
            "text": "I quite like Black Orchestra - it's about a plot to remove Hitler and every character in the game is a real person who tried to stop Hitler – including Sophie Scholl, the woman who founded the non-violent White Rose movement to try and prevent Hitler coming to power. She was executed by the Nazis for handing out anti-war leaflets. It is an educational and inspiring game, but also the game design is excellent.  "
        },
        {
            "text": "There are games like Pandemic, which everyone raves about but is awful to play, as experienced players will simple tell less experienced players what to do – which is a disaster in a cooperative game. Black Orchestra is cooperative, but avoids that by clever design. "
        },
        {
            "text": "Interviewer: What is the biggest challenge facing Defence Wargaming?    "
        },
        {
            "text": "Tom: I think there's a lack of understanding of the breadth and scope of wargaming. This is a direct result of a lack of access to courses that could teach people about wargaming. I'm going to, hopefully, be running those courses over the next few years before I finally retire after 49 years of service. "
        },
        {
            "text": "Interviewer: What advice would you give to someone aspiring to enter the wargaming industry?  "
        },
        {
            "text": "Tom: Wargaming is experiential learning. The biggest skill is being able to effectively facilitate games. "
        },
        {
            "text": "You need to be able to take people through the process in a way that will get them playing the game as quickly as possible. You need to make it accessible for people, but not make it too perfect – so at the end of of the game, they say “that was great, but I'd like to see it include X, Y and Z”, so that we can have a Socratic Dialogue about the subject and real learning will take place.  We want to have effective facilitation so that people can get other people wargaming, get them understanding wargaming, and help get them educated in the ways of modern warfare. It's not easy, but it is really worthwhile. In order to get better at something, you have to practice, and have the opportunity to facilitate.  "
        },
        {
            "text": "This is what we seek to enable at the Defence Modelling and Simulation School."
        },
        {
            "text": "Interviewer: What drives you as an individual?     "
        },
        {
            "text": "Tom: I'm a reservist, I have the best job in the world. There is nothing quite like a really good wargame to explain and understand a problem and getting people immersed in it.  Wargaming is about understanding, honesty and challenge – so if you're not there to speak truth to power as a full-time reservist, then you have no value. "
        },
        {
            "text": "You're there to enable the next generation and ensure wargames are a safe to fail environment to encourage learning."
        }
    ]
}