{
    "url": "https://educationhub.blog.gov.uk/2022/01/what-to-expect-when-schools-colleges-universities-and-early-years-settings-return-after-the-christmas-break/",
    "title": "What to expect when schools, colleges, universities and early years settings return after the Christmas break",
    "authors": [
        "mediaofficer"
    ],
    "categories": [
        "Coronavirus",
        "early years",
        "Further education",
        "Ofsted",
        "Returning to school",
        "Schools",
        "Universities"
    ],
    "pub_date": "2022-01-03T12:02:47+00:00",
    "content": [
        {
            "text": "Schools, colleges, universities, and early years settings are getting ready to reopen after their Christmas breaks."
        },
        {
            "text": "Our priority is for education settings to deliver high-quality education face-to-face, to all children and learners. The evidence is clear that being out of education causes significant harm to educational attainment, life chances, mental and physical health."
        },
        {
            "text": "With the risk of infection from the Omicron variant of COVID-19 still high, we’re reminding education and childcare settings – as well as young people, families, teachers and other education and childcare staff – to continue to take the necessary steps to ensure that the return to education and childcare is as safe as possible."
        },
        {
            "text": "COVID-19 continues to be a virus that we are learning to live with and the need to reduce the disruption to children and learners’ education remains."
        },
        {
            "text": "Here we provide an update on what to expect (click on the heading to jump to that section)."
        },
        {
            "text": "Schools and colleges\nEarly years settings\nUniversities"
        },
        {
            "heading": 2,
            "text": "Schools and colleges"
        },
        {
            "heading": 3,
            "text": "Has anything changed? "
        },
        {
            "text": "The only things that have changed are the rules on self-isolation, temporary introduction of face coverings in secondary schools and colleges, the vaccination programme for school aged children and Ofsted inspections."
        },
        {
            "text": "If a child or pupil tests positive they may be able to end their self-isolation period before the end of the 10 full days. They can take a lateral flow device (LFD) test from 6 days after the day symptoms started and another LFD test on the following day. The second LFD test should be taken at least 24 hours later. If both these test results are negative, and the child or pupil does not have a high temperature, they may end their self-isolation after the second negative test result, and return to their education setting."
        },
        {
            "text": "To maximise the number of children in school and college for the maximum amount of time, the Government is temporarily recommending that face coverings are worn in classrooms and teaching spaces for students in year 7 or above, in light of the Omicron variant surge. The advice is short term only to support pupils and teachers as they return to schools this term and builds on the existing proportionate guidance that recommends face coverings for all adults in communal areas of all settings."
        },
        {
            "text": "The advice on face coverings in classrooms will be in place until the 26 January, when Plan B regulations are currently scheduled to expire, at which point it will be reviewed."
        },
        {
            "text": "We know that vaccinations remain our best defence against COVID-19 and that is why every child and young person aged 12 and over is eligible to receive the vaccine and second doses for 12-15 year olds are also now available – we encourage everyone to get theirs as soon as they are eligible. More information on the importance of getting a vaccine or a booster is available here: How getting a booster will help protect education - The Education Hub (blog.gov.uk). Parents and teachers are also encouraged to get the vaccine and their boosters."
        },
        {
            "text": "Ofsted has already confirmed that it will not be inspecting secondary schools during the first week of term in January, as schools undertake on-site pupil testing."
        },
        {
            "text": "In addition, for a temporary period from the start of January, Ofsted will not ask school, college and early years leaders, who are also Ofsted inspectors to undertake inspections, this will mean they can focus entirely on their leadership responsibilities at this critical time."
        },
        {
            "heading": 3,
            "text": "What has remained the same?"
        },
        {
            "text": "We are continuing to ask that all schools and colleges encourage students and pupils to participate in regular LFD testing at home after taking their initial test before they return to the classroom."
        },
        {
            "text": "All secondary schools should be doing one test on-site at school as pupils return. Information on testing in education settings is available in our recent piece here: Five ways we’re protecting education - The Education Hub (blog.gov.uk)."
        },
        {
            "text": "Education staff and college students are being asked to self-test at home before they return, and were sent home with tests ahead of the Christmas break."
        },
        {
            "text": "Most testing kits have already been received for the start of the new term and schools and colleges use a different supply route to get their lateral flow tests. We continue to work with UK Health Security Agency (UKHSA) to ensure education settings are able to receive adequate supplies of test kits."
        },
        {
            "text": "There is no need for primary age pupils (those in year 6 and below) to regularly test, unless they have been identified as a contact for someone who has tested positive for COVID-19. In this case, they are advised to take LFD tests every day for 7 days. Primary-aged pupils who are identified as close contacts should continue to access tests through the Universal Testing Offer. Availability is refreshed throughout the day, so individuals should continue to check the website. Primary schools should not order tests for students through the education channel, this route is for staff only."
        },
        {
            "text": "People who are fully vaccinated or aged between 5 years and 18 years and 6 months, and identified as a close contact with someone who has tested positive for COVID-19, should take an LFD test every day for 7 days and continue going to school or college as normal, unless they have a positive test result or show symptoms."
        },
        {
            "text": "Even if someone has tested positive for COVID-19 within the last 90 days, they are strongly encouraged to take part in LFD testing on-site via ATS or at home once they have completed their isolation period for their prior infection."
        },
        {
            "heading": 3,
            "text": "Are schools and colleges definitely going to return after Christmas?"
        },
        {
            "text": "Yes - all schools and colleges should return after the Christmas break."
        },
        {
            "text": "We recognise that there will be pressures on staffing where case rates are high and that’s why we’ve asked ex-teachers to come forward to offer their services."
        },
        {
            "text": "We are also providing advice for schools and colleges on continuing face-to-face education should they have high rates of staff absence."
        },
        {
            "text": "Secondary schools can stagger the return of students throughout the first week of term, to enable on-site testing to take place. All classes should have returned by Monday 10th January."
        },
        {
            "heading": 3,
            "text": "What are schools and colleges expected to do if they have a high number of staff members absent? "
        },
        {
            "text": "We know some schools and colleges might find it difficult to run their usual timetable if high numbers of staff members are absent."
        },
        {
            "text": "To help make sure students can continue to be in school or college with their friends and all the benefits that brings, settings could consider asking teachers to deliver lessons from home, which are then streamed to classrooms in schools and colleges."
        },
        {
            "text": "In these instances, classrooms should of course be supervised by another member of staff, which could include support staff like teaching assistants."
        },
        {
            "text": "As pupils do not need to be kept in consistent groups, schools and colleges may wish to consider combining classes."
        },
        {
            "heading": 3,
            "text": "What about face coverings?"
        },
        {
            "text": "For students in secondary schools, we are already strongly advising that face coverings should be worn in communal areas in all settings by staff, visitors and pupils or students in year 7 and above, unless they are exempt."
        },
        {
            "text": "To maximise the number of children in school and college for the maximum amount of time, the Government is temporarily recommending that face coverings are worn in classrooms and teaching spaces for students in year 7 or above, in light of the Omicron variant surge. The advice is short term only and will be in place until the 26 January, when Plan B regulations are currently scheduled to expire, at which point it will be reviewed."
        },
        {
            "text": "Pupils or students (in year 7 or above) should continue to wear face coverings on public and dedicated school transport, unless they are exempt."
        },
        {
            "text": "For children in primary schools, health advice is that under 11s are exempt from wearing face coverings in national guidance – in all settings, including education. We are already limiting transmission in primary schools and early years settings by recommending that face coverings are worn by staff and adults (including visitors aged 11 years and over) when moving around in corridors and communal areas."
        },
        {
            "heading": 3,
            "text": "What else are you doing to safeguard face-to-face education?"
        },
        {
            "text": "Schools, colleges and early years settings should continue to ensure there is good ventilation in classrooms. This prevents the virus hanging around in the air and infecting people."
        },
        {
            "text": "We have provided schools with CO2 monitors to help them identify areas where ventilation needs to be improved, but also to provide reassurance that existing ventilation measures are working. So far, more than 353,000 CO2 monitors have been delivered to schools, early years settings and colleges."
        },
        {
            "text": "We are also making up to 7,000 air cleaning units available for poorly ventilated teaching spaces in state funded education settings where quick fixes to improve ventilation are not possible. This builds on the 1,000 air purifiers announced for special schools and alternative provision settings. We will keep this under review as part of our overall response to the pandemic and we will continue to work with the sector to understand ventilation needs across the education estate."
        },
        {
            "text": "Practising good hygiene also remains essential – regular handwashing, cleaning your surroundings and covering your mouth when you cough or sneeze and then washing your hands, will all help stop the spread of the virus."
        },
        {
            "heading": 3,
            "text": "What happens if children or young people need to be at home?"
        },
        {
            "text": "If children or young people cannot attend school or college either because they have tested positive or have symptoms, but are well enough to continue studying, any remote education should mirror that received in the classroom as closely as possible. That should focus on live lessons - alongside time for students to complete tasks independently - for a minimum of five hours a day in secondary schools and slightly less in primaries."
        },
        {
            "heading": 3,
            "text": "Will scheduled VTQ exams and formal assessments still be going ahead in January?"
        },
        {
            "text": "Yes -  these exams and formal assessments should go ahead so students, who have worked so hard to prepare for them, have the chance to demonstrate what they know.\n"
        },
        {
            "heading": 2,
            "text": "Early years settings"
        },
        {
            "heading": 3,
            "text": "Has anything changed?"
        },
        {
            "text": "Our guidance published on 14th December continues to focus on safeguarding face-to-face education and childcare. Early years settings should organise their provision around this principle."
        },
        {
            "text": "Whilst doing so, there are number of actions that can be taken to keep both children and staff as safe as possible. These are set out in the guidance Actions for early years and childcare providers during the coronavirus (COVID-19) outbreak - GOV.UK (www.gov.uk), which has been updated with a few key changes."
        },
        {
            "heading": 3,
            "text": "What about self-isolation and testing?"
        },
        {
            "text": "The UKHSA has advised there are limited public health benefits to regular testing of early years children with LFD tests."
        },
        {
            "text": "The exception is if they have tested positive for COVID-19 themselves. If a child tests positive they may be able to end their self-isolation period before the end of the 10 full days by following the guidance on LFD testing."
        },
        {
            "text": "Testing is at the discretion of a parent or carer, but those who do not receive negative LFD test results will need to complete a 10-day self-isolation period."
        },
        {
            "text": "Children under 5 are exempt from self-isolation and do not need to take part in daily testing if they are a close contact of somebody with COVID-19. Find out more about daily testing of contacts here: What you need to know about daily testing for COVID-19 contacts - The Education Hub (blog.gov.uk)."
        },
        {
            "heading": 3,
            "text": "What are settings expected to do if they have a high number of staff absent?"
        },
        {
            "text": "We consider COVID-19 to be an exceptional circumstance in which the staff-to-child ratios set out in the early years foundation stage (EYFS) can temporarily be changed if necessary, for example to respond to COVID-related workforce absences."
        },
        {
            "text": "In some cases, providers may choose to respond to staff and child absences by temporarily mixing age groups of children who would otherwise be educated or cared for separately. Ratios should be guided by all relevant requirements and by the needs of individual children within the group."
        },
        {
            "text": "In all circumstances, early years settings and schools remain responsible for maintaining the quality of care, safety and security of children.\n"
        },
        {
            "heading": 2,
            "text": "Universities"
        },
        {
            "heading": 3,
            "text": "What’s changed? "
        },
        {
            "text": "The only change temporary change for universities is that we are recommending that face coverings should be worn by students, staff and adult visitors in teaching settings, for example in workshops, laboratories, offices, libraries, teaching rooms and lecture halls. This builds on the existing guidance that face coverings are worn when moving around the premises such as in corridors and communal spaces. This is a short term measure and will also be reviewed on 26 January."
        },
        {
            "text": "Universities have their own plans in place to respond in the event of any outbreak in their institutions, but we’ve been clear that face-to-face teaching remains our top priority. It is what students want and expect, so we expect face-to-face teaching to continue."
        },
        {
            "text": "Whilst there are no plans to stop students who have not been boosted returning to campus, we encourage every student to get boosted as soon as possible, either by booking an appointment or grabbing a free jab at a walk-in clinic. Booster jabs are now widely available to those over the age of 18, as long as 3 months have passed since the first dose."
        },
        {
            "text": "Students can grab a jab at local sites run by GPs or community pharmacies, at larger vaccination centres and in some hospitals."
        },
        {
            "heading": 3,
            "text": "What else is happening?"
        },
        {
            "text": "We strongly encourage students to test before they travel back to University after the Christmas break, using either a home test kit collected from their university, local pharmacy or by ordering a test online."
        },
        {
            "text": "To help avoid a rise in cases, we are asking universities to continue to strongly encourage students and staff to test twice a week, 3-4 days apart, using home test kits (LFD Collect), where possible."
        },
        {
            "text": "When testing at home, test results must be reported online to NHS Test and Trace whether positive, negative or void. Reporting results helps the NHS prevent and reduce the spread of the virus, save lives and keep university students in face-to-face education."
        },
        {
            "text": "We are also encouraging students to get vaccinated. Vaccines are the best way we can protect ourselves. Getting vaccinated is critically important for keeping us, our friends, family members and teachers safe. A booster will strengthen your protection from serious illness from COVID-19 and give you the best possible defence for you and your family. To book, just visit the NHS website or speak to your GP."
        },
        {
            "heading": 3,
            "text": "What are the rules for international students who have gone home over Christmas – can they return?"
        },
        {
            "text": "It is important that all students and staff who are travelling to the UK stick to the government’s latest travel advice, which can be found on Travel to England from another country during coronavirus (COVID-19) - GOV.UK (www.gov.uk)"
        },
        {
            "text": "In the first instance international students should speak to their university directly if they have concerns."
        },
        {
            "text": "Concessions for those on Student (or Tier 4) visas allow for the provision of online learning for students outside the UK until the 6 April 2022. These visa concessions have been implemented so that students have a greater degree of flexibility on when they travel into the UK, if required."
        },
        {
            "text": "Students should carefully consider the possibility of travel disruption and be assured that their HE provider will be ready to support them during this period."
        },
        {
            "text": "In the event that students need to quarantine on return to the UK they should speak to their university about the support they will be offered."
        },
        {
            "text": "We recommend that international students check their vaccination status, as they are all welcome to a free vaccination, including the Booster vaccine. The best way to do this is to register with a GP once they have arrived."
        }
    ]
}