{
    "url": "https://dwpdigital.blog.gov.uk/2023/09/06/agile-coaching-or-team-coaching-either-way-its-a-powerful-collaborative-tool/",
    "title": "Agile Coaching or Team Coaching: either way, it’s a powerful collaborative tool",
    "authors": [
        "Hannah Dell'Armi - agile delivery, DWP Digital"
    ],
    "categories": [
        "Agile development",
        "agile teams",
        "Coaching",
        "Mentoring",
        "Women in Digital"
    ],
    "pub_date": "2023-09-06T10:39:07+01:00",
    "content": [
        {
            "text": "Agile Coaching is a relatively new profession in DWP Digital. We're the first government department in England to have the profession – that we know of. Because it’s such a new role, we’re a small community and the demand on our service is high. "
        },
        {
            "text": "There are so far only four agile coaches in DWP Digital, each bringing with them their own unique set of skills and experience. We provide a valuable service to lots of different teams across DWP, not just in digital.  "
        },
        {
            "text": "Between the four of us, we help a wide range of multidisciplinary teams and individuals adapt to agile ways of working, improve their team dynamics and adapt to organisational change. We use team coaching techniques to help them unlock solutions to those challenges and make progress towards their goals.  "
        },
        {
            "text": "Our goal is to help people across the department deliver for those we serve. "
        },
        {
            "text": "We also lean into our experience as Agile-Lean practitioners to help them grow and mature a culture of continuous improvement. "
        },
        {
            "heading": 2,
            "text": "Agile coaches aren’t just coaches – we are teachers, facilitators, mentors and more "
        },
        {
            "text": "Having the word ‘coach’ in the job title can be misleading. Agile coaching isn’t always delivered from a coaching stance. Although a coaching stance can work great with individuals and teams, when we work with digital teams going through big changes, we often adopt other stances. "
        },
        {
            "text": "We can for example, adopt the stance of ‘teacher’, ‘facilitator’ or ‘mentor’, but we always aim to end up in a coaching stance as the team and culture matures. "
        },
        {
            "text": "Often with Agile coaching, we look at processes and structure, but problems that teams face are frequently about communication and collaboration. So, we need to look at how teams work together, rather than just get the theory right.  "
        },
        {
            "text": "Being ‘Agile’ is not the end goal, after all.  "
        },
        {
            "text": "That’s when team coaching, and a more ‘lean out’ approach to tackling the problem, can be extremely beneficial. As coaches, we believe that those doing the work have the power to solve their own problems. We just need to create the right environment and hold the space for them to do so. "
        },
        {
            "text": "DWP Digital is vast, and digital teams collaborate with colleagues across DWP, so we often take a systemic approach to coaching.  "
        },
        {
            "text": "We work with individual teams on a micro level, as I covered above. But equally, unless we also coach the systems the teams are part of, we cannot expect to see lasting change and impactful outcomes. That can often mean challenging the status quo elsewhere in the organisation, but it’s an important part of our role. "
        },
        {
            "heading": 2,
            "text": "Widening coaching opportunities for DWP colleagues "
        },
        {
            "text": "Having worked with many teams in DWP in the last year, we could see there was an appetite for one-to-one coaching from people across the organisation. Working in government presents unique challenges, and everyone in the organisation needs to be a problem-solver on a regular basis. "
        },
        {
            "text": "A couple of years ago, I decided to seek out more one-to-one coaching experience, on the basis that it would complement and enrich the work I was doing with teams. So, supported by our excellent delivery practice and our generous learning and development budget, me and 12 aspiring coaches from our agile delivery community completed the International Coaching Federation accredited programme with Barefoot Coaching.  "
        },
        {
            "text": "On completion of the course, you can continue your study with a PG Cert – something I’m knee deep in currently – and work towards becoming an Associate Certified Coach accredited with the ICF. "
        },
        {
            "text": "To do that, coaches need a number of hours of coaching experience under their belts. So I put a call out for potential coachees across DWP, offering them 4.5 hours of pro bono coaching from a trainee coach to help towards the final assessment. "
        },
        {
            "text": "The response was incredible, and came as a real surprise to me. 500 people from across DWP applied to take part. We had expressions of interest from delivery managers, deputy directors, data analysts, Job Centre Plus colleagues, work coaches – people in a huge range of roles across the wider organisation. "
        },
        {
            "heading": 2,
            "text": "A collaborative approach to a coaching challenge "
        },
        {
            "text": "With a limited resource in DWP Digital of 13 fresh but eager trainee coaches, I could see we needed help to deliver this amount of coaching. I reached out to our wider network – fellow coaches from HMRC and Cabinet Office, and some of our DWP apprenticeship coaches. I also contacted trainee coaches from the private sector that we trained with.  "
        },
        {
            "text": "We now have around 30 coaches from other government departments and the private sector, helping us build coaching relationships with 50 of the coachees that signed up. In return, our trainee coaches are getting valuable coaching experience and will be able to apply for their professional accreditation. "
        },
        {
            "text": "There is clearly a huge demand for coaching in government. Generally, it’s not offered as a service to everyone. Often, because demand is high and the number of coaches is low, it’s offered to those in senior leadership positions as a priority, in the hope that their experiences help to build a coaching culture within the organisation.  "
        },
        {
            "text": "But for me coaching is not exclusive to senior leadership roles – coaching is for everyone. It enables the individual to find their own answers to their questions, and as a result they are more committed to solving problems. "
        },
        {
            "text": "I believe that in an organisation full of problem-solvers, coaching is an increasingly essential tool. "
        },
        {
            "text": "My little experiment isn’t the only activity happening within the coaching space. Others outside of DWP Digital in the wider organisation are investing in coaching apprenticeships, individual coaching and team coaching, to not only upskill our staff but to bring much-needed coaching capability to the wider department. "
        },
        {
            "text": "Although applications for our trial are currently closed, civil servants can access the wider Government campus coaching catalogue through Civil Service Learning, where they can reach out to qualified coaches within the wider Civil Service for free support. "
        }
    ]
}