{
    "url": "https://environmentagency.blog.gov.uk/2023/09/06/creating-an-effective-waste-crime-partnership/",
    "title": "Creating an effective waste crime partnership",
    "authors": [
        "Environment Agency"
    ],
    "categories": [
        "Environment Agency",
        "Waste"
    ],
    "pub_date": "2023-09-06T10:05:55+00:00",
    "content": [
        {
            "text": "Stuart Hoyle has worked at the Environment Agency for eight years and has been a Waste Crime Engagement Specialist since the role was created in 2019."
        },
        {
            "text": "Here he highlights the panel session on 13 September by the Waste Crime Engagement Specialists at the annual Resource and Waste Management Expo and why effective partnerships matter."
        },
        {
            "text": "In the beginning "
        },
        {
            "text": "In 2019 Waste Crime Engagement Specialists were placed in every Environment Agency area to prevent and disrupt local waste crime through engagement. As a group we work together on national priorities. I cover the Lincolnshire and Northamptonshire Area."
        },
        {
            "text": "As a former detective my background had mainly been in solving crimes. Only in the last four years of that career did engagement with external stakeholders become essential to me, as a Counter Terrorism Security Adviser. With responsibility for five police force areas, part of my job was guiding a wide variety of stakeholders to implement measures to reduce their vulnerabilities and mitigate threats of attack."
        },
        {
            "text": "When my current role was created, I knew the value of engagement to achieve desired outcomes. A lot has been achieved across the country through partnerships since 2019, but there is still much to do. Filling in engagement gaps is one of them, as is improving what has already been created."
        },
        {
            "text": "Developing partnerships"
        },
        {
            "text": "The newly created Waste Crime Engagement Specialists developed a National Engagement Plan for waste crime. At the same time, we developed local plans for our own geographic areas."
        },
        {
            "text": "In my area I discovered that engagement on waste crime between stakeholders was fragmented and disjointed, where it existed at all. My colleagues reported a similar picture in their areas of England, with very few notable exceptions."
        },
        {
            "text": "Separate partnerships and groups that did exist in areas usually had fly-tipping as an additional agenda item, did not link up and sometimes were not aware of each others' existence. These included Rural Crime Groups, County Waste Partnerships focused on collection and disposal policies, and police-led partnerships with fly-tipping as a low priority. Groups were addressing fly-tipping and other waste crime as a side issue and, worse still, independently of each other. We know this is still the case in some parts of the country, but we are working on improving that."
        },
        {
            "text": "Very rarely did a county have a single partnership solely concerned with fly-tipping and waste crime. This had to change."
        },
        {
            "text": "I found a like-minded person and ally in a local District Council Manager. We set about deciding what we wanted a partnership to achieve, then identifying the right people and post holders from potential partner agencies. We did our ‘stakeholder analysis’ and devised strategies to form the Lincolnshire Environmental Crime Partnership."
        },
        {
            "text": "The first meeting was attended by all of Lincolnshire’s District Councils, the County Council, police, NFU, County Landowners Association, the MoD and Internal Drainage Board. We used the time to gather views on definitions, main aims and information sharing to establish consistent terms and implement a shared strategy across the partnership."
        },
        {
            "text": "Partnership in action"
        },
        {
            "text": "Today, additional partners include two police forces, two Police and Crime Commissioners, Fire and Rescue, DVSA, Forestry Commission and National Trust. Subgroups have been created, such as the Practitioners Working Group and a Vulnerable Land Panel. There is a Vehicle Seizure Protocol between the enforcement partners and a Communications Plan. Together we plan and execute intelligence-led interventions with great results."
        },
        {
            "text": "Since 2021 we’ve had the only Waste Crime Partnership Information Sharing Agreement in England, but others will have theirs soon."
        },
        {
            "text": "We share our learning and receive learning from others to continually improve our shared strategy to prevent and disrupt waste crime. We produce an annual report where our successes and future plans can be seen. This is published on the Lincolnshire Police and Crime Commissioners website."
        },
        {
            "text": "To learn more about creating an effective waste crime partnership, get ideas for the one you have, or share some of your successful strategies, join the Waste Crime Engagement Specialists presentation and discussion panel at the RWM Expo, Birmingham NEC at 14.30 on 13 September in the Local Authority Theatre. Register for your free ticket here."
        }
    ]
}