{
    "url": "https://valuationoffice.blog.gov.uk/2023/09/06/how-we-value-for-business-rates/",
    "title": "How we value for business rates",
    "authors": [
        "John Berry - Director of Property Professional Services"
    ],
    "categories": [
        "Business Rates",
        "Valuation"
    ],
    "pub_date": "2023-09-06T11:43:51+01:00",
    "content": [
        {
            "text": "Now you’ve read our introduction to business rates, learn more about your business property’s valuation. "
        },
        {
            "text": "How have you valued my property? "
        },
        {
            "text": "We use recognised valuation methods approved by the Royal Institution of Chartered Surveyors (RICS) when valuing non-domestic properties.  "
        },
        {
            "text": "Non-domestic properties are properties that are not used as a main home. They include places like shops, offices, holiday rental homes, stables and beach huts. "
        },
        {
            "text": "Our valuation methods have been clarified and confirmed by court decisions over many years. "
        },
        {
            "text": "How we value depends on the type of property and the evidence available."
        },
        {
            "text": "Most properties are valued using rental comparison. This is the most common and straightforward valuation method. Shops, offices and factories are valued in this way.  "
        },
        {
            "text": "We analyse rental evidence from similar properties to determine a value per metre squared.  "
        },
        {
            "text": "We use a different method – receipts and expenditure – when: "
        },
        {
            "text": "This method involves analysing income and expenditure to see what a reasonable rent might be. Hotels, cinemas and self-catering accommodation, for example, are valued this way.  "
        },
        {
            "text": "We also use a method called the contractor’s basis in other circumstances. We use this when there is no rental evidence or trading details to analyse. It involves estimating the yearly cost of a replacement property. Properties like hospitals, schools and prisons are valued this way.  "
        },
        {
            "text": "Why might my valuation change? "
        },
        {
            "text": "We carry out a ‘revaluation’ of all non-domestic properties on a regular basis. We do this to help ensure business rates bills are based on up-to-date information.  "
        },
        {
            "text": "Revaluations are not carried out to generate extra revenue. "
        },
        {
            "text": "When we do a revaluation, we reassess the rateable values of all non-domestic properties in England and Wales.  "
        },
        {
            "text": "Rateable values reflect the open market rental value of a property at a specific date. "
        },
        {
            "text": "We carried out a revaluation recently.   "
        },
        {
            "text": "Changes in valuations at other times "
        },
        {
            "text": "Sometimes your property valuation might change even if a revaluation is not taking place.  "
        },
        {
            "text": "When this happens, it is usually because your property has changed.  "
        },
        {
            "text": "For example: "
        },
        {
            "text": "You can tell us if you have made changes to your business property or if you think your rateable value is incorrect. You can read more about how to check and challenge your business rates valuation. "
        },
        {
            "text": "How can I find out more? "
        },
        {
            "text": "Set up a business rates valuation account to find out more about how your rateable value has been calculated. "
        },
        {
            "text": "If you want to find out more about what we’ve covered here, watch our webinar on understanding business rates on our YouTube channel.  "
        }
    ]
}