{
    "url": "https://aphascience.blog.gov.uk/2023/09/06/hunting-for-the-asian-hornet/",
    "title": "Hunting for the Asian hornet",
    "authors": [
        "Rebekah Clarkson"
    ],
    "categories": [
        "Bee health",
        "Invasive Species"
    ],
    "pub_date": "2023-09-06T10:26:34+01:00",
    "content": [
        {
            "text": "To mark this year’s Asian hornet week, Rebekah Clarkson from APHA’s National Bee Unit (NBU) talks about the work the NBU is doing to crack down on this invasive species and how you can report sightings."
        },
        {
            "text": "Asian hornets are invasive non-native species which originate from Asia. In recent years they have colonised mainland Europe, and they now pose a significant threat to the United Kingdom’s native pollinators."
        },
        {
            "heading": 3,
            "text": "The work of the National Bee Unit (NBU)"
        },
        {
            "text": "In August 2023, the NBU found and destroyed a record number of nests in England. We even received a report of two insects travelling on the Cherbourg-Poole ferry! A rolling update of findings can be found on the NBU’s BeeBase website."
        },
        {
            "text": "Recent findings have included primary and secondary nests in Folkestone, Plymouth, and Maidstone. Normally, nests found low are primary nests, and nests found higher in trees are secondary nests. A queen starts a primary nest, but if the nest outgrows its position, or is disturbed, they may also build a higher, safer, warmer secondary nest. After the NBU locates a nest, we destroy it and then monitor for Asian hornets until no hornets are seen for five consecutive days. If Asian hornets continue to be caught, we continue our monitoring to check if another nest is present."
        },
        {
            "heading": 3,
            "text": "Asian hornet nest analysis"
        },
        {
            "text": "Nests and their contents are assessed to provide information on their relatedness to other findings and to gain information on its maturity. These attributes help guide future monitoring decisions."
        },
        {
            "heading": 3,
            "text": "How you can help in the fight against Asian hornets"
        },
        {
            "text": "With this year’s record number of incursions, we need you more than ever to help us locate nests which may be out there; so, this Asian hornet week please look out for Asian hornets in your garden."
        },
        {
            "text": "Asian hornets can be spotted on flowering plants and, particularly at this time of year, on Ivy as well as fruit including apples, pears, plumbs and grapes. Whilst they are feeding, and if safe to do so, please take a photograph of it and send this to us via the Asian Hornet Watch app."
        },
        {
            "heading": 3,
            "text": "What to look out for"
        },
        {
            "text": "Asian hornets are mainly black in colour with yellow ends to their legs and a clear orange/yellow band of the abdomen."
        },
        {
            "text": "For further information on Asian hornet identification, you can watch this video or look at our identification sheet."
        },
        {
            "heading": 3,
            "text": "How to report Asian hornet sightings"
        },
        {
            "text": "A quick and easy way to report sightings is by downloading and using the Asian Hornet Watch app."
        },
        {
            "text": "The app was launched in 2017 by the UK Centre for Ecology & Hydrology (UK CEH) to make recording Asian hornet sightings as simple as possible. It provides lots of information on similar looking insects."
        },
        {
            "text": "You can download the app for iPhone or Android."
        },
        {
            "text": "An alternative to using the app is to complete our online recording form."
        },
        {
            "text": "Sightings without photos need to include enough information to make it credible to trigger a visit from a British Beekeepers Association Asian Hornet Team member. Sightings become more credible if they include:"
        },
        {
            "text": "Last year UK CEH and the National Bee Unit looked through reports of more than 5,000 insects."
        },
        {
            "text": "All reports are reviewed, and if a clear photo or enough detailed information is provided to make it credible, it is forwarded to the National Bee Unit to follow up. Many reports turn out to be similar looking insects to the Asian hornet such as the native European hornet. Credible reports without enough evidence are either asked for more detail, or forwarded to British Beekeepers Association Asian Hornet Teams, who help monitor for Asian hornets in the suspect area. You can find your local Asian Hornet Team Coordinator on the BBKA’s website."
        },
        {
            "text": " "
        },
        {
            "text": " "
        }
    ]
}