{
    "url": "https://defrafarming.blog.gov.uk/2023/09/06/landscape-recovery-developing-the-scheme-together/",
    "title": "Landscape Recovery: developing the scheme together",
    "authors": [
        "Phoebe Hamilton-Jones"
    ],
    "categories": [
        "Payments to restore landscapes and ecosystems"
    ],
    "pub_date": "2023-09-06T12:07:03+01:00",
    "content": [
        {
            "text": "In the first round of Landscape Recovery, we enrolled 22 diverse projects from across England into the project development phase. "
        },
        {
            "text": "There is still time to apply for the second round before it closes for applications on 21 September.  "
        },
        {
            "text": "The second round will fund projects that support net zero, protected sites and wildlife-rich habitats. "
        },
        {
            "text": "Gathering the experiences of participants is very important. We do this through interviews, co-design, surveys and informal face-to-face meetings. "
        },
        {
            "text": "In this post, I’ll share a summary of what we’ve learnt from participants and prospective participants about the application and enrolment phases and the improvements we've made as a result. "
        },
        {
            "heading": 2,
            "text": "Engaging with participants "
        },
        {
            "text": "Before launching the first round, we held a series of information sessions for prospective applicants so they could learn more about the scheme.  "
        },
        {
            "text": "After each session, we asked attendees to share their feedback through a survey. We hoped this would help us gauge how attractive Landscape Recovery was to them and understand any barriers to applying for the scheme. "
        },
        {
            "text": "We then worked to adapt the process and identify ways to remove those barriers.  "
        },
        {
            "text": "Among those who attended the information sessions and responded to the survey, there was broad interest in the scheme."
        },
        {
            "text": "Survey responses revealed that Landscape Recovery was attractive because it offered opportunities to improve landscapes and recover species. "
        },
        {
            "text": "We found respondents were considering projects with a focus on a range of habitats and ecological functions, including river and catchment, coastal, and grassland. Respondents also indicated that farmer collaboration, partnerships and habitat connectivity would be integral to the scheme. "
        },
        {
            "text": "We altered certain elements of the scheme following feedback. For example, the proposed requirement of strict contiguity of land within each project was flagged as a barrier by some. We changed the requirement from ‘strictly contiguous’ to ‘broadly contiguous’ to allow more flexibility and accommodate complex land ownership and habitats.  "
        },
        {
            "text": "We initially proposed a 6-week application window. We soon extended this to 16 weeks in round one as participants suggested that 6 weeks wasn’t enough time to bring land managers on board and write an application.  "
        },
        {
            "text": "Following the success of information sessions in the first round, we ran and recorded webinars for market engagement in the second round. Again, we followed up by sending surveys to the 627 attendees.  "
        },
        {
            "text": "This time, respondents said they had not applied for the first round mainly because they lacked time to pull together a bid."
        },
        {
            "text": "As some respondents were keen to have a longer application window, we extended the second round’s application window from 16 weeks to 18 weeks. This also helped avoid the end of the window clashing with the busy harvesting period. "
        },
        {
            "text": "We also removed the upper area limit, something that was suggested by respondents. We hope this will help increase the potential impact per project and demonstrate how the scheme can work across larger landscapes. "
        },
        {
            "text": "When we asked attendees about the benefits of Landscape Recovery, many pointed to the opportunity to deliver multiple environmental outcomes at scale, securing long-term change in a local area, securing long-term funding, negotiating a bespoke implementation agreement, and leveraging private finance.  "
        },
        {
            "heading": 2,
            "text": "The application phase "
        },
        {
            "text": "Defra’s user research team carried out interviews with the first round’s successful and unsuccessful applicants.  "
        },
        {
            "text": "Feedback from these interviews and from project participants has helped us adapt the application phase of the second round. "
        },
        {
            "text": "We heard that the recorded webinar on application guidance held shortly after we opened the application window, was helpful. It gave applicants who missed the live session the opportunity to catch up.  "
        },
        {
            "text": "As a result, we offered and recorded webinars for the second round. I’ll share a link to the webinar recording at the bottom of this post. We also learnt that many applicants appreciated our rapid response to their written questions. We have tried to continue this in the second round.  "
        },
        {
            "text": "There was some ambivalence around having 2 separate themes in the first round as some applicants felt unsure which theme was most appropriate for their project.  We’ve adapted the second round by running a single competition for all projects, rather than separate competitions for projects with different focuses.  "
        },
        {
            "text": "We hope this will make the process more straightforward for applicants and panellists. "
        },
        {
            "text": "We’ve also clarified application guidance. We consolidated and simplified the criteria for the second round, following feedback from round one. "
        },
        {
            "text": "Similarly, some projects faced difficulties creating and submitting maps in the first round. We therefore ran a quick tutorial on using the MAGIC maps software as part of the application guidance webinar in the second round. You’ll see this in the video at the bottom of this post. "
        },
        {
            "text": "Finally, participants in the first round felt that there were repeated requests for information in the application and enrolment phases. We’ve therefore improved the alignment of the information we ask for at these phases for the second round.  "
        },
        {
            "text": "Finally, feedback from participants on the application and enrolment phases led us to streamline our approach to requesting information in the second round.  "
        },
        {
            "heading": 2,
            "text": "The enrolment phase "
        },
        {
            "text": "Next, we gathered and analysed feedback on the enrolment process to further improve the scheme. "
        },
        {
            "text": "We collected a range of insights through interviews, surveys and workshops as projects went through enrolment. "
        },
        {
            "text": "Participants were generally very complimentary about the support they received from their Project Liaison Officers. Each project has a Project Liaison Officer, who acts as a guide and direct contact, from one of our first and second round delivery partners, Natural England or the Environment Agency."
        },
        {
            "text": " Participants reported good, clear dialogue and speedy, honest responses from their Project Liaison Officers.  "
        },
        {
            "text": "Most projects were also positive about face-to-face meetings, site visits and the welcome webinar we held. These were described as ‘helpful’ and ‘inspiring’. "
        },
        {
            "text": "It became clear that it was important to bring projects together. We have coordinated webinars and a day-long, face-to-face meeting and site visit to the Eelscapes project. We’ve also set up a virtual community of practice to enable projects to link up, talk and share tips.  "
        },
        {
            "text": "Projects gave helpful feedback on the enrolment handbook, with some suggesting it could contain an action list and guidance on timelines. We’re exploring how we can best incorporate suggestions into the handbook for the second round. "
        },
        {
            "text": "Projects were more critical of the ‘gateway table’ used to forecast costs. It was often seen as overly prescriptive and unclear. We therefore adjusted and simplified the gateway table during the enrolment phase. We’re continuing to work on simplifying the gateway table in the hope that participants in the second round will find it easier to use. "
        },
        {
            "text": "Most projects also felt that the enrolment phase was more time consuming than expected. Many raised concerns over the administrative burden of the scheme. We’ve therefore tried to reduce the administration for the second round by altering the requirements during application and enrolment. "
        },
        {
            "text": "During interviews, flexibility often emerged as a theme. Many appreciated the scheme’s flexibility, noting that an exploratory project development phase of up to 2 years was desirable before committing to a long-term implementation agreement. "
        },
        {
            "text": "However, some projects wanted more flexibility to be worked into other areas of the scheme. As a result, we’re scoping out the degree of flexibility we’ll be able to offer in Landscape Recovery while ensuring that we safeguard our environmental commitments and offer good value for money. "
        },
        {
            "heading": 2,
            "text": "Next steps and thanks "
        },
        {
            "text": "We’re extremely grateful to all participants for their time, thoughtfulness, patience and desire to make the scheme work well. "
        },
        {
            "text": "We hope that the insights they have shared and continue to share can help shape policy and scheme design in years to come. Recently, participants co-designed the guidance documents for the project development phase."
        },
        {
            "text": "As the scheme adapts, we’ll continue to share what we learn here on the blog. "
        },
        {
            "text": "As mentioned earlier, the second round is open for applications until midday, 21 September 2023.  "
        },
        {
            "text": "To help you prepare, here's video recording of an information session on the second round.  "
        }
    ]
}