{
    "url": "https://cspl.blog.gov.uk/2023/09/06/lobbying-building-a-culture-of-openness-and-transparency/",
    "title": "Lobbying - building a culture of openness and transparency",
    "authors": [
        "Lord Jonathan Evans"
    ],
    "categories": [
        "Business Appointments",
        "Lobbying",
        "Revolving door"
    ],
    "pub_date": "2023-09-06T12:25:01+01:00",
    "content": [
        {
            "text": "Despite negative connotations, fair lobbying is a good and legitimate activity; it is vital to democracy that individuals, businesses and charities are able to input and respond to policy developments or proposed new legislation. Whether proposing solutions, raising concerns or providing additional evidence, input from a wide range of participants makes for better laws and regulation. "
        },
        {
            "text": "Where it becomes problematic is where there is paid lobbying by vested interests in such a way that access to decision makers is kept secret or only available to those with the right contacts. "
        },
        {
            "text": "This is why the government’s Business Appointments Rules impose a two year ban on lobbying for former Ministers and senior Civil Servants leaving public service, recognising the unique address book that comes from working in government. The Rules seek to stop companies which hire former civil servants and ministers from receiving unfair advantage in this way."
        },
        {
            "text": "Those in office - taking decisions on behalf of the taxpayer – must demonstrate accountability and integrity by being as open as possible about any lobbying they receive. "
        },
        {
            "text": "The government’s response to our 2021 Upholding Standards in Public Life report, committed to improving the detail and timeliness of government releases including developing “a single database to collate and publish department’s transparency returns”, and once that is developed, the government will “look to” move to a monthly reporting cycle.  There will also be “new transparency guidance for departments [which] will create stricter minimum standards for descriptions of meetings”. "
        },
        {
            "text": "Our report also recommended a number of changes to the Lobbying Register including that Consultant lobbyists should have to register on the basis of any communications with special advisers, director generals, and directors. The government accepted this recommendation in principle saying that  “the scope of departments’ transparency returns should be mirrored” by the lobbying register, but would not commit to making the necessary change in legislation, saying that it would assess the impact of new transparency returns on departments before doing so. "
        },
        {
            "text": "There is a lot of work to do across government to bring these changes in; it should not require forensic analysis or investigative skills to see who is meeting ministers and officials and the topics that were under discussion. Democracy benefits from having an investigative and vigilant media – but proactive transparency by those working for the public needs to be the norm."
        },
        {
            "text": "The Committee is holding a seminar in September, bringing together a range of experts and practitioners to see how the complex interaction of transparency, the register and the government’s Rules are working and how to improve transparency so it is easier to interrogate the available data around lobbying."
        },
        {
            "text": "We need to build a culture of openness and timely transparency around lobbying; greater clarity for all public office holders on the standards expected of them and reassurance for the public that a more ethical approach to lobbying is actively being applied by individuals and organisations involved in making and influencing government policy."
        },
        {
            "text": "We will publish the themes discussed at our seminar in September and the Committee will maintain a close watching brief on the progress towards the promised changes."
        },
        {
            "text": "Follow the Committee on twitter @PublicStandards"
        },
        {
            "text": "Read previous Committee reports"
        },
        {
            "text": "What are the Nolan Principles?"
        },
        {
            "text": "Watch a short film about the work of the Committee"
        }
    ]
}