{
    "url": "https://educationhub.blog.gov.uk/2023/09/06/new-guidance-on-raac-in-education-settings/",
    "title": "List of schools affected by RAAC and what you need to know about the new guidance",
    "authors": [
        "mediaofficer"
    ],
    "categories": [
        "School building",
        "Schools"
    ],
    "pub_date": "2023-09-06T16:41:03+01:00",
    "content": [
        {
            "text": "This article was first published on 31 August and has been updated to reflect the latest information. "
        },
        {
            "text": "Nothing is more important than the health and safety of children and staff. This is why we’ve announced a change in our approach to managing a building material found in some school buildings and other education settings, known as Reinforced Autoclaved Aerated Concrete (RAAC)."
        },
        {
            "text": "We have been proactively monitoring all confirmed cases of RAAC closely. Recent cases have led for the Department to be concerned about education settings', including schools, colleges and maintained nursery schools, ability to carefully manage the presence of RAAC in their buildings."
        },
        {
            "text": "As a result, we have published new guidance advising education settings to vacate areas that are known to contain RAAC, unless or until suitable mitigations are in place. We’re working hard to make sure any disruption to education is kept to a minimum."
        },
        {
            "text": "Thanks to the hard work of education leaders and local councils, the majority of settings have already been able to put mitigations in place and open for the start of term, with 70% of settings providing face-to-face learning for all pupils this week."
        },
        {
            "text": "It’s important to remember that currently less than 1% of settings are affected by this new guidance. Your child should attend school as normal in September, unless you hear differently.\nWe have spoken to the education settings that are impacted and they are being contacted by a dedicated caseworker who will support them through each step of this process."
        },
        {
            "text": "Here’s everything you need to know about RAAC, and how we’re supporting schools, colleges and nurseries across the country to manage it safely."
        },
        {
            "heading": 3,
            "text": "List of schools affected by RAAC"
        },
        {
            "text": "The list of schools and colleges where the presence of RAAC was confirmed by 30 August has been published, here, on Gov.uk."
        },
        {
            "text": "As of 6 September, most settings have already been able to put mitigations in place and open for the start of term – 104 settings are providing face-to-face learning for all pupils this week. Meanwhile, 20 settings have put hybrid arrangements in place, with some pupils learning off-site, and 19 have delayed the start of term by a few days to ensure pupils can return to face-to-face learning safely on site."
        },
        {
            "text": "Only 4 have had to move to remote learning. Nine settings have since been found not to have RAAC."
        },
        {
            "text": "In 2022, the Department for Education sent a questionnaire to responsible bodies, asking them to provide information to help us understand the use of RAAC across the school estate and make sure the correct support is in place. We are still waiting on some responsible bodies to return their questionnaire."
        },
        {
            "text": "The figures published today are likely to rise over time surveys are carried out and as the remaining 5% of responsible bodies return their questionnaires. Any responsible body or school that has notified the Department of suspected RAAC will be surveyed within the coming weeks and supported to put mitigations in place."
        },
        {
            "heading": 3,
            "text": "What is RAAC?"
        },
        {
            "text": "RAAC is a lightweight, ‘bubbly’ form of concrete commonly used in construction between the 1950s and mid-1990s. It is predominantly found as precast panels in roofs, commonly found in flat roofs, and occasionally in floors and walls."
        },
        {
            "text": "It means it may be found in any school and college building that was either built or modified in this time period."
        },
        {
            "heading": 3,
            "text": "How and why has the way you deal with RAAC changed?"
        },
        {
            "text": "We have been helping schools and responsible bodies, such as local authorities and multi-academy trusts, to manage the potential risks of RAAC since 2018 by providing guidance and funding."
        },
        {
            "text": "However, recent cases have led us to be concerned about education settings’ ability to carefully manage the presence of RAAC in their buildings, which is why we’ve updated the guidance."
        },
        {
            "text": "This is a precautionary step, but the safety of young people and staff is always our priority."
        },
        {
            "text": "To minimise any disruption, all education settings with confirmed RAAC will be supported by a dedicated caseworker to help them through any necessary changes."
        },
        {
            "heading": 3,
            "text": "How many schools are affected by RAAC and will all of them need to close?"
        },
        {
            "text": "There are over 22,000 schools and colleges and less than 1% are known to be affected.\nAnd no – not all schools affected by RAAC will close."
        },
        {
            "text": "The impact of RAAC is varied – some settings may have very little RAAC present with limited disruption as a result. For example, this change in approach could lead to the temporary closure of one school space, like a single classroom. In most cases, children will be able to continue attending school as normal."
        },
        {
            "heading": 3,
            "text": "How are you supporting schools and education settings where RAAC is present?"
        },
        {
            "text": "Most education settings will be unaffected by this change in approach."
        },
        {
            "text": "For those settings that are affected, we’re working to make sure there is minimal disruption to education and the vast majority will remain open for face-to-face learning from the start of term."
        },
        {
            "text": "All settings known to contain RAAC will be assigned a dedicated DfE caseworker who will work with the responsible body to assess the site’s particular needs and help them put in place individual solutions."
        },
        {
            "text": "This could include using other on-site buildings, local spaces, safety measures in the affected area and, in some cases, erecting temporary buildings."
        },
        {
            "text": "We have also published further guidance for schools and colleges on identifying and managing RAAC. This will set out how the department will provide support and capital funding to schools and other settings so that face-to-face education continues safely."
        },
        {
            "heading": 3,
            "text": "How will this be funded?"
        },
        {
            "text": "The government will spend whatever it takes to keep children safe."
        },
        {
            "text": "This includes paying for the emergency mitigation work to make buildings safe, including alternative classroom space where necessary."
        },
        {
            "text": "Where schools need additional help with revenue costs like transport to other locations, we are actively engaging with every school affected to put appropriate support in place."
        },
        {
            "heading": 3,
            "text": "What should schools and other education settings do if they are worried about RAAC?"
        },
        {
            "text": "If they haven’t already, responsible bodies should fill out our questionnaire on RAAC at this link."
        },
        {
            "text": "Based on the answers given, settings with suspected RAAC will be brought forward for surveying. We hope to have all schools currently suspected as containing RAAC surveyed in a matter of weeks."
        },
        {
            "text": "If RAAC is confirmed, we will ensure appropriate rapid action is taken. This could include providing funding to remove any immediate risks and, where necessary, arranging temporary buildings to be put in place."
        },
        {
            "heading": 3,
            "text": "What about other education settings like colleges? Are they also at risk from RAAC?"
        },
        {
            "text": "The change in guidance covers state-funded educational settings, responsible bodies for maintained nursery schools and colleges should fill out the same questionnaire as schools so they can get the support they need."
        },
        {
            "text": "Is my child’s school closing because of RAAC and how can I find out the latest information?"
        },
        {
            "text": "Schools and other education settings will let you know directly if there is any change to the start of term."
        },
        {
            "text": "Most schools will be unaffected, and children should attend school as normal in September, unless you hear differently."
        },
        {
            "heading": 3,
            "text": "How do I know whether my child’s school has been surveyed?"
        },
        {
            "text": "Parents unsure about whether their child’s school has undergone a RAAC survey should contact their school directly."
        },
        {
            "text": "In the coming weeks, we will have surveyed and agreed mitigation plans with 95% of schools. To date, two thirds of schools who think they may have RAAC have been found to not have RAAC once properly surveyed."
        },
        {
            "text": "We are still waiting for some schools to respond to our questionnaire, which may identify more schools where RAAC is present. However, we expect the total number of schools affected to be in the hundreds, not thousands, meaning over 95% of schools will be totally unaffected."
        },
        {
            "heading": 3,
            "text": "Is it safe for children to go to school?"
        },
        {
            "text": "Yes, unless advised by their school, children should be in school."
        },
        {
            "text": "It has always been the case that if the Department is made aware of a building that poses a safety risk, we will take immediate action to ensure safety and mitigate the situation."
        },
        {
            "heading": 3,
            "text": "How are you keeping school buildings safe?"
        },
        {
            "text": "We have invested over £15 billion since 2015 to keep schools in good working order, including £1.8 billion committed for 2023-24."
        },
        {
            "text": "We are also investing in 500 projects for new and refurbished school buildings through our School Rebuilding Programme."
        },
        {
            "text": "You can read more about how we’re keeping school building’s safe on the Education Hub."
        }
    ]
}