{
    "url": "https://hodigital.blog.gov.uk/2019/07/18/why-well-meaning-ideas-can-have-unintended-consequences/",
    "title": "Why well-meaning ideas can have unintended consequences",
    "authors": [
        "Jane Devine"
    ],
    "categories": [
        "Design",
        "User research"
    ],
    "pub_date": "2019-07-18T09:58:43+01:00",
    "content": [
        {
            "heading": 2,
            "text": "Just test the thing"
        },
        {
            "text": "Have you ever been asked to ‘just’ get a form online or get a website tested?"
        },
        {
            "text": "As a Senior User Researcher in the Home Office, I seem to have a knack for working on projects where the stakeholders or product owners have good intentions but haven’t thought through unintended consequences."
        },
        {
            "text": "They will often ask me to publish a form or test a website, and what’s wrong with this? Surely putting a link to an online form is quick, cheap and people will either choose to use it or ignore it? "
        },
        {
            "text": "And if they don’t use it, we can shrug our shoulders safe in the knowledge we fulfilled our obligations."
        },
        {
            "heading": 2,
            "text": "Why a form is not always the right answer"
        },
        {
            "text": "The well-meaning idea behind a form as a solution is often \"people need to tell us stuff\" so that we can make a decision based on this information."
        },
        {
            "text": "But just publishing a form online, based on a hunch of what we think a user needs, means we miss out on the vital discovery phase, in which we explore the problem that needs to be solved. "
        },
        {
            "text": "By missing out on the discovery phase and going straight to a solution you have no idea what the user needs are, what the policy intent is and how far apart those 2 things are."
        },
        {
            "text": "But most importantly, going straight to a solution can erode trust from those who use our services – the public."
        },
        {
            "heading": 2,
            "text": "Why we need to care about trust"
        },
        {
            "text": "The Government Transformation Strategy 2017 – 2020 says: “we [will] improve trust between citizens and state, giving citizens confidence that their personal data is secure and being used in ways they expect, while making government activity more transparent.”"
        },
        {
            "text": "In publishing a form, are we being transparent about what will happen to that data, what the decision-making process is, and why we are asking those particular questions?"
        },
        {
            "text": "Unlike commercial products, our users have no choice but to use our services. Interacting with government means you are trying to get a thing done that could have serious consequences for you if you get it wrong. "
        },
        {
            "text": "Therefore, we must make sure that when the public use our services:"
        },
        {
            "heading": 2,
            "text": "How users behave when there is a lack of trust"
        },
        {
            "text": "I have worked on a series of projects where the intentions were positive. However, these good intentions have led to unintended behaviours, for example:"
        },
        {
            "text": "These lead to wasted effort for both the user and the caseworker."
        },
        {
            "text": "I have also seen examples of where stakeholders may have unintentionally increased vulnerability and risk for people who have trusted us, for example:"
        },
        {
            "heading": 2,
            "text": "How to increase trust in our services"
        },
        {
            "text": "We need to think about the whole service. People may trust intermediaries and for them it is not just about using this form but a broader dialogue."
        },
        {
            "text": "We should consider if government should be the first port of call. What if we moved the service away from us, and to a trusted, established service provider who works on our behalf? "
        },
        {
            "text": "We can think about what the role is for third parties in government services, if they meet our users needs and how we can work with them better."
        },
        {
            "text": "In the example of people reporting incidents, rather than putting a form on the existing website, we ran a 6-week discovery. We found a third party who already had the trust of the user group and could provide guaranteed anonymity. "
        },
        {
            "text": "This had the added benefit of reducing cost and risk for the Home Office. We identified legal and policy changes that needed to happen to protect users and provide trust in the service."
        },
        {
            "text": "So if you're asked by someone to just get something live or published, talk to them about the benefits of running a discovery on the project first."
        }
    ]
}