{
    "url": "https://digitalhealth.blog.gov.uk/2025/05/21/a-channel-and-domain-strategy-for-adult-social-care-content/",
    "title": "A channel and domain strategy for adult social care content ",
    "authors": [
        "Hayley Sorrell",
        "Lizzy Bell"
    ],
    "categories": [
        "Adult Social Care",
        "Content",
        "Discovery"
    ],
    "pub_date": "2025-05-21T17:03:03+01:00",
    "content": [
        {
            "text": "Last week, in the Department of Health and Social Care’s (DHSC’s) digital transformation team, we started work to create a channel and domain strategy for adult social care content linked to DHSC and NHS England. "
        },
        {
            "text": "When we say digital ‘channels’ we mean the platforms where content is shared, such as websites, social media, and email services. ‘Domains’ are the specific web addresses or sections within a website where information is hosted.  "
        },
        {
            "text": "This work aims to make sure content is structured effectively, making it easier for people to find and access the right information. "
        },
        {
            "heading": 2,
            "text": "Why we’re doing this "
        },
        {
            "text": "There are many adult social care websites and domains which are owned or commissioned by DHSC and NHS England. Some of this content is aimed at the care workforce (for example, care home managers) and some is aimed at people who need care. "
        },
        {
            "text": "Examples of this content: "
        },
        {
            "text": "While each piece of content has a target audience and meets a need, content can feel fragmented and hard to navigate - for example, when someone is trying to understand if they are eligible to get funding for their care costs.  "
        },
        {
            "text": "We hope a clear channel and domain strategy will mean we can understand where current and future content should sit to serve our users best. We’re working alongside another discovery which is focussed on the information needs of people looking for adult social care. "
        },
        {
            "heading": 2,
            "text": "What work has happened so far "
        },
        {
            "text": "Working with user-centred design professionals from our team and content designers from our delivery partner, we kicked off the work with a workshop with colleagues from DHSC and NHS England who are responsible for much of our adult social care content. In this workshop, we worked on understanding the problem further, identifying user types and discussing different models for managing and publishing content.  "
        }
    ]
}