{
    "url": "https://environmentagency.blog.gov.uk/2025/05/21/environment-agency-tracks-down-waste-criminals-trading-online/",
    "title": "Environment Agency tracks down waste criminals trading online",
    "authors": [
        "defrablogs"
    ],
    "categories": [
        "Environment Agency",
        "Regulated industry",
        "Waste"
    ],
    "pub_date": "2025-05-21T08:44:50+00:00",
    "content": [
        {
            "text": "Waste Crime Engagement Specialist, Alan Dengate shares how the Environment Agency is working to prevent waste criminals trading online. "
        },
        {
            "text": "Once upon a time waste crimes were committed by those working in the sector cutting a few regulatory corners, looking to save a few quid and make more profit. Rogue operators still exist, and their actions then and now negatively impact the environment and look unsightly, but their crimes were manageable."
        },
        {
            "text": "But times have changed."
        },
        {
            "text": "Now the waste industry is rife with rogue traders and a target for organised crime groups who weave a web of deceit, using online trading platforms to attract customers, offering low prices and stealing business from law abiding businesses."
        },
        {
            "text": "In our 2023 National Waste Crime Survey, the waste industry estimated that 18% of waste may be handled illegally at some point in the waste supply chain, this is around 34 million tonnes of waste every year, enough to fill 4 million skips.  "
        },
        {
            "text": "In my role I work with a range of enforcement and non-enforcement partners to inform, educate and collaborate to mitigate all forms of waste crime."
        },
        {
            "text": "The online space is still relatively new and continues to evolve at pace especially with AI now coming to the forefront of most search engines. This poses both a challenge for enforcement partners and opportunities for those who wish to exploit the current waste regulation systems."
        },
        {
            "text": "The Environment Agency started working with online trading platforms over five years ago but since those initial days of waste companies having a small online presence, the space has exploded with trading sites and apps becoming the norm as members of the public and businesses want waste removed with a few clicks and usually without needing any human interaction."
        },
        {
            "text": "We faced the challenge of collaborating with providers to ensure they performed the same checks we require from individuals, such as verifying our public register to confirm that a company is a registered waste carrier."
        },
        {
            "text": "Sounds simple but when you are asking an online trading company to change their web design in a competitive world it is not that easy."
        },
        {
            "text": "Slowly we have made progress and now have agreements in place with most of the main trading platforms to take down any traders convicted of waste crime offences or who are trading illegally as waste collectors or advertising an illegal waste site."
        },
        {
            "text": "Often, we find these illegal traders use the Environment Agency logo to convey legitimacy, but we never give permission for our logo to be used by any traders, legal or otherwise. This is not allowed under any circumstances and shouldn’t be viewed as an endorsement of that business."
        },
        {
            "text": "As we move forward there is always more we can do through collaboration with our enforcement partners and as the waste regulatory reform changes come through over the next few years, the rules and regulations around trading will become tighter so that legitimate businesses continue to thrive and are not undercut by that small minority who continue to flout the rules."
        },
        {
            "text": "In summary we have our eyes and ears open in more places than you expect, so stay vigilant and ensure that your waste does not become part of our next major investigation."
        }
    ]
}