{
    "url": "https://ukhsa.blog.gov.uk/2025/05/21/how-we-protect-the-uk-from-vector-borne-diseases/",
    "title": "How we protect the UK from vector-borne diseases like dengue and West Nile virus",
    "authors": [
        "Blog Editor"
    ],
    "categories": [
        "Health Protection",
        "Zoonoses"
    ],
    "pub_date": "2025-05-21T09:30:00+01:00",
    "content": [
        {
            "text": "Vector-borne diseases - illnesses transmitted to humans by organisms such as mosquitoes and ticks - account for more than 17% of all infectious diseases globally, causing over 700,000 deaths annually. They include malaria, West Nile virus, dengue and yellow fever. At UKHSA, our medical entomology teams play a vital role in monitoring and assessing new species and diseases that could threaten public health."
        },
        {
            "heading": 2,
            "text": "Current UK risk profile"
        },
        {
            "text": "The risk from vector-borne diseases in the UK is increasing due to global travel and trade, changing land use and climate change."
        },
        {
            "text": "Imported malaria cases in England, Wales and Northern Ireland exceeded 2,000 in 2023 - the highest in 20 years - compared to 1,369 in 2022. This rise coincides with malaria's global resurgence and increased post-pandemic travel."
        },
        {
            "text": "In recent years there has been an increase in locally acquired dengue cases in France, Italy and Spain, transmitted by the tiger mosquito, as well as an increase in imported travel-associated dengue cases in UK travellers. UKHSA vector surveillance systems have detected these mosquito species in the UK on a number of occasions, leading to rapid action to minimise their chances of establishing."
        },
        {
            "text": "Climate-sensitive mosquito-borne viruses have started to emerge in the UK, including the detection of Usutu virus in 2020, affecting blackbirds. Now, West Nile virus has been detected in UK mosquitoes for the first time. In July 2023, fragments of the virus were identified in Aedes vexans mosquitoes collected from wetlands in Nottinghamshire. While the risk to the public remains very low, this marks a significant development in vector surveillance"
        },
        {
            "heading": 2,
            "text": "How disease vectors reach the UK"
        },
        {
            "text": "Mosquitoes and ticks with the potential to transmit disease can reach our shores through:"
        },
        {
            "text": "As our climate warms, non-native species increasingly find UK conditions suitable for survival, reproduction and establishment."
        },
        {
            "heading": 2,
            "text": "UKHSA's response strategy"
        },
        {
            "text": "Our Medical Entomology and Zoonoses Ecology (MEZE) team in our Centre for Climate and Health Security (CCHS) assesses the emerging risks from vectors and advises the government on appropriate responses."
        },
        {
            "heading": 2,
            "text": "Mosquito surveillance and control"
        },
        {
            "text": "Transport hubs, such as motorway service stations and truck stops, are ideal sites at which in-depth data can be gathered on the detection of invasive mosquito species brought into the country in lorries and other vehicles."
        },
        {
            "text": "If imported goods or vehicles carrying mosquitoes reach the UK, they could establish a local population. Motorway service stations, showing evidence of eggs or larvae, could be the first sign of a potentially established population in the UK."
        },
        {
            "text": "We run mosquito traps targeting invasive species at high-risk sites across England, in collaboration with local authorities. Left unchecked, the consequences of not controlling these species could lead to the establishment of this invasive vector and therefore potential for new diseases that we have not seen in the UK."
        },
        {
            "text": "Coordinated by our teams, local authorities and communities are being encouraged to step into action in these instances and clear out sources of standing and stagnant water such as blocked gutters and drains, and ensure rainwater in litter, tarpaulin, open buckets, bins and discarded items are cleared away or arranged in a way that they drain away. This will also reduce the common Culex pipiens mosquito which is transmitting Usutu virus to blackbirds."
        },
        {
            "text": "When invasive species are detected, we implement aggressive interventions, including:"
        },
        {
            "heading": 2,
            "text": "Tick surveillance"
        },
        {
            "text": "Our tick surveillance programme provides critical insights into the evolving threat these disease vectors pose to public health across the UK. With over 20 recorded tick species in Britain, the MEZE team conducts extensive sampling at a range of natural habitat (including woodland sites nationwide) to understand local species diversity, distribution patterns, host preferences and population dynamics."
        },
        {
            "text": "Through a technique called 'flagging' - where cloth sheets are dragged through vegetation to collect questing ticks - we gather specimens for laboratory analysis to identify pathogens and assess disease risk. This work is supported by our national tick surveillance scheme, which receives thousands of tick samples from the public, veterinary practices, GP surgeries and wildlife organisations, particularly during the peak season of April to June. The information collected helps map seasonal patterns and geographical distribution, while our Rare and Imported Pathogens Laboratory (RIPL) tracks positive cases of diseases like Lyme disease and tick-borne encephalitis, correlating infections with potential exposure locations."
        },
        {
            "heading": 2,
            "text": "The impact of climate change on vector-borne disease"
        },
        {
            "text": "Climate change is significantly altering the UK's vector-borne disease landscape, creating increasingly favourable conditions for disease-carrying organisms. The recent detection of West Nile virus in British mosquitoes exemplifies this emerging threat. Rising temperatures and changing rainfall patterns are extending the active seasons and geographical range of ticks and mosquitoes, introducing new diseases to the UK like tick-borne encephalitis, which were previously absent in Britain except for cases associated with overseas travel. Without decisive action, these changes could substantially impact public health, increasing disease burden and straining healthcare systems."
        },
        {
            "text": "UKHSA's surveillance systems provide essential early warning, allowing us to track vector populations, detect pathogens, and develop targeted interventions - from habitat management to public education. Our ability to protect current and future generations depends on maintaining robust monitoring networks and implementing adaptive public health strategies that recognise the crucial connection between climate change and human health."
        },
        {
            "heading": 2,
            "text": "How you can protect yourself"
        },
        {
            "text": "When in areas where mosquitoes or ticks may be present:"
        },
        {
            "heading": 2,
            "text": "Working together to reduce risk"
        },
        {
            "text": "Our comprehensive surveillance systems give us early warning of potential threats. By collaborating with local authorities, healthcare professionals and the public, we're strengthening our ability to detect and respond to vector-borne diseases before they become established in the UK."
        },
        {
            "text": "For more information or to report invasive mosquitoes, contact the UKHSA mosquito surveillance scheme with an image or sample. If you have been bitten by a tick you can submit samples to our tick surveillance scheme."
        }
    ]
}