{
    "url": "https://space.blog.gov.uk/2025/05/21/international-bilateral-fund-to-further-boost-global-space-partnerships/",
    "title": "International Bilateral Fund to further boost global space partnerships",
    "authors": [
        "UK Space Agency"
    ],
    "categories": [
        "Funding",
        "International"
    ],
    "pub_date": "2025-05-21T15:06:14+01:00",
    "content": [
        {
            "text": "The UK Space Agency is making £5.5 million of funding available for new proposals under the International Bilateral Fund (IBF) - a programme supporting ambitious partnerships between UK organisations and international space entities. "
        },
        {
            "text": "Since its launch, the IBF has helped build pioneering collaborations across the globe, driving innovation and strengthening the UK’s position as a trusted space partner. "
        },
        {
            "text": "The IBF encourages partnerships that align with the priorities of both the UK and its international counterparts, promoting economic growth through inward investment and exports, while accelerating development of key UK space capabilities. "
        },
        {
            "text": "Professor Anu Ojha, International Director at the UK Space Agency, said: "
        },
        {
            "heading": 2,
            "text": "Driving innovation through collaboration: IBF success stories"
        },
        {
            "text": "Since its launch in 2023, the IBF has supported a variety of groundbreaking projects that demonstrate the strength and diversity of UK space partnerships: "
        },
        {
            "heading": 2,
            "text": "Details of the new call"
        },
        {
            "text": "The International Bilateral Fund seeks proposals that: "
        },
        {
            "text": "Key points: "
        },
        {
            "text": "The UK Space Agency looks forward to receiving innovative proposals that will continue to strengthen the UK’s international space partnerships and drive forward our ambitions in this dynamic sector. "
        },
        {
            "text": "Click here for full application guidance. "
        }
    ]
}