{
    "url": "https://educationhub.blog.gov.uk/2025/05/national-numeracy-day-2025-top-tips-for-helping-children-feel-more-confident-with-maths/",
    "title": "National Numeracy Day 2025: Top tips for helping children feel more confident with maths",
    "authors": [
        "mediaofficer"
    ],
    "categories": [
        "numeracy",
        "Primary Schools",
        "Schools",
        "Secondary schools"
    ],
    "pub_date": "2025-05-21T15:10:20+01:00",
    "content": [
        {
            "text": "This post was guest written by National Numeracy "
        },
        {
            "text": "This Wednesday 21 May marks National Numeracy Day and we're sharing practical advice to boost number confidence. Maths and numeracy are essential life and work skills, and the government are committed to ensuring they remain a core part of every young person's learning."
        },
        {
            "text": "Whether you're a parent supporting homework or a teacher inspiring future mathematicians, our tips help transform number anxiety into confidence."
        },
        {
            "text": "Around half of working-age adults have primary school-level numeracy skills, with many struggling with basic budgeting multiplication, which can lead adults to feel negatively towards the subject."
        },
        {
            "text": "This can change - most people can improve their numeracy and overcome maths anxiety. To become a more numerate nation, change must start with children from the youngest age. Parents and carers have the most significant influence on children's feelings about maths, despite often lacking confidence themselves."
        },
        {
            "heading": 3,
            "text": "How can parents, carers and teachers, help children to feel more confident with numbers?"
        },
        {
            "text": "The approach that National Numeracy, the independent charity behind National Numeracy Day, takes focuses on building confidence first and foremost. "
        },
        {
            "text": "Secondly, we work with adults and children together – building confidence with both the supporter and child. It’s a winning combination."
        },
        {
            "text": "Families and teachers can make a huge difference children’s maths learning and help them build their confidence with numbers."
        },
        {
            "heading": 3,
            "text": "Here are our top three tips for helping children feel confident with maths:"
        },
        {
            "text": "It is vital that adults that support children do not think they have to be maths experts themselves. There is no ‘maths gene’ – our abilities come from nurture not nature. So, one of the best ways to help support the children in your care is to improve your own number confidence."
        },
        {
            "heading": 3,
            "text": "Here are our five top tips to for parents and teachers supporting children:"
        },
        {
            "text": "This National Numeracy Day, take a look at the charity’s website for free activities and resources for both adults and children.How you talk about maths shapes your child's confidence with numbers."
        },
        {
            "text": "Avoid saying you were \"never good at maths\" as this can make children think maths ability is fixed. Instead, share that while you may have found maths hard at school, you've learned useful number skills for everyday life. Let them know that working together on problems helps everyone improve."
        },
        {
            "text": "This simple change helps children see that getting better at maths is possible for everyone with practice and support."
        }
    ]
}