{
    "url": "https://ruralpayments.blog.gov.uk/2025/05/21/research-and-development-for-integrated-pest-management-and-how-it-can-help-you/",
    "title": "Research and Development for Integrated Pest Management and how it can help you   ",
    "authors": [
        "RPA Editor"
    ],
    "categories": [
        "Grants"
    ],
    "pub_date": "2025-05-21T15:45:13+01:00",
    "content": [
        {
            "text": "Integrated Pest Management (IPM) is a whole-farm approach that uses all available methods to prevent, monitor, and control pests, weeds and diseases."
        },
        {
            "text": "Adopting IPM practices can help you reduce the risks associated with pesticides, combat pesticide resistance, and support sustainable agricultural productivity."
        },
        {
            "text": "Research and development for IPM is unearthing new findings that can help you use the most effective methods to tackle pests, weeds and diseases."
        },
        {
            "text": "From farmer-led innovative projects, improved decision-making tools to insights into predatory beetles – this post outlines some of the exciting work that’s going on around IPM and how you can get involved."
        },
        {
            "text": "Innovation on Farm"
        },
        {
            "text": "Upcoming grants"
        },
        {
            "text": "We are supporting the development of new effective IPM research targeted at some of the most challenging areas of crop protection."
        },
        {
            "text": "You can now apply for Farming Innovation Programme (FIP) grants which can fund research to deliver practical benefits of precision breeding technology, such as disease resistant crop varieties."
        },
        {
            "text": "FIP has supported innovative projects, such as trialling slug-resistant wheat varieties and polyculture arable crop growing techniques to reduce the need for pesticides. You can find out more about these projects on the FIP case studies page."
        },
        {
            "text": "Through the Farming Equipment and Technology Fund, you can apply for grants of up to £25,000 to buy new equipment such as tractor powered electric weeders to help reduce pesticide use."
        },
        {
            "text": "The Accelerating Development of Practices and Technologies Fund is now open and provides collaborative farmer-led grants, which can help you trial new technology and IPM methods on your farm."
        },
        {
            "text": "Rothamsted IPM Research project"
        },
        {
            "text": "Dr Sam Cook and Charlotte Robb work at Rothamsted Research on regenerative agriculture and IPM. Their areas of interest include encouraging natural pest predators, intercropping and using trap crops, to help farmers reduce the pest incidents and protect their oilseed rape and mustard seeds."
        },
        {
            "text": "By working collaboratively with farmers, they are building a picture of the techniques being used to tackle pests and producing data on pest numbers – to understand what works and what doesn’t."
        },
        {
            "text": "In this video, they talk about their research and their aims to support farmers to adopt IPM practices. "
        },
        {
            "text": "Cabbage Stem Flea Beetle projects"
        },
        {
            "text": "A greater understanding of the Cabbage Stem Flea Beetle (CSFB) lifecycle can help develop new monitoring tools to help protect oilseed rape crop and support the development of new strategies to target the beetle."
        },
        {
            "text": "The csfbSMART project – Sharing Management and Agronomy Research Tools – connected two research projects investigating CSFB control."
        },
        {
            "text": "Together, these projects worked to develop tools to aid farmers’ decision-making so they could effectively monitor and interpret CSFB data. When applied, these tools helped farmers to select the most appropriate management approaches for the oilseed rape crop and the surrounding landscape."
        },
        {
            "text": "Key findings from this research have shown that the timing of CSFB emerging from the crop is later than previously thought and that longer lasting companion crops have the potential to reduce the number of CSFB larvae whilst increasing biodiversity."
        },
        {
            "text": "This means there is potential to reduce the adult population of CSFB in winter oilseed rape by using targeted post-harvest cultivations as part of an IPM strategy. These approaches are now being used by some farmers as part of an IPM approach."
        },
        {
            "text": "Next steps: pesticide resistance"
        },
        {
            "text": "The overuse of chemical pesticides can lead to resistant pests, weeds and diseases. Pesticide resistance is when a pesticide shows reduced control of target pests, weeds and diseases compared to the formerly effective application rate."
        },
        {
            "text": "IPM can help reduce the risk of pesticide resistance by targeting pesticide use to when and where it is needed and using alternative non-chemical approaches."
        },
        {
            "text": "We are collating the latest research on pesticide resistance to identify crops and pests most at risk. This project will assess existing databases on pesticide resistance and help to build a greater understanding of resistance challenges in England and potential routes to manage and reduce these."
        },
        {
            "text": "This will be available on our science search site found here."
        },
        {
            "text": "Learn more"
        },
        {
            "text": "To support the adoption of different IPM approaches, we’ve published an Integrated Pest Management (IPM) guidance page on GOV.UK."
        },
        {
            "text": "It provides practical information to help you increase your use of IPM and includes:  "
        },
        {
            "text": "Listen"
        },
        {
            "text": "The most recent episode of the Defra Farming Podcast features arable farmer and leader of the British On Farm Innovation Network (BOFIN), Tom Allen-Stevens, speaking with farmer Martin Lines and agronomist Ed Schofield about their experience of implementing integrated pest management (IPM)."
        },
        {
            "text": "Join the ADAS Integrated Pest Management Network (IPM NET) "
        },
        {
            "text": "IPM NET is a free knowledge-sharing network that seeks to improve understanding of IPM and promote effective IPM strategies."
        },
        {
            "text": "Being part of IPM NET can help you review your IPM strategy and identify opportunities to reduce costs and improve the efficiency, sustainability, and profitability of your farm."
        },
        {
            "text": "You can find out more and register here: IPM NET | The Yield Enhancement Network"
        },
        {
            "text": "As a member, you will receive:"
        },
        {
            "text": "•           updates on IPM resources, news, and opportunities"
        },
        {
            "text": "•           invites to relevant IPM events"
        },
        {
            "text": "•           opportunities to discuss and feedback on different IPM approaches"
        }
    ]
}