{
    "url": "https://educationhub.blog.gov.uk/2025/05/supporting-students-in-crisis-how-were-supporting-students-with-their-mental-health-and-suicide-prevention/",
    "title": "Supporting students in crisis: how we’re supporting students with their mental health and suicide prevention  ",
    "authors": [
        "mediaofficer"
    ],
    "categories": [
        "Mental Health",
        "Universities"
    ],
    "pub_date": "2025-05-21T09:32:49+01:00",
    "content": [
        {
            "text": "Warning: some people may find the content of this article upsetting"
        },
        {
            "text": "We have just published the largest-ever national review into student suicides in higher education, examining over 160 cases of suspected suicide or self-harm during the 2023/24 academic year. The review was conducted by the National Confidential Inquiry into Suicide and Safety in Mental Health (NCISH) and aimed to understand how universities currently respond to students in urgent need of help and how to help identify areas for improvement."
        },
        {
            "heading": 3,
            "text": "What were the main findings of the review? "
        },
        {
            "text": "Looking at the broader picture, the review found that undergraduates made up the majority of cases, with first-year students and international students being particularly vulnerable. These findings point to key transition periods as times of heightened risk, when students may struggle with adapting to university life, being away from home, or navigating a new country and culture."
        },
        {
            "text": "Universities now need to focus their support on these specific groups and improve how they identify students who might need help. The review revealed several gaps in university practices. In three-quarters of cases, bereaved families were not included in serious incident reviews following a death. Many students who died by suicide were already known to universities and had experienced stresses like academic pressure, social isolation, or mental health struggles.  "
        },
        {
            "heading": 3,
            "text": "What actions will universities need to take? "
        },
        {
            "text": "Following this report, we are calling on universities to do more to help protect students. They will now be expected to: "
        },
        {
            "text": "The government is also taking several steps to drive change: "
        },
        {
            "heading": 3,
            "text": "How have universities responded to these challenges so far? "
        },
        {
            "text": "Universities have shown real commitment to improving student mental health support. Currently, 113 universities have joined the University Mental Health Charter Programme, and there has been increased investment in support services across the sector. But we also want the sector to do more to offer support and protection where it’s needed.  "
        },
        {
            "heading": 3,
            "text": "Will families be more involved in the future? "
        },
        {
            "text": "The government and taskforce will work to encourage universities to include bereaved families in future reviews following a student's death. Input from families will be sought as much as possible, and universities will now be held to account if they fail to include families appropriately. "
        },
        {
            "heading": 3,
            "text": "How can I access the full report? "
        },
        {
            "text": "The full National Review into Higher Education Student Suicides is now available, providing detailed insights into the findings and recommendations for improving student support and preventing future tragedies. "
        }
    ]
}