{
    "url": "https://naturalengland.blog.gov.uk/2025/05/21/wildlife-licensing-enabling-development-while-protecting-nature-annual-summary-2024/",
    "title": "Wildlife licensing: enabling development while protecting Nature - annual summary 2024  ",
    "authors": [
        "Natural England"
    ],
    "categories": [
        "Biodiversity",
        "Development",
        "Evidence",
        "Licensing",
        "Natural England",
        "Nature",
        "Nature Recovery",
        "Protected sites and species",
        "Species recovery",
        "Wildlife"
    ],
    "pub_date": "2025-05-21T10:00:00+01:00",
    "content": [
        {
            "text": "By Gemma Ole's, Deputy Director, Natural England Wildlife Licensing Service "
        },
        {
            "text": "At Natural England we help balance economic growth with nature protection. Wildlife licensing is a vital tool to enable this. Our licences are broad ranging and allow development and other activities to proceed, while safeguarding protected species and their habitats.  "
        },
        {
            "text": "Wildlife licensing presents many challenges in balancing the needs of people, protected species and the landscape we share. We are committed to reforming our processes to better support our customers with timely decisions – whilst also minimising impacts on and seeking positive outcomes for nature.   "
        },
        {
            "text": "What we do  "
        },
        {
            "text": "Wildlife licences support a wide range of activities across the UK - from research projects and species reintroductions to housing developments, infrastructure projects and renewable energy installations.  "
        },
        {
            "text": "Improving our service  "
        },
        {
            "text": "To meet growing demands for sustainable development, home building and nature recovery, we've streamlined our processes and reduced regulatory burden. Overall on-time delivery improved from 84.9% in 2023 to 91.1% in 2024.   "
        },
        {
            "text": "Innovation in action  "
        },
        {
            "text": "Our Bat Earned Recognition scheme accredits ecologists before they submit licence applications. This gives them:  "
        },
        {
            "text": "Since launching, this scheme has saved an estimated 10,000 working days, worth around £1.5 million to our stakeholders.  "
        },
        {
            "text": "Early advice service  "
        },
        {
            "text": "In 2024, we funded additional teams to provide early advice at the pre-application stage, helping developers build nature-friendly solutions from the start. These teams have supported:  "
        },
        {
            "text": "Paving the way for species reintroductions  "
        },
        {
            "text": "Alongside these improvements, this year we issued our first licence for the wild release of beavers, to the National Trust's Purbeck Beaver Project in Dorset. The beavers are expected to increase biodiversity, restore wetland habitats and improve protected sites across the Purbeck Heaths National Nature Reserve.  "
        },
        {
            "text": "The project was assessed against specific beaver wild release criteria to help ensure all the impacts, positive and negative, are considered as part of the assessment approach. The licensing approach aims to achieve a measured pace of reintroduction across the country.   "
        },
        {
            "text": "Background and further details on Natural England’s wildlife licensing statistics 2024  "
        },
        {
            "text": "Many wild animals and plants are protected by legislation such as the Wildlife and Countryside Act 1981 and the Conservation of Habitats and Species Regulations 2017. As the Government’s nature conservation adviser and regulator, one of Natural England’s roles is to licence certain activities that may disturb or harm wildlife, in line with the legal framework established by Parliament.  "
        },
        {
            "text": "Each year, as part of our commitment to transparency, we publish a summary of the wildlife licences we have issued and the data for 2024 are now available here.  "
        },
        {
            "text": "In our 2024 summary, the licences fall into four main categories:  "
        },
        {
            "text": "Further information  "
        },
        {
            "text": "The full wildlife licencing statistics are available on GOV.UK.  "
        },
        {
            "text": "For more information, please contact: enquiries@naturalengland.org.uk  "
        }
    ]
}