{
    "url": "https://insidehmcts.blog.gov.uk/2025/08/06/bringing-order-to-complexity-my-journey-as-a-service-designer/",
    "title": "Bringing Order to Complexity: My Journey as a Service Designer",
    "authors": [
        "Juliette Poggi, Service Designer at HMCTS"
    ],
    "categories": [
        "Digital services",
        "Tribunals",
        "Working at HMCTS"
    ],
    "pub_date": "2025-08-06T12:05:58+01:00",
    "content": [
        {
            "text": "[English] - [Cymraeg]"
        },
        {
            "text": "When you think about visiting a court or accessing a related service, you might picture imposing buildings, formal procedures and complex legal processes, but behind the scenes at HM Courts & Tribunals Service (HMCTS), a dedicated team of service designers is working to transform the experiences of the public, making services more accessible and user-friendly for everyone involved."
        },
        {
            "heading": 2,
            "text": "What is user-centred design?"
        },
        {
            "text": "User-centred design is about creating services that work for the people who need to use them. It involves understanding a user's needs, challenges, and goals, then designing solutions that help achieve these aims efficiently and effectively."
        },
        {
            "text": "We speak to users to understand their needs; prototype designs to test how quickly we can meet those needs; make sure users understand what they need to do going forward and monitor how users are using our services."
        },
        {
            "text": "In HMCTS, service designers work on the end-to-end journey of each service – from the moment someone needs to use a court or tribunal service, through to the completion of their case. This holistic approach ensures that both digital and offline channels work seamlessly together, and that the service fulfils both the user's needs and government policy intentions."
        },
        {
            "text": "We work alongside user researchers and other colleagues within teams to provide tools, skills and expertise to work through tricky problems and create products that work. The earlier we’re involved, the more value we can add. We do our best work when people are able to identify the root cause of problems in their service and we can help develop initial ideas for how to solve those problems."
        },
        {
            "heading": 2,
            "text": "Visualising the invisible – using service maps"
        },
        {
            "text": "I'm a visual thinker by nature. I usually map the entire online journey, screen by screen, end-to-end. This allows my User Centred Design (UCD) colleagues and me to gain a comprehensive view of the journey and identify exactly where issues or errors may arise in applications."
        },
        {
            "text": "A service map lets us visualise the whole service journey. It could be a high level map that sets out the storyline of the basic steps that define the journey or a screen-by-screen visualisation of each screen component, that can be further analysed by interaction designers."
        },
        {
            "text": "The map shows the different routes a user can take in a journey and the various decisions that help a service progress."
        },
        {
            "heading": 2,
            "text": "Bringing order to complexity – The Source of Truth"
        },
        {
            "text": "Two years ago, I joined the probate team with a specific mission: to help fix issues in the live user journeys that were causing delays and generating unnecessary contacts from users."
        },
        {
            "text": "Probate is a complex service, often with a complex journey that is difficult to navigate for people going through a difficult time, with different rules applying depending on circumstances. When I shared our map with the service team, they immediately dubbed it the ‘Source of Truth’ – a name that stuck."
        },
        {
            "text": "What's been most rewarding is seeing how the Source of Truth has become indispensable for everyone in the service."
        },
        {
            "text": "We're now planning to expand the system so operations staff can access the Source of Truth when responding to queries from the public, this will mean that they can immediately understand what the users are seeing online."
        },
        {
            "heading": 2,
            "text": "Translating insights into practical actions"
        },
        {
            "text": "By creating visual representations of complex journeys, we can translate insights into practical actions – whether that's clearer questions, better instructions, or streamlined processes. The result? Reduced error rates, fewer support queries, improved completion rates, and a better experience for users during what is often a difficult time in their lives."
        },
        {
            "text": "As service designers at HMCTS, we consider the needs of all users – not just the public, but also court staff, legal professionals, and other stakeholders within the justice system. This holistic approach ensures we're creating services that work for everyone while supporting the fundamental purpose of our justice system."
        },
        {
            "text": "When services are designed with users at their heart, everyone benefits – from applicants to staff, and ultimately the wider society that depends on an effective justice system."
        },
        {
            "text": "[English] - [Cymraeg]"
        },
        {
            "heading": 1,
            "text": "Rhoi Trefn ar Gymhlethdod: Fy Nhaith fel Dylunydd Gwasanaeth "
        },
        {
            "text": "Pan fyddwch yn meddwl am ymweld â llys neu gysylltu â gwasanaeth cysylltiol, efallai y byddwch yn gweld adeiladau anferth, gweithdrefnau ffurfiol a phrosesau cyfreithiol cymhleth, ond y tu ôl i’r llenni yn y Gwasanaeth Llysoedd a Thribiwnlysoedd EF (GLlTEF), mae tîm ymroddedig o ddylunwyr gwasanaeth yn gweithio i drawsnewid profiad y cyhoedd, gan wneud gwasanaethau yn fwy hygyrch ac yn hawdd eu defnyddio i bawb sy’n gysylltiedig."
        },
        {
            "heading": 2,
            "text": "Beth yw dylunio sy’n canolbwyntio ar y defnyddiwr? "
        },
        {
            "text": "Mae dylunio sy’n canolbwyntio ar y defnyddiwr yn ymwneud â chreu gwasanaethau sy’n gweithio i’r bobl sydd angen eu defnyddio. Mae’n ymwneud â deall anghenion, heriau ac amcanion defnyddiwr, yna creu datrysiadau sy’n helpu i gyflawni’r amcanion hyn yn effeithiol ac effeithlon. "
        },
        {
            "text": "Rydym yn siarad gyda defnyddwyr i ddeall eu hanghenion; prototeipio dyluniadau i brofi pa mor sydyn y gallwn gwrdd â’r anghenion hynny; sicrhau bod defnyddwyr yn deall beth maent angen ei wneud wrth symud ymlaen a monitro sut mae defnyddwyr yn defnyddio ein gwasanaethau."
        },
        {
            "text": "Yn GLlTEF, mae dylunwyr gwasanaeth yn gweithio ar y daith o’r dechrau i’r diwedd o bob gwasanaeth - o’r foment mae rhywun angen defnyddio gwasanaeth llys neu dribiwnlys, i gwblhau eu hachos.   Mae’r dull cyfannol hwn yn sicrhau bod sianeli digidol ac all-lein yn gweithio’n llyfn gyda’i gilydd a bod y gwasanaeth yn cyflawni anghenion y defnyddiwr a bwriadau polisi’r llywodraeth."
        },
        {
            "text": "Rydym yn gweithio ochr yn ochr gydag ymchwilwyr defnyddwyr a chydweithwyr eraill o fewn timau i ddarparu adnoddau, sgiliau ac arbenigedd i weithio drwy broblemau anodd a chreu cynnyrch sy’n gweithio. Po gynharaf yr ydym yn cymryd rhan, po fwyaf o werth y gallwn ei ychwanegu. Rydym yn gwneud ein gwaith orau pan fydd pobl yn gallu nodi gwraidd unrhyw broblemau yn eu gwasanaeth a gallwn helpu i ddatblygu syniadau cychwynnol ar gyfer datrys y problemau hynny. "
        },
        {
            "heading": 2,
            "text": "Dychmygu’r anweladwy - defnyddio mapiau gwasanaeth"
        },
        {
            "text": "Rwy’n feddyliwr gweledol yn naturiol. Rwyf fel arfer yn mapio’r daith ar-lein gyfan, sgrin fesul sgrin, o’r dechrau i’r diwedd. Mae hyn yn caniatáu i fy nghydweithwyr Dylunio sy’n Canolbwyntio ar y Defnyddiwr a minnau i gael golwg gynhwysfawr ar y daith a nodi’n union ble gall y problemau neu’r gwallau godi mewn ceisiadau."
        },
        {
            "text": "Mae map gwasanaeth yn caniatáu i ni ddychmygu’r daith drwy’r gwasanaeth cyfan. Gall fod yn fap lefel uchel sy’n nodi rhediad stori’r camau sylfaenol sy’n diffinio’r daith neu ddychymyg sgrin fesul sgrin o bob elfen sgrin, y gellir eu dadansoddi ymhellach gan ddylunwyr rhyngweithio."
        },
        {
            "text": "Mae’r map yn dangos y llwybrau gwahanol y gall defnyddiwr eu cymryd mewn siwrnai a’r amrywiol benderfyniadau sy’n helpu gwasanaeth i ddatblygu."
        },
        {
            "heading": 2,
            "text": "Rhoi Trefn ar Gymhlethdod - Ffynhonnell y Gwirionedd"
        },
        {
            "text": "Dwy flynedd yn ôl, ymunais â’r tîm profiant gyda bwriad penodol: i helpu i ddatrys problemau yn nheithiau amser real y defnyddiwr oedd yn achosi oedi ac yn creu cysylltiadau diangen gan ddefnyddwyr."
        },
        {
            "text": "Mae profiant yn wasanaeth cymhleth, yn aml gyda thaith gymhleth sy’n anodd i’w llywio i bobl sy’n mynd drwy amser anodd, gyda rheolau gwahanol yn briodol yn dibynnu ar amgylchiadau.  Pan wnes i rannu ein map gyda’r tîm gwasanaeth, gwnaethant ei nodi’n ‘Ffynhonnell Gwirionedd’ ar unwaith - enw wnaeth aros."
        },
        {
            "text": "Yr hyn sydd wedi rhoi’r boddhad mwyaf yw gweld sut mae’r Ffynhonnell Gwirionedd wedi dod yn anghenraid i bawb yn y gwasanaeth."
        },
        {
            "text": "Rydym nawr yn bwriadu ehangu’r system fel y gall staff gweithredol gael mynediad i’r Ffynhonnell Gwirionedd wrth ymateb i ymholiadau gan y cyhoedd, bydd hyn yn golygu y gallent ddeall ar unwaith beth mae’r defnyddwyr yn ei weld ar-lein. "
        },
        {
            "heading": 2,
            "text": "Trosi mewnwelediadau yn gamau ymarferol"
        },
        {
            "text": "Drwy greu cynrychiolaeth weledol o deithiau cymhleth, gallwn drosi mewnwelediadau i gamau ymarferol – boed hynny’n gwestiynau cliriach, cyfarwyddiadau gwell neu brosesau symlach.  Y canlyniad?  Llai o gyfraddau gwallau, llai o ymholiadau cymorth, cyfraddau cwblhau gwell a phrofiad gwell i ddefnyddwyr yn ystod yr hyn sy’n aml yn amser anodd yn eu bywydau."
        },
        {
            "text": "Fel dylunwyr gwasanaeth yn GLlTEF, rydym yn ystyried anghenion holl ddefnyddwyr - nid y cyhoedd yn unig, ond staff y llys hefyd, gweithwyr proffesiynol cyfreithiol a rhanddeiliaid eraill o fewn y system gyfiawnder.   Mae’r dull cyfannol hwn yn sicrhau ein bod yn creu gwasanaethau sy’n gweithio i bawb tra’n cefnogi diben sylfaenol ein system gyfiawnder. "
        },
        {
            "text": "Pan fydd gwasanaethau’n cael eu dylunio gyda defnyddwyr yn ganolbwynt, mae pawb yn cael budd - o geiswyr i staff, ac yn y pen draw y gymdeithas ehangach sy’n dibynnu ar system gyfiawnder effeithiol."
        }
    ]
}