{
    "url": "https://defrafarming.blog.gov.uk/2025/08/06/cattle-farmers-join-our-webinar-on-funding-for-vet-visits/",
    "title": "Cattle farmers: join our webinar on funding for vet visits",
    "authors": [
        "Madeline Hedge"
    ],
    "categories": [
        "Payments to improve animal health and welfare",
        "Webinars"
    ],
    "pub_date": "2025-08-06T16:51:06+01:00",
    "content": [
        {
            "text": "On Tuesday 19 August, we will host a webinar specifically for cattle farmers to explain how they can access funding for an Animal Health and Welfare Review and the follow-up vet visit for endemic diseases. "
        },
        {
            "text": "This session, for both dairy and beef farmers, follows the webinars we held last month for sheep and pig farmers. "
        },
        {
            "text": "Before attending the webinar, we encourage you to take a look at the guidance on GOV.UK (linked above) and a recent post by my colleague Chris which gives a good overview of the steps to apply and the funding available. "
        },
        {
            "heading": 2,
            "text": "Join our webinar"
        },
        {
            "text": "The 1-hour session will take place on Tuesday 19 August at 11am. "
        },
        {
            "text": "In the webinar, you’ll hear: "
        },
        {
            "text": "Register to attend "
        },
        {
            "text": "We hope to see you there. If you can’t make it, don’t worry, we’ll share the webinar recording in this post and on the webinars page after the session ends. "
        },
        {
            "text": "Subscribe to the Farming blog for updates from Defra’s Farming and Countryside Programme. "
        },
        {
            "text": "By subscribing, you’ll be notified whenever we publish a new post on this site – from funding opportunities and scheme updates to events."
        }
    ]
}