{
    "url": "https://defrafarming.blog.gov.uk/2025/08/06/fairer-supply-chains-supporting-the-pig-sector/",
    "title": "Fairer supply chains: supporting the pig sector",
    "authors": [
        "Richard Thompson"
    ],
    "categories": [
        "Guest post",
        "Supply chain"
    ],
    "pub_date": "2025-08-06T09:59:21+01:00",
    "content": [
        {
            "text": "Last June, I was appointed as the Agricultural Supply Chain Adjudicator (ASCA) to enforce the Fair Dealings Powers on behalf of the Defra Secretary of State.   "
        },
        {
            "text": "I am now pleased to announce that from 13 August, The Fair Dealing Obligations (Pigs) Regulations 2025 (FDOP2025) will come into force. This is part of the government’s drive to improve and create greater fairness in the agricultural supply chain, to ensure fairer contractual practices for pig farmers and producers. "
        },
        {
            "text": "In this, my third Farming blog post, I’ll share a summary of the new regulations and how we’re working with the sector to prepare. "
        },
        {
            "heading": 2,
            "text": "Improving contracts and certainty"
        },
        {
            "text": "I recognise the vital role of the pig sector in British food production and these regulations are the next step in the government’s commitment to deliver a fairer deal for farmers.  "
        },
        {
            "text": "They are the result of extensive consultation with pig farmers, producer groups and wider industry. "
        },
        {
            "text": "They largely mirror the rules in the milk sector which aim to ensure that contracts between dairy farmers and processors are fair and transparent. "
        },
        {
            "text": "FDOP2025 will give pig farmers and producers greater certainty over the terms of their contracts.  "
        },
        {
            "text": "These new rules will help ensure things are fairer, consistent and more transparent by: "
        },
        {
            "heading": 2,
            "text": "New regulations"
        },
        {
            "text": "FDOP2025 applies to pig purchase contracts between “purchasers” (such as pig processors and abattoirs) and “qualifying sellers” (producers, including pig farmers and those who buy pigs without processing them) although some exemptions may apply.   "
        },
        {
            "text": "These new rules make sure both parties know their rights and responsibilities under the pig purchase contract.  "
        },
        {
            "text": "In summary, from 13 August 2025, new contracts must be in writing, signed, and include clear terms about pricing, how long the contract lasts, how it can be ended, and how disputes will be settled.  "
        },
        {
            "text": "If you’re a pig processor or other purchaser, any new pig purchase contracts you make after 13 August 2025 must comply with the rules. "
        },
        {
            "text": "By 13 August 2026, all contracts — new and existing — must meet these standards.  "
        },
        {
            "text": "Similar to the dairy sector, there is a 12-month transition period to allow the sector to meet the requirements of the regulations. "
        },
        {
            "heading": 2,
            "text": "Working with the sector"
        },
        {
            "text": "I’m keen to engage with stakeholders across all aspects of the supply chain, to better understand experiences and perspectives on what is or isn’t working well.   "
        },
        {
            "text": "We’ll be reaching out to set up introductory meetings with stakeholders and also attending key agricultural shows and events to ensure we can hear from as many different parts of the industry as we can.   "
        },
        {
            "text": "In May, I attended the Pigs Tomorrow conference, which helped me learn more about the sector and meet with experts and representatives of various organisations.   "
        },
        {
            "text": "I look forward to meeting many more of you in the coming months. If you would like to meet with us or signpost things that could help build our visibility and understanding of the pig supply chain, please email the ASCA mailbox: asca@defra.gov.uk "
        },
        {
            "heading": 2,
            "text": "ASCA’s role  "
        },
        {
            "text": "A primary part of my role as the Agricultural Supply Chain Adjudicator (ASCA) is to ensure purchasers understand and comply with FDOP2025and that farmers and producers know how to raise a complaint with my office.  "
        },
        {
            "text": "We’ve published full guidance on the regulations, my enforcement role, and how to make a complaint and we would recommend that alongside this guidance, businesses should always seek their own independent legal advice concerning compliance with FDOP2025 and possible contractual disputes."
        },
        {
            "text": "Full details can be found in the guidance linked above, but in short, a pig farmer or producer will be able to make a complaint if:  "
        },
        {
            "text": "It is worth noting that before making a complaint, the producer must have followed their contract's dispute resolution procedure before making a complaint.   "
        },
        {
            "text": "If I find there has been a breach, I can impose a fine of up to 1% of the purchaser’s turnover and/or make them compensate the producer.  "
        },
        {
            "text": "I know that building trust, confidence and understanding takes time – so I will explore different ways to make myself accessible and available to help. I also recognise from my current engagement with the dairy sector that the prospect of raising a formal complaint can be a daunting one.   "
        },
        {
            "text": "That is why we have also created a new mailbox through which anyone can raise a concern with ASCA in confidence. While I may not be able to pursue a formal investigation without a formal complaint, hearing about the issues faced by producers is critical to enable me to help shape how my office will work with the sector in the future.   "
        },
        {
            "text": "To raise a concern confidentially, email: asca-in-confidence@defra.gov.uk  "
        },
        {
            "text": "If you have any questions after reading this post or the guidance available on GOV.UK, please do leave a comment below.  "
        }
    ]
}