{
    "url": "https://ruralpayments.blog.gov.uk/2025/08/06/getting-the-most-from-herbal-leys-within-improved-grassland-systems/",
    "title": "Getting the most from herbal leys within improved grassland systems",
    "authors": [
        "RPA Editor"
    ],
    "categories": [
        "Sustainable Farming Incentive"
    ],
    "pub_date": "2025-08-06T14:34:36+01:00",
    "content": [
        {
            "text": "Herbal leys can offer real rewards for your livestock, soil and your bottom line while benefitting the environment, but success depends on careful planning, establishment and management."
        },
        {
            "text": "When herbal leys are used well, they can enhance your farm's sustainability."
        },
        {
            "text": "In this post, we'll look at their benefits and provide practical hints and tips to help you set them up for success."
        },
        {
            "heading": 2,
            "text": "Herbal leys: an introduction"
        },
        {
            "text": "Under the Sustainable Farming Incentive (SFI), herbal leys (actions SAM3/CSAM3) are diverse and productive mixtures of grasses, legumes (for example, clover), and herbs (for example, plantain or chicory)."
        },
        {
            "text": "They’re designed to support sustainable, productive systems by:"
        },
        {
            "text": "Herbal leys typically last around 4 years before they need to be re-established to maintain the mix of species and manage the weed burden. They’re best treated as short-term leys and work well as part of a mixed farming rotation."
        },
        {
            "text": "Herbal Leys are intended for improved grassland or arable land. It’s important to note that herbal leys aren’t suitable for low input or species-rich grasslands."
        },
        {
            "text": "In the Sustainable Farming Incentive, SAM3 / CSAM3 actions are only eligible on arable, temporary grassland or improved permanent grassland. They are not eligible on:"
        },
        {
            "heading": 2,
            "text": "Benefits and challenges"
        },
        {
            "text": "Herbal leys can bring a range of benefits to your farm. By including nitrogen-fixing legumes, they can reduce the need for nitrogen fertiliser, helping to reduce input costs. The diverse mix of grasses, legumes, and herbs provides nutritious forage that supports livestock health and performance."
        },
        {
            "text": "Over time, herbal leys can also improve soil structure and increase organic matter, contributing to better soil health. The flowering species within herbal leys help to attract pollinators and support wider biodiversity, making them a valuable addition to sustainable farming practices."
        },
        {
            "text": "Herbal leys can offer many benefits, but they also come with some challenges. They can be difficult to establish and manage, particularly in the early stages."
        },
        {
            "text": "Once established, weed control options are limited, as most herbicides cannot be used without harming the diverse mix of plants and biodiversity. Herbal leys perform best on fertile soils, so they need careful planning and preparation to ensure they thrive and achieve the intended benefits."
        },
        {
            "text": "Before getting started, it’s a good idea to be clear about your goals. Are you aiming to reduce inputs? Improve drought resilience? Build soil health? Understanding your aims will help you decide whether it’s the right investment for your farm."
        },
        {
            "heading": 2,
            "text": "Where to start"
        },
        {
            "heading": 3,
            "text": "Soil and field checks"
        },
        {
            "text": "Assess the field well in advance of sowing and allow time to address the following points:"
        },
        {
            "heading": 3,
            "text": "Weed control"
        },
        {
            "text": "Herbicide options are very limited once the ley is sown, so sow into clean ground. Even a field which appears weed-free can be harbouring a problem in the seed bank. Look out for species such as:"
        },
        {
            "text": "If your land has recently been part of an arable rotation, it’s likely to be a safer bet for growing herbal leys than longer term improved grassland, as the grassland weed seed bank is likely to have been depleted over time. If you suspect there may be a weed risk, either select a different field or consider strategies for weed control such as the use of stale seedbeds or break crops as outlined below. This increases in importance with extent of soil exposure. For example, ploughing may present more of a weed risk than direct drilling."
        },
        {
            "heading": 3,
            "text": "Choosing the right seed mix"
        },
        {
            "text": "Your seed merchant can advise based on your farm's soil and management - a diverse mix brings more resilience, and it’s worth looking into what could work on your soil. Common species include:"
        },
        {
            "text": "Typical seed rates: 12 to 16 kg per acre (30-40 kg per hectare). Many farmers prefer the higher end to help outcompete the weeds and compensate for any establishment challenges."
        },
        {
            "heading": 3,
            "text": "When to sow"
        },
        {
            "text": "Herbal leys need consistently warm (at least 8 to 10°C) and moist soils to germinate and establish. This generally means from late April to the end of August. However, where moisture allows, June to July is often best as this allows for rapid establishment before the autumn to outcompete weeds and allow grazing before winter. This must be balanced against impacts on forage supply, and it is worth considering strategies to maintain stocks such as the undersowing of wholecrop cereals or use of short-term westerwold leys prior to the herbal ley."
        },
        {
            "text": "Avoid sowing just before a dry spell. Instead, look for a reliable period of rain to ensure seeds germinate and grow well."
        },
        {
            "heading": 2,
            "text": "Establishment methods"
        },
        {
            "text": "Overly deep or excessive cultivation can cause problems like:"
        },
        {
            "text": "Aim for the minimum disturbance required for good seed-soil contact, unless deeper or more intensive cultivation is required to address compaction or as part of a planned weed and pest control programme. If possible, it’s best to follow an arable crop. You could use direct drilling, minimum tillage or ploughing. Here are some points to consider for each of these methods:"
        },
        {
            "text": "1. Direct drilling (after grass)"
        },
        {
            "text": "2. Minimum-tillage (after grass)"
        },
        {
            "text": "3. Ploughing (after grass)"
        },
        {
            "heading": 2,
            "text": "Break crops"
        },
        {
            "text": "Break crops (in this sense a short-term break between the existing grass and a new herbal ley) are a useful tool to reduce weed pressure, break pest cycles, deal with surface thatch and improve conditions for sowing. They can also help maintain forage supply during the re-seeding process. Consider using brassicas, cereals or short-term grass leys. Here are some points to consider for each of these break crops:"
        },
        {
            "text": "Brassicas"
        },
        {
            "text": "Cereals"
        },
        {
            "text": "Short-term grass leys"
        },
        {
            "heading": 2,
            "text": "Early management"
        },
        {
            "text": "Where possible, grazing a new herbal ley in the early stages will help it to establish. You could:"
        },
        {
            "heading": 2,
            "text": "What success looks like"
        },
        {
            "text": "Herbal leys take time to establish, and they’ll look different across the year. In summer, aim for:"
        },
        {
            "text": "Species mix and appearance will vary based on soil, climate, and management."
        },
        {
            "heading": 2,
            "text": "Scaling up: whole farm systems"
        },
        {
            "text": "If you’ve tried herbal leys and are satisfied they’re going to work for you, consider phasing them into your farming system. A simple forage-based rotation might be:"
        },
        {
            "text": "Plan rotational blocks based on soil type, cropping and management, together with the need to meet forage requirements and address problems such as weeds and soil compaction. Use appropriate cultivations, cereals or other break crops to phase herbal leys into clean, well-structured soils."
        },
        {
            "text": "Planning in this way ensures adequate forage supply and opportunities for weed control when incorporating herbal leys on your farm."
        },
        {
            "text": "Finally, herbal leys can be a valuable component of an Integrated Pest Management (IPM) strategy. Their diverse plant composition supports beneficial insects, improves soil health, and reduces the need for synthetic inputs, all of which contribute to a more resilient and sustainable farming system.  "
        },
        {
            "text": "Start small, learn as you go, and adapt based on your farm’s needs. And always seek advice from agronomists and seed suppliers experienced in herbal leys to give yourself the best start."
        },
        {
            "text": "Catchment Sensitive Farming can also signpost you to sources of information and advice. Email csf.national@naturalengland.org.uk for more information."
        }
    ]
}