{
    "url": "https://space.blog.gov.uk/2025/08/06/uk-space-frontiers-2035-a-strategic-vision-for-the-future-of-uk-space-science/",
    "title": "UK Space Frontiers 2035:  a strategic vision for the future of UK space science",
    "authors": [
        "UK Space Agency"
    ],
    "categories": [
        "Astronomy",
        "Delivering Missions and Capabilities"
    ],
    "pub_date": "2025-08-06T09:47:37+01:00",
    "content": [
        {
            "text": "The UK Space Agency, in partnership with the Science and Technology Facilities Council (STFC), has officially launched the UK Space Frontiers 2035: Astro, Planetary & Helio initiative."
        },
        {
            "text": "The Frontiers programme, led by the UK Space Agency’s Chief Scientist Professor Adam Amara, sets out to define the UK’s long-term vision for space science, positioning the nation as a global leader in the field. "
        },
        {
            "text": "UK Space Frontiers 2035 arrives at a pivotal moment, following the UK government's recognition of space as a ‘frontier industry’ in its Advanced Manufacturing Sector Plan, an important component of the broader Industrial Strategy. "
        },
        {
            "text": "The initiative draws inspiration from the well-established US Decadal Survey model, aiming to build a UK-specific framework that is both community-led and scientifically robust. "
        },
        {
            "text": "Its mission is clear: to prioritise future space-based missions across astronomy, planetary science, and heliophysics through a structured, inclusive, and transparent process. "
        },
        {
            "text": "This pilot programme will create a unified roadmap aligning UK Space Agency and STFC priorities. It will actively engage the scientific community through thematic panels, regional workshops, and open calls for white paper submissions. "
        },
        {
            "text": "Independent feasibility studies will be commissioned to evaluate mission concepts, helping to shape clear, evidence-based recommendations that will guide the UK’s space science investments for the next decade. "
        },
        {
            "text": "With an eye on international collaboration, the initiative is designed to ensure that the UK is well-positioned to lead and contribute to major upcoming missions, including calls from the European Space Agency (M8, F3, and mini-F), as well as opportunities for bilateral partnerships with global agencies such as NASA, the Canadian Space Agency (CSA), and the Japan Aerospace Exploration Agency (JAXA). "
        },
        {
            "text": "UK Space Frontiers 2035 will help guide UK space science in the following ways: "
        },
        {
            "heading": 3,
            "text": "1. Align the UK Space Agency and STFC priorities through a unified roadmap"
        },
        {
            "text": "As separate UK government agencies involved in funding scientific research within the space sector, it is important for the coherence of the UK’s future space strategy that both the UK Space Agency and the STFC’s priorities are aligned to combine funding and accelerate  the development of future space-based missions across astronomy, planetary science, and heliophysics. "
        },
        {
            "heading": 3,
            "text": "2. Engage the scientific community via thematic panels and white paper submissions"
        },
        {
            "text": "UK Space Frontiers will encourage white paper submissions, running regional workshops to boost engagement from the scientific space community, and grant exposure to unrepresented groups as well as early-career researchers, ensuring that the process is inclusive and representative of the UK’s diverse scientific community. "
        },
        {
            "text": "In addition, UK Space Frontiers will establish a steering committee and thematic panels to review and prioritise white papers whose findings and solutions would yield the most benefit to the UK space science community. "
        },
        {
            "heading": 3,
            "text": "3. Commission independent feasibility studies to assess mission concepts"
        },
        {
            "text": "As it becomes more important to maximise the productivity and benefit to the UK space economy of every research project, UK Space Frontiers will ensure that investment capital is used efficiently by commissioning independent feasibility studies to assess mission concepts before they are funded. "
        },
        {
            "heading": 3,
            "text": "4. Deliver clear, actionable recommendations to guide UK investments"
        },
        {
            "text": "Independent feasibility studies will be commissioned to evaluate mission concepts, ensuring that recommendations are grounded in evidence and practicality. These recommendations will serve as a guide for UK investments in space science over the next decade. "
        },
        {
            "text": "Details on how to get involved will be shared shortly. The UK Space Frontiers 2035 initiative marks an important step in shaping the future of UK space science, one that will be built by the community, for the future. "
        }
    ]
}