{
    "url": "https://defraenvironment.blog.gov.uk/2025/07/01/increasing-incentives-for-business-to-invest-in-nature-new-call-for-evidence/",
    "title": "Increasing incentives for business to invest in nature: new call for evidence",
    "authors": [
        "Laila Sedgwick"
    ],
    "categories": [
        "Green finance"
    ],
    "pub_date": "2025-07-01T10:18:05+01:00",
    "content": [
        {
            "text": "Sustained economic growth depends on a healthy and productive natural environment."
        },
        {
            "text": "Businesses across the UK – including in food and agriculture, construction, financial services, tourism and retail – rely on a functioning natural environment to operate, grow and innovate.  Over half of global GDP is highly or moderately dependent upon nature and the services it provides: powering our industries, safeguarding our food security and protecting public health."
        },
        {
            "text": "It follows that the decline of nature in the UK to historically and internationally low levels, in addition to global nature decline, creates risks to the UK economy and UK companies. These are already being realised."
        },
        {
            "text": "According to the Green Finance Institute’s analysis, environmental degradation could lead to a reduction in UK GDP of 1.5% to 3% by 2030 through reduced productivity, fragmented supply chains, business disruption and increased costs of insurance, among other factors."
        },
        {
            "text": "Conversely, investing in nature recovery offers opportunities for growth, business development and diversification, innovation and cost savings. So getting more private sector investment into nature recovery – especially from the businesses that impact and depend most heavily on nature – is vital."
        },
        {
            "text": "That’s why we’ve published a new call for evidence on expanding the role of the private sector in nature recovery."
        },
        {
            "text": "Enabling private investment in nature"
        },
        {
            "text": "There are already good examples of sectors supporting high-integrity nature restoration projects, including developers ensuring Biodiversity Net Gain and businesses procuring nature-based carbon credits under the Woodland Carbon Code and the Peatland Code."
        },
        {
            "text": "Business demand to invest in nature and the services it provides enables nature restoration projects to deliver financial returns to suppliers, including farmers and land managers, and to investors. "
        },
        {
            "text": "However, to help meet our shared ambition for nature recovery, we need to go much further to increase demand for nature services across the private sector. This will provide greater financial certainty for both suppliers of and investors in nature restoration projects."
        },
        {
            "text": "New call for evidence"
        },
        {
            "text": "We are seeking views on how to fairly and effectively increase the incentives for businesses to invest in nature through a new call for evidence on expanding the role of the private sector in nature recovery – incentives in line with the benefits businesses draw from the natural environment and the impacts they have on our shared natural assets."
        },
        {
            "text": "The Secretary of State for the environment hosted a roundtable discussion on 12 June, in collaboration with the Green Finance Institute and Lloyds Banking Group, to launch the call for evidence and kick off the conversation about stimulating demand."
        },
        {
            "text": "Responses to the call for evidence will support the further development of policies to increase private sector demand for investment in nature protection and improvement. We welcome responses from businesses, investors, nature service providers (such as farmers and landowners), environmental organisations, academics and the public."
        },
        {
            "text": "We are seeking views and evidence on how to increase investment in the following six outcomes, while managing any risks for businesses, communities and consumers:"
        },
        {
            "text": "This is an opportunity to help influence how government and business work together to scale up private investment in nature, enabling nature-positive business models that deliver both environmental and economic returns."
        },
        {
            "text": "The call for evidence will close on 7 August 2025. If you would like to share your views, please send written submissions to Nature.Investment.CfE@defra.gov.uk."
        }
    ]
}