{
    "url": "https://mhclgmedia.blog.gov.uk/2025/07/01/landmark-review-launched-into-parental-leave-and-pay/",
    "title": "Landmark review launched into parental leave and pay",
    "authors": [
        "mhclgpress"
    ],
    "categories": [
        "Workers' rights"
    ],
    "pub_date": "2025-07-01T18:15:46+01:00",
    "content": [
        {
            "text": "The government has launched a review into the parental leave and pay system – the first of its kind in Britain – to help working families and give children a better start in life."
        },
        {
            "text": "There is widespread positive coverage of this announcement across national, trade and regional media, with campaign groups hailing the government’s proactive steps to make change for families. The chief executive of the charity Pregnant Then Screwed Rachel Grocott is quoted across articles describing the review as “long overdue” and a “no-brainer” that will “pay back above and beyond” to society."
        },
        {
            "text": "Coverage features in The Times (p8 & 9), Telegraph (p2), Mirror (p4),Guardian (p7), The i Paper (p12), Daily Mail (p6), BBC online, Huff Post, LBC, Independent and Sky News. Regional and trade articles include The Liverpool Echo, Evening Standard, People Management, Personnel Today, Express & Star and Edinburgh Reporter."
        },
        {
            "text": "The Deputy Prime Minister’s statement is carried across the coverage highlighting that supporting working parents is “vital for the economy” and plans already progressing to improve the law, like new day one rights to parental and paternity leave."
        },
        {
            "text": "Coverage also extensively quotes DBT’s Secretary of State Jonathan Reynolds who met parents yesterday at the Young V&A in Bethnal Green, to hear about their experiences of the system. During his visit, he spoke exclusively to The Times, PA and broadcast media, with BBC News and BBC Radio 1 running the story on its breakfast bulletins."
        },
        {
            "text": "Other campaigners supporting the review include George Gabriel, co-founder of The Dad Shift, who said “tens of thousands of mums, dads and future parents” who make up their campaign “are delighted the government is delivering its promised review”. Working Families CEO Jane van Zyl described it as “a vital opportunity to build a parental leave system that supports the needs of families today”."
        },
        {
            "text": "The review co-led by DBT and DWP is part of the government’s Plan to Make Work Pay. It will examine how the current system can be improved to meet the needs of modern families, while supporting economic growth."
        },
        {
            "text": "See here for the full story."
        },
        {
            "text": "The Deputy Prime Minister Angela Rayner said:"
        },
        {
            "text": "“Those early years are the most special time for families, but too many struggle to balance their work and home lives."
        },
        {
            "text": "“Supporting working parents isn’t just the right thing to do – it’s vital for our economy. “Through our Plan to Make Work Pay, we’re already improving the parental leave system with new day 1 rights. This ambitious review will leave no stone unturned as we deliver for working families.”"
        }
    ]
}