{
    "url": "https://space.blog.gov.uk/2025/07/01/launching-shuttle-driving-new-uk-business-growth-in-the-space-sector/",
    "title": "Launching Shuttle: Driving new UK business growth in the space sector ",
    "authors": [
        "UK Space Agency"
    ],
    "categories": [
        "Catalysing Investment"
    ],
    "pub_date": "2025-07-01T10:00:00+01:00",
    "content": [
        {
            "text": "The UK space industry is experiencing dynamic growth, offering exciting opportunities not only for traditional space businesses but also for businesses in adjacent industries such as defence, energy, advanced manufacturing and automotive. "
        },
        {
            "text": "To help them unlock their potential in the space market, the UK Space Agency is proud to announce the launch of Shuttle, a new programme within the UK Space Agency Accelerator. Shuttle is designed specifically to support revenue-generating UK SMEs to assess their potential in the space market and take practical steps towards entering it. "
        },
        {
            "text": "Applications for the Shuttle programme are now open on a rolling basis until October 2025. "
        },
        {
            "text": "Antonia Yendell, Head of the Space Ecosystem team at the UK Space Agency, said:"
        },
        {
            "heading": 2,
            "text": "Bridging the gap for established businesses entering space"
        },
        {
            "text": "Shuttle builds on the success of the UK Space Agency Accelerator, which has supported over 250 ventures and contributed to £15 million raised. It addresses a key need identified through extensive engagement with industry: many established companies outside the space sector face challenges in understanding space-specific terminology, regulatory complexities, and how to position themselves within the space ecosystem.  "
        },
        {
            "text": "Shuttle is designed to demystify the space industry and provide valuable insight, connections, and tailored guidance to help businesses assess whether space is a viable opportunity for them, without diverting focus from their core operations. "
        },
        {
            "text": "Participants will follow a 4-month journey designed to support their market entry into the space sector and unlock new commercial opportunities. Support includes on-demand video content, one-to-one coaching, and group sessions to build knowledge, refine ideas, and connect with key stakeholders. "
        },
        {
            "heading": 2,
            "text": "Ambitious goals and proven impact"
        },
        {
            "text": "The Shuttle programme aims to support up to 20 businesses through a flexible application process. The goal is not just participation - it’s action. Companies will be supported to actively engage with the UK space sector, contribute to national capabilities, and generate new commercial revenue from space. "
        },
        {
            "text": "This focus on action is key. Shuttle is designed to do more than open doors; it aims to catalyse investment into the sector, enable the delivery of missions and capabilities that meet UK needs, and champion the value of space to investors, customers, and the wider economy. "
        },
        {
            "text": "The Accelerator programme has already demonstrated significant benefits, notably by giving participants greater access to partners, customers, and investors across the space ecosystem. Shuttle builds on this success by helping established businesses integrate into the space supply chain, accelerating their commercial readiness, and contributing to a sustainable, diverse UK space sector. "
        },
        {
            "heading": 2,
            "text": "How to get involved"
        },
        {
            "text": "Shuttle is open to UK-registered SMEs led by founders or senior decision-makers, with an active revenue stream and the capacity to commit fully to the programme. If your business is ready to explore the opportunities the space sector has to offer and make a lasting impact, we encourage you to apply and join the next cohort of Shuttle participants. "
        },
        {
            "text": "To find out more before applying, join our Shuttle Programme Q&A session on Wednesday 9 July 2025, 12pm - 1pm. This is a great opportunity to ask questions, learn more about what the programme offers, and hear directly from the team behind it. "
        },
        {
            "text": "This is a unique opportunity for established UK businesses to diversify and grow by entering the thriving space sector. By combining your existing expertise with the right knowledge, networks, and support, Shuttle can help unlock new commercial opportunities. "
        },
        {
            "text": "Applications are now open and will be accepted in four tranches across August to November. With a limited number of places available in each tranche to ensure tailored, high-quality support, early application is strongly recommended.  "
        },
        {
            "text": "Learn more and apply here: https://ukspaceaccelerator.co.uk/ "
        },
        {
            "text": "The UK Space Agency Accelerator is funded by the UK Space Agency and delivered in partnership with venture acceleration and ecosystem experts, Entrepreneurial Spark. "
        }
    ]
}