{
    "url": "https://dcmslibraries.blog.gov.uk/2025/07/01/libraries-sector-in-the-kings-birthday-honours-list-2025/",
    "title": "Libraries sector in the King’s Birthday Honours List 2025",
    "authors": [
        "DCMS Libraries Team"
    ],
    "categories": [
        "Library news"
    ],
    "pub_date": "2025-07-01T17:06:57+01:00",
    "content": [
        {
            "text": "DCMS is the largest contributor of honours nominations across Whitehall and an incredible 248 people from across DCMS sectors were recognised in The King’s official Birthday Honours List (20% of the total 1,215 awards). "
        },
        {
            "text": "Here on the Libraries blog, we’re shining a spotlight on those recognised for services to public libraries or who have worked within them as part of the work they have been awarded honours for."
        },
        {
            "text": "Members of the Order of the British Empire (MBE)"
        },
        {
            "text": "Julie Bell. Head of Cultural Services, Lancashire County. For services to public libraries"
        },
        {
            "text": "Julie Bell has been an advocate for the creative and cultural sector in Lancashire for over 40 years. She stepped down from her long-standing role as Head of Cultural Services for Lancashire County Council in 2024. "
        },
        {
            "text": "Julie worked for Lancashire County Council for her whole career, upholding their vision of providing Library and Museum services to support the people of Lancashire to lead happier, healthier and enriched lives through access to culture, heritage and creativity."
        },
        {
            "text": "Medallists of the Order of the British Empire (BEM)"
        },
        {
            "text": "Charlotte Rebecca Clark. Manager, Southwold Library. For services to Literacy and to the community in Reydon and Southwold. "
        },
        {
            "text": "Charlotte has worked for the library service in Suffolk since August 2003, and is an executive library manager, which involves overseeing and supporting other library managers as well as looking after Southwold Library."
        },
        {
            "text": "Her many achievements have involved overseeing the library moving from a very small building to the refurbished Old Hospital site in 2022 and ensuring the library always has a busy and varied schedule of events and activities."
        },
        {
            "text": "She also organised the popular Slaughter in Southwold Crime Festival for many years -  the 11th event took place in June."
        },
        {
            "text": "Jason Tutin. Head, 100% Digital Leeds. For services to Digital Inclusion"
        },
        {
            "text": "Jason studied a degree in Information and Library Services at Leeds Beckett University and, whilst working for Leeds City Council’s library service for 20 years, developed a trailblazing digital inclusion programme, which is now part of the Council’s wider Integrated Digital Service."
        },
        {
            "text": "Through the 100% Digital Leeds programme Jason and his team are working with, and within, communities to remove the barriers to digital inclusion and improve outcomes for everyone."
        },
        {
            "text": "Nominate somebody for an Honour"
        },
        {
            "text": "There are so many people at all levels across the libraries sector that do great things; on the frontline and volunteering, as well as those in senior positions."
        },
        {
            "text": "If you know of someone who you think deserves a national honour then please put them forward!"
        },
        {
            "text": "Candidates need to have:"
        },
        {
            "text": "In reflection of our diverse society, we encourage nominations for female candidates and under-represented groups such as those from an ethnic minority background, LGBTQ+ and disabled people."
        },
        {
            "text": "You can find information on how to submit a nomination on GOV.UK."
        }
    ]
}