{
    "url": "https://insidedio.blog.gov.uk/2025/07/01/nato-first-supporting-our-allies-on-exercise-catamaran/",
    "title": "NATO first: Supporting our allies on Exercise Catamaran ",
    "authors": [
        "Brigadier Gavin Hatcher CBE"
    ],
    "categories": [
        "Armed Forces",
        "Defence Training Estate (DTE)"
    ],
    "pub_date": "2025-07-01T11:24:37+00:00",
    "content": [
        {
            "text": "Braunton Burrows Training Area is one of our most unique and complex areas to train owing to its coastal location and extensive sand dune system.  "
        },
        {
            "text": "As DIO’s Head of Overseas and Training region, I recently had the privilege of visiting the training area to see members of my team in action during Exercise Catamaran. Watching DIO’s small but dedicated team seamlessly support such a complex operation involving several of our NATO allies was truly impressive.  "
        },
        {
            "text": "NATO allies training together in North Devon"
        },
        {
            "text": "Exercise Catamaran is one part of the wider, French-led POLARIS 25, a month-long training exercise across France and the UK which saw more than 3,000 military personnel from allied nations working on warfighting skills together. Catamaran was the part of the exercise to take place in the UK, at Braunton Burrows Training Area in North Devon. The training saw amphibious landings, realistic battle scenarios, vehicle training and a significant aircraft presence flying above the area.  "
        },
        {
            "text": "The timing of the exercise couldn’t have been more pertinent following the recent publication of the Strategic Defence Review, which made ‘NATO first’ one of its central tenets. Seeing this principle in action with more than 3,000 troops from 9 nations working together – demonstrated exactly why these collaborative relationships are so vital to our defence capabilities.  "
        },
        {
            "text": "During my visit to during Exercise Catamaran, I had the privilege of being hosted aboard the French flagship, Dixmude. This gathering allowed valuable conversations with military peers from partner nations, and I was given an excellent briefing on the entire exercise.  "
        },
        {
            "text": "Meeting the team: Balancing military training and public access"
        },
        {
            "text": "My visit provided a wonderful opportunity to engage directly with my team that make these complex training exercises possible. Unlike many of our training areas, we lease the land at Braunton Burrows, which means we cannot shut areas off to the public during military exercises. Where other sites might use red flags and lights to prevent public access, at Braunton, the team must be innovative, engaging directly with visitors to ensure their safety while not disrupting training exercises. This delicate balancing act is handled with remarkable professionalism.  "
        },
        {
            "text": "While Braunton Burrows is certainly not our biggest training area, it offers fascinating training opportunities with its distinctive landscape features.  "
        },
        {
            "text": "There was something particularly poignant about this training exercise being held on the anniversary of the D-Day landings – particularly on this site that played a major role in the preparations as US troops would rehearse on the burrows ahead of their landings on Omaha and Utah beaches. Much of the infrastructure used by them during 1943 is still standing today, including concrete landing craft and a bazooka training wall.  "
        },
        {
            "text": "What struck me most about my visit was the huge level of support the small team could provide for such complex and large-scale defence operations. When you step back and consider all the activity that is happening at sea, in the air and across the sand dunes, it is remarkable what has been achieved. This work demonstrates DIO’s ability to support complex military requirements while maintaining our commitment to public access.  "
        },
        {
            "text": "The dedication I witnessed at Braunton Burrows exemplifies what makes our Defence Training Estate team so special and I was thrilled to see how our support makes a real difference in facilitating such important training opportunities for both the UK armed forces and those of our allies.  "
        }
    ]
}