{
    "url": "https://teaching.blog.gov.uk/2024/05/17/a-whole-school-approach-to-mental-health-and-wellbeing-part-2/",
    "title": "A whole school approach to mental health and wellbeing: Part 2",
    "authors": [
        "Cherelle Lawrence",
        "Craig Smith"
    ],
    "categories": [
        "Primary schools",
        "Pupil wellbeing and behaviour",
        "Secondary schools"
    ],
    "pub_date": "2024-05-17T09:00:29+01:00",
    "content": [
        {
            "heading": 3,
            "text": "Hear from two mental health leads at the Ormiston Academies Trust (OAT) talk about the central role of leadership and management in supporting and championing efforts to promote mental health and wellbeing, as part of a whole school approach. "
        },
        {
            "text": "I’m Cherelle Lawrence, the inclusion manager and mental health lead at George Slater Academy in the West Midlands.  "
        },
        {
            "text": "Our School"
        },
        {
            "text": "Our journey to embedding a whole school approach to mental health began in 2017, when we applied for the ‘Sandwell Wellbeing Charter Mark’.  By reviewing whole school data and gathering staff, student, parent and carer voices, we were able to put together our very first action plan, guiding us in the right direction to improve wellbeing at our academy."
        },
        {
            "text": "Since then, as mental health lead, I have worked alongside our headteacher and the senior leadership, safeguarding and pastoral teams, to make changes to our policies and procedures to ensure improving mental health and wellbeing is a part of our day-to-day practice."
        },
        {
            "text": "Choosing the right training"
        },
        {
            "text": "As a non-teaching member of staff and middle leader, I sometimes find it quite difficult to find the ‘right’ CPD course to support my professional development. I found my DfE training course to be the ‘right fit’, as it not only developed my understanding of embedding the whole school approach, but also developed my strategic skills and confidence."
        },
        {
            "text": "I found my course via the DfE senior mental health lead training website and went on to complete the self-assessment online tool, which helped me identify my specific learning needs and preferences.  I could then choose from a list of quality-assured training courses. I chose a 3-day online course with portfolio."
        },
        {
            "text": "One thing I really liked about this course was the element of individual research. I chose to research Emotional Based School Non-Attendance (EBSNA), as at the time, I had only just heard about the term, but could see we were experiencing issues with getting students through the door due to anxieties. From my research, I found that students displaying severe signs of EBSNA required patience, time, targeted intervention and sometimes an ‘alternative’ setting."
        },
        {
            "text": "Working with SLT to maximise the impact of our whole school approach"
        },
        {
            "text": "I was always used to being operational and focussing on student intervention - but to have whole school impact - I needed to shift my focus to being more strategic. I needed to work closely with senior leaders to ensure the changes I was proposing not only reduced anxieties and improved attendance, but also improved academic outcomes and did not majorly reduce the whole school budget. This is where leadership and management became central to effective practice."
        },
        {
            "text": "Our headteacher prioritised mental health agenda items at leadership meetings, which enabled me to present my action plan. This meant I could get feedback and input from SLT on how my action plan links to other areas within the academy such as teaching and learning, curriculum, PSHE, attainment and staff CPD. I was then able to further improve my strategy and link it to the academy framework and vision."
        },
        {
            "text": "As a result, we now have a framework that summarises how we identify, support and review students struggling with EBSNA. We’ve even opened an EBSNA provision to support students who need that stepping-stone to support them gradually reintegrating back into mainstream lessons following prolonged absences from school."
        },
        {
            "text": "Becoming an Effective Mental Health Lead"
        },
        {
            "text": "The mental health lead training developed me as a middle leader and helped me to understand that leadership and management are key to embedding a whole school approach. I’ll never forget the facilitator on my DfE training course saying “mental health needs to be like a river flowing through every policy and procedure” – this is something I held on to, and still do as I continue my journey to improving the mental health and wellbeing for staff and students within our academy."
        },
        {
            "text": "- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -"
        },
        {
            "heading": 4,
            "text": "I’m Craig Smith, the senior assistant principal and designated safeguarding lead at Wodensborough Ormiston Academy in Sandwell.  "
        },
        {
            "text": "My interest in mental health has grown throughout my career, from working with SEND students, to doing various training courses - like training to provide voluntary crisis support through a text message platform with Shout charity. I enjoy volunteering as part of my own development and for the immense satisfaction it brings to ‘be there’ for someone else."
        },
        {
            "text": "Getting the right people in place"
        },
        {
            "text": "Our academy is committed to developing an effective response to the increasing demand for mental health support. Our first focus, from a leadership and management perspective, was to get the right people in the right positions, creating dedicated spaces and working on a plan. We now have a full time school counsellor and therapeutic mentor, 8 youth mental health first aiders, a Mental Health Support Team (MHST). The safeguarding and mental health team have all completed the Papyrus ASIST training."
        },
        {
            "text": "I feel fortunate to have the support of the principal and the governors which had been instrumental in embedding our whole school approach so that mental health and wellbeing is at the centre of our school culture and ethos."
        },
        {
            "text": "Auditing provision and developing our offer"
        },
        {
            "text": "The £1,200 DfE grant funding to train a mental health lead helped structure our thought process. The senior leadership team alongside the safeguarding and mental health team audited, consulted and reflected to consider the best way forward and realised that we still had a lot to do. Supported by the leadership model, embedded into the training programme, we identified some quick, low-cost wins that would help empower others and reassure students, parents and staff as they navigated this growing need."
        },
        {
            "text": "We increased the visibility of our approach through weekly safeguarding/mental health briefings for staff, and mental health boards around the academy providing a regularly refreshed selection of posters and leaflets, which signpost to self-help resources. This helps keep mental health at the forefront of everyone’s minds. I also felt invigorated to take on some of the bigger challenges and difficult conversations with partner agencies to get the right provision for our students."
        },
        {
            "text": "Quick wins"
        },
        {
            "text": "Slower growth"
        },
        {
            "text": "What Next?"
        },
        {
            "text": "Our journey, with all its challenges, continues ebut we face the reality of education today with an open and positive mind.  Irrespective of the ongoing challenges we strive to serve our community with commitment, open minds and authenticity."
        }
    ]
}