{
    "url": "https://design102.blog.gov.uk/2024/05/17/how-design102-brought-a-700-year-old-coronation-tradition-to-the-public/",
    "title": "How Design102 brought a 700-year-old Coronation tradition to the public",
    "authors": [
        "Design102 team"
    ],
    "categories": [
        "Creative",
        "Design",
        "Services",
        "Team"
    ],
    "pub_date": "2024-05-17T18:13:32+01:00",
    "content": [
        {
            "text": "Do you know what a Coronation Roll is? If you don’t, you may not be alone, since this document has never been presented to the public before. The Permanent Secretary of the Ministry of Justice, Antonia Romeo, commissioned Design102 to change this by designing and creating a website to host the Coronation Roll from the Coronation of King Charles III and Queen Camilla in May 2023, and we worked closely with the Cabinet Office to deliver this. Read on to learn about the Roll, our process and the results."
        },
        {
            "heading": 2,
            "text": "What is a Coronation Roll?"
        },
        {
            "text": "Coronation Rolls have been used to officially record the proceedings of Coronations for centuries, with the first Roll being created for the Coronation of Edward II and Queen Isabella in 1308. The Roll contains details of the accession, the planning of the Coronation, and a description of the ceremony."
        },
        {
            "text": "Because this document has never been made publicly available before, creating a digital version was seen as an opportunity to commemorate the Coronation by allowing the public to discover new details about this historic occasion."
        },
        {
            "heading": 2,
            "text": "How did we help?"
        },
        {
            "heading": 3,
            "text": "Strategy"
        },
        {
            "text": "The project began with an insight-gathering phase. We held interviews with stakeholders and focus groups with the general public and other specialist audiences to help us better understand our target audience and how we could best engage them."
        },
        {
            "text": "Our audience was enthusiastic about the idea of a digitalised Coronation Roll, which was seen as a modern and inclusive way of marking this important historic event. However, they also wanted more than just a long scroll of text – they were looking for interactivity and the opportunity to peek behind the curtain, discovering more about the Coronation through videos and further resources."
        },
        {
            "text": "We recommended that the output should be a website which engages through interactivity while also directing users to other resources and materials that provide interesting information."
        },
        {
            "heading": 3,
            "text": "Design"
        },
        {
            "text": "From this insight, we developed two design routes. They both aimed to blend contemporary and traditional elements, with one focusing on vibrant colours and design while the other leaned towards a more traditional style. Our goal with both routes was to reflect how the Coronation brought together contemporary British culture and historic tradition."
        },
        {
            "text": "The final design was inspired by the rich colours and designs of the Coronation regalia, paired with the natural colouring of the official record, written on parchment. Serif fonts were chosen for their traditional feel, which when paired with the striking full-bleed photography creates a timeless modern-traditional design."
        },
        {
            "heading": 3,
            "text": "Web build"
        },
        {
            "text": "With our design concept finalised, our next task was to build a platform that met the requirements of interactivity and engagement. The final website features the historically-accurate Coronation Roll on a single page, complemented with images to bring the text to life. Elements of the Roll are highlighted to click-through to further information in the form of videos, photography, audio clips and more. The result is a truly interactive and engaging website that preserves tradition while celebrating modernity."
        },
        {
            "heading": 3,
            "text": "Results"
        },
        {
            "text": "Our Coronation Roll website has been a huge success. In the first five days after the launch, the website achieved:"
        },
        {
            "text": "Notably, the website was presented to His Majesty the King, who commented on how important the digital Coronation Roll is for future generations."
        },
        {
            "text": " "
        },
        {
            "text": "Visit the Coronation Roll website, and read more about the importance of the Coronation Roll in this BBC news article. You can also read the official government press release on GOV.UK."
        },
        {
            "text": "Design102 is a creative communications agency for government and the public sector. Discover our work at www.design102.co.uk or reach out to us at hello@design102.co.uk to find out more."
        },
        {
            "text": " "
        }
    ]
}