{
    "url": "https://dluhcmedia.blog.gov.uk/2024/05/17/new-levelling-up-powers-to-improve-high-streets/",
    "title": "New levelling up powers to improve high streets",
    "authors": [
        "dluhcpress"
    ],
    "categories": [
        "Levelling Up"
    ],
    "pub_date": "2024-05-17T15:17:23+01:00",
    "content": [
        {
            "text": "Our announcement of new council powers to revive empty high street shops feature prominently in The Sun (p2) and Financial Times (p2) this week."
        },
        {
            "text": "These positive stories follow DLUHC’s announcement that it will introduce High Street Rental Auctions by the summer – a new law that will give councils in England the right ‘to seize and rent out empty shops’ - as the Financial Times reports."
        },
        {
            "text": "So how do they work? Where a high street shop has been sitting empty for over a year with no proactive action from the landlord, councils will be able to step in and auction off a rental lease for up to five years. Auctions will take place with no reserve price, giving local businesses and community groups the chance to take up the premises at a competitive market rate. This follows a careful consultation process, with safeguards also put in for place for landlords."
        },
        {
            "text": "Why are we doing it? Regenerating our high streets is at the heart of the government’s levelling up agenda. Through these changes, the Department for Levelling Up, Housing and Communities is breathing new life into once-bustling town centres – transforming them into vibrant places where people feel happy to shop, live, work and relax - and restoring local pride as we level up across the country. The powers will help councils take back control and put their communities first."
        },
        {
            "text": "This is also an important commitment in our Anti-Social Behaviour Action Plan – along with our High Street Accelerators pilot programme which is helping areas in need to accelerate regeneration. We just announced that we’ll be giving 10 areas across England an extra £500,000 each to revamp the green spaces on their high street, making them greener, cleaner and more pleasant places to spend time – in turn, boosting the local economy."
        },
        {
            "text": "This £5 million funding has been covered positively across several regional and local titles so far, including:"
        },
        {
            "text": "Together, High Street Rental Auctions and High Street Accelerators will help areas tackle the wide-ranging issues stemming from prolonged high street emptiness – from anti-social behaviour to struggling businesses, low footfall and increased unemployment."
        },
        {
            "text": "This new high streets package complements the government’s significant levelling up support which currently totals over £15 billion to improve every part of the UK by 2030."
        }
    ]
}