{
    "url": "https://kingsawards.blog.gov.uk/2024/05/17/timpson-group-promoting-opportunity-through-social-mobility/",
    "title": "Timpson Group – Promoting Opportunity, through social mobility.",
    "authors": [
        "The Queen's Awards for Enterprise"
    ],
    "categories": [
        "Advice",
        "Assessors",
        "Judges",
        "King's Awards",
        "Lord-Lieutenants",
        "Recipients",
        "social mobility",
        "socialmobility"
    ],
    "pub_date": "2024-05-17T16:02:05+01:00",
    "content": [
        {
            "text": "Timpson Group are the largest service retailer in the UK and are one of the largest employers of Ex-offenders in the UK.  Around 10% of their entire workforce is made up people who have been directly recruited from prison. Timpson Group are widely regarded as one of the most inclusive employers in the UK."
        },
        {
            "heading": 3,
            "text": "Why did you apply for The King’s Awards?"
        },
        {
            "text": "Because for over 20 years we have been at the forefront of inclusive recruitment. We are seen by many as the pioneers of ex-offender recruitment. We also employ many other margoinalised groups that may face barriers to employment, including, military veterans, refugees, as well as those who are care experienced or neurodiverse."
        },
        {
            "heading": 3,
            "text": "Why did you apply for Promoting Opportunity?"
        },
        {
            "text": "We chose the category of promoting opportunity through social mobility, as it fits perfectly with our culture of kindness and compassion. We believe in giving people a second chance and focusing on their potential, rather that past mistakes. We also realise that some marginalised groups may be from lower socioeconomic backgrounds, who have faced cumulative disadvantages throughout their lives. By offering employment, we are able to help people to flourish and achieve their full potential."
        },
        {
            "text": "The application process was rigorous, but this ensures that all recipients of a Kings award, truly deserve it."
        },
        {
            "heading": 3,
            "text": "How do you feel about receiving the Award?"
        },
        {
            "text": "By receiving the Kings Award, we feel incredibly proud that being one of the UK’s most inclusive employers has been recognized and we hope that this award and recognition, will help to inspire others. We also hope that this award, will make our colleagues and customers feel proud of what we have achieved."
        },
        {
            "text": " "
        },
        {
            "heading": 3,
            "text": "Top tips for potential applicants "
        },
        {
            "text": "Go for it! It’s a tough and rigorous application process, but there is support and help if needed. The benefits of receiving the award, far outweigh any negatives."
        },
        {
            "text": " "
        },
        {
            "heading": 3,
            "text": "Links:"
        },
        {
            "text": "www.timpson.co.uk"
        },
        {
            "text": "@JamesTCobbler"
        },
        {
            "text": "@TimpFoundation"
        },
        {
            "text": "https://www.linkedin.com/company/timpsongroup"
        },
        {
            "text": "https://www.facebook.com/timpsonuk"
        },
        {
            "text": "https://www.instagram.com/timpsonuk/"
        },
        {
            "text": "https://www.tiktok.com/@timpsonuk"
        }
    ]
}