{
    "url": "https://ukhsa.blog.gov.uk/2024/05/17/what-is-cryptosporidium-and-how-can-you-avoid-it-in-the-water-or-on-the-farm/",
    "title": "What is cryptosporidium, and how can you avoid it in the water or on the farm?",
    "authors": [
        "Blog Editor"
    ],
    "categories": [
        "Health Protection"
    ],
    "pub_date": "2024-05-17T13:01:26+01:00",
    "content": [
        {
            "text": "Cryptosporidium is a microscopic parasite that can cause an unpleasant – and sometimes dangerous – illness called cryptosporidiosis. This nasty bug lives in the intestines of infected humans and animals and is passed out in their poo. It can then spread and contaminate water sources like lakes, rivers, and swimming pools, as well as food like raw milk and vegetables."
        },
        {
            "text": "Who's at risk of catching cryptosporidiosis? "
        },
        {
            "text": "Unfortunately, anyone can catch it, but the illness is particularly common in children between 1 and 5 years old. Other groups at high risk of catching the bug include people working with farm animals or contaminated water, those changing nappies, or travelling to countries with poor sanitation.  It can cause serious illness in those of any age with weakened immune systems."
        },
        {
            "text": "How do you get infected? "
        },
        {
            "text": "Touching infected poo and then putting your unwashed hands near your mouth is a common way of catching cryptosporidiosis. You can also get it by swallowing contaminated water while swimming or drinking untreated water. Sometimes contaminated food like unwashed vegetables or raw milk can pass on the parasite too."
        },
        {
            "text": "What are the symptoms?"
        },
        {
            "text": "The symptoms are deeply unpleasant - severe watery diarrhoea, vomiting, stomach cramps, nausea, fever, and loss of appetite. It can last around 2 weeks, with the illness seeming to improve and then returning before you properly recover. The only way to know for sure if you have the illness is by getting tested by your doctor."
        },
        {
            "text": "How can I avoid it?"
        },
        {
            "text": "The good news is that cryptosporidiosis is preventable by following some simple hygiene steps:"
        },
        {
            "text": "- Wash hands frequently with soap and warm water, especially before eating, after going to the toilet, and after contact with pets/animals"
        },
        {
            "text": "- Wash and peel all fruits and vegetables"
        },
        {
            "text": "- Avoid drinking untreated water"
        },
        {
            "text": "- Don't swallow swimming pool or lake water"
        },
        {
            "text": "- Be careful with handwashing after any animal contact on farms"
        },
        {
            "text": "- Stay home from work/school until 48 hours after symptoms stop"
        },
        {
            "text": "In the unusual case of an outbreak affecting UK drinking water, follow the advice of the local water company, which will usually involve boiling water to be used for drinking, cooking, preparing food or brushing teeth."
        },
        {
            "text": "What should I do if I catch it?"
        },
        {
            "text": "While there's no specific treatment, the best approach is to rest and drink plenty of fluids to avoid dehydration from the diarrhoea. Most people with healthy immune systems will fight off the illness within a month."
        },
        {
            "text": "If you do get ill, it's important to be hygienic at home to avoid spreading the bug further - wash all clothes and towels on a hot cycle, disinfect bathrooms, ensure everyone uses their own towels, and don't swim or prepare food for others until symptoms are fully cleared up."
        },
        {
            "text": "Cryptosporidium is unpleasant, but these preventative steps are the easiest way to avoid it."
        }
    ]
}