{
    "url": "https://competitionandmarkets.blog.gov.uk/2025/04/03/driving-business-and-investor-insight-across-our-work/",
    "title": "Driving business and investor insight across our work",
    "authors": [
        "Dr Karen Croxson",
        "Tory Frame"
    ],
    "categories": [
        "Life at the CMA",
        "Recruitment"
    ],
    "pub_date": "2025-04-03T14:00:24+01:00",
    "content": [
        {
            "text": "The pace of change in today’s digital economy is exciting and unrelenting. Business models are evolving, AI is reshaping markets, and investment strategies are shifting in response to global competition and technological disruption."
        },
        {
            "text": "At the Competition and Markets Authority (CMA), we recognise that understanding these market dynamics is critical – our job is to ensure that consumers get a fair deal, that businesses are free to thrive, and that markets work well. This means ensuring that competition, innovation, and investment can thrive in important areas like AI, so that the vast opportunities are unleashed and can drive positive outcomes right across the UK."
        },
        {
            "text": "That’s why we are expanding our capability in strategic business analytics, to bring a stronger business and investor lens into our work in new and impactful ways. This means taking a more sophisticated and forward-looking approach to understanding how firms operate, compete, and scale in fast-moving markets – especially in AI and digital ecosystems. "
        },
        {
            "text": "A strong understanding of firms’ strategies and business models is essential to our work and as our CEO Sarah Cardell announced recently in a speech, deepening our capability in this area is one element of our wider build out of a world-leading strategic insight and analytics capability within a regulatory body."
        },
        {
            "heading": 2,
            "text": "Be part of a world-leading strategic insight and analytics function"
        },
        {
            "text": "Deepening business and strategic insight is part of a broader transformation within the CMA, which has already led to the creation of a new Executive Directorate for Data, Technology, and Insight (DTI). DTI brings together a cutting-edge mix of expertise across:"
        },
        {
            "text": "Our AI Centre of Excellence is a dedicated hub within DTI that develops AI expertise, both for internal use and to inform our regulatory approach."
        },
        {
            "heading": 2,
            "text": "What this means in practice"
        },
        {
            "text": "The Strategic Business Analysis function plays a vital role in helping the CMA stay ahead of market developments. Some of the key areas of focus include:"
        },
        {
            "text": "By embedding business and investor perspectives across our work, we can ensure that our regulatory decisions are rooted in commercial realities, enabling competition to drive sustainable growth, innovation, and consumer benefits."
        },
        {
            "heading": 2,
            "text": "Join the conversation"
        },
        {
            "text": "We are looking for people with experience in business, investment, and strategy to join us in shaping the next phase of this work."
        },
        {
            "text": "The ideal candidate will:"
        },
        {
            "text": "You might be considering public service as a long-term career move or want to 'test the waters' while applying strategic business analysis skills to policy and competition, or you may want to contribute to public service and be willing to join us for a focused stint. "
        },
        {
            "text": "We are looking for candidates who come from:"
        },
        {
            "heading": 2,
            "text": "What you'll get from us in return"
        },
        {
            "text": "You'll:"
        },
        {
            "text": "We believe that the CMA is an excellent place to work and we offer a flexible and supportive environment that will help you thrive and achieve your personal work-life balance."
        },
        {
            "text": "We offer flexible working – either in the time you contribute to the CMA’s work (short term appointments are available) or in working patterns, including hybrid home/office working, part time arrangements, compressed hours, and job shares."
        },
        {
            "text": "Our colleagues are included, respected, and valued, using their strengths and diverse perspectives and experiences to contribute to our work and reflect the public we serve."
        },
        {
            "text": "We offer an average pension employer contribution of 27%, generous leave, family friendly policies, and learning and development."
        },
        {
            "heading": 2,
            "text": "Be part of the future"
        },
        {
            "text": "If this sounds like you – or someone in your network – then we’d love to hear from you."
        },
        {
            "text": "Here are links to some initial roles, decoded into consulting language:"
        },
        {
            "text": "Join us in shaping the next chapter of competition, investment, and innovation in the UK economy."
        },
        {
            "text": "Find out more about working for the CMA"
        }
    ]
}