{
    "url": "https://dataingovernment.blog.gov.uk/2025/04/03/joining-up-the-dots-the-findings-of-our-recent-api-discovery/",
    "title": "Joining up the dots: the findings of our recent API discovery",
    "authors": [
        "James Freeland - Senior Data and Security Architect, GDS"
    ],
    "categories": [
        "Data Standards",
        "Data Strategy",
        "Open data"
    ],
    "pub_date": "2025-04-03T13:43:21+01:00",
    "content": [
        {
            "text": "Turbo-charging application programming interfaces (API) connectivity across government enables seamless, secure, legal and trusted data sharing. This will help address issues with underutilisation of data that were identified in the state of digital government review, and will help to deliver the six point plan for digital reform across the UK government  laid out in the blueprint for modern digital government."
        },
        {
            "text": "In January 2024 James Freeland, Senior Data and Security Architect and Alex Smith, Head of Data Security and Platforms at the Government Digital Service (GDS), teamed up to work on the API programme. They set themselves some goals for the end of the year:"
        },
        {
            "text": "Their intention was to use these engagement activities as a spring board to improve API connectivity and uptake across departments."
        },
        {
            "text": "They worked with their delivery partners, Scrumconnect, to conduct an eight week discovery with the main objective of this work being to assess maturity and appetite for using APIs in the sharing of data across departments and ALBs.  "
        },
        {
            "heading": 2,
            "text": "Undertaking cross government API research "
        },
        {
            "text": "The Scrumconnect discovery team undertook four key phases of activities:"
        },
        {
            "heading": 2,
            "text": "The research findings"
        },
        {
            "text": "At the end of the eight week discovery, their main findings revealed some common pain points:"
        },
        {
            "text": "API readiness and maturity:"
        },
        {
            "text": "API in relation to data sharing:"
        },
        {
            "heading": 2,
            "text": "Key outcomes"
        },
        {
            "text": "There’s exciting work to do in this space, with the Government Digital Service helping organisations across the public sector to share data more securely and effectively."
        },
        {
            "text": "A set of measurable outcomes were achieved as a result of commissioning the API Discovery work:"
        },
        {
            "heading": 2,
            "text": "Get involved!"
        },
        {
            "text": "James and Alex are looking for colleagues to help move this work forward by participating in upcoming alpha user research. To get involved in this and to join the API community contact them at: api-programme@digital.cabinet-office.gov.uk"
        }
    ]
}