{
    "url": "https://homeofficemedia.blog.gov.uk/2025/04/03/martyns-law-factsheet/",
    "title": "Martyn's Law Factsheet",
    "authors": [
        "Home Office news team"
    ],
    "categories": [
        "Uncategorised"
    ],
    "pub_date": "2025-04-03T12:00:04+01:00",
    "content": [
        {
            "text": "This factsheet was updated in April 2025. "
        },
        {
            "text": "The Terrorism (Protection of Premises) Act 2025, also known as Martyn’s Law, received Royal Assent on Thursday 3 April 2025.  "
        },
        {
            "text": "This Act delivers the Government’s manifesto commitment to strengthen the security of public premises and events. "
        },
        {
            "text": "The Government would like to pay tribute to Figen Murray, mother of Martyn Hett, who was killed in the Manchester Arena attack.  Her campaigning has been crucial in driving this Act forward.   "
        },
        {
            "text": "The Government intends for there to be an implementation period of at least 24 months before the Act comes into force. This will allow the SIA’s new function to be established, whilst ensuring those responsible for premises and events in scope have sufficient time to understand their new obligations. This will enable them to plan and prepare appropriately.  "
        },
        {
            "text": "Please refer to our wider factsheets and legislation documentation which can be found on GOV.UK. "
        },
        {
            "text": "What does Martyn’s Law do?  "
        },
        {
            "text": "The Terrorism (Protection of Premises) Act 20251, also commonly referred to as Martyn’s Law, will improve protective security and organisational preparedness across the UK by requiring that those responsible for certain premises and events consider how they would respond to a terrorist attack. In addition to this, at certain larger premises and events, appropriate steps to reduce vulnerability to terrorist attacks must also be considered. Through the Act, qualifying premises and events should be better prepared and protected, ready to respond in the event of a terrorist attack.  "
        },
        {
            "text": "Whilst those that fall within scope of the Act may wish to begin considering the requirements, they should note that guidance will be published in due course. This guidance will assist in understanding the requirements set out in the legislation. The guidance is being designed to be easy to follow, needing neither particular expertise nor the use of third-party products or services. "
        },
        {
            "text": "To support enforcement of the regime, a regulator will be established through a new function of the Security Industry Authority (SIA), which will support, advise and guide those responsible for premises and events in meeting the requirements of this legislation. "
        },
        {
            "text": "How will it work?   "
        },
        {
            "text": "The Act establishes a tiered approach, linked to the number of individuals it is reasonable to expect may be present at the same time at premises and events.  "
        },
        {
            "text": "Who will be in scope? "
        },
        {
            "text": "Premises that satisfy the following four criteria fall within scope of the Act: "
        },
        {
            "text": "If 800 or more individuals may be expected, the premises will be an enhanced duty premises unless the Act says otherwise. "
        },
        {
            "text": "An event that satisfies the following criteria fall within scope of the Act: "
        },
        {
            "text": "Who is the responsible person for qualifying premises? ​ "
        },
        {
            "text": "For qualifying premises, the responsible person is the person who has control of the premises in connection with their relevant Schedule 1 use (e.g. the use of a venue as a sports ground or a hotel). Where there is more than one Schedule 1 use (e.g. a church that also has a creche), it will be the person in control of the premises in connection with whichever Schedule 1 use is the principal use.  "
        },
        {
            "text": "Who is the responsible person for qualifying events? "
        },
        {
            "text": "For qualifying events, the responsible person is the person who has control of the premises at which the event will be held for the purposes of the event. The circumstances of the event will need to be considered to determine who the responsible person is. For example, if a concert is to be held in a park and the company putting on the event takes control of an area of the park for the purposes of that concert, the company putting on the event will be the responsible person. Conversely, if a stately home puts on a concert in its grounds and maintains control of the site for the purposes of that concert, the stately home will be the responsible person. This would be the case even if the stately home contracted organisations to do aspects of the event (e.g. to provide door security or ticketing).   "
        },
        {
            "text": "What are the requirements for standard duty premises? "
        },
        {
            "text": "Standard duty premises are generally those where it is reasonable to expect that between 200 and 799 individuals (including staff) may be present at the same time at least occasionally. The responsible person will be required to: "
        },
        {
            "text": "These public protection procedures are those which should be followed by people working at the premises if an act of terrorism were to occur at the premises, or in the immediate vicinity. They are procedures which may be expected to reduce the risk of physical harm being caused to individuals relating to evacuation, invacuation (moving people to a safe place), locking down the premises, and communicating with individuals on the premises.  "
        },
        {
            "text": "The requirements for standard duty premises are centred around simple, low-cost activities with costs relating primarily to time spent. There is no requirement to put in place physical measures. "
        },
        {
            "text": "What are the requirements for enhanced duty premises and qualifying events? "
        },
        {
            "text": "Enhanced duty premises and qualifying events are premises or events where it is reasonable to expect that 800 or more individuals (including staff numbers) may be present on the premises at least occasionally2 or attend the event at the same time. In addition to the same requirements as standard duty premises (above), the person responsible for enhanced duty premises and qualifying events will additionally be required to: "
        },
        {
            "text": "How to assess how many individuals are reasonably expected to be present?  "
        },
        {
            "text": "A range of methods can be used to make a reasonable assessment. This includes methods which those responsible for premises and events may already be familiar with, e.g. safe occupancy calculations for the purposes of fire safety or use of historic data.  "
        },
        {
            "text": "How will Martyn’s Law be enforced?  "
        },
        {
            "text": "To support enforcement of the regime, a new regulatory function will be established within the Security Industry Authority (SIA). The SIA will seek to support, advise and guide those responsible for premises and events in meeting the requirements of this legislation. Where there are instances of serious or persistent non-compliance the SIA will be able to take enforcement action including compliance notices, monetary penalties and restriction notices. The legislation also includes some criminal offences. The SIA must prepare statutory guidance about how it will discharge its functions under the Act, which must be approved by the Home Secretary before it is published.   "
        },
        {
            "text": "There will be a period of time prior to the implementation of the legislation, i.e. when it will come into force. We expect this period to be at least 24 months to allow for the set-up of the regulator and to ensure sufficient time for those responsible for premises and events in scope to understand their new obligations before they come into force, being able to plan and prepare accordingly. "
        },
        {
            "text": "How will my business or organisation be supported on Martyn’s Law?   "
        },
        {
            "text": "Guidance will be provided in due course to assist those in scope to understand the requirements set out in the legislation. The guidance is being designed to be easy to follow, needing neither particular expertise nor the use of third-party products or services. "
        },
        {
            "text": "The Home Office continues to build on the materials already published in relation to this legislation. This includes a bespoke landing page on Protect UK, Government factsheets which set out key aspects of the legislation, social media promotion, various press releases, media briefings, and our substantial stakeholder engagement campaign. "
        },
        {
            "text": "Our intention is to augment and further strengthen our communications during the implementation period, to support duty holders and raise awareness amongst the public. "
        },
        {
            "text": "Will Martyn’s Law apply to all of the UK?    "
        },
        {
            "text": "The legislation will apply across England, Wales, Scotland and Northern Ireland to ensure consistency in keeping the public safe across all parts of the United Kingdom. "
        },
        {
            "text": "We have been working closely with stakeholders and the Devolved Governments throughout the development of this Act.  "
        },
        {
            "text": "Why have we introduced Martyn’s Law? "
        },
        {
            "text": "Since March 2017, Counter Terrorism Policing assesses that there have been 15 domestic terror attacks in the UK (not including Northern Ireland-related terrorism), and security services and law enforcement have together disrupted 43 late-stage plots. "
        },
        {
            "text": "The threat picture is complex, evolving and enduring, with terrorists choosing to attack a broad range of locations. It is not possible to predict where in the UK an attack might happen, or the type of premises or event that could be impacted – either directly as the target of an attack, or indirectly by being located near to the target of an attack.   "
        },
        {
            "text": "Engagement with business indicates that preparedness and protective security in the counter-terrorism space often falls behind areas where there are long-established legal requirements, such as health and safety. The police, security services, and other partners continue to do all they can to combat the terror threat; and many businesses and organisations already do excellent work to improve their security and preparedness. However, the absence of legislative requirements means there is no consistency of consideration or of outcomes achieved. "
        },
        {
            "text": "That is what this Act seeks to address.  "
        }
    ]
}