{
    "url": "https://cyberandspecialistoperationscommand.blog.gov.uk/2025/04/03/sustainability-innovation-and-recognition/",
    "title": "Sustainability, innovation and recognition",
    "authors": [
        "HeatherS"
    ],
    "categories": [
        "Uncategorized"
    ],
    "pub_date": "2025-04-03T09:13:40+01:00",
    "content": [
        {
            "text": "Read about an inspiring journey unfolding at the Defence Academy, where the Climate Change and Sustainability Team led by Lucy Dale, has been making significant strides."
        },
        {
            "text": "Interviewer: Can you tell us about your current role and responsibilities at the Defence Academy?Lucy: I’m Lucy Dale, and I work at the Defence Academy as the Head of Resources. My responsibilities are wide-ranging, from overseeing our IT systems and financial business management to driving sustainability initiatives."
        },
        {
            "text": "One of my key focuses is ensuring we meet our Net Zero targets, which ties directly into improving our estate for both our people and the environment. It’s an incredibly rewarding role, and I absolutely love it."
        },
        {
            "text": "Ian: I am the HQ Defence Academy Resources Chief of Staff reporting directly to 1* Head of Resources Lucy Dale."
        },
        {
            "text": "Interviewer: Congratulations on your team receiving the Commander’s Commendation award! How did it feel to be recognised?Lucy: It was fantastic to be nominated by an organisation outside the Defence Academy. It’s a powerful acknowledgment of the team’s hard work. What stands out to me is that sustainability isn’t part of the team’s core responsibilities. Over the last few years, people have embraced this space simply because they believe in its importance. Also, collaborating with our on-site contractors Serco and ESS has been incredibly rewarding."
        },
        {
            "text": "Seeing the team’s efforts recognised and valued so highly, is truly heartening."
        },
        {
            "text": "Ian: Surprised and obviously very honoured. Although I am named as a member of the team, the recognition is reflected across a larger team, including our partners at Shrivenham who have all contributed hugely to our sustainability initiatives."
        },
        {
            "text": "Interviewer: It’s inspiring that the team took this on. Is there a strong focus on sustainability at the Defence Academy?Lucy: Absolutely. We often talk about three key drivers."
        },
        {
            "text": "First, there’s our moral responsibility as human beings to care for the planet. Second, as Crown Servants, we have a duty to deliver value for money and efficiency across government initiatives. Many of our sustainability ideas align with creating more resilient, cost-effective solutions for the future."
        },
        {
            "text": "Finally, there’s the Defence perspective, which is sometimes overlooked. Sustainability contributes to enhancing Defence capability. By adopting innovative approaches and adapting to extreme environments, we’re building a more capable and resilient Defence. This concept resonates with people—they see how their efforts contribute to something much larger."
        },
        {
            "text": "Ian: There is a strong focus on Climate Change & Sustainability within the Defence Academy, both in terms of physical activity as well as education and personal behaviours."
        },
        {
            "text": "Interviewer: Can you share some of the sustainability initiatives launched at the Defence Academy?Lucy: Certainly! One initiative we’re particularly proud of is a scheme similar to the ‘Boris’ bikes scheme in partnership with Serco. This allows people to cycle around the site instead of relying on cars."
        },
        {
            "text": "We’re also undertaking larger projects. For example, our Single Living Accommodation (SLA) block and Medical Centre are being developed to meet Defence Related Environmental Assessment Methodology (DREAM) Excellent standards, aiming for Net Zero buildings. We’re electrifying heating systems to reduce dependence on natural gas, and our small solar farm is already helping to cut electricity consumption from the grid."
        },
        {
            "text": "Ian: To expand further, the Shrivenham site currently has 5 double Electric Vehicle Charging Points (EVCP), procured, and installed through private finance donated from the Shrivenham Station Officers Mess. With the facility proving very popular. "
        },
        {
            "text": "Another project we brought online was an in-vessel food waste composter within the Shrivenham site. The composter turns food scraps, peelings, left-over food, coffee grounds, compostable packaging and garden waste into very nutrient rich compost, resulting in no food waste leaving the site."
        },
        {
            "text": "This was an ESS funded project, supported by Serco and MOD."
        },
        {
            "text": "Interviewer: What do you hope will come from the team being awarded?Lucy: My hope is that this recognition inspires others to realise they can make a difference. You don’t need to tackle everything at once. Small, meaningful interventions can capture people’s attention and encourage them to rethink their actions."
        },
        {
            "text": "If we can spark that kind of change—where individuals feel empowered to contribute—it will have a massive and lasting impact."
        },
        {
            "text": "Ian: It will provide a great spring in the step to continue to press forward with CC&S initiatives."
        },
        {
            "text": "Congratulations to Lucy Dale, Lieutenant Colonel Ian Lea and Group Captain Simon Brackstone on your well-deserved Commander’s Commendation."
        }
    ]
}