{
    "url": "https://insidehmcts.blog.gov.uk/2025/04/03/the-final-countdown-reflecting-on-the-modernisation-journey-for-courts-and-tribunals/",
    "title": "The Final Countdown: Reflecting on the modernisation journey for courts and tribunals",
    "authors": [
        "HMCTS Communications"
    ],
    "categories": [
        "Civil",
        "Court and tribunal reform",
        "Crime",
        "Digital services",
        "Family",
        "Interviews",
        "Podcast",
        "Tribunals",
        "User experience and research"
    ],
    "pub_date": "2025-04-03T09:45:00+01:00",
    "content": [
        {
            "text": "[English] - [Cymraeg]"
        },
        {
            "text": "Launched in 2016, the HMCTS Reform Programme reaches its formal conclusion at the end of March 2025. It underpins a quiet revolution which has moved our courts and tribunals from paper to digital, stabilised and secured systems and set us up for the 21st century."
        },
        {
            "text": "In this episode, host Aaron Wilson is joined by CEO Nick Goodwin and Operations Director Daniel Flury to reflect on the programme’s impact, key learnings, and what comes next."
        },
        {
            "text": "They discuss the challenges of modernising the justice system, the transition to digital services, and the sensitivities surrounding change, including managing the impacts on staff and justice partners."
        },
        {
            "text": "This candid yet thoughtful conversation acknowledges and thanks the efforts of all involved and looks ahead to the future of continuous improvement."
        },
        {
            "text": "Listen to the latest episode now, available wherever you get your podcasts from!"
        },
        {
            "text": "Amazon"
        },
        {
            "text": "Apple"
        },
        {
            "text": "Buzzsprout"
        },
        {
            "text": "Spotify"
        },
        {
            "text": "A transcript of the podcast is also available."
        },
        {
            "text": "[English] - [Cymraeg]"
        },
        {
            "heading": 1,
            "text": "Diwedd y Daith: myfyrio ar y daith i foderneiddio’r llysoedd a’r tribiwnlysoedd"
        },
        {
            "text": "Cafodd Rhaglen Ddiwygio GLlTEF ei lansio yn 2016, a daeth i ben yn ffurfiol ddiwedd mis Mawrth 2025. Mae’n sail i chwyldro tawel sydd wedi symud ein llysoedd a’n tribiwnlysoedd o bapur i ddigidol, mae wedi sefydlogi a sicrhau systemau ac mae wedi ein sefydlu ar gyfer yr 21ain ganrif."
        },
        {
            "text": "Yn y bennod hon, bydd y gwesteiwr Aaron Wilson yn ymuno â’r Prif Swyddog Gweithredol Nick Goodwin a’r Cyfarwyddwr Gweithrediadau Daniel Flury i fyfyrio ar effaith y rhaglen, y gwersi allweddol, a’r hyn a ddaw nesaf."
        },
        {
            "text": "Maent yn trafod heriau moderneiddio’r system gyfiawnder, y newid i wasanaethau digidol, a’r sensitifrwydd sy’n gysylltiedig â newid, gan gynnwys rheoli’r effeithiau ar staff a phartneriaid cyfiawnder."
        },
        {
            "text": "Mae’r sgwrs onest ond meddylgar hon yn cydnabod ac yn diolch i ymdrechion pawb a gymerodd ran ac yn edrych ymlaen at ddyfodol o welliant parhaus."
        },
        {
            "text": "Gwrandewch ar y bennod ddiweddaraf nawr, ar gael o ble bynnag rydych chi'n gwrando ar eich podlediadau!"
        },
        {
            "text": "Amazon"
        },
        {
            "text": "Apple"
        },
        {
            "text": "Buzzsprout"
        },
        {
            "text": "Spotify"
        },
        {
            "text": "Mae trawsgrifiad o'r podlediad ar gael hefyd."
        }
    ]
}