{
    "url": "https://enablingdigitalidentity.blog.gov.uk/2025/04/03/the-digital-identity-and-attribute-services-register-is-now-in-public-beta/",
    "title": "The digital identity and attribute services register is now in public beta",
    "authors": [
        "John Peart"
    ],
    "categories": [
        "Digital identity",
        "Register of digital identity and attribute services"
    ],
    "pub_date": "2025-04-03T10:00:00+01:00",
    "content": [
        {
            "text": "The register of digital identity and attribute services is now in public beta. This means it’s easier for businesses and the public to check and find trusted digital identity products across the UK.   "
        },
        {
            "heading": 3,
            "text": "Faster and easier"
        },
        {
            "text": "The new register will make it: "
        },
        {
            "heading": 3,
            "text": "The start, not the end"
        },
        {
            "text": "Being in public beta means the register is ready to operate at scale and it does many of the things we need it to do.  "
        },
        {
            "text": "But we’re not done! Up to now we’ve been focused on building a ‘minimum viable product’. Now we’ll be shifting our focus to rapidly iterate and improve upon what we’ve built, so that it can meet more user needs. For example, we’ll be integrating our new trust mark into the register and we’re looking at ways users can be notified when things on the register change. "
        },
        {
            "text": "We’ll also be retiring the old spreadsheet-format list very soon, now that providers have had the opportunity to transfer to this new digital service.  "
        },
        {
            "heading": 3,
            "text": "Join the register"
        },
        {
            "text": "If you are a service provider who would like to join the new register, we’ve created guidance on how to join the register of digital identity and attribute services.    "
        },
        {
            "heading": 3,
            "text": "Tell us what you think "
        },
        {
            "text": "We think that this new digital service is an improvement over what we had before but we know there is more to do to make it great. We’d welcome any feedback on what you think we should do to make the register better for you."
        }
    ]
}