{
    "url": "https://socialworkwithadults.blog.gov.uk/2025/04/03/the-value-of-social-workers-in-healthcare/",
    "title": "The value of social workers in healthcare",
    "authors": [
        "Mark Nicholas",
        "Sarah McClinton"
    ],
    "categories": [
        "Care and support",
        "Communities",
        "Knowledge and skills",
        "Recognition",
        "Society",
        "Viewpoint"
    ],
    "pub_date": "2025-04-03T08:28:06+00:00",
    "content": [
        {
            "text": "When I first qualified as a social worker, career paths were relatively restricted – received wisdom was that you did a couple of years in children’s social care (preferably child protection) before specialising in either adults (including mental health) or children’s social work. Non statutory social work and independent social work were rare destinations for newly qualified staff and work in any other settings was almost unheard of."
        },
        {
            "text": "Things have changed significantly since then: we now have both better recognition of existing settings for social work and new settings opening up. Headteachers I speak to greatly value their school social workers and the work of hospice social workers (as I know personally, from the loss of my father in law earlier this year) is incredibly compassionate and comforting to those at the end of their lives and their families. Some of the most skilled social workers I’ve met are Approved Mental Health Professionals (AMHPs) and now GP practices are increasingly interested in employing their own social workers."
        },
        {
            "text": "To me, this represents a broader recognition of the valuable contribution social work can make across society. But what is it about social work that has led to an increase in career paths in these areas? My own career has been spent approximately 1/3 in children’s social work, 1/3 in adult social work and 1/3 in the NHS, so have been keen to reflect on this question. Social work training and practice focus on the importance of working in a person-centred, relational, participatory, strengths-based way that is strongly influenced by principles of social justice. When I first worked in the NHS, these were not phrases I generally heard my clinical colleagues using, but now they have much greater currency in the organisation and I think mean that social workers can bring a valuable diversity of thought, experience, skills and ideas to our besieged, but much loved, healthcare system. In my first social work placement in a hospital team, we were working in the NHS, but seconded from the local authority, which meant we were not considered a core profession in the NHS. "
        },
        {
            "text": "Now, there are over 4000 social workers employed directly by the NHS, mainly in mental health, but also in a range of other roles, which makes us a significant part of the NHS workforce. Most of our clinical colleagues have been welcoming of this influx of social workers – certainly, my own team of medics, nurses, pharmacists, physios, OTs, etc. could not have been more supportive to their lone social worker! – but healthcare organisations can be slow to recognise the change in workforce composition. For example, there is no universal recognition among healthcare employers that social workers are clinician equivalents and should be treated as such in relation to access to records, training and professional development. "
        },
        {
            "text": "In time, I’m sure such problems will be resolved and the recently established NHS Social Work Leaders Network is actively working to do so. This will allow us as professionals to fully apply our diverse mindset and skills to help change the NHS for the better."
        }
    ]
}