{
    "url": "https://forestrycommission.blog.gov.uk/2025/04/03/three-reasons-why-england-needs-more-conifer-planting/",
    "title": "Three reasons why England needs more conifer planting",
    "authors": [
        "Ian Tubby"
    ],
    "categories": [
        "Tree planting",
        "Woodland creation"
    ],
    "pub_date": "2025-04-03T10:25:00+01:00",
    "content": [
        {
            "text": "There is still a perception that the Forestry Commission is ‘anti-conifer’ and is focused on broadleaf woodland creation. This couldn’t be further from the truth and fundamentally we need more of all types of woodland.  "
        },
        {
            "text": "Firstly, I want to open with some positive news. Rates of woodland creation have more than doubled in the last three years, and early signs show that 2025 could see the most woodland planted in England in over 25 years."
        },
        {
            "heading": 2,
            "text": "Application trends"
        },
        {
            "text": "Interestingly, around 40% of England Woodland Creation Offer (EWCO) applications and agreements are for woodlands of between one and three hectares (ha). These woodlands account for less than 10% of the total area of new woodland. Whereas ~20% are for woodlands larger than 10ha which account for about 65% of new woodland area.  "
        },
        {
            "text": "In terms of species used, about 90% of woodland planted in 2023-24 was broadleaf (4110ha) and around 10% conifer (430ha).1 This shows our current grant offer is clearly appealing to landowners and there is a very strong demand for small broadleaf woodlands."
        },
        {
            "text": "This is excellent news in terms of progress towards habitat creation targets. We want to see more than 105,000ha of broadleaf woodlands planted by 2042 and we are just about on course to do this if current trends continue."
        },
        {
            "heading": 2,
            "text": "1. Planting conifer can help hit environmental net zero targets"
        },
        {
            "text": "That said, the current mix of woodlands being planted and the modest scheme sizes mean that we are behind when it comes to climate change mitigation and net zero.  "
        },
        {
            "text": "Of course we need more woodland planted full stop but specifically, we need more conifer planted. Why? Because conifer grows fast and stores lots of carbon quickly. The statutory tree planting target assumes that we need to plant at least 30% conifer or other fast-growing species to meet carbon capture targets. "
        },
        {
            "text": "For instance, 10ha of Douglas fir (a popular coniferous tree that grows well in the UK) planted today would produce around 4,000 (4180) m3 of stem wood (a measure of wood from the stem alone, excluding branches) by 2050. This would contain around 820 tonnes of carbon (3,009 tonnes of CO2). Compared to 10ha of oak that would produce around 1,300m3 of stem wood containing 364 tonnes of carbon (1,336 tonnes of CO2) in the same period.2"
        },
        {
            "text": "The difference in carbon (1,673 tonnes of CO2) stored between the two species is equivalent to the emissions from driving a modern diesel car 16.7 million kilometres!3"
        },
        {
            "text": "This example suggests that conifers need 55% less land than broadleaves to capture similar levels of carbon. Therefore, from a net zero viewpoint, planting conifer spares more land than broadleaf woodland and this efficiency is an increasingly important subject as competition for land for food production, energy production, nature recovery and house building intensify."
        },
        {
            "heading": 2,
            "text": "2. Home-grown conifer can bolster UK timber security and protect forests worldwide"
        },
        {
            "text": "Food security is understandably a hot topic – we produce around 60% of the food we consume by value4 and are the fifth largest importer in the world.5 In contrast, timber security is often overlooked in land use discussions, but as the second largest importer, this is a key reason why we need to increase the area of conifer planted."
        },
        {
            "text": "Timber security is a growing issue as supplies throughout the northern hemisphere are disrupted and constrained by outbreaks of insect pests such as Ips typographus, diseases including ash dieback and increasing incidences of wildfire, storm force winds and drought. Global demand for wood is set to increase as the population grows and more governments and businesses design policies to make better use of low carbon building materials, including timber.  "
        },
        {
            "text": "The UK is particularly exposed to global supply and demand we import around 73% of the wood it consumes each year from overseas forests. We remain one of the least forested countries in Europe and although the net area of woodland continues to grow in England, the area of conifer woodland is in decline, with statistics showing the area has dropped from by 14% from 356,000ha in 2007 to 305,000ha in 2024.  "
        },
        {
            "text": "A 14% loss of broadleaf woodland would have rightly triggered protest and concern, but the decline in conifer has largely gone unnoticed. While causes of this decline include habitat restoration and restructuring woodlands to meet improved forestry standards, reducing the area and volume of conifer will have impacts on local timber security and carbon stocks."
        },
        {
            "text": "Although we will never be self-sufficient in timber supply, we need to make every effort to reduce our footprint on the global forest resource, whilst ensuring domestic food production is not negatively impacted. Conifer woodlands also have a part to play in nature recovery, as illustrated by the recent discovery of a red squirrel population in a Sitka spruce plantation in Yorkshire.6"
        },
        {
            "heading": 2,
            "text": "3. Planting conifer can strengthen the economy"
        },
        {
            "text": "Timber is the ultimate sustainable, carbon negative, waste free, recyclable material – the exemplar of a circular economy. More conifer woodlands will increase the contribution timber production and processing makes to the economy."
        },
        {
            "heading": 3,
            "text": "Meeting market demand and strengthening supply chains"
        },
        {
            "text": "The timber properties of conifer are particularly well suited to modern markets and construction techniques. Softwood (produced from conifer) is light, durable and easy to work. Growing large volumes of tall, straight conifer is generally less labour intensive and quicker than growing good quality hardwood (produced from broadleaf).  "
        },
        {
            "text": "Most softwood that is harvested in the UK is sold to sawmills whose products often have long service lives, locking up carbon for decades, if not centuries, before being recycled or used to generate heat and power. Softwood that is not suitable for sawmills, perhaps because of size or form, is used by panel board mills, as well as supplying paperboard and energy markets.  "
        },
        {
            "text": "With current policy aiming at increasing the number of homes built each year, the demand for softwood products will significantly increase in the short term, which could further benefit UK supply chains and woodland owners economically."
        },
        {
            "heading": 3,
            "text": "A growing industry with long-term prospects"
        },
        {
            "text": "Softwood timber production has increased steadily since the 1970s, attracting international investment from the likes of Iggesund and Egger, who produce high value paper board and wood panel products from softwood. "
        },
        {
            "text": "While giving confidence to domestic companies such as James Jones to invest in new sawmills, supplying products to the construction sector as well as the wood pallet that is an essential part of UK and international trade infrastructure. These companies and the dozens of wood processors like them, are important rural employers and their supply chains sustain thousands of jobs from tree planters to house builders.  "
        },
        {
            "text": "We know consumers and processors will need to adapt to a wider range of tree species over time, as foresters respond to changing climate and pest and disease pressures. "
        },
        {
            "text": "Future timber products might look and feel a little different but these products will perform the same function, and it is likely that well managed softwood timber will remain the bread and butter of the timber processing industry for decades to come."
        },
        {
            "heading": 2,
            "text": "How EWCO and financial incentives support conifer woodland"
        },
        {
            "text": "Back to the here and now, while we’re seeing large proportions of broadleaf woodlands planted, grants like EWCO pay the same basic rate regardless of species planted. Land managers seeking the nature recovery additional contribution, worth up to £3,300 per ha, can also include up to 20% non-native or naturalised species in the compartments of native woodland they will plant for nature recovery. "
        },
        {
            "text": "This could allow schemes to generate income from timber production and use non-native species in situations as nurse crops (trees planted to protect primary trees during infancy), though land managers need to ensure the management of the nurse component won’t compromise the objective of the grant payments. "
        },
        {
            "text": "Feedback from agents and owners generally suggests that grants are the most generous in recent years. They note that it is sometimes cheaper to buy conifer planting stock than broadleaf species and that establishment costs associated with conifer are often lower than for broadleaf."
        },
        {
            "text": "Because of typically faster growth rates, planting conifer often provides some early income from the sale of thinnings. Longer term, the capital value of conifer woodlands can increase as timber volumes grow and there is a healthy market for woodlands containing a significant proportion of conifer."
        },
        {
            "heading": 2,
            "text": "Future ambitions for forestry"
        },
        {
            "text": "We know that barriers to conifer woodland creation are difficult to deconstruct. Land values and the stacking and bundling of income from government grants, carbon markets and payments for ecosystem services can be complex."
        },
        {
            "text": "We don’t yet have the key that will unlock the establishment of larger, timber production focused woodlands that we need to hit net zero, improve our timber security and contribute to economic growth, but we are heading in the right direction.  "
        },
        {
            "text": "In an increasingly tight financial situation, we need solutions that don’t increase grant dependency and increase burden to the taxpayer. We also need to find solutions whilst simultaneously encouraging more broadleaf woodland creation, more natural colonisation (trees naturally seed into surrounding open habitat), more agroforestry (the integration of trees into farming systems), more riparian woodland creation (trees planted along watercourses) and the restoration of habitats that were planted up with conifer in times past.  "
        },
        {
            "text": "This is a tall order and something we look forward to working on with others throughout what I’m sure will be a busy 2025. "
        },
        {
            "text": "All images are Crown copyright with the exception of the red squirrel image which was sourced from Pixabay."
        }
    ]
}