{
    "url": "https://defrafarming.blog.gov.uk/2023/12/27/arable-and-horticulture-webinar-follow-up/",
    "title": "Arable and Horticulture webinar follow up",
    "authors": [
        "Becky Briggs"
    ],
    "categories": [
        "Conversations we're having"
    ],
    "pub_date": "2023-12-27T12:09:36+00:00",
    "content": [
        {
            "text": "We recently held a webinar for arable and horticulture farmers. Our aim was to go through the 2023 Sustainable Farming Incentive offer for those farm types and answer your questions.  "
        },
        {
            "text": "You can watch a recording of the webinar."
        },
        {
            "text": "We want to make sure that these webinars are designed and delivered in a way that presents the information clearly and in an engaging way, so we encourage feedback. "
        },
        {
            "text": "Once a webinar is over, we’ll publish a follow up post like this one. In it, we’ll summarise the top-voted questions with responses. "
        },
        {
            "text": "And, if you’ve read the guidance and still have questions, we’ll set out the best ways for you to get answers as quickly as possible. "
        },
        {
            "text": " "
        },
        {
            "heading": 2,
            "text": "Top themes "
        },
        {
            "heading": 3,
            "text": "Applying for SFI: who can apply and when "
        },
        {
            "text": " At the moment, anyone eligible for BPS can apply for an SFI agreement. This is because their details are already registered with the RPA. In future, we’ll allow a wider range of farmers to apply. We’re encouraging those who are eligible not to wait to start their SFI agreement. Check your eligibility for an SFI agreement. "
        },
        {
            "heading": 3,
            "text": "Adding further actions to your SFI agreement "
        },
        {
            "text": "It is possible to add actions to your agreement, but you’ll need to contact the RPA to discuss this.  An SFI agreement lasts for 3 years from its start date. It can be ‘upgraded’ annually to add more actions and eligible land. "
        },
        {
            "heading": 3,
            "text": "SFI and Countryside Stewardship "
        },
        {
            "text": "You can be in more than one scheme – so long as the actions you commit to are compatible and we’re not paying for the same actions twice. "
        },
        {
            "text": "In future, you won’t have to navigate multiple schemes and forms to access payments. You’ll be able to access the Sustainable Farming Incentive and Countryside Stewardship in a single, simple service that shows all the available options in one place. In the meantime, in the SFI guidance for each action, you’ll find a table showing CS and ES options and their compatibility with each SFI action.  "
        },
        {
            "text": "After 2024, when the full and updated scope of the SFI and CS offers are available, we plan to review our schemes and payment rates on a regular, systematic basis so that they continue to deliver the intended outcomes, work for farmers, and provide value for money. We will set out our planned approach to this soon. "
        },
        {
            "heading": 3,
            "text": "Payments for integrated pest management "
        },
        {
            "text": "There are four SFI actions for integrated pest management (IPM) available to farmers, including organic farmers. These are IPM1 in which a BASIS qualified adviser must assess your current approach to pest, weed and disease management and help you produce a plan.  This pays £989 per agreement.   "
        },
        {
            "text": "IPM2 is for flower-rich grass margins, blocks, or in-field strips which pays £673 per ha.  IPM3 is for companion cropping on arable and horticultural land and includes establishing a companion crop by trap cropping, inter-cropping, or undersowing. This pays £55 per ha.   "
        },
        {
            "text": "IPM4 is for no use of insecticide on arable crops and permanent crops which pays £45 per ha.  IPM4 requires you not to apply any plant protection products containing insecticide, including seed dressings, on land entered into this action.  You can apply other plant protection products such as herbicides, fungicides or plant regulators on land entered into IPM4. You can also use molluscicides, such as slug pellets. "
        },
        {
            "text": "Some asked if IPM4 can be applied to part of a field if for example you have buffer strips around the outside.  You can add IPM4 and other SFI actions (such as buffer strip actions) to the same parcel. If you also have CS in that parcel, then it is best to check the compatibility of your CS options against the new SFI actions. "
        },
        {
            "heading": 3,
            "text": "Payments for nutrient management "
        },
        {
            "text": "There are three SFI actions for nutrient management which you may like to consider. These are NUM1 in which you must arrange for a FACTS qualified adviser to assess nutrient management on your farm and help you produce a review report.  You’ll receive £589 for this action. "
        },
        {
            "text": "NUM2 you can get payment for establishing and maintaining legumes on improved grassland which is £102 per hectare per year. "
        },
        {
            "text": "NUM3 you can be paid for a legume fallow to produce areas of flowering plants from late spring and during the summer months. This is a rotational option and pays £593 per hectare per year. "
        },
        {
            "text": "Some asked how long NUM3 must be in the ground and when you have to drill it by.  This action is rotational so you can do it on the same area of eligible land each year of your 3-year SFI agreement, or you can move the area each year. There is no specific drilling date, but if you are rotating the action each year, you must do it for a period of time that could reasonably be expected to achieve this action’s aim - which is that there’s a legume fallow that produces areas of flowering plants from late spring and during the summer months. "
        },
        {
            "text": "You can apply for this action on either the total SFI available area in each land parcel shown in your SFI application, or part of that area. "
        },
        {
            "heading": 3,
            "text": "Payments for hedgerow management "
        },
        {
            "text": "There are three hedgerow actions: assess and record the condition of your hedgerows (HRW1) at £3 per 100m for one side, management of hedgerows (HRW2) at £10 per 100m for one’s side and maintain or establish hedgerow trees (HRW3) at £10 per 100m both sides. All three actions can be done alongside each other, with all CS management options (with the exception that HRW2 cannot be done with CS BE3), and all ES revenue offers. "
        },
        {
            "text": "A few people have asked about the payment for hedgerows as they relate to sides and lengths.  The actions are either paid per 100m for one side of the hedgerow or per 100 m for both sides. If you have management control over both sides of the hedgerow, then you can claim for both sides. Alternatively, if you have management control of only one side, you can only claim for the side you have control over. For example, if you have management control of both sides of the hedgerow and wish to apply for all 3 actions you would get: "
        },
        {
            "text": "HRW1: £3 per 100m x 2 = £6 per 100m both sides "
        },
        {
            "text": "HRW2: £10 per 100m x2 = £20 per 100m both sides "
        },
        {
            "text": "HRW3: £10 per 100m both sides "
        },
        {
            "text": "Giving you a total of £26 per 100m "
        },
        {
            "text": "Some people in the webinar queried how the management payment was calculated.  Areas under HRW actions are converted from metres to a notional ha for the management payment calculations. HRW1 and HRW2 both have a notional ha of 0.0005ha per metre and HRW3 has a notional ha of 0.0010ha per metre (difference being that HRW1 and HRW2 only pertain to one side of a hedge – whilst HRW3 covers both sides). If there are multiple HRW actions taken on a parcel, the HRW action with the greatest notional ha is used to count towards the management payment. As the HRW actions are boundary actions, this calculation is separate from any “in parcel” SFI actions.  "
        },
        {
            "text": "Finally, we have had some questions about identifying hedgerows on digital maps. Once your SFI agreement starts, you may be asked to submit an RLE1 form and sketch map if no hedgerows are shown on your digital maps for the relevant land parcel. You do not need to check your hedgerows on your digital maps before you apply for the SFI actions for hedgerows.  "
        },
        {
            "text": "Read the full guidance for hedgerow actions.   "
        },
        {
            "heading": 3,
            "text": "Payments for grassland actions "
        },
        {
            "text": "There are 2 low-input grassland actions for which you can be paid. You can manage grassland with very low nutrient inputs (outside SDAs). This SFI action is LIG1. You’ll receive £151 per hectare (ha) per year.  The other is an action to manage grassland with very low nutrient inputs (SDAs). This action is LIG2. The guidance for LIG1 AND LIG2 explains each action in detail. LIG1 and LIG2 have the same payment rate. "
        },
        {
            "text": "A few people asked when there would be more actions available for permanent grassland, species rich grassland and semi-improved grassland.  Through CS we currently pay for a number of grassland options including species rich grassland and we are working on these offers to improve them where possible. We aim to publish more details on these in the new year.  "
        },
        {
            "text": "For those who asked about the use of legumes, we can confirm they are not compatible with low input grassland actions because they are targeted at improved grassland where there is little species diversity. Low input grassland includes species rich grasslands that would be damaged if over sown with clovers.   "
        },
        {
            "text": "If you are thinking about stacking actions, GS2/LIG1 and NUM2 are incompatible with each other and cannot be stacked as this would represent incompatible funding. This is because GS2/LIG1 is payment for maintenance of areas of grass and NUM2 for areas of legumes. This is mirrored in existing CS with GS4: legumes and herb rich swards being incompatible with GS2. "
        },
        {
            "text": " "
        },
        {
            "heading": 2,
            "text": "Other actions to consider: "
        },
        {
            "heading": 3,
            "text": "Payments for farm wildlife on arable and horticultural land "
        },
        {
            "text": "If you establish and maintain a pollen and nectar flower mix, you’ll receive £614 per hectare per year.  This action is AHL1 and aims to produce areas of flowering plants from late spring and during the summer months to provide food for beneficial pollinators and encourage natural crop pest predators as part of an IPM approach. "
        },
        {
            "text": "If you establish and maintain areas of winter bird food that produce a supply of small seeds for smaller farmland birds from late autumn until late winter, you’ll receive £732 per hectare per year.  This action is AHL2.  To establish the winter bird food blocks or strips, you must sow a mix of at least 6 crops that will provide an extended supply of small seeds for farmland birds.  You must manage them in a way that could reasonably be expected to achieve this action’s aim of producing a supply of small seeds for smaller farmland birds from late autumn until late winter. The mix you sow must not include any of the following crops, because these are not appropriate for the smaller farmland bird species this action is intended to support:  "
        },
        {
            "text": "You can receive £590 per hectare per year if you establish and maintain grassy field corners or blocks on arable and horticultural land.  This action AHL3​.  To establish the grassy field corners or blocks you must either sow them or allow the areas to naturally regenerate.   "
        },
        {
            "heading": 3,
            "text": "Payments for soil actions "
        },
        {
            "text": "If you assess your soil, produce a soil management plan and test the organic matter in your soil, you’ll receive £5.80 per hectare (ha) and £95 per SFI agreement per year. This SFI action is SAM1. "
        },
        {
            "text": "If you establish multi-species cover crop over the winter months, you’ll receive £129 per hectare per year. This SFI action is SAM2. "
        },
        {
            "text": "If you establish and maintain herbal leys with a mixture of grasses, legumes, and herbs, you’ll receive £382 per hectare per year. This SFI action is SAM3.  "
        },
        {
            "text": "The guidance for each action, linked above, shows which actions are compatible with Countryside Stewardship and Environmental Stewardship.   "
        },
        {
            "heading": 3,
            "text": "Payments for buffer strips "
        },
        {
            "text": "If you establish a 4m to 12m grass buffer strip on improved grassland, you’ll receive £235 per hectare per year for the total area of land you choose to enter. This SFI action is IGL3. The guidance sets out compatibility with CS and ES.  "
        },
        {
            "heading": 3,
            "text": "Payments for farming in protected landscapes "
        },
        {
            "text": "Through the Farming in Protected Landscapes programme, farmers and land managers can get funding to deliver projects in National Landscapes (formerly Areas of Outstanding Natural Beauty), National Parks and the Broads.   "
        },
        {
            "heading": 3,
            "text": "Apply for an Improving Farm Productivity grant "
        },
        {
            "text": "In the New Year, the  Improving Farm Productivity grant will open to horticultural and arable businesses.  The grant pays for capital items including robotic, automatic and solar equipment that improve farm and horticulture productivity. We recently published a post giving an overview of the grant.  "
        },
        {
            "text": " "
        },
        {
            "heading": 2,
            "text": "Where to next? "
        },
        {
            "text": "If you’re totally new to the Sustainable Farming Incentive offer or thinking of adding more actions to your existing agreement and want to learn more, visit our dedicated SFI site on GOV.UK. "
        },
        {
            "text": "The SFI Handbook for the 2023 offer sets out the official guidance in a single PDF document. The official SFI guidance is also presented in individual, accessible webpages on GOV.UK. "
        },
        {
            "text": "If you want to talk to someone about your application, the RPA has a dedicated team in place to help.  "
        },
        {
            "text": "If you’d like an independent adviser to talk you through the complete farming offer for free, you can find a local adviser in your area and make direct contact. Defra is paying these advisers to give farmers support through the agricultural transition. This is called the Farming Resilience Fund.  "
        },
        {
            "text": "The best place to see all the funding opportunities for farmers in England is Funding for farmers and land managers on GOV.UK.  "
        },
        {
            "text": "Through Countryside Stewardship, you can get funding to protect and improve the land you manage. You can have an SFI agreement and a CS agreement at the same time - you just won’t be paid twice for carrying out the same action. You can also apply for CS grants. Find them all by using the CS grant finder on GOV.UK. "
        },
        {
            "text": "Earlier this year, we created a single page on GOV.UK called ‘Rules for farmers and land managers’. This page groups together rules for farmers in England in one place. It’s arranged in a more intuitive way, by the activities that you do. For example, using pest control products. "
        },
        {
            "text": "We’ll always let you know when new funding is available to farmers in England, so subscribe to the Farming blog. Every time we publish a post about our work or a new funding opportunity, you’ll get an email notification. We tend to publish posts twice a week.  "
        },
        {
            "text": "Finally, if you have a question about our work or suggestions, please leave a message in the comments section. "
        }
    ]
}