{
    "url": "https://gfie.blog.gov.uk/2023/12/27/opening-a-wealth-of-opportunities-for-a-successful-career-in-the-civil-service/",
    "title": "Opening a wealth of opportunities for a successful career in the civil service.",
    "authors": [
        "karlharvey1"
    ],
    "categories": [
        "#GFIEsuccessstory",
        "Life Chances",
        "Movement to Work"
    ],
    "pub_date": "2023-12-27T09:00:51+00:00",
    "content": [
        {
            "text": "The Civil Service currently has over 20 Going Forward into Employment (GFiE) Life Chance Schemes in operation across Government, using innovative approaches to recruitment and providing Individuals from a wide range of backgrounds, who face barriers to employment, with opportunities and experience."
        },
        {
            "text": "In this blog edition, we introduce you to the Movement to Work in the Civil Service Recruitment Scheme led by the Department for Work and Pensions."
        },
        {
            "heading": 2,
            "text": "What is Movement to Work?"
        },
        {
            "text": "Movement to Work is a charity coalition of many of the UK’s leading employers, civil society, and government."
        },
        {
            "text": "The DWP was a founding member of Movement to Work in 2013. Since then, the initiative has been rolled out across government departments and the Civil Service is one of the largest providers of work placement opportunities for young people."
        },
        {
            "text": "Building Movement to Work placements into the talent pipeline for apprenticeships and entry-level recruitment helps fulfil the Civil Service commitment to be representative of the communities it serves."
        },
        {
            "heading": 2,
            "text": "What is 'Movement to Work Recruitment in the Civil Service'?"
        },
        {
            "text": "In November 2023 DWP were given accreditation to run ‘Movement to work Recruitment’ as a Going Forward into Employment (GFiE) Life Chances Scheme across the Civil Service. "
        },
        {
            "text": "The ‘Movement to Work Recruitment' scheme is a two-week work experience placement within the Civil Service that can potentially lead to a temporary fixed term appointment role for up to 24 months and the possibility of permanent employment at 12 months."
        },
        {
            "heading": 3,
            "text": "Eligibility Criteria"
        },
        {
            "text": "Within the Civil Service the scheme has been designed to give young people the opportunity to experience what it would be like to work within the Civil Service. "
        },
        {
            "text": "Candidates must be:"
        },
        {
            "heading": 3,
            "text": "How does this scheme make a difference?"
        },
        {
            "text": "The scheme aims to provide young people with a meaningful experience in the Civil Service.  To support individuals to gain the essential skills, they need to demonstrate their potential and break the vicious ‘no experience – no job’ cycle which can prevent them from stepping onto the career ladder. "
        },
        {
            "heading": 2,
            "text": "Yusuf’s Story "
        },
        {
            "heading": 3,
            "text": "Movement to Work across the Civil Service"
        },
        {
            "heading": 3,
            "text": "How and when can individuals apply for the scheme?"
        },
        {
            "text": "Placements will be advertised through local job centres and interested young people will be encouraged to speak to their work coach."
        },
        {
            "heading": 3,
            "text": "How Civil Service Departments can get involved:"
        },
        {
            "text": "In November 2023 DWP were given accreditation to run ‘Movement to work Recruitment in the Civil Service’ as a GFiE Life Chances Scheme across the Civil Service.  DWP would like to pilot and evaluate the programme early in 2024, before inviting other government departments to participate."
        },
        {
            "heading": 3,
            "text": "Life Chance Schemes"
        },
        {
            "text": "If you want to know more about our other GFiE Life Chance Schemes; or you would like to discuss providing life changing opportunities to individuals through use of the schemes for vacancies you have coming up, please get in contact with the GfiE Team at GFiE@cabinetoffice.gov.uk"
        }
    ]
}