{
    "url": "https://insideDIO.blog.gov.uk/2025/02/11/celebrating-women-in-science/",
    "title": "Celebrating women in science",
    "authors": [
        "Begonia Pedreira-Regueira"
    ],
    "categories": [
        "Climate Change",
        "Environment and Ecology",
        "Working at DIO"
    ],
    "pub_date": "2025-02-11T16:29:55+00:00",
    "content": [
        {
            "text": "11 February marks the International Day of Women and Girls in Science.   DIO’s Senior Climate Resilience manager, Begonia Pedreira-Regueira, reflects on how she has been celebrating the day and championing the principles it stands for."
        },
        {
            "text": "Part of me cannot believe that we are in the 21st century and women and girls are still underrepresented in science, technology, engineering, and mathematics (STEM) fields, not only globally but also in the UK."
        },
        {
            "text": "Although numbers of female and non-binary STEM students have been increasing in recent years, according to the STEM Women Whitepaper 2024, there is still a low representation of women in STEM within Higher Education that then impacts the workforce representation, with just 26% of the overall UK STEM workforce being female. Further afield, the Massachusetts Institute of Technology reports that it's 24% in the United States and 17% in the European Union. "
        },
        {
            "text": "Greater effort is required to encourage and support women – especially those from underrepresented groups – to study STEM subjects, transition into the workforce and become future leaders in STEM."
        },
        {
            "heading": 2,
            "text": "The importance of role models"
        },
        {
            "text": "I work as DIO Technical Services’ Senior Climate Resilience Manager. My team is at the forefront of the MOD’s efforts to use science to predict, and mitigate against, the risks to our estate, people and operations exacerbated and/or caused by climate change."
        },
        {
            "text": "For about five years, I’ve been volunteering with local schools as an inspirational STEM role model to encourage young girls and other children from underrepresented backgrounds to pursue careers in STEM. Part of what I do is to talk about my career journey, as well as my love of science and maths. I want STEM to be as exciting for the pupils as it is for me, and for them to see themselves as future scientists, despite barriers they may face."
        },
        {
            "text": "I tell them not to worry if they aren’t good with numbers – if they keep practising, it’ll become easier, even fun! I also reassure the pupils that other skills are important too, such as being creative. And, above all, that it is important to work as a team as we are all unique and all opinions count.I explain to the pupils how diverse and inclusive teams contribute to innovation, climate resilience and wider sustainability."
        },
        {
            "text": "I emphasise how versatile their career prospects can be, and how rewarding it is to dedicate STEM skills towards a cause such as climate resilience.  "
        },
        {
            "heading": 2,
            "text": "Changing attitudes"
        },
        {
            "text": "Being a visible female STEM role model is an important way to inspire children, give them purpose and challenge stereotypes. STEM fields require skills which are more commonly associated with men, and that can affect girls’ and women’s sense of belonging."
        },
        {
            "text": "However, I was born a mathematician and a scientist – there is no doubt about it. Since I was a very young kid, I loved anything numerical and resolving formula and equations. I dreamt of going to university and using my skills to help protect the environment. I was lucky to get the support I needed not just to go to university but also to move to the UK, where I completed an Environmental Science BSc at the University of Southwest England in 2006. Despite it being the 2000s, there were only four women in my class of around 24."
        },
        {
            "text": "I was generally treated with respect during my university years; however, this has been a different story for many women who have negative experiences including microaggressions and/or discrimination during their academic journey, which then affects the number of women that end graduating. And I find relatable an example from the STEM Women Whitepaper 2024, where an individual states that they get comments like “why would a beautiful girl like you choose to study mathematics”."
        },
        {
            "text": "The BSc gave me the opportunity to do a student placement year with what is now the DIO Technical Services Ecology team. While I was doing a lot of data processing and statistical analysis at the time, the experience also exposed me to the MOD’s vast and varied estate, and I fell in love not just with the estate but also with working for Defence."
        },
        {
            "text": "There are still occasions where attitudes need to be challenged. I can recall once being told by a colleague from a different team that I don’t look like a scientist – that I look too good and too stylish to be a scientist. I was a bit offended, and a bit in shock. Do scientists have ‘a look’?"
        },
        {
            "text": "But overall, my experience in DIO has been great. The modern approach to flexible working was especially important after becoming a mum, as was the availability of a nursery at MOD Abbey Wood, both of which helped me to achieve a good work-life balance."
        },
        {
            "heading": 2,
            "text": "The benefits of diversity"
        },
        {
            "text": "For me, diversity and inclusion are as important as biodiversity, and are key to our efforts in building climate resilience and wider sustainability. Empowering women in STEM is part of this, as the more diverse our teams are, the stronger we are and the better our outputs will be."
        }
    ]
}