{
    "url": "https://marinedevelopments.blog.gov.uk/2025/02/11/coastal-planner-corner-3/",
    "title": "Coastal Planner Corner",
    "authors": [
        "Charlotte Stadden, Coastal Marine Planner (South)",
        "Mae van Loaf, Coastal Marine Planner (South West)",
        "Ellie Hoad, Coastal Marine Planner (South West)",
        "Chloe Boyle, Marine Planner"
    ],
    "categories": [
        "marine planning"
    ],
    "pub_date": "2025-02-11T10:05:19+00:00",
    "content": [
        {
            "text": "The MMO has marine planners based around the English coast. Their role is to engage with you for the development, implementation, and monitoring of marine plans. You can find out who your local coastal planner is and their contact details here."
        },
        {
            "text": "Over the past few months, our coastal planners have been busy delivering marine plan user training sessions. These sessions provided stakeholders with a clearer understanding of marine plans and how to apply them effectively in decision-making. A huge thank you to all stakeholders who attended and the delivery partners who supported the sessions."
        },
        {
            "text": "North East"
        },
        {
            "text": "Local plans across Gateshead, Newcastle, South Tyneside, North Yorkshire, and Middlesbrough are being revised, presenting a key opportunity to align marine and land-use planning. Kathleen has initiated meetings with these councils to promote a shared vision and support the incorporation of marine plan policies into their local frameworks. Early collaboration in the planning process is crucial for achieving consistency across land and sea."
        },
        {
            "text": "East"
        },
        {
            "text": "Mark and Char have been delivering successful in-person external stakeholder workshops for the Issues with Supporting Evidence (IwSE) stage of the East Marine Plan replacement. They have played a key role in recording, analysing, and incorporating stakeholder input on key issues and supporting evidence raised during these sessions. They have also attended key stakeholder meetings across the East, providing critical updates that feed into the plan’s development."
        },
        {
            "text": "Char, alongside Michelle and Georgie, delivered an in-person marine plan user training session in the East to key stakeholders, including Sizewell C, local authorities, and port authorities."
        },
        {
            "text": "South East"
        },
        {
            "text": "Marie attended the Kent and Medway Local Nature Recovery Strategy (LNRS) team’s ‘Making Space for Nature’ briefing for government agencies, which outlined their draft LNRS, which is now open for public consultation. LNRS is a critical new tool for driving the national ambition to increase species abundance and reduce the risk of extinctions. Marie contributed to the evidence and data gathering phases of the LNRS development. "
        },
        {
            "text": "Marie also facilitated an in-person marine plan user training session in Chatham, Kent, in collaboration with the Thames Estuary Partnership."
        },
        {
            "text": "South"
        },
        {
            "text": "Charlotte has been involved with the marine plan user training sessions, including an in-person session supported by the Solent Forum, held in Portsmouth. Attendees included members from harbour authorities, Historic England, the Environment Agency, council officers, marine consultancy firms, recreational groups and maritime regulators."
        },
        {
            "text": "In November, Charlotte and Kirstyn held a successful Marine Spatial Planning game session with Portsmouth University, engaging students in the importance of marine planning."
        },
        {
            "text": "We are pleased to welcome Eva as the new South East Marine Planner. Eva will cover the eastern extent of the South Marine Plan area, from the River Hamble in Hampshire to Folkestone in Kent."
        },
        {
            "text": "South West"
        },
        {
            "text": "In November, Mae presented at a conference hosted by the Cornwall & Isles of Scilly Marine and Coastal Partnership, focusing on collaboration. Mae’s presentation provided a high-level overview of marine planning, setting the stage for discussions on local-level planning and nested marine plans. The event highlighted the vital role of collaboration and knowledge sharing in the local community."
        },
        {
            "text": "Ellie and Mae also delivered an external marine plan user training session in Plymouth which was supported by the Devon Maritime Forum."
        },
        {
            "text": "Ellie and Mae hosted Marine Spatial Planning games for MSc students at the University of Exeter and graduate Planning Officers at Somerset Council. These sessions enhanced facilitation skills and broadened perspectives on Marine Spatial Planning."
        },
        {
            "text": "North West"
        },
        {
            "text": "Over the winter, Chloe led an in-person marine plan user training session, in collaboration with the Solway Firth Partnership. She also facilitated and supported online sessions, including a guidance material and tools session. She would like to thank to all attendees, particularly Lancaster council, for engaging with the marine planning team to align local and marine plan policies during their local plan review."
        },
        {
            "text": "Looking ahead, Chloe is preparing for Marine Spatial Planning Challenge games, which are expected to take place in spring."
        }
    ]
}