{
    "url": "https://rpc.blog.gov.uk/2025/02/11/defra-improves-performance-on-post-implementation-reviews-but-other-departments-lag-behind/",
    "title": "Defra improves performance on Post Implementation Reviews, but other departments lag behind",
    "authors": [
        "Stephen Gibson"
    ],
    "categories": [
        "Better regulation",
        "Evaluation",
        "Independent scrutiny"
    ],
    "pub_date": "2025-02-11T13:03:21+00:00",
    "content": [
        {
            "text": "Regulations do not always work first time. It is therefore important that government departments monitor and evaluate regulations to check if they are achieving their objectives or if they need to be revised (or indeed removed)."
        },
        {
            "text": "Evaluation should consider:"
        },
        {
            "text": "Given the importance of ensuring that regulations do not impose unnecessary costs on business and provide a barrier to growth, for regulation with significant impacts, it is generally a statutory requirement for departments to undertake a Post Implementation Review (PIR) of the regulation within 5 years of it coming onto force."
        },
        {
            "text": "However, despite this statutory requirement, departments are generally not very good at completing PIRs on time (or indeed at all). Less than 40% of regulations have a PIR by the required deadline as we have repeatedly commented."
        },
        {
            "text": "In March 2023, the Office of Environmental Protection (OEP) published a report highlighting government’s failure to publish at least 80 PIRs related to environmental measures. They singled out Defra as having a backlog of 56 PIRs. In response to the report, the then Defra Secretary of State, Therese Coffey made a commitment in Parliament to address the backlog by the end of 2024."
        },
        {
            "text": "We are pleased to confirm, as per data available on legislation.gov.uk, that since the start of 2023 Defra have published 64 PIRs (25 in 2023, 37 in 2024 and 2 so far this year) including 10 that were scrutinised by the RPC.* We are currently reviewing a further 5 PIRs and expect 4 more before April. We commend Defra for tackling the backlog and for now undertaking PIRs in a more timely manner."
        },
        {
            "text": "We also note that, like Defra, DHSC and DfT are being proactive in identifying and undertaking PIRs. However, despite these improvements, we have yet to see a significant increase in the number PIRs from other departments. Since the start of 2024, only 30 PIRs were submitted to the RPC for scrutiny, compared to 140 IAs and OAs."
        },
        {
            "text": "We continue to urge the Government to prioritise evaluation and PIRs. Other departments could usefully follow Defra’s lead with internal guidance to policy teams and regular reporting."
        },
        {
            "text": "To increase the transparency of the PIR process, and identify where PIRs have not been completed by the required deadline, from April we will start publishing a list of regulations without a required PIR. We welcome comments on this initiative and hope that it will increase the number of PIRs that are completed on time."
        },
        {
            "text": "* The RPC does not scrutinise every PIR, only those where the expected impacts on business of the original regulation were more than the Better Regulation Framework's de minimis threshold (was £5m a year, now £10m), and therefore scrutiny of the IA for the original measure was required."
        }
    ]
}