{
    "url": "https://buyingforschools.blog.gov.uk/2025/02/11/embracing-flexible-working-in-schools-and-trusts/",
    "title": "Embracing flexible working in schools and trusts",
    "authors": [
        "Sarah Sarll, Chief Financial Officer at Pioneer Educational Trust"
    ],
    "categories": [
        "Uncategorized"
    ],
    "pub_date": "2025-02-11T11:44:45+00:00",
    "content": [
        {
            "text": "Sarah Sarll, Chief Financial Officer at Pioneer Educational Trust, shares how flexible working has boosted staff wellbeing and retention while transforming school culture. Her experience offers valuable insights for educational institutions looking to modernise their working practices."
        },
        {
            "text": "Evidence-Based ImplementationWhen we first considered implementing flexible working across our Trust, we knew we needed compelling evidence to support such a significant change. Research from the Department for Education’s Teaching Vacancies showed that:"
        },
        {
            "text": "• 83% of teachers view improved work-life balance as a top benefit of flexible working.• 72% of teachers believe it promotes wellbeing• 52% associate flexible working with supporting staff retention"
        },
        {
            "text": "This data highlighted the significant impact that flexible working can have on both wellbeing and staff retention, which, in turn, improves school efficiency and overall performance."
        },
        {
            "text": "Creating Inclusive OpportunitiesWe made the decision to open flexible working to all staff, not just teachers. This inclusive approach has transformed our recruitment process, allowing us to tap into talent pools we couldn’t reach before, enhancing operations both in classrooms and support roles."
        },
        {
            "text": "Flexible working is particularly appealing to recent graduates who might otherwise consider other sectors."
        },
        {
            "text": "Supporting Professional GrowthFlexible working fosters a supportive environment, especially for staff with caregiving responsibilities or those pursuing further education."
        },
        {
            "text": "Many staff members use their flexible roles to study for master’s or PhD qualifications, upskilling without the need for additional recruitment. This investment in professional development benefits not only our staff but also our students, who gain from their enhanced expertise."
        },
        {
            "text": "Resource ManagementThe constant cycle of recruiting and training new teachers can hinder school improvement. By offering flexible working policies, we incentivise staff to stay and help them find the right working pattern for their life stage."
        },
        {
            "text": "Some staff only need flexible working temporarily to support caring responsibilities. By being flexible, we retain top talent, reducing the time and resources needed to recruit, train, and induct new staff. This allows our leaders to focus on other key areas of school transformation."
        },
        {
            "text": "Flexible working arrangements, such as part-time roles, job-sharing, remote working, and adjustable hours, can make roles more attractive and manageable for highly skilled professionals who might otherwise leave the profession due to inflexible work conditions. This helps retain experienced staff and improves job satisfaction, productivity, and loyalty to the Trust."
        },
        {
            "text": "At Pioneer Educational Trust, we were spending approximately £78,000 annually* on recruitment. This included recruitment services, advertising costs, and agency fees (charges could run from 20–30% of the annual salary*). Since implementing flexible working, we’ve seen these costs decrease significantly."
        },
        {
            "text": "We’ve learned that clear communication and proper training for school leaders are essential. It’s crucial to create a supportive culture where flexible working is seen as a normal part of school life, not an exception."
        },
        {
            "text": "The role of Teaching VacanciesI can’t discuss our flexible working success without mentioning Teaching Vacancies. This free Department for Education platform has been instrumental in our recruitment strategy over the past decade. It’s helped us reach a wider pool of candidates while significantly reducing our advertising costs."
        },
        {
            "text": "Take action nowIf you’re a School Business Manager considering flexible working, I strongly encourage you to take that step. The benefits we’ve seen – from improved staff wellbeing to reduced recruitment costs – have far outweighed any initial challenges."
        },
        {
            "text": "Here’s what you can do today:• Visit Teaching Vacancies to list your roles with flexible working options• Review your current working patterns and identify opportunities for flexibility• Start conversations with your leadership team about implementing flexible working policies"
        },
        {
            "text": "Creating a more flexible workplace isn’t just about staff satisfaction; it’s about building a more resilient, efficient, and sustainable education system for everyone."
        },
        {
            "text": "*Figures supplied by Pioneer Educational Trust"
        },
        {
            "text": "If you’ve found this article useful and want to learn more about how we’re supporting schools, click ‘sign up and manage updates’ to subscribe to our blog and receive notifications when we next post."
        }
    ]
}