{
    "url": "https://naturalengland.blog.gov.uk/2025/02/11/how-can-nature-based-solutions-address-the-climate-and-nature-crises/",
    "title": "How can Nature-Based Solutions address the climate and Nature crises?",
    "authors": [
        "Tony Juniper"
    ],
    "categories": [
        "Biodiversity",
        "Climate change",
        "Marine environment",
        "Natural Capital",
        "Natural England",
        "Nature",
        "Nature Recovery",
        "Nature Returns",
        "Nature-based solutions",
        "Peat",
        "Protected sites and species"
    ],
    "pub_date": "2025-02-11T10:38:55+00:00",
    "content": [
        {
            "text": "Keynote speech by Tony Juniper CBE, Chair of Natural England, at Nature Returns conference, 6 February 2025"
        },
        {
            "text": "It is an absolute pleasure to be here today and to see this latest journey in what has been a decades-long process of drawing together these two very big subjects of climate change and biodiversity. And I was struck by some of the content earlier on, some really fantastic things that even for someone who's dwelt in this space for many years, were surprising pieces of new information. I was, for example, struck by the finding that a huge proportion of the carbon held in the ecosystems at Wakehurst, is it about 150 individual trees? And actually, just stepping outside, just looking at the vegetation in the gardens there, and seeing the volume and the body of some of those big mature trees, actually, you think “that's right, isn't it?” You can just see the difference between those and some of the little saplings."
        },
        {
            "text": "And yet, sometimes, as we go along, we think of all trees as equal, they really are not equal, and having a different approach based upon this kind of data, I think can inform different ways of doing things. So that was a surprising and striking finding, and I was struck by the information we heard about hedgerows. And now you will be hearing me repeat, I'm sure, endlessly, that there are about two and a half million tons of carbon locked up in the agricultural linear features that crisscross the countryside in England."
        },
        {
            "text": "And then, beneath the soils, you probably will hear me reciting the importance of mycorrhizal fungi as an indicator of how we might judge the carbon held in particular ecosystems."
        },
        {
            "text": "So this is cutting edge work that we are learning about today, marking the latest waypoint in a very long journey which goes back quite a long way whereby people began to see some of the synergies and linkages between climate change and the decline of Nature - the two big environmental emergencies that confront humankind in the 2020s."
        },
        {
            "text": "When I began my work in the 1980s, like many people I started as quite a specialist ecologist. I was an ornithologist, and my work was to try and prevent the extinction of various very rare species of parrot, including birds that lived in tropical rainforests, and part of my transition from being a species-focused conservationist and moving more into the kind of thinking we're exploring today was through work that I then subsequently did to conserve tropical rainforests."
        },
        {
            "text": "When I joined Friends of the Earth in 1990 we were just beginning to start thinking about the reasons why we might want to conserve those systems, beyond the fact that they are absolutely jam-packed with biodiversity and, of course, a very huge component of human cultural diversity. And one of the first reports that I was leading on the publication of when I joined Friends of the Earth was to set out the contribution of tropical deforestation to carbon dioxide emissions. And this was, you know, quite a surprising piece of information for the world back at the time. And we put out information based upon the best estimates available at the time, which actually did subsequently be in the right ballpark as the IPCC, later on, started to delve into this, we reckoned about a fifth of CO2 emissions going into the atmosphere globally was down to the destruction of the tropical rainforests, and that proportion has gone down, not because the deforestation rate has dropped, but because industrial emissions have gone up, thereby making that proportion a bit smaller."
        },
        {
            "text": "And I saw some of what this means on the ground, traveling in the Amazon and then also in East Asia, and seeing, for example, some of the peat swamp forests in Sumatra. You've got tropical rainforests there sitting on top of peat deposits, some of which are about 20 metres thick. And not only is that being deforested, it's being set on fire in order to open up the landscape for palm oil plantations. And then you get into discussions with policy makers, and - much less these days - but in the 1990s “don't worry about that” people would say, “because we're going to plant palm oil and eucalyptus for pulp plantations, and that will catch carbon, and therefore we've got a neutral contribution to CO2 to the atmosphere”. This happened to be complete rubbish, of course, and the kind of information we have seen today helps underline the difference between an Acacia tree that's being grown for paper, compared to these immense, 150-foot tall Dipterocarpus trees that were being cut down to make way for those plantations."
        },
        {
            "text": "And so this has become a more active space as we've gone along, trying to understand the connections and the interactions between the carbon in the ecosystems and what we might want to be doing to meet our parallel goals in relation to Nature. Some of this has bubbled into the international climate discussions and the treaty process. I do remember one negotiation, really important negotiations at Kyoto in December ‘97 COP 3 - led to the Kyoto Protocol - when you just get a sense of how much this discussion was in its infancy then, when governments were quite seriously suggesting that we should have a mechanism to count plantations in terms of their carbon benefit, but no comparable mechanism to count the dis-benefits coming from deforestation, creating a completely unbalanced picture of how these things pan out in the real world, in terms of how we might establish carbon sinks to solve the problem, without actually looking at the wider picture in terms of the sinks being simultaneously destroyed."
        },
        {
            "text": "We've moved beyond that into the modern world. We've got a better view of how these things might be seen together but, you know, continuing scandals going on linked to carbon offsets. And I remember some of these 20 years ago, when we had the first kind of tree-based carbon offsetting schemes coming into play; all sorts of issues linked with those, not least the fact that sometimes you'd have diverse valuable ecosystems being replaced by – literally - plantations of Christmas trees, and having that counted as a carbon benefit without any countervailing discussion about the loss of the biodiversity [which] created an utterly imbalanced picture of what was going on."
        },
        {
            "text": "So the conversation we're in today is really, really important in being able to create clarity and some level of certainty about the interactions between these two really important challenges which we must deal with in the modern world."
        },
        {
            "text": "And on top of that, of course, is the question of not only the carbon interaction with Nature, but also the climate change adaptation interactions that come with Nature, and the extent to which we can be harnessing natural systems that are simultaneously catching carbon but also helping us to cope with climate change extremes, whether that be flooding - very topical subject - and also heat island effects and the extent to which we can shield ourselves somewhat from the economically and socially disruptive impacts of climate change through enhancing systems in a way which is also rebuilding their biodiversity or protecting their biodiversity."
        },
        {
            "text": "And again, through my travels over many years, I've seen, different elements of this, including the huge value of mangrove forests in those coastal tropical subtropical ecosystems, where you get these tangled roots, which are an incredibly important barrier to extreme weather coming from the ocean. And you get glimpses of this every now and again when a hurricane or a cyclone hits a coast, and you see the damage done in areas where the mangroves have been cleared compared to where they're still intact, a very big difference in terms of the cushioning effect. And though you see defences, of course, unlike concrete and steel, they are self-adjusting. They track sediments in those tangled roots. So as the sea goes up, so does the level of the base of the mangrove, which also is catching vast quantities of carbon, much more than a terrestrial tropical forest, at the same time as being a nursery for oceanic fish, which are of huge economic importance, layers of ecosystem service on top of one another in a system which is helping us to adapt from climate change, at the same time as catching a lot of carbon, so there's a lot going on in this space. It has become more sophisticated as we've gone along, and today is, I think, a really important landmark in understanding some of the interactions between this carbon and Nature story in a country like England."
        },
        {
            "text": "But what we now must do is turn this learning into consequence on the ground, to be able to really harness these synergies for low carbon, high Nature and also resilience through taking good choices on the ground."
        },
        {
            "text": "And so this is when we are in the happy position, only last week, of publishing a land use framework consultation, and this is really, really important, not least because of what we heard this morning, loud and clear, about the complexity in all of this, and about how there is a big spatial component in terms of how we deploy Nature based solutions. They won't work everywhere in the same way, they have to be based on the specificity of the places, and to be using the opportunities that exist in those places to get good outcomes."
        },
        {
            "text": "So we need spatial planning. We've not had that in this country. I mean, the planning system that we have was invented in the post war years. It was about development and urban sprawl. Nobody was really planning for agriculture or the forestry or the Nature, not in a systematic, national way. And they certainly weren't planning for carbon or climate change adaptation, but now we can hopefully embark on the journey that takes us into that space, and can begin to give us the opportunities to bring genuinely joined up integrated solutions to the many challenges that we face, and they are many, not only the Nature and climate crises, but we need to feed ourselves, we need to renew some of our infrastructure, and we need to build a lot more houses. All of these things are on the table at once, and blending in all of your work into that is a critically important job, and that framework could give us a means of doing it at the same time, it's giving us a spatial template to be able to deploy in a more efficient and targeted way, things like the environmental payments coming from the new farming policy, plus also how we might be able to deploy Nature recovery through biodiversity net gain and the better use of the protected area network that we've got, never mind what we might be doing to improve the quality of our rivers, all these things, in the end, connect."
        },
        {
            "text": "And so that is then, I think, inviting the question of, “how do we do that?” And that is why it's going to be so good now to have a panel discussion, having had all of your input this morning about the “what” and the insights that we've learned, the question now that we're going to interrogate the panel is “how” we're going to deploy this in the real world."
        }
    ]
}