{
    "url": "https://food.blog.gov.uk/2025/02/11/international-day-of-women-and-girls-in-science-2025-at-the-fsa/",
    "title": "International Day of Women and Girls in Science 2025 at the FSA",
    "authors": [
        "Dr Erin Lewis, Research Engagement and Partnerships Coordinator"
    ],
    "categories": [
        "People",
        "Science"
    ],
    "pub_date": "2025-02-11T13:20:29+00:00",
    "content": [
        {
            "text": "Cymraeg"
        },
        {
            "text": "We’re celebrating International Day of Women and Girls in Science by getting to know a few members of our Scientific Advisory Committees (SAC)."
        },
        {
            "heading": 2,
            "text": "Emily Burton "
        },
        {
            "text": "What capacity do you work with the FSA in?  "
        },
        {
            "text": "I have two advisory roles with the FSA: I am a member of the Advisory Committee on Animal Feedstuffs (ACAF) and also a member of the Science Council. It is very interesting how different the two roles are: in my ACAF role I am mainly scrutinising and assessing submitted reports in great detail to make sure proposed new feed additives are safe and efficacious, whereas in my Science Council role I am trying to help the FSA prepare for tomorrow: what do we not know that could help inform decision-makers? "
        },
        {
            "text": "What is your role outside of the FSA?  "
        },
        {
            "text": " I am a professor of sustainable food production at Nottingham Trent University and director of our Safety and Sustainability Research Theme. In my own research, I use nutrition as a tool to improve animal health and reduce the environmental impact of food production. As a research director I work to enable my colleagues to grow the impact of our safety and sustainability research both locally and globally. "
        },
        {
            "text": "Tell us about a woman in science who you admire  "
        },
        {
            "text": " A woman scientist I deeply admire is Professor Sally Solomon. She worked in academia for over 40 years and she published widely in the general field of egg formation and egg quality. Sally not only remained a leader her field as it developed, she also recognised the importance of these findings and actively engaged with stakeholders from the poultry industry. Sally’s enthusiasm and kindness was boundless, she had time to encourage the most junior scientist despite her extraordinarily international career.  "
        },
        {
            "text": "What was your childhood dream job?    "
        },
        {
            "text": "As a child, I really wanted to be a vet, as it was the only job I could think of that related to animals. Now I am very glad I am not a vet as I would have been a terrible one! I really love being a research scientist and cannot imagine doing anything else.  "
        },
        {
            "text": "What is the best piece of career advice you have ever received?    "
        },
        {
            "text": "Accept where you are now and focus on moving forwards, not looking backwards.   "
        },
        {
            "text": "If you could give one piece of advice to people about engaging with science, what would it be?    "
        },
        {
            "text": "Be curious, and don’t be afraid ask people to explain what doesn’t make sense to you: no one knows everything!"
        },
        {
            "heading": 2,
            "text": "Cath Rees"
        },
        {
            "text": "What capacity do you work with the FSA in?  "
        },
        {
            "text": "I am a member of the Advisory Committee on the Microbiological Safety of Food; this committee is made up of people with a range of knowledge about different aspects of food  production, storage and how it is handled by the consumer. Our role is to provide specialist advice about a whole range of issues that relate to food safety that help the FSA develop policies to keep the public safe.   "
        },
        {
            "text": "What is your role outside of the FSA?"
        },
        {
            "text": "I am a Professor of Microbiology at the University of Nottingham.  My area of specialism is the different types of bacteria that can cause food poisoning – in particular understanding how they survive and grow in foods. However, most of my research has focussed on developing new tests that can be used to detect bacteria in food more easily so that safer food can be produced.   "
        },
        {
            "text": "Tell us about a woman in science who you admire  "
        },
        {
            "text": "My inspiration/role model is Dr Betty Kutter."
        },
        {
            "text": "She was a pioneer of bacteriophage (viruses that infect bacteria) research in the late 1970's and her work laid the foundation for the development of lots of different aspects of phage biology. However, this is not why she inspired me – rather it was the way that she showed you could be a successful scientist without sacrificing your role as a successful mother, teacher and communicator."
        },
        {
            "text": "She organised hugely successful phage biology conferences at her own University that attracted scientists from all over the world. The endless enthusiasm and interest in science that she displayed at these meetings was infectious and has inspired many, many female scientists to follow in her footsteps. She also proved that you did not just have to focus on science to the exclusion of all other things in life to be an academic success.   "
        },
        {
            "text": "What was your childhood dream job?    "
        },
        {
            "text": "Boringly - being a research scientist! I never stop marvelling at what a very privileged position I am in to be paid to pursue my hobby. There is always something new to learn and being given the freedom to ask new questions and make new discoveries every day is something quite amazing.   "
        },
        {
            "text": "What is the best piece of career advice you have ever received?    "
        },
        {
            "text": "“You can’t plan a career, but you can grasp opportunities with both hands when they arise.”"
        },
        {
            "text": "In the early years of an academic science career, it’s hard to predict how you will take the next step in the pathway. So sometimes you have to be brave, go out on a limb and take a chance when opportunities come up. Over planning sometimes just leads to disappointment!   "
        },
        {
            "text": "If you could give one piece of advice to people about engaging with science, what would it be?    "
        },
        {
            "text": "Don’t be put off because you think it’s difficult to understand – there is nothing is science that cannot be explained to others if you are a good enough communicator. Ask questions, demand explanations and don’t let the jargon get between you and the fascinating science that lies behind every aspect of everyday life."
        },
        {
            "text": "Be curious and get involved!"
        },
        {
            "heading": 2,
            "text": "Cathrina Edwards"
        },
        {
            "text": "What capacity do you work with the FSA in?  "
        },
        {
            "text": "I'm a member of the Advisory Committee on Novel Foods and Processes."
        },
        {
            "text": "What is your role outside of the FSA?  "
        },
        {
            "text": "Group Leader at the Quadram Institute Bioscience in Norwich. In this role, I lead a diverse research group doing laboratory and human studies to understand how food processing and structure affect the nutritional and health effect of food.  "
        },
        {
            "text": "I am also Founding Director, Inventor and Chief Scientific Officer at PulseON Food Ingredients Ltd – a new start-up company set up to commercialise a new ingredient that can make everyday foods a bit healthier.  "
        },
        {
            "text": "Tell us about a woman in science who you admire  "
        },
        {
            "text": " I admire a ‘modern day’ professor in nutritional science for her scientific integrity, ability to communicate clearly and influence decision making in a professional manner, while always being kind and considerate to others. By persevering and maintaining exceptionally high standards, she has managed to change her field.  "
        },
        {
            "text": "What was your childhood dream job?    "
        },
        {
            "text": " I was always curious about the world around me and was interested in science and experiments from a young age. But I also wanted to do science that was meaningful to society, and that is precisely what I work on as a nutritional scientist today.  "
        },
        {
            "text": "What is the best piece of career advice you have ever received?    "
        },
        {
            "text": "Progress involves stepping out of my comfort zone, and naturally there are moments when I doubt myself. In those moments of doubt or hardship, the advice I come back to is again and again is, “Do it anyway!”. "
        },
        {
            "text": "If you could give one piece of advice to people about engaging with science, what would it be?    "
        },
        {
            "text": "Science is everywhere! It is so much more than fundamental biology, chemistry or physics – Science is incredibly important in food, medicine, space, environment, computers, society etc. etc.!"
        },
        {
            "text": "There really is a field of science for everything, and so many different types of careers and roles – follow your interests and curiosity.   "
        },
        {
            "heading": 1,
            "text": "Diwrnod Rhyngwladol Menywod a Merched mewn Gwyddoniaeth 2025 yn yr ASB"
        },
        {
            "text": "Rydym yn dathlu Diwrnod Rhyngwladol Menywod a Merched mewn Gwyddoniaeth trwy ddod i adnabod rhai o aelodau ein Pwyllgorau Cynghori Gwyddonol (SAC)."
        },
        {
            "heading": 2,
            "text": "Emily Burton "
        },
        {
            "text": "Beth yw rhinwedd eich swydd gyda’r ASB?  "
        },
        {
            "text": "Mae gennyf ddwy rôl gynghori gyda’r ASB: Rwy’n aelod o’r Pwyllgor Cynghori ar Fwydydd Anifeiliaid (ACAF) a hefyd yn aelod o’r Cyngor Gwyddoniaeth. Mae’n ddiddorol iawn pa mor wahanol yw’r ddwy rôl: mae’r rhan fwyaf o fy rôl ACAF yn cynnwys craffu ac asesu adroddiadau sydd wedi’u cyflwyno yn fanwl iawn i wneud yn siŵr bod ychwanegion bwyd anifeiliaid newydd arfaethedig yn ddiogel ac yn effeithiol. Yn fy rôl gyda’r Cyngor Gwyddoniaeth, rwy’n ceisio helpu’r ASB i baratoi ar gyfer y dyfodol: beth nad ydym yn ei wybod a allai helpu i hysbysu’r rhai sy’n gwneud penderfyniadau? "
        },
        {
            "text": "Beth yw eich rôl y tu allan i’r ASB?  "
        },
        {
            "text": "Rwy’n athro cynhyrchu bwyd cynaliadwy ym Mhrifysgol Nottingham Trent ac yn gyfarwyddwr ein Thema Ymchwil Diogelwch a Chynaliadwyedd. Yn fy ymchwil fy hun, rwy’n defnyddio maeth fel arf i wella iechyd anifeiliaid a lleihau effaith amgylcheddol cynhyrchu bwyd. Fel cyfarwyddwr ymchwil, rwy’n gweithio i alluogi fy nghydweithwyr i gynyddu effaith ein hymchwil diogelwch a chynaliadwyedd yn lleol ac yn fyd-eang. "
        },
        {
            "text": "Dywedwch wrthym am fenyw mewn gwyddoniaeth rydych chi’n ei hedmygu  "
        },
        {
            "text": "Gwyddonydd benywaidd yr wyf yn ei hedmygu’n fawr yw’r Athro Sally Solomon. Bu’n gweithio yn y byd academaidd am dros 40 mlynedd a chyhoeddodd yn eang ym maes cyffredinol ffurfio wyau ac ansawdd wyau. Roedd Sally nid yn unig yn parhau i fod yn arweinydd yn ei maes wrth iddo ddatblygu, ond roedd hefyd yn cydnabod pwysigrwydd y canfyddiadau hyn ac yn ymgysylltu’n frwd â rhanddeiliaid o’r diwydiant dofednod. Roedd brwdfrydedd a charedigrwydd Sally yn ddi-ben-draw; roedd ganddi amser i annog y gwyddonydd mwyaf iau er gwaethaf ei gyrfa hynod ryngwladol.  "
        },
        {
            "text": "Pa swydd roeddech chi’n breuddwydio am ei gwneud pan oeddech chi’n blentyn?    "
        },
        {
            "text": "Fel plentyn, roeddwn i wir eisiau bod yn filfeddyg, gan mai dyna’r unig swydd y gallwn i feddwl amdani a oedd yn ymwneud ag anifeiliaid. Nawr rwy’n falch iawn nad milfeddyg ydw i, gan y byddwn i wedi bod yn un ofnadwy! Rwyf wrth fy modd yn bod yn wyddonydd ymchwil ac ni allaf ddychmygu gwneud unrhyw beth arall.  "
        },
        {
            "text": "Beth yw’r darn gorau o gyngor ar eich gyrfa a gawsoch chi erioed?    "
        },
        {
            "text": "Dylech chi dderbyn ble rydych chi nawr a chanolbwyntio ar symud ymlaen, nid edrych yn ôl.   "
        },
        {
            "text": "Wrth feddwl am ymgysylltu â gwyddoniaeth, pa un darn o gyngor byddech chi’n ei roi i bobl?    "
        },
        {
            "text": "Byddwch yn chwilfrydig, a pheidiwch â bod ofn gofyn i bobl egluro’r hyn nad yw’n gwneud synnwyr i chi: does neb yn gwybod popeth!"
        },
        {
            "heading": 2,
            "text": "Cath Rees"
        },
        {
            "text": "Beth yw rhinwedd eich swydd gyda’r ASB?  "
        },
        {
            "text": "Rwy’n aelod o’r Pwyllgor Cynghori ar Ddiogelwch Microbiolegol Bwyd; mae’r pwyllgor hwn yn cynnwys pobl sydd â gwybodaeth amrywiol am wahanol agweddau ar gynhyrchu a storio bwyd a sut mae’n cael ei drin gan y defnyddiwr. Ein rôl yw darparu cyngor arbenigol ar ystod eang o faterion sy’n ymwneud â diogelwch bwyd sy’n helpu’r ASB i ddatblygu polisïau i gadw’r cyhoedd yn ddiogel.   "
        },
        {
            "text": "Beth yw eich rôl y tu allan i’r ASB?"
        },
        {
            "text": "Rwy’n Athro Microbioleg ym Mhrifysgol Nottingham. Fy maes arbenigedd yw’r gwahanol fathau o facteria sy’n gallu achosi gwenwyn bwyd – yn arbennig, deall sut maen nhw’n goroesi ac yn tyfu mewn bwydydd. Fodd bynnag, mae’r rhan fwyaf o’m hymchwil wedi canolbwyntio ar ddatblygu profion newydd y gellir eu defnyddio i ganfod bacteria mewn bwyd yn haws fel bod modd cynhyrchu bwyd mwy diogel.   "
        },
        {
            "text": "Dywedwch wrthym am fenyw mewn gwyddoniaeth rydych chi’n ei hedmygu"
        },
        {
            "text": "Fy ysbrydoliaeth/model rôl yw Dr Betty Kutter."
        },
        {
            "text": "Roedd hi’n arloeswr ymchwil i facterioffagau (feirysau sy’n heintio bacteria) ddiwedd y 1970au, a gosododd ei gwaith y sylfaen ar gyfer datblygu llawer o wahanol agweddau ar fioleg ffagau. Fodd bynnag, nid dyma pam y gwnaeth hi fy ysbrydoli – yn hytrach, oherwydd y ffordd y dangosodd hi y gallech chi fod yn wyddonydd llwyddiannus heb aberthu eich rôl fel mam, athrawes a chyfathrebwr llwyddiannus."
        },
        {
            "text": "Trefnodd gynadleddau hynod lwyddiannus ar thema bioleg ffagau yn ei Phrifysgol ei hun a ddenodd wyddonwyr o bob cwr o’r byd. Roedd y brwdfrydedd a’r diddordeb diddiwedd mewn gwyddoniaeth yr oedd hi’n eu dangos yn y cyfarfodydd hyn yn heintus, ac mae wedi ysbrydoli llawer iawn o wyddonwyr benywaidd i ddilyn ôl ei thraed. Profodd hefyd nad oedd yn rhaid i chi ganolbwyntio ar wyddoniaeth yn unig ar draul popeth arall mewn bywyd i fod yn llwyddiant academaidd.   "
        },
        {
            "text": "Pa swydd roeddech chi’n breuddwydio am ei gwneud pan oeddech chi’n blentyn?    "
        },
        {
            "text": "Yn ddiflas - bod yn wyddonydd ymchwil! Dydw i byth yn stopio rhyfeddu at fy sefyllfa freintiedig iawn, lle rwy’n cael fy nhalu i ddilyn fy hobi. Mae bob amser rhywbeth newydd i’w ddysgu, ac mae cael y rhyddid i ofyn cwestiynau newydd a gwneud darganfyddiadau newydd bob dydd yn rhywbeth eithaf rhyfeddol.   "
        },
        {
            "text": "Beth yw’r darn gorau o gyngor ar eich gyrfa a gawsoch chi erioed?    "
        },
        {
            "text": "“Allwch chi ddim cynllunio gyrfa, ond gallwch chi fachu ar gyfleoedd gyda’ch dwy law pan fyddan nhw’n codi.”"
        },
        {
            "text": "Ym mlynyddoedd cynnar gyrfa wyddonol academaidd, mae’n anodd rhagweld sut y byddwch chi’n cymryd y cam nesaf. Felly weithiau mae’n rhaid i chi fod yn ddewr, ei mentro hi ar eich pen eich hunan a chymryd siawns pan fydd cyfleoedd yn codi. Weithiau gall gorgynllunio arwain at siom!   "
        },
        {
            "text": "Wrth feddwl am ymgysylltu â gwyddoniaeth, pa un darn o gyngor byddech chi’n ei roi i bobl?    "
        },
        {
            "text": "Peidiwch â digalonni oherwydd eich bod chi’n meddwl ei bod hi’n anodd ei deall – does dim byd ym maes wyddoniaeth nad oes modd ei esbonio i eraill os ydych chi’n gyfathrebwr digon da. Gofynnwch gwestiynau, mynnwch esboniadau a pheidiwch â gadael i’r jargon fynd rhyngoch chi a’r wyddoniaeth hynod ddiddorol sydd y tu ôl i bob agwedd ar fywyd bob dydd."
        },
        {
            "text": "Byddwch yn chwilfrydig a chymerwch ran!"
        },
        {
            "heading": 2,
            "text": "Cathrina Edwards"
        },
        {
            "text": "Beth yw rhinwedd eich swydd gyda’r ASB?  "
        },
        {
            "text": "Rwy’n aelod o’r Pwyllgor Cynghori ar Fwydydd a Phrosesau Newydd."
        },
        {
            "text": "Beth yw eich rôl y tu allan i’r ASB?  "
        },
        {
            "text": "Rwy’n Arweinydd Grŵp yn Sefydliad Biowyddoniaeth Quadram yn Norwich. Yn y rôl hon, rwy’n arwain grŵp ymchwil amrywiol sy’n gwneud astudiaethau labordy a dynol i ddeall sut mae prosesu a strwythur bwyd yn effeithio ar effaith bwyd o ran maeth ac iechyd.  "
        },
        {
            "text": "Rwyf hefyd yn Gyfarwyddwr Sefydlu, Dyfeisiwr a Phrif Swyddog Gwyddonol PulseON Food Ingredients Ltd – cwmni newydd a sefydlwyd i fasnacheiddio cynhwysyn newydd a all wneud bwydydd bob dydd ychydig yn iachach.  "
        },
        {
            "text": "Dywedwch wrthym am fenyw mewn Gwyddoniaeth rydych chi’n ei hedmygu  "
        },
        {
            "text": "Rwy’n edmygu athro ‘modern’ ym maes gwyddor maeth am ei gonestrwydd gwyddonol, ei gallu i gyfathrebu’n glir a dylanwadu ar wneud penderfyniadau mewn modd proffesiynol, wrth fod yn garedig ac yn ystyriol o eraill bob amser ar yr un pryd. Trwy ddyfalbarhau a chynnal safonau eithriadol o uchel, mae hi wedi llwyddo i newid ei maes.  "
        },
        {
            "text": "Pa swydd roeddech chi’n breuddwydio am ei gwneud pan oeddech chi’n blentyn?    "
        },
        {
            "text": "Roeddwn i bob amser yn chwilfrydig am y byd o’m cwmpas ac roedd gen i ddiddordeb mewn gwyddoniaeth ac arbrofion ers i fi fod yn ifanc. Ond roeddwn i hefyd eisiau gwneud gwyddoniaeth a oedd yn ystyrlon i gymdeithas, a dyna’n union beth rydw i’n gweithio arno fel gwyddonydd maeth heddiw.  "
        },
        {
            "text": "Beth yw’r darn gorau o gyngor ar eich gyrfa a gawsoch chi erioed?    "
        },
        {
            "text": "Mae cynnydd yn golygu camu allan o’r hyn sy’n gyfarwydd i mi, ac yn naturiol, mae adegau pan fyddaf yn amau fy hun. Yn yr eiliadau hynny o amheuaeth neu galedi, y cyngor rwy’n dod yn ôl ato dro ar ôl tro yw, “Ewch amdani!”. "
        },
        {
            "text": "Wrth feddwl am ymgysylltu â gwyddoniaeth, pa un darn o gyngor byddech chi’n ei roi i bobl?    "
        },
        {
            "text": "Mae gwyddoniaeth ym mhobman! Mae’n llawer mwy na bioleg, cemeg neu ffiseg sylfaenol – mae gwyddoniaeth yn hynod bwysig mewn bwyd, meddygaeth, y gofod, yr amgylchedd, cyfrifiaduron, cymdeithas, ac ati ac ati!"
        },
        {
            "text": "Mae maes gwyddoniaeth i bopeth mewn gwirionedd, a chynifer o wahanol fathau o yrfaoedd a rolau – dilynwch eich diddordebau a’ch chwilfrydedd.   "
        }
    ]
}