{
    "url": "https://educationhub.blog.gov.uk/2025/02/national-apprenticeship-week-meet-dorota-a-physiotherapy-apprentice/",
    "title": "National Apprenticeship Week: Meet Dorota – a physiotherapy apprentice",
    "authors": [
        "mediaofficer"
    ],
    "categories": [
        "Apprenticeships",
        "Careers",
        "Further education",
        "Skills",
        "Vocational education"
    ],
    "pub_date": "2025-02-11T11:46:01+00:00",
    "content": [
        {
            "text": "This series of National Apprenticeship Week Education Hub posts was curated and written by Lauren, the Department for Education’s new communications apprentice."
        },
        {
            "text": "During National Apprenticeship Week we are showcasing how apprenticeships impact the lives of people that choose them as a route into their preferred profession. "
        },
        {
            "text": "Apprenticeships are for everyone - no matter how old you are or where you’re from. They provide a combination of on-the-job training and off-the-job training, allowing you to earn while you learn – setting you on a path to a wide variety of jobs across all sectors and the knowledge and skills to progress in your career."
        },
        {
            "text": "Dorota, shares her story."
        },
        {
            "text": "What is your apprenticeship in?"
        },
        {
            "text": "I am a physiotherapy apprentice in the Community Neuro Service in Newham. What it means is that I study a Physiotherapy Apprenticeship Degree at University of East London, and I work at the same time. Best decision ever!"
        },
        {
            "text": "The course runs across 4 years and mirrors a traditional full-time degree; however, I spend one day at the Uni attending lectures. Remaining days are ‘on the job’ where I integrate and consolidate my learning with clinical practice"
        },
        {
            "text": "Did you have any pre-conceived notions about apprenticeships before you started yours?"
        },
        {
            "text": "Yes. I thought I was not good enough to study, or too old to study. Then I thought, I will not be able to balance work, life, and the intensity of learning. Furthermore, I was not sure whether I would be able to pursue any type of learning."
        },
        {
            "text": "I am originally from Poland and finished my education there ages ago, hence I thought I wasn't meeting any entry requirements. But, where there is a will there is a way. I completed Functional Skills in English and Maths, and I also decided to complete Access to Higher Education."
        },
        {
            "text": "What made you pursue an apprenticeship?"
        },
        {
            "text": "I am a so-called 'mature student': I have two children and a household to take care of. I wouldn't be able to study any other way! Yes, it does require good organisation, planning well ahead and prioritising, but you get your salary every month. It's a no-brainer."
        },
        {
            "text": "What has surprised you most about your apprenticeship?"
        },
        {
            "text": "Apart from the fact that it was not as difficult as I anticipated, I think it has gone really quick! I am in my final months now and in May 2025 my four year journey will be over. By September 2025 I shall be a qualified physiotherapist."
        },
        {
            "text": "What has your apprenticeship helped you achieve?"
        },
        {
            "text": "Confidence and a sense of belonging. I also met a lot of great people along the way, I am sure some friendships will last longer than the course itself."
        },
        {
            "text": "What do you hope to do with what you have learnt during your apprenticeship?"
        },
        {
            "text": "I am hoping to work as a physiotherapist in my team. I do love Neuro! But I also adore working with elderly and, since our frailty adult population is on the increase, I can see myself there helping to keep them healthier for longer."
        }
    ]
}