{
    "url": "https://socialcareinspection.blog.gov.uk/2025/02/11/setting-up-provision-for-children-with-the-most-complex-needs-tips-reassurance-and-a-new-advice-form/",
    "title": "Setting up provision for children with the most complex needs – tips, reassurance and a new advice form",
    "authors": [
        "Yvette Stanley"
    ],
    "categories": [
        "children's homes",
        "children's services",
        "looked after children",
        "social care regulation"
    ],
    "pub_date": "2025-02-11T14:43:53+00:00",
    "content": [
        {
            "text": "It is often a struggle to find the right social care provider for children with the most complex needs. We want to help those wanting to open provision for them, and commissioners that are looking for suitable homes."
        },
        {
            "text": "So, we have created a pre-registration online advice form so that these providers and commissioners can ask for advice and ask questions. This blog explains the challenges and how the form will work, and offers some advice on applying."
        },
        {
            "text": "Children with complex needs"
        },
        {
            "text": "Local authorities often tell us that they have to place children in unregistered homes because they cannot find a legal option that meets a child’s specific needs. These children are usually placed alone, and the reason given is that they have complex needs. Many of these children are also the subject of deprivation of liberty orders (DLO)."
        },
        {
            "text": "Children who are living in registered children’s homes, including registered secure children’s homes, have care provided by individuals and organisations that Ofsted has deemed fit to provide that care. We determine this in line with children’s rights, professional standards and the law. We visit these homes at least once a year and gather information about the home throughout the year. This helps us to take prompt action when we believe children to be at risk of harm from poor or unsafe care."
        },
        {
            "text": "Children living in unregistered homes don’t have this regulatory oversight. They are isolated. Many are subject to restrictions on their liberty, without the safeguards that children in registered secure accommodation are entitled to."
        },
        {
            "text": "What we want to see"
        },
        {
            "text": "We want to encourage providers to open homes where they are needed most, and to open homes that can look after children with the greatest need."
        },
        {
            "text": "We want registered managers to feel able to step up and look after children who have multiple needs. We want unregistered providers to apply to register with us, and to stop accommodating children in unregistered provision. And we want local authorities to have the resources to be able to make the best decisions for children."
        },
        {
            "text": "Our new advice form"
        },
        {
            "text": "We have set up a new form so that you can ask us directly about registration matters."
        },
        {
            "text": "We are working to improve our guidance, but we know that it is not always easy to find the information that you need for your application."
        },
        {
            "text": "We want to hear from providers who want to provide high-quality care for the children who need it most. If you want to provide bespoke care and accommodation to meet children’s unique and complex needs, then you may have questions about things like:"
        },
        {
            "text": "The form will aim to answer these questions, and others you may have."
        },
        {
            "text": "How it works"
        },
        {
            "text": "It is a simple online enquiry form. We will try to deal with all queries promptly and sensitively. The advice that you receive will be tailored to your query. We may then:"
        },
        {
            "text": "However we respond, we want to give you the best information. We want to help you to make an informed decision on whether you should apply to open a home that cares for children with unique and complex needs."
        },
        {
            "text": "Our advice form will help you to explore any concerns that you may have about what we expect in a registration application. And it will offer advice on how you can demonstrate to us that the service you intend to provide will be equipped to support children in those difficult periods as well as when things are going well."
        },
        {
            "text": "Understanding your context and challenges"
        },
        {
            "text": "We have seen some growth in homes that provide bespoke care for highly vulnerable children. We want to reassure you that inspection outcomes in these homes are the same as they are for all other homes. We have seen some excellent examples of how well children can thrive when the home focuses on meeting their needs."
        },
        {
            "text": "It is important that staff have the necessary knowledge and skills. They should be able to provide support for children in the least restrictive and most flexible way. They should enable children to access education, improve their health and begin to build a more positive future."
        },
        {
            "text": "When we inspect, we will explore with you how you and your staff are equipped to provide the best support to vulnerable children with complex support needs."
        },
        {
            "text": "Our inspectors also understand that children will rarely experience a smooth trajectory of upward progress. Sometimes children are overwhelmed by their past experiences and immediate difficulties."
        },
        {
            "text": "Tips for applying"
        },
        {
            "text": "There are some things that you can do to help your application to progress smoothly."
        },
        {
            "text": "A skilled and experienced manager"
        },
        {
            "text": "Your manager should of course meet the regulations for children’s homes managers. But they should also be skilled and experienced in supporting the needs of the children you intend to accommodate."
        },
        {
            "text": "They should be able to:"
        },
        {
            "text": "A committed responsible individual"
        },
        {
            "text": "Your responsible individual should:"
        },
        {
            "text": "A suitable property"
        },
        {
            "text": "Your property should:"
        },
        {
            "text": "A strong staff team"
        },
        {
            "text": "Your staff should be:"
        },
        {
            "text": "Conclusion"
        },
        {
            "text": "As we said, we want children with the most complex needs to be able to find and access appropriate social care and support."
        },
        {
            "text": "We hope, by reassuring providers about inspections, setting up the advice form and offering these tips, we can do our bit to encourage more of the right settings in the right places to open."
        }
    ]
}