{
    "url": "https://nda.blog.gov.uk/this-national-apprenticeship-week-we-hear-from-lauren-gorge-who-shares-her-journey-from-apprentice-to-cyber-security-professional-at-nuclear-transport-solutions/",
    "title": "From apprentice to cyber security professional in the NDA group",
    "authors": [
        "Lauren Gorge"
    ],
    "categories": [
        "Recruitment",
        "Skills"
    ],
    "pub_date": "2025-02-11T10:21:58+00:00",
    "content": [
        {
            "text": "As part of our National Apprenticeship Week 2025 focus on apprenticeships in the NDA group, Lauren Gorge - an Information Assurance Advisor at Nuclear Transport Solutions (NTS) - shares her apprenticeship journey:"
        },
        {
            "text": "I’m Lauren Gorge, an Information Assurance Advisor at Nuclear Transport Solutions (NTS), where I work as part of the Security and Resilience Directorate within the Information Governance Team.I was enrolled on the Cyber Security Apprenticeship in October 2019 with Energus as part of the NDA Group Cyber Security Apprenticeship programme. I started my first placement with International Nuclear Services (INS), which was a great opportunity for me to get into the role and learn more about the nuclear sector itself and cyber security.I had the opportunity to be placed within different subsidiaries within the NDA group. During my first placement, I had many great opportunities, not only learning more about the industry and the profession within the workplace, but also having the opportunity to build my confidence and further develop my personal attributes by being invited and attending the Cyber Security Connect Conference in Monaco and the International Conference on Nuclear Security at IEAE Vienna. These opportunities, along with others such as being part of Women in Nuclear and several other events which I have attended, have all helped me develop my networking skills, enabled me to meet some very interesting people from around the world and ultimately further develop my knowledge in the nuclear industry and cyber security.Cyber security was not something I had ever considered as I thought that this apprenticeship was about ‘hacking’ and, being honest, I wouldn’t be good enough in terms of technical ability. However, after researching the apprenticeship I thought I would give it ago as this seemed to fit in well for me, having studied IT at A-level and I welcomed the fact that the apprenticeship was in the nuclear sector which was an aspiration of mine to work in.I think when looking into nuclear apprenticeship opportunities, people may think predominantly about engineering and science, however there is so much more now offered to young people just leaving school.I did, stereotypically, think cyber security wouldn’t be for me. However, I soon found out that how wide of a field cyber security really is; there are so many areas to explore such as risk, security awareness, physical security elements, policy and procedure work and, of course, all of the technical work.I think apprenticeship schemes give everyone a chance at taking up career opportunities they maybe wouldn’t have considered. Apprenticeship schemes allow for on-the-job experience, earning whilst learning and bring so many opportunities to grow and develop.Going into this apprenticeship, I wasn’t the most confident individual, but I wanted to take all of the opportunities possible which could provide me with the scope to personally and professionally develop. I believe, with the support of Energus, my placement line managers and colleagues, I managed to achieve this.After completing the apprenticeship end point assessment process, I applied for a role within NTS as Information Assurance Advisor, which is the role I currently hold."
        }
    ]
}