{
    "url": "https://defrafarming.blog.gov.uk/2022/02/21/how-were-developing-slurry-grants/",
    "title": "How we’re developing slurry grants ",
    "authors": [
        "The Team"
    ],
    "categories": [
        "Payments for equipment, technology and infrastructure"
    ],
    "pub_date": "2022-02-21T09:03:58+00:00",
    "content": [
        {
            "text": "Today, we've blogged about how we're working with farmers and others across the industry to use slurry to our advantage. "
        },
        {
            "text": "Farmers told us that finance often stands in the way of improving their slurry and nutrient management systems.  "
        },
        {
            "text": "Investing in slurry equipment and infrastructure is expensive. Particularly when it comes to integrating new technologies, techniques and building infrastructure. "
        },
        {
            "text": "In this post, we'll share how we've been developing slurry grants to better support farmers and what to expect later this year. "
        },
        {
            "heading": 2,
            "text": "Our commitment  "
        },
        {
            "text": "When we published our Agricultural Transition Plan in Autumn 2020, we said we would offer grant support over several years to help farmers reduce pollution from slurry through a new slurry investment scheme. "
        },
        {
            "text": "Since then, we’ve been working with farmers and the wider industry on how best to do this.  "
        },
        {
            "text": "Reflecting on what people told us, and the many elements involved, we have made some important decisions about how we support slurry investment. "
        },
        {
            "heading": 2,
            "text": "Sharing our early plans  "
        },
        {
            "text": "Not all farms need to make the same investment. So, we want to give farmers the choice to apply for grant support across a range of slurry management equipment and technology.  "
        },
        {
            "text": "Rather than setting up an individual scheme to do this, we want to make things simpler by having the majority of slurry grants available in one place. "
        },
        {
            "text": "We will do this by adding to and improving the Farming Investment Fund offer, rather than creating a new separate slurry investment scheme."
        },
        {
            "text": "To be clear, the same investment opportunities will be available, but we will deliver them through our existing scheme rather than setting up a separate service for slurry."
        },
        {
            "text": "We will keep working with farming organisations and others to make sure farmers are aware of this, and that nobody misses out if they are looking for a specific slurry investment scheme."
        },
        {
            "text": "The first round of the Farming Equipment and Technology Fund (the small grants part of the Farming Investment Fund) offered funding for the best available slurry techniques, including separators and low-emission spreaders. We will soon ask people to share their views on how we can improve this offer in future rounds."
        },
        {
            "text": "In January, we launched a new offer for slurry acidification projects, under the Improving Farm Productivity strand of the Farming Transformation Fund. This is the large capital grants part of the Farming Investment Fund."
        },
        {
            "text": "Applicants have until 16 March 2022 to submit applications via the on-line checker. "
        },
        {
            "text": "We published details on how to apply on GOV.UK.  "
        },
        {
            "text": "While this is was a positive start, there were gaps in our offer. So, over the winter, we brought together a small group of farmers and industry representatives to help us co-design a new slurry infrastructure theme, to offer under the Farming Investment Fund from Autumn 2022.  "
        },
        {
            "text": "Though we are still in the process of developing this with our co-design group, we wanted to share what the first round will look like. "
        },
        {
            "text": "What will we fund? Adding to what is already provided under the Farming Investment Fund, we propose offering significant grant contributions towards covered slurry store construction projects, to enable farmers to get to 6 months storage capacity.  "
        },
        {
            "text": "Who will be eligible? We think applications should be open to all livestock farmers in England (dairy, beef, pig) already on a slurry system. "
        },
        {
            "text": "What can farmers build? Farmers tell us that having as much choice as possible over the type of storage is important to them. It’s also important that stores are built to high standards, so we’re taking these two factors into account. We are also looking at what conditions, advice and guidance we put with the grant to help farmers make this decision. In particular, we are looking at how to support farmers to embed robust nutrient management planning at the heart of their slurry system design, so that grants support sustainable investments that work for farmers and the environment. "
        },
        {
            "text": "How long will it last? This will be a substantial, multi-year offer. We want to offer multiple chances for farmers to apply to fit in with their situations. Though the grant will be open to all, if we have excess applications in the first round, we are considering prioritising those projects which maximise environmental outcomes. "
        },
        {
            "text": "We are continuing to work with our co-design group on the finer details of grant design and will give further details in the spring. We want to give as much information as possible to help farmers get ready for the launch in autumn."
        },
        {
            "heading": 2,
            "text": "Talk to us "
        },
        {
            "text": "In the meantime, please leave a comment or you can get in touch with the team at tacklingpollutionfromslurry@defra.gov.uk to be part of the conversation on how we put slurry to best use."
        }
    ]
}