{
    "url": "https://valuationoffice.blog.gov.uk/2022/02/21/how-we-value-oil-refineries/",
    "title": "How We Value: Oil Refineries",
    "authors": [
        "matthewmountfordbrock"
    ],
    "categories": [
        "How We Value",
        "Surveying",
        "Valuation"
    ],
    "pub_date": "2022-02-21T10:40:42+00:00",
    "content": [
        {
            "text": "Rob Hughes is National Valuation Head for industrial properties and chair of the VOA’s Valuation Panel for industrial properties, helping to ensure fairness and consistency of rating assessments."
        },
        {
            "text": "In this instalment of our How We Value series, Rob runs through the process for valuing oil refineries."
        },
        {
            "text": "Oil refineries"
        },
        {
            "text": "Major refineries are small in number - there are currently six across the whole of the UK – but they have multimillion pound rateable values."
        },
        {
            "text": "When you visit an oil refinery for the first time you’ll probably be overwhelmed by its sheer scale. These sites typically occupy hundreds of acres of land, covered with an array of buildings, chimneys, tanks, pipes and steel structures."
        },
        {
            "text": "Your first question might be: “Where do I even start?”"
        },
        {
            "text": "Traditionally, oil refineries are valued using the contractor’s basis (CB). This looks at the cost of building the refinery at the valuation date. You then make adjustments to reflect age, obsolescence, and any other factors that make the facility less attractive for an occupier’s modern requirements."
        },
        {
            "text": "This is then converted into a rental value by applying what’s known as the “statutory decapitalisation rate”. This is a percentage set by law for use in CB valuations. In the current rating list in England, it’s 4.4 per cent for properties like these."
        },
        {
            "text": "The process"
        },
        {
            "text": "So, why do we do it this way? Our first choice would be to use rental evidence, but oil refineries aren’t rented out in the open market. Our second choice would be the receipts and expenditure method. But historically refineries were owned by oil companies who also operated everything both “upstream” and “downstream” – from the oil well to the petrol pump – and it wasn’t possible to separate the figures for the refinery from those of the rest of the business."
        },
        {
            "text": "In these circumstances the valuer falls back on “the method of last resort”. This is a valuation based on what a hypothetical tenant would have to spend if, instead of renting the refinery, they had to build one themselves."
        },
        {
            "text": "Arguably CB offers another advantage. It makes it easier to correctly reflect what to include in the valuation and what to leave out. This is important because we don’t value the whole refinery. Of course, the land and buildings are included, but when it comes to plant and machinery, we only include parts which in law have to be treated as part of the property for rating purposes."
        },
        {
            "text": "It’s a very long list, but the idea is to exclude what’s called “process plant”. In crude terms, this is the kit that’s used to refine the oil, unless it’s in the nature of a structure (like a big storage tank) or building. It’s generally agreed that most of the value of a refinery in the real world is tied up in this. A CB valuation forces the valuer to specifically identify line by line each item that’s rateable."
        },
        {
            "text": "The changing landscape"
        },
        {
            "text": "The petrochemical industry has changed a lot over the years. Production facilities, including refineries, are now often sold to other operators. This means both the buyer and the seller must have an idea of the facility’s profitability. Given this, we can bring receipts and expenditure into play where available at the end of a CB valuation. This is the “stand back and look” stage. It’s a way of checking whether the valuation properly reflects the strengths and weaknesses of the refinery and making any necessary adjustments to it."
        },
        {
            "text": "Of course, there are numerous matters in the valuation process which come down to valuer judgement. The valuer representing the refinery operator may have different opinions – resolving these differences is where the really hard work begins."
        }
    ]
}