{
    "url": "https://dfedigital.blog.gov.uk/2022/02/21/hybrid-meet-ups/",
    "title": "10 tips for doing hybrid meet-ups well",
    "authors": [
        "Alex Rippon"
    ],
    "categories": [
        "community of practice",
        "culture",
        "multidisciplinary teams"
    ],
    "pub_date": "2022-02-21T11:34:19+00:00",
    "content": [
        {
            "text": "We’re having a lot of hybrid style meetings and meet-ups these days. Hybrid ones are those with people attending online and in person."
        },
        {
            "text": "Here are some useful tips from our community leads and heads of profession, on how to get the best out of these sessions."
        },
        {
            "text": "1  Tailor the format and content to accommodate your audience’s needs (for example, more broadcast content for larger groups versus more lean coffee style engagement in smaller groups)"
        },
        {
            "text": "2  Get a good external microphone for the presenter"
        },
        {
            "text": "3  Ensure your audience know what their expected contribution is in advance"
        },
        {
            "text": "4  Test the technology, equipment and tools before the event with both online and in-person participants"
        },
        {
            "text": "5  Use technology to make things better for everyone, for example Teams live transcription or live presentations in PowerPoint"
        },
        {
            "text": "6  Know who your on-site support teams are and make them aware of your meet-up in case you need help"
        },
        {
            "text": "7  Consider having an online facilitator separate from the in-person facilitator, to check online participants are ok and have what they need to contribute in an equitable way"
        },
        {
            "text": "8  Have a clear set of rules and share it at the start, such as:"
        },
        {
            "text": "9  Leave room in the schedule for downtime, and be mindful of the neurodiverse needs of the audience (some people may need more uninterrupted time than others)"
        },
        {
            "text": "10  Have a back-up plan for all to go remote. For example, ask everyone to bring their own laptop and headset even if turning up in person"
        },
        {
            "text": "Do you have any other tips or insights? Whatever your role or area of interest or expertise, we welcome your thoughts. You can comment below or get in touch on Twitter."
        }
    ]
}