{
    "url": "https://rpc.blog.gov.uk/2022/02/21/publication-of-rpc-independent-verification-body-report-2022/",
    "title": "Publication of RPC Independent Verification Body Report 2022",
    "authors": [
        "Stephen Gibson"
    ],
    "categories": [
        "Better regulation",
        "Evaluation"
    ],
    "pub_date": "2022-02-21T16:32:41+00:00",
    "content": [
        {
            "text": "This IVB report delivers on our responsibility as the independent verification body for the Business Impact Target (BIT). The RPC confirms the £1,183.8 million net reduction in direct costs to business of regulatory measures as set out in the Government’s report."
        },
        {
            "text": "When combined with the equivalent figure for the period covered by the first BIT report of this Parliament (adjusted in this report to £5,629.0 million net), the cumulative total for the parliament to date is an increase in direct costs to business of £4,445.2 million net. This compares to the ‘holding’ BIT of £0 set by the Government."
        },
        {
            "text": "However, since a significant amount of regulatory activity across this period was in response to the Covid-19 pandemic, the exemption from the BIT of temporary regulations and measures in response to civil emergencies means that the BIT figure does not include the impacts of some of the most severe and restrictive regulatory measures introduced by a peacetime government. It therefore very significantly underestimates the true increase in regulatory burdens on businesses during this reporting period."
        },
        {
            "text": " "
        },
        {
            "text": "Of the 20 measures included in the BIT and summarised in the diagram below (from our IVB report), there were two with by far the largest impacts during the year:"
        },
        {
            "text": " "
        },
        {
            "text": "As in recent years, we remain concerned at the number of IAs that arrived with the RPC late in the decision-making process – in some cases when the legislation was already before Parliament. This means that our opinions are not able to play their intended role in informing ministerial decision-making and parliamentary scrutiny, nor support external accountability."
        },
        {
            "text": "One example of this was the Department of Health and Social Care IA supporting the introduction of mandatory vaccination of workers in health care settings. This came to us after the legislation had been laid and meant that our opinion (which in this case was that the IA was not fit for purpose) was not able to inform parliamentary debate and that the Department did not have the opportunity to improve its analysis following our scrutiny."
        }
    ]
}