{
    "url": "https://defrafarming.blog.gov.uk/2022/02/21/slurry-making-the-best-of-it/",
    "title": "Slurry: making the best of it ",
    "authors": [
        "The Team"
    ],
    "categories": [
        "A view from the farm",
        "environmental land management schemes",
        "Things we're doing",
        "Things we've learned",
        "Ways to get involved"
    ],
    "pub_date": "2022-02-21T09:05:37+00:00",
    "content": [
        {
            "text": "Every year, farms in England generate and use millions of tonnes of livestock slurry. "
        },
        {
            "text": "Slurry contains lots of nutrients including nitrates, phosphate and potash as well as a host of other things that can benefit soil health and support crop growth.  "
        },
        {
            "text": "It can, however, create significant pollution to our water and air.  "
        },
        {
            "text": "Through co-design, our team joined with a group of farmers, industry leaders and experts to explore the subject. "
        },
        {
            "text": "In this post, we’ll share what we’ve learned and how we plan to support farmers so that:"
        },
        {
            "heading": 2,
            "text": "The view from the farm "
        },
        {
            "text": "Though some farmers have plans, equipment and infrastructure in place to manage the nutrients in their slurry and manure well, others face significant barriers. "
        },
        {
            "text": "To date, investment in slurry management hasn’t kept pace with farms in the sector. As herd sizes have grown and industries have concentrated in certain areas of the country (because supply chains have evolved), there is more slurry to deal with – both to store and to spread. "
        },
        {
            "text": "Farmers totally understand and value the nutrients in slurry but they struggle to make the best use of it and comply with regulations, which can be complex and onerous.   "
        },
        {
            "text": "As well as the financial barriers, particularly in building infrastructure, slurry isn’t as easy as artificial fertiliser to store, spread or transport. "
        },
        {
            "text": "It isn’t always clear what best practice will deliver on individual farms. And, increasingly, unpredictable weather makes it hard to plan good times to spread. Even when there’s enough storage some farmers don’t have the land bank or crop needed to make good use of it. "
        },
        {
            "heading": 2,
            "text": "Our shared vision  "
        },
        {
            "text": "We want to: "
        },
        {
            "heading": 2,
            "text": "What we’re going to do "
        },
        {
            "heading": 3,
            "text": "Expand financial support "
        },
        {
            "text": "By using capital grants, we can help farmers to invest in their slurry management systems and adopt best practice, including improved slurry storage. See our blog post How we’re developing slurry grants on where we’ve got to with our slurry grant design and how to shape our plans."
        },
        {
            "heading": 3,
            "text": "Provide better regulation and advice this year "
        },
        {
            "text": "We will take a fair, effective approach to regulation. We recognise the current challenges around Farming Rules for Water and we want to get to a position where the rules are clear and farmers have every opportunity to comply within their farming system. "
        },
        {
            "text": "We know from an Environment Agency pilot in the Axe Valley that taking a reasonable approach and working with farmers in partnership towards better outcomes can have real benefits for farms and for the environment. "
        },
        {
            "text": "As well as making grants available, we know farmers need more advice so the Catchment Sensitive Farming service will be available across England. We will review the guidance on GOV.UK to ensure it is as clear as possible. We will blog with more detail on the work that we have been doing with farmers and others to make regulation better. "
        },
        {
            "heading": 3,
            "text": "Explore innovation and nutrient sharing "
        },
        {
            "text": "We will explore how we might use innovation and new techniques to enable greater sharing of suitably managed nutrients between farms. "
        },
        {
            "text": "We will carry out work with innovators to assess the current state of the market, while exploring the needs of arable and horticultural users to understand whether there is a viable route to creating a better nutrient market for organic manures.  "
        },
        {
            "text": "This has the potential to help reduce pressure on areas with significant nutrient production while reducing dependence on artificial fertiliser in others. If it is possible, it also potentially provides a longer term, sustainable solution to enable better slurry management. "
        },
        {
            "heading": 2,
            "text": "Talk to us "
        },
        {
            "text": "It’s not too late to have your say. If you want to get in touch or would like to get involved in our co-design work, please contact the team. Our email is tacklingpollutionfromslurry@defra.gov.uk. "
        }
    ]
}