{
    "url": "https://designnotes.blog.gov.uk/2022/02/21/the-international-design-in-government-community-is-5-years-old/",
    "title": "The International Design in Government community is 5 years old!",
    "authors": [
        "Martin Jordan – former Head of Service Design, GDS",
        "Paloma Jain – Senior user researcher, GDS"
    ],
    "categories": [
        "Community",
        "International"
    ],
    "pub_date": "2022-02-21T10:13:32+00:00",
    "content": [
        {
            "text": "It’s been 5 years since the International Design in Government community started in February 2017. Since then, thousands of people have come together at dozens of events and countless online discussions."
        },
        {
            "text": "In 2018, we organised the first conference in London, and several events followed in 2019. Since the start of the pandemic, community activities have adapted to remote working. This blog post gives an overview of what happened in the last 2 and a half years and how the community continues to evolve."
        },
        {
            "heading": 2,
            "text": "The community 5 years on"
        },
        {
            "text": "The community continues to grow through word of mouth and referrals. With over 70 countries represented, our Google group has 1300 members and Slack is almost at 2500. People join as teams change — people move on and new team members join. They also join when teams grow and new teams form as user-centred design continues to be established as the best way of doing digital transformation. "
        },
        {
            "text": "2019 was a fantastic and busy year for the community. Since our last blog post in 2019, we’ve run events in Rotterdam and Berlin. The International Design in Government Conference in Rotterdam hosted by Gebruiker Centraal, the Dutch User Needs First Community gathered over 800 people over 2 days to focus on designing better government services. All of the keynotes, presentations, and photos are on the Gebruiker Centraal conference website. "
        },
        {
            "text": "To close out 2019, we hosted a session at the annual Creative Bureaucracy Festival in Berlin. The festival brought together ministers, permanent secretaries, civil servants and other public administrators to discuss public sector collaboration and experimentation. Our session brought together 5 speakers from 3 countries and 4 different organisations to talk about the role of design in transforming government. All of the talks are on the UK Gov Design YouTube channel."
        },
        {
            "text": "We also spoke about the international community on the GDS podcast. We discussed how it came about, the event formats and how the community is managed. "
        },
        {
            "heading": 2,
            "text": "How the community supported each other through the start of the pandemic"
        },
        {
            "text": "In April and August 2020, we ran community calls on COVID-19 responses. Community members from 6 governments – Canada, Germany, Singapore, Taiwan, the United Kingdom, and the United States – all shared how they are using design and technology to respond to the pandemic. We had over 100 participants, and content from the calls helped members share novel insights on things like contact tracing that they could apply to their current work.  "
        },
        {
            "text": "—Jennifer Weiley, Content designer for Service New South Wales, Australia."
        },
        {
            "text": "We created a new channel on our Slack group to share global COVID-19 responses, including work in progress, resources, and learnings around content design, volunteer coordination, and justice-related services."
        },
        {
            "heading": 2,
            "text": "Online events for a remote-first world"
        },
        {
            "text": "In our recent international calls, we’ve had community members sharing work on and discussing service standards, service assurance and end-to-end service design case studies. "
        },
        {
            "text": "Community members from Argentina, Norway and the Netherlands—Pablo Fernandez Vallejo, Tone Dalen, Synniva Larsen, Victor Zuydwey and Jessica Straetemans—have been collaborating on regular global webinars with various organisers from D-box, the Norwegian National Centre for Transforming Public Services, Forum for Service Design, a network of professionals in the Municipality of Oslo, Gebruiker Centraal, and the Secretariat of Innovation and Digital Transformation from the City of Buenos Aires. The first webinar in April 2021 with over 500 participants was on ‘How to build an innovation culture’, followed by ‘Ethics in design’ in October 2021. They’re preparing the next event for Spring 2022, an online workshop on sustainability. Everything is captured and shared online on the Design in Government Gebruiker Centraal website."
        },
        {
            "heading": 2,
            "text": "Future of the community"
        },
        {
            "text": "In the past few weeks, we have been gathering topics for upcoming community calls and plan to return to an increased frequency of the calls. Future themes include maturing design and scaling up, transforming complex services and designing services around life events.  "
        },
        {
            "text": "The community continues to grow and change as new people join, the maturity of user-centred design in government progresses, and as community members get more involved. The community is very much led by its members. It’s been amazing to have people like Tone and Viktor run large, impactful events for and with the community, and Susie Floresco who hosted one of the COVID-19 responses calls and has helped us record and host the calls over the years. The community is what we all make it, and we encourage people to get involved and shape the community to make it more useful, inclusive, and collaborative for everyone.  "
        },
        {
            "text": "One day we hope to return to face-to-face events alongside the online interactions. Several members of the community have expressed an interest in hosting a conference, and we’re supporting them by sharing how we’ve run them in the past and connecting them with others who have organised and hosted a community event. "
        },
        {
            "heading": 2,
            "text": "Progressing global digital government"
        },
        {
            "text": "The community is part of the UK’s wider interest in engaging internationally on digital government, to share knowledge and expertise and learn from others. GDS’s international work is all about partnership, not about pushing a UK blueprint. For example, the GDS International Team works with governments around the world to support them on their digital transformation agendas, taking a peer to peer approach and learning valuable insights that also help GDS progress. The team, along with others across GDS, are active in multilateral working groups, to help advance thinking and practice in the digital government field."
        },
        {
            "text": "All this international cooperation and engagement is critical to raising the bar on digital government globally and in helping us in the UK evolve and innovate. The UK is ranked 2nd in the OECD Digital Government Index and 7th in UN’s 2020 E-Government Development Index."
        },
        {
            "heading": 2,
            "text": "Join and contribute to the community"
        },
        {
            "text": "If you work for a government anywhere in the world, you can join the community and the regular calls by emailing to request to join. If you have colleagues already in our Slack group, then they can request an invite for you to join through the Slack feature ‘Add teammates’. "
        },
        {
            "text": "If you’re already a member and want to contribute, you can suggest, organise, host or present on an international call. You can collaborate with other members to run events, blog about your work, share resources, links, case studies and insights with the group, or you can welcome new members to the group and help people learn how to participate in the community."
        }
    ]
}