{
    "url": "https://homeofficemedia.blog.gov.uk/2022/02/21/were-taking-action-to-keep-britain-safe-from-russias-malicious-activities/",
    "title": "We’re taking action to keep Britain safe from Russia’s malicious activities",
    "authors": [
        "HO News Team"
    ],
    "categories": [
        "Ministerial opinion"
    ],
    "pub_date": "2022-02-21T11:48:31+00:00",
    "content": [
        {
            "heading": 4,
            "text": "Home Secretary Priti Patel writes in The Sunday Telegraph about the Government's work to keep the UK safe from Russia's security threats."
        },
        {
            "text": "The situation in Ukraine remains critical. As colleagues across government and friends around the world have said, an invasion by Russia would have disastrous and costly consequences for both countries, with an impact felt across the entire globe."
        },
        {
            "text": "The Government is doing everything it can to support British nationals still in Ukraine following the formal advice to leave. My department has taken quick and decisive action to support them and their families to travel to the UK. This has included implementing a dedicated visa helpline, prioritising family visas from Ukraine so they are processed in days rather than weeks, waiving the family visa application fee and ensuring that eligible family members of British nationals are granted a visa. Dedicated teams have also been prioritising passport applications – including surrogacy cases – and supporting the Foreign Office to issue emergency travel documents. All applicants are subject to rigorous checks to ensure that security is not compromised."
        },
        {
            "text": "While we seek to get British nationals to safety, the Russian Government is waging a disinformation campaign. This should come as no surprise and we should be prepared for more disinformation; we have seen it before, but we must look beyond it. From fabricating stories about the shooting down of the Malaysian airliner, MH17, in 2014, to the absurd excuses of the Russian agents who claimed they were visiting Salisbury Cathedral when they were actually deploying a military-grade nerve agent which killed a British person on British soil, we know the Russian regime follows a pattern of disinformation and deception to attempt to hide its outrageous actions."
        },
        {
            "text": "We are already seeing an escalation of Russian information operations clearly intended to provide a pretext for military action against Ukraine and we should expect to see more of this as the crisis develops, including information warfare and cyber attacks aimed at the West. The UK Government Information Cell has brought together our counter-disinformation expertise to identify and tackle Russian information aggression targeted at the UK."
        },
        {
            "text": "Since Salisbury we’ve made strides to disrupt malign influences in the UK. Following that attack, 23 Russian intelligence officers masquerading as diplomats were expelled from this country. The 2019 Counter-Terrorism and Border Security Act gave specially-trained police officers new powers to stop, question, detain and search individuals travelling through UK ports to determine whether they are involved in hostile state activity."
        },
        {
            "text": "In the last two years, the UK has introduced new sanctions regimes targeting those involved in serious corruption as well as those perpetrating some of the gravest human rights violations and abuses around the world. Last week, we took action to strengthen and expand our Russia sanctions regime, so that a greater number of individuals and businesses with links to the Kremlin will fall within scope. This will exert the greatest pressure on Russia to change course."
        },
        {
            "text": "I am committed to taking the strongest action possible to prevent criminals, kleptocrats and corrupt elites from exploiting our financial system and threatening our national security. Dirty money and corruption are at the heart of the Russian government and I will not accept the business model of stealing in Russia to spend abroad in places like the UK. That is why I have closed the golden visa scheme for good to eliminate the opportunity for people to pay their way into the country. We are intensifying our response to illicit financial flows, including from Russia, such as bringing forward legislation to unmask ownership of offshore properties in the UK."
        },
        {
            "text": "Dirty money linked to the Kremlin is not welcome in this country and I will use all the powers at my disposal against individuals who seek to harm our democracy and our people. They pose an irrefutable risk to the UK and global security, with associations and links to a full spectrum of crimes. We know who you are and will not hesitate to use our law and immigration enforcement powers against you with our international allies. But I will go further by introducing legislation to completely overhaul our powers to counter threats from foreign states and update our antiquated espionage laws. These powers will apply to any state conducting hostile activity on our soil and will make us much more resilient to foreign interference in the UK."
        },
        {
            "text": "Any conflict in Ukraine would not just be a foreign quarrel about which we know little. Its effects would be felt here too. In recent weeks this has included reports of malicious cyber incidents in Ukraine which bear the hallmarks of similar Russian activity. Our National Cyber Security Centre (NCSC) has confirmed that past Russian cyber activity has included attempted interference against UK media, telecommunications and energy infrastructure, and cyber criminals in Russia have targeted well-known firms in recent high-profile attacks."
        },
        {
            "text": "As Home Secretary, keeping the British public safe remains my number one priority and I will continue to discuss with my Five Eyes counterparts – as well as other allies – the further collective action we can take to protect our homeland security. The UK continues to work tirelessly alongside our allies to persuade Russia to step back from the brink, ensuring that we support the sovereignty of Ukraine, as well as protect ourselves at home and British nationals in Ukraine."
        },
        {
            "text": "We and our allies urge Russia to de-escalate, re-engage and choose the path of diplomacy. A further Russian military incursion would be not only a strategic mistake, but a political, military, humanitarian and financial disaster with nothing but tragic conclusions."
        }
    ]
}