{
    "url": "https://mhclgmedia.blog.gov.uk/2025/07/06/misleading-reporting-on-employment-rights-bill/",
    "title": "Misleading reporting on Employment Rights Bill",
    "authors": [
        "mhclgpress"
    ],
    "categories": [
        "Workers' rights"
    ],
    "pub_date": "2025-07-06T10:32:11+01:00",
    "content": [
        {
            "text": "Coverage in a Sunday paper today suggests our Employment Rights Bill will see private firms being pressured into hiring diversity officers and will impose a ban on ‘offensive banter’ in the workplace."
        },
        {
            "text": "This is not the case. No business would be required to hire staff to monitor speech or diversity, and our Bill does not affect anyone’s right to lawful free speech. Instead, it will strengthen protection against intimidating and hostile abuse as well as sexual harassment – upsetting remarks do not fall within the definition of harassment."
        },
        {
            "text": "As with all cases of harassment under the Equality Act 2010, courts and tribunals will continue to be required to balance rights on the facts of a particular case, and this includes the rights to free expression."
        },
        {
            "text": "Employers cannot, and are not expected to, police or control the actions of third parties. However, they can respond to inappropriate behaviour and must do so to protect their employees. "
        },
        {
            "text": "In response to these claims, the below line was issued: "
        },
        {
            "text": "A government spokesperson said:\"No business would be required to hire staff to monitor speech or diversity under the Employment Rights Bill. The Bill will not affect anyone's right to lawful free speech, which this government stands firmly behind."
        },
        {
            "text": "\"Upsetting remarks do not fall within the definition of harassment. We are strengthening workplace protections to tackle harassment and protect employees from intimidating and hostile abuse as well as sexual harassment.\""
        }
    ]
}