{
    "url": "https://buyingforschools.blog.gov.uk/2022/09/26/a-new-and-improved-framework-for-hiring-supply-teachers-and-other-temporary-staff/",
    "title": "A new and improved framework for hiring supply teachers and other temporary staff",
    "authors": [
        "Tom Harper, Supply Teachers Category Manager at Crown Commercial Service"
    ],
    "categories": [
        "Services"
    ],
    "pub_date": "2022-09-26T13:01:33+01:00",
    "content": [
        {
            "text": "Crown Commercial Service (CCS) has launched a new and improved version of its agency supply framework. The Supply teachers and temporary staffing framework has been approved by DfE and is now live on Find a Framework."
        },
        {
            "text": "Tom Harper is the Supply Teachers Category Manager at CCS. In this blog post, Tom will highlight the improvements to the framework and how you can access it."
        },
        {
            "heading": 2,
            "text": "What does the new Supply Teachers and Temporary Staffing (STaTS) framework offer you? "
        },
        {
            "text": "The framework will help schools fill temporary and fixed term teaching and non-teaching roles, from head teachers to clerical workers. Schools can also avoid temp to perm fees for a worker who has been in post for 12 weeks or more, providing 4 weeks’ notice is given. "
        },
        {
            "text": "With the support of our suppliers, partners and colleagues over the past 4 years, we’ve helped Multi-Academy Trusts, Local Authorities, secondary schools, primary schools and other education establishments save over £4m. The majority of these savings are over the past year or so as we’ve really started to establish the agreement in the market. The agreement provides a compliant procurement for schools, a standard set of terms and conditions that agencies must adhere to, and transparency of costs. "
        },
        {
            "heading": 2,
            "text": "You said the agreement is an improvement on the previous iteration, how? "
        },
        {
            "text": "The new agreement has 25% more suppliers than the previous version, which is twice as many suppliers than previously on the Managed Service Lots and means users will have even more flexibility when it comes to using their preferred suppliers. "
        },
        {
            "text": "We have a new Education Technology Platform Lot. The suppliers on this Lot have a number of different tech-based solutions to support you to connect directly with workers.  "
        },
        {
            "text": "We’re able to offer more detailed data to users to allow for budget planning and to enable them to see when and where their budget is being spent.  "
        },
        {
            "text": "STaTS also offers a simplified pricing model, moving from a percentage mark-up model to one that uses pounds and pence, offering more transparency, so schools can be confident they are choosing the most cost effective option and potentially greater savings.  "
        },
        {
            "text": "We partnered with YPO in the final year of the previous version of the agreement, which meant we were able to reach and offer even more support to schools wanting to transition onto the framework. The YPO partnership continues under STaTS, and we’re putting the final touches to further commercial partnership agreements with NEPO and ESPO, meaning the support for schools will be even stronger. "
        },
        {
            "text": "With the dedicated CCS team, our partners and the great support offered by colleagues at DfE, including the Get help buying for schools service, I’m hoping that we’re able to reach even more schools over the next few years and support them in moving over to the framework. "
        },
        {
            "heading": 2,
            "text": "So, is this all about saving money for schools? "
        },
        {
            "text": "Whilst this is a great benefit, it’s not all about the financial savings. The agreement offers robust background screening and safeguarding to DfE Keeping Children Safe in Education standards, meaning that schools have peace of mind on the suppliers they are contracting with and staff they are hiring. The suppliers are audited and accredited to show they have best practice standards in education recruitment.  "
        },
        {
            "text": "The biggest benefit from my point of view is that the framework offers consistent, pre-negotiated terms and conditions and a simple order form, meaning schools can focus their energy elsewhere knowing that their temporary staffing is taken care of.  "
        },
        {
            "text": "There are other benefits to using the agreement, you can check out the full list on the Supply teachers and temporary staffing framework webpage. "
        },
        {
            "heading": 2,
            "text": "Where can schools go if they want to see if their supply agency is on the list of agencies? "
        },
        {
            "text": "You can view the framework suppliers on our Supply teachers and temporary staffing framework webpage, but the best way to search for a supplier is through our Online Digital Tool. I’ve just finished working with our development team to implement some great new functionality for the tool, including a much sought-after Supplier Search function. The tool also lets you search for alternative suppliers using a school postcode. It will list suppliers within a radius set by the school and show their framework pricing clearly. Using the tool offers schools a way to get in touch with suppliers directly, with contact details listed for each supplier, too. "
        },
        {
            "text": "Schools can log into the tool using their DfE Single Sign-in account. This will be the email address and password you created when you first accessed DfE Sign-in. If you haven't used DfE Sign-in before you'll need to create a DfE Sign-in account. "
        },
        {
            "heading": 2,
            "text": "What do schools need to do to get started? "
        },
        {
            "text": "Get in touch! The team and I would be more than happy to have a conversation with any school, trust or local authority looking to use the agreement.  "
        },
        {
            "heading": 2,
            "text": "A final word… "
        },
        {
            "text": "I’m really proud of what this agreement has done over the past four years to support the education sector and I’m excited to see where the next few years take us. We will continue to build on the success of the previous iteration of the framework and work closely with our suppliers, partners and colleagues. "
        }
    ]
}