{
    "url": "https://ruralpayments.blog.gov.uk/2022/09/26/applying-for-a-new-cph-number/",
    "title": "Applying for a new CPH number",
    "authors": [
        "RPA Editor"
    ],
    "categories": [
        "Basic Payment Scheme"
    ],
    "pub_date": "2022-09-26T12:04:20+01:00",
    "content": [
        {
            "text": "At the Rural Payments Agency (RPA) we know how busy farmers and rural businesses are, and we are always looking for ways to improve access to our services to fit in with their demanding lifestyles."
        },
        {
            "text": "We have now launched a new form to help support those who are not already registered with us to get registered on the Rural Payments service and obtain a County Parish Holding (CPH) number which will provide them with more flexibility."
        },
        {
            "text": "CPH numbers are necessary for keeping livestock and for helping to trace livestock to prevent and control disease. It is a very busy work area, and we receive a lot of requests every year."
        },
        {
            "text": "Previously, the only way to access a CPH number as a new farmer or rural business was to contact our helpline to make a request. Moving to an online option will make things more straightforward. The new form will allow new farmers and rural businesses to register and obtain a CPH number without the need to call first, meaning that they can do it at a pace and time that suits them."
        },
        {
            "text": "During the busiest times of year, this will also help to reduce the number of calls coming to our helpline and make call wait times shorter for others."
        },
        {
            "text": "The new form is available on the ‘Register Land You Use To Keep Livestock’ page on GOV.UK page alongside some simple step by step instructions. The form itself asks for details such as name, address and contact information and details of livestock and the location where they will be kept."
        },
        {
            "text": "The new form should be simple to complete, and we have updated the GOV.UK page so that the terminology is less complicated. There is information about what to do if farmers and rural businesses need to contact with others such as slaughterhouses."
        },
        {
            "text": "Once completed the new form can be sent directly to us using the ‘email form’ function or by attaching it to an email. We’ve suggested some important steps within the instructions, for example the need to include a specific email subject, which will ensure the new forms safe arrival with the CPH team."
        },
        {
            "text": "We aim to issue a CPH number within 10 working days of receiving the new form. If the CPH number is needed sooner the new form asks for confirmation of the date livestock will arrive so we can prioritise its completion."
        },
        {
            "text": "We would urge farmers and rural businesses to ensure that they apply for CPH numbers in good time and ensure that the new form is completed in full and submitted correctly as this can delay the process."
        },
        {
            "text": "Existing farmers or rural businesses or those who need to make an amendment will still need to call the helpline for now, but we are working on expanding the online system to these customers in the future. When this is available, we will post further updates."
        },
        {
            "text": " "
        },
        {
            "heading": 2,
            "text": "Keeping in touch"
        },
        {
            "text": "Once we’ve allocated a CPH number we’ll confirm it via email, or letter if requested.  Alongside the newly allocated CPH number we’ll also be confirming the customer reference number (CRN) and single business identifier (SBI) which means farmers and rural businesses will have access to all the information that they need in one place. Our written communication will also align more closely with the language on the GOV.UK pages, so that it is easier to understand and to avoid confusion."
        },
        {
            "text": "You can follow us on social media to stay up to date with important updates such as this on the following accounts:"
        },
        {
            "text": "By following our social media channels and subscribing to our blog, you’ll be able to see when we post updates about important information. We also share top tips and announcements."
        },
        {
            "text": "You can also listen to The RPA Podcast which we have launched to help farmers, landowners and rural communities keep up to date with the latest news from RPA."
        }
    ]
}