{
    "url": "https://deframedia.blog.gov.uk/2022/09/26/government-reiterates-commitment-to-environmental-protections/",
    "title": "Government reiterates commitment to environmental protections",
    "authors": [
        "Defra Press Office"
    ],
    "categories": [
        "Weekly stories"
    ],
    "pub_date": "2022-09-26T17:14:36+01:00",
    "content": [
        {
            "text": "There has been significant media attention this weekend, including in the Financial Times, Times, and the Telegraph, focused on comments from environmental groups such as the RSPB, Wildlife Trusts, National Trust, Green Alliance and Wildlife and Countryside Link. These organisations have expressed concerns that announcements in the Government’s growth plan to reform bureaucratic processes in the planning system, create investment zones and unlock economic growth may impact on existing protections for the environment."
        },
        {
            "text": "We have always been clear that we do not intend to go back on our commitment to the environment. There has also been speculation that Defra may change or delay proposed Environmental Land Management schemes with coverage in the Observer and BBC Online."
        },
        {
            "text": "A Government spokesperson said:"
        },
        {
            "text": "Farming"
        },
        {
            "text": "As set out in the Growth Plan, we will be looking at the frameworks for regulation, innovation and investment that impact farmers and land managers, to make sure that our policies are best placed to both boost food production and protect the environment. This includes looking at how best to deliver the Environmental Land Management schemes to see where and how improvements can be made, and we will continue to work closely with the sector to ensure these are designed and delivered in their best interests."
        },
        {
            "text": "We’re not scrapping the schemes. In light of the pressures farmers are facing as a result of the current global economic situation, including spikes in input costs, it’s only right that we look at how best to deliver the schemes to see where and how improvements can be made."
        },
        {
            "text": "Boosting food production and strengthening resilience and sustainability come alongside, not instead of, protecting and enhancing our natural environment, and later this year we will set out more details of plans on how we will increase food security while strengthening the resilience and role of farmers as stewards of the British countryside"
        },
        {
            "text": "Nature "
        },
        {
            "text": "This Government has a world-leading agenda for nature recovery backed up by plans for a legally binding target to halt nature’s decline by 2030. Our 25-Year Environment Plan sets out our ambition for a growing and resilient network of land, water and sea that is richer in plants and wildlife. We will restore 75% of our one million hectares of protected sites to favourable condition, securing their wildlife value for the long term."
        },
        {
            "text": "Internationally we have also committed to protect 30% of the UK’s land and ocean by 2030 through the Leaders Pledge for Nature, committing to put nature and biodiversity globally on a road to recovery by 2030."
        },
        {
            "text": "In order to support this ambitious work, we published a Nature Recovery Green Paper earlier this year setting out proposals to reform our system of protections, including the Habitats Regulations. The Nature Recovery Green Paper consultation closed in May and we are now in the process of analysing responses with our response to be published in due course."
        },
        {
            "text": "The Government has also published new guidance on investment zones which aim to streamline and accelerate delivery of high-quality development for jobs and homes. This sets out our intention remove burdensome EU requirements which create paperwork and stall development but do not necessarily protect the environment."
        },
        {
            "text": "Follow Defra on Twitter, and sign up for email alerts here."
        },
        {
            "text": " "
        }
    ]
}