{
    "url": "https://defradigital.blog.gov.uk/2022/09/26/same-difference-the-two-sides-of-the-same-internship-coin/",
    "title": "Same difference: the two sides of the same internship coin",
    "authors": [
        "Elora Perocki",
        "Zach Shiels"
    ],
    "categories": [
        "Defra digital"
    ],
    "pub_date": "2022-09-26T14:26:51+01:00",
    "content": [
        {
            "text": "In National Inclusion Week, two young professionals, Zach Shiels and Elora Parocki, who recently spent time in Defra  through different internship schemes, reflect on their experiences and the things they learned."
        },
        {
            "heading": 2,
            "text": "Zach’s experience on the the Civil Service Autism Exchange Internship Programme"
        },
        {
            "text": "Hi, my name is Zach and I recently spent three weeks with Defra’s Digital, Data and Technology Service Management Office team, through the Civil Service Autism Exchange Internship Programme."
        },
        {
            "text": "Having only just finished my postgraduate degree in International Law, at the University of Kent, this was my first real experience in a professional environment, outside of part-time and more casual work."
        },
        {
            "text": "I got involved with the internship through one of the many opportunities afforded by the ‘Ambitious About Autism’ organisation, which focuses on providing opportunities and assistance, primarily to young people with autism."
        },
        {
            "text": "My gratitude that these programmes exist has been amplified by the terrific experience I have had while interning in this department."
        },
        {
            "text": "The role that I was assigned centred around designing a feedback survey for the monthly bulletin, to help improve it for the readers, by giving the editorial team who produce the bulletin targeted pointers on how to create an even better product in the future."
        },
        {
            "text": "I also spent a lot of my time shadowing colleagues and attending meetings, both within the function and across Defra as a whole."
        },
        {
            "text": "While I’ve found my time working here as an intern extremely insightful, in many different ways, and an invaluable experience, the best part was just experiencing the joy of being part of a team."
        },
        {
            "text": "Everyone I met and talked to was extremely accommodating and helpful, which was on top of Defra being the type of workplace which I would enjoy working at in general – although I wouldn’t miss the acronyms, personally!"
        },
        {
            "text": "I gained much more from the experience than I was expecting and have found it thoroughly worthwhile."
        },
        {
            "text": "Even though the intake for the 22/23 Civil Service Fast Stream (which I intended to apply to) has been paused, my internship here has made me much more interested in getting involved with a career in the civil service (obviously with a bias towards Defra!), and I certainly intend to have a shot at it – regardless of where life may take me next."
        },
        {
            "heading": 2,
            "text": "Elora’s internship experience"
        },
        {
            "text": "Hi, I’m Elora and I recently completed a 12-month internship with Atos, working with the account team delivering services for Defra. I studied Computer Science at the University of Bath and started working for Atos in September 2021 for a placement year."
        },
        {
            "text": "The internship was split into four rotations and during my second rotation I was placed in the Defra team. At the beginning of my rotation, I was given the objective of organising a showcase for Defra of Small and Medium Enterprises (SMEs) who are involved in the Atos Horizons program. The goal was to allow these businesses to demonstrate their decarbonisation capabilities, with the opportunity to build a relationship with Defra."
        },
        {
            "text": "This was a huge learning opportunity for me, not only to understand what is involved in planning an event such as this, but also learning how to network and interact with external partners. It was a great opportunity to build my confidence, and I received the full support of the team who allowed me to learn and try things for myself, whilst knowing I had the team for help if I needed it."
        },
        {
            "text": "An additional highlight was visiting N2S, an SME focused on secure and sustainable ICT asset recovery and recycling services. I was given a tour of their offices in Bury St Edmunds where I was shown the innovative approach they have developed to manage waste from redundant technology using environmentally friendly processes. It was great to be introduced to people within the company and find out about the wide range of roles that go into running an SME such as N2S. I was able to return to work and explain what I had seen to my managers."
        },
        {
            "text": "In the second half of my time with the Defra team, I was introduced to a more technical team, who allowed me to spend time shadowing them and sitting in during meetings and calls. As this role was more aligned to my studies at university, I found it fascinating to see how we work with the Defra Digital, Data and Technology team."
        },
        {
            "text": "The team was very accommodating, and I felt I was able to ask any questions, which was a big learning opportunity for me. The team helped me make the most of my experience. It was amazing to be involved with a team who are so passionate about their job and what they can achieve to help Defra. I thoroughly enjoyed my time working on the account and am pleased to have secured a role as an Agile Software Technologist Graduate at Atos, following my internship!"
        }
    ]
}