{
    "url": "https://insideDIO.blog.gov.uk/2022/09/26/thank-you-maam-dios-behind-the-scenes-contributions-to-hm-the-queens-funeral/",
    "title": "Thank you, Ma’am: DIO’s behind-the-scenes contributions to HM The Queen’s funeral",
    "authors": [
        "Mike Green"
    ],
    "categories": [
        "British Army",
        "Royal Air Force",
        "Royal Navy",
        "Working at DIO"
    ],
    "pub_date": "2022-09-26T16:25:30+00:00",
    "content": [
        {
            "text": "The Bearer Party formed of personnel from The Queen's Company, 1st Battalion The Grenadier Guards move the coffin of Her Majesty The Queen to the State Gun Carriage. [Crown Copyright / MOD 2022]After the sad news of the death of HM The Queen, the eyes of the nation and the world turned to the ceremonial elements that follow the death of a monarch, culminating in a state funeral. The Armed Forces were central to all of this and I’m proud to say were supported all the way by hard and dedicated work by DIO and our contractors."
        },
        {
            "text": "In the last couple of weeks you may have heard the phrase ‘Operation London Bridge’, the meticulously-detailed plan for what would happen in the aftermath of the death of the Queen, up to and including her funeral. There was a huge effort behind-the-scenes to support the thousands of Armed Forces personnel involved. The scale of this work was significant – for example, 10,969 ceremonial and supporting Service Personnel were fed, watered and accommodated by DIO and our contractors across a number of Defence sites."
        },
        {
            "heading": 2,
            "text": "Stepping in to support to Defence operations across the UK"
        },
        {
            "text": "While most of the ceremonial and military activity was taking place in London, other areas of the country were also involved. As HM The Queen died at her beloved Balmoral in Scotland, DIO provided accommodation, cleaning, catering and tailoring support at Edinburgh Garrison to around 320 military personnel. Similar services were provided at Leuchars Station, as well as at Gordon Barracks in Aberdeen for around 40 Police Scotland personnel, who escorted Her Majesty’s  coffin on its journey from Balmoral to Edinburgh."
        },
        {
            "text": "Foot Guard centralised tailors at Wellington barracks in London, worked hard to ensure everyone looked perfect for the Queen's funeral. DIO provided tailoring support at a number of military sites in the day's after HM The Queen's death. [Crown Copyright / MOD 2022]Meanwhile in Northern Ireland, catering and tailoring services were provided to units from the Army Reserve who were part of another operation, covering ceremonial duties during the visit of the His Majesty King Charles III. In the South West, DIO’s teams organised additional catering and tailoring for approximately 1,150 sailors at several naval establishments around Portsmouth and Gosport."
        },
        {
            "text": "The State Gun Carriage, which was pulled by 142 Naval Ratings carrying the coffin of Her Majesty Queen Elizabeth II moves along the Procession route, up Constitution Hill. [Crown Copyright / MOD 2022]At HMS Excellent the team even had to arrange the removal of a wall so that the State Gun Carriage could be taken from its storage room and transported to London, where it was used to carry HM’s coffin."
        },
        {
            "heading": 2,
            "text": "London and the South East"
        },
        {
            "text": "Several Defence sites in and around London saw an increase in personnel whose duties under Operation London Bridge required them to be located close by. In turn this meant DIO staff had to source additional temporary facilities, such as portable toilet and shower cubicles, and increase the WiFi capacity. The timings of military duties and rehearsals in the early hours resulted in personnel often taking their meals at unusual times, arranged by our contractors’ catering staff without complaint."
        },
        {
            "text": "Though the operation had been planned for many years, there were also new elements to consider. Additional troops were deployed to Aldershot Garrison in Hampshire and the Defence Geographic Centre at Feltham in London, in case they were required. As the site is due to close, there were no catering facilities available for the nearly 900 personnel temporarily staying there.  As a solution, DIO and  our contractors ESS contacted the Rugby Football Union, who kindly agreed to the use of their catering facilities at nearby Twickenham Stadium. Meals were then transported by the Army’s 7 Regiment Royal Logistic Corps to a dining hall they had set up at Feltham. A real team effort! Personnel at Feltham supported the Metropolitan Police in securing the route between Wellington Arch and the M25 on the way to Windsor for the funeral procession. Personnel from another site were also deployed to Paddington Station to direct members of the public, after the station had to close due to damage to the overhead lines."
        },
        {
            "heading": 2,
            "text": "The Defence Training Estate and security operations"
        },
        {
            "text": "Large open spaces were needed for rehearsals for the ceremonial elements of HM The Queen’s funeral. Much of this took place on two training sites, Brunswick Camp and Longmoor Camp. Brunswick Camp was used by around 1000 Service Personnel, with approximately 680 operating from Longmoor. As well as British personnel, representatives from the Armed Forces of Canada, Australia and New Zealand were also welcomed. In addition to needing space to practise their marching and musical activities, the personnel all needed to be fed and have facilities to sleep and wash. The DIO team was also honoured to host the new Prince and Princess of Wales, who visited to meet and thank personnel preparing to take part in funeral."
        },
        {
            "text": "The Security Services Group, the DIO team of experts which provides security to the nation’s most sensitive areas, was also involved. For obvious reasons I can’t go into detail, but SSG staff created a bespoke security system at Westminster Hall, where HM The Queen lay in state, and managed various other security systems across the Royal Estate and Whitehall, including Buckingham Palace and No 10 Downing Street."
        },
        {
            "text": "Our security officers from the MOD Guard Service (MGS) were also called upon. As I’ve already mentioned, a number of MOD sites saw a significant temporary increase in the number of personnel staying there. In turn, this of course leads to an increase in work for our security officers as they manage access. At RAF Northolt, the team had to manage the arrival of the press who were there to witness the landing and onward transit of Her Majesty’s coffin."
        },
        {
            "text": "DIO staff and contractors supported the Armed Forces' early morning rehearsals. [Crown Copyright / MOD 2022]The Security officers at Horseguards Parade and Hyde Park Barracks supported early morning rehearsals for ceremonial elements. All of this required flexibility and hard work, with officers taking on longer or extra shifts and additional officers deployed to MOD’s head office in Whitehall from their usual sites. In total, our dedicated MGS staff undertook well over 600 hours of additional work in support of Operation London Bridge."
        },
        {
            "heading": 2,
            "text": "Well-deserved thanks"
        },
        {
            "text": "I’ve been so proud to see all the hard work being undertaken by DIO staff all over the UK to contribute to this work, at what is a very sad time for the country and the Commonwealth. Our teams have done a fantastic job working behind-the-scenes to ensure the Armed Forces could give Her Majesty a fitting send-off."
        },
        {
            "text": "As well as our own staff, this has been a huge team effort with the Armed Forces, local authorities, and our contractors and suppliers. The feedback I’m getting from our teams is that everyone, whether military, Civil Servant or contractor, has pulled out all the stops and worked round the clock to make sure everything ran smoothly – a true ‘one team’ approach! That spirit of collaboration and problem-solving has been crucial, so a sincere thank you to all involved."
        }
    ]
}