{
    "url": "https://teaching.blog.gov.uk/2021/07/15/engaging-local-families-with-the-holiday-activities-and-food-programme-this-summer/",
    "title": "Engaging local families with the Holiday Activities and Food Programme this summer",
    "authors": [
        "Jan Lefley",
        "Susan Parish"
    ],
    "categories": [
        "COVID-19 support",
        "Primary schools",
        "Pupil wellbeing and behaviour",
        "Secondary schools"
    ],
    "pub_date": "2021-07-15T11:27:43+01:00",
    "content": [
        {
            "text": "Jan Lefley and Susan Parish are Holiday Activities and Food Programme coordinators and senior leaders in Romsey and Park Community Schools, who have organised activity schemes in Hampshire and beyond. They use their experience to talk us through how and why it’s so important to reach out to local families."
        },
        {
            "text": "The Holiday Activities and Food Programme (HAF) has provided us with a great opportunity to engage with the most hard to reach families in our areas."
        },
        {
            "text": "Last summer, with Department for Education (DfE) funding, we coordinated and delivered Connect4Summer, our HAF community programme. Running throughout Hampshire, Portsmouth, Southampton and the Isle of Wight, the main aim was to develop to the scheme in a way that would support children most impacted by the pandemic."
        },
        {
            "text": "Connect4Summer ran a variety of different activities across the regions, including creative arts, life skills, sports and computer sessions. We also instigated ‘The Family Programme’, which enabled all the family to participate together in creative and physical activities, as well as cooking."
        },
        {
            "text": "We had a total of 66 venues running as part of Connect4Summer, delivering programmes for under-fives through to teenagers. Inclusivity for all children and young people was essential, and often we needed to be flexible to adapt and extend our activities for different age ranges and SEND participants."
        },
        {
            "text": "Academic subjects such as Mathematics, English and Science were embedded in many of the projects we developed, along with knowledge building on core family values such as communication and trust. It was also important that projects for our older children and teenagers had a strong focus on the life skills and knowledge building that would be attractive to potential employers."
        },
        {
            "text": "Hot two-course meals were provided to everyone attending activities, along with regular ready-packed fresh meals, ingredients, and recipes for their families to take home."
        },
        {
            "text": "Due to Covid-19 we had to work hard to engage families in the programme and increase their confidence in the safety measures in place at our venues, while reaffirming the value of attendance."
        },
        {
            "text": "Reaching out to families through school networks is essential, and the following tactics used by our schools proved most effective:"
        },
        {
            "text": "We also worked closely with social workers and children’s agencies to integrate HAF into their communications with priority families, ensuring that they knew about the options on offer. The result of this partnership was one of the main factors in securing high numbers of attendance from those groups, which was fantastic."
        },
        {
            "text": "We highly recommend going above and beyond to encourage those in your area to take part, it is an extremely positive resource for children, schools, communities and wider, and has the ability to create a legacy of knowledge and support for families for long to come."
        },
        {
            "text": " "
        },
        {
            "heading": 3,
            "text": "Looking for more information on HAF?"
        },
        {
            "text": "Want to receive blog posts in your inbox?"
        },
        {
            "text": "Sign up to receive blog updates."
        }
    ]
}