{
    "url": "https://defencedigital.blog.gov.uk/2021/07/15/hello-world-from-the-digital-foundry/",
    "title": "Hello World from the Digital Foundry",
    "authors": [
        "David Tagg-Oram"
    ],
    "categories": [
        "Digital Foundry"
    ],
    "pub_date": "2021-07-15T15:43:10+01:00",
    "content": [
        {
            "text": "When we set up the Defence Digital blog in 2019, I couldn’t have believed how popular it would become across Defence. From the first blog post with the Royal Navy, to the latest blog from Strategic Command, every part of Defence has got involved, with new digital communities being formed and synergies being realised. "
        },
        {
            "text": "This growth in local digital culture has followed a similar path to the growth of a broader strategic narrative on the importance of digital for Defence, from the Prime Minister announcing in November 2020 that “new investment [will] be focused on the technologies that will revolutionise warfare” to the Chief of the Defence Staff stating that “software will be as important as hardware in determining what our armed forces will be capable of in the future”, culminating in the publication of the Integrated Review, Integrated Operating Concept and most recently Defence’s Digital Strategy. "
        },
        {
            "text": "The Digital Strategy explains the Ends, Ways and Means for a Single, Secure, Modern Digital Backbone for Defence. This will provide the foundations for Defence to pivot towards a digital future, with the new Digital Foundry (which I have the pleasure of heading up) focussing on accelerating digital delivery to our users. "
        },
        {
            "text": "But as the success of this blog over the last couple of years has proved, digital delivery isn’t new in Defence – and so \"Hello World\" is a bit disingenuous to the dozens of teams that have been pioneering what user-centric, agile delivery looks like in the context of Defence. So why is a Foundry needed now considering all these teams have been getting on with it already? "
        },
        {
            "text": "At the end of last year, Robin Riley, from the Defence Digital Service, pulled a multi-disciplinary team together to understand the digital delivery landscape in Defence, and what was needed for it to flourish. What followed was a discovery that explored the problem space and delivered a series of recommendations. These findings form the basis of the Digital Foundry, and the themes we plan to explore and develop going forwards. "
        },
        {
            "text": "The Discovery evidenced: "
        },
        {
            "text": "With this evidence, we approached the Ministry of Defence’s Chief Information Officer, the Vice Chief of the Defence Staff, the Commander of Strategic Command, and the Permanent Secretary, to establish the Digital Foundry as “a federated partnership between digital innovators that pioneers new ways to rapidly exploit Defence’s Data, accessed seamlessly through the Digital Backbone.” Tangibly, this means changing how Defence Digital is organised to deliver and enable digital services and evolving our relationship with local digital delivery teams to be more of a partnership. By empowering these local teams with improved professional freedoms and greater collective responsibility, we aim to grow the user-centric benefits whilst fixing the de-centralised problems. "
        },
        {
            "text": "We’re focussing our next alpha steps on four themes: "
        },
        {
            "text": "An early success for talent is an agreement to merge together all the disparate digital delivery teams in Defence Digital to create a new, single digital delivery organisation. This will mean digital elements of Application Services & DevOps (ASDT), our Centres of Expertise, Cyber Risk, Standards and the Defence Digital Service and more coming under one roof, allowing for better investment in common services and platforms; tooling and ways of working fit for modern day digital teams; fewer, clearer interfaces for our customers and partners, and; a critical mass for key skills. "
        },
        {
            "text": "More to come across all four themes in due course. "
        },
        {
            "text": "This is an exciting pivot moment for Defence, from the establishment of the Defence Artificial Intelligence (AI) Centre, through to Unified Career Management – we are radically changing to meet the challenges and opportunities of the information age. Digital Foundry is at the heart of this change, and we’ll be looking for great people and partners – military, civilian, industry, academia – to help us deliver for Defence and the nation. "
        }
    ]
}