{
    "url": "https://deframedia.blog.gov.uk/2021/07/15/henry-dimblebys-independent-review-of-the-food-system/",
    "title": "Henry Dimbleby’s independent review of the food system",
    "authors": [
        "Defra Press Office"
    ],
    "categories": [
        "Uncategorized"
    ],
    "pub_date": "2021-07-15T12:23:10+01:00",
    "content": [
        {
            "text": "There has been widespread coverage this morning of Henry Dimbleby’s independent review of the food system."
        },
        {
            "text": "Coverage has appeared in BBC News, Daily Mail, The Times, the Sun, The Daily Telegraph, The Guardian, FT, Daily Mirror, the I, the Express, Metro and multiple others, across broadcast, print and online. Pieces report on the main points and recommendations raised in the report, such as the proposals for measures to combat obesity and improve overall health of children and adults, and proposals for specific initiatives to educate children about nutrition at school."
        },
        {
            "text": "This review is an independent report led by Henry Dimbleby. Part one was published on 29 July 2020. The Government will respond in full to the report’s conclusions and recommendations in the form of a White Paper in the next 6 months, which will also set out our ambitions and priorities for transforming the food system."
        },
        {
            "text": "Environment Secretary George Eustice said:"
        },
        {
            "text": "“I would like to thank Henry Dimbleby and his team for their work on this independent review, showing the vital role our food system plays in all our lives."
        },
        {
            "text": "“This Government will carefully consider its conclusions and respond with a White Paper within six months, setting out our priorities for the food system.”"
        },
        {
            "text": "Follow Defra on Twitter, and sign up for email alerts here."
        }
    ]
}