{
    "url": "https://mojdigital.blog.gov.uk/2021/07/15/introducing-the-moj-digital-accessibility-team/",
    "title": "Introducing the MoJ Digital Accessibility Team",
    "authors": [
        "Beverley Newing",
        "Danielle Lyon"
    ],
    "categories": [
        "Accessibility"
    ],
    "pub_date": "2021-07-15T15:31:14+01:00",
    "content": [
        {
            "text": "This financial year, the MoJ has created a Digital Accessibility team, to start embedding accessibility across the justice system. Through a 6 month accessibility profession project and on-the-ground learning, combined with looking at the cross-gov accessibility landscape, we realised that we had a gap. People were aware of accessibility and very keen to build accessible services, but needed a bit more support and structure around it. So, after a successful proposal to the Central Digital Senior Management Team, we were set up!"
        },
        {
            "heading": 3,
            "text": "Who we are "
        },
        {
            "text": "The MoJ Digital Accessibility team is currently made up of two people - Danielle Lyon, Senior Product Manager, and Beverley Newing, Accessibility Lead. We’ll be expanding out to include a Delivery Manager and an Accessibility Specialist. "
        },
        {
            "heading": 3,
            "text": "What are our goals?"
        },
        {
            "text": "We have three main goals for the year:"
        },
        {
            "text": "That’s quite a lot of things! Danielle and Beverley have spent a lot of time planning out a roadmap for the year, so we can closely align our activities with these goals, and track activities, and progress against these goals."
        },
        {
            "heading": 3,
            "text": "What have we been up to so far?"
        },
        {
            "text": "So far, we’ve had a couple of different focuses. One has been raising awareness about our team. We held a launch party on the 19th March, to talk about our strategy and host some lightning talks from staff across Digital and Technology, which was very popular, and started lots of great conversations. We also presented on our team at the Chief Financial Officer’s standup, to 560+ people."
        },
        {
            "text": "We’ve then been using the network we’re building through these activities to help us gather user needs. We’ve also been analysing data from accessibility surveys run over the past 2 years, ran a breakout activity at our launch party, and have been speaking to different communities within the organisation. This has helped inform us on what structures to put in place, for people to access the services we’ll be offering."
        },
        {
            "text": "We’ve also been baselining our digital estate, and starting to identify what the highest priority services are, so we know where to focus our efforts first. We’ve been doing this with help from service owners and the product management community across the organisation, and with support from senior management. This will help us track progress, and also identify areas where we might need to pivot and iterate on our approach."
        },
        {
            "text": "Lastly, MoJ is not the first department to set up an accessibility team, so we’ve been speaking to the Heads of Accessibility in other departments to discuss their approaches, share our approach, and get feedback. Accessibility is an emerging profession in government, and so we’ve been keen to make sure we can learn from what other people have done, rather than starting reinventing the wheel."
        },
        {
            "heading": 3,
            "text": "What’s next for our team?"
        },
        {
            "text": "We have quite a big roadmap for the next 9 months! In the immediate future, we’ll be focusing on these things:"
        },
        {
            "text": "We’ve got a busy year ahead of us, but we’ve been overwhelmed with the support we’ve had so far, from all areas of the organisation. Accessibility is a team sport, and we’re super excited about what we’re going to achieve together for the rest of this financial year."
        }
    ]
}