{
    "url": "https://dataingovernment.blog.gov.uk/2021/07/15/join-us-at-dataconnect21-and-share-your-data-stories/",
    "title": "Join us at DataConnect21 and share your data stories",
    "authors": [
        "Data Standards Authority Team, CDDO"
    ],
    "categories": [
        "Events",
        "People and Skills"
    ],
    "pub_date": "2021-07-15T10:14:21+01:00",
    "content": [
        {
            "text": "You don’t have to look very far across government to know that data is now a clear focus of a lot of the work we all do."
        },
        {
            "text": "There are countless amazing projects, communities and platforms doing all kinds of fantastic work with data. But it occurred to us how amazing it would be to create a single place where anyone and everyone can come together to tell and hear all those data stories, discovering in detail how we’re all using data to help us all develop and improve the services we offer."
        },
        {
            "text": "That place is DataConnect21 - a week-long event organised by the Data Standards Authority and the Government Data Quality Hub, and running from 27 September to 1 October 2021."
        },
        {
            "text": "Many colleagues across government may find this event useful to discuss cross-government data. But if you’re in the public sector and share an interest in data story case studies, we recommend registering for this showcase of successes and examples of collaboration around the huge opportunities that come from using data better across the public sector."
        },
        {
            "text": "We’re calling it DataConnect because, while it’s an event about connecting data across government for the good of everyone, it’s also about connecting people."
        },
        {
            "heading": 2,
            "text": "How do I engage with DataConnect21?"
        },
        {
            "text": "Register if you’re  in the public sector! We can’t state this enough. While it’s obvious that data professionals such as data architects, engineers, policy experts and data scientists will want to pledge and attend sessions, DataConnect21 is a place for beginners too. From those with a casual interest in getting moving with their first data project, to simply wanting to find out how to take better care of their data, this is the place to start that journey."
        },
        {
            "text": "Whether you work in operations, products, policy, delivery management, comms or accounts, we can almost guarantee data will be having a big effect on the work you’re doing in government. The more we all learn from the work and experiences of each other, the more insight and skills we’ll gain."
        },
        {
            "text": "With DataConnect21 we want to:"
        },
        {
            "text": "You can look forward to sessions from the Data Standards Authority and Data Quality Hub explaining the work we’re doing to improve data sharing across government, and how you can help us do that even better. Coronavirus (COVID-19) restrictions-permitting, we’re aiming to run some in-person sessions in London, Bristol and Manchester focused on thought leadership, policy and practice and even a hackathon (yes, there will be cake)."
        },
        {
            "text": "Most importantly, though, we want to hear more from you! To give you some ideas in pledging a session, some popular formats include:"
        },
        {
            "text": "But these are only format guidelines. If you want to talk about how your organisation built a successful data sharing platform while dressed as unicycling crocodiles, we’d love to hear about it (and see it)."
        }
    ]
}