{
    "url": "https://insideDIO.blog.gov.uk/2021/07/15/last-chance-to-nominate-projects-for-the-sanctuary-awards/",
    "title": "Last chance to nominate projects for the Sanctuary Awards!",
    "authors": [
        "James Clare"
    ],
    "categories": [
        "Conservation",
        "Energy",
        "Environment and Ecology",
        "HMS Prince of Wales",
        "HMS Queen Elizabeth",
        "Portsmouth",
        "Sanctuary Awards",
        "Wildlife"
    ],
    "pub_date": "2021-07-15T14:19:04+00:00",
    "content": [
        {
            "text": "The coveted Silver Otter Trophy [Crown Copyright/MOD2017]Nominations for the Sanctuary Awards close on 31 July and it’s your last chance to nominate projects across our categories from the Individual Achievement Award through to the Social Value and Sustainable Procurement and Construction Award."
        },
        {
            "text": "The Sanctuary Awards have been recognising outstanding contributions to sustainability and conservation across the Ministry of Defence (MOD) since 1991. This year the awards will take place against the MOD’s Climate Change and Sustainability Strategic Approach, which sets out the department’s ambition to reduce emissions and contribute to the UK’s Net Zero goal."
        },
        {
            "text": "The Sanctuary Awards recognises and celebrates team and individual efforts across Defence, in the UK and overseas, to promote and advance sustainability from construction and equipment procurement to environmental and heritage conservation as well as recognising those who have built community awareness for their voluntary contributions."
        },
        {
            "text": "They are an opportunity for you to showcase the innovation, creativity and the positive actions you are championing for a sustainable future in Defence.  We’re still looking for nominations in the following categories."
        },
        {
            "heading": 2,
            "text": "Social Value Award "
        },
        {
            "text": "This celebrates projects focused on any of the social aspects of sustainability, including heritage, public access, community engagement and education."
        },
        {
            "heading": 4,
            "text": "Chicksands’ Historic Walled Garden "
        },
        {
            "text": "Last year the Restoration of Chicksands’ Historic Walled Garden Project won an award, for renovating the Grade II listed walled garden at Chicksands Camp in Bedfordshire."
        },
        {
            "text": "The project focused on sustainable solutions and wildlife conservation. A wildlife pond and formal beds have been re-established and the garden has become a sanctuary for serving personnel and the local community."
        },
        {
            "heading": 4,
            "text": "‘Be Seen, Be Safer’ campaign "
        },
        {
            "text": "This project was highly commended for the Social Value Award for reducing the number of complaints for low helicopter flying at RAF Shawbury, increasing the number of equestrian members wearing high-visibility clothing and ensuring aircrew were trained in measures to prevent equestrian disturbance when low flying."
        },
        {
            "text": "A campaign was launched which included annual rider awareness days attended by local riders, equestrian clubs as well as the British Horse Society. Over 4,000 pieces of high-visibility clothing and equipment have also been issued."
        },
        {
            "heading": 2,
            "text": "Sustainable Procurement and Construction Award "
        },
        {
            "text": "This celebrates projects that improve sustainability of equipment or services, management of supply chains or product life cycles or new build construction and refurbishment projects that innovate in fields such as new materials or design."
        },
        {
            "heading": 4,
            "text": "Corrugated Board for use in Military Level Packaging Project "
        },
        {
            "text": "This project sought to update the Defence Standard, which sets out the policy for corrugated materials used in packaging and had become outdated. The new, modernised approach gives greater scope for the use of commercially available materials in corrugated Defence"
        },
        {
            "text": "packaging, maximising the utilisation of recycled cardboard to help support the MOD’s Greening Government Commitments."
        },
        {
            "heading": 4,
            "text": "Princess Royal and Victory Jetties Project "
        },
        {
            "text": "This project won an award for reconstructing the jetties at Her Majesty’s Naval Base in Portsmouth to accommodate the Royal Navy’s two new aircraft carriers."
        },
        {
            "text": "The existing jetty was demolished and replaced with modern structures. New infrastructure was installed, including navigational aids and high voltage power supplies to power the carriers when they were berthed."
        },
        {
            "heading": 2,
            "text": "Individual Achievement Award "
        },
        {
            "heading": 4,
            "text": "#PlasticFreeBrize campaign "
        },
        {
            "text": "Last year, Sergeant Ryan Duffy won this award for his commitment in reducing single-use plastics at RAF Brize Norton. His achievements included a station wide campaign and the creation of a Sustainability Committee. His work to replace non-recyclable air cargo pallet bags with a recyclable, carbon neutral version has prevented over 10.5 tonnes in plastic waste going to landfill and reduced carbon emissions by 27 tonnes."
        },
        {
            "heading": 4,
            "text": "Protecting wildlife in Belize "
        },
        {
            "text": "Rebecca from Panthera inspecting a camera at 1963 Training Estate in Belize. [Copyright: Major Alan Grant]Last year, Becky Wooldridge, Wildlife Biologist for the international charity Panthera was highly commented for an award for her work in assessing the impact of military training on wildlife in the Training Areas of Belize."
        },
        {
            "text": "Becky has supported and advised DIO and the British Army Training Support Unit Belize on environmental, safety and land security matters. Becky trekked 250km on foot each month to set up, inspect and download information from motion cameras, taking her through adverse weather conditions and dense jungles with dangerous wild animals."
        },
        {
            "text": "If you’ve worked on a project that fits into these categories, please nominate it for an award by visiting our GOV.UK page."
        },
        {
            "text": " "
        }
    ]
}