{
    "url": "https://civilservice.blog.gov.uk/2021/07/15/my-life-my-career/",
    "title": "My Life, My Career",
    "authors": [
        "Clare Nasir, Author, Meteorologist, Climate Communicator and Mostly Climate podcast producer and TV broadcaster"
    ],
    "categories": [
        "A great place to work",
        "A Modern Civil Service",
        "A Skilled Civil Service",
        "An Innovative Civil Service"
    ],
    "pub_date": "2021-07-15T09:11:49+00:00",
    "content": [
        {
            "heading": 4,
            "text": "TV meteorologist and Met Office civil servant Clare Nasir takes a look back over her extraordinary 28-year career."
        },
        {
            "text": "“I would do this job for nothing,” – I recently admitted to my colleague Adrian."
        },
        {
            "text": "We were having one of those inspired moments, whilst producing our latest climate podcast for the Met Office."
        },
        {
            "text": "We had just recorded an interview with Prof Tim Lenton – a climate scientist who, with our host, climate scientist Dr Doug McNeal, discussed effortlessly Climate Tipping Points for a whole 45 minutes. I swear they didn’t come up for air. The wealth and depth of knowledge, and more so, the highly engaging nature of their conversation as they unpicked this gargantuan subject was just awesome to witness."
        },
        {
            "text": "Yes, in this moment, we were all in our happy place."
        },
        {
            "text": "Happy place"
        },
        {
            "text": "In fact when I joined the Met Office in the early '90’s, from the very beginning, I was immersed in my happy place. For the next seven years, I was riding on a jet stream of atmospheric science, computer analysis and fevered talk in the forecasting operations room, observing clouds with veteran Met Office people and just being at one with the weather."
        },
        {
            "text": "Since then I must have compiled and presented tens of thousands of weather forecasts - over many, many years."
        },
        {
            "text": "Like most of my meteorological buddies, I had a childhood interest in the weather and decided in my teens that I’d like to follow a career in science – focussing on the atmosphere and ocean. My degree in maths and Masters in applied marine sciences at the University of Plymouth were a great platform to launch this dream."
        },
        {
            "text": "The Met Office forecaster training was thorough and methodical, with intense academic courses and on-the- job training extended over three years. No year in weather is the same when it comes to understanding the workings of the atmosphere, and experience comes from being the tortoise rather than the hare."
        },
        {
            "text": "With the Met Office, I was stationed in various weather offices from Plymouth to Reading to London to Norwich, where I presented on Anglia TV. But then I found myself gravitating back to London where I was became part of the Met Office media team on the South Bank with Met Office media."
        },
        {
            "text": "It was here that I made the leap into mainstream TV."
        },
        {
            "text": "I left the Met Office at the turn of the century and joined the ranks of breakfast TV anchors - presenting and producing on GMTV for the next 11 years and soon became a recognised face in the street."
        },
        {
            "text": "At times, TV fame is strange, strangers stop and ask me for an instant weather forecast. But it’s never a chore – I love talking weather in all its guises,  I don’t find being recognised at all uncomfortable – and although being in front of the camera wasn’t my main ambition back in my teens – for decades now it has been an integral part of my work and life."
        },
        {
            "text": "Looking back, there were many halcyon days. My television career took me all over the world, filming documentaries for CBBC Fierce Earth (reporting on hottest, coldest, wettest places) to more mainstream TV such as Total Wipeout where I spent a colourful week in Buenos Aires, or diving off a 10-metre board for SPLASH."
        },
        {
            "text": "The thread throughout was my love for weather and climate, and my connection to the Met Office and their people remained rock-solid. During this time, I also wrote a number of books on weather."
        },
        {
            "text": "In 2015, I returned to the Met Office. I had trained in the 90's as a weather forecaster, working on the bench with a host of clever people forecasting for aviation, councils, media, utilities and so much more."
        },
        {
            "text": "For me, meteorology is a job of dreams. I feel inspired and extremely lucky each day to work in an internationally renowned organisation, they are the best in the business"
        },
        {
            "text": "I was approached by the communications team at the Met office to return and work with them developing and presenting content for their online channels and customers."
        },
        {
            "text": "Breed of their own"
        },
        {
            "text": "I leapt at the chance - to be surrounded again by people passionate about weather and climate was too good to turn down. Also, the inspiring HQ in Exeter is abuzz with cutting edge science, like a scene from Logon’s Run (70’s sci fi film). Meteorologists are a breed of their own. They transcend time, and the colleagues who I had the privilege to work with in back in the 90s were still there, making weather magic, not looking any different."
        },
        {
            "text": "Back to the podcast and working for free."
        },
        {
            "text": "Earlier in 2010’s, I co-hosted a BBC Radio 5live podcast with my fellow Met man, co-author and friend, Simon King. The series was aimed at those curious about meteorology. I worked with hardened radio producers, and learned a lot about developing, producing and presenting audio content."
        },
        {
            "text": "Once up and running back in the Met Office, I was unremitting in my relentless podcast pitch to the communications team at every opportunity, including meetings, over coffee or out for dinner."
        },
        {
            "text": "In the end I was given carte blanche to develop and present a weekly podcast. Luckily, comms team editor, Adrian Holloway had spent many years in BBC radio, and together, we launched Weather Snap – a 10-minute weekly weather podcast, touching on latest global weather, climate news and forecasts."
        },
        {
            "text": "We also reinstated the original Mostly Weather podcast, a longer show based on evergreen weather content, lead by our very own Jeff Norwood-Brown, featuring a great panel of effervescent weather geeks, including ex-BBC Penny Tranter, Helen Roberts and archivist Catherine Ross."
        },
        {
            "text": "Podcast success"
        },
        {
            "text": "However, it became clear that the amount of world leading research coming out of the Hadley Centre, (Met Office, climate science) was worthy of their own podcast. Our campaign to create such a show was a success, and this year we launched Mostly Climate, lead by Doug McNeal, which I co-produce."
        },
        {
            "text": "It’s down to those at the helm of my department who consistently exude an inherent trust in our team’s talent and creativity, that Met Office Communications surges from strength to strength in reaching new audiences."
        },
        {
            "text": "Over the last five years, I’ve been very proud to be a part of this creative hub, and look forward to many new projects in future. And yes, I do get paid to this amazing job, which is just an added bonus."
        }
    ]
}