{
    "url": "https://charitycommission.blog.gov.uk/2021/07/15/priorities-and-plans-as-we-emerge-from-the-pandemic/",
    "title": "Priorities and plans as we emerge from the pandemic",
    "authors": [
        "Helen Stephenson"
    ],
    "categories": [
        "Annual Report",
        "Business Plan",
        "Public Trust",
        "Strategy"
    ],
    "pub_date": "2021-07-15T15:39:53+01:00",
    "content": [
        {
            "text": "There is much yet to learn about the impact of the pandemic on the charity sector – on charities’ finances, their ways of working, and on the wider economic and social context in which they operate. But the unequivocal lesson of the past year is that a resilient, vibrant voluntary sector is not a ‘nice to have’ – charities and community groups are integral to the healthy functioning of our society and must play their full part in the long-term recovery from the crisis. Indeed, research published today suggests that a decade-long decline in people’s perception of charities’ importance in society is beginning to reverse, quite possibly because of what we have witnessed during the pandemic."
        },
        {
            "text": "The Commission shares in a collective responsibility for ensuring charities can meet that potential. We help secure the bond between the public and charities, ensuring they can inspire trust and support."
        },
        {
            "text": "That commitment runs like a thread through all our work during the past year, as it does through our plans for the months ahead, as set out in our annual report and business plan respectively, both of which we publish today."
        },
        {
            "text": "A key priority over the last year was to be ‘open for business’, ensuring all our potential customers receive an easy-to-access, efficient and high-quality service. I am proud that our Contact Centre was able to provide uninterrupted service throughout the pandemic, answering calls every working day throughout the crisis to help charities and trustees access advice and support. In total the team answered over answering around 57,000 calls last year. This was thanks not least to improvements in our IT infrastructure which allowed a seamless switch to home working in March of last year. Being ‘open for business’ has also meant transforming our approach to online guidance, ensuring it meets the needs of busy trustees. For example, we launched a new suite of 5-minute guides, which summarise the key ‘syllabus’ of charity governance, promoted earlier this year by an online campaign aimed at helping trustees to be ‘certain in uncertain times’."
        },
        {
            "text": "As well as helping trustees get it right, we have continued to work with partners to help prevent wrongdoing and harm in charities, responding robustly where we have found concerns. For example, this past year we concluded 4,712 regulatory action cases, of which 64 were statutory inquiries, and used our powers on 2,209 occasions to promote compliance with the law."
        },
        {
            "text": "Some of our ‘compliance’ work this year required us to steer a steady course through some controversial issues. Earlier this year, for example, we concluded that the National Trust did not breach charity law in publishing a reporting examining the links between its properties and histories of colonialism and slavery. I took the opportunity to set out, in a blog, what is expected of charities when they engage with controversial or divisive issues, and what our role is as regulator when there are questions about a charity’s behaviour. I explained that charities need to recognise the wide range of legitimate views and sensibilities that exist within the public on whose support all charities ultimately rely."
        },
        {
            "text": "We have continued to strengthen our approach to dealing with reports of serious incidents. In 2020-21, we promptly assessed 4,308 new reports submitted to us by charities. Of these, 425 related specifically to the pandemic, with the most common issue relating to concerns about a charity’s long-term financial sustainability."
        },
        {
            "text": "Looking ahead "
        },
        {
            "text": "Our business plan identifies the priorities that will help us deliver during the third year of our ambitious 5-year strategy. It has a sharp focus - we have worked hard to whittle down the many areas in which we can make progress, to arrive at the 4 core priorities that we must deliver on, in order to further our strategy and fulfil our purpose."
        },
        {
            "text": "The first of our these is to help charity to deliver as the country recovers from the pandemic. This is not about directly championing charities, nor is it about interfering in the work that individual charities deliver. But we can and must help busy trustees use the time they are able to dedicate to their charities to the best advantage, ensuring they comply with their responsibilities. This in turn helps ensure the charity as a whole is focused on its purpose and makes sound, responsible decisions. To this end, we are developing a new online portal, tailored to trustees’ needs, as well as sustained and targeted campaigns that help trustees understand their responsibilities and engage them with our growing suite of accessible guidance."
        },
        {
            "text": "Another key priority for the year ahead is to improve how we use data. Ensuring we hold the right data in the right format is central to becoming a more ‘intelligent’, proactive regulator, able to help charities address systemic or thematic risks before they become an entrenched problem. So, over the year ahead, we will begin a fundamental review of the data we collect from charities, including through the annual return and charities’ annual reports and accounts.  We will also review and improve how we make that data work once we hold it. As part of this, we will deliver further improvements to our public register, ensuring data serves to enhance charities’ public accountability and transparency, in turn building trust."
        },
        {
            "text": "We will also continue to prioritise a robust approach to regulation, putting the public interest front and centre of our work to identify and respond to wrongdoing and harm in charities. We know it matters to the public that there is a regulator fighting their corner, holding to account those who breach the rules and betray the trust placed in charities by donors and taxpayers. Here, the skills and attitudes of our staff will make the biggest difference. In the year ahead, we will work to build their confidence in delivering swift, robust, and purpose-driven case outcomes – supported not least by better and more accessible data and systems."
        },
        {
            "text": "Our final priority is our people. Our staff are our most important asset. Data is vital, systems matter, but our people – their expertise, knowledge, skills and commitment – will determine whether we are able to deliver on our 5-year strategy. To that end, we will set out a clear vision for the future of our workforce – how and where we work, how we support and develop our people, and what we want the culture and ethos of the Commission to be. We will also deliver initiatives that support the well-being and engagement of our people. Not just because we have a duty of care as an employer towards the people who work for us, but because we know a happy and engaged workforce is more productive, and more innovative."
        },
        {
            "text": "Our priorities may be simple to set out, but they will not be easy to achieve, especially in the context of rising case-loads and the context – at least in the short term - of remote working and the wider uncertainty in which our staff continue to operate."
        },
        {
            "text": "But I have confidence that we can deliver on these 4 key commitments, and that in doing so, we will help meet our purpose to ensure charity can thrive and inspire trust so that people can improve lives and strengthen society."
        }
    ]
}