{
    "url": "https://competitionandmarkets.blog.gov.uk/2021/07/15/promoting-competition-bulletin-july-2021/",
    "title": "Promoting Competition Bulletin July 2021",
    "authors": [
        "Andrea Coscelli"
    ],
    "categories": [
        "Promoting Competition bulletins"
    ],
    "pub_date": "2021-07-15T14:56:11+01:00",
    "content": [
        {
            "text": "The Competition and Markets Authority (CMA) has today published its Annual Report for 2020 to 2021, which explains how it saved consumers at least £2 billion.  The report demonstrates the considerable amount that the CMA has achieved this year, delivering all the goals in our Annual Plan, while at the same time dealing effectively with the additional areas of work prompted by coronavirus (COVID-19) and taking on our new responsibilities. This has been recognised externally with the Global Competition Review’s ‘Government Agency of the Year’ award. I have set out some of the highlights below."
        },
        {
            "heading": 2,
            "text": "Responding to the COVID-19 pandemic"
        },
        {
            "text": "The beginning of the 2020 to 2021 reporting year saw the CMA’s emerging response to the coronavirus pandemic, both in tackling the issues that impacted consumers and businesses, as well as the significant changes we made to our working arrangements."
        },
        {
            "text": "In our work to protect consumers’ rights we prioritised 5 sectors for investigation: holiday accommodation; weddings and events; nurseries and childcare; package holidays; and airlines. We have secured hundreds of millions of pounds in refunds for consumers from events and holidays cancelled due to the pandemic."
        },
        {
            "heading": 2,
            "text": "Protecting consumers, including in particular those in vulnerable circumstances "
        },
        {
            "text": "We have taken tough action over the past year to protect consumers, especially the vulnerable."
        },
        {
            "text": "In December 2020, the CMA accepted legally binding commitments from Essential Pharma to continue to supply the bipolar drug, Priadel, at an affordable price for at least 5 years. Withdrawing supply would have meant that thousands of patients would have been forced to switch to an alternative, more expensive treatment, which is also owned by Essential Pharma, and caused disruption for patients, while placing an even greater financial strain on the NHS at a time of unprecedented pressure."
        },
        {
            "text": "We also issued competition enforcement decisions against businesses in the £440 million musical instrument sector for preventing retailers from offering discounts, a practice known as resale price maintenance. In 2 separate cases against Roland and Korg, the CMA imposed fines totalling £5.5 million. Roland appealed against its fine to the Competition Appeal Tribunal (CAT), which in April 2021 rejected the appeal and upheld the CMA’s approach, increasing the fine from £4 million to £5 million."
        },
        {
            "text": "We continued our consumer protection investigation into care homes. In October 2020, the CMA secured more than £1 million in refunds for those NHS funded residents at Care UK’s premium care homes who paid an unfair additional fee towards essential care. Care UK has also formally committed to stop charging this additional fee to current and future residents at its homes."
        },
        {
            "text": "The CMA published the final report of its market investigation into funeral services. The report sets out remedies intended to support customers but also concluded that the CMA should consider consulting on a future market investigation when the impact and consequences of COVID-19 on the funerals sector are sufficiently understood and the sector is more stable."
        },
        {
            "text": "The CMA found that a merger in the educational resource sector could leave educational institutions with fewer alternative suppliers and worse terms when purchasing educational supplies. As a result, Yorkshire Purchasing Organisation abandoned the anticipated acquisition of Findel."
        },
        {
            "heading": 2,
            "text": "Improving trust in markets "
        },
        {
            "text": "The most meaningful way to restore confidence in markets is to make them work better in the interest of consumers. The CMA has continued to use its powers to impose fines on businesses for engaging in agreements and other practices that reduce competition, raising prices and limiting innovation in markets."
        },
        {
            "text": "We have increasingly used our director disqualification powers to ensure personal responsibility for such breaches. The CMA considers that individual directors should be held accountable when their companies break competition law.  In the last year the CMA has continued to ramp up its use of these powers securing 11 disqualifications arising from Competition Act infringements."
        },
        {
            "text": "We also welcomed the judgment from the Competition Appeal Tribunal (CAT), which upheld the decision to impose a £25 million fine on FP McCann Ltd for participating in an illegal cartel in the supply of pre-cast concrete drainage products, reflecting the seriousness of the infringement."
        },
        {
            "text": "We have taken tough action against the harmful effects of anti-competitive mergers, blocking or substantially remedying mergers that we considered would likely harm consumers interests. For example, the CMA required viagogo to sell StubHub’s international business outside North America (StubHub headquarters), after it concluded that the merger would lead to a substantial reduction in the supply of uncapped secondary ticketing platform services for the resale of tickets to UK events."
        },
        {
            "text": "In October 2020 we requested that the European Commission transfer the review of the merger between Virgin and O2 to the CMA. The merger was provisionally cleared in April 2021."
        },
        {
            "heading": 2,
            "text": "Tackling concerns in digital markets "
        },
        {
            "text": "Online markets have formed a significant part of our work over the past year. We welcomed the UK government’s response to our online platforms and digital advertising market study.  The government committed to introducing legislation to create a new pro‑competition regulatory regime to tackle the market power of technology giants like Google and Facebook. The Digital Markets Unit (DMU) was launched in shadow form within the CMA in April 2021 and will focus its work on preparing for the new regime."
        },
        {
            "text": "We continue to work to support greater coordination across regulation of digital markets, both domestically and internationally. We launched the Digital Regulation Cooperation Forum, alongside Ofcom and the Information Commissioner’s Office, to support closer collaboration across our work on digital markets. Internationally, we have continued to work closely with our counterparts in other jurisdictions."
        },
        {
            "text": "We secured commitments from Instagram, operated by Facebook Ireland Ltd, to tackle the risk that people can buy and sell fake online reviews through its platform."
        },
        {
            "text": "Also following CMA action, StubHub addressed our concerns about its compliance with existing undertakings to the CMA and provided an expanded set of undertakings to address newer concerns about its use of misleading messages."
        },
        {
            "text": "There were important cases in our mergers work relating to digital markets. We cleared the proposed acquisition by Amazon of certain rights and a minority shareholding in Deliveroo following an in-depth investigation. We completed our phase 1 investigation into the merger of Facebook and Giphy. The merger is now the subject of a phase 2 inquiry. Also in the digital space, a merger between Taboola and Outbrain, 2 leading providers of digital advertising to advertisers and publishers including major news sites, was abandoned following an investigation by the CMA."
        },
        {
            "text": "The CMA imposed a fine of £17.9 million on ComparetheMarket after it found that clauses used in the company’s contracts with home insurers breached competition law. The CMA found that this is likely to have resulted in higher insurance premiums in the £5.9 billion home insurance market.[1] The CMA’s decision is currently the subject of an appeal by the owners of ComparetheMarket to the Competition Appeal Tribunal."
        },
        {
            "heading": 2,
            "text": "Enhancing productivity and economic growth"
        },
        {
            "text": "Competition is good for consumers and good for business, and it brings wider economic benefits. It helps ensure that people get a greater choice of better products and services at lower prices. It rewards those businesses which invest in the development of new and improved products to meet people’s needs. It spurs businesses to seek more cost-effective ways of making and selling those products, so boosting productivity. The CMA’s competition and consumer protection interventions contribute to making this process work effectively."
        },
        {
            "text": "We have fined a number of businesses for cartels in the construction industry. This includes 2 UK roofing lead firms that we had broken the law by entering into anticompetitive arrangements in the UK.  Both firms admitted their roles in the illegal cartel and now face fines of £1.5 million and £8 million respectively. We also imposed fines on 2 companies who supply groundworks products of more than £15 million for illegally colluding to reduce competition and keep prices up."
        },
        {
            "text": "Where mergers have the potential to substantially lessen competition, as indicated above, this can dampen incentives to innovate and to keep costs down, thus leading to lower productivity and higher prices for consumers. In addition to those mentioned above, a merger between building supply companies, Kingspan and Building Solutions, was abandoned after we highlighted serious competition concerns."
        },
        {
            "text": "In our regulatory appeals work in March 2021 we published our findings following a redetermination of Ofwat’s price control for 2020-25 for 4 water companies."
        },
        {
            "text": "Our first ever State of Competition report was published in November 2020 and provided insights into the level and nature of competition across the economy and within a number of sectors."
        },
        {
            "heading": 2,
            "text": "Climate change – supporting the transition to a low carbon economy "
        },
        {
            "text": "Concerns about climate change are changing market dynamics and consumer behaviours across the UK economy. The UK committed to a legally binding target of net zero emissions by 2050 and clean growth is crucial to achieving this goal. We are continuing to develop our capability to act in a way which supports the transition to a low carbon economy in delivering our statutory functions."
        },
        {
            "text": "In November 2020, we launched an investigation into misleading environmental claims . The CMA is investigating how claims about the environmental impact of products and services are made including descriptions and labels used to promote products and services claiming to be ‘eco-friendly’, and whether they could mislead consumers. We have also launched a market study into electric vehicle charging, to help ensure that this new and fast-growing sector works well for UK drivers."
        },
        {
            "text": "One of the ways businesses are striving to meet climate change targets or other environmental objectives is through ‘sustainability agreements’. It is important that competition law does not become an unnecessary obstacle to sustainable development. With that in mind, in January 2021, the CMA published information to help businesses achieve environmental sustainability goals whilst staying on the right side of competition law."
        },
        {
            "heading": 2,
            "text": "Taking on new responsibilities, as a result of the UK leaving the EU "
        },
        {
            "text": "In the past year, the CMA continued its extensive preparations to ensure its readiness for its enhanced role, which began in January 2021, along with the opportunities and challenges this will bring. As a result of the UK fully leaving the EU at the end of 2020, the CMA is now responsible for the UK competition aspects of the larger cross-border mergers and antitrust cases that had previously been reserved to the European Commission."
        },
        {
            "text": "We have already opened new cases in antitrust and mergers as a result of the UK leaving the EU, including our investigation into the anticipated acquisition - worth an estimated $40 billion - of Arm by NVIDIA; Google’s proposed ‘Privacy Sandbox’ browser changes; and Apple’s conduct in relation to the distribution of apps on iOS and iPadOS devices in the UK. We have also published guidance on changes to our functions to support and inform businesses."
        },
        {
            "text": "We continue to work closely with our international counterparts. Earlier this year, we co‑led a project with the Netherlands Authority for Consumers and Markets, under the auspices of ICPEN, looking at green claims made online. The CMA has also joined forces with counterpart organisations in the United States, Canada and Europe to consider our approach to investigating pharmaceutical mergers."
        },
        {
            "text": "In September 2020, we signed a Multilateral Mutual Assistance and Cooperation Framework for Competition Authorities (MMAC), marking a new chapter in inter-agency cooperation to address cross‑border anti-competitive activity in an increasingly global economy. In addition, the G7 has invited the CMA to convene a meeting of G7 competition authorities in 2021 to discuss long term coordination and cooperation competition in digital markets."
        },
        {
            "heading": 2,
            "text": "Looking ahead"
        },
        {
            "text": "This year has been one of considerable change for the CMA, as we continued our preparations to take on our new responsibilities amidst the global pandemic. Despite the challenges we have faced, our staff have made incredible efforts to deliver a huge amount for the benefit of consumers, businesses and the economy. We have no doubt that 2021/22 will bring further challenges, but we are confident that the CMA is prepared for those challenges and we look forward to the opportunities presented by the changing landscape and our expanded role within it."
        }
    ]
}