{
    "url": "https://insidehmcts.blog.gov.uk/2021/07/15/safely-increasing-capacity-in-our-buildings-from-19-july/",
    "title": "Safely increasing capacity in our buildings from 19 July",
    "authors": [
        "Kevin Sadler"
    ],
    "categories": [
        "COVID-19",
        "General"
    ],
    "pub_date": "2021-07-15T16:00:17+01:00",
    "content": [
        {
            "text": "The Prime Minister’s announcement on Monday 12 July 2021 means that we are taking the next step on the roadmap out of national restrictions in England. This marks a turning point in our recovery – and a milestone in our journey back to normality."
        },
        {
            "text": "The government has confirmed that the legal requirement for social distancing in England will be removed from Monday 19 July 2021, as well as the detail of which other aspects of step 4 on the roadmap will be adopted. In Wales, meanwhile, it is hoped most coronavirus (COVID-19) restrictions will be lifted on 7 August 2021. In Scotland, it is hoped that all major restrictions will be lifted on 9 August 2021."
        },
        {
            "text": "With social distancing – the single biggest barrier to recovery – no longer required in England, we are reviewing our plans so that we can work within the new government and Public Health guidelines to increase our capacity and deliver services across our courts and tribunals for those who rely on us."
        },
        {
            "text": "Preparations and remaining vigilant"
        },
        {
            "text": "As the Prime Minister made clear, while cases are high and rising, everybody needs to continue to act carefully and remain cautious. We remain very aware that the pandemic is not over and, as I explained last week, this move to step four does not mean all of our safety measures will go. We will continue to work with Public Health organisations – as we always have – to ensure that we comply with health and safety standards and with the updated government guidance on working safely during coronavirus."
        },
        {
            "text": "We’ve already done much of this work in anticipation of Monday’s announcement, so will be finalising the details over the next few days."
        },
        {
            "text": "We’ll soon be sharing our revised organisational risk assessment. That document will form the basis on which we are working and will be kept under review in light of any additional guidance. Court and tribunal staff are already working on implementing these changes from Monday 19 July 2021. It also provides the basis on which local risk assessments are being carried out."
        },
        {
            "text": "The organisational risk assessment and our updated guidance will be published on GOV.UK on Monday."
        },
        {
            "text": "Measures to gradually and safely increase capacity"
        },
        {
            "text": "Working with the judiciary, we will be increasing capacity safely to reduce outstanding cases, and as a result the number of people in our buildings will gradually increase. This will happen alongside continued use of audio and video technology to enable remote attendance. We will also continue to encourage the regular use of lateral flow tests."
        },
        {
            "text": "From 19 July 2021, based on government and Public Health expert advice, our courts and tribunals in England will only be required to have minimal social distancing measures in place, with some exceptions:"
        },
        {
            "text": "Every HMCTS building has been thoroughly assessed against Public Health guidance for ventilation and we’ll continue with our existing ventilation standards. CO2 monitors will also be used as additional assurance in building areas identified through our risk assessment process."
        },
        {
            "text": "These details will be kept under review in the light of any further guidance from various safety and public health organisations."
        },
        {
            "text": "It is important that everyone using our courts and tribunals has confidence in these arrangements. I know that some of you will feel more comfortable than others as our working environment and people’s behaviour changes, but rest assured we will be managing the changes in a steady, careful way, with safety at the forefront of our minds at all times."
        },
        {
            "text": "Our role is to support the administration of justice safely – we have all the appropriate arrangements in place, and they are endorsed by Public Health agencies."
        },
        {
            "text": "Keeping the conversation going"
        },
        {
            "text": "Inevitably, you’ll have many questions and we’ll do our best to respond to them with the information available to us, making use of our existing regular meetings and communication channels to update you whenever we can. We will also be hosting an online panel discussion for legal professionals on Tuesday 27 July 2021."
        },
        {
            "text": "This transition period is one of mixed emotions – hope that it is the sign of things returning to normal, and perhaps some trepidation after so long living with safety measures that have become a routine part of all our lives. It will also be a period of hard work as we all play our part in interpreting the guidance, making changes to our buildings and our behaviour, and supporting each other and our court and tribunal users."
        },
        {
            "text": "Again, I want to thank you for your unwavering commitment to keeping justice going and to the effort you have all put – and continue to put – into that endeavour."
        }
    ]
}