{
    "url": "https://publicpolicydesign.blog.gov.uk/2021/07/15/taking-a-systems-approach-to-early-years-policy/",
    "title": "Taking a systems approach to Early Years policy",
    "authors": [
        "Alice Whitehead"
    ],
    "categories": [
        "Case study"
    ],
    "pub_date": "2021-07-15T15:35:07+01:00",
    "content": [
        {
            "text": "In 2019 the Cabinet Office ran a series of reviews in cross-cutting policy areas. One of these was into “early years”. This is a deliberately loose term but is usually interpreted as covering children’s development and life experiences from 0-4 years old. "
        },
        {
            "text": "The commission explicitly called for the reviews to take a systems approach. This permits a team to cast off the organisational knowledge and customs of which a person interacting with the system from the outside would be ignorant. They can therefore come closer to inhabiting that person’s experience of the system. It also gives them a mandate to investigate a whole issue and feel empowered to make recommendations that transcend organisational or political boundaries. "
        },
        {
            "text": "When a commission doesn’t do this, the default would be to examine the system as a collection of units (the independent bodies that form it), not a whole. The units could be within one organisation, or across an international playing field: seemingly unalterable realities of organisational responsibilities can exist anywhere, but applying a systems approach helps you to see past them to the outcome you want. "
        },
        {
            "text": "The Early Years team convened policy experts from across government to feed in to the review, but they wanted to complement this by researching and recording the perspectives of the people who use early years services: parents. To make this happen, Ministry of Housing, Communities & Local Government's User-Centred Policy Design team and Policy Lab joined forces with the team. "
        },
        {
            "heading": 2,
            "text": "Techniques to look at experiences of the system"
        },
        {
            "text": "As soon as we started looking into the policy area from the parents’ point of view, we observed that Government was asking them to understand and navigate a complex landscape of services on offer from different Departments. Of course, Departmental lines have to be drawn somewhere. But we thought it seemed possible to make it easier for busy, tired parents of young children to find and use services without having to be aware of the way government is organised."
        },
        {
            "text": "We used empathy-building exercises and journey mapping to help the policy teams start to understand the mindset of the parent. Language and narratives significantly affect how we relate to ideas and so it was important to us to move away from formal statements like ‘there is a variety of available services for parents of 2 year olds across the local authority area’ to more grounded, practical questions such as ‘what services are realistically likely to be used by a mum who works part-time and has a 2 year old?’ or ‘what if to go into town they have to take the bus?’ Far from trivialising the issues, this approach helps policymakers keep focus on practical outcomes for people in the real world."
        },
        {
            "text": "We also emphasised that parents experience government services in a wider ‘world’ context that includes advice from friends and family, media and social media, publicly provided services, private ones and online information.  Policy initiatives work best when designed to fit with this reality of experience, rather than being introduced on top of it. "
        },
        {
            "text": "The team commissioned video ethnography to research parents’ lived experience. As usual, seeing how people act in their homes and hearing their stories was very enlightening. The videos helped place all the research information in a more personal context. They also revealed new, specific details. For example one of the mothers talked about asking to attend (paid-for) antenatal classes before the birth of her second child, which was ‘not allowed’, but the centre allowed her to in the end after she expressed how anxious she was about it. This showed how some assumptions made in service commissioning that ‘make sense on paper’, like someone not needing to do the same round of classes twice, do not match up to individuals’ lived experience of important and emotional events. "
        },
        {
            "heading": 2,
            "text": "Communicating our findings about the system "
        },
        {
            "text": "Before we started this work there was no complete picture of the early years services landscape. Graphically representing what we discovered as a map altered people’s focus from looking at existing or new initiatives, to looking at a system and how well it was functioning overall. Our map recorded all the initiatives and policies, organising them according to lenses that reflected relevant systemic challenges, such as the ‘channel’ by which the service is delivered. "
        },
        {
            "text": "We found that some early years initiatives had been ‘designed’ within themselves, like Sure Start centres, but the design did not specifically take into account the wider landscape of services. Overall the system has evolved from the accumulation of disparate initiatives, rather than being designed to work as a collective to support each family on their journey. "
        },
        {
            "text": "Where systems are not designed, there is a higher risk that outcomes are not being achieved efficiently. In the case of marketplaces, like for nurseries and classes, having choice is desirable. But for expensive “targeted” services aimed at improving children’s chances in life, it might be that effort is being wasted trying to achieve the same thing through different channels. "
        },
        {
            "heading": 2,
            "text": "The impact of the work"
        },
        {
            "text": "All of the work was shared as it developed with policy leads in Department for Health and Social Care, Department for Education, Ministry of Housing, Communities & Local Government, and other relevant departments and has led into the development of Family Hubs policy. The service landscape approach that we researched and presented was used to inform the Leadsom review into ‘the first 1,001 days’ conducted from within Department for Health and Social Care, which was published in March 2021."
        },
        {
            "text": "We were very happy to have influenced the review to focus on systems and user experience, and to have had an impact on the attitudes of the policymakers we worked with."
        }
    ]
}