{
    "url": "https://educationhub.blog.gov.uk/2021/07/what-you-need-to-know-about-summer-schools/",
    "title": "What you need to know about summer schools",
    "authors": [
        "mediaofficer"
    ],
    "categories": [
        "Schools"
    ],
    "pub_date": "2021-07-15T15:34:51+01:00",
    "content": [
        {
            "text": "Helping students catch up is one of our priorities. That’s why we’ve provided £200m for a programme of summer schools as part of the £3 billion the government has invested in helping pupils boost their learning following the disruption caused by the pandemic. Eligible mainstream secondary schools can bid for funding to design their own summer school and help students who have experienced the most disruption. "
        },
        {
            "text": "Here’s what you need to know."
        },
        {
            "heading": 3,
            "text": "What are these summer schools?"
        },
        {
            "text": "Summer schools aim to support pupils to prepare for the next academic year. They offer a range of activities to help pupils catch up on lost learning due to the pandemic."
        },
        {
            "heading": 3,
            "text": "Who can go to them?"
        },
        {
            "text": "It’s for schools to determine which pupils would most benefit from a summer school."
        },
        {
            "text": "We expect, however, that most will want to focus on pupils making the transition into year 7. We know these pupils have missed time with their friends and will benefit from extra support to make the jump from primary school."
        },
        {
            "heading": 3,
            "text": "What will pupils do at summer schools? "
        },
        {
            "text": "Schools can set up their own programme based on their pupils’ needs. This means they can host a range of activities from ones that centre on academic studies and wellbeing, to trips, swimming lessons and sports days."
        },
        {
            "text": "Where a school runs a summer school for its incoming year 7, those pupils will have an opportunity to:"
        },
        {
            "heading": 3,
            "text": "So how many summer schools will be running during the holidays?"
        },
        {
            "text": "Nearly three quarters of eligible mainstream schools have already confirmed their involvement in the programme. That equates to thousands of schools across England."
        },
        {
            "text": "We are aware of media reports  that suggest far fewer schools are taking part. This is not the case and is based on research that included primary schools – while it is only secondary schools that are eligible for summer school funding. The majority of mainstream secondary schools are involved in the programme."
        },
        {
            "heading": 3,
            "text": "What about primaries then?"
        },
        {
            "text": "In primary schools, school leaders have the flexibility to target catch-up funding in the way that will best support their pupils, including through small group tutoring or access to technology."
        },
        {
            "text": "They may also choose to use this funding for summer provision, but there is no expectation on primary schools to do this, unless schools decide that is the best way to support young people."
        },
        {
            "heading": 3,
            "text": "How do I know if my school offers a summer school?"
        },
        {
            "text": "Schools will let parents know if they are planning to run a summer school and, if so, which children are eligible to take part."
        },
        {
            "heading": 3,
            "text": "Do children have to go to summer school?"
        },
        {
            "text": "No. Attendance at summer schools will be optional but we strongly encourage pupils who are offered places at a summer school to take them up as it will help give them a flying start to the new school year."
        },
        {
            "text": "As well as teaching, schools will provide fun activities, like team games, sports, arts and drama."
        },
        {
            "text": "More information on the summer schools programme is available on our website: Summer schools guidance - GOV.UK (www.gov.uk)."
        }
    ]
}