{
    "url": "https://defrafarming.blog.gov.uk/2021/10/22/bigger-better-more-joined-up-conservation-on-farms/",
    "title": "Bigger, better, more joined-up conservation on farms",
    "authors": [
        "Dr Robert Hawkes"
    ],
    "categories": [
        "A view from the farm",
        "Guest post",
        "Things we're doing",
        "Things we've learned"
    ],
    "pub_date": "2021-10-22T11:29:31+01:00",
    "content": [
        {
            "text": "If you want to encourage more of the right wild plants and insects on a group of farms, what parts of your farm should you target to get the best results? This is the question conservation scientist Dr Robert Hawkes explored with colleagues from the University of East Anglia, the Breckland Farmers Wildlife Network and Defra."
        },
        {
            "text": "Back in early September, Esther Rosewarne described how Defra had been running tests and trials with the help of groups of farmers working collaboratively on environment projects.  "
        },
        {
            "text": "One of the groups Esther mentioned was the Breckland Farmers Wildlife Network in East Anglia - a collective of 52 farms over more than 44,000 hectares, working together to \"create a landscape-scale wildlife network\".  "
        },
        {
            "text": "Many farmers collaborating at this sort of scale can make a big difference with the right approach to managing hedgerows, field edges and other habitats. "
        },
        {
            "text": "I'm not a civil servant, I'm a scientist. I've recently been part of a team from the University of East Anglia, working with colleagues at Defra and the Breckland Farmers Wildlife Network to take a closer look at some of the specifics of good agri-environment schemes.  "
        },
        {
            "text": "We already know that collaborative groups of farms are a good way of bringing about landscape-scale change, but we wanted to build on existing knowledge about what species to conserve and which options best suit their needs. In particular, we wanted to know where to prioritise effort.  "
        },
        {
            "text": "To put it simply: if you want to encourage more of the right wild plants and insects on a group of farms, what parts of your farm should you target to get the best results? "
        },
        {
            "text": "If implemented correctly, answering this question would allow us to achieve better, bigger and more joined up conservation on a landscape scale – an important aspiration, but one that is rarely achieved in practice. "
        },
        {
            "heading": 3,
            "text": "The answers are found in maps "
        },
        {
            "text": "Using a paper in the Journal of Applied Ecology which describes the species found in our region and their management needs, our team designed a tool that generates maps covering individual farms, small groups of farms, or the entire Breckland network. "
        },
        {
            "text": "We focused on a group of over 500 rare, scarce and threatened invertebrates and plants that benefit from a specific field margin management technique (cultivated but uncropped margins). The results look like this: "
        },
        {
            "text": "This map shows boundaries of arable fields on a single farm. The \"warmer\" green and yellow colours are places that are more likely to support priority plant and insect species. The cooler purples and reds show areas where those species are less likely to occur.  "
        },
        {
            "text": "On this farm, the model shows that it would make more sense to focus specific efforts in the upper-left corner of the map, where the warmer colours show up more. "
        },
        {
            "text": "As part of our work, we provided every member of the Breckland Farmers Wildlife Network with their own bespoke version of this map.  "
        },
        {
            "text": "It’s important to mention that we were only able to create this tool thanks to the phenomenal amount of wildlife records collected by experts and enthusiasts over the past 40 years. "
        },
        {
            "heading": 3,
            "text": "This is the start of something useful "
        },
        {
            "text": "Encouragingly, most of the Breckland group members said that this mapping tool was useful for them, and they were more likely to engage with coordinated landscape-scale conservation as a result of this test and trial. However, maps alone are only part of the solution.  "
        },
        {
            "text": "For many of them, the crucial detail is the payment rates they will get for delivering options in schemes like this."
        },
        {
            "text": " On some farms, if those payments aren't competitive, the conservation work is unlikely to go ahead. This would prevent our blueprint from turning into a reality. "
        },
        {
            "text": "Another finding from our year-long test and trial was the value of so-called \"mini-clusters\": groups of farms working together on a smaller scale on a day-to-day basis – as a way of coordinating a much larger cluster group. There's more research to do on this and other matters, and we're hoping to explore this in finer detail through a follow-up test and trial. "
        },
        {
            "text": "One thing we can say is that we think this model would work well in other places, so it could be scaled up to help other groups similar to the Breckland Farmers Wildlife Network. The essential ingredient is the detailed wildlife data for local areas, combined with knowledge about their management needs, and that is freely available across the country. The same approach could be used more widely for only a modest cost. "
        },
        {
            "text": "By highlighting the best areas wildlife conservation through a simple set of maps, we think this approach can empower farmers with the knowledge that their agri-environment actions will genuinely deliver, and in doing so, improve the sector's contribution towards nature recovery. "
        },
        {
            "text": "If you have any questions about my team's work with the Breckland Farmers Wildlife Network or questions for Defra colleagues, do comment below."
        }
    ]
}