{
    "url": "https://valuationoffice.blog.gov.uk/2021/10/22/how-we-value-independent-gas-transporters-and-independent-network-operators/",
    "title": "How We Value: Independent Gas Transporters and Independent Network Operators",
    "authors": [
        "matthewmountfordbrock"
    ],
    "categories": [
        "How We Value",
        "Valuation"
    ],
    "pub_date": "2021-10-22T11:17:22+01:00",
    "content": [
        {
            "text": "Jamie Gilbert is part of a small, dedicated team within the VOA’s National Valuation Unit, which is responsible for the valuation of the somewhat specialist class of properties including power generation and utilities."
        },
        {
            "text": "He specialises in smaller scale “independent” networks as opposed to larger distribution networks set up by traditional big electric companies. In this latest How We Value blog, Jamie explains the work that goes into coming up with a valuation for such a property."
        },
        {
            "text": "The power industry"
        },
        {
            "text": "Power generation is what it says on the tin. In terms of properties, this encompasses infrastructure such as anaerobic digestion plants and wind turbines, along with the traditional coal, gas and nuclear power stations – with a few other types of plants and stations in the mix too."
        },
        {
            "text": "Before the privatisation of the electricity industry in the early 1990s, any new supply work to a property was always carried out by the local electricity company. Following privatisation, the electricity companies competed to tender for works including the laying of cables."
        },
        {
            "text": "That’s where IDNOs and IGTs come in."
        },
        {
            "text": "IDNOs and IGTs (what?)"
        },
        {
            "text": "Their full titles are Independent Distribution Network Operators and Independent Gas Transporters."
        },
        {
            "text": "That’s all well and good but that doesn’t really explain what they actually are."
        },
        {
            "text": "IDNOs are normally low voltage underground cable connections, primarily to domestic properties but also to businesses. They are often called “over the last mile” connections in the industry, but we’ll stay away from industry knowledge and keep things simple - in a nutshell they are literally cables, under the ground of your street or nearby land, designed to carry power to homes and businesses around Britain. They are most commonly installed on a new build housing site. Given the demand for housing, we expect to see more and more of this type of installation."
        },
        {
            "text": "IGTs are like IDNOs except instead of cables they’re gas pipes."
        },
        {
            "text": "The IDNOs and IGTs are distribution networks and are not to be confused with gas and electricity suppliers who are separate entities."
        },
        {
            "text": " "
        },
        {
            "text": "The valuation process"
        },
        {
            "text": "IDNOs and IGTs are a class of property that will never require a physical inspection – all the infrastructure is underground so unless you are adept with a shovel, there is nothing to see."
        },
        {
            "text": "As a result, we value both IDNOs and IGTs on the Receipts and Expenditure basis, where we analyse the business’s accounts to work out a value-per-connection. At each revaluation, we meet with representatives of the industry and usually end up with a prior agreement where a rateable value per connection is reached."
        },
        {
            "text": "The total rateable value (including Local List and Central List) at the moment for IDNOs is just over £5 million and for IGTs the figure is just over £22 million."
        },
        {
            "text": "It is unlikely that anyone will ever come across these types of property, but if you are walking along a new service road to a housing estate somewhere, you will more than likely be walking above an IDNO asset without realising it."
        }
    ]
}