{
    "url": "https://marinedevelopments.blog.gov.uk/2021/10/22/the-mmo-and-climate-change/",
    "title": "The MMO and climate change",
    "authors": [
        "Tom McCormack, MMO Chief Executive"
    ],
    "categories": [
        "Blue Belt",
        "fisheries",
        "marine conservation",
        "marine licensing",
        "marine planning"
    ],
    "pub_date": "2021-10-22T09:13:00+01:00",
    "content": [
        {
            "text": "Climate change is bad news for everyone, from the prospect of fewer and smaller fish in the sea to the communities that will be affected by coastal erosion and flooding."
        },
        {
            "text": "I don’t think there has ever been such awareness of the threat of climate change to our planet.  The news of wildfires, droughts, floods, heatwaves, and other devastating consequences of global warming is now so frequent and still so alarming."
        },
        {
            "text": "And now there is greater understanding of how higher temperatures and rising sea levels cause seismic change – absorbing heat and carbon dioxide means altering the chemistry of seawater, changing currents and rainfall, shifting shores.  This leads to transformation in marine life, from flux in migratory patterns of some species to affecting the growth of some species."
        },
        {
            "text": "The good news is that while this is a global challenge, it can have local solutions, and the work we do together can help."
        },
        {
            "text": "Our mission as England’s marine manager is to protect and develop our seas, coasts and communities for the benefit of generations to come.  We also play a leading international role in Blue Belt, which works to enhance marine protection in over 4 million square km of ocean in the UK Overseas Territories."
        },
        {
            "text": "The UK is hosting the COP26 climate change meeting of world leaders in November, and they will focus on the following goals:"
        },
        {
            "text": "Across MMO we are focussing on how the job we do fits with these goals and the UK’s climate strategy, which advocates marine planning, nature-based solutions, and sustainable fisheries management.  You can find out more about the bigger picture in our magazine, Sea Views."
        },
        {
            "text": "Here are just some of the areas we are showcasing as the conference approaches."
        },
        {
            "text": "Marine Planning"
        },
        {
            "text": "We are now rolling out our new integrated marine planning framework for England.  Working with developers, planning authorities and other decision-makers we are demonstrating how Marine Plans – the first ever for England - can ensure their activities happen in a sustainable and coordinated way and help protect and enhance our marine environment and are a valuable tool for those making a contribution to net zero."
        },
        {
            "text": "The plans, which can be seen at  Explore Marine Plans, provide one comprehensive view of the coasts, estuaries, and tidal waters around England’s seas - an area of 230,000 square kilometres - and take into account everything that exists in the local area, from shipwrecks to marine wildlife, and existing uses such as cables, dredging or fishing."
        },
        {
            "text": "Sustainable fisheries "
        },
        {
            "text": "We are adapting together with the fishing industry to make fishing more sustainable in a number of ways, from collecting and using data more effectively to improving seafood labelling for better traceability and enhancing systems that provide certification for export."
        },
        {
            "text": "The majority of fishermen and women are doing their utmost to ensure we have accurate records of what is taken from the sea, where and when.  The fleet of smaller boats (under 12m) are making great strides in using new technology with over 80% now using the catch recording app and preparing to install vessel monitoring devices for the first time."
        },
        {
            "text": "At MMO, we have begun to phase in a new digital mobile app for our coastal officers to record inspection and sighting information, both at sea and on the coast, eventually providing a modern, more streamlined, and standardised process for inspection reports which will be of benefit for skippers and vessel owners."
        },
        {
            "text": "Our weekly bulletin provides an update on developments and useful information for the fish and seafood industry every Friday. Read the latest edition."
        },
        {
            "text": "Nature-based solutions"
        },
        {
            "text": "We are increasing the protection and management of our network of offshore Marine Protected Areas (MPAs) around England.  Working with all users of the sea, we are assessing what is needed to protect MPAs and where necessary restore their species and habitats, while allowing continued sustainable economic and recreational marine activities."
        },
        {
            "text": "There are 178 MPAs covering 40% of English waters – an area of over 92,000 square kilometres.  The majority are inshore (within 12 nautical miles) and already have management measures in place.  Our aim is that by 2024, the remaining 40 offshore MPAs (beyond 12 nautical miles) will also be appropriately managed."
        },
        {
            "text": "The UK has also launched plans to increase protection for England’s waters by piloting some marine sites as ‘Highly Protected Marine Areas’, where all activities that could have a damaging effect on wildlife or marine habitats would be banned."
        },
        {
            "text": "To support the long-term, holistic approach of the government’s 25-year Environment Plan, MMO ran the Marine Pioneer project, designed to prevent irreversible damage to biodiversity and a loss of natural capital through integrated planning and delivery and better funding mechanisms."
        },
        {
            "text": "Global influence"
        },
        {
            "text": "MMO plays a leading role in ocean protection and management as part of the UK Government’s Blue Belt Programme which this year exceeded its target of protecting and enhancing over 4 million square kilometres of marine environment around five UK Overseas Territories."
        },
        {
            "text": "Just recently, the government of the remote island community of Tristan da Cunha acknowledged the invaluable support of partners as it announced a management plan for its entire EEZ and ratified new legislation for a ‘no-take’ Marine Protection Zone of nearly 700,000 square kilometres, officially banning all extractive activities.  This vast area of the South Atlantic is home to unique and rare species such as the Tristan albatross, sevengill sharks, Tristan rock lobster and northern rockhopper penguins."
        },
        {
            "text": "Funding "
        },
        {
            "text": "The government’s £100 million UK Seafood Fund  has been designed to  rejuvenate the fisheries and seafood sector, take advantage of the UK’s additional fishing quota and bring economic growth to coastal communities."
        },
        {
            "text": "The first £24m of investment to develop technology, trial new gear and support world-class research to improve the productivity and long-term sustainability of the fishing industry has been released. The Department for Environment, Food and Rural Affairs (Defra) has divided the fund between science and innovation, infrastructure and skills and training."
        },
        {
            "text": "The whole fund is designed to ensure industry is able to process more fish landed in the UK and create more job opportunities across the supply chain. It will also upskill the workforce and train new entrants, as well as investing in technology to put the UK at the cutting edge of new safe and sustainable fishing methods."
        },
        {
            "text": "Since launching in April, the Fisheries and Seafood Scheme (FaSS) is providing financial support for projects in England that secure sustainable growth across the catching, processing, and aquaculture sectors, and that protect and enhance the marine environment. Find out more."
        }
    ]
}