{
    "url": "https://socialcare.blog.gov.uk/2021/10/22/wres-a-uniquely-personal-perspective/",
    "title": "WRES: a uniquely personal perspective",
    "authors": [
        "Charlotte Best"
    ],
    "categories": [
        "social work",
        "Viewpoint",
        "Workforce",
        "WRES"
    ],
    "pub_date": "2021-10-22T17:25:23+00:00",
    "content": [
        {
            "heading": 2,
            "text": "Change is needed"
        },
        {
            "text": "The London Borough of Barking and Dagenham (LBBD) is among 18 local authorities (LA’s) signed up to the social care workplace race equality standard (WRES) initiative. The WRES has identified flawed and excluding systems where change is required."
        },
        {
            "text": "In particular, I am interested in how councils will address the comparative rate of ethnic staff being appointed from shortlisting and the percentage difference between organisations senior management membership and its overall workforce and population."
        },
        {
            "text": "I have so many stories to share about my experiences of microaggressions, the lack of cultural competence within organisations, and the traumatic experience of psychometric testing and being ‘forgotten’ for interview after being shortlisted. Not surprisingly, these events can have a negative impact on self-esteem."
        },
        {
            "text": "Despite having to work within, what at times felt like a hostile working environment, there are some glimmers of hope of inclusion and acceptance here in LBBD. Whilst there remains an imbalance in the black staff to senior manager ratio, I am fortunate to receive supervision from a mirror image of myself - a thriving, caring and considerate manager, a black woman who validates my experiences, understands my desire for progression and supports me as much as her post allows."
        },
        {
            "text": "Following several trial-and-error attempts to progress into senior roles, I have recently been offered peer supervision through a children's services peer mentoring programme. The programme encourages connections between senior leaders and middle managers. I believe it is important for me to learn the rules of engagement or for this blog ‘initiation’ before I enter the ‘tribe’ of white senior management."
        },
        {
            "heading": 2,
            "text": "Adapting whilst staying authentic"
        },
        {
            "text": "To look like a senior manager, I will need to understand their culture, strategies and behaviours - and think about how best to conduct myself. I am faced with apprehension; ‘Will I fit in? What parts of myself am I expected to leave behind? Do I pretend to be like them or remain my authentic self? Will I flourish being an African Caribbean leader born in East London?"
        },
        {
            "text": "Visually, there is under representation of senior leaders across the board who look like me, and less who are from my tribe."
        },
        {
            "text": "Fortunately, I was shortlisted to attend a three-day bespoke training course for Black and Asian leaders (BALI) where the facilitator encouraged attendees to seek guidance from elders and mentors."
        },
        {
            "text": "I was inspired to think about creating my own ‘tribe’ within my organisation, without feeling excluded and look forward to thinking about this with my mentor.  I’ve thought about inclusive leadership in the workplace which reflects the community we serve."
        },
        {
            "text": "Upon Reflection, there is a lot of tribalism and initiation process in becoming a senior leader, I hope to get some guidance from my white male mentor including agreed goals, opportunities to shadow others and participate in meetings.  I am excited to embark upon this discovery mission to learn  what these senior managers do, why they do it and what it takes to withstand the pressure at their level."
        },
        {
            "heading": 2,
            "text": "Reasons to be hopeful"
        },
        {
            "text": "I have been encouraged to participate in LBBD in-house leadership course, although I would prefer a bespoke course similar to that of the Black and Asian Leaders Initiative (BALI) programme where I was assisted to think about the additional expectations of being a black leader through discussions and material."
        },
        {
            "text": "I believe I have something different and great to bring to leadership where my rituals coincide with organisational processes harmoniously. I want to offer hope, opportunity, validation, guidance, and support to some of the most vulnerable children and families within our communities we serve including our workforce."
        },
        {
            "text": "I have seen movement here in LBBD where black senior managers have been appointed, and I am cautious as to whether the WRES, like many other initiatives, can be authentic in the way it addresses the issue. But I do accept we need to start somewhere, and I am in no way oblivious to the fact more needs to be done within the council and across the social care profession as a whole. I therefore welcome any positive changes the WRES can bring!"
        }
    ]
}