{
    "url": "https://defraenvironment.blog.gov.uk/2024/03/01/improving-water-quality-by-tackling-storm-overflow-discharges/",
    "title": "Improving water quality by tackling storm overflow discharges",
    "authors": [
        "Environment blog team"
    ],
    "categories": [
        "Nature",
        "Water"
    ],
    "pub_date": "2024-03-01T09:48:22+00:00",
    "content": [
        {
            "text": "Nestled beneath a sewer pipe on the River Tame in the West Midlands is a small blue box, surrounded by wires and sensors. It may appear like a relatively innocuous piece of equipment, but – along with almost 15,000 other similar pieces of equipment dotted around England – it is a key piece in the puzzle to tackle sewage spills. "
        },
        {
            "text": "The blue box is an Event Duration Monitor. These monitors are installed at points in our sewers where water is released into streams, rivers and coastal waters if the system is overwhelmed – usually during periods of heavy rainfall. These points are called storm overflows.  "
        },
        {
            "text": "Water companies have been condemned by government, the Environment Agency, campaigners and the public for allowing far too many sewage spills from storm overflows into rivers.  "
        },
        {
            "text": "Event Duration Monitors record water company discharges into the environment, as the monitor tracks when, and for how long, a storm overflow is discharging.  "
        },
        {
            "text": "As of the end of last year, 100% of storm overflows in England are now fitted with monitors – up from just 7% In 2010. "
        },
        {
            "text": "How data from the monitors is used "
        },
        {
            "text": "Water companies are obliged to monitor and report Event Duration Monitor data to the Environment Agency, who then publish the data on an annual basis.  "
        },
        {
            "text": "This information is crucial for holding water companies to account if they spill sewage outside of their permit conditions. If illegal discharges from storm overflows are identified, they will be investigated and water companies could face enforcement action. "
        },
        {
            "text": "Better monitoring should ultimately mean less pollution in our waterways. It gives us the tools to implement lasting change to secure clean and plentiful water for future generations, as set out in the government’s Plan for Water.  "
        },
        {
            "text": "What else is government doing to tackle storm overflow discharges? "
        },
        {
            "text": "As part of the government’s Storm Overflow Discharge Reduction Plan, water companies are required to deliver their largest ever environmental infrastructure investment – with an expected £60 billion of capital investment over 25 years. "
        },
        {
            "text": "Solving the problem of storm overflow discharges will not happen overnight. There are over 62,000 miles of combined sewers in England, with enough pipework lying below our villages, towns and cities to go 2.5 times around the Earth. A complete and immediate overhaul of the current sewerage infrastructure would therefore have a significant impact on our daily lives. "
        },
        {
            "text": "But we are speeding up action – with £2.2 billion of new, accelerated investment being injected into vital infrastructure - £1.7 billion of which is being used to tackle storm overflows, in areas including Lake Windermere, the River Wharfe, Falmouth, and Sidmouth. "
        },
        {
            "text": "The plan mandates water companies to improve all storm overflows near designated bathing waters and 75% of those at high-priority sites by 2035, with all remaining overflows to be upgraded by 2050 – now including coastal and estuary waters, after last year's target extension. "
        },
        {
            "text": "The targets will be kept under review – with an initial reassessment in 2027 – to establish if companies can go further and faster.  "
        },
        {
            "text": "Holding water companies to account "
        },
        {
            "text": "This is just one of the ways that government are going further than ever before to hold water companies to account.  "
        },
        {
            "text": "We have removed the cap on civil penalties (Variable Monetary Penalties) and significantly broadened their scope to target a much wider range of offences, so that swifter action can be taken against those who pollute our waterways. "
        },
        {
            "text": "The most serious cases will always be dealt with by the courts. Since 2015 the Environment Agency has concluded 60 prosecutions against water and sewerage companies, securing over £150 million in fines.  "
        },
        {
            "text": "These financial penalties will go into our new Water Restoration Fund, which will funnel this money into projects that improve the environment.  "
        },
        {
            "text": "And we are going further – the Environment Agency and Ofwat have also launched the largest criminal and civil investigations into water company sewage discharges ever, at over 2,200 treatment works.  "
        },
        {
            "text": "The number of water company inspections will also increase more than fourfold, with more unannounced inspections to crack down on poor performing companies. "
        },
        {
            "text": "Finally, Ofwat has outlined new measures to ensure customer bills do not fund executive bonus payments for poor performing companies. They also intend, subject to consultation, to ban water company bosses from receiving bonuses if a company has committed serious criminal breaches. "
        },
        {
            "text": "This is just a snapshot of our efforts to provide more investment, stronger regulation and tougher enforcement to secure clean and plentiful water for generations to come.  "
        },
        {
            "text": "For future updates on similar environmental policies, please subscribe to our blog."
        }
    ]
}