{
    "url": "https://defrafarming.blog.gov.uk/2024/03/01/join-our-webinar-for-upland-farmers/",
    "title": "Join our webinar for upland farmers",
    "authors": [
        "Becky Briggs"
    ],
    "categories": [
        "Sustainable Farming Incentive",
        "Webinars"
    ],
    "pub_date": "2024-03-01T12:00:56+00:00",
    "content": [
        {
            "text": "On Wednesday 27 March, we’re holding a webinar for upland farmers to learn more about the funding opportunities available in England in 2024."
        },
        {
            "text": "The webinar will focus on the Sustainable Farming Incentive (SFI)  Policy leads from these areas, colleagues from the Rural Payments Agency (RPA) and a farmer already in SFI, will be there to answer your questions."
        },
        {
            "text": "To attend the 1-hour session, reserve a place on Eventbrite."
        },
        {
            "text": "Once you register, you can ask and upvote questions on Slido. You’ll be able to do this during the webinar too."
        },
        {
            "text": "It will be recorded so if you can’t attend, don’t worry. The video recording will be added to this post after the webinar ends."
        },
        {
            "text": "To prepare, you might find it helpful to read: New and improved actions for upland farmers."
        },
        {
            "heading": 3,
            "text": "Apply now for the SFI "
        },
        {
            "text": "We’re rewarding farmers for farming practices that help produce food sustainably and protect the environment, through the SFI. "
        },
        {
            "text": "It's open for applications today. Join more than 12,500 farmers who have already submitted an application. "
        },
        {
            "text": "Apply now and you’ll receive your first payment 4 months after your SFI agreement starts. After that you’ll be paid every 3 months, so you have regular, reliable income. "
        },
        {
            "text": "You can add actions to your agreement annually - or take out an additional agreement when further actions become available.  "
        },
        {
            "text": "There are 23 actions on offer. You can now check what SFI actions you can get paid to do on your land type.  "
        },
        {
            "text": "If you wait for the new actions coming in summer, you could lose out on funding. "
        }
    ]
}