{
    "url": "https://naturalengland.blog.gov.uk/2024/03/01/joining-up-nature-recovery-and-health-priorities/",
    "title": "Joining up nature recovery and health priorities",
    "authors": [
        "Natural England"
    ],
    "categories": [
        "Environmental Improvement Plan",
        "Mental health and wellbeing",
        "Natural England",
        "Science and evidence"
    ],
    "pub_date": "2024-03-01T15:38:20+00:00",
    "content": [
        {
            "text": "By Ruth Lamont, Principal Adviser in Research Ethics & Dave Bell, Principal Adviser in Health, Wellbeing and the Environment, at Natural England"
        },
        {
            "text": "We know that nature, human health and well-being are intrinsically linked, and this week, Natural England has released its most extensive review to date on this topic."
        },
        {
            "text": "Nature is life. It underpins everything we do. It provides us with clean air, food, water and shelter. It regulates our climate and controls disease. It is fundamental to our health and well-being."
        },
        {
            "text": "Natural England’s newly published ‘review of reviews’ screened over 2,000 evidence reviews and identified 104 key publications that inform our understanding of the relationships between nature and human health and wellbeing."
        },
        {
            "text": "The report summarises key evidence for the benefits of nature-based interventions for people, like outdoor exercise, education and gardening. Conversely, it also highlights evidence for the negative impacts of contaminated and degraded nature on human health and well-being, and outlines where more research is needed. This includes showing how nature improvement activity impacts those living nearby."
        },
        {
            "text": "Evidence reviews like this are key to understanding how improvements in nature could also benefit human health and well-being, identifying opportunities for collaborative action."
        },
        {
            "text": "Wider support across government is a move in the right direction"
        },
        {
            "text": "England’s Environmental Improvement Plan offers a strong framework to enable this collaborative action, including the goal for everyone to live within 15 minutes’ walk of a green or blue space, and action to reduce other barriers which prevent people from accessing these spaces."
        },
        {
            "text": "It is also encouraging to see growing cross-sector recognition for the benefits of nature. Green social prescribing is embedded within the NHS long term plan, and accessible greenspace is highlighted as a determinant of health in the Department for Health and Social Care’s 'Major Conditions Strategy’. The Department for Education’s ‘Sustainability and Climate Change Strategy’ (2022) draws on learning in the natural environment for physical and mental health, and the Government’s Levelling up Missions note the importance of access to natural spaces. These are all important steps forward."
        },
        {
            "text": "What next?"
        },
        {
            "text": "We will better realise nature’s full potential and optimise its benefits for our health and well-being if we continue to work across-government and through partnerships, taking an evidence-led approach."
        },
        {
            "text": "At Natural England, we will continue to build partnerships and a robust evidence base around the links between nature, and health and well-being."
        },
        {
            "text": "If you would like to get in touch or join our growing network on this important topic, contact dave.bell@naturalengland.org.uk"
        },
        {
            "text": "The ‘review of reviews’ is available to read here."
        }
    ]
}