{
    "url": "https://governmentscienceandengineering.blog.gov.uk/2024/03/01/science-delivery-lead-moj-science-office-data-and-analysis-directorate-ministry-of-justice/",
    "title": "Science Delivery Lead, MoJ Science Office, Data and Analysis Directorate, Ministry of Justice",
    "authors": [
        "gseprofession"
    ],
    "categories": [
        "Blog Series"
    ],
    "pub_date": "2024-03-01T10:27:00+00:00",
    "content": [
        {
            "text": "The Ministry of Justice (MoJ) Science Office’s objective is to support the Chief Scientific Adviser in embedding science and engineering in decision-making across MoJ. The team supports a range of strategic functions, including supporting senior colleagues with delivery of their priorities, and planning and delivering pilots and projects. The team works with policy and analysis teams across HMPPS, HMCTS, MoJ, other government departments, devolved administrations and delivery partners. The Science Office also acts as the vital link between the MoJ and the cross-government Chief Scientific Adviser network."
        },
        {
            "text": "The role"
        },
        {
            "text": "We are recruiting for a G7 Science Delivery Lead to spearhead our portfolio of applied science projects.  Currently the brief includes environmental surveillance (wastewater-based surveillance, air monitoring & ventilation) and sustainability initiatives. The duties include contract management, strategy development, continuous improvement and quality assurance of activities that are currently being delivered, as well as stakeholder engagement and business development activities."
        },
        {
            "text": "More broadly, the post holder will contribute to the development of Science Office strategy. Additionally, the post holder may be requested to lead on the evaluation and delivery of new technologies, research projects, and pilot studies that have been requested to be considered for MoJ. Lastly, the postholder will be expected to play an active role in the leadership of the science office and to own corporate work strands."
        },
        {
            "text": "For more information, including the full job description and how to apply, please see the Civil Service Jobs webpage here."
        },
        {
            "text": "Apply before 11:55 pm on Wednesday 13 March 2024."
        }
    ]
}