{
    "url": "https://sustainableict.blog.gov.uk/2024/03/01/taking-stock-and-planning-ahead/",
    "title": "Taking stock and planning ahead",
    "authors": [
        "aimeesutherland"
    ],
    "categories": [
        "GDSA",
        "Sustainable ICT",
        "Uncategorized"
    ],
    "pub_date": "2024-03-01T13:00:05+00:00",
    "content": [
        {
            "text": "Government Digital Sustainability Alliance (GDSA) Project Manager Aimee Sutherland updates on the work that we’ve been doing since our November workshop and shares some exciting news about a forthcoming event."
        },
        {
            "text": "Here at the Government Digital Sustainability Alliance (GDSA) we’ve been in countdown mode (more on that in a moment) since our November 2023 workshop, an event which brought us together, as an alliance, to refocus and reflect on our purpose, while also enabling us to build and strengthen relationships."
        },
        {
            "text": "Coming together in this way – where we were all able to step away from the day job, albeit temporarily - was so important for driving ideas, growing trust, and energising each other for the challenges ahead."
        },
        {
            "heading": 2,
            "text": "What we did at our November workshop"
        },
        {
            "text": "At the workshop we had presentations from our GDSA Working Groups - Scope 3 Emissions, Circular Economy, and Planetary Impact - which gave us all some great insight and thoughts into these key digital sustainable problem statements."
        },
        {
            "text": "The Scope 3 Emissions group focused their session on the challenges associate with Scope 3 reporting, and the inconsistencies that exist around measuring Scope 3, both in terms of reporting and methodologies. This group also viewed the 15 distinct categories within Scope 3 and identified some emerging themes around the measurement of these."
        },
        {
            "text": "Planetary Impact showcased their thought-provoking ‘Connecting nature’ video, a poignant vision of moving to a life beyond carbon and raising awareness across the entire lifecycle of digital and technology. They also presented on an insights report (which we hope to share soon), along with a framework to understand the Planetary impacts through a Value Network, leveraging the UN SDGs, and going beyond net zero."
        },
        {
            "text": "Finally, Circular Economy focused on two strands within this topic. The first being a paper which explores ways for ‘overcoming blockers in the circular economy for technology in central government and the wider public sector.’ This paper highlights seven identified prominent areas where there are barriers to circular economy. Again, we hope to share this more widely in the coming weeks."
        },
        {
            "text": "From this, a highly creative sustainability engine has been developed, which summed up all the parts required for an engine to operate that drives a circular economy."
        },
        {
            "text": "They say that feedback is a gift and this session with the working groups generated plenty of that; it was fundamental in providing further clarity to us all as we mature our ideas towards tangible outcomes. It also provided an opportunity for us in GDSA to build our roadmap into 2024 and ensure we advance the efforts of each Working Group into tangible outcomes."
        },
        {
            "heading": 2,
            "text": "What we’ve been doing since and exciting times ahead"
        },
        {
            "text": "Since November, we have been focused on another key area of work; planning for our first ever GDSA Summit. I’m extremely excited to share plans for this event here."
        },
        {
            "text": "The summit will be held in late March at the Science Museum in London. It’s an incredible opportunity to bring together digital leaders, sustainability experts, and government representatives to discuss the key challenges to driving sustainable IT. The Summit aims to:"
        },
        {
            "text": "The Summit aims to achieve the above through a series of activities. These include discussing measuring Scope 3 emissions, enabling a circular economy, and encouraging a better understanding of the planetary impacts of using technology."
        },
        {
            "text": "The day will be focused on hearing from the GDSA working groups, with the chance to question expert panellists and contribute own experiences that focus on digital sustainability."
        },
        {
            "text": "There will also be keynotes throughout the day which will invoke ideas, raise awareness of the challenges we face in the digital and technology industry, but also bring an element of hope and optimism to the future we face."
        },
        {
            "text": "We are honoured to have Toby Strong as one of our keynote speakers. The multi-Emmy and Bafta award winning cinematographer, director, and creative consultant will set the context for the day."
        },
        {
            "text": "Toby will share his passion for the natural world through his unique insights, unbelievable experiences, and unparalleled anecdotes from working with David Attenborough and others. On the day we will also be showcasing some exciting collaborative work – the only hint, Culture Club meets E-waste."
        },
        {
            "heading": 2,
            "text": "Get on board"
        },
        {
            "text": "After a year of ‘membership pause’ within GDSA, we are excited to announce that applications for GDSA membership have reopened. As part of the Summit, we will be welcoming people from new suppliers and organisations to attend."
        },
        {
            "text": "This is a great opportunity for us to create a broader-based membership, which in turn will encourage an even more diverse range of views on digital and IT sustainability topics."
        },
        {
            "text": "As project manager for GDSA, I am really looking forward to welcoming new members into the alliance and leading the way on breaking ground. I am proud of how far the alliance has grown since last year and feel optimistic about our mission to spread the digital sustainability message further and wider."
        }
    ]
}