{
    "url": "https://stratcommand.blog.gov.uk/2024/03/01/we-are-strategic-command-with-cpl-gary-cox/",
    "title": "We Are Strategic Command with Cpl Gary Cox",
    "authors": [
        "bobsendall"
    ],
    "categories": [
        "Uncategorized"
    ],
    "pub_date": "2024-03-01T10:35:34+00:00",
    "content": [
        {
            "text": "Meet Cpl Gary Cox. He shares insights into his life, highlights and contributions as part of 303 Signals Unit in the Falklands."
        },
        {
            "text": "Interviewer: Could you introduce yourself and your role?"
        },
        {
            "text": "Cpl Gary Cox: I'm Gary Cox, and I'm the Adjutant of 303 Signals Unit in the Command and Reporting Centre (CRC) Griffin, which recently celebrated its 25th Anniversary. I have been stationed in the Falklands since August, and my responsibilities include coordinating movements around the entire island and facilitating transport, whether it be for military personnel or civilian contractors, to manage vehicle serviceability. I work alongside the operational team to ensure everything runs smoothly with regards to equipment. One significant aspect is managing personnel, both at the mountain sites of Mt Alice and Byron Heights, and Mount Pleasant Complex (MPC)."
        },
        {
            "text": " "
        },
        {
            "text": "Interviewer: What does a day in the life of someone in the 303 Signals Unit look like?"
        },
        {
            "text": "Cpl Gary Cox: A typical day involves first ensuring the safety of the island and making sure nothing untoward is approaching. We have a morning brief to align on movements, flights, and incoming personnel to the island. From this we’ll have a set of actions, which could be anything from coordinating engineers to supporting the delivery of a resupply ship. No two days are ever alike! The pace is relentless, but it keeps me engaged and passionate about my contribution to the safety of the Falkland Islands."
        },
        {
            "text": "Interviewer: What is your favourite part of your role?"
        },
        {
            "text": "Cpl Gary Cox: I love the scale of the work and the constant pace. It's fulfilling to handle diverse tasks and witness the impact of our efforts on a regular basis. I have always enjoyed problem solving, and looking for solutions, and often there are tasks that are time critical. It’s satisfying knowing that as an office we have managed to fix something quickly and efficiently!"
        },
        {
            "text": " "
        },
        {
            "text": "Interviewer: What's it like being based in the Falklands?"
        },
        {
            "text": "Cpl Gary Cox: The experience is positive and offers a unique lifestyle with plenty of activities. The base itself has facilities like a pool, cinema, gaming lounge, and bowling alley, providing great entertainment within the complex. It is challenging for personnel being 8,000 miles away from family and friends, so keeping in touch always boosts morale. Apart from the historical value and military presence, the Falklands offer breath-taking wildlife experiences, from penguins to killer whales. I must admit, I did see ‘too much, too fast’ when I first arrived. Within just 6 weeks, I’d managed to see all the key tourist attractions!"
        },
        {
            "text": " "
        },
        {
            "text": "Interviewer: How does working in Strategic Command compare to your previous roles?"
        },
        {
            "text": "Cpl Gary Cox: Compared to my post in the UK, which was more of a reactive role, working for Strategic Command in the Falklands is proactive and operational. It's a fast-paced environment with constant problem-solving and situational awareness, making it a significant departure from my past experiences."
        },
        {
            "text": " "
        },
        {
            "text": "Interviewer: What’s been your highlight of working at Strategic Command?"
        },
        {
            "text": "Cpl Gary Cox: The constant job satisfaction is a highlight. Here in the Falklands, I feel accomplished every day. The proactive nature of the work and the sense of contributing to significant projects make it a fulfilling experience."
        },
        {
            "text": "Falklands sometimes gets a bad name because it’s so far away. It’s very easy to fall into the negative mindset of ‘I’m far from home, it’s going to be difficult”. In all honesty, it has been a completely different experience for me. Whilst being away from family and friends has provided its own challenge, the Adjutant role provides a unique insight into decision-making processes and offers a fast-paced, enriching environment that has made my tour feel productive knowing I have contributed to the wider Air Force. I would even go as far to say that if anyone was due to come to the Falkland Islands, that Strategic Command would be a role I would recommend!"
        }
    ]
}