{
    "url": "https://moderncivilservice.blog.gov.uk/2024/02/26/an-innovative-journey-why-20-really-matters/",
    "title": "An Innovative Journey: Why 20% really matters",
    "authors": [
        "Government Reform"
    ],
    "categories": [
        "A Modern Civil Service",
        "Digital and data",
        "Government Reform",
        "Innovation",
        "Modernisation and Reform",
        "Proud Civil Servant"
    ],
    "pub_date": "2024-02-26T13:20:19+00:00",
    "content": [
        {
            "heading": 6,
            "text": "Guest blog by Ross Middleham, Creative Lead at the Met Office."
        },
        {
            "text": "At the Met Office, one of our core values is that ‘we keep evolving’. We are constantly horizon-scanning for ways to make improvements and deliver value."
        },
        {
            "text": "So in August 2023, when we spotted the Government Communication Services (GCS) Project Spark! Programme calling for innovative ideas from across all government departments and Arms Length Bodies (ALBs) - we knew it aligned perfectly with our own drive to explore new things."
        },
        {
            "heading": 2,
            "text": "The inspiration behind the pitch"
        },
        {
            "text": "We pride ourselves on having a people-first culture with a variety of network groups to support individuals and place great emphasis on well-being. We have been very aware of trying to make our own communications, both internally and externally, accessible to all. At the Met Office, it is crucial that our (often life-saving) science and services are easily accessed by as many people as possible, to help them make better decisions to stay safe and thrive. Through our submission to Project Spark! we saw the opportunity to help drive improvement on a larger scale across government too."
        },
        {
            "heading": 2,
            "text": "20% really matters"
        },
        {
            "text": "Accessible communication results in more effective communication, for everyone. Our idea 'Accessible by default – why 20% really matters!' outlined that 1 in 5 people in the UK have a disability that affects internet and social media use. \n\nWe gathered a small team from across the Met Office to work on our proposal. We ran idea generation sessions, collated inspiration and best practices and worked together, often virtually, on our pitch.We spoke to representatives from our own Accessibility Working Group, and with Peter Serjent, Strategy and Planning Theme Lead, from the central GCS team who sponsored our idea."
        },
        {
            "heading": 2,
            "text": "Dragons' Den"
        },
        {
            "text": "My colleagues Emma Lawrence and Dave Britton travelled to Whitehall to pitch the idea in a Dragons; Den-style 5 minute presentation, followed by Q&A. Their challenge was to win over a majority of the Dragons, which this year included:"
        },
        {
            "text": "We pitched ideas to drive accessibility in digital communications. It included centralising tools and training, joining up with others doing great work in this space and exploring advances in generative AI. For example, we have been exploring if it is possible to develop a ‘real-time’ content creation virtual assistant (remember ‘Clippy’ the Microsoft paperclip?) to check and embed accessibility best practice."
        },
        {
            "text": "Our pitch had people at the heart of it. From improving experiences for users, through to developing the best in-house communications talent. It was about improving government communications for everyone."
        },
        {
            "text": "We also worked hard to ensure the presentation itself was as accessible as possible. We included alt text on images, an accessible colour scheme, used slide titling for navigation, provided an audio overview for each slide and a transcript in the notes. Aiming for progress even if we couldn’t achieve perfection to make the content easy to access for any of the Dragons."
        },
        {
            "heading": 2,
            "text": "From pitch to quick progress"
        },
        {
            "text": "We were thrilled to secure the unanimous support of all five of the Dragons, who were blown away by the passion, energy and how we articulately addressed their tough questions in the heat of the Den. "
        },
        {
            "text": "Our team are now driving this idea forward with the GCS Innovation Lab to rapidly develop, test, and scale it across government communications. The GCS team has provided incredible support to help drive the ideas forward and turn them into reality. Having this time and support from them has made a huge difference. "
        },
        {
            "text": "We are aware that we have a window of opportunity in which we need to deliver both tangible projects and innovative trials, and the GCS team has ensured we hit key milestones and remain on track. This has been important for myself and my Met Office colleagues as the project kicked off during Winter and a particularly busy spell of severe weather, which put pressure on our availability."
        },
        {
            "heading": 2,
            "text": "A positive impact"
        },
        {
            "text": "To ensure that we are going to deliver something useful, we started the project by running a workshop with communication specialists from across government to get their thoughts. It identified that people needed better signposting to help them find existing accessibility resources. It also highlighted the time pressures around producing accessible content, and the challenge of changing policies and guidance."
        },
        {
            "text": "This insight helped us to identify the three key areas for us to focus on:"
        },
        {
            "text": "The team has also been seeking and soaking up inspiration from others. Our Met Office team have shared inspiration with Royal National Institute of Blind People (RNIB) and as a result of the pitch the team were also invited to visit Google to discuss and learn from their work on accessibility."
        },
        {
            "heading": 3,
            "text": "How you can help"
        },
        {
            "text": "Our work with Project Spark! is helping to raise awareness of the responsibilities we all have as professional communicators in creating accessible comms for everyone. If you haven’t already, I would encourage you to familiarise yourself with the existing guidance on the GCS website, and keep an eye out for the various ways we plan to introduce to make it easier for you to access and embed these tips in your communication. The aim is to produce more succinct practical guidance followed by a pilot of an AI virtual assistant, ahead of full integration of guidance into the GCS AI Copilot later this year. "
        },
        {
            "heading": 3,
            "text": "Driving more innovation across the Civil Service"
        },
        {
            "text": "Initiatives like Project Spark! help encourage us to think differently. Our digital worlds are changing quickly and we need to not only keep pace but anticipate the changes to be able to adapt and communicate effectively with everyone, however and wherever they seek information."
        },
        {
            "text": "If you’ve got an idea which you think could deliver real value across government I’d urge you to submit them to initiatives like Project Spark! in the future."
        }
    ]
}