{
    "url": "https://insidehmcts.blog.gov.uk/2024/02/26/completing-reform-common-platform/",
    "title": "Completing Reform - Common Platform",
    "authors": [
        "Daniel Flury, Crime Programme Director"
    ],
    "categories": [
        "Court and tribunal reform",
        "Crime",
        "Digital services"
    ],
    "pub_date": "2024-02-26T10:00:04+00:00",
    "content": [
        {
            "text": "[English] - [Cymraeg]"
        },
        {
            "text": "Working alongside our justice partners, we’ve made significant progress towards the vision for reform we set out in 2016: to provide a justice system with people’s needs and expectations at its heart. Our core principles – to be just, proportionate and accessible – have always underpinned our work."
        },
        {
            "text": "I’m incredibly proud of what we’ve achieved. Common Platform is operational in all criminal courts in England and Wales and driving efficiency in data sharing and accuracy between criminal justice partners. To date, the system has managed over 1.3 million cases."
        },
        {
            "text": "However, as we move into the final phase of our Reform Programme, we must not lose sight of our original vision. We’ve taken stock of how far we have come and where we still need to go and have extended the overall programme to March 2025. You can read more about this in a blog post from HMCTS Chief Executive, Nick Goodwin."
        },
        {
            "text": "We’ve revised the scope of our remaining Crime Programme – as part of this, we'll be retaining the Digital Case System in the Crown Court, while continuing to make improvements to Common Platform."
        },
        {
            "heading": 2,
            "text": "Refocusing our priorities"
        },
        {
            "text": "From the outset, delivering Common Platform has been one of the most significant and challenging aspects of reform.  The external and operational environment has changed since we first started the Reform Programme. It’s right that we regularly review our plans and programmes to ensure that they continue to meet the needs of those working in the court system and provide value and efficiency for the taxpayer."
        },
        {
            "text": "To be successful, we need to balance change with providing a stable system that people can access, ensuring that responding and adapting to user needs continue to be the driving force for change."
        },
        {
            "text": "With this in mind, our priorities for Common Platform in 2024/25 are to:"
        },
        {
            "heading": 2,
            "text": "Improving Common Platform"
        },
        {
            "text": "Common Platform remains the system of court record, in both the Crown Court and magistrates’ courts. We’ll use it to store and report on essential data, keep court logs, record and share results, as well as generate and send notices, orders and warrants."
        },
        {
            "text": "Use of the system will remain essential for legal professionals in both jurisdictions, and we’ll keep engaging with practitioners to better understand their views and enhance their user experience."
        },
        {
            "text": "Before the programme closes in March 2025, we will make further improvements to the platform that will ultimately allow us to stop using our legacy Libra and Xhibit systems. In particular, we will:"
        },
        {
            "text": "I’m confident that these changes will improve how people use the platform, enhance system performance and continue to drive efficiency across the criminal justice system."
        },
        {
            "heading": 2,
            "text": "Keeping the Digital Case System "
        },
        {
            "text": "Feedback from our staff, judges and legal professionals has been fundamental in designing our new ways of working. With this feedback in mind, we have decided to keep the Digital Case System (DCS) in the Crown Court – you’ve told us that this works well and continues to meet your needs."
        },
        {
            "text": "We’ll look at ways we can enhance DCS in future and make sure the two systems work well together, and we’re exploring opportunities for the transfer of data and information between them."
        },
        {
            "text": "This means that, for now, there’s no change to the way legal professionals use systems in the Crown Court. We’ll carry on using DCS for case material and document management in the Crown Court, while continuing to use Common Platform for this purpose in the magistrates’ court. This will include providing access to the Initial Details of the Prosecution Case (IDPC) through the platform."
        },
        {
            "text": "Associating with a case to access the full details will still be done through Common Platform, as will completing the Preparation for Effective Trial (PET) and Better Case Management (BCM) forms."
        },
        {
            "text": "Legal professionals will continue using Common Platform to check in for hearings, in both Crown and magistrates’ courts."
        },
        {
            "heading": 2,
            "text": "Continuous improvement"
        },
        {
            "text": "We encourage all users of Common Platform to keep sharing feedback and suggestions with us. For now, the route for legal professionals is through HMCTS colleagues, although we’ll be adding the ability to submit feedback directly through the platform in future."
        },
        {
            "text": "Refocusing our priorities will ensure we can deliver a system that better meets the needs of court users and gradually moves away from legacy systems."
        },
        {
            "text": "Our year ahead is still a challenging one, and we’ll work hard to achieve the goals we’ve set ourselves."
        },
        {
            "text": "Lastly, the formal end of the Reform Programme won’t mean an end to change and evolution.  We’ll carry on finding ways we can improve as an organisation and the services we provide, ensuring justice can be delivered."
        },
        {
            "text": " "
        },
        {
            "text": "[English] - [Cymraeg]"
        },
        {
            "heading": 1,
            "text": "Cwblhau’r Rhaglen Ddiwygio - Y Platfform Cyffredin"
        },
        {
            "text": "Gan weithio ochr yn ochr â’n partneriaid cyfiawnder, rydym wedi gwneud cynnydd sylweddol tuag at y weledigaeth ar gyfer diwygio a nodwyd gennym yn 2016: darparu system gyfiawnder gydag anghenion a disgwyliadau pobl yn ganolog iddi.  Mae ein hegwyddorion craidd - i fod yn gyfiawn, yn gymesur ac yn hygyrch – bob amser wedi bod yn sail i’n gwaith."
        },
        {
            "text": "Rwy’n hynod falch o’r hyn rydym wedi’i gyflawni. Mae’r Platfform Cyffredin yn weithredol ym mhob llys troseddol yng Nghymru a Lloegr ac mae’n sbarduno effeithlonrwydd o ran cywirdeb a rhannu data rhwng partneriaid cyfiawnder troseddol. Hyd yma, mae’r system wedi rheoli dros 1.3 miliwn o achosion."
        },
        {
            "text": "Fodd bynnag, wrth i ni symud i gam olaf ein Rhaglen Ddiwygio, ni allwn golli golwg o’n gweledigaeth wreiddiol. Rydym wedi ystyried pa mor bell rydym wedi dod a’r hyn rydym dal angen ei gyflawni ac rydym wedi ymestyn y rhaglen gyffredinol i fis Mawrth 2025. Gallwch ddarllen mwy am hyn mewn blog gan Brif Weithredwr GLlTEF, Nick Goodwin."
        },
        {
            "text": "Rydym wedi adolygu cwmpas gweddill ein Rhaglen Droseddol  - fel rhan o hyn, byddwn yn cadw’r System Achosion Digidol yn Llys y Goron, ac ar yr un pryd yn parhau i wneud gwelliannau i’r Platfform Cyffredin."
        },
        {
            "heading": 2,
            "text": "Newid pwyslais ein blaenoriaethau"
        },
        {
            "text": "O’r cychwyn cyntaf, mae darparu’r Platfform Cyffredin wedi bod yn un o elfennau mwyaf arwyddocaol a mwyaf heriol y rhaglen ddiwygio. Mae’r amgylchedd allanol a gweithredol wedi newid ers i ni ddechrau rhoi’r Rhaglen Ddiwygio ar waith saith mlynedd yn ôl. Mae’n iawn ein bod yn adolygu ein cynlluniau a’n rhaglenni i sicrhau eu bod yn parhau i ddiwallu anghenion y sawl sy’n gweithio yn y system llysoedd a darparu gwerth am arian ac effeithlonrwydd i’r trethdalwr."
        },
        {
            "text": "Er mwyn gwneud hyn yn llwyddiannus, mae angen inni gydbwyso newid gyda darparu system sefydlog y mae pobl yn gallu cael mynediad ati, gan sicrhau bod ymateb i, ac addasu i ddiwallu anghenion defnyddwyr yn parhau i fod y ffactor allweddol sy’n sbarduno newid."
        },
        {
            "text": "Gyda hyn mewn cof, ein blaenoriaethau ar gyfer y Platfform Cyffredin yn 2024/25 yw:"
        },
        {
            "heading": 2,
            "text": "Gwella’r Platfform Cyffredin"
        },
        {
            "text": "Y Platfform Cyffredin yw system gofnodi’r llysoedd dal i fod, yn Llys y Goron a’r llysoedd ynadon. Byddwn yn ei defnyddio i gadw ac adrodd ar ddata hanfodol, cadw cofnodion llys, cofnodi a rhannu canlyniadau, ynghyd â chynhyrchu ac anfon hysbysiadau, gorchmynion a gwarantau."
        },
        {
            "text": "Bydd defnyddio’r system yn parhau i fod yn hanfodol ar gyfer gweithwyr proffesiynol yn y ddwy awdurdodaeth, a byddwn yn parhau i ymgysylltu ag ymarferwyr i ddeall eu safbwyntiau yn well a gwella eu profiadau fel defnyddwyr."
        },
        {
            "text": "Cyn i’r rhaglen ddod i ben ym mis Mawrth 2025, byddwn yn gwneud gwelliannau pellach i’r platfform a fydd yn ein caniatáu i roi’r gorau i ddefnyddio ein hen systemau, Libra ac Xhibit. Yn benodol, byddwn yn:"
        },
        {
            "text": "Rwy’n hyderus y bydd y newidiadau hyn yn gwella sut mae pobl yn defnyddio’r platfform, gwella perfformiad y system a pharhau i sbarduno effeithlonrwydd ledled y system gyfiawnder troseddol."
        },
        {
            "heading": 2,
            "text": "Cadw’r System Achosion Digidol "
        },
        {
            "text": "Mae cael adborth gan ein staff, barnwyr a gweithwyr proffesiynol ym maes y gyfraith wedi bod yn hanfodol inni wrth ddylunio ein ffyrdd newydd o weithio. Gyda’r adborth hwn mewn cof, rydym wedi penderfynu i gadw’r System Achosion Digidol (DCS) yn Llys y Goron - rydych wedi dweud wrthym bod hyn yn gweithio’n dda ac yn parhau i ddiwallu eich anghenion."
        },
        {
            "text": "Byddwn yn edrych ar ffyrdd i wella DCS yn y dyfodol a sicrhau bod y ddwy system yn gweithio’n dda gyda’i gilydd, ac rydym yn archwilio i gyfleoedd i drosglwyddo data a gwybodaeth rhyngddynt."
        },
        {
            "text": "Felly, am y tro, mae hyn yn golygu nid oes unrhyw newid i’r ffordd y mae gweithwyr proffesiynol ym maes y gyfraith yn defnyddio systemau yn Llys y Goron. Byddwn yn parhau i ddefnyddio DCS ar gyfer rheoli deunydd a dogfennau achosion yn Llys y Goron, gan barhau i ddefnyddio’r Platfform Cyffredin at y diben hwn yn y llysoedd ynadon. Bydd hyn yn cynnwys darparu mynediad at Fanylion Cychwynnol Achos yr Erlyniad (IDPC) drwy’r platfform."
        },
        {
            "text": "Bydd cysylltu ag achos i gael gafael ar y manylion llawn yn parhau i ddigwydd drwy’r Platfform Cyffredin a bydd llenwi’r ffurflenni Paratoi ar gyfer Treial Effeithlon (PET) a Rheoli Achosion yn well (BCM) hefyd yn digwydd trwy’r platfform."
        },
        {
            "text": "Bydd gweithwyr proffesiynol ym maes y gyfraith yn parhau i ddefnyddio’r Platfform Cyffredin i fewngofnodi i wrandawiadau yn Llys y Goron a’r Llys Ynadon ill dau."
        },
        {
            "heading": 2,
            "text": "Gwelliant Parhaus"
        },
        {
            "text": "Rydym yn annog holl ddefnyddwyr y Platfform Cyffredin i barhau i rannu adborth ac awgrymiadau gyda ni. Am y tro, y llwybr ar gyfer gweithwyr proffesiynol ym maes y gyfraith fydd drwy eu cydweithwyr yn GLlTEF, er byddwn yn ychwanegu’r gallu i gyflwyno adborth yn uniongyrchol drwy’r platfform yn y dyfodol."
        },
        {
            "text": "Bydd newid pwyslais ein blaenoriaethau yn sicrhau ein bod yn gallu darparu system sy’n diwallu anghenion defnyddwyr y llysoedd yn well a symud i ffwrdd yn raddol o’r hen systemau."
        },
        {
            "text": "Mae’r flwyddyn o’n blaenau dal yn mynd i fod yn flwyddyn heriol, a byddwn yn gweithio’n galed i gyflawni’r nodau rydym wedi’u gosod ar gyfer ein hunain."
        },
        {
            "text": "Yn olaf, ni fydd terfyniad ffurfiol y Rhaglen Ddiwygio yn golygu y byddwn yn rhoi’r gorau i newid ac esblygu hefyd. Byddwn yn parhau i ddod o hyd i ffyrdd i wella fel sefydliad a gwella’r gwasanaethau rydym yn eu darparu, gan sicrhau bod cyfiawnder yn cael ei weinyddu."
        }
    ]
}