{
    "url": "https://environmentagency.blog.gov.uk/2024/02/26/environment-officer-joseph-holder-explains-how-weekly-beach-walkovers-and-inspections-are-helping-to-improve-weston-super-mares-bathing-water-quality/",
    "title": "Environment Officer Joseph Holder explains how weekly beach walkovers and inspections are helping to improve Weston-Super-Mare’s bathing water quality.",
    "authors": [
        "Environment Agency"
    ],
    "categories": [
        "Cleaner Seas",
        "Environment Agency",
        "hydrometry",
        "Regulated industry",
        "Water"
    ],
    "pub_date": "2024-02-26T16:21:07+00:00",
    "content": [
        {
            "text": " "
        },
        {
            "text": "The Environment Agency conducts weekly sampling during the bathing water season, which spans from May to September. Across the UK, there are 424 designated bathing water sites, 49 of these sit within Wessex. Each one of these sites is given an annual classification, graded as Excellent, Good, Sufficient and Poor."
        },
        {
            "text": "Various factors influence bathing water quality, with annual variations contributing to the unique characteristics of each catchment. An unseasonably wet summer, such as the one we had in 2023, will have impacted the year’s results due to the potential of increased sewage spills from storm overflows, diffuse pollution from agriculture and highway drainage."
        },
        {
            "text": "Despite an overall, substantial improvement in bathing water quality since the 1990s, there has been a concerning deterioration in Weston-Super-Mare’s bathing water quality in recent years. The downgrade from a ‘Good’ to ‘Poor’ rating has cast a considerable shadow over tourism prospects for the charming seaside town during its peak sunny season."
        },
        {
            "text": "Weston-Super-Mare Bay is in an interesting geographical location, sitting within the Bristol Channel on the Severn Estuary and boasting the second highest tidal range in the world. There are many factors that could be contributing to the decline in bathing water quality and identifying these factors is quite complex."
        },
        {
            "text": "The Environment Agency’s Bathing Water Investigation involves a detailed action plan, including activities such as an 8-9km round trip (great for getting your 10,000 steps) Beach Walkover, farm and sewage works inspections, Drone Surveys, and investigations into nearby businesses’ drainage systems. The Environment Agency has individuals from varying teams all coming together and contributing their expertise as well as working collaboratively with Wessex Water and North Somerset Council."
        },
        {
            "text": "Beach Walkovers have been on-going since mid-January in rain, wind, or shine. They are undertaken mostly by me and my fellow Environment Officer Jeremy Chappell. We always welcome others to come along and give us some company and a fresh pair of eyes. During the walkovers, we monitor surface water outfalls that discharge onto the beach to assess for contamination, look for sewage related debris on the strand line and any evidence of dog faeces or excess litter. Each walkover has provided us with new insights and a better understanding of an ever-changing environment due to the large tidal ranges."
        },
        {
            "text": "We compile weekly reports to provide the team with a better understanding of the developments in the bay. Additionally, these walkovers have provided us with a great opportunity to engage with members of the public as well as work collaboratively with other organisations, such as water companies and the local council. We’ve already achieved a small victory by identifying and remedying a contaminated outfall at Marine Lake, in collaboration with Wessex Water. As a result, we now have a contamination free outfall."
        },
        {
            "text": "Another tactic we use is conducting drone surveys to analyse outfalls along the tidal River Axe and Weston Beach, including surveying Wessex Water’s sewage Treatment Works outfall at Black Rock. The drone’s infrared imagery capabilities help identify heat signatures and potential pollution plumes. Drones offer excellent access to otherwise inaccessible areas, providing a different perspective for study. We plan to undertake more drone surveys in different tidal conditions, for a more in-depth analysis of the area."
        },
        {
            "text": "Despite the challenges we face as Environment Officers, the collaborative approach and diverse expertise within the team give me hope that we can achieve a positive outcome for Weston-Super Mare’s bathing water quality."
        },
        {
            "text": "During the bathing water season, our officers take around 7000 samples across designated bathing water sites to be tested in the lab. The results can be found on our Swimfo website, enabling swimmers to make informed choices about where they swim. For further information, see Bathing Water Quality (data.gov.uk)."
        }
    ]
}