{
    "url": "https://stratcommand.blog.gov.uk/2024/02/26/manchester-army-cadet-force/",
    "title": "A VERY BUSY WEEK FOR MANCHESTER ARMY CADET FORCE IN GIBRALTAR",
    "authors": [
        "abievans"
    ],
    "categories": [
        "Gibraltar",
        "Overseas Bases"
    ],
    "pub_date": "2024-02-26T15:31:59+00:00",
    "content": [
        {
            "text": "Between 10 and 17 February 2024, members of the Greater Manchester Army Cadet Force visited Gibraltar for a routine trip."
        },
        {
            "text": "Twenty-seven cadets and support staff, under the leadership of Lieutenant Colonel William Royle, spent the majority of their visit utilising the great facilities that are on offer up at Buffadero Training Camp, where they participated in shooting exercises on the 25m Range."
        },
        {
            "text": "Greater Manchester Cadets, who have a strong alliance with the Gibraltar Cadets, will regularly take it in turns to return to Gibraltar or to host the Gibraltar Cadets in Manchester."
        },
        {
            "text": "Both cadet forces have signed an alliance whereby they must maintain and foster the association established to encourage training, friendship, and harmony between the young people of Gibraltar and Greater Manchester."
        },
        {
            "text": "During their time in Gibraltar, the cadets visited the Royal Navy Gibraltar Squadron and Gunwharf, where they participated in various water sports before indulging in a BBQ. Upon their arrival at Gunwharf, the cadets were greeted by His Excellency, the Governor of Gibraltar, Sir David Steel."
        },
        {
            "text": "The cadets were awarded some downtime to explore and see the sights of Gibraltar, with visits to St Michael’s Cave, The Convent, and the Gibraltar Museum."
        },
        {
            "text": "Lieutenant Colonel Royle said: “This was an amazing opportunity for the cadets and staff of Greater Manchester Army Cadet Force to train and socialise alongside our Gibraltar Cadet Force friends. This exchange marked the beginning of what is hoped will be a long lasting friendship, which will be remembered by all for a very long time and for some it will be a life changing experience.”"
        }
    ]
}