{
    "url": "https://deframedia.blog.gov.uk/2024/02/26/media-coverage-on-reforms-to-waste-electricals-regulations/",
    "title": "Media coverage on reforms to waste electricals regulations",
    "authors": [
        "Defra Press Office"
    ],
    "categories": [
        "Pollution",
        "waste"
    ],
    "pub_date": "2024-02-26T12:01:57+00:00",
    "content": [
        {
            "text": "Media coverage on reforms to waste electricals regulations"
        },
        {
            "text": " "
        },
        {
            "text": "There has been coverage over the weekend (Sunday 25 February) on our consultation on reforming the producer responsibility system for electrical waste."
        },
        {
            "text": "On 28 December 2023, the UK Government, along with the Scottish, Welsh and Northern Irish Governments, launched a consultation aiming to make it easier for households to recycle electrical cords, devices and white goods. Proposals in the consultation included:"
        },
        {
            "text": "An estimated 155,000 tonnes of smaller household electricals such as cables, toasters, kettles and power tools are wrongly thrown in the bin each year."
        },
        {
            "text": "The proposals will mean consumers will be able to recycle their goods during their weekly shop or without even leaving the house."
        },
        {
            "text": "Recycling Minister Robbie Moore said: "
        },
        {
            "text": "The Department for Environment, Food and Rural Affairs will work closely with manufacturers, major retailers and small and medium enterprises throughout the consultation period to ensure the most efficient and accessible options become a reality."
        },
        {
            "text": "Increasing the collection and recycling of waste electricals has the potential to drive greater investment in the UK’s treatment and re-use sector, helping to create British jobs and deliver on the Prime Minister’s priority of growing the economy."
        },
        {
            "text": "All consultation responses will be fully considered before we set out the next steps."
        }
    ]
}