{
    "url": "https://marinescience.blog.gov.uk/2024/02/26/strengthening-sri-lankas-preparedness-to-respond-to-oiled-wildlife-emergencies/",
    "title": "Strengthening Sri Lanka’s preparedness to respond to oiled wildlife emergencies",
    "authors": [
        "Jamie Small, JNCC"
    ],
    "categories": [
        "biodiversity"
    ],
    "pub_date": "2024-02-26T14:56:38+00:00",
    "content": [
        {
            "text": "Written by Jamie Small, from the Joint Nature Conservation Committee (JNCC), on behalf of JNCC and Cefas,"
        },
        {
            "text": "The UK government's Ocean Country Partnership Programme (OCPP) team share updates on oiled wildlife response training recently delivered in Sri Lanka."
        },
        {
            "text": "JNCC and Cefas, through the UK's Ocean Country Partnership Programme (OCPP), have recently supported the delivery of oiled wildlife response training for 30 frontline responders across Sri Lanka in collaboration with the Government of Sri Lanka and The South African Foundation for the Conservation of Coastal Birds (SANCCOB)."
        },
        {
            "text": "The OCPP has been working with the Department of Wildlife Conservation in Sri Lanka and SANCCOB to strengthen Sri Lanka’s capacity and expertise in oiled wildlife response. Under this partnership, SANCCOB, an NGO that specialises in seabird and oiled wildlife response, held a 3-day Oiled Wildlife Response Training Programme in Hikkaduwa, Sri Lanka in early February 2024. The programme was attended by 2 Assistant Directors, 10 Wildlife Rangers, 5 Ranger Assistants who are responsible for the management of protected areas, and 3 vets who are responsible for the treatment of wildlife, from the Department of Wildlife Conservation in Sri Lanka. They were joined by 10 national environmental experts from local NGOs, other Government agencies and academia, who also presented their knowledge and expertise on the local environment and species."
        },
        {
            "text": "This course will help build the foundation of an oiled wildlife response network, enhancing Sri Lanka’s current collaborative action to sustainably manage and protect the marine environment, benefitting the local communities that rely on these coastal ecosystems."
        },
        {
            "text": "The training equipped participants with the skills, knowledge and confidence to respond to the initial phase of an oil spill and attend to affected wildlife including seabirds, marine mammals and turtles before specialist responders arrive on the scene. An overview of operations, requirements and resources needed during the initial phase of a response was provided before participants were able to gain practical experience. Participants donned full Personal Protective Equipment (PPE) used during an oiled wildlife response, and learnt about the toxic nature of pollutants, and the importance of personal safety as a responder."
        },
        {
            "text": "Using 'robo duck', a robotic duck that simulates the movement of a wild bird, participants ran through a series of field scenarios to learn how to stabilise oiled wildlife and provide basic essential care during the first few days post-capture. The course ended with an overview of lessons learned from different case studies and how these could be applied to Sri Lanka."
        },
        {
            "text": "The OCPP will continue to work with the Government of Sri Lanka over the next two years to build upon the oiled wildlife response technical assistance delivered to date, including the development of a detailed Oiled Wildlife Response Contingency Plan linked to Sri Lanka’s National Oil Spill Contingency Plan and facilitation of further training opportunities."
        },
        {
            "text": "The Ocean Country Partnership Programme (OCPP) is a UK Government-led official development assistance (ODA) programme under the Blue Planet Fund, delivered by the Centre for Environment, Fisheries and Aquaculture Science (Cefas), the Joint Nature Conservation Committee (JNCC) and the Marine Management Organisation (MMO) on behalf of the Department for Environment, Food and Rural Affairs (Defra)"
        },
        {
            "text": "Find out more about the OCPP."
        }
    ]
}