{
    "url": "https://forestrycommission.blog.gov.uk/2024/02/26/the-first-phase-of-the-forestry-commissions-new-approach-to-consultation-is-live/",
    "title": "The first phase of the Forestry Commission’s new approach to consultation is live",
    "authors": [
        "Forestry Commission"
    ],
    "categories": [
        "Woodland creation",
        "Woodland management"
    ],
    "pub_date": "2024-02-26T13:45:02+00:00",
    "content": [
        {
            "text": "Back in September 2023 we announced our new approach to how we consult or seek advice and information on forestry proposals. This published statement set out how the Forestry Commission, on behalf of the Forestry Commissioners, will undertake consultation when assessing applications for woodland creation, tree felling and management.  "
        },
        {
            "text": "These changes will deliver efficient decision making and accelerate application processing times. They will simplify evidence gathering for forestry proposals and avoid duplication, whilst still adhering to other environmental legislation and good practice guidelines.  "
        },
        {
            "text": "We are pleased to advise that the first phase for implementing this new approach (phase 1a and 1b see table below) will be implemented today (26 February 2024). This will include the shortening of the consultation public register timescales from 28 days to 21 days, and only seeking advice and information from non-statutory consultees when necessary. "
        },
        {
            "heading": 2,
            "text": "What do these changes mean?"
        },
        {
            "heading": 2,
            "text": "Where can I find out more? "
        },
        {
            "text": "The changes to the consultation approach are outlined in the Forestry Commissioners' statement on consultation procedures for forestry applications."
        },
        {
            "text": "Our previous blog published on the 18 September 2023 on the Forestry Commission’s new approach to consultation on forestry applications, sets out our commitment to using existing ways of working until our internal guidance and business processes had been reviewed and amended ."
        },
        {
            "heading": 2,
            "text": "When will these changes be made?"
        },
        {
            "text": "The Forestry Commission will roll out the revised approach over the coming months, further announcements will be made as these changes are introduced. These changes will be implemented using a phased approach."
        },
        {
            "text": "You can see the full list of changes and dates below:"
        },
        {
            "heading": 2,
            "text": "How do I stay up to date with the implementation?  "
        },
        {
            "text": "If you wish to stay up to date on future announcements ​subscribe to email alerts ​or subscribe to our blog."
        }
    ]
}