{
    "url": "https://gfie.blog.gov.uk/2024/02/26/the-support-i-have-had-has-been-unbelievable-and-i-am-so-grateful-to-be-working-in-such-a-nice-environment/",
    "title": "The support I have had has been unbelievable and I am so grateful to be working in such a nice environment",
    "authors": [
        "karlharvey1"
    ],
    "categories": [
        "#GFIEsuccessstory",
        "A modern Civil Service",
        "A Skilled Civil Service",
        "apprenticeships",
        "build capability",
        "Social mobility"
    ],
    "pub_date": "2024-02-26T15:00:19+00:00",
    "content": [
        {
            "text": "The Civil Service has 23 Going Forward into Employment (GFiE) Life Chance Schemes in operation across Government, using innovative approaches to recruitment and providing Individuals from a wide range of backgrounds, who face barriers to employment, with opportunities and experience."
        },
        {
            "text": "In this blog edition, we introduce you to the Social Mobility Apprenticeship Scheme led by the Department for Work and Pensions (DWP)."
        },
        {
            "heading": 2,
            "text": "What is the 'DWP Social Mobility Apprenticeship Scheme'?"
        },
        {
            "text": "The DWP Social Mobility Apprenticeship is for people who are 16 years of age, or over, registered unemployed, and lacking in qualifications with little or no work history. These people can experience barriers to employment because they would not normally receive the opportunity or otherwise be successful in securing employment, training and education and give them experience of a working environment. "
        },
        {
            "heading": 2,
            "text": "How does the scheme work?"
        },
        {
            "text": "DWP Social Mobility apprenticeship vacancies are offered to Cabinet Office initially to see if they can be filled through the GFiE Life Chances schemes, and if not, DWP identify candidates via work coaches in Jobcentres who are asked to select appropriate individuals who meet the Social Mobility criteria and would benefit from this opportunity.  "
        },
        {
            "text": "Apprentices work towards an accredited apprenticeship at level 2 or level 3, depending on their ability. They also complete Functional skills as part of their apprenticeship.  "
        },
        {
            "text": "In the past, DWP Social Mobility Apprenticeship accreditation was limited as apprentices had to be in the benefit system before they could join the scheme, however DWP have worked with the GFiE team to build on their learning and revise their accreditation, which means they are now able to work with some very enthusiastic and promising 16–18-year-olds. "
        },
        {
            "text": "DWP has worked with schools to identify pupils who meet specific Social Mobility criteria and offer out the Social Mobility apprenticeship opportunities to those in receipt of Pupil Premium, who are from a lower socioeconomic background and at risk of not continuing in education or training.   This includes mainstream School Leavers and those in Pupil Referral Units.  "
        },
        {
            "text": "Blazing the trail in this first-of-its-kind project. Last year DWP Retirement Services were delighted to secure five customer service roles located within the International Pensions Group at Tyneview Park (TVP), Newcastle."
        },
        {
            "text": "Following  the success of this pilot, DWP are now in the process of recruiting more school leavers across England in 2024."
        },
        {
            "text": "DWP wants to share some apprentices' journeys so far with you!"
        },
        {
            "heading": 3,
            "text": "Maddison "
        },
        {
            "text": "‘’The Social Mobility Apprenticeship programme helped me gain confidence, as before I was very shy and struggled talking to new people however now meeting new people every day, I am not shy to talk and I am more confident now than ever. "
        },
        {
            "text": "The Social Mobility Apprenticeship helped me, I knew I didn’t like the thought of going to college or staying on to sixth form, I’m very grateful to be given this opportunity at the age of 16-17.’’"
        },
        {
            "heading": 3,
            "text": "Mailise"
        },
        {
            "text": "“There aren’t many sixteen-year-olds that have a job within the Civil Service, fortunately I am one of the few who do thanks to the Social Mobility Apprenticeship programme. "
        },
        {
            "text": "I have benefited in unlimited amounts of ways from being a part of this Programme, financially, mentally, and functionally. I have made friends from a range of age groups rather than confiding just to my own age, I have the finances and work pattern flexibility to go places with friends and family. "
        },
        {
            "text": "DWP weren’t looking for a person to fill an empty seat on a desk, they were looking for people who can make a difference and I’ve comfortably eased myself into the working life and can’t wait to see how far I’ll go” "
        }
    ]
}