{
    "url": "https://ruralpayments.blog.gov.uk/2024/02/26/the-rural-payments-agency-embedding-sustainability-in-everything-we-do/",
    "title": "The Rural Payments Agency - embedding sustainability in everything we do",
    "authors": [
        "RPA Editor"
    ],
    "categories": [
        "Net Zero"
    ],
    "pub_date": "2024-02-26T15:36:22+00:00",
    "content": [
        {
            "text": "In this blog we hear from RPA’s Net Zero lead, Michael Sinclair who talks about how RPA is embedding sustainability in everything it does."
        },
        {
            "text": "I’m going to start this blog with a confession. I don’t consider myself to be particularly ‘green’. Indeed, as an Exeter City fan, going green is often the last thing on my mind (apologies for the reference that the vast majority of people reading this probably won’t get if they don’t have a knowledge of lower league football rivalries!) However, I am passionate about doing the right thing and just wanted to share some of the work we're doing in RPA to embed sustainability in everything we do and show how everyone can play their part."
        },
        {
            "text": "Net Zero and our 5 Year Strategy"
        },
        {
            "text": "RPA’s 5 Year Strategy contains both internal and external Net Zero commitments which feed into both Defra’s and Greening Government Commitments. From the schemes we administer to the offices we work in, from our travel to our procurement, from our governance to our behaviours, all of these have sustainability ambitions at the heart of them."
        },
        {
            "text": "How are we embedding sustainability in RPA?"
        },
        {
            "text": "As an accredited paying agency, we administer more than 40 schemes, paying out over £2b annually to support the rural economy. More and more, this money is being paid to support farming in a way that benefits the environment and mitigates the impacts of climate change. Whether it’s our IT or the procurement of services and items, all these corporate services functions have sustainability focused policies and processes in place."
        },
        {
            "text": "In RPA we recently successfully trialled the Greener Stationery Items catalogue on behalf of the whole of Defra and have now implemented use of this. We’re decarbonising our travel by providing electric vehicles for our travelling field officers and encouraging the use of rail travel wherever possible for travel on official business. Sustainability plays a key part in our governance and all changes to existing processes or new strategies that go to our Directors for agreement require the sustainability impacts to be documented."
        },
        {
            "text": "Acting sustainably is also referenced in our performance standards for our staff and we’re building on this by actively encouraging everyone who works at RPA to think about their behaviours and make changes to their actions. All of our Directors sponsor a sustainability-related theme and work with staff networks to help us make progress and increase awareness in these areas."
        },
        {
            "text": "We have training for our staff and team discussions to help them discuss and identify some simple behavioural changes we can make in both our work and private lives. And it’s that sense of collective responsibility and how we can all play our part that will really help us to start making a difference."
        }
    ]
}