{
    "url": "https://defrafarming.blog.gov.uk/2024/02/26/watch-velcourt-2024/",
    "title": "Watch: Velcourt 2024",
    "authors": [
        "The Team"
    ],
    "categories": [
        "Farming and Countryside Programme",
        "Sustainable Farming Incentive"
    ],
    "pub_date": "2024-02-26T15:09:12+00:00",
    "content": [
        {
            "text": "In this post, we share 3 videos from Velcourt 2024 featuring Farming and Countryside Programme Director Janet Hughes."
        },
        {
            "text": "The conference took place in Reading on 21 January."
        },
        {
            "heading": 2,
            "text": "Transition update"
        },
        {
            "text": "In this video, Janet gives an overview of the farming offer in England, beginning with the Sustainable Farming Incentive (SFI)."
        },
        {
            "text": "Janet gives a summary of the scheme with an update on uptake, setting out how we're working to make the scheme as flexible, accessible and straightforward as possible. This includes our work on the combined SFI and Countryside Stewardship (CS) offer."
        },
        {
            "text": "Higher Level Stewardship, Landscape Recovery, grants and our approach to farming regulation are also covered."
        },
        {
            "heading": 2,
            "text": "Transition Q&A"
        },
        {
            "text": "In this video, attendees put their questions about the agricultural transition to Janet. These include the impact of our schemes on food production and the farming budget."
        },
        {
            "heading": 2,
            "text": "Applying for SFI"
        },
        {
            "text": " "
        },
        {
            "text": "In this video, attendees ask about the Sustainable Farming Incentive, including the design of the scheme and the new online RLE1 service."
        },
        {
            "heading": 2,
            "text": "Apply for SFI"
        },
        {
            "text": "Join over 11,000 farmers who have already applied for SFI and choose from the 23 actions on offer."
        },
        {
            "text": "By waiting for the new actions coming in summer, you could be losing out on funding."
        },
        {
            "text": "If you apply now, you will be able to add actions to your agreement annually - or have multiple agreements when further actions are available."
        }
    ]
}