{
    "url": "https://defradigital.blog.gov.uk/2024/02/26/why-i-chose-to-join-defras-cloud-academy-steven-calder/",
    "title": "Why I chose to join Defra’s Cloud Academy: Steven Calder",
    "authors": [
        "Steven Calder"
    ],
    "categories": [
        "Defra digital",
        "Defra services"
    ],
    "pub_date": "2024-02-26T07:30:44+00:00",
    "content": [
        {
            "text": "Steven Calder provides an insight into why he chose to apply for an ICT apprenticeship in the Defra Cloud Academy."
        },
        {
            "text": "I’m Steven and I’m enrolled on a Level 3 Information and Communications Technology Apprenticeship in the Defra Cloud Academy."
        },
        {
            "text": "Before starting my Defra apprenticeship, I was a Tax and Benefits advisor with His Majesty’s Revenue and Customs."
        },
        {
            "text": "And before that I had a successful 20-year career as an Operational Manager with the Royal Mail, where I’d taken the opportunity to jump into the unknown by accepting voluntary redundancy, confident in the knowledge that I would be able to create a new career pathway for myself; and here I am."
        },
        {
            "heading": 2,
            "text": "Not your average apprentice"
        },
        {
            "text": "As you can probably tell, I’m a mature apprentice, and at an age when many people might be starting to think about winding down their careers."
        },
        {
            "text": "Not me though. I’m still keen to develop my skills and experience, and I see this apprenticeship as a brilliant opportunity to do that."
        },
        {
            "text": "Today, a typical day involves me working on projects within the Defra Cloud Centre of Excellence to improve and automate existing infrastructure, reviewing, and deploying continuous improvement and innovation opportunities."
        },
        {
            "text": "https://youtu.be/dEMbzHcd9dI"
        },
        {
            "text": "At first it was a very steep learning curve for me, starting from an initial low IT base knowledge. Networking and coding are skills which require time to develop."
        },
        {
            "text": "The best thing about my apprenticeship experience here in Defra though has been the insight I’ve gained into the infrastructure which supports web applications and how projects are built, developed, and maintained."
        },
        {
            "heading": 2,
            "text": "Where I hope to take my career plans from here"
        },
        {
            "text": "I hope to build upon my learning journey and move to a higher grade within the service area I support. I will also look for opportunities to help and mentor those on future cohorts who are embarking on the same journey and programme that I’ve been on."
        },
        {
            "text": "Yes, you do need to be resilient, hardworking, and determined to succeed. But being here in Defra, where we prioritise potential and invest in our people so they can enjoy their job, makes me realise how important it is to feel valued, and to feel like I’m contributing to Defra’s aims."
        },
        {
            "text": "My apprenticeship has certainly been a steep learning curve, but I’ve enjoyed every minute of it so far. I’m sure you would too, because I’m living proof that it’s never too late to learn something new or change your career."
        },
        {
            "text": "So, my message to anyone thinking of applying to a talent programme such as the Defra Cloud Academy is ‘Don’t hold back, go for it’. You will take from the experience as much as you are prepared to put in."
        }
    ]
}