{
    "url": "https://space.blog.gov.uk/2022/05/20/championing-space-at-the-symposium/",
    "title": "Championing space at the Symposium",
    "authors": [
        "Paul Bate"
    ],
    "categories": [
        "Events",
        "International"
    ],
    "pub_date": "2022-05-20T12:01:00+01:00",
    "content": [
        {
            "text": "Hosted among the iconic red sandstone formations and mountain views of Colorado Springs in the United States, I attended the 37th Space Symposium last month alongside colleagues from the UK Space Agency. We were joined by partners from the Department for Business, Energy and Industrial Strategy, Department for International Trade, Ministry of Defence, Science and Technology Facilities Council, Harwell Space Cluster, the Department for Transport, and the Civil Aviation Authority – so it was a real team effort to champion the UK’s growing space ambitions to an international audience."
        },
        {
            "text": "The annual Space Symposium brings together space leaders from around the globe to discuss, address and plan for the future of space. After working virtually with international partners over the last two years, the symposium was a welcome opportunity to bring these important relationships to life and to promote, in-person, the value that the UK brings to this exciting, global sector."
        },
        {
            "text": "Above all, I was struck by the sense of unity among the space community in the face of Russia’s invasion of Ukraine. There was an atmosphere of unwavering support for our Ukrainian peers at the Symposium, and it made me proud to be a part of this wonderful community using space technologies and innovation to benefit our planet and its people."
        },
        {
            "heading": 2,
            "text": "Purposeful championing"
        },
        {
            "text": "In today’s uncertain geopolitical environment, building and maintaining relationships has real value. However, the best relationships are those based on shared purpose and passion to deliver, and that is what we aim to achieve between the UK and our partners by utilising events like the Space Symposium for meaningful engagement."
        },
        {
            "text": "Following the publication of the UK’s National Space Strategy, the symposium was a timely occasion to highlight the value proposition we bring as an Agency: catalysing investment, delivering missions and capabilities, and championing space. With these clear objectives in sight, we are consciously moving towards developing our relationships with companies and international partners based on the specific areas where they can create value for the UK space sector, and where we can create value for them."
        },
        {
            "text": "Just as the challenging mountains of Colorado require hard work and dedication to navigate them and reach the summits, a similar focus is essential for the UK space sector to pursue goals, establish agreements, and to thrive. It is with this in mind that the UK team and I met with global stakeholders across government and industry to discuss areas of mutual interest, including collaborative science, launch and exploration. We had productive meetings with space agency partners including NASA, the Japan Aerospace Exploration Agency, the European Space Agency, and the Australian Space Agency. We engaged with key industry players such as Rolls Royce, BAE Systems, Goonhilly, Raytheon UK, Inmarsat and Viasat, Boeing, Lockheed Martin, MDA, and Northrop Grumman; each of whom bring invaluable expertise to the sector."
        },
        {
            "heading": 2,
            "text": "Showcasing space"
        },
        {
            "text": "There were significant opportunities to explore the exhibition area, engage with hundreds of people working in the sector and experience the impressive stands on display at the symposium. These included Northrop Grumman’s Habitation and Logistics Outpost (HALO) module for NASA’s Gateway, Lockheed Martin’s Orion capsule mock-up, NASA’s showcase of an original spacesuit (along with space gloves to try on) and the Australian Space Agency’s brilliant showcase of the commercial sector Down Under. Each of these organisations has a unique set of capabilities and experience, and they presented them at the Symposium successfully in their own way. This is an apt reflection of international collaboration in the space sector: everyone brings something unique to the table and, when we come together, the possibilities are endless."
        },
        {
            "text": "Prior to the Symposium, I was joined in Los Angeles by the UK Space Agency’s Deputy CEO Ian Annett and a team from the BEIS Space Directorate for meetings and facility tours with US industry including Virgin Orbit, ABL Space Systems, SpaceX, The Aerospace Corporation and Northrop Grumman. These meetings provided helpful insight into emerging space technologies, as well as how the US space sector operates and manages investment – useful learning as we look to drive investment at home in the UK and establish ourselves as the leading satellite launch destination in Europe. We also used the trip to discuss the opportunities for further UK collaboration on upcoming science and exploration missions with NASA’s Jet Propulsion Laboratory (JPL) – and it was a huge honour to visit an organisation which has been at the heart of humanity’s efforts to explore and benefit from space for decades."
        },
        {
            "heading": 2,
            "text": "Onwards and upwards"
        },
        {
            "text": "The UK space sector has taken great strides in recent years, driven by a mix of world-class expertise, ambitious government commitments to growth and the hard work of my colleagues in the UK Space Agency. The symposium was an excellent platform to showcase the amazing skills, ideas, and products that the UK can bring to our international counterparts. Space is a team sport, and it was useful as ever to share ideas with and learn from the companies and governments of global spacefaring nations."
        },
        {
            "text": "It was a pleasure to experience the US space sector first-hand and engage with our global counterparts in Colorado. I look forward to being able to showcase even more great UK space successes at the Symposium next year!"
        }
    ]
}