{
    "url": "https://socialcare.blog.gov.uk/2022/05/20/empowering-people-with-learning-disabilities-to-make-end-of-life-plans/",
    "title": "Empowering people with learning disabilities to make end of life plans",
    "authors": [
        "Beth Britton"
    ],
    "categories": [
        "Care and support",
        "learning disabilities",
        "Workforce"
    ],
    "pub_date": "2022-05-20T12:01:31+00:00",
    "content": [
        {
            "text": "Talking about death and dying is difficult for most of us, but historically it has been a huge barrier for people with learning disabilities."
        },
        {
            "text": "During the last major project I supported MacIntyre with, the Department for Health and Social Care VCSE funded Dementia Project, it became apparent that many people with a learning disability are not being involved in conversations about their end of life care, what dying means, or having opportunities to make their own decisions regarding their death."
        },
        {
            "heading": 2,
            "text": "Dying to talk"
        },
        {
            "text": "MacIntyre are now looking to redress this imbalance through their pilot project, ‘Dying to Talk’ funded by the National Lottery Community Fund."
        },
        {
            "text": "Their aim is to help individuals, family members, MacIntyre staff and wider professional communities feel less frightened to talk about death and dying and gain more knowledge about the subject to promote and facilitate greater personal choice."
        },
        {
            "text": "This project will create a legacy of resources and training guidance, including a help guide to encourage advance care planning and will writing."
        },
        {
            "heading": 2,
            "text": "My plan before, and after, I die"
        },
        {
            "text": "Although the focus of the project team is on our pilot areas of Derbyshire, Leicester, Worcestershire and Herefordshire, we have many resources that are freely available to everyone."
        },
        {
            "text": "These include ‘My plan for before I die’ and ‘My plan for after I die’."
        },
        {
            "text": "Both of these plans are in an Easy Read format, with accompanying guidance for staff who are supporting people with a learning disability. These plans enable the recording of a person’s thoughts and wishes and help to open up conversations that may have been avoided for a long time. This gives a person with a learning disability more choice and control over the end of their life."
        },
        {
            "text": "To support these conversations, we are using resources including Grave Talk cards, Books Beyond Words and many different communication tools including picture cards and Talking Mats."
        },
        {
            "heading": 2,
            "text": "One chance to get end of life care right"
        },
        {
            "text": "It may take a long time to gather information for a person’s end-of-life plans, and they may never be completed, but any information can help health and social care staff support a person with a learning disability more appropriately."
        },
        {
            "text": "As this report says, we only get one chance to get a person’s death right. People with learning disabilities have an equal right to a ‘good death’, and we hope by making conversations and planning more normalised through the Dying to Talk Project we can help everyone within MacIntyre and the wider health and social care sector to get end of life care right."
        }
    ]
}