{
    "url": "https://designnotes.blog.gov.uk/2022/05/20/how-to-land-a-job-as-a-junior-designer-or-researcher/",
    "title": "How to land a job as a junior designer or researcher",
    "authors": [
        "Amina Omar - Service Designer, GDS",
        "Claire Ben-Chorin - User Researcher, GDS",
        "Gracie Hawkins - Junior Graphic Designer, GDS",
        "Helen Wilkinson - Content Designer, GDS",
        "Rose Westcott – Interaction Designer, GDS"
    ],
    "categories": [
        "Content Design",
        "Interaction Design",
        "Service Design",
        "User Research"
    ],
    "pub_date": "2022-05-20T09:00:05+01:00",
    "content": [
        {
            "text": "The public sector is building many exciting services and products to help users better interact with the government everyday. We want user research and design to sit at the heart of our work and we’re constantly looking to recruit new people to join us. "
        },
        {
            "text": "Whether you’ve just graduated from university, are switching careers, or just want to try out something new, landing your first job is always the hardest part. So if you’re interested in getting a junior role in user research, service design, content design or interaction design, and want some of our top tips then read on! "
        },
        {
            "heading": 2,
            "text": "What to do before you apply\n"
        },
        {
            "heading": 3,
            "text": "Gain some experience"
        },
        {
            "text": "Arranging internships during summer breaks, finding a mentor to shadow, volunteering with charities and taking on freelance work can all be great ways to build your experience. Using your time to do this is not only beneficial for developing your user-centred design (UCD) skills but also for gaining confidence in your field. It allows you to understand what your capabilities are, what you’re interested in and areas you want to improve on. "
        },
        {
            "text": "Also, remember the experience some job opportunities request doesn’t always need to come from a traditional UCD job role (though if it is, that’s great). Maybe you’ve worked for a year or 2 in a different role but have been applying user-centred thinking to that role or a side project. For example, many content designers develop their UCD skills in entry roles to do with whilst writing for the web, before making the move into content design. It’s all about leveraging the experience you’ve got."
        },
        {
            "heading": 3,
            "text": "Build your user-centred design network"
        },
        {
            "text": "Finding a mentor can be a beneficial part in the process of gaining experience, however, finding them can be a challenge. A good place to start is asking people you already know, like past tutors and alumni from your place of education, but this may not be the same for everyone. "
        },
        {
            "text": "Don’t be afraid to approach someone directly whose work you admire. Usually the person you reach out to will be flattered by your interest in their work, and even if they can’t offer you direct experience, they may still be able to point you in the direction of someone who can. It’s never a bad thing to take a ‘nothing ventured, nothing gained’ approach to building your network and finding mentors."
        },
        {
            "heading": 3,
            "text": "Research organisations and the roles available"
        },
        {
            "text": "Get to know the organisations you’re interested in applying to. For example, the Government Digital Service (GDS) is the central hub of digital government and maintains GOV.UK, the GOV.UK Design System and other cross-government platforms. "
        },
        {
            "text": "One of its principles is to work in the open, so GDS folk write lots of blog posts on projects – reading some of these can help you understand the type of work the teams work on and think about how you might fit in. For example, there’s:"
        },
        {
            "text": "A quick look through an organisation’s blogs and social media could surface some helpful information on the role you’re applying for. "
        },
        {
            "heading": 3,
            "text": "Document experience as you go"
        },
        {
            "text": "Keep a thorough record of your experience as you gain it, whether it’s professional, or while in education. Remember that prospective employers aren’t only interested in polished work that has been created in a professional environment but also the rough, unfinished projects that show your own individual thinking and process, so document everything."
        },
        {
            "text": "Think about how you’ll present your work. We’ve written a lot more on how to document your work in another post. "
        },
        {
            "heading": 2,
            "text": "When you’re ready to apply"
        },
        {
            "text": "So you’ve got your experience, it’s all documented, and you’ve researched roles and organisations – great! Once you’ve found that dream UCD role in the Civil Service, let’s take a look at the things you need to do to pass that CV sift and land the job."
        },
        {
            "heading": 3,
            "text": "Prepare your application"
        },
        {
            "text": "The application stage can seem quite daunting – but don’t worry! In your cover letter and CV, focus on showing the best areas of your work and give concrete examples of what you did and the impact it had."
        },
        {
            "heading": 3,
            "text": "Get feedback"
        },
        {
            "text": "Getting feedback can make a big difference to your application. It can be helpful to get support and feedback from UCD communities, mentors or others who are working in your field.  "
        },
        {
            "text": "If you haven’t got a UCD friend to help you out, ask colleagues, teachers or friends to have a read of your application before you submit it. They may be able to give advice, sense check or spot minor issues with your application that you might have missed – having a few pairs of eyes on something is never a bad thing!"
        },
        {
            "heading": 3,
            "text": "Prepare for a task-based exercise"
        },
        {
            "text": "For some roles, you may be asked to prepare a task 24 to 48 hours before your interview. Don’t be intimidated by the task, your interviewers are mostly interested in how you break down the problem and walk them through it. Some people present sketches, slides or even just bullet point lists - choose whichever way you feel most confident. "
        },
        {
            "text": "It’s important to centre your approach to the task around meeting user needs. "
        },
        {
            "heading": 3,
            "text": "How to nail the interview"
        },
        {
            "text": "With your previous work documented in detail, you can look back at your experiences and find the ones that best demonstrate the skills listed in the Digital, Data and Technology Profession Capability Framework for your role. The framework is invaluable for getting a good idea of the user-centred design skills you’ll need to show in the interview to be successful."
        },
        {
            "text": "Approach the interview in a structured way, using the STAR method (Situation, Task, Actions, Results) to talk about your experiences methodically. It’s a good idea to have 2 examples prepared for each competency or skill being assessed at the interview (you’ll find these listed in the job ad). You can use the same project more than once in your examples so it’s okay if you feel you have discussed one project a lot. Be sure to focus on what you did personally, try to use ‘I’ not ‘we’ – we all work in teams, but the interview panel will be assessing how the actions you took initiative to deliver results, so this needs to be clear."
        },
        {
            "heading": 3,
            "text": "Reflect on the lessons you’ve learned"
        },
        {
            "text": "In the interview, don’t be afraid to talk about where things failed. Projects rarely go perfectly first time – working in user-centred design means doing the best with the knowledge you have at the time and then iterating to improve, based on data and evidence. "
        },
        {
            "text": "It’s okay if some of your examples are ‘works in progress' or didn’t go quite to plan the first time around. Those examples can be some of the best to talk about – they allow you to reflect on what went wrong, show what you’ve learned from that experience and explain what you’d do differently next time. If you’re using the STAR format, then the learning you're gaining is still a very valid Result. "
        },
        {
            "heading": 3,
            "text": "Always bring it back to the user"
        },
        {
            "text": "To nail the interview, you’ll need to demonstrate your user-centred thinking. The interview panel needs to hear about what you did to improve the experience for the person using your work, or at least evidence of how you factored the user into your work, so try to tie your examples up with a ‘user-centred bow’ – a point that clearly demonstrates how the work you did helped to improve things for the user. It doesn’t matter how minor that improvement is – it could be a subtle shift in data, improvements in what you saw during user testing, or a single positive piece of user feedback. It all counts when making services better for users."
        },
        {
            "text": "Good luck! "
        }
    ]
}