{
    "url": "https://space.blog.gov.uk/2022/05/20/in-person-at-the-space-propulsion-conference/",
    "title": "In-person at the Space Propulsion Conference",
    "authors": [
        "Josh Brayford"
    ],
    "categories": [
        "Events",
        "Satellites"
    ],
    "pub_date": "2022-05-20T12:27:58+01:00",
    "content": [
        {
            "text": "Last week (8-13 May) the UK Space Agency sponsored the Space Propulsion Conference 2022 in Estoril, Portugal."
        },
        {
            "text": "The conference marked a return to in-person events for the space propulsion community, with more than 500 people attending and 40 joining virtually."
        },
        {
            "text": "A team from the UK Space Agency and Science and Technology Facilities Council (STFC) attended with three objectives in mind..."
        },
        {
            "heading": 2,
            "text": "The UK's first satellite propulsion test facility"
        },
        {
            "text": "We promoted the UK’s first national satellite propulsion test facility, which has now opened in Westcott. This site builds capacity in chemical propulsion testing up to 1500N and gives industry the opportunity to build, test, and get to market quicker, all within the UK. Supported by the Science and Technology Facilities Council and operated by NAMMO UK, both of whom were present, we made a great impression on announcing the site and we have already received enquiries for use."
        },
        {
            "heading": 2,
            "text": "The National Space Strategy"
        },
        {
            "text": "We also promoted the Government’s new National Space Strategy and champion our position as a leading nation in space. Andrew Ratcliffe, Chief Engineer at the UK Space Agency, joined a panel with the heads of our fellow ESA member states: Germany, France, Sweden, Portugal, Italy and ESA’s director of Space Transportation. What really resonated with attendees was the UK’s clear direction and ambition for space, and all the opportunities we plan to explore as outlined in the National Space Strategy."
        },
        {
            "heading": 2,
            "text": "Launch plans around the world"
        },
        {
            "text": "As well as sharing our own work, we wanted to gain a deeper knowledge of propulsion and launch plans from around the world. The UK is aiming to be the leading country in Europe to offer small satellite launch, with the first horizontal launch from Spaceport Cornwall later this year, followed by vertical launches from Scotland at both Space Hub Sutherland and SaxaVord Spaceport in Shetland. The conference hosted several panel discussions and roundtables that were engaging, varied and ambitious on a range of subjects from air breathing electric propulsion to reusable systems. The session that stood out for me was the roundtable on engine developments for European small launchers, which explored other European ambitions to launch alongside the UK. We all came away having learned something new."
        },
        {
            "text": "There were also several UK companies presenting at the event with 40 UK papers and technical presentations from industry and academia, further showcasing the incredible heritage, capability, and innovation the UK has in space propulsion."
        },
        {
            "text": "I think it’s safe to say that all of us enjoyed the conference and come away inspired and driven to continue promoting the UK’s propulsion capabilities."
        },
        {
            "text": "Obrigado!"
        },
        {
            "text": " "
        }
    ]
}