{
    "url": "https://medregs.blog.gov.uk/2022/05/20/international-clinical-trials-day/",
    "title": "International Clinical Trials Day",
    "authors": [
        "Martin O'Kane"
    ],
    "categories": [
        "Conferences and events"
    ],
    "pub_date": "2022-05-20T08:55:48+01:00",
    "content": [
        {
            "text": "Today we honour clinical trial professionals globally and volunteers who take part in clinical research"
        },
        {
            "text": "Clinical Trials Day is celebrated around the world to recognise the day that James Lind started what is often considered the first randomized clinical trial aboard a ship on May 20, 1747. Hypothesising that scurvy was caused by putrefaction of the body that could be cured through the introduction of acids, Lind recruited 12 men for his “fair test”."
        },
        {
            "text": "I’m pretty sure James Lind didn’t have to apply for regulatory approval to run his study, but if he was to do so today, he would find an innovation friendly, pragmatic and risk proportionate team in the MHRA Clinical Investigations and Trials group to safely support the life cycle of his trial. He would also find a UK clinical trials environment that is undergoing its biggest overhaul in 20 years. Some of the exciting changes he would find are:"
        },
        {
            "text": "Combined review of applications: Since the start of this year, all new clinical trials of investigational medicinal products in the UK have been benefiting from the combined review service, which has led to halving the approval time compared with separate applications."
        },
        {
            "text": "New UK legislation: In March we completed an 8-week public consultation on proposals to make the UK the best place to do research and develop safe and innovative medicines. The proposals aim to promote patient and public involvement in clinical trials, improve the diversity of participants, streamline clinical trial approvals, enable innovation, and enhance clinical trials transparency.  The engagement has been fantastic with over 2000 responses received.  We, along with colleagues at the Health Research Agency, are now carefully considering the feedback."
        },
        {
            "text": "Collaboration to deliver the UK vision for clinical research: This vision is being delivered through the cross-sector Recovery, Resilience and Growth (RRG) Programme and with the full involvement of stakeholders, including patients and the public, the NHS, industry, medical research charities, academia, research regulators, the National Institute for Health and Care Research and the Devolved Administration equivalents. The RRG Phase One Implementation Plan was published in 2021 and we have made strong progress in our first year."
        },
        {
            "text": "Clinical Trials Day gives me the opportunity to say a big public “THANK YOU” to my team, as well as everyone involved in clinical research, particularly those who volunteer to take part to advance science and medicine for the benefit of society, here and across the globe."
        },
        {
            "text": "Happy International Clinical Trials Day!"
        }
    ]
}