{
    "url": "https://deframedia.blog.gov.uk/2022/05/20/new-super-national-nature-reserve-created-to-protect-rare-wildlife-in-somerset/",
    "title": "New ‘super’ National Nature Reserve created to protect rare wildlife in Somerset",
    "authors": [
        "Defra Press Office"
    ],
    "categories": [
        "Weekly stories",
        "Wildlife"
    ],
    "pub_date": "2022-05-20T15:34:28+01:00",
    "content": [
        {
            "text": "Today we are looking at media coverage around our Natural England announcement of the declaration of a vast new ‘super nature reserve’ spanning across large parts of Somerset, created to protect rare wildlife and aid nature recovery."
        },
        {
            "text": "Yesterday’s announcement received coverage across national, regional and trade titles, including the Guardian, Daily Express, Independent, Times, BBC News Online, ITV News Online, Somerset County Gazette, Sky News, I News, The Telegraph, Western Morning News and Somerset County Gazette."
        },
        {
            "text": "Tony Juniper, the Chair of Natural England, was interviewed on the morning of the declaration by BBC Radio 4’s Today Programme and on BBC Radio Somerset.  The Environment Minister, Rebecca Pow spoke to Matt Chorley for his show on Times Radio. Along with key partners they both were also interviewed by BBC Points West and ITV West Country."
        },
        {
            "text": "The declaration of the new Somerset Wetlands ‘super’ National Nature Reserve (NNR) by Natural England and partners will protect 6,140 hectares of precious saltmarsh, heath and wetland habitats, home to nationally significant wildlife populations."
        },
        {
            "text": "The area is a stronghold for many different species of wetland and ground nesting birds like the Skylark, Bittern and Avocet. It is also a significant site for a huge variety of insects such as the hairy dragonfly, silver diving beetle and the raft spider – the second largest spider in the UK."
        },
        {
            "text": " Tony Juniper, Chair of Natural England, said: "
        },
        {
            "text": "Environment Minister Rebecca Pow said: "
        },
        {
            "text": "With the increasing need for a bigger, better and more joined-up approach to nature conservation, the declaration is an important moment for nature recovery. The site will knit together a total of six nature reserves and other nature managed land in the Somerset Levels, Coast and Moors and will join England’s developing Nature Recovery Network."
        },
        {
            "text": "Follow Defra on Twitter, and sign up for email alerts here"
        }
    ]
}