{
    "url": "https://nationalscreening.blog.gov.uk/2022/05/20/prof-sir-mike-richards-delighted-to-launch-expanded-remit-of-uk-national-screening-committee/",
    "title": "Prof Sir Mike Richards delighted to launch expanded remit of UK National Screening Committee",
    "authors": [
        "Andrew Anderson"
    ],
    "categories": [
        "Uncategorized"
    ],
    "pub_date": "2022-05-20T14:25:20+01:00",
    "content": [
        {
            "text": "New chair Professor Sir Mike Richards today officially launched the expanded UK National Screening Committee (UK NSC) with the video message above."
        },
        {
            "text": "Prof Richards said he was delighted to be taking on the role:"
        },
        {
            "text": "The UK NSC’s functions have expanded so it can now consider targeted and stratified screening in addition to its existing remit of looking at screening offered to groups of people identified from the whole population."
        },
        {
            "text": "Targeted screening aims to identify people with a higher risk of a condition beyond demographics such as age or gender. For example, smokers could be offered targeted lung cancer screening because they are at a higher risk of developing lung cancer regardless of age and gender."
        },
        {
            "text": "Stratified screening offers testing tailored to individual risk. For example, people with a family history of breast cancer could be referred to a high-risk clinic and screened more often than people without such a family history."
        },
        {
            "text": "In his video message, Prof Richards also highlights the opportunities for the UK NSC presented by the revolution in genetics and genomics."
        },
        {
            "heading": 2,
            "text": "Keep up to date"
        },
        {
            "text": "Hopefully this blog article has given you a flavour of work the new group will be getting involved in and we’ll be sure to keep you updated on progress. You can register to receive updates direct to your inbox whenever we publish a new article. If you have any questions about this blog article, or about the work of the UK NSC, please contact the UK NSC."
        }
    ]
}