{
    "url": "https://teaching.blog.gov.uk/2022/05/20/using-the-national-tutoring-programme-to-support-students-with-send/",
    "title": "Using the National Tutoring Programme to support students with SEND",
    "authors": [
        "Rebecca Kingston"
    ],
    "categories": [
        "SEND"
    ],
    "pub_date": "2022-05-20T09:28:02+01:00",
    "content": [
        {
            "text": "Rebecca Kingston is Deputy Headteacher at Ashlyns School in Hertfordshire. She explains how they have partnered with MyTutor through the National Tutoring Programme (NTP) to support students with special educational needs and disabilities (SEND). "
        },
        {
            "heading": 3,
            "text": "Carefully select the students who will benefit most"
        },
        {
            "text": "We had a look at data from the past year and selected students from across all year groups, identifying those with gaps in their learning, who would benefit most from tutoring."
        },
        {
            "text": "The year group that has seen a particularly positive impact from tuition has been Year 11, who make up a third of the students we’ve selected to receive tailored support. They’re really committed as they can see the results quickly and are conscious they have exams in the future. I’d recommend to any school considering tuition for the first time to concentrate on year groups with upcoming exams, as this tuition can aid exam preparation and bring students on board."
        },
        {
            "heading": 3,
            "text": "Consider how tuition will fit in alongside other school priorities"
        },
        {
            "text": "Any new programme requires some administration to implement. With the NTP, the task is to get students logged on and learning. With SEND students, some will need extra help. That might mean talking with them beforehand to ensure they’re confident in attending the session, making sure they are comfortable talking with their tutor, and briefing their tutor so that they are clear on the adjustments that may be needed for individual students and which areas they need to focus on."
        },
        {
            "text": "This will likely mean that someone in the school is assigned to oversee the delivery of tuition and they will work closely with the inclusion team to make sure the students have everything they need to get the most out of this support."
        },
        {
            "heading": 3,
            "text": "Encourage pupils to build a rapport with their tutor"
        },
        {
            "text": "Some of our students are happier talking to their tutors than others, but one positive we’ve seen from our tuition partner (TP), MyTutor, has been that they can generally offer the same tutor week after week. For students with SEND this is helpful, as they can sometimes struggle to work effectively and it can take time to build relations and trust. I would recommend you speak with your TP and see whether tutor consistency is something they can offer."
        },
        {
            "text": "Building a relationship between pupil and tutor is important and helps ensure the sessions are productive. The tutor needs to know in advance what adjustments and reassurance students might need, to get the best out of them."
        },
        {
            "heading": 3,
            "text": "Work on how best to support your students"
        },
        {
            "text": "We had one student who did their first session and said they didn’t want to continue anymore; they felt uncomfortable speaking into the camera and working with a tutor over their screen. We knew that tuition would be beneficial for them, so we discussed what we could do to help them feel more comfortable. It turned out that having a member of staff there would help, so someone sat in on the next session, and we’ve had teaching assistants sit in on other sessions. This allows the students to concentrate on their learning and make the most of the sessions."
        },
        {
            "heading": 3,
            "text": "Maximise student engagement with the programme"
        },
        {
            "text": "School support is essential for the success of the NTP, it’s important to demonstrate you are passionate about what can be achieved through tutoring, and this motivates those pupils taking part. The benefits for your students can be huge; I would certainly recommend it."
        }
    ]
}