{
    "url": "https://nationalscreening.blog.gov.uk/2025/11/26/consultation-opens-on-screening-for-intimate-partner-violence/",
    "title": "Consultation opens on screening for intimate partner violence",
    "authors": [
        "Cristina Visintin"
    ],
    "categories": [
        "UK National Screening Committee"
    ],
    "pub_date": "2025-11-26T08:44:40+00:00",
    "content": [
        {
            "text": "The UK National Screening Committee (UK NSC) has opened a consultation on evidence relating to screening for intimate partner violence.  "
        },
        {
            "text": "Intimate partner violence is one of the topics the committee reviews regularly for evidence relating to adult and antenatal screening.  "
        },
        {
            "text": "Evidence maps are typically the first step in the UK NSC process of reviewing evidence and we are asking individuals and organisations to provide feedback on the findings and conclusions of a 2025 evidence map on screening for intimate partner violence."
        },
        {
            "text": "The evidence map was commissioned to review literature on the topic published since the last evidence review in 2019. "
        },
        {
            "text": "The 2025 evidence map reaffirms the conclusion of the 2019 review and concludes this topic should not be reviewed again until new evidence becomes available that is likely to have a significant impact on the UK NSC recommendation. "
        },
        {
            "text": "This would mean any future requests to review the evidence for screening for intimate partner violence would need to be submitted through the UK NSC’s open call for topics. "
        },
        {
            "heading": 2,
            "text": "How to respond"
        },
        {
            "heading": 2,
            "text": "About intimate partner violence"
        },
        {
            "text": "Intimate partner violence (sometimes referred to as IPV) refers to any incident or pattern of controlling, coercive, threatening, or violent behaviour by a current or former intimate partner. It may involve physical, sexual, psychological, or emotional harm.  "
        },
        {
            "text": "Intimate partner violence is linked to serious health problems, including physical and mental health issues and even death. Intimate partner violence during pregnancy can lead to complications or harm for both mother and baby.   "
        },
        {
            "heading": 2,
            "text": "The latest evidence"
        },
        {
            "text": "The 2025 evidence map identified 10 studies reporting on the effectiveness of intimate partner violence screening in healthcare settings since the 2019 review. The evidence map highlighted important gaps, including:  "
        },
        {
            "text": "Most studies focused on detection and referral, while key outcomes such as prevention of intimate partner violence, morbidity, mortality, neonatal outcomes, children’s wellbeing, and quality of life were not reported. Only one study reported on the reduction of intimate partner violence, and it found no significant impact. "
        },
        {
            "heading": 2,
            "text": "Keep up to date"
        },
        {
            "text": "The UK NSC blog provides up to date news from the UK NSC. You can register to receive updates direct to your inbox, so there is no need to keep checking for new articles. If you have any questions about this blog article, or about the work of the UK NSC, please email uknsc@dhsc.gov.uk. "
        }
    ]
}