{
    "url": "https://defraenvironment.blog.gov.uk/2024/01/22/biodiversity-net-gain-what-are-the-exemptions/",
    "title": "Biodiversity Net Gain - what are the exemptions?",
    "authors": [
        "Land Use Policy Team"
    ],
    "categories": [
        "Biodiversity net gain",
        "Land use"
    ],
    "pub_date": "2024-01-22T16:34:19+00:00",
    "content": [
        {
            "text": "What are the exemptions? "
        },
        {
            "text": "The exemptions to the mandatory requirement were set out in the government response to the BNG regulations and policy consultation. The exemptions legislation was laid before parliament on 19 January and will become law when BNG goes live on 12 February."
        },
        {
            "text": "The list of exemptions from the BNG requirement is narrow and focused, keeping the policy ambitious, whilst being proportionate and deliverable for developers and local planning authorities:"
        },
        {
            "text": "Development below a de minimis threshold"
        },
        {
            "text": "This exemption applies to development that does not impact a priority habitat and impacts less than 25 square metres (e.g. 5m x 5m) of non-priority onsite habitat (such as modified grassland) or 5m for non-priority onsite linear habitats (such as native hedgerows). This exemption is designed to ensure that BNG does not apply to either very small scale development or development which does not impact habitat, through loss or degradation within the red line boundary. In practice, this will be demonstrated by a decrease in the biodiversity value, which is determined by the biodiversity metric."
        },
        {
            "text": "If a development impacts less than 25 square meters of non-priority habitat but 5m or more of non-priority linear habitat is negatively impacted, or vice-versa, then the exemption will not apply and all habitats will be subject to BNG."
        },
        {
            "text": "If any priority habitat within the red line boundary of the development is impacted, the exemption will not apply and all habitats will be subject to BNG."
        },
        {
            "text": "Developers should consult publicly available data sets on priority habitats to check whether there is priority habitat on site, they do not need to seek specialist advice to record the presence of priority habitat."
        },
        {
            "text": "An example of a de minims exemption would be a minor extension to a visitor centre at a public nature park to accommodate a new accessible ramp and entrance lobby on an existing hardstanding area. This proposal would not negatively impact or alter any habitat, but the red line which defines the development is likely to contain more than 25sqm of non-priority habitat."
        },
        {
            "text": "It’s worth remembering that existing sealed surfaces such as tarmac or buildings are assigned a zero score in the statutory biodiversity metric, meaning that these surfaces are effectively exempted from the 10% net gain requirement."
        },
        {
            "text": "This exemption ensures that BNG is applied proportionately and that a development does not incur unnecessary extra cost to, for example, comply with accessibility requirements as in the example above. It also encourages developers to design in ways to avoid impacting the habitat on site in the first place, following the biodiversity gain hierarchy."
        },
        {
            "text": "Further information on this exemption, including what evidence will be required to show that a development is in scope of this exemption, is available in the planning practice guidance."
        },
        {
            "text": "Householder Development"
        },
        {
            "text": "This exemption applies to development to an existing house (including development within the curtilage of a house.)  An example of this type of development is adding a side-return."
        },
        {
            "text": "It does not cover applications for change of use of a house or to change the number of dwellings in a building."
        },
        {
            "text": "Biodiversity Gain Sites"
        },
        {
            "text": "Where an off-site biodiversity gain project itself requires planning permission, the enhancement may require its own 10% net gain. This would then effectively decrease the biodiversity gains created. This exemption will prevent that. This applies to:"
        },
        {
            "text": "Small Scale Self-Build and Custom Housebuilding"
        },
        {
            "text": "To support smaller developers, we are exempting small scale self and custom build development from the BNG requirement. This exemption applies only to development that:"
        },
        {
            "text": "This size criteria will ensure that only small self and custom build sites are caught by the exemption. Self and custom build sites in excess of these thresholds, which are impacting more habitat and so have more scope to deliver gains for nature will to be required to deliver a net gain. This will apply whether they are a standalone development site or secured for self or custom build as part of a major development."
        },
        {
            "text": "High Speed Railway Transport Network – The exemption for the High Speed Railway Transport Network covers development which is part of or ancillary to the remaining phases of the high speed transport network."
        }
    ]
}