{
    "url": "https://stratcommand.blog.gov.uk/2024/01/22/commander-british-forces-commendations-for-no2-overseas-squadron-gibraltar/",
    "title": "Commander British Forces Commendations for No2 Overseas Squadron (Gibraltar)",
    "authors": [
        "abievans"
    ],
    "categories": [
        "Gibraltar",
        "Overseas Bases"
    ],
    "pub_date": "2024-01-22T11:13:57+00:00",
    "content": [
        {
            "text": "CBF Commendations for No2 Overseas Squadron"
        },
        {
            "text": "Last week, the No2 Overseas (Gibraltar) Squadron (Sqn) assumed they were turning up to a normal Thursday evening session. What they were unaware of, was that Commander British Forces (CBF), Commodore Tom Guy, was arriving at their Headquarters in Devil’s Tower Camp to present them all with a CBF Commendation."
        },
        {
            "text": "No 2 Overseas (Gibraltar) Sqn is one of four remaining Air Cadet Sqns who specifically cater for members of the Air Training Corps outside of the UK. The Sqn parades twice a week and is popular and well attended by a cohort of cadets from both the local population and Forces children alike."
        },
        {
            "text": "Members from the Sqn have been participating in the Duke of Edinburgh’s (DofE) Award Scheme throughout the year, culminating in the award of 30 DofE Blue Badges. These participants are subsequently working hard towards their Bronze level badges. Furthermore, the Sqn deployed to the UK and took part in the Norfolk & Suffolk Wing Field Day on their annual summer camp."
        },
        {
            "text": "Locally, the Sqn supports the RAF Station and British Forces Gibraltar with personnel all year round when requested. Notably, Sqn members have supported the Akrotiri Rugby 7’s visit, the RAF’s Battle of Britain Dinner and assisted in St Michael’s Cave during a concert performed by the Band of the RAF Regiment, where they helped to raise around £1,300 for their welfare fund."
        },
        {
            "text": "They have also taken part in several other charitable events including the Cancer Walk for Life and a Rock climb with Jacob the Pilot which raised £1,700 for the RAF Benevolent Fund."
        },
        {
            "text": "Flight Lieutenant (Flt Lt) Ivan Caward, Officer Commanding No. 2 Overseas (Gibraltar) Sqn Air Training Corps, also received a CBF Commendation. He leads a Squadron comprising of 6 adult leaders and 45 cadets, playing a vital role in all aspects of cadet life."
        },
        {
            "text": "In addition to working a demanding full-time job, Flt Lt Caward leads parade nights twice a week, organises activities, encourages and educates cadets, ensuring they are well drilled and presented immaculately when on Parade."
        },
        {
            "text": "During this year, Flt Lt Caward has promoted the development and military awareness of his Sqn through attendance at the National Camp in the UK, at which they shared experiences with their UK based counterparts and also took to the sky in gliders."
        },
        {
            "text": "The time and energy which Flt Lt Caward dedicates to the young people under his charge and his unswerving commitment is deserving of recognition."
        }
    ]
}