{
    "url": "https://companieshouse.blog.gov.uk/2024/01/22/get-ready-for-changes-to-uk-company-law/",
    "title": "Get ready for changes to UK company law",
    "authors": [
        "Rachael Watts - Head of Implementation Unit"
    ],
    "categories": [
        "Changes to UK company law",
        "Companies House transformation"
    ],
    "pub_date": "2024-01-22T14:03:26+00:00",
    "content": [
        {
            "text": "The Economic Crime and Corporate Transparency Act became law in October 2023. Since then, we’ve been getting ready to introduce the measures brought in by the act."
        },
        {
            "text": "We're aiming to introduce the first set of changes on 4 March 2024. The introduction of these changes needs secondary legislation so this date is still dependent on parliamentary timetables. It will not be earlier than 4 March 2024. These changes include:"
        },
        {
            "heading": 2,
            "text": "What these early changes mean for you"
        },
        {
            "text": "We know companies, intermediaries and other stakeholders want to make sure they’re ready for the changes so that they can take action at the right time. Anyone thinking about incorporating a company should also be keeping a keen eye on developments."
        },
        {
            "text": "We’ve summarised 3 of the changes in this blog post to help you to prepare:"
        },
        {
            "text": "For more information on the other changes brought in by the act, visit our new website."
        },
        {
            "heading": 2,
            "text": "New rules for registered office addresses"
        },
        {
            "text": "From 4 March 2024, there’ll be new rules for registered office addresses which mean companies must have an ‘appropriate address’ as their registered office at all times. An appropriate address is one where:"
        },
        {
            "text": "These changes mean you will not be able to use a PO Box as your registered office address from 4 March 2024. You can still use a third-party agent’s address if they meet the conditions for an appropriate address."
        },
        {
            "text": "If you’re currently using a PO Box as your registered office address, you’ll need to change it by 4 March 2024. You can change your company’s registered office address online, using your company’s authentication code."
        },
        {
            "text": "Companies that do not have an appropriate registered office address could be struck off the register. When we identify an inappropriate registered office address, we’ll change it to a default address held at Companies House. The company must then provide an appropriate address, with evidence of a link to that address, within 28 days. If we do not receive this evidence, we’ll start the process to strike the company off the register."
        },
        {
            "heading": 2,
            "text": "Registered email address"
        },
        {
            "text": "From 4 March 2024, there’ll be a new requirement for all companies to give a registered email address to Companies House. This email address will not be published on the public register."
        },
        {
            "text": "From 4 March 2024, new companies will need to give a registered email address when they incorporate. Existing companies will need to give a registered email address when they file their next confirmation statement with a statement date from 5 March 2024. Our online services will prompt you to supply a registered email address when you file your next eligible confirmation statement."
        },
        {
            "text": "We’ll use this email address to communicate with you about your company, so it's important that you choose an appropriate email address. You can register the same email address for more than one company."
        },
        {
            "text": "You’ll be able to change your registered email address through our new ‘update a registered email address’ service. You’ll need to be signed in and authenticated to do this."
        },
        {
            "text": "Companies will have a duty to maintain an appropriate registered email address, in the same way as their registered office address. Any company that does not do this will be committing an offence."
        },
        {
            "heading": 2,
            "text": "Statement of lawful purpose"
        },
        {
            "text": "When you incorporate a company from 4 March 2024, the subscribers (shareholders) will need to confirm they’re forming the company for a lawful purpose."
        },
        {
            "text": "You’ll also need to confirm the company’s intended future activities are lawful on the confirmation statement."
        },
        {
            "text": "The intention of these new statements is to make it clear that all companies on the register, new and existing, have a duty to operate in a lawful way. We may take action against your company if we receive information that confirms you’re not operating lawfully."
        },
        {
            "text": "We will not accept your documents if these statements have not been confirmed."
        },
        {
            "text": "From 4 March 2024, you’ll see these new statements when you incorporate a company or file a confirmation statement."
        },
        {
            "text": "These measures will all contribute towards meeting the new registrars’ objectives, and we’ll make all our decisions based on these objectives."
        }
    ]
}