{
    "url": "https://educationhub.blog.gov.uk/2024/01/22/how-were-upgrading-school-buildings-across-england/",
    "title": "How we're upgrading school buildings across England",
    "authors": [
        "mediaofficer"
    ],
    "categories": [
        "Condition Improvement Fund",
        "School building",
        "Schools"
    ],
    "pub_date": "2024-01-22T19:05:32+00:00",
    "content": [
        {
            "text": "Nothing is more important than the safety of pupils and teachers. "
        },
        {
            "text": "We’ve allocated over £15 billion since 2015 for keeping schools all over the country in good condition. That includes £1.8 billion for the 2023-24 financial year.  "
        },
        {
            "text": "Most of the funds are given to local authorities, large multi-academy trusts, and large voluntary aided school groups, to invest in maintaining and improving the condition of their schools. "
        },
        {
            "text": "The rest of the funds are targeted on essential maintenance projects at small and stand-alone academy trusts, other voluntary aided schools, and sixth-form colleges.  "
        },
        {
            "text": "We regularly monitor the condition of school buildings across England, and our recent condition survey shows that over 95 percent of the grades given to the different elements of buildings assessed were As and Bs – meaning they’re in a good or satisfactory condition.  "
        },
        {
            "text": "Here’s what you need to know. "
        },
        {
            "heading": 3,
            "text": "What is the School Rebuilding Programme? "
        },
        {
            "text": "Over this decade, our School Rebuilding Programme is transforming 500 schools in the most need of renovation.  "
        },
        {
            "text": "Schools are selected for the programme according to their condition.  "
        },
        {
            "text": "We have already selected the first 400 projects and currently, average project durations have either been completed on time or ahead of schedule.  "
        },
        {
            "text": "A list of confirmed projects is available, including information on when each was announced."
        },
        {
            "heading": 3,
            "text": "How are you supporting schools where there is RAAC? "
        },
        {
            "text": "Last year, to ensure schools continue to be safe for staff and pupils, we changed our approach to managing a building material found in some school buildings and other education settings, known as Reinforced Autoclaved Aerated Concrete (RAAC).   "
        },
        {
            "text": "The new guidance advises education settings to vacate areas that are known to contain RAAC, unless or until suitable mitigations are in place.  "
        },
        {
            "text": "As of 27 November, there are 231 schools and colleges with confirmed RAAC. Thanks to the hard work of education leaders and local councils, 99% were providing full time face-to-face education for all pupils. 3 settings had hybrid arrangements in place – they are all now in full time face-to-face education for all pupils. "
        },
        {
            "text": "Every school or college with confirmed RAAC is assigned dedicated support from our team of caseworkers.  "
        },
        {
            "text": "Project delivery teams are on site to support schools and colleges to implement mitigation plans. They work with them to put in place a bespoke plan that supports face-to-face education for all pupils as soon as possible based on their circumstances. "
        },
        {
            "text": "The government is funding the emergency mitigation work needed to make buildings safe. All reasonable requests for additional help with revenue costs, like transport to locations or temporarily renting a local hall, are being approved. "
        },
        {
            "text": "The government is funding longer-term refurbishment or rebuilding projects to rectify the issue where RAAC is identified in schools. Schools and colleges will either be offered capital grants to fund refurbishment work to permanently remove RAAC, or rebuilding projects where these are needed, including through the School Rebuilding Programme. "
        },
        {
            "heading": 3,
            "text": "Will schools with RAAC get support for exams? "
        },
        {
            "text": "We have been working at pace with schools to identify RAAC and support them to minimise disruption to pupils’ education. "
        },
        {
            "text": "That includes working with schools and colleges to put in place a bespoke plan that supports all pupils based on their circumstances. We are taking every step possible to remove any obstacles to learning."
        },
        {
            "text": "For some schools, this may include supporting them to provide extra education support for their pupils. "
        },
        {
            "text": "Alongside Ofqual, we have been working with Awarding Bodies to help them liaise with affected schools. "
        },
        {
            "text": "We’ve asked, where possible, for them to agree longer extensions for coursework and non-examined assessments so that schools have as much time as possible to complete this important part of pupils' learning and qualifications.  "
        },
        {
            "text": "Exams can only show what children know and can do – not what they might have been able to do if they had been taught differently, or under different circumstances. "
        },
        {
            "text": "As a result, it's not possible to make other changes to exams, assessments, marking or grading for some groups of pupils (such as increasing marks for these students) to address the impact of variable disruption to teaching. "
        },
        {
            "heading": 3,
            "text": "What about schools where there is asbestos? "
        },
        {
            "text": "Asbestos management in schools is regulated by the Health and Safety Executive (HSE) and we follow their expert advice.  "
        },
        {
            "text": "The HSE advises that, as long as materials are in good condition, well protected, and unlikely to be damaged or disturbed, it is usually safer to manage them in place. "
        },
        {
            "text": "However, if the asbestos is found to be at a significant risk of disturbance or accidental damage and it’s not safe to leave where it is, it is the duty holder’s responsibility to make sure it is removed by a trained specialist. "
        },
        {
            "text": "We’re working with the sector to promote best practice and guidance so that schools are aware of their duties to keep children and teachers safe. "
        },
        {
            "text": "We previously run an Asbestos Management Assurance Process (AMAP) - a voluntary survey we launched in March 2018 to understand the steps schools and those responsible for their estate were taking to manage asbestos. "
        },
        {
            "text": "Over 20,600 schools in England responded and it showed that most schools continue to follow core statutory duties. "
        },
        {
            "text": "We are now collecting Information from schools on how they are managing asbestos through our Condition Data Collection 2 (CDC2), which started in 2021 and will complete in 2026. It is expected to cover all state funded schools. "
        },
        {
            "heading": 3,
            "text": "Whose responsibility is it to maintain school buildings? "
        },
        {
            "text": "It is the responsibility of those who run our schools – typically academy trusts, local authorities, and voluntary-aided school bodies and their schools – who work with their schools’ day-to-day to manage the safety and maintenance of their schools.  "
        },
        {
            "text": "They should alert us if there is a serious concern with a building they can’t manage. "
        },
        {
            "text": "We provide access to funding targeted towards where it is most needed to help them carry out these responsibilities, alongside a package of other guidance and support. "
        },
        {
            "text": "We provide additional support on a case-by-case basis if we are alerted to a serious safety issue. "
        },
        {
            "heading": 3,
            "text": "What about the old schools that were built in the 1960s, will these be replaced? "
        },
        {
            "text": "Around 31% of the floor area of the school estate has been built since 2000. "
        },
        {
            "text": "But the age of a building doesn’t mean it’s at the end of its life. While schools can expect reasonable wear and tear, buildings that are well kept can be fit for purpose beyond their original design. "
        },
        {
            "text": "Our School Rebuilding Programme supports schools that do need buildings replaced, prioritising schools in poor condition and with evidence of potential safety issues. "
        },
        {
            "heading": 3,
            "text": "What are you doing to ensure the sustainability of schools? "
        },
        {
            "text": "The challenge of decarbonising a large estate isn‘t unique to schools and work of this scale takes time. "
        },
        {
            "text": "As part of our climate change and sustainability strategy, we are assessing emissions and the risk posed to schools by the impact of climate change, like flooding.  "
        },
        {
            "text": "This will allow us to set targets and act efficiently, cost-effectively and with least disruption. "
        },
        {
            "text": "We have already improved our building specifications so that they are better than building regulations on insulation and energy generation. "
        },
        {
            "text": "All new school buildings delivered by the DfE are designed to be net zero carbon in operation and include a range of climate change adaptive measures."
        }
    ]
}