{
    "url": "https://buyingforschools.blog.gov.uk/2024/01/22/how-joining-a-school-business-professional-network-could-help-you-with-buying-for-your-school/",
    "title": "How joining a school business professional network could help you with buying for your school",
    "authors": [
        "Frances Rowland, Chair, ABLE Network"
    ],
    "categories": [
        "Advice and support"
    ],
    "pub_date": "2024-01-22T09:39:31+00:00",
    "content": [
        {
            "text": "Frances Rowland is Chair of the Association of Business Leaders in Education (ABLE), a regional network for school business professionals in and around the East Midlands. In this blog post, Frances explains how the ABLE network supports school business professionals, and why you should consider joining a network if you’re not a member already."
        },
        {
            "text": "ABLE is open to business managers, office managers, administrators, chief finance officers (CFO), chief operating officers (COO), bursars, and any relevant senior support professionals in primary, secondary, special schools, academies, and multi academy trusts (MATs). Our network is geographically located in Nottinghamshire, but we have members across the East Midlands, including Derbyshire and Leicestershire."
        },
        {
            "text": "The group is organised by a dedicated committee of volunteer education professionals as a non-profit organisation offering support, training and up-to-date guidance to school business professionals (SBPs)."
        },
        {
            "text": "The committee has a range of experience gained from employment in local education across a variety of roles, from school and academy school business professionals to multi academy trust leadership, and specialist support roles for local schools and academies."
        },
        {
            "text": "I worked at Nottingham City Council’s Traded Services team for over ten years, supporting Nottingham city school business managers.  It was during this time I volunteered to sit on the ABLE committee. My role was sourcing speakers and presenters for our termly conferences and just before lockdown, I also took on the role of Chair of ABLE."
        },
        {
            "text": "What are the benefits of being part of a school business professional (SBP) network?"
        },
        {
            "text": "The role of SBP in a school can be a lonely one and the network is a great way to get out of the school environment and network with your peers."
        },
        {
            "text": "The peer-to-peer support that the group provides is at the heart of the network. Members value finding another professional to share problems and ideas with and we find our members are incredibly generous with their knowledge. We actively encourage new SBPs to reach out to us if they are looking for a mentor within our community."
        },
        {
            "text": "Continuous professional development (CPD) is another benefit of being part of a network. At ABLE, we align all our training with the role the SBP must cover. Every school is different, no one SBP has the same role, but the common themes are HR, finance, marketing, procurement, and site management."
        },
        {
            "text": "We host regular conferences and training days for our members, and we keep up to date with the latest developments in schools so that these events are considered and tailored to the needs of our members. For example, our next conference is themed ‘Working Towards Net Zero’ and we have commissioned specialists to provide workshops around this theme."
        },
        {
            "text": "This CPD supports our members to expand their knowledge and equips them with the skills needed to perform their roles in schools. Every member has an opportunity to say what they want us to cover at future events."
        },
        {
            "text": "Wellbeing is also a high priority for us as we know the job is busy and that our members often wear many hats. We design all our events to be motivating and uplifting to help support the wellbeing of our members."
        },
        {
            "text": "How can being part of a SBP network help members achieve improved value for money?"
        },
        {
            "text": "We have business partners and exhibitors keen to do business with schools.  They offer discounts and ABLE reward points which can be redeemed for school supplies. We also run training and workshops around procurement, grants and funding.  There are representatives from DfE at most of our conferences, who members can go to for buying advice to help them get good value in terms of cost, quality and time."
        },
        {
            "text": "How do you communicate within the network?"
        },
        {
            "text": "We try not to litter our members’ already full inboxes with emails. We issue a termly newsletter to all our members which gets good engagement, and we use social media to communicate and connect members."
        },
        {
            "text": "Our members also have access to the ABLE app which we can use to communicate but perhaps more importantly, they can use the app to communicate with each other and search for peers with skills that might be helpful for them. The app gives members points from suppliers that can be redeemed for school supplies – an added bonus!"
        },
        {
            "text": "What would be your main message to other SBPs about networks?"
        },
        {
            "text": "If you’re not in a network already, make the time to engage with your local network."
        },
        {
            "text": "Look at the events on offer and carve out time to attend things that support and enrich your role. If the theme of an event might suit a colleague rather than a member, let them know. Our membership allows for you to send someone else to attend in your place. It is not unusual for a head teacher or another school professional to attend in place of the ABLE member at one of our termly conferences or training half days."
        },
        {
            "text": "I would advise every member to report back to their senior leadership team after each event, to share what they have learned and how this might help them in their role. We try to tailor our network events so that members shouldn’t have to justify their absence from school. Instead, we like to think they need an excellent reason for not attending our events!"
        },
        {
            "text": "Being part of a network can be such a lifeline to SBPs. The value of the peer-to-peer support that a network can provide cannot be underestimated. Your fellow SBPs can understand the ups and downs of the job in a way that other colleagues in your school cannot and you will reap the benefits of being able to share your problems and experiences, and learn from one another."
        },
        {
            "text": "If you've found this article useful and want to learn more about how we’re supporting schools, click ‘sign up and manage updates’ to subscribe to our blog and receive notifications when we next post."
        }
    ]
}