{
    "url": "https://educationhub.blog.gov.uk/2024/01/22/how-to-claim-15-hours-free-childcare-code/",
    "title": "How to claim 15 hours free childcare including how to get your code",
    "authors": [
        "mediaofficer"
    ],
    "categories": [
        "Childcare"
    ],
    "pub_date": "2024-01-22T15:26:53+00:00",
    "content": [
        {
            "text": "Applications are now open for eligible working parents of 2-year-olds to receive 15 hours free childcare, starting from April 2024."
        },
        {
            "text": "It’s the first step in our promise to expand the 30 hours free childcare scheme for working parents from when their child turns nine months until they start school."
        },
        {
            "text": "From April 2024, eligible working parents of 2-year-olds will be able to access 15 hours childcare support."
        },
        {
            "text": "From September 2024, 15 hours childcare support will be extended to eligible working parents with a child from 9-months-old."
        },
        {
            "text": "From September 2025, 30 hours for eligible working parents with a child from 9-months-old up to school age."
        },
        {
            "text": "We’re making the biggest investment by a UK government into childcare in history, doubling the amount we expect to spend over the next few years from around £4 billion to around £8 billion each year."
        },
        {
            "heading": 3,
            "text": "How do I apply? "
        },
        {
            "text": "You need to meet our eligibility criteria before you can claim 15 hours free childcare."
        },
        {
            "text": "You apply online here on Gov.uk."
        },
        {
            "text": "You’ll need to make sure you have the following information to hand before starting the application:"
        },
        {
            "text": "You may find out if you’re eligible straight away, but it can take up to 7 days."
        },
        {
            "text": "Once your application has been approved, you’ll get a code for free childcare to give to your childcare provider."
        },
        {
            "text": "Applications are open from now until 31 March. If you miss the deadline you won’t be able to start using the new entitlements from 1 April. We encourage all parents to apply as soon as possible once they have receive their code."
        },
        {
            "heading": 3,
            "text": "What if I’m already registered for Tax Free Childcare?"
        },
        {
            "text": "Parents must reconfirm that they are still eligible for Tax-Free Childcare every 3 months."
        },
        {
            "text": "As applications are now open for the new free hours entitlement, when eligible parents reconfirm they will receive a code which will also enable them to access the new offer."
        },
        {
            "text": "To provide reassurance to parents with reconfirmation windows in late February and March, we’re taking additional steps to ensure every parent is able to give their code to their provider in good time."
        },
        {
            "text": "If your reconfirmation window opens on or after the 15 February, HMRC will send you a letter with a temporary code before this date."
        },
        {
            "text": "The letter will also explain how to use your code to claim your free place in April. Where possible, please wait for your letter to arrive. You don’t need to contact HMRC."
        },
        {
            "text": "Before your letter arrives, you can speak to your provider and use your eligibility for Tax-Free Childcare to demonstrate your eligibility for the new free hours entitlement, as the eligibility criteria are the same. You can do this by showing your provider:"
        },
        {
            "text": "However, you must wait for your code (either via letter or through your regular childcare account) to formally confirm your free place."
        },
        {
            "heading": 3,
            "text": "Do I need to wait for my reconfirmation window to add another child to my account?"
        },
        {
            "text": "A parent who is already using the childcare service for another child can add a new child to their account at any time."
        },
        {
            "text": "Your reconfirmation cycle for your current Tax-Free Childcare will not affect this."
        },
        {
            "heading": 3,
            "text": "What happens once I receive my code?"
        },
        {
            "text": "You’ll need to take the code to your childcare provider, along with your National Insurance Number and your child’s date of birth."
        },
        {
            "text": "Your childcare provider will process the code to provide your free place."
        },
        {
            "text": "Your local authority can provide support for finding a free place in your area."
        },
        {
            "heading": 3,
            "text": "If I receive a code in a letter from HMRC, does this make my code on my childcare account invalid?"
        },
        {
            "text": "We’re taking these additional steps as a small number of childcare providers are operating earlier deadlines to process codes."
        },
        {
            "text": "If you are aware of your childcare provider’s deadline, and your reconfirmation window opens before this deadline, you can continue to use the code accessed via your childcare account, even if you have received a letter with an alternative code. Both codes will be valid."
        },
        {
            "heading": 3,
            "text": "Do I still need to reconfirm if my window opens on or after 15 February? "
        },
        {
            "text": "If your reconfirmation window opens on or after 15 February, you will receive a letter with a temporary code which can be used straight away to claim your free place."
        },
        {
            "text": "However, once your reconfirmation window opens, you will still need to reconfirm via your Childcare Account and share this digital code with your provider."
        },
        {
            "text": "This is because you will need to continue to reconfirm via your Childcare Account to ensure your eligibility doesn’t lapse."
        },
        {
            "heading": 3,
            "text": "What happens if I lose the letter with my code?"
        },
        {
            "text": "Your letter from HMRC should arrive by 15 February. If you haven’t received a letter by 15 February, or if you lose the letter including your code after it has arrived, you should contact HMRC."
        },
        {
            "text": "Please wait for your letter to arrive before contacting HMRC."
        },
        {
            "heading": 3,
            "text": "My child turns 2 after 1 April. Why aren’t I entitled to free childcare? "
        },
        {
            "text": "You can only apply for the first phase of the new working parent entitlement if your child is already 2-years-old or will have had their 2nd birthday on or before 31 March 2024."
        },
        {
            "text": "Children who are born on or after 1 April will become eligible later in the year:"
        },
        {
            "text": "Parents are only able to claim the entitlements from the term after because this gives local authorities and childcare providers enough time to prepare."
        },
        {
            "heading": 3,
            "text": "How are you making sure there will be enough childcare places for eligible parents?"
        },
        {
            "text": "To make sure there are enough places available, we’re investing over £400 million in 2024-25 to increase the hourly rates paid to local authorities."
        },
        {
            "text": "For 2024-25, national average hourly rates paid by the government will be £11.22 for children under 2-years-olds, £8.28 for two-year-olds, and £5.88 for three- and four-year-olds."
        },
        {
            "text": "Start-up grants will also be available for new or returning childminders who have:"
        },
        {
            "text": "Childminders will receive grants of:"
        }
    ]
}