{
    "url": "https://cspl.blog.gov.uk/2024/01/22/post-office-horizon-an-accountability-failure/",
    "title": "Post Office Horizon - an accountability failure",
    "authors": [
        "Doug Chalmers"
    ],
    "categories": [
        "Accountability",
        "Ethical standards for providers of public services",
        "Nolan Principles"
    ],
    "pub_date": "2024-01-22T14:49:04+00:00",
    "content": [
        {
            "heading": 3,
            "text": "Bringing in a new IT system to modernise a seriously outdated system is never as straightforward as one hopes. But the catastrophic impact of the Horizon system at the Post Office and the subsequent handling of the problems asks major questions about the standards of public sector and corporate conduct."
        },
        {
            "text": "Horizon was a ‘black box’ system, developed by a global company, purchased by a statutory corporation, overseen by a board, accountable to a government department run by civil servants and led by Ministers, who are then accountable to Parliament.\n\nThese layers of responsibility and accountability are common in public life. Modern government in a globalised world is highly complex. Successive governments of different colours, the Post Office board, non-executives, company representatives, civil servants and others failed to respond to the growing wave of concerns raised by Sub Post Masters. In a world where data is king, it seems unfathomable that patterns of problems in the system were not surfaced or seen. Concerns were raised with MPs, with departments, with ministers and in the media. And more was known internally both at Fujitsu and the Post Office at the time.\n\nIn 2013, the government clarified that the Nolan Principles apply to all those who deliver services on behalf of the taxpayer. This means that anyone taking decisions or providing services using public funds must live up to them.  CSPL’s reports in 2014 and 2018 on ethical standards for providers of public services commented on the lack of consistent structures or arrangements in place to actively promote the right culture or behaviours.\n\nThe Post Office Horizon IT Inquiry got underway in 2020; this statutory public inquiry is left untangling the web of accountability that left Sub Post Masters with the blame at such terrible personal cost. This inquiry is one of 13 other statutory inquiries currently taking place across the UK. It is the Inquiry’s job to look at what happened and determine culpability.  But after what has been termed the greatest miscarriage of justice in British history, it has taken a high-profile drama to bring the political activity and action required.\n\nHow can we prevent this type of overall systems and standards failure happening again? And looking further ahead, how do we ensure the important Nolan principle of accountability is ‘built in’ to the opportunities and complexities that new technology like AI will bring?  A lot of the answers exist already, and they are not technical.\n\nThe Committee’s report Leading in Practice emphasised the importance of organisational culture including creating routes for people to speak up and safeguards for those who choose to raise concerns:\n\n“Organisational policies and schemes alone are not enough. Creating a ‘speak up’ culture requires leaders to listen with curiosity and appreciation, to take action where appropriate, and to provide feedback on the outcome. Leadership in this area requires a proactive approach, creating a range of informal and formal opportunities to listen to employees, and an ongoing commitment to building a culture where people are encouraged to speak up and are comfortable doing so.”\n\nThere is little point speaking up if those with the power to act fail to listen. What happened at the Post Office begs questions about the culture and relationships that stood in the way of these issues being brought forward and resolved before so many Sub Post Masters and their families suffered so much.\n\nThere is such a lot to learn from this terrible scandal. Not least that high standards require vigilance and leadership. They do not happen by accident."
        }
    ]
}