{
    "url": "https://gfie.blog.gov.uk/2024/01/22/realising-the-potential-of-military-spouses-and-partners-in-the-civil-service/",
    "title": "Realising the potential of Military Spouses and Partners in the Civil Service",
    "authors": [
        "karlharvey1"
    ],
    "categories": [
        "agreatplacetoworkforveterans",
        "Spouses & Partners",
        "Veterans"
    ],
    "pub_date": "2024-01-22T13:09:44+00:00",
    "content": [
        {
            "text": "Military spouses and partners can experience real impact on their lives and those of their families during or after military life. We want to make sure that being a military spouse or partner does not create a barrier to a fulfilling career in the Civil Service. "
        },
        {
            "text": "Going Forward into Employment extended our criteria to include Veterans and their spouses and partners. Since then, we’ve been busy engaging with organisations such as Forces Employment Charity to understand the specific challenges faced by spouses and partners, and how we might work together to best reach them with our employment opportunities. "
        },
        {
            "text": "We have heard how there can be a range of barriers to finding employment as a military spouse or partner, such as getting back into employment after time out and the associated lack of confidence that this can cause. Going through an application and recruitment process can be even more daunting if you are also coping with a return to a new location or routine after a posting or feeling self-doubt about your abilities. "
        },
        {
            "text": "We aim to counteract this by making our application process as straightforward as possible - to apply for any GFIE vacancy, all that’s needed is a short Expression of Interest form and a copy of your CV. Military spouses and partners should not be put off from applying if there are gaps in employment or what they perceive to be a lack of experiences or qualifications - the Departments we support are looking for skills and potential, not the finished article. "
        },
        {
            "text": "Not only do we want to make it straightforward for military spouses and partners to access opportunities in the Civil Service, we also want to make sure the support is there once their new employment has begun. Anyone taking up a GFIE vacancy will be offered the chance to be matched to a Buddy - another Civil Servant from a different Department who has volunteered to be an impartial ear and a place to go to with any worries or questions without judgement. "
        },
        {
            "text": "The support doesn’t stop there - as a both an employee and a military spouse/partner, we know the importance of networks in helping you to feel included:"
        },
        {
            "heading": 2,
            "text": "How do individuals apply for the scheme?"
        },
        {
            "text": "If you are reading this and meet the criteria of being the spouse or partner (your current partner must still be serving or must have been discharged within the last 12 months), there are different ways for you to access the vacancies that we have available."
        },
        {
            "text": "Vacancies are advertised on https://www.forcesfamiliesjobs.co.uk/. This is a site designed specifically for Military Spouses/Partners. Full job descriptions are added to the site and are often advertised on the website home page. We work closely with a few charities and organisations who provide support for Veterans and Military Spouses such as the Army Families Federation, who then share the vacancies out across their employer advisor network."
        },
        {
            "text": "Going Forward into Employment also holds a candidate bank, which means that you can express an interest in the scheme and Civil Service employment if there are no ‘live’ vacancies in a suitable location. If you are registered with our candidate bank, we will make direct contact with you when/if a vacancy arises in a suitable location. Applications for the candidate bank can also be made directly from the Forces Families Jobs website."
        },
        {
            "heading": 2,
            "text": "Going Forward into Employment (GFiE) Schemes"
        },
        {
            "text": "If you want to know more about any of our GFiE Life Chance Schemes, or are a Government department and would like to discuss providing life changing opportunities to individuals through use of the schemes for vacancies you have coming up, please get in contact with the GfiE Team at GFiE@cabinetoffice.gov.uk"
        }
    ]
}