{
    "url": "https://ruralpayments.blog.gov.uk/2024/01/22/rpa-podcast-episode-8-transcript-and-executive-summary/",
    "title": "RPA Podcast – Episode 8 – Transcript and Executive Summary",
    "authors": [
        "RPA Editor"
    ],
    "categories": [
        "Grants",
        "Mapping",
        "RPA podcast"
    ],
    "pub_date": "2024-01-22T15:16:34+00:00",
    "content": [
        {
            "text": "Executive Summary"
        },
        {
            "text": "Item 1:"
        },
        {
            "text": "Item 2: "
        },
        {
            "text": "Item 3:"
        },
        {
            "text": " Transcript"
        },
        {
            "text": "The RPA Podcast – Episode 8: Script (January 2023)"
        },
        {
            "text": "****Intro music to fade****"
        },
        {
            "text": "Beth: Hello and welcome to the eighth episode of The RPA Podcast. I’m Beth McAdam, and in today’s programme, we deep dive into the range of grant offers currently available to farmers, providing guidance on the application process, as well as key dates and criteria for applicants to be aware of. We also speak to Jim Bubb, a recent recipient of the Farming Transformation Fund, to find out how this grant has benefitted his business. And finally, we will discuss how the recently launched Rural Land Changes digital service could benefit your business."
        },
        {
            "text": "****Music – leading to next segment ****"
        },
        {
            "text": "Item 1: Grants Service Showcase overview  "
        },
        {
            "text": "Beth:  Here at RPA, there are a wide range of grants available to support farmers to develop their businesses, making sure that production can go ahead in the most efficient way and continue adapting for the future. Joining me today to give an overview of the range and type of grants available, is Danielle Bragg from the RPA Grants Service Team, who administer the available grants. Thank you for joining me, Danielle."
        },
        {
            "text": "Danielle: Thanks for having me, I’m looking forward to setting out the grants support on offer for farmers."
        },
        {
            "text": "Beth: So, I know all the different funding options can feel a bit complicated, can you start by telling me why we have grants alongside the other schemes RPA manages?"
        },
        {
            "text": "Danielle: Absolutely, so, grants exist to address specific one-off needs within the farm. The type of grants we offer, as part of the Farming Investment Fund, specifically focus on investments in equipment, technology, and infrastructure that improves farm productivity and benefits the environment."
        },
        {
            "text": "Beth: That makes sense, are you able to give a bit more detail on what grant a farmer can apply for under the Farming Investment Fund?"
        },
        {
            "text": "Danielle: Yes, of course, so initially the Farming Investment Fund is broken up into two parts. For smaller grants, there is the Farming Equipment and Technology Fund (FETF), that provides grants between £1,000 and £25,000, dedicated towards the cost of specific items of equipment and technology to improve productivity, the environment and animal health and welfare."
        },
        {
            "text": "Beth: And is the FETF currently taking applications?"
        },
        {
            "text": "Danielle: So, there have been two rounds of this scheme so far – Round 1 was for general items, while Round 2 was split into two application windows with items relating to Productivity and Slurry and items on Animal Health and Welfare. The FETF is currently closed for applications, but we expect there will be further opportunities launched this year – 2024 - including new items – so applicants should keep an eye out for those!"
        },
        {
            "text": "Beth: Oh great, looking forward to that then! And what about for the bigger grants?"
        },
        {
            "text": "Danielle: The bigger grants are covered by the Farming Transformation Fund. That provides grants from £25,000 all the way up to £500,000! This fund is dedicated towards large capital items to help businesses improve productivity, profitability, and environmental sustainability."
        },
        {
            "text": "Beth: and can you give an idea of what sort of things are available under the Farming Transformation Fund?"
        },
        {
            "text": "Danielle: There are currently five competitive grant schemes under the Farming Transformation Fund. These are slurry infrastructure; Adding Value; Water Management; Improving Farm Productivity and Calf Housing for Health and Welfare. These grants are all currently in different stages, some are in the online checker phase, taking on new potential applications which is stage 1 of the application process, while others are accepting full applications from those invited to apply, which is stage 2 of the application process.  And our Development Team are also looking at potential new grants and further rounds of existing grants."
        },
        {
            "text": "Beth: And what exactly is the online checker?"
        },
        {
            "text": "Danielle: This checker is new for Farming Investment Fund and has been created to streamline the application process and replace the paper applications we had previously. This is an online service that only takes a short time and asks for basic information such as type of business, how many hectares the farm is, details of the planned project and what sort of grant is being applied for. This service can then instantly tell a business owner if they are eligible to apply for a grant. And once the window for stage 1 applications closes it also enables the team to make quicker decisions on who to invite to submit a full application."
        },
        {
            "text": "Only projects that have submitted an online application through the online checker and have been given a reference number will be able to submit a full application; as this is a longer process that involves gaining quotes and planning permissions, so it is essential to receive an invite before proceeding with this."
        },
        {
            "text": "Beth: Could you go into a little more detail on grants that are currently available under the Farming Transformation Fund?"
        },
        {
            "text": "Danielle: Yes, absolutely, so these grants are all different sizes and are aimed at different kinds of businesses, so, I will take a minute here to set each of these out and make clear what is coming up for each."
        },
        {
            "text": "Beth: That would be great, thank you!"
        },
        {
            "text": "Danielle: So, the Surry Infrastructure grant offers funding between £25,000 and £250,000 to pig, beef, and dairy farmers to help replace, build new or expand existing slurry stores to provide six months’ storage. We are currently overseeing two rounds of this. Applicants who were invited to submit a full application for Round 1 have until 28 June 2024 to do this. We have also launched a second round of this grant and we will soon be inviting those who were successful at the online checker phase to submit full applications."
        },
        {
            "text": "Beth: That’s great, and what about Calf Housing and Welfare?"
        },
        {
            "text": "Danielle: For Calf Housing and Welfare, the window to use the online checker closed on 30 November last year – this grant has been made available for farmers in the beef and dairy sector, who can apply for grants between £15,000 and £500,000 to build new, or refurbish existing calf housing. This grant aims to improve the health and welfare of calves up to six months old.  We’re in the process of reviewing the online applications and people have been asked to submit Ambient Environment Assessments.  These need to be with us by 30th April and will then be able to invite successful applicants to full application stage."
        },
        {
            "text": "Beth: And what stage is the Adding Value grant currently at?"
        },
        {
            "text": "Danielle: This grant provides funding between £25,000 and £300,000 to growers or producers to add value to eligible agricultural products after they’ve been harvested or reared. The Adding Value grant is currently open to full applications for those who have been invited to submit an application, – these full applications will be accepted up until 31 January 2024, so we would encourage anyone still to submit this month to do so as soon as possible!"
        },
        {
            "text": "Beth: Brilliant, and what about the Water Management grant?"
        },
        {
            "text": "Danielle: This grant is designed for growers or producers to improve farm productivity through more efficient use of water for irrigation, and to secure water supplies for crop irrigation by the construction of on-farm reservoirs and the adoption of best practice irrigation application equipment. This scheme provides funding between £35,000 and £500,000. Round two of this grant is currently accepting full applications from those who have received an invitation to apply and correlating reference number and applicants will have until 31 October 2024 to submit this application."
        },
        {
            "text": "Beth: That’s great, and finally, Improving Farm Productivity?"
        },
        {
            "text": "Danielle: The Improving Farm Productivity grant is open to farmers and horticultural businesses - providing funding for items that improve farm productivity. We’ve recently launched another round of this grant and the online checker is expected to open later this month. This grant is split into two parts, both focused on improving productivity through either:"
        },
        {
            "text": "Beth: And I believe an entirely new grant, that is not part of the Farming Investment Fund, was launched in December, are you able to provide some more detail on this?"
        },
        {
            "text": "Danielle: Yes, that was the Small Abattoir Fund. This is a new £4million fund that is being made available to support smaller red meat and poultry abattoirs to enhance sustainability and efficiency, as well as encouraging innovation and improving animal welfare standards. This fund will provide grants between £2,000 and £60,000 and is now open to applications. The application window will remain open for nine months and abattoirs will be able to submit up to three applications up to the maximum funding level of £60,000. A diverse list of capital investments has been developed in close consultation with industry stakeholders and we have emailed all eligible smaller abattoirs directly outlining the application process."
        },
        {
            "text": "Beth: That’s brilliant, I really appreciate you setting those out Danielle! And finally, can a farmer apply for multiple grants at once?"
        },
        {
            "text": "Danielle: Yes, a farmer can be a recipient of a number of grants to cover all different elements of the farm so we would encourage everyone to take a look at what’s available when thinking about developing their business. Also, when we launch new schemes, we publish detailed guidance on who can apply and the minimum and maximum amount you can request so it's always a good idea to read the guidance fully before you start to make an application."
        },
        {
            "text": "Beth: That’s great Danielle. And where can people find more information on the grants that are available?"
        },
        {
            "text": "Danielle: More information can be found by visiting Gov.uk, and searching for ‘funding for famers’. If you visit www.gov.uk/guidance/funding-for-farmers, the guidance on funding for farmers page, it’s regularly updated and sets out every payment on offer, with links to learn more, including links to the Rural Payments blog and the Farming Blog."
        },
        {
            "text": "Beth: That’s really good to know. Thank you, Danielle and thank you again for your time today."
        },
        {
            "text": "Danielle: No worries at all, happy to help!"
        },
        {
            "text": "****Music – leading to next segment ****"
        },
        {
            "text": "Item 2: Jim Bubb grant interview "
        },
        {
            "text": "Beth: I’m joined today by Jim Bubb, owner of Shropshire Petals Farm in Newport, who has recently been a recipient of a Farming Transformation Fund grant, focused on improving productivity. Thanks for joining me, Jim."
        },
        {
            "text": "Jim: Good morning"
        },
        {
            "text": "Beth: So, to kick off, can you tell us about the grant you applied for and what you received?"
        },
        {
            "text": "Jim: So, we applied for the FTF grant, back in March 2022, and after passing the initial stages we were successful in our bid for the purchase of two farm droid robots. The grant process took a few months, and it wasn't until December 2022 when we were successful in our application. The droids were ordered straight away, and they were on the farm by March 2023, where this year they have just completed their first year, drilling and managing twenty hectares of flowers - where they have weeded and drilled the field completely using solar power."
        },
        {
            "text": "Can see that we could potentially have a swarm of robots in the years to come, I'm not quite sure how it will work, but we have to accept technology is here to stay and we have to embrace it and help evolve and make it useful for the future. So, at the end of the day, they work solely off solar power, they can run 24/7, they don’t need a break, their accuracy is ten times more than any tractor – so there's definitely a future in this sort of machinery."
        },
        {
            "text": "Beth: That’s brilliant! So, this machinery has changed the way you’re working quite a bit then?"
        },
        {
            "text": "Jim: It’s certainly made us look at it in a different light, definitely Beth. It’s in theory, very simple – it's a combination of three or four different bits of technology that have come together to automate a process in the field which is definitely saving us labour and increasing the quality of product that we are able to grow."
        },
        {
            "text": "Back in the end of 2021 and 2022, we were faced with the fact that there is a potential shortage of labour out there and hand weeding the crop, at that time, was quite a major role that we had to carry out and, with this risk of not having labour available to us, we had to look at different ways that we could try to automate and bring technology to the forefront. So, these two robots have the ability to drill the field and automatically weed the field itself, so it's taken our weeding bill from circa £20,000 plus down to nearly £5,000 in one year alone."
        },
        {
            "text": "Beth: Thats brilliant! And how else has this benefited your business?"
        },
        {
            "text": "Jim: Well, the machines have increased the accuracy and the quality of the flowers we’re growing, so we’ve seen some improvement in the yield and, with the increased accuracy of weeding, we’ve been able to reduce our use of herbicide that we apply to it, so we’re using less of that which is a good thing. And the robots run purely off solar power so, just form that point of view alone, the fact that we are using less fossil fuel is definitely advantageous to us."
        },
        {
            "text": "Beth: And do you intend to apply for any more grants?"
        },
        {
            "text": "Jim: So yeah, we’re currently looking at a farming transformation fund – the added value grant section. We’re looking at installing a new processing facility, here on the farm, that will help us push the business forwards, looking at new products that we can utilise our flower petals for and giving us a new area that we can more efficiently dispatch our products from, to ensure we can get the end product to the consumers at the best price possible."
        },
        {
            "text": "Beth: That’s brilliant, sounds really exciting! Thank you so much for your time today, Jim."
        },
        {
            "text": "Jim: Thats great, thanks very much Beth."
        },
        {
            "text": " ****Music – leading to next segment ****"
        },
        {
            "text": "Item 3: Rural Land Changes digital service "
        },
        {
            "text": "Beth:  In December 2023, the Rural Payments Agency launched a new digital service, that allows you to edit your mapping information online – here to talk about this new digital service, called Rural Land Changes, is Rachael Dale, from Geospatial Services here at RPA. Thanks for joining Rachael."
        },
        {
            "text": "Rachael: Thanks for having me, it’s good to be here."
        },
        {
            "text": "Beth: So, Rachael, can you tell us what is changing with the new rural land changes service?"
        },
        {
            "text": "Rachael: Yeah, so the RPA has launched a new service, called Rural Land Changes, and this is for customers to notify us of mapping changes. This is an online method, which will replace the RLE1 form and it will reduce the length of time it takes us to action submissions from customers."
        },
        {
            "text": "So, this means you can now request all changes to your digital maps online, using the Rural Payments service and Rural Land Changes can be used to request all the changes to your maps that you currently do with an RLE1 form, but using Rural Land Changes is more convenient, faster, and easier."
        },
        {
            "text": "Beth: And why are these changes being made now?"
        },
        {
            "text": "Rachael: This is the first in a series of changes that will digitally transform our mapping and land processes. We are always looking for ways to improve processes for farmers – this new online service means mapping requests can be actioned faster than before."
        },
        {
            "text": "Beth: And why are these changes important for farmers looking to apply to schemes?"
        },
        {
            "text": "Rachael: These changes are important because, as a farmer, keeping your digital maps up to date is a key aspect of how you apply for schemes. It will enable farmers to quickly inform us of mapping changes ahead of any application they may wish to make, for example Sustainable Farming Incentive or Countryside Stewardship, which require mapping to be correct before you can apply. These changes will allow farmers to begin their applications sooner."
        },
        {
            "text": "Beth: That’s brilliant – and what sort of changes can be made using Rural Land Changes?"
        },
        {
            "text": "Rachael: The Rural Land Changes service can be used to add new land, merge parcels, alter land cover and more. It also makes it possible to view a history of mapping change requests that have been made using the online service. This tool will handle it all, delivering mapping change requests within a fraction of the time it currently takes."
        },
        {
            "text": "Beth: So, what’s happening to the current RLE1 form?"
        },
        {
            "text": "Rachael: We’ll continue to accept paper RLE1 forms for those people who need to use them, but we’ll also be encouraging customers to make use of the online service. We’ll also look to make changes to the paper RLE1 form at the beginning of this year, making it easier for you to complete. We’ll also remove the option to email RLE1s to us as the online service replaces this function, but we will provide further information on this soon."
        },
        {
            "text": "Beth: And finally, what do you recommend farmers to do now?"
        },
        {
            "text": "Rachael: Well, farmers need to make sure everyone connected to their business has the right permissions in the Rural Payments service. For this, and for everything else I’ve covered, there’s more information to be found on the RPA blog, and also on GOV.UK, including links to helpful videos."
        },
        {
            "text": "Beth: That’s brilliant, thanks for your time today, Rachael."
        },
        {
            "text": "Rachael: Thank you."
        },
        {
            "text": "****Music – leading to next segment ****"
        },
        {
            "text": "Beth: So, that’s all we’ve got time for today. Thank you to Danielle, Rachael and Jim for taking the time to answer these questions - and thank you, once again, for listening. We’ve covered a range of topics again today, but we’re always happy to receive your questions and suggestions. So, if you’d like us to cover a particular topic or issue with our subject experts, please get in touch. You can e-mail us at External.Affairs@rpa.gov.uk, or you can follow us on X (formerly Twitter) - @Ruralpay - or follow the Rural Payments Agency on Facebook. We’ll be back soon with the ninth episode of the RPA podcast, as we keep you updated on developments at RPA and support you through the agricultural transition process. Goodbye."
        },
        {
            "text": "****Close music to fade****"
        },
        {
            "text": " "
        }
    ]
}