{
    "url": "https://ruralpayments.blog.gov.uk/2024/01/22/the-rural-payments-agency-podcast-episode-8/",
    "title": "The Rural Payments Agency Podcast: Episode 8",
    "authors": [
        "RPA Editor"
    ],
    "categories": [
        "Grants",
        "Mapping",
        "RPA podcast"
    ],
    "pub_date": "2024-01-22T15:18:33+00:00",
    "content": [
        {
            "text": "Welcome to the eighth episode of The RPA Podcast."
        },
        {
            "text": "In our latest episode, Danielle Bragg from the RPA Grants Service Team discusses the range of grants currently available to farmers, as well as some new opportunities on the horizon. We also discuss each of the specific grants in detail and provide helpful information on the application process."
        },
        {
            "text": "Later in the episode, we hear from Jim Bubb, from Shropshire Petals Farm in Newport, about his successful application to the Farming Transformation Fund and the ways in which this has benefitted his business and transformed the ways of working of his business."
        },
        {
            "text": "Finally, Rachael Dale from Geospatial Services at RPA, talks us through the new online Rural Land Changes service that streamlines scheme applications by accelerating mapping updates. We also discuss plans for the old RLE1 form and any actions farmers need to take to prepare for this change."
        },
        {
            "text": "You can also read the transcript for this episode here."
        },
        {
            "text": "The RPA Podcast is an opportunity to engage with farmers and land managers in a new way, and we encourage you to reach out to us with suggestions of particular topics that you’d like us to cover with our subject experts. You can e-mail us at External.Affairs@rpa.gov.uk."
        },
        {
            "text": "You can listen to episode 8 of The RPA Podcast on Apple and Spotify, or through Buzzsprout."
        },
        {
            "text": "You can also listen to earlier episodes of The RPA Podcast on Apple and Spotify, or through Buzzsprout."
        },
        {
            "text": "Follow us on social media for the latest updates and information on the following accounts."
        },
        {
            "text": "By following and subscribing to our social channels and blog, you’ll be able to see the latest updates about important information"
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        }
    ]
}