{
    "url": "https://naturalengland.blog.gov.uk/2024/01/22/time-to-press-the-accelerator-on-the-road-to-nature-recovery/",
    "title": "Time to press the accelerator on the road to Nature recovery",
    "authors": [
        "Tony Juniper"
    ],
    "categories": [
        "Biodiversity",
        "Climate change",
        "Landscapes",
        "Natural England",
        "Nature Recovery Network",
        "Wildlife"
    ],
    "pub_date": "2024-01-22T10:30:51+00:00",
    "content": [
        {
            "text": "Tony Juniper CBE"
        },
        {
            "text": "As we take stock of the year just passed and look ahead to the challenges facing us in 2024, we can pause briefly to celebrate gains recently made toward securing Nature’s recovery."
        },
        {
            "text": "From a Natural England perspective, this includes over the last 12 months the work that we and our many dedicated partners have begun to set in train in establishing the King’s Series of National Nature Reserves, beginning with the Lincolnshire Coronation Coast NNR. We were also very proud to put into play six major new Nature Recovery Projects which will between them provide 176,000 hectares – at a landscape scale - to support the growing Nature Recovery Network (NRN)."
        },
        {
            "text": "Farmers and land managers of all kinds continue to play a key role in restoring Nature, for example demonstrated by 34 further projects awarded funding through the second round of the Landscape Recovery scheme. More sites are also now protected for Nature on land and sea – at Penwith in Cornwall and three highly protected marine areas around our coast among those now afforded greater legal protection in recognition of their nationally important wildlife and natural features. Funding is flowing into species recovery, supporting 150 vulnerable plants and animals, peatland restoration and climate change mitigation, while local authorities and developers have Natural England’s Green Infrastructure Framework to help them bring Nature to the heart of communities and new developments. The new spatial planning process of Local Nature Recovery Strategies offers exciting promise for the future."
        },
        {
            "text": "All of that and more more leaves me feeling that we are turning the corner from the essential task of conservation and onto the road toward Nature recovery. Whether the work underway will take us to our intended destination in time is, however, another matter. We are now a year on from the publication of the Government’s Environmental Improvement Plan and, significant though the achievements in 2023 have been, we all have to ask ourselves whether the current rate of progress will enable us to hit the plan’s targets – not least the apex goal of halting species decline by 2030. The view of the Office for Environmental Protection in this regard is very clear and sobering."
        },
        {
            "text": "We are now just six years away from that deadline – which is no time at all when it comes to Nature’s timetable and is why I hope that this year will see a speeding up of efforts for Nature recovery. Pace is vital and the next three years will be critical because if we aren’t on course by then to hit 2030 targets it will likely be too late to catch up in time."
        },
        {
            "text": "The tools to help us are largely now in place thanks to the legislative advances of recent years and the growing clarity in relation to financial support for sustainable farming. The public will is there too, as we see from the way that local people and organisations are driving new Nature Recovery Projects and the new series of National Nature Reserves that we have in the pipeline."
        },
        {
            "text": "What we need now is an even more energetic focus on delivery, building stronger partnerships to link up all sections of society: government, agencies, charities, businesses and academia among the entities that must combine to increase positive impact. Working in isolation won’t give us the critical mass we need to restore Nature at scale and pace, but working collaboratively certainly could do."
        },
        {
            "text": "Perhaps we can all take some inspiration from the 75th anniversary this year of the 1949 National Parks and Access to the Countryside Act, which enshrined in law so many of the protections and public assets that have allowed us to conserve so much of what might otherwise have been lost, among them National Nature Reserves, Sites of Special Scientific Interest, National Trails, Areas of Outstanding Natural Beauty (now National Landscapes) and National Parks."
        },
        {
            "text": "These places remain as relevant now as they were all those decades ago, providing so many ways in which people can enjoy wildlife and beauty, not to mention the health and wellbeing that goes with it. In 2024 we look forward to adding further to this treasure trove, keeping up with our pledge to designate 5 NNRs a year over a 5-year period, as well as extending protection to our finest sites for wildlife, habitat and geology through thousands of hectares of new SSSIs."
        },
        {
            "text": "Such steps are vital if we are to maintain and indeed ramp up progress towards the government commitment – shared of course by many nations around the world - to protect 30 per cent of our land and seas by 2030. With only 8 per cent of England currently protected for Nature (and much of that not yet realising its potential) there is considerable work for us all to do over the next 6 years. Protected landscapes have a big role to play in moving us towards this target and we look forward to continuing to work with them this year in helping Nature to become an even larger part of their appeal. This applies not only to existing ones but to those areas seeking to join the family, and we are excited to be able to carry out important preparatory work this year to scope out a new National Park as announced recently by Government."
        },
        {
            "text": "Establishing a thriving Nature Recovery Network will remain a central goal for Natural England in 2024 and that work will be bolstered by new policies coming into play, including mandatory Biodiversity Net Gain. This will become law in the next few weeks, enabling developers onshore and offshore to build the new homes and infrastructure the country needs in a way that results in an overall increase in Nature of at least 10 percent, benefiting not just wildlife but the people who live and work nearby. The Nutrient Mitigation Scheme will also support new development, ensuring it can take place without adding pollution to our most important and fragile rivers and wetlands."
        },
        {
            "text": "Local Nature Recovery Strategies too will have a big role to play this year. Now that the 48 responsible authorities are in place their strategies will be the instrument that will identify and shape the Nature recovery best suited to each area of the country, including creating new habitats such as wetlands and scrub and better managing existing woods and grassland. This plays a huge part in planning the growth of the NRN and Natural England will be at the heart of these conversations with communities and land managers, providing support and advice to help Nature flourish in these places."
        },
        {
            "text": "Hard evidence and experience show us how vital Nature is to our health and wellbeing, and yet how limited the access to it can be for so many people. As well as the Green Infrastructure Framework – a major part of our drive to ensure everybody lives within 15 minutes’ reach of greenspace - I’m delighted that we are working towards having at least 95% of the 2,700-mile King Charles III England Coast Path walkable by the end of the year."
        },
        {
            "text": "The opportunities ahead of us this year are enormous and Natural England will be updating our existing Action Plan to ensure that, together with our partners, we can make the most of them. We are very much committed to continuing to build new partnerships and getting the most out of existing ones so that we are all pushing forward on Nature recovery as fast and as far as possible in 2024."
        },
        {
            "text": "I’d like to round off this blog with a very personal highlight from last summer in which I travelled into the field in the South of England with the Roy Dennis Foundation to witness something that earlier in my career I would have seen as a rather distant dream. In a quiet wood overlooking a wetland, I was shown a nest with a large White-tailed Eagle chick. It was the first to be hatched in England in 240 years. Soon after my visit that young eagle left the nest and is now living in the wild. One day, in a few year’s time I hope to hear that it is attending a nest of its own. That one bird summed up for me the progress that is being made: practical, real, inspiring, and achieved via partnership working among committed and effective people. I hope there will be many more moments like this in 2024 and the years to come."
        }
    ]
}