{
    "url": "https://educationhub.blog.gov.uk/2024/01/22/what-to-do-if-you-think-your-child-has-measles-and-when-to-keep-them-off-school/",
    "title": "What to do if you think your child has measles and when to keep them off school",
    "authors": [
        "mediaofficer"
    ],
    "categories": [
        "Further education",
        "Higher Education",
        "Schools",
        "Universities"
    ],
    "pub_date": "2024-01-22T14:46:14+00:00",
    "content": [
        {
            "text": "Cases of measles are rising across England, including among children. It’s an infection that spreads very easily and for some people can cause serious problems."
        },
        {
            "text": "There’s no specific medical treatment for measles, so it’s important to get vaccinated as it’s the best protection against becoming seriously unwell."
        },
        {
            "text": "The measles, mumps and rubella (MMR) vaccine is one of the routine childhood vaccinations, so most children are already vaccinated against measles. If your child has received both doses of the vaccine, they are unlikely to have the virus."
        },
        {
            "text": "Here, we explain everything you need to know about the rise in measles cases, from getting your child vaccinated to when to keep them off school."
        },
        {
            "heading": 3,
            "text": "What are the symptoms of measles?"
        },
        {
            "text": "Measles usually starts with cold-like symptoms, followed by a rash a few days later."
        },
        {
            "text": "Some people may also get small spots in their mouth. Find out more on the NHS website."
        },
        {
            "heading": 3,
            "text": "What should you do if you think your child has measles? "
        },
        {
            "text": "You should ask for an urgent GP appointment or get help from NHS 111 if you think you or your child may have measles."
        },
        {
            "text": "Don’t go to the GP or any other healthcare setting without calling ahead first."
        },
        {
            "text": "If your child has been diagnosed with measles by a doctor, they should stay off nursery or school for at least 4 days from when the rash first appears."
        },
        {
            "text": "They should also avoid close contact with babies and anyone who is pregnant or has a weakened immune system."
        },
        {
            "heading": 3,
            "text": "What is the best way to protect against measles?"
        },
        {
            "text": "The best protection against measles for children and adults is to get both doses of the MMR vaccine."
        },
        {
            "text": "Children are offered a vaccine free on the NHS at 12-months-old and then a second dose when they turn 3-years-and-4-months-old."
        },
        {
            "text": "But you can catch up at any age – if you or your child haven’t yet been vaccinated, you should contact your GP practice to book a free appointment."
        },
        {
            "text": "You can request a version of the MMR vaccine that does not contain pork products from your GP, making it suitable for all faiths. Please note that the practice may need to order this product in specially, so it will be helpful to tell them your views before the appointment."
        },
        {
            "heading": 3,
            "text": "Cold-like symptoms can be an early sign of measles. Should you still send your child to school? "
        },
        {
            "text": "If your child has been vaccinated, it’s very unlikely that they have measles."
        },
        {
            "text": "School attendance is vitally important to your child’s learning and health."
        },
        {
            "text": "According to the NHS, it’s fine to send your child to school with a minor cough or common cold, provided they don’t have a temperature."
        },
        {
            "heading": 3,
            "text": "When should you keep your child off school or nursery and how long for?"
        },
        {
            "text": "If your child has measles, they should stay off nursery or school for at least 4 days from when the rash first appears, and avoid close contact with babies and anyone who is pregnant or has a weakened immune system."
        },
        {
            "text": "The school or local Health Protection Team will let you know if your child has been in contact with someone who has measles, and tell you what you need to do."
        },
        {
            "text": "The Health Protection Team may advise people who are more susceptible to contracting the virus, such as unvaccinated siblings to stay away for the incubation period."
        },
        {
            "text": "The incubation period is the length of time it can take to develop the illness after being in contact with someone with measles. For measles, the incubation period can be up to 21 days."
        },
        {
            "text": "Anyone who has been vaccinated is unlikely to be considered susceptible."
        },
        {
            "text": "If you’re not sure whether your child is due a vaccination or has missed a vaccination, you can check your Red Book or contact your GP practice."
        },
        {
            "text": "If your child has missed their first or second dose of MMR vaccine, you should contact your GP practice to book an appointment."
        },
        {
            "heading": 3,
            "text": "Should you keep your child off school if another pupil has been diagnosed with measles?"
        },
        {
            "text": "Most children will be protected against measles and there is no need to keep your child off school if they have had both their MMR vaccinations."
        },
        {
            "text": "Your local Health Protection Team will tell you if your child has been in contact with someone with measles and will let you know what the next steps are."
        },
        {
            "heading": 3,
            "text": "Can I still get my child vaccinated even if they’re older? "
        },
        {
            "text": "Yes. Anyone who has not had 2 doses of the MMR vaccine should ask their GP surgery for a vaccination appointment."
        },
        {
            "text": "It’s best to have vaccines on time, but you can still catch up on most vaccines if you miss them. Two doses of the vaccine are needed to ensure full protection."
        },
        {
            "heading": 3,
            "text": "For schools, nurseries and other education settings"
        },
        {
            "heading": 3,
            "text": "What should education settings do if they have a suspected or confirmed measles case?"
        },
        {
            "text": "Education settings should follow the UKHSA guidance on managing measles. This advises them to:"
        },
        {
            "heading": 3,
            "text": "How should schools code measles absences?"
        },
        {
            "text": "For confirmed cases, schools should continue to use usual register codes for absence due to illness."
        },
        {
            "text": "If a child needs to isolate following public health advice, the most appropriate code is likely to be an absence authorised by the school (code C)."
        },
        {
            "text": "As part of its planned changes to the attendance system, the Government is establishing a new register code to cover absences due to public health guidance."
        },
        {
            "text": "The new code is planned to take effect from September 2024."
        },
        {
            "heading": 3,
            "text": "Will the Department for Education and Ofsted take measles absences into account when reviewing the attendance statistics for schools?"
        },
        {
            "text": "Schools play a vital role in improving attendance, but not all factors influencing attendance are in their control."
        },
        {
            "text": "Ofsted will take these factors into account. Schools should demonstrate that they’re doing all they can to achieve the highest possible attendance, even if its attendance numbers are lower than previously."
        },
        {
            "heading": 3,
            "text": "What advice should special schools follow? Is there any additional advice for pupils who may be more vulnerable to exposure to measles?"
        },
        {
            "text": "Special schools and settings should also follow the UKHSA guidance."
        },
        {
            "text": "The Health Protection Team will carry out a risk assessment of the situation based on the information provided, and the type of infection."
        },
        {
            "text": "They will ask the education setting to share information to help them understand the size and nature of the outbreak, and advise on any recommended actions."
        },
        {
            "heading": 3,
            "text": "What advice is there for staff who might be more vulnerable, for example if they’re pregnant or unvaccinated?"
        },
        {
            "text": "Measles is a viral infection that spreads very easily and can cause severe illness, especially in certain groups including babies, small children, pregnant women, and people with weak immunity."
        },
        {
            "text": "The best protection against measles for children and adults is to get both doses of the MMR vaccine."
        },
        {
            "text": "For adults, it is never too late to catch up on any missed MMR vaccinations. People should contact their GP practice to book an appointment."
        },
        {
            "text": "If you’re pregnant and you have been in close contact with someone who has measles, you should ask for an urgent GP appointment or get help from NHS 111."
        },
        {
            "text": "As a precaution, the MMR vaccine is not recommended for pregnant women."
        }
    ]
}