{
    "url": "https://naturalengland.blog.gov.uk/2025/06/16/protected-site-strategies-problems-shared/",
    "title": "Protected Site Strategies – Problems Shared",
    "authors": [
        "David Burton"
    ],
    "categories": [
        "Biodiversity",
        "Landscape",
        "Natural England",
        "Nature",
        "Nature Recovery",
        "Protected sites and species",
        "Site of Special Scientific Interest",
        "Species recovery",
        "Wildlife"
    ],
    "pub_date": "2025-06-16T10:15:55+01:00",
    "content": [
        {
            "text": "By David Burton, Principal Officer, Protected Site Strategies"
        },
        {
            "text": "“Whatever lies on the horizon, these reserves might just offer a simple vision of how good things could be.”"
        },
        {
            "text": "Professor John Wedgwood Clarke, Wild Westcountry Odyssey 2025"
        },
        {
            "text": "So reflected academic and poet Professor Clarke on completing uplifting adventures across some of the Protected Sites of South-West England. The West Country Odyssey is part of work commissioned through the Protected Site Strategies research programme with the RENEW programme led by University of Exeter and the National Trust. The purpose, to showcase nature and the importance of nature recovery alongside partnership working and the power of film in communicating and engaging when working collaboratively."
        },
        {
            "text": " "
        },
        {
            "text": "Over the last three years, since we announced we were Springing Into Action to develop our approach to Protected Site Strategies, we have been joined by many fellow partners. The main purpose and rationale for Protected Site Strategies (PSS) (enshrined in the Environment Act legislation that provides us with new power to work collaboratively) is to find solutions to environmental issues that cannot be resolved well at the site level. Often, their root causes are part of a wider malaise, whether it be from diffuse pollution of air or water, overgrazing from overpopulations of herbivores, or a result of disconnection of people from the many benefits nature brings."
        },
        {
            "text": "From farmers struggling with the vagaries of climate change and the need to produce food profitably, to local planners seeking to implement the design of new nature-friendly residential areas and built infrastructure, the PSS development programme is drawing together a growing band of acolytes.  It might seem at times like we are pursuing over-optimistic quests; to tackle systematically the root causes of nutrient and air pollution, to create recreational opportunities that bring more people in contact with nature, and more thriving nature free from disturbance and harm."
        },
        {
            "text": "All this alongside helping to build food systems that help re-vitalise the fortunes of our very best biodiversity and geodiversity. But, by joining with a diversity of partners to resolve these conundrums, we have begun to demonstrate the full potential of PSS to tackle a variety of environmental ills in different contexts. What we have learned is core to our Strategy Direction ambitions, both ways of working and our priorities, and will be central to the delivery of our future Strategy outcomes. Details are provided in the sections of our first version of Protected Site Strategies Advisory Guidance. "
        },
        {
            "text": "Our current PSS partners are spreading the word through this first version of Advisory Guidance, uploading it to their own websites and social media channels. Please feel free to request access to do the same. We will continue to evaluate and further develop the Advisory Guidance sections based on learnings from the first fully fledged PSS. "
        },
        {
            "text": "Our Area Teams have helped select the first few places to trial PSS this year based on their potential for innovation, and nature recovery that brings wealth, health and security for all. These will be designed and delivered through collective effort in ways that bring prosperity to both nature and local economies. We are also starting to attract additional investments through Protected Site Strategies from both public and private investors, and we plan to accelerate roll out of in subsequent years."
        },
        {
            "text": "To set the scene we are pleased to share the first short film of Professor Clarke on his own personal Wild Westcountry Odyssey which explores the Protected Site on Kynance, the Lizard Peninsula, Cornwall:"
        },
        {
            "text": "For further information or to gain access to the Protected Site Strategies Advisory Guidance drop us a line at  -  ActPSSenquiries@naturalengland.org.uk"
        }
    ]
}