{
    "url": "https://defrafarming.blog.gov.uk/2025/06/16/spending-review-2025-a-commitment-to-farming/",
    "title": "Spending Review 2025: a commitment to farming ",
    "authors": [
        "The Team"
    ],
    "categories": [
        "Farming across the UK"
    ],
    "pub_date": "2025-06-16T11:15:20+01:00",
    "content": [
        {
            "text": "Following the Spending Review, Defra has secured a multi-year funding commitment from HM Treasury. "
        },
        {
            "text": "More than £2.7 billion will be invested in sustainable farming and nature recovery a year from 2026/27 to 2028/29. "
        },
        {
            "text": "Funding paid to farmers under the Environmental Land Management Schemes will increase by 150% from £800m in 2023/24 to £2 billion by 2028/29.  "
        },
        {
            "text": "Overall, farmers and land managers will benefit from an average of £2.3bn a year through the Farming and Countryside Programme, and up to £400 million from additional nature schemes, including those for tree planting and our peatlands."
        },
        {
            "text": "This funding will be directed to support farm profitability, nature recovery and food production. It represents the most nature-friendly settlement in history. We believe the careful stewardship of this money can make it go further to attain our goals for farmers and government. "
        },
        {
            "text": "In this post, we’ll give an overview.  "
        },
        {
            "heading": 2,
            "text": "Overview "
        },
        {
            "text": "Please note: final allocations will be agreed through business planning."
        },
        {
            "heading": 2,
            "text": "Farming schemes"
        },
        {
            "text": "A record 50,000 farm businesses are now taking part in environmental land management schemes. Around half of all farmed land in England is now managed under these schemes.  "
        },
        {
            "text": "The settlement means we will continue to invest in sustainable food production through: "
        },
        {
            "text": "These schemes pay farmers for practical actions that support food production, improve the environment and build business resilience. They also help protect the long-term health of soils, water and wildlife, which are essential for sustainable food production and a healthy environment. "
        },
        {
            "text": "Together, this represents the largest financial investment into nature-friendly farming ever and a significant increase of 150% in current spending from £800 million in 2023/24 up to £2 billion by 2028/29.  "
        },
        {
            "text": "As we have said, we will honour all existing SFI, Countryside Stewardship and Higher Level Stewardship agreements. We’ll also continue payments under previous agri-environment schemes until those agreements end.  "
        },
        {
            "text": "As ministers have said before, the reformed scheme will be more targeted to better meet priorities on food, farming and nature. More details will be published later this summer, but we know that for too long ELM schemes have been far too complicated, which is a problem that is compounded by the massive workloads that farmers across the country undertake. "
        },
        {
            "text": "One of our key objectives is to ensure that the user experience of the schemes is prioritised, so that bureaucracy does not become a barrier between the schemes and these busy farmers."
        },
        {
            "text": "Through the Nature for Climate Fund and Biodiversity Targets Programme, worth up to £400 million a year, farmers and land managers will also be able to access funding for tree planting and our peatlands.  "
        },
        {
            "text": "Developer contributions to the Nature Restoration Fund will also pay to protect and enhance important wildlife and habitats. This could create opportunities for farmers and land managers to earn extra income by supporting these efforts, such as through the sale of nutrient credits. "
        },
        {
            "heading": 2,
            "text": "Productivity, innovation and transition support "
        },
        {
            "text": "We’re continuing to invest in support that helps farmers improve profitability, productivity and strengthen their businesses, both now and for the future. This includes: "
        },
        {
            "text": "Delinked payments "
        },
        {
            "text": "To maintain the overall farming budget and to increase investment in environmental land management, we plan to phase-out delinked payments.  "
        },
        {
            "text": "In line with our pledge to ensure that every penny of public money is spent as wisely as possible, the Government is ending the era of payouts to large and wealthy landowners for simply owning land. "
        },
        {
            "text": "These payments are based on past subsidies and do not provide value for money or support the environment.  "
        },
        {
            "text": "This will enable us to invest more in environmental schemes that will make a significant contribution to our Environment Act targets and will ensure that funding is targeted where it can have the greatest impact.   "
        },
        {
            "text": "By investing in nature, we help secure the foundations of long-term food security – including healthy soils, clean water and thriving ecosystems."
        },
        {
            "text": "As we continue to phase out Direct Payments, those who previously received the largest amounts have seen the biggest overall reductions since the start of the transition away from the EU system. For delinked payments in 2026 and 2027:"
        },
        {
            "text": "As we did last year, we will calculate the reductions using the farmer’s reference amount (not the value of their 2025 payment)."
        },
        {
            "text": "The Rural Payments Agency (RPA) will write to delinked payment recipients with information about these changes in due course."
        },
        {
            "heading": 2,
            "text": "Looking ahead "
        },
        {
            "text": "We know change takes time and certainty matters. This Spending Review settlement gives us the resources to keep working alongside farmers, so together we can build a more productive, resilient, and sustainable future for farming in England. "
        },
        {
            "text": "We know how much funding we have from now until early 2029 and we will continue to share updates along the way. "
        },
        {
            "text": "To that end, the government’s New Deal for Farmers is designed to support growth and return farm businesses to profitability. It has already: "
        },
        {
            "text": "Subscribe to the Farming blog for the latest updates and look out for the Farming System Roadmap coming later this year. "
        }
    ]
}