{
    "url": "https://food.blog.gov.uk/2025/06/16/stakeholder-update-june-2025s-fsa-board-meeting/",
    "title": "Stakeholder update: June 2025's FSA Board Meeting",
    "authors": [
        "Katie Pettifer, Chief Executive"
    ],
    "categories": [
        "Our mission"
    ],
    "pub_date": "2025-06-16T10:30:09+01:00",
    "content": [
        {
            "text": "Cymraeg"
        },
        {
            "text": "The next FSA Board meeting is being held in Birmingham on 18 June 2025 and it’s another busy agenda with lots to discuss."
        },
        {
            "text": "We have an update on the review of the discount we currently offer to meat plants for the costs of delivering inspections. Following an extensive engagement process, we're proposing the FSA Board recommend to Ministers that there’s continued support for some parts of the abattoir sector - specifically to small abattoirs and to some medium-sized ones, to ensure diversity of farming and consumer choice."
        },
        {
            "text": "We’ll be revisiting a subject that generated a huge amount of discussion in the regulatory community when we covered it in December, and this is our trial of National Level Regulation (NLR). We are asking the Board to endorse the proposed next steps that we’ve developed with stakeholders. We want to continue to harness business-level data held by retailers and use this to provide insight to inform the current regulatory system. The Board will also hear about our engagement with stakeholders on wider ideas for regulatory reform."
        },
        {
            "text": "We’ll be seeking the Board’s views as we consider changes to our advice on the consumption of slushie-style drinks containing glycerol. This follows reported cases of glycerol intoxication in children where voluntary labelling, containing current FSA advice, was not displayed or not followed. Our revised advice is based on findings from a new rapid risk assessment."
        },
        {
            "text": "We’re also going to be discussing the next steps for reforming the system we use to authorise new food and feed products coming on to the market. We want the approval process to be as straightforward as possible for food businesses to navigate, so we can continue to support innovation in the food sector."
        },
        {
            "text": "If you want to read the full agenda and more details about what will be discussed on these and the other topics, we have published the Board papers for the meeting. You can also register to watch the meeting."
        },
        {
            "heading": 1,
            "text": "Cyfarfod Bwrdd yr ASB - Mehefin"
        },
        {
            "text": "Cynhelir cyfarfod nesaf Bwrdd yr Asiantaeth Safonau Bwyd (ASB) yn Birmingham ar 18 Mehefin. Mae’r agenda i’w gweld yn brysur unwaith eto, gyda llawer i’w drafod."
        },
        {
            "text": "Byddwn ni’n cael diweddariad ar yr adolygiad o’r gostyngiad rydym yn ei gynnig ar hyn o bryd i ffatrïoedd cig ar gyfer y gost o gynnal arolygiadau. Yn dilyn proses ymgysylltu helaeth, rydym yn cynnig y dylai Bwrdd yr ASB gymeradwyo bod gweinidogion yn sicrhau bod cefnogaeth barhaus ar gael i rai rhannau o’r sector lladd-dai – yn benodol i ladd-dai bach ac i rai lladd-dai canolig eu maint, a hynny er mwyn sicrhau amrywiaeth o ran ffermio a dewis i ddefnyddwyr."
        },
        {
            "text": "Byddwn yn ailystyried pwnc a ysgogodd lawer iawn o drafodaeth ymhlith y gymuned reoleiddio pan wnaethom ei drafod ym mis Rhagfyr, sef ein treial o Reoleiddio ar Lefel Genedlaethol (NLR). Rydym yn gofyn i’r Bwrdd gymeradwyo’r camau nesaf arfaethedig yr ydym wedi’u datblygu ar y cyd â rhanddeiliaid. Rydym am barhau i fanteisio ar y data lefel busnes sydd gan fanwerthwyr, a defnyddio hyn i gael dealltwriaeth er mwyn llywio’r system reoleiddio bresennol. Bydd y Bwrdd hefyd yn clywed am ein gwaith ymgysylltu â rhanddeiliaid ar syniadau ehangach ar gyfer diwygiadau rheoleiddiol."
        },
        {
            "text": "Byddwn yn ceisio barn y Bwrdd wrth i ni ystyried newidiadau i’n cyngor ar yfed diodydd iâ slwsh sy’n cynnwys glyserol. Mae hyn yn dilyn achosion a adroddwyd o feddwdod glyserol mewn plant lle na chafodd labeli gwirfoddol, â chyngor cyfredol yr ASB, eu harddangos neu eu dilyn. Mae ein cyngor diwygiedig yn seiliedig ar ganfyddiadau yn sgil asesiad risg cyflym newydd."
        },
        {
            "text": "Byddwn hefyd yn trafod y camau nesaf ar gyfer diwygio’r system a ddefnyddiwn i awdurdodi cynhyrchion bwyd a bwyd anifeiliaid newydd sy’n dod ar y farchnad. Rydym am i’r broses gymeradwyo fod mor syml â phosib i fusnesau bwyd ei dilyn, fel y gallwn barhau i gefnogi arloesedd yn y sector bwyd."
        },
        {
            "text": "Os hoffech chi ddarllen yr agenda lawn a chael mwy o fanylion am yr hyn a fydd yn cael ei drafod ar y pynciau hyn a phynciau eraill, rydym wedi cyhoeddi papurau’r Bwrdd ar gyfer y cyfarfod yma. Gallwch hefyd gofrestru i wylio’r cyfarfod yn fyw ar-lein."
        }
    ]
}