{
    "url": "https://traderemedies.blog.gov.uk/2024/08/02/a-first-step-towards-evaluating-the-impacts-of-the-uks-trade-remedies/",
    "title": "A first step towards evaluating the impacts of the UK’s trade remedies",
    "authors": [
        "Ilona Serwicka, Head of Evaluation and Research"
    ],
    "categories": [
        "Analysis"
    ],
    "pub_date": "2024-08-02T10:12:42+01:00",
    "content": [
        {
            "heading": 3,
            "text": "Today we have published a research report prepared by Grant Thornton UK LLP (Grant Thornton) for the Trade Remedies Authority (TRA). This report explores the toolkit of methodology options that we could use in our evaluation to measure the impacts of the UK’s trade remedies. "
        },
        {
            "heading": 4,
            "text": "Why do we want to evaluate the impacts of trade remedies? "
        },
        {
            "text": "At the TRA we investigate and recommend whether trade remedies are needed to prevent injury to UK industry caused by unfair trading practices or unforeseen surges in imports.  "
        },
        {
            "text": "Trade remedies could lead to changes in prices and quantities that shape consumer and business decisions. For example, a UK trade remedy measure on red roses imported from Roseland (which become relatively more expensive) could lead to consumers and retailers buying more red roses from the UK (which become relatively less expensive). This measure could also lead to consumers and retailers buying more white roses from the UK or white roses imported from Roseland (because white roses are now a relatively less expensive substitute for red roses). These changes in decisions of consumers and decisions of firms are likely to have economic and social impacts. Policy makers should, as a matter of good practice, try to learn early on about the impact that their interventions have on the population. "
        },
        {
            "text": "Figure 1: The possible impacts of a UK trade remedy measure on red roses from Roseland. "
        },
        {
            "text": "The TRA is committed to evaluating the UK’s trade remedy measures to determine what impact they have, and if they are effective and efficient. In our evaluation, we will be following the principles set out in the Green Book (which contains guidance on how to appraise and evaluate policies, projects and programmes) and in the Magenta Book (which contains guidance on what to consider when designing an evaluation).  "
        },
        {
            "heading": 4,
            "text": "What are the key conclusions of the research? "
        },
        {
            "text": "The aim of the research by Grant Thornton was to identify which methodologies are suitable and could be used by the TRA to evaluate the causal impact that the UK’s trade remedy measures have on trade and performance of the UK producers of the goods covered by these measures and others affected industries involved in the supply chain. "
        },
        {
            "text": "The report features four illustrative case studies whose aim is to test the suitability and the feasibility of different methodologies that we could use in our future evaluation. The report considers the key econometric methodologies, which are often used in causal impact analysis: gravity models, difference-in-difference (diff-in-diff), synthetic control method (SCM), Bayesian methods (BCI), and event studies. The report also considers simple analytical methods (which could be used when data is not readily available, or when time and/or resources are limited) such as before-during-after analysis (where variables of interest are compared before and after the imposition of a trade remedy), or trend analysis (which investigates changes in variables over time and examines changes in trajectories and fluctuations). The report also shows how economic theory and economic models could be used in evaluation. "
        },
        {
            "text": "The guiding framework for methodology selection (which in the report is presented in tabular format and decision tree format) that weighs the strengths and weaknesses of various methodologies is the key research output. This guiding framework will help us choose the most suitable methodology which given the contexts and the constraints, will help us deliver evaluation that produces reliable, and robust results. The guiding framework is not intended to be read as ‘prescriptive’ and ‘must-follow’ but instead it gives an indication of what are the most suitable methodological tools to use in our evaluation when certain conditions are and/or are not met. "
        },
        {
            "text": "Figure 2: The guiding framework for methodology selection. "
        },
        {
            "text": "The report makes it clear that together with a good methodology toolkit, good data is an integral part of the success of our future evaluation work. With no or limited data we would be unable to deliver robust causal impact analysis that shows the true impact that the UK’s trade remedy measures have on trade and the UK economy, including performance of different affected industries."
        },
        {
            "text": "We do not want to pretend that evaluation does not come without challenges. A good methodology toolkit and good data are both instrumental to delivering a high-quality evaluation, where the analysis and the final conclusions are robust, well-balanced, and made from varied evidence and perspectives. Given the constantly changing economic landscape, including economic shocks, this adds complexity to our task of evaluation of the true causal impact of trade remedy measures."
        },
        {
            "heading": 4,
            "text": "Get involved: call for expert input"
        },
        {
            "text": "We would like to take this opportunity to encourage experts and specialists interested in our evaluation work to engage with us. In an environment where participation in trade remedy investigations is voluntary, we would be pleased if you could make us aware of data and evidence that you think could assist us in our aim of delivering a high-quality evaluation."
        },
        {
            "text": "Contact us: contact@traderemedies.gov.uk"
        }
    ]
}