{
    "url": "https://icsdigital.blog.gov.uk/2024/08/02/life-as-a-new-user-researcher/",
    "title": "Life as a new user researcher",
    "authors": [
        "Joe Parsons-Munn - User Researcher"
    ],
    "categories": [
        "How we work",
        "User-centred design"
    ],
    "pub_date": "2024-08-02T16:27:39+01:00",
    "content": [
        {
            "heading": 2,
            "text": "How did I become interested in a career in user research?"
        },
        {
            "text": "If you’d asked me at the beginning of last year what user research was, I probably could not have told you. I had conducted original research for my Masters degree and I knew a career in research was something that I wanted to pursue, but user research was not on my radar."
        },
        {
            "text": "Coming across user research happened completely by chance. I stumbled across a YouTube video of someone presenting their portfolio. I was immediately hooked and the concept really appealed to me."
        },
        {
            "text": "The idea of speaking to people to understand their experiences and difficulties when using a product or service was a refreshing change from other styles of research."
        },
        {
            "text": "So I signed up to all the newsletters and blogs I could find and tried to learn as much as I could about the field. Eventually, I saw the user research role at ICS Digital come up on Civil Service Jobs and jumped at the chance to apply."
        },
        {
            "heading": 2,
            "text": "Figure out what excites you about user research"
        },
        {
            "text": "Once you’re in, you really do learn by doing. Starting my first project felt quite daunting but I have never learnt as much as I did during those first few weeks. Everyone has their niche and something that they really enjoy doing while researching. To my surprise, shortly after starting my first project, I discovered I really enjoy interviewing."
        },
        {
            "text": "Live problem solving and having those ‘aha!’ moments when something finally clicks after a participant explains it to you are what makes the job so rewarding."
        },
        {
            "text": "Once the research is under way you’ll find yourself becoming a bit of an expert, quite often in fields you never thought you would be! Since joining the ICS user research team, I have gathered knowledge on heat networks, energy efficiency funding schemes and much more!"
        },
        {
            "text": "At the end of interviewing, we analyse all notes and pull out all the common themes and pain points.  This helps others in the UCD team adapt what they’re doing so that they can make improvements or change direction if something really doesn’t work."
        },
        {
            "text": "That is the beauty of user research: you can gain a real depth of understanding from talking to people that you would never have come into contact with in other jobs."
        },
        {
            "heading": 2,
            "text": "Unexpected findings"
        },
        {
            "text": "Learn to enjoy awkward silences during your research. There will be plenty of them, but they’re a good thing! Allowing your participant the space to think and articulate their experiences without you interrupting is one of the first lessons I learnt."
        },
        {
            "text": "When I joined the user research team in ICS Digital, I knew that I would encounter challenges on projects: how would we overcome design challenges? How would we make a service that was inclusive for everyone?"
        },
        {
            "text": "However, I did not expect one of the most difficult parts of the process  to be finding people to speak with in the first place!"
        },
        {
            "text": "Sending out hundreds of invites to research sessions to have only a handful of people reply can be tough, but when you get the sessions booked in or you are presenting back your findings, the needy emails you sent out suddenly seem worth it."
        },
        {
            "heading": 2,
            "text": "Quality over quantity"
        },
        {
            "text": "Luckily, user research is all about the quality and richness of your data rather than the amount of it."
        },
        {
            "text": "It’s not just about getting through the discussion guide and asking questions and then charting answers on a table or diagram. It’s about really digging down into the participant’s experience and building empathy with them."
        },
        {
            "text": "This means that, even if only a few participants do reply to your invites, you shouldn’t let that detract from the insights you can gather from these sessions. A handful of really rich interviews can be all you need to develop a good grasp of the problem and understand what people need from your service."
        },
        {
            "text": "So if you’re ever invited to take part in user research and you can spare the time, your opinions really can make all the difference. "
        }
    ]
}