{
    "url": "https://moderncivilservice.blog.gov.uk/2024/08/02/meet-the-modern-civil-service-alexandra-whiteley-head-of-events/",
    "title": "Meet the Modern Civil Service: Alexandra Whiteley, Head of Events",
    "authors": [
        "Government Reform"
    ],
    "categories": [
        "A Modern Civil Service",
        "Innovation",
        "Interview",
        "Modernisation and Reform",
        "Proud Civil Servant",
        "Skilled"
    ],
    "pub_date": "2024-08-02T14:43:59+01:00",
    "content": [
        {
            "text": "Alexandra Whiteley, Head of Events, Cabinet Office, spoke with Deepa Thomas-Sutcliffe from the Civil Service Strategy Unit, about what A Modern Civil Service means to her, as well as how large-scale events like Civil Service Live benefit the Civil Service."
        },
        {
            "text": "What does A Modern Civil Service mean to you?"
        },
        {
            "text": "I think I align with the three pillars of Skilled, Innovative and Ambitious most. It’s about making sure our civil servants have the skills, training and development they need to be able to deliver world class public services, and that we are supporting them to try new approaches and have the space to grasp the opportunities that new technologies offer us. Civil servants are constantly striving to continually improve on our delivery - trying new things, sharing what works and best practices, and collaborating. It’s about making the most of the incredible breadth of knowledge and skills we have access to as within the organisation. I think it’s also about learning from the likes of other governments, or public service providers — both internationally and within the UK — but really importantly, through our partnerships with the private sector. "
        },
        {
            "text": "Tell us a little bit about your career journey in the Civil Service. What advice or inspiration from your early career has really stuck with you?"
        },
        {
            "text": "I’ve been in the Civil Service since leaving university. I worked in Welsh Government and Estyn, the education and training inspectorate for Wales in broader comms roles before focusing in on events. I’ve worked as Head of Events in HMRC, supporting their leadership events and offering a consultation service to wider business units on how to deliver events, before moving to Cabinet Office in 2016 to start heading up Civil Service Live. A couple of  years ago, I started working on Cabinet Office events too."
        },
        {
            "text": "I really enjoyed doing broad comms roles early on in my career to get a good feel for what interested me and what I excelled at, so I’d encourage people to try a number of roles before specialising in a certain area. Whilst I didn’t take that route — I think the Fast Stream is an incredible way to do that — I’d encourage existing civil servants to apply for a place if possible. You get such a breadth of understanding and lots of tailored learning and advice to support your development. That would be my advice to new civil servants: move around and get a feel for what you like."
        },
        {
            "text": "How did you get into events management? What is the most exciting part of your job as Head of Events?"
        },
        {
            "text": "I completed a journalism degree at Cardiff University and then worked in the Welsh Government to focus on comms, before realising I really enjoyed the events delivery aspect of my role! I like the fact you have a really tangible end product for all of the hard work you’ve put into planning and organising an event. In terms of what I think is exciting - the event days themselves are always high stress and high energy. You need to have a lot of trust in different groups of people to deliver — from the speakers to the volunteers, to the audio/ visual team to the exhibition build partner, to the venue staff and security. I really enjoy troubleshooting issues on the day and quickly finding solutions to ensure that from the delegates’ perspective it’s a smooth and seamless operation. "
        },
        {
            "text": "What advice would you give to teams who are thinking of running an event, hosting a session or setting up a great marketstall at events like CS Live? "
        },
        {
            "text": "Before you get started, you need to think about what behaviour change you are trying to achieve by communicating your content via an event. I spend a lot of time asking people to think about ‘what will the delegate do differently as a result of the information you are sharing?’ because you need a clear objective and result.  "
        },
        {
            "text": "You need to think about how to make the content engaging, empowering and educational: are you sharing information and new ideas that change thinking and allow them to learn new skills and innovate? Are you allowing them time to discuss this with other members of the audience? And are you setting up an opportunity for two way dialogue between your speaker and your audience member so it’s a chance to share information on a two way exchange and not just a broadcast approach. The Government Communication Service OASIS comms model is a great way to identify how to plan your event and really neatly guides you through the objectives, and Audience, Strategy, Insight and Scoring approach. "
        },
        {
            "text": "What are the biggest challenges you face planning and organising an event on CS Live scale? How do you stay motivated? "
        },
        {
            "text": "This year, the biggest challenge was the announcement of the general election and the impact the pre-election period had on our plans. A few years ago, Covid also meant we had to pivot from a face-to-face event to deliver a fully online event in a matter of days. There are always going to be obstacles to overcome and you need to have really strong plans in place to manage as many of the aspects as you can. It helped to set up a really robust risk register to set out your approach and mitigations to the issues that might come up, but ultimately, it’s the team around me that are the crucial factor in this. "
        },
        {
            "text": "Our Theme leads and session leads are all doing this as a corporate contribution, on top of their day jobs. Having some incredibly committed and passionate people working with me means that when issues come up, they are really quick to come up with solutions and work together to make sure we can deliver the events. "
        },
        {
            "text": "In terms of motivation — this team dynamic reality helps keep me motivated — as well as  hearing the lovely feedback from delegates telling us that the events have made a real difference to their career. It’s really motivating to receive feedback from delegates who now perhaps understand more about how their role fits into the wider Civil Service, to learn they built connections across the Civil Service, or that they had a career conversation at one of our spot mentoring sessions which led to them exploring  new career path or having the renewed confidence to apply for promotion. "
        },
        {
            "text": "What difference does CS Live make to the Civil Service and the people who work in it? What outcomes are we achieving through it and how do these help us be more skilled, innovative and ambitious? "
        },
        {
            "text": "We try to make sure we finish each session with a short summary of the three top things we want people to take away from the session, followed by a clear call to action that they can do when they are back at their desks. Each of those small changes can have a huge impact on public services when you think over 20,000 staff came along to this year’s events. Whether it’s making people better at making an impact with their writing, understanding the skills they need to embrace AI, drafting effective strategies, or being more effective leaders, there are a huge range of skills, knowledge and approaches that the Civil Service excels at. "
        },
        {
            "text": "At CS Live 2024, 20,037 delegates attended 685 sessions with 788 speakers from the Civil Service and private sector, including 40 Permanent Secretaries and heads of profession. Staff also visited 258 exhibition stands and undertook 1,027 mentoring sessions at the events."
        },
        {
            "text": "I hope the sessions also help people to feel proud about the work they do. We really try to celebrate and share the best practice that’s going on across the Civil Service — highlighting the approaches people have used that have been successful, and sharing when things haven’t worked as well so people don’t make the same mistakes. "
        },
        {
            "text": "We also aim to empower staff to try something new — giving them a new approach or insight into a piece of work to think about how they could improve on their own processes. The work of the innovative Civil Service theme this year really aligns with the One Big Thing campaign that’s launching this year, where the Cabinet Secretary is encouraging people to embrace innovation, and I hope that Civil Service Live does that. "
        },
        {
            "text": "If you could change anything about CS Live what would it be? "
        },
        {
            "text": "I’d like us to secure more sponsorship so we could do more events across the UK to make it even easier for civil servants to attend an event near them. "
        },
        {
            "text": "Secondly, I’d really like to tackle the dropout rate. Given the important and dynamic nature of civil service working, often not everyone has the time to attend these events, even if they really would like to or have indicated that they intend to. That's why I'm really keen to help boost numbers and widen accessibility next year."
        },
        {
            "text": "We’ll increase in-person numbers again, and we’re also going to try and look at some behavioural insights approaches to encourage people to attend, and get the most out of the excellent content that our subject matter experts have created for them. "
        }
    ]
}