{
    "url": "https://forestrycommission.blog.gov.uk/2024/08/02/selling-woodland-or-peatland-carbon-could-it-be-right-for-you/",
    "title": "Selling woodland or peatland carbon: could it be right for you?",
    "authors": [
        "Emma Stewart"
    ],
    "categories": [
        "Climate change and resilience",
        "Tree planting",
        "Woodland creation"
    ],
    "pub_date": "2024-08-02T08:40:25+01:00",
    "content": [
        {
            "text": "Did you know that if you plant a new woodland or restore peatland, you could sell the carbon benefits? When it comes to carbon, UK buyers are leading the way – so the time to get involved is now."
        },
        {
            "text": "The Science-Based Targets Initiative reported that, from 2022 – 2023, the UK saw a 113% increase in the number of companies with a validated science-based carbon emissions target in place. The report also shows that globally only Japan has a higher number of companies with such a target, at 768 at the end of 2023 compared to the UK’s 693."
        },
        {
            "text": "To reach net-zero, after first reducing its emissions as far as possible, a company will need to then address its residual emissions by compensating for them in the future. To do this, they can buy credits from Woodland Carbon Code or Peatland Code projects, with one credit from either Code equivalent to one tonne of carbon. But how much does a tonne of carbon cost? £5 per tonne? £25? £100?  And how do you know if that’s a fair price?"
        },
        {
            "heading": 3,
            "text": "De-mystifying Carbon Pricing"
        },
        {
            "text": "Most sales of carbon units in the UK are ‘over the counter’, where the price is agreed through private negotiations between buyers and sellers, protecting commercial sensitivity, but perhaps making the carbon market appear a little mysterious to newcomers. With no set price, it’s difficult to know where to go to find more information and, until last year, no UK pricing data was officially collected and reported on."
        },
        {
            "text": "In 2023, the Nature Returns Programme funded a study by Ecosystem Marketplace to collect pricing data from actual trades for Woodland Carbon Code and Peatland Code units, making concrete pricing data available for the first time since the Woodland Carbon Code launched in 2011. The results show that the average price of carbon from Woodland Carbon Code projects has been rising in recent years, averaging around £25 per tonne in 2023. This is significantly higher than the global average, at around USD 7 per tonne in 2023."
        },
        {
            "heading": 3,
            "text": "What’s the significance of this work?"
        },
        {
            "text": "This research is hugely important for the UK market and supports anecdotal evidence of prices for UK woodland and peatland carbon credits. It demonstrates how buyers in the UK value the high integrity of the Woodland Carbon Code and Peatland Code, and that they feel confident that these credits deliver a genuinely permanent removal of carbon from the atmosphere."
        },
        {
            "text": "What’s interesting is that the results show there is a huge range of prices that buyers are paying – a difference of £37 between the highest and lowest prices for the Woodland Carbon Code. Why might one tonne of carbon fetch a price so much higher than another?"
        },
        {
            "text": "Different buyers value different things. To some buyers, location of a woodland creation or peatland restoration project could be important and valuable, choosing to buy from projects close to their business operations to demonstrate their commitment to sustainability. When planning to offset future emissions, buyers have to consider the credit’s vintage – the date when a Pending Issuance Unit is expected to be converted into a Woodland Carbon Unit or Peatland Carbon Unit, indicating when the offset claim can be made. Delivering well on additional benefits such as biodiversity or water quality may also help sellers to market their units more effectively to buyers who value these things. Understanding the many factors that affect carbon pricing could help landowners place themselves more effectively in the market."
        },
        {
            "text": "This work may encourage landowners to plant new woodlands or restore degraded peatlands and enter these into the carbon market, armed with a better idea on their likely revenue through the sales of carbon credits. Buyers too can benefit from this evidence that can be factored into decision-making and support business planning. It may also support the development of carbon codes for other natural habitats that sequester carbon, giving both landowners and buyers more choice about the kinds of nature-based solutions that they want to support."
        },
        {
            "heading": 3,
            "text": "What’s next?"
        },
        {
            "text": "We expect a further update UK carbon prices later in 2024, adding to the evidence base. Those who disclosed pricing data previously are encouraged to continue. Anyone who does will be rewarded with access to Ecosystem Marketplace’s global voluntary carbon markets insights."
        },
        {
            "heading": 3,
            "text": "How can you help with our research?"
        },
        {
            "text": "If you have traded credits from the Woodland Carbon Code or Peatland Code and are willing to disclose pricing data, please visit Ecosystem Marketplace’s hub. You will be helping to support the UK carbon market and add to the evidence base for developing nature-based solutions to tackle climate change."
        },
        {
            "heading": 3,
            "text": "Want to know more?"
        },
        {
            "text": "Visit: UK carbon prices - UK Woodland Carbon Code "
        },
        {
            "text": "Email: info@woodlandcarboncode.org.uk"
        },
        {
            "text": "Voluntary Carbon Markets Integrity Initiative: VCMI - Delivering high-integrity carbon markets (vcmintegrity.org)"
        }
    ]
}