{
    "url": "https://naturalengland.blog.gov.uk/2024/08/02/the-chief-scientist-report-2023/",
    "title": "The Chief Scientist Report: 2023",
    "authors": [
        "Natural England"
    ],
    "categories": [
        "Biodiversity",
        "Monitoring",
        "Natural England",
        "Science and evidence"
    ],
    "pub_date": "2024-08-02T11:28:50+01:00",
    "content": [
        {
            "text": "Professor Sallie Bailey, Chief Scientist at Natural England, tells us about the publication of Natural England’s sixth Chief Scientist Report"
        },
        {
            "text": " "
        },
        {
            "text": "This Report, the sixth in the series, focusses on the impact our work has and – crucially - how we determine what that impact is.  In doing so, the report highlights a variety of important and interesting topics including making nature more accessible for people with visual impairments."
        },
        {
            "text": "The report also highlights the positive impacts our work has on habitats across England, for instance how our evidence-led approach resulted in woodlands being established to help nature recovery. We also highlight the role of the Habitat Network Mapping (HNM) Tool, which identifies and maps zones with opportunities to enhance, expand and join up existing habitats.  The HNM tool has been an important part of many Local Nature Recovery Strategy pilots and Nature Recovery Plans, including Plans in Cumbria, Buckinghamshire and the river catchments of Coquet, Pont and Blyth, and Wansbeck in Northumberland."
        },
        {
            "text": "Living England is one of the key outputs of the Natural Capital and Ecosystem Assessment (NCEA) Programme.  Based on a satellite-derived national habitat map, it has been used to support multiple projects and provide a core dataset to help build baseline maps of environmental assets to drive spatial targeting and Land Use Modelling. This supports the development of the Land Use Framework, ensuring an open and adaptable product aligned with emerging policy areas across Defra is delivered."
        },
        {
            "text": "Our soils are one of our most precious and often overlooked resources. not just the interface between the abiotic rock and our terrestrial flora and fauna, they are vital for our food security, mitigation of climate change and underpin adaptation and nature-based solutions. Our work in leading the delivery of soil health research across the country has demonstrated Natural England as key leaders in the development and delivery of soil health research within England [and is described in this report], I very much enjoyed hearing about latest developments and collaborations at our recent soil health conference."
        },
        {
            "text": "The final feature relates the history of marine conservation in England’s waters – and it bears repeating that our seas are nearly twice the size of our land. Natural England’s remit in the marine environment is now as broad as it is on land. The statutory advice we provide covers a broad spectrum of areas from marine developments, aquaculture, and fisheries management to protected sites and species, to the historic environment, to recreation and access. We are working proactively with Defra and other partners to create and present evidence to support marine nature recovery in new ways."
        },
        {
            "text": "Spotlights on some of the staff in the Chief Scientist Directorate provide a fascinating insight into the work they do and its impacts – including the critical roles of staff who work ‘behind the scenes.’"
        },
        {
            "text": "I sincerely hope you enjoy the report, which is available on our Access to Evidence Portal at NE809 Chief Scientist Report 2023 - NE809 (naturalengland.org.uk), and all the demonstrable impacts of science and evidence work that are crucial to delivering our objectives."
        },
        {
            "text": " "
        }
    ]
}