{
    "url": "https://ukhsa.blog.gov.uk/2024/08/02/whos-eligible-for-the-2024-covid-19-vaccine-or-autumn-booster/",
    "title": "Who’s eligible for the 2024 COVID-19 vaccine, or ‘Autumn Booster’?",
    "authors": [
        "Blog Editor"
    ],
    "categories": [
        "Coronavirus (COVID-19)",
        "Immunisation and vaccination"
    ],
    "pub_date": "2024-08-02T10:29:01+01:00",
    "content": [
        {
            "text": "As we move into autumn, protection from any earlier COVID-19 vaccination you may have had will be starting to wane. For those who are more likely to become seriously ill from COVID-19, the NHS offers a free vaccine in the autumn, previously known as the ‘Autumn Booster’."
        },
        {
            "text": "Current vaccines provide good protection against severe disease and hospitalisation. UKHSA surveillance data relating to last autumn’s programme shows that those who received a vaccine were around 45% less likely to be admitted to hospital with COVID-19 from 2 weeks following vaccination, compared to those who remained unvaccinated. Protection lasts for around 4 months."
        },
        {
            "text": "Vaccination continues to help protect against severe illness, hospitalisations and deaths arising from COVID-19. Between November, December and January over 38,000 people were admitted to hospital with the virus."
        },
        {
            "heading": 2,
            "text": "Eligible groups this autumn"
        },
        {
            "text": "The eligibility is the same across the 4 nations of the UK (England, Scotland, Wales and Northern Ireland)."
        },
        {
            "text": "The vaccine should usually be offered no earlier than around 6 months after the last vaccine dose. If you are eligible, you can get protection from an autumn COVID-19 vaccination even if you have not taken up a COVID-19 vaccine offer in the past."
        },
        {
            "heading": 2,
            "text": "Eligibility for the immunosuppressed"
        },
        {
            "text": "We understand that having a weakened immune system (immunosuppression) is a lot less straight forward than the other criteria. Looking online can cause even more confusion, as people might see themselves (and be considered by others) as immunosuppressed but might not fit the immunosuppression criteria for vaccination."
        },
        {
            "text": "So, what are the immunosuppression criteria? Eligibility is outlined in Chapter 14a of the Green Book, a document published by UKHSA specifically for public health professionals. It can be a complicated document for non-experts, so we've listed some of the groups here:"
        },
        {
            "text": "While this list summarises some major groups, it does not cover everything. Please check online at nhs.uk/get-vaccine to see if you are eligible."
        },
        {
            "heading": 2,
            "text": "How to access the COVID-19 autumn vaccination"
        },
        {
            "text": "NHS England will confirm details on how and when eligible people can access the autumn vaccine in due course."
        },
        {
            "text": "COVID-19 spreads more easily in winter because we spend more time indoors with others."
        },
        {
            "text": "Having your COVID-19 vaccination this autumn will give you protection from serious COVID illness over winter."
        }
    ]
}