{
    "url": "https://deframedia.blog.gov.uk/2021/09/13/24-million-for-fisheries-science-projects/",
    "title": "£24 million for fisheries science projects",
    "authors": [
        "Defra Press Office"
    ],
    "categories": [
        "Weekly stories"
    ],
    "pub_date": "2021-09-13T15:06:29+01:00",
    "content": [
        {
            "text": "There has been positive media coverage in the Financial Times, Press and Journal, Scottish Herald and Fisker Forum about the Science and Innovation pillar of the UK Seafood Pillar, which has been launched this week."
        },
        {
            "text": "The announcement was also covered by Farming Today who interviewed Michel Kaiser, professor of Fisheries Conservation at Heriot-Watt University, about his project being supported by the fund. The Herald, also carried an op-ed from Scotland Office Minister David Duguid."
        },
        {
            "text": "The £24 million of funding released by the Government to support better science and innovation projects is the first part of £100 million UK Seafood Fund designed to level up coastal communities across the UK."
        },
        {
            "text": "The Science and Innovation pillar, will see the fishing and seafood industry supported to work jointly with scientists to research new types of more productive and sustainable fishing gear, gather new data to more sustainably manage the UK’s fish stocks, and trial projects such as new biodegradable packaging for chilled fish and seafood to reduce single-use plastics. These advancements in science and research will boost efficiency and help to ensure the long term sustainability of the industry."
        },
        {
            "text": "We have launched for initial engagement a Fisheries Industry Science Partnerships scheme. The scheme will fund the gathering of new data to sustainably manage the UK’s fish stocks, research new types of fishing gear to boost sustainable fishing, increase confidence in fisheries science, and increase knowledge of the benefits and impacts of fish farming."
        },
        {
            "text": "The Science and Innovation pillar is one of three pillars of the UK Seafood Fund. The Infrastructure pillar, will be announced later in the Autumn, and will invest in projects to strengthen the supply chain in the UK."
        },
        {
            "text": "A further Skills and Training pillar will support career opportunities and upskilling in the sector to ensure the industry has the right skills, capacity, and expertise."
        },
        {
            "text": "Environment Secretary, George Eustice, said:"
        },
        {
            "text": "Further details on how to apply are available on the Fisheries Industry Science Partnerships scheme GOV.UK page."
        },
        {
            "text": "Follow Defra on Twitter, and sign up for email alerts here."
        }
    ]
}