{
    "url": "https://actuaries.blog.gov.uk/2021/09/13/biodiversity-and-the-role-of-actuaries/",
    "title": "Biodiversity and the role of actuaries",
    "authors": [
        "Georgina Bedenham - Actuary"
    ],
    "categories": [
        "Actuary",
        "Climate change"
    ],
    "pub_date": "2021-09-13T13:12:23+01:00",
    "content": [
        {
            "text": "We’ve probably all heard someone say in recent years that there aren’t as many insects flying around as there used to be. It’s something that I have been increasingly worried about as I’m very passionate about conservation of natural habitats and animal welfare."
        },
        {
            "text": "Once you do a bit of research, it’s clear that the world is going through a period of mass extinction. Global wildlife populations that we depend on to survive, have declined by 60% in the last 50 years."
        },
        {
            "text": "Recently I’d been wondering what can I do about this and is there a way that I can use my skills and role as an actuary to help? And then I came across an advert for actuaries to join the  Biodiversity Working Party run by the Institute and Faculty of Actuaries."
        },
        {
            "heading": 2,
            "text": "Discussion and debate"
        },
        {
            "text": "Biodiversity loss is ranked as one of the top 5 global risks in terms of likelihood and impact. The Biodiversity Working Party aims to develop educational resources, produce think pieces, and prompt discussion and debate within the actuarial community on this topic."
        },
        {
            "text": "Already the group has been very busy, developing an initial position paper, blog and podcast setting out the key issues surrounding biodiversity loss. We have also published 4 research papers:"
        },
        {
            "heading": 2,
            "text": "A timely subject"
        },
        {
            "text": "I was part of the subgroup that looked at the link between zoonotic diseases and biodiversity loss – a timely subject given the huge impact of COVID-19."
        },
        {
            "text": "Zoonotic diseases are diseases that have been transmitted from an animal source to a human. An animal can carry an infectious pathogen that is passed on to a human, through close contact, and then, in some cases, once the species barrier is crossed, the disease can develop and spread among humans."
        },
        {
            "text": "These diseases have been around for a long time, with notable examples including HIV, Influenza and Ebola - however instances of zoonotic diseases in humans are increasing."
        },
        {
            "text": "Once a new zoonotic disease emerges, the impact can be devastating – as we have seen with COVID-19. There can be increased mortality, but there are also wider effects on society, including disruption to the economy and health services."
        },
        {
            "text": "Our paper discusses how the key causes of zoonotic diseases and biodiversity loss, namely climate change and habitat loss, are inextricably linked. With human activity emerging as a key underlying driver."
        },
        {
            "text": "Indeed, almost half of the zoonotic diseases that have emerged since 1940 have resulted from changes in land use, farming and food production practices, and wildlife hunting."
        },
        {
            "text": "In theory, a greater amount of biodiversity could potentially reduce the transmission of zoonotic diseases as there would be several species the disease has to pass through to reach humans. This highlights the delicate balance of the natural world and the huge impact human activity is having."
        },
        {
            "text": "The Actuary magazine’s recent article on our paper summarises the key points."
        },
        {
            "heading": 2,
            "text": "How can actuaries help?"
        },
        {
            "text": "While it might not be immediately obvious how actuaries can help in this area, I think there are a wealth of opportunities for actuaries to add value on this subject."
        },
        {
            "text": "We are well placed to understand and communicate the uncertainties and risks associated with biodiversity loss, so building an understanding of these issues and their impacts is important. The management and measurement of these risks is an area where actuaries could really contribute, particularly given their long-term and intangible nature."
        },
        {
            "text": "Actuaries can also inform and influence debate on this subject. This can include, for example, considering fairness between different groups of stakeholders and assessing the concept of natural capital."
        },
        {
            "heading": 2,
            "text": "What next?"
        },
        {
            "text": "Traditional areas of actuarial work are also likely to be affected by this issue over the longer-term. This could be for example, through mortality impacts of a constrained food supply, insurance losses due to supply chain disruption from crop failures. Or it could be through investment risks from reduced asset values due to a transition to a more environmentally conscious financial market."
        },
        {
            "text": "And outside of the profession we can all individually make a difference. Whether we recycle plastic waste, use environmentally friendly products, or encourage plants in our gardens that attract a greater number of insects – it all adds up!"
        },
        {
            "text": "Disclaimer"
        },
        {
            "text": "The opinions in this blog post are not intended to provide specific advice. For our full disclaimer, please see the About this blog page."
        }
    ]
}