{
    "url": "https://insidehmcts.blog.gov.uk/2021/09/13/how-tech-solutions-helped-hear-a-complex-murder-trial/",
    "title": "How tech solutions helped hear a complex murder trial",
    "authors": [
        "Laura Connor"
    ],
    "categories": [
        "Court and tribunal reform",
        "Crime",
        "Digital services"
    ],
    "pub_date": "2021-09-13T10:00:45+01:00",
    "content": [
        {
            "text": "Fitting together all the pieces when hearing a murder trial can be challenging for the Crown Court. Add in multiple defendants and impacts of the pandemic, and that challenge becomes even more complicated."
        },
        {
            "text": "COVID-19 meant that our operational staff across sites in England and Wales had to adapt to find creative and innovative ways to list cases with multiple defendants. Alongside HM Prisons & Probation Service (HMPPS), HMCTS has developed and implemented new technology to make it possible to hear more cases through audio or video links. All these factors came together recently, when my team worked with others across the criminal justice system to successfully run a murder trial involving multiple defendants (often known as ‘multi-handers’) at Preston Crown Court. But it was far from straight-forward."
        },
        {
            "text": "A complex picture"
        },
        {
            "text": "The trial was large, high-profile, and complex."
        },
        {
            "text": "The case itself focused on the death of a teenage student, mistakenly killed in a drive-by shooting in Blackburn last spring. It involved 8 defendants – 7 male and 1 female – with 4 of the males being held at a maximum security (Category A) prison."
        },
        {
            "text": "Category A prisoners can only be supervised by a specialised group of HMPPS staff. For the 4 Category A prisoners to attend the trial in person, we would have needed 12 prison staff to attend court for as long as it lasted."
        },
        {
            "text": "The court also needed to plan for the needs of witnesses, families, other members of the public, barristers, solicitors, other court users and the media. The judge, Mr Justice Turner, described the situation:"
        },
        {
            "text": "“There were fears among some that if the court even attempted to host an 8-handed trial over 10 weeks, then, as a result of COVID restrictions, no other courtrooms would be able to sit in the building over the whole of that period.”"
        },
        {
            "text": "Remote solutions"
        },
        {
            "text": "Scheduled to span 10 weeks (and eventually running for 12), the trial’s implications on capacity at the court could have been disruptive and long-lasting. But since COVID-19 has accelerated digital reform at HMCTS and HMPPS, audio and video are more accessible, reliable and effective. Our staff have become more familiar with these systems, with the skills and confidence to use them as solutions to operational challenges."
        },
        {
            "text": "Last year, our cross-HMCTS working group developed solutions for hearing more high-profile multi-handed cases within social distancing restrictions. We identified use of video as one of the most effective ways to get around the issue of space availability. We consolidated these findings into a multi-hander ‘toolkit’. Using this toolkit, the Preston team – led by delivery manager Julie Hitchen – set about exploring the video solutions that were available, achievable, appropriate and legal. We then began an intensive planning period during the run up to the trial date itself."
        },
        {
            "text": "Working together to execute the plan"
        },
        {
            "text": "During weeks of collaboration, the team took on views from HMPPS, the Category A specialists at Manchester prison, legal representatives, media, families, the Crown Prosecution Service (CPS), Prisoner Escort Custody Services (PECS), police, and others. They listened to their concerns, and developed a proposal that would not only help overcome the operational issues faced, but instil confidence in the ability of the court to make the trial happen."
        },
        {
            "text": "Making use of experienced contacts and video facilities at the Manchester prison, the Category A prisoners appeared on a big screen in the court via video link on most days, then attended in person when they gave evidence, fulfilling all legal requirements. The video link connection to the courtroom was through a newly installed Cloud Video Platform (CVP) room at the prison. CVP – an internet-based video meeting service that works a bit like Zoom – is one of several technological solutions that HMCTS and HMPPS have accelerated over the past 18 months and has been a real success story of court-working during the pandemic."
        },
        {
            "text": "Many others also attended via CVP, which ran securely, stably and reliably throughout. Police officers, journalists and relatives of those involved were all able to join the trial from their respective offices or appropriate locations. This helped to further minimise footfall and freed up space in the courtroom and building, including court cell space so that other hearings and trials involving a defendant in custody could also continue."
        },
        {
            "text": "Ahead of the trial, the Preston team worked with colleagues in listing, clerks, ushers, security and other internal teams who took part in a day of behind-closed-doors testing. This provided Mr Justice Turner with reassurance that the court was ready to proceed. At the conclusion, he commented:"
        },
        {
            "text": "“The careful deployment of CVP links to the prisons and the exercise of care in limiting physical court appearances to what was reasonably practicable was a challenging exercise in choreography but one which was achieved as a result of commendable co-ordination involving all stakeholders. I am also entirely satisfied that the vital requirement of access to justice was preserved throughout. I have nothing but praise for all those involved in bringing this ship home to port.”"
        },
        {
            "text": "A wealth of benefits"
        },
        {
            "text": "You may not think that hearing one trial in a new way can make a significant difference, but it really can. By deploying video to hear this trial, which successfully concluded last month, we saved the department significant costs in prison transport and resource. And by confining a case that could have sprawled across the entire court, to just 2 linked courtrooms, we estimate that over the 10 weeks we saved capacity at Preston for up to an extra 50 trials, 250 sentencing hearings, and 20 appeals – not to mention around 500 pre-trial preparation, case management, pre-trial review, and mentions hearings."
        },
        {
            "text": "These aren’t just numbers. Each one represents victims, witnesses, defendants and family members who have all benefitted from earlier access to the justice system."
        }
    ]
}