{
    "url": "https://rpc.blog.gov.uk/2021/09/13/how-to-measure-the-impacts-of-regulation-on-business/",
    "title": "How to measure the impacts of regulation on business",
    "authors": [
        "Jonathan Cave"
    ],
    "categories": [
        "Better regulation",
        "Evaluation",
        "Independent scrutiny"
    ],
    "pub_date": "2021-09-13T10:26:02+01:00",
    "content": [
        {
            "text": "The current Government consultation on the Better Regulation Framework is seeking views on how best to measure the impacts of regulation on business. This covers both identification of the best metric to measure business impacts and whether this might be supplemented with a “scorecard” approach to capture the wider impacts of proposals."
        },
        {
            "heading": 2,
            "text": "What do metrics aim to capture?"
        },
        {
            "text": "Many approaches have been tried to measure the burden of regulation. Some focus on the legal texts themselves – the number of regulations, the number and complexity of the words they contain, the number of identifiable constraints they impose, and the scope of the requirements."
        },
        {
            "text": "Like many other countries, in the UK we focus on whether the benefits of a regulation outweigh its costs. However, measurement of costs and benefits is complex and often contentious, and many countries measure only what can usefully, robustly and proportionately be quantified – very few attempt to include indirect impacts or second round effects that depend on how businesses might react to the regulation."
        },
        {
            "text": "Our Impact Assessments (IAs) currently quantify direct and unavoidable consequences of the measure, e.g. costs of transition and/or ongoing compliance costs. IAs also include measures of costs and benefits where these are relatively easy to quantify, sometimes including things like changes in profits or imputed values of improved consumer, health or environmental outcomes."
        },
        {
            "text": "The choice of a metric must be linked to its intended purpose(s). This must be clearly articulated to enable consistent and coordinated behaviour across departments, policy areas and over time. Failure to do this can lead to ‘mission creep’ and misinterpretation."
        },
        {
            "heading": 2,
            "text": "Choosing the number of metrics and what they measure"
        },
        {
            "text": "Going beyond a single metric, for example using a suite of indicators in a scorecard, requires particular clarity over what Government is seeking to achieve. Not all indicators within a scorecard may be quantifiable or measured with equal robustness and consistency, making a scorecard harder to use as a decision-making tool compared to a single metric. That said, to illustrate the importance of specifying purpose, a scorecard may nevertheless be better than a single metric for accountability and informing external scrutiny."
        },
        {
            "text": "We believe that the framework should continue to include a discrete metric as an indicator of regulatory burdens, which can meaningfully be compared across a wide range of regulatory proposals. In our view this means direct and unavoidable impacts on businesses/CSOs, since wider and indirect impacts are analytically difficult to measure, hard to aggregate or compare, and potentially subject to gaming. Direct costs provide a concrete, practical and suitable metric for use across government."
        },
        {
            "text": "The consultation notes the possibility of measuring only administrative burdens. While this would be easy to measure and compare across regulatory proposals, this would significantly reduce the value of the metric. It excludes the ongoing direct costs of compliance which are typically both much larger and more important when: comparing policy options; considering whether the benefits of the policy justify its costs; understanding regulatory incentives for change in business behaviour; and identifying the savings that might be made if the regulation were subsequently removed."
        },
        {
            "text": "In addition to having a clear purpose, the chosen metric(s) should transparently reflect progress against the stated objective(s), be meaningful and useful and build on the measures already in use. Where performance and progress improves or worsens, this should be reflected clearly in an associated change in the metric.  This also allows the metric to be used for evaluation and management of the regulatory stock."
        },
        {
            "text": "Therefore we argue for retaining the current equivalent annual net direct cost to business (EANDCB) metric to track and manage the impact of regulations."
        },
        {
            "text": "Of course, its application can be sharpened and adapted. For example, the distinction between direct and indirect impacts within EANDCB is often blurred and could shift if impacts move between direct and indirect over time or across sectors."
        },
        {
            "text": "To be effective, the metric must be taken seriously and be used as a tool to inform and influence decision making both in terms of choosing among regulatory options and deciding whether to go ahead with a policy."
        },
        {
            "text": "We also support increasing the profile of IAs’ description of important indirect and/or non-quantifiable impacts to better inform decision making."
        },
        {
            "heading": 2,
            "text": "Validating the cost estimates after the regulation has been introduced"
        },
        {
            "text": "As we argued in a recent blog, post implementation reviews (PIRs) are an important tool for understanding whether regulations have achieved their objectives and their actual impacts (including unintended consequences). To be most useful, cost and benefit estimates of the expected impacts of regulations (such as the EANDCB), should be validated after the regulation has come into effect – which provides stronger, more convincing and informative evidence."
        },
        {
            "text": "Ex post  measurement also brings other benefits; it encourages practical and useful monitoring and evidence collection, which can facilitate mid-course policy adjustments and over time reduce the burden of collecting relevant data."
        },
        {
            "heading": 2,
            "text": "Criteria for an effective metric"
        },
        {
            "text": "The metric chosen as the basis for a revised better regulation framework should be:"
        },
        {
            "heading": 2,
            "text": "Conclusion"
        },
        {
            "text": "A single direct cost metric building on the EANDCB is best suited for use in the better regulation framework. It is particularly well-suited to an approach that tries to track the burdens on business over time."
        },
        {
            "text": "Currently the EANDCB metric is used in the BRF to track delivery against the Business Impact Target (BIT). It has also been proposed that we might instead use the metric for a ‘gateway’ condition for new regulations such as “One In, Two Out”. A subsequent blog will consider whether policy making will be well served by either or any such target or control."
        }
    ]
}