{
    "url": "https://socialworkwithadults.blog.gov.uk/2021/09/13/meet-our-new-mental-health-social-work-lead/",
    "title": "Meet our new Mental Health Social Work Lead",
    "authors": [
        "Lyn Romeo"
    ],
    "categories": [
        "Mental health",
        "Our profession"
    ],
    "pub_date": "2021-09-13T15:15:34+00:00",
    "content": [
        {
            "heading": 2,
            "text": "Introducing Jason Brandon"
        },
        {
            "text": "I am delighted to confirm the appointment of Jason Brandon as the Mental Health Social Work Lead, following recruitment into this two year secondment."
        },
        {
            "text": "Jason will provide professional leadership support to the Chief Social Worker for Adults (CSW)'s office to improve social work across mental health services, delivered in local authorities and NHS trusts."
        },
        {
            "text": "He will work closely with the Department of Health and Social Care (DHSC)s mental health policy teams, supporting the development and implementation of the Mental Health Act (MHA) reform, as set out in the Government’s White Paper, published in January 2021, following the Independent Review of the Mental Health Act."
        },
        {
            "heading": 2,
            "text": "Focusing effort where it's needed"
        },
        {
            "text": "His role will be focused on supporting critical improvements to strengthen Approved Mental Health Professional (AMHP) service capacity, based on the growing body of evidence gathered prior to, and during, the COVID-19 pandemic."
        },
        {
            "text": "Jason is seconded from his current role as Head of Mental Health and Physical Disability services at Hampshire County Council, where he has worked in a variety of health and social care settings for over 25 years, with the majority of his experience gained as a qualified social worker, approved mental health professional (AMHP), and manager in local authority mental health services."
        },
        {
            "text": "He is extremely motivated to progress the CSW mental health programme, making sure the voice of social care – and the wise counsel of the adult social work profession - is heard on a range of vital post-COVID-19 agendas."
        }
    ]
}