{
    "url": "https://dcmslibraries.blog.gov.uk/2021/09/13/read-talk-share-stories-from-the-frontline/",
    "title": "Read, Talk, Share – Stories from the frontline",
    "authors": [
        "Karen Napier, Chief Executive, The Reading Agency"
    ],
    "categories": [
        "Case study",
        "Outcome: communities",
        "Outcome: wellbeing"
    ],
    "pub_date": "2021-09-13T13:00:58+01:00",
    "content": [
        {
            "text": "In our previous blog we talked about our Read, Talk, Share campaign which used the proven power of reading to tackle loneliness and support wellbeing.  This time we want to shine a light on the impact of Reading Friends."
        },
        {
            "heading": 2,
            "text": "What is Reading Friends?"
        },
        {
            "text": "Reading Friends is a befriending programme using reading to start conversations and connect people. It tackles the loneliness challenge head on by bringing people together to read, share stories, meet new friends, and have fun. Through an award by the Department for Digital, Culture, Media and Sport (DCMS), The Reading Agency provided funding, training and resources for 102 English library authorities to deliver Reading Friends to diverse audiences at risk of loneliness including new and expectant parents, young carers, older people and those living with dementia."
        },
        {
            "heading": 2,
            "text": "Reading Friends stories "
        },
        {
            "text": "Rochdale Libraries started a weekly ‘Mums, Bumps and Babies’ Zoom group to offer new and expectant parents the chance to share stories, ask questions and make new friends. Without the usual Mum and Baby groups on offer, many participants said this group was exactly what they needed. For some experiencing anxiety during pregnancy, the group offered much needed support enabling them to talk to others and know they were not alone."
        },
        {
            "text": "One visually impaired participant from Norfolk Libraries tells us more about his experiences of Reading Friends over the phone:"
        },
        {
            "text": "In Lancashire Libraries, Reading Friends has been delivering group telephone calls to Home Library Service Users."
        },
        {
            "text": "Many new friendships have formed as a result and participants have started to take ownership of the group and lead conversations. This success has encouraged Lancashire Libraries to set up more groups for Home Library Service Users."
        },
        {
            "text": "North Tyneside Libraries partnered with local charity North Tyneside Carers’ Centre to support socially isolated young carers aged 5-16. As well as joining in online groups talking about books and sharing recommendations, the young carers have written postcards to housebound 'Libraries at Home' customers. After receiving these postcards, the 'Libraries at Home' customers were enthusiastic about writing their own postcards to send on to others."
        },
        {
            "heading": 2,
            "text": "What difference did the programme make?"
        },
        {
            "text": "Lockdown amplified the loneliness challenge. Half (49%) of Reading Friends participants indicated that they had felt lonely often/always or some of the time since March 2020, and over three-quarters (76%) agreed that they had felt lonelier more often than before the pandemic.[1]"
        },
        {
            "text": "Between 28 January and 31 May 2021 when most library buildings were closed, Reading Friends delivered an amazing 69,485 social engagements, connecting lonely and isolated people virtually or over the phone through books and reading."
        },
        {
            "text": "More than four in five Reading Friends participants (83%) agreed it had helped them feel connected to other people, and 72% said taking part had helped them feel less lonely. [2]"
        },
        {
            "text": "And it wasn’t just the participants who experienced positive changes—over three-quarters of Reading Befrienders (77%) agreed that Reading Friends had helped them feel connected to other people."
        },
        {
            "heading": 2,
            "text": "What next?"
        },
        {
            "text": "Our work with DCMS and partnership with public libraries to support wellbeing and tackle loneliness does not end here. It is needed more than ever as the UK recovers from the pandemic. We are working to expand and embed Reading Friends into public library services across the UK, offering a lifeline of social connections and support to those who need it most. Watch some of our librarians talking about the impact of Reading Friends."
        },
        {
            "text": " "
        },
        {
            "text": "[1] Renaisi (2021) Analysis of data collected as part of Reading Friends rollout, unpublished"
        },
        {
            "text": "[2] Renaisi (2021) Analysis of data collected as part of Reading Friends rollout, unpublished"
        }
    ]
}