{
    "url": "https://insidedio.blog.gov.uk/2021/09/13/seed-bombing-project-in-kenya-takes-root/",
    "title": "Seed bombing project in Kenya takes root",
    "authors": [
        "Sam Seaton"
    ],
    "categories": [
        "Biodiversity",
        "Conservation",
        "Kenya",
        "Land Management"
    ],
    "pub_date": "2021-09-13T15:14:37+00:00",
    "content": [
        {
            "text": "3 PARA soldiers move to their next location using a dirt road during a live firing platoon level attack exercise in Kenya. [Crown Copyright / MOD 2020]With my colleagues in the Overseas and Training (OS & TRG) team in Kenya, I’ve been working on a project to increase the number of trees on the British Army Training Unit Kenya (BATUK). We’re doing this through seed bombing, also known as aerial reforestation, is a technique of introducing plants through scattering what are called ‘seedballs’."
        },
        {
            "heading": 2,
            "text": "What are seedballs? "
        },
        {
            "text": "Charcoal dust is combined with nutritious bindings and formed into a ball around seeds, which protects them from damage and animals. Charcoal, which is made from felled trees, is a very common form of fuel in Kenya. The dust is a waste product from the production process and is often left in piles in urban areas, polluting the environment. Using charcoal dust to make seedballs removes some of these piles and uses the waste product to grow new trees, helping to replace those used to make the charcoal in the first place."
        },
        {
            "text": "The seedballs are scattered and when conditions are suitable with sufficient water and sunlight, the seeds will start to germinate and break through their protective housing. It can take as little as a month for new plants to be established in previously barren areas."
        },
        {
            "heading": 2,
            "text": "Environmental impact at BATUK"
        },
        {
            "text": "As part of a project looking at the impact military training has on the land we lease, my colleagues and I worked with DIO’s environmental team. We were able to obtain funding to purchase 16 bags of native grasses and acacia trees, each weighing 25kg, to replant areas which have been impacted by training. We worked with Seedballs Kenya, an organisation which chooses suitable native plants."
        },
        {
            "text": "We studied the impacts of the seedballs, trying different methods of distribution, placing the balls in full sun or shade, and experimenting with burying and scattering the balls for the best effect."
        },
        {
            "text": "Understanding how our training affects the local wildlife and growth is key to ensure we understand the long-term impact of training in Kenya. By doing these studies we form a picture of the ecosystems on our leased land to protect it for future generations. Healthy ecosystems clean our water, purify our air, maintain our soil and regulate the climate."
        },
        {
            "heading": 2,
            "text": "Replanting at Lolldaiga"
        },
        {
            "text": "We also took the opportunity to engage with the local community. Following a fire at Lolldaiga earlier this year, we purchased further seedballs for a mass drop from a helicopter to restore the area. Equity Bank, one of the many local companies that BATUK works with on the high street in Nanyuki, bought a bag of seedballs and donated them to us to scatter, as did other local businesses. Lt Col Finlay Bibby, Deputy Commander of BATUK, was instrumental in helping Equity Bank to plant some seedballs and saplings to enable re-growth in the area."
        },
        {
            "text": "Our plan is to offer visitors to BATUK the opportunity to scatter seeds to offset their carbon footprint from the flight. I’ve loved working on this and seeing how much everyone wants to get involved. I’m optimistic that we’ll start to see much more greenery on the training estate as this project continues."
        }
    ]
}