{
    "url": "https://defrafarming.blog.gov.uk/2025/07/03/capital-grants-now-open-for-applications/",
    "title": "Capital Grants now open for applications ",
    "authors": [
        "Sarah Blatchford"
    ],
    "categories": [
        "Grants"
    ],
    "pub_date": "2025-07-03T12:54:49+01:00",
    "content": [
        {
            "text": "The Capital Grants offer is now open for new applications. "
        },
        {
            "text": "As Secretary of State Steve Reed announced today, this new round will make £150 million of funding available to farmers, land managers and rural businesses for practical environmental improvements across England."
        },
        {
            "text": "These include planting hedgerows, managing boundaries, improving water and air quality, restoring habitats, and introducing natural flood management measures. "
        },
        {
            "text": "These improvements have been chosen because they deliver long-term benefits, helping to reduce pollution and make the environment more resilient. "
        },
        {
            "text": "The Capital Grants offer is designed to support those who manage the land to enhance biodiversity, protect natural resources and improve the landscape. For example, farmers will be able to apply for funding to plant hedgerows for biodiversity or a range of measures to improve water quality such as new livestock equipment. "
        },
        {
            "text": "Capital Grants can be used to deliver standalone improvements or to complement existing Sustainable Farming Incentive (SFI), Countryside Stewardship (CS) or Higher Level Stewardship (HLS) agreements. "
        },
        {
            "text": "The government is introducing changes to make access to the grants fairer, so more farm businesses can get funding and Defra can more effectively manage taxpayers’ money."
        },
        {
            "text": "The improved offer is another step in this government’s New Deal for Farmers to support growth and return farm businesses to profitability. "
        },
        {
            "text": "In this post, I’ll provide an overview of what’s available and how to apply. "
        },
        {
            "heading": 2,
            "text": "Background "
        },
        {
            "text": "Capital Grants remain an important part of our funding to support environmental improvements on farms and in rural areas. "
        },
        {
            "text": "In November 2024, we temporarily closed the Capital Grant offer to new applications due to exceptionally high demand for some items. "
        },
        {
            "text": "At the NFU Conference in February 2025, the Secretary of State confirmed that all the completed Capital Grants applications on hold could be processed. The Rural Payments Agency (RPA) is currently processing submitted applications and most agreements relating to a 2024 capital application will be offered and live by the end of July 2025. "
        },
        {
            "text": "The Secretary of State also confirmed that the offer would reopen with funding in summer 2025. "
        },
        {
            "text": "Today, we are re-opening the Capital Grant offer for new applications. This round includes 4 new capital items to help:"
        },
        {
            "heading": 2,
            "text": "Applying for the Capital Grant offer "
        },
        {
            "text": "There are 78 items available through the Capital Grant offer, in 6 groups:  "
        },
        {
            "text": "You can apply for items in any of these groups. However, we are introducing funding limits for 4 groups: "
        },
        {
            "text": "Each application can include items from these groups up to the relevant limit, as well as additional items from the assessments and improvements groups. "
        },
        {
            "text": "These changes do not apply to applications submitted in 2024, as it would not be fair to apply limits retrospectively. "
        },
        {
            "text": "You can apply at any time during the year. However, we will only accept one successful application per Single Business Identifier (SBI) per calendar year. "
        },
        {
            "text": "Funding limits help more farmers access support and allow us to manage the offer sustainably while delivering environmental benefits. "
        },
        {
            "heading": 2,
            "text": "Updated guidance"
        },
        {
            "text": "We’ve published updated guidance on GOV.UK which you will need to read before submitting an application, including: "
        },
        {
            "text": "Later this year, we will add a further four items to the Capital Grants offer: accreditation for educational access visits, installing and maintaining signage, using tree surgery to hinge a tree into a water course, and creating or restoring ponds.  "
        },
        {
            "text": "More information on these items will be available in due course.  "
        },
        {
            "text": "With more capital items to be made available later this year, we encourage you to plan ahead and consider all potential applications before submitting. "
        },
        {
            "text": "If an application is rejected, withdrawn, or removed, you will be able to start a new one while the round is open. "
        },
        {
            "text": "A summary of each new item can be found below. "
        },
        {
            "heading": 2,
            "text": "New items"
        },
        {
            "heading": 3,
            "text": "Assess woodland condition (FY7) "
        },
        {
            "text": "This item supports the restoration and maintenance of woodland in good ecological condition, with benefits for tree health and overall woodland ecology. "
        },
        {
            "text": "It is compulsory for farmers and land managers entering a CS Higher Tier Woodland agreement with action CWD2: Woodland improvement, which requires endorsement by the Forestry Commission."
        },
        {
            "text": "It can also be used without endorsement on woodland to identify features that need to be improved to benefit the environment. This item is part of the ‘Assessments’ group, where there is no limit to the funding per application. "
        },
        {
            "text": "Payment details: "
        },
        {
            "text": "What farmers need to do: "
        },
        {
            "text": "Once they have an agreement, farmers and land managers must complete a woodland condition assessment. "
        },
        {
            "heading": 3,
            "text": "Create a wildfire checklist (WF1) "
        },
        {
            "text": "This item helps farmers assess and manage the risk of wildfire. It protects the environment, wildlife, livestock and public health."
        },
        {
            "text": " Identifying wildfire risks on farms helps prevent damage to the land and supports emergency preparedness. This item is part of the ‘Assessments’ group, where there is no limit to the funding per application."
        },
        {
            "text": "Payment details: "
        },
        {
            "text": "What farmers need to do: Once they have an agreement, farmers must complete a wildfire risk checklist. "
        },
        {
            "heading": 3,
            "text": "Repair stone walls (BN16) "
        },
        {
            "text": "This item supports the restoration of traditional boundaries, such as dry-stone walls. It helps maintain the character of the local landscape and provides valuable habitats for small wildlife, such as beetles and nesting birds."
        },
        {
            "text": "It also helps prevent livestock from escaping and preserves heritage features. This item is part of the ‘Boundaries, trees and orchards’ group; each application can include items up to a value of £35,000 from this group. "
        },
        {
            "text": "Payment details: "
        },
        {
            "text": "What farmers need to do: "
        },
        {
            "text": "Once they have an agreement, farmers must rebuild the stone wall to its original height and in the local style. "
        },
        {
            "heading": 3,
            "text": "Educational access visits (VED1) "
        },
        {
            "text": "This item supports visits that help people learn about farming, food production, woodland management and the natural environment. It also promotes wellbeing by encouraging people to explore the countryside."
        },
        {
            "text": "This item is part of the 'Improvements’ group, where there is no limit to the funding per application. "
        },
        {
            "text": "Payment details: "
        },
        {
            "text": "What farmers need to do: Farmers (or someone they appoint with appropriate knowledge of the farm) must accompany groups on a guided visit to land in an agri-environment agreement. "
        },
        {
            "text": "More detail and guidance on all capital items can be found on the Grant Finder tool. "
        },
        {
            "heading": 2,
            "text": "Other capital grants you can apply for  "
        },
        {
            "text": "The Capital Grants offer is just one part of our Capital Grants scheme. "
        },
        {
            "text": "The capital grants scheme is the umbrella term for all 6 of the standalone offers: "
        },
        {
            "text": "You can continue to apply for the above grants. "
        },
        {
            "heading": 2,
            "text": "Next steps for the Capital Grants offer "
        },
        {
            "text": "Demand during the last application window was unprecedented. Available funding was fully allocated, which is why the offer was temporarily closed in November 2024. "
        },
        {
            "text": "We will monitor the uptake of the revised Capital Grants offer to ensure the funding in this new round is allocated. Careful management of the farming budget ensures we can maximise the impact of funding for farmers and for the environment. "
        },
        {
            "text": "When this round’s funding is allocated, we will need to close the Capital Grants offer again. At the point of closure, we will not accept any further applications including those started but not yet submitted.   "
        },
        {
            "text": "We will aim to give reasonable notice before closing the offer, but this may not always be possible. Funding is not guaranteed even if an application has been submitted and is eligible. "
        },
        {
            "text": "When this round concludes, further improvements will be made to the offer and we expect to open a new round for farmers to secure more funding during 2026. "
        },
        {
            "text": "We want to reform Capital Grants further in future years to move to a more competitive offer that provides more certainty to applicants and that helps further target funds on delivering against the government’s priorities. As well as improved budget management.  "
        },
        {
            "text": "As mentioned previously, later this year we will add an additional 4 items to the Capital Grants offer:  "
        },
        {
            "text": "We’ll publish a blog post when the new items become available, so do subscribe to the Farming blog.  "
        },
        {
            "text": "We will also add 30 new items to CS Higher Tier capital grants. "
        },
        {
            "text": "More information on these new items will be published later this summer on the Grant Finder tool. "
        },
        {
            "heading": 2,
            "text": "Catchment Sensitive Farming (CSF) advice for farmers  "
        },
        {
            "text": "Catchment Sensitive Farming (CSF) is a Defra-funded service that provides free, confidential and impartial advice to help farmers improve the quality of water, air and soil in their area. "
        },
        {
            "text": "Some capital items are only available with support from CSF, following a consultation to identify your local environmental priorities. "
        },
        {
            "text": "Learn more about CSF and get advice from your local adviser. "
        },
        {
            "heading": 2,
            "text": "Subscribe to the Farming blog   "
        },
        {
            "text": "Subscribe to the Farming blog to stay up to date with the latest developments from the Farming and Countryside Programme."
        },
        {
            "text": "You will receive an email notification whenever we publish a new post.  "
        }
    ]
}