{
    "url": "https://defrafarming.blog.gov.uk/2025/07/03/join-our-webinar-to-learn-about-vet-visit-funding-for-multiple-herds-and-flocks/",
    "title": "Join our webinars to learn about vet visit funding for multiple herds and flocks ",
    "authors": [
        "Madeline Hedge"
    ],
    "categories": [
        "Payments to support animal health and welfare"
    ],
    "pub_date": "2025-07-03T10:35:50+01:00",
    "content": [
        {
            "text": "Farmers in England can now get funding for vet visits for each of their herds or flocks of the same species. "
        },
        {
            "text": "This includes Animal Health and Welfare Reviews as well as follow-up visits for endemic diseases, offered through the Get Funding to Improve Animal Health and Welfare service.  "
        },
        {
            "text": "This means that if you manage several groups of cattle, pigs or sheep, you can now get support across your business – not just for a single herd or flock.  "
        },
        {
            "text": "To help you learn more about this offer, we’re holding 2 webinars this month."
        },
        {
            "text": "You’ll learn more about how to apply, what’s included in a funded visit, and how it can support your business. "
        },
        {
            "heading": 2,
            "text": "What we’ll cover "
        },
        {
            "text": "We’ll explain how the Animal Health and Welfare Review works and how it has been expanded to offer more support. "
        },
        {
            "text": "You’ll hear: "
        },
        {
            "text": "There will be time for questions. "
        },
        {
            "heading": 2,
            "text": "Register to attend "
        },
        {
            "text": "Sheep farmers Wednesday 16 July 3pm to 4pm Sign up to the sheep farmer webinar on Eventbrite "
        },
        {
            "text": "Pig farmers Thursday 17 July 11am to 12pm Sign up to the pig farmer webinar on Eventbrite "
        },
        {
            "text": "We hope to see you there. If you can’t make it, don’t worry, we’ll share the recordings in this post after each webinar ends. "
        },
        {
            "text": "Links to learn more about the offer are in the grey box below. "
        }
    ]
}