{
    "url": "https://competitionandmarkets.blog.gov.uk/2025/07/03/price-transparency-is-important-it-affects-everyone/",
    "title": "Price transparency is important, it affects everyone ",
    "authors": [
        "Emma Cochrane"
    ],
    "categories": [
        "Consumer protection"
    ],
    "pub_date": "2025-07-03T10:15:31+01:00",
    "content": [
        {
            "text": "It is vital that shoppers can access clear and timely pricing information. Knowing what a product will cost is fundamental for them to make good purchasing decisions – working out which product is best for them, and where to buy it.  "
        },
        {
            "text": "When businesses do not display their prices accurately or leave out essential pricing information that people need to know, it can make products appear cheaper than they are. "
        },
        {
            "text": "That can lead to people spending more and undermine people’s trust in markets when they find out the real cost. It also harms fair dealing businesses, preventing them from competing on a level playing field. By promoting competition, and consumer confidence, price transparency benefits the wider UK economy too."
        },
        {
            "text": "We know most businesses want to compete on the merits of their product and give customers all the information they need. Our draft Price Transparency Guidance that we are publishing today, (and consulting on, over  the summer), is designed to help businesses comply with the updated provisions on price transparency, that came into force with the Digital Markets Competition and Consumer Act 2024 (DMCCA).  "
        },
        {
            "text": "In this consultation, we want to hear from businesses on whether there is more that we can do to support them in complying with the law.  "
        },
        {
            "text": "When consumers are confident, markets thrive.  "
        },
        {
            "text": "The CMA has consistently made price transparency a priority. In recent years we have conducted investigations, taken enforcement action and issued guidance across a range of sectors and practices including: "
        },
        {
            "text": "We are also in the process of taking enforcement action against Emma Sleep and Ticketmaster under the previous (court-based) regime. The CMA’s investigation into Emma Sleep includes concerns about the use of urgency claims and reference pricing, and the investigation into Ticketmaster includes concerns that consumers were not given clear and timely information about how the pricing of certain tickets would work. "
        },
        {
            "heading": 2,
            "text": "Consulting on new guidance "
        },
        {
            "text": "The importance of price transparency is also why it was included in the recent DMCCA, which updated the unfair commercial practices (UCP) provisions in response to concerns about some business practices. The objective of the new law is to change how businesses present their prices, and the CMA recognises that many businesses will need to review and amend their pricing practices to ensure they fully comply with the UCP provisions. Indeed, the CMA has already seen examples of businesses proactively making changes to achieve compliance with the new rules – the CMA welcomes these changes. "
        },
        {
            "text": "When we published our updated guidance on the revised UCP provisions (CMA207) we committed to consult further on the new price transparency requirements introduced by the DMCCA to help support businesses to improve their compliance with this new law.  "
        },
        {
            "text": "The draft guidance we have published today includes guidance on the new law, as well as references to relevant requirements imposed by other UCP provisions in relation to pricing (in particular the prohibitions on misleading actions and omissions) and previous CMA sector guidance (such as online hotel booking and car rental). "
        },
        {
            "text": "As set out in the CMA’s approach to direct consumer protection we expect to focus our early enforcement action on the most egregious practices, including fees that are hidden until late in the purchase process because this harms consumers and fair dealing businesses, by hindering effective price competition.  "
        },
        {
            "text": "At the same time, we want to support businesses to comply with the law, be able to compete on the merits of their product and give their customers all the information they need. The draft guidance we have published today is a key step in this process.  "
        },
        {
            "text": "We encourage businesses to carefully consider their pricing practices over the next months to ensure they do not fall foul of the law. When businesses get it right, everyone benefits. "
        },
        {
            "heading": 2,
            "text": "Share your views with us "
        },
        {
            "text": "If you own, run, or work for a business that markets products or services to consumers then we want to hear from you.  "
        },
        {
            "text": "We want to make our guidance as clear and user friendly as possible, with real life examples of how businesses can present their prices in a lawful way.  "
        },
        {
            "text": "We also recognise that what the new law requires may differ between some products, and in practice between different stages of the purchase process. We welcome feedback on other ways in which businesses might reasonably comply with the requirements introduced by the DMCC Act. "
        },
        {
            "heading": 2,
            "text": "Get involved"
        },
        {
            "text": "We are running a series of events that you can register for now."
        },
        {
            "text": "Industry bodies and trade associations can also  register their interest for roundtables on the draft guidance on 17 and 24 July 2025."
        }
    ]
}