{
    "url": "https://educationhub.blog.gov.uk/2025/07/rise-teams-everything-you-need-to-know/",
    "title": "RISE teams: everything you need to know",
    "authors": [
        "mediaofficer"
    ],
    "categories": [
        "Education Standards",
        "Ofsted",
        "Schools"
    ],
    "pub_date": "2025-07-03T09:40:35+01:00",
    "content": [
        {
            "text": "Earlier this year, we launched Regional Improvement for Standards and Excellence (RISE) teams. These teams, also known as regional school improvement teams, are a key part of our work to drive up education standards in classrooms across England. "
        },
        {
            "text": "RISE teams are currently working with over 200 schools – helping the department tackle underperformance so every parent can rely on a great education for their child.  "
        },
        {
            "text": "Here’s everything you need to know. "
        },
        {
            "heading": 3,
            "text": "What are RISE teams? "
        },
        {
            "text": "RISE teams will provide mandatory, targeted intervention for schools identified by Ofsted as needing to improve.  "
        },
        {
            "text": "Initially, these teams will work with schools that have received multiple Ofsted judgements below ‘Good’ or equivalent. RISE advisers will engage with the identified schools to consider their specific improvement needs, based on the findings of their Ofsted inspections. "
        },
        {
            "text": "RISE teams will also offer a wider, universal service to help all schools to improve, especially by promoting collaboration and sharing learnings. RISE teams will signpost schools to best practice, encourage peer-to-peer support, and bring schools together to share their knowledge and the ways they are overcoming challenges. "
        },
        {
            "heading": 3,
            "text": "Who are the RISE advisers? "
        },
        {
            "text": "RISE advisers are education professionals with experience in school leadership and improvement. They are selected based on their record of improving outcomes in schools.  "
        },
        {
            "text": "As of April 2025, 65 advisers have been appointed to the programme – an increase from the original 20 at launch. "
        },
        {
            "text": "They are working alongside schools, trusts and local authorities to identify practical steps for improvement. "
        },
        {
            "text": "You can find a list of the RISE advisers here. "
        },
        {
            "heading": 3,
            "text": "How will the teams help improve school standards for children? "
        },
        {
            "text": "RISE teams work directly with schools that need extra support to get better. "
        },
        {
            "text": "When a school is selected for RISE support, an advisor will visit the school to understand their current situation. During this first visit, the advisor reviews the school's existing improvement plan to see what leaders have already identified as areas needing development. "
        },
        {
            "text": "The RISE advisor carefully assesses whether the school has the resources and expertise to deliver the improvements they've planned. If the school needs additional support, the advisor can connect them with a high-performing school or academy trust, or another supporting organisation with specific experience in the areas where help is needed. "
        },
        {
            "text": "Every support package is tailored specifically to address each school's unique challenges and requirements. This might include professional development for teachers, short term expert help from a RISE advisor, or sharing successful approaches from other schools. "
        },
        {
            "text": "Government funding is available to cover the costs of this additional support where necessary, ensuring schools can access the help they need without financial barriers. "
        },
        {
            "text": "As well as targeted support for specific schools, RISE teams are also offering a universal service to all schools. This includes sharing examples of best practice and supporting collaboration between schools in key priority areas:  "
        },
        {
            "heading": 3,
            "text": "What’s next? "
        },
        {
            "text": "A new RISE stakeholder group is being set up to help shape how the programme is delivered. The group will include voices from across the education sector to make sure the work of RISE reflects the real experiences and needs of schools.  "
        },
        {
            "text": "Members will come from schools receiving support as well as those providing it. We will shortly contact representative bodies of these groups to nominate potential members.  "
        },
        {
            "text": "Further updates on the programme and wider school accountability reforms are expected later this year. "
        }
    ]
}