{
    "url": "https://defraenvironment.blog.gov.uk/2025/07/03/share-your-views-on-biodiversity-net-gain-plus-more-funding-for-local-planning-authorities/",
    "title": "Share your views on biodiversity net gain, plus more funding for local planning authorities",
    "authors": [
        "Environment blog team"
    ],
    "categories": [
        "Biodiversity net gain",
        "Land use",
        "Planning"
    ],
    "pub_date": "2025-07-03T00:30:00+01:00",
    "content": [
        {
            "text": "Today’s update includes how you can give your views on aspects of biodiversity net gain (BNG) policy. Read on to find out more."
        },
        {
            "text": "Biodiversity net gain is leading to positive change"
        },
        {
            "text": "We are now in the second year of mandatory BNG for many types of development going through the planning system. Those of us involved in navigating the policy during its inception phase (developers, local planning authorities, ecologists, and many others) can probably agree that it has been quite a whirlwind year or so."
        },
        {
            "text": "BNG is a world-leading policy and we are grateful to everyone who is helping to make it work successfully. The government is fully committed to making it effective, and evidence so far suggests that we are already seeing positive change."
        },
        {
            "text": "More developers are seeking ecological advice earlier in the development planning process (which is speeding things up) and are seeking to avoid impacts on biodiversity when choosing between development sites. Greater biodiversity improvements are being delivered ‘onsite’, which is often the option that is cheapest and has greatest local community benefits and support."
        },
        {
            "text": "We have also received interest from countries such as the Netherlands, New Zealand and China. They’re looking to learn from BNG to understand how it could be applied in their own countries to help support nature, promote growth and drive sustainable housebuilding."
        },
        {
            "text": "And BNG is helping to generate green investment. When developers are unable to achieve their full 10% BNG on-site, they are required to go off-site. They then have the option to pay land managers to protect nature on their behalf through the growing ‘off-site market’."
        },
        {
            "text": "This BNG market is rapidly developing with a growing number of companies and land managers selling biodiversity units to developers across the country (currently 90 habitat bank sites are on the national register, totalling over 2700ha of habitat created or enhanced)."
        },
        {
            "text": "This means BNG is starting to open new, nature-friendly revenue streams for farmers and land managers."
        },
        {
            "text": "Green groups are using BNG as a tool to finance significant gains for nature, helping to drive recovery in their areas, and lessening burdens on government."
        },
        {
            "text": "New, innovative, tech start-ups have formed to aid offsite market development, reducing costs for both developers and those selling biodiversity units."
        },
        {
            "text": "And best practice is emerging in local planning authorities, helping to speed up BNG administration."
        },
        {
            "text": "BNG for National Significant Infrastructure Projects (NSIPs) is coming"
        },
        {
            "text": "We recently introduced two public consultations on aspects of BNG: one on NSIPs, and one for smaller and brownfield development."
        },
        {
            "text": "Government has confirmed it will be rolling out BNG for our largest infrastructure projects, like power stations and major highways, from May 2026. Their size means they have an opportunity to deliver important biodiversity benefits, which will play a significant part in helping to halt nature’s decline."
        },
        {
            "text": "Introducing a mandatory approach will bring consistency across planning regimes and create certainty and investor confidence, facilitating further growth in the now thriving private market for biodiversity."
        },
        {
            "text": "Our proposals for flexibilities to streamline the system for NSIPs will make it simpler and cheaper for infrastructure developers to deliver BNG."
        },
        {
            "text": "Improving the implementation for small sites"
        },
        {
            "text": "However, there is also emerging evidence that some smaller developers and certain types of development are finding BNG more challenging than anticipated, despite special provisions."
        },
        {
            "text": "A public consultation offers government an opportunity to recognise these challenges and to work with the sector to look at options to streamline and improve the BNG systems to address them. It focuses on those reforms capable of reducing developer cost and enhancing their experiences as well as sustaining or improving environmental outcomes."
        },
        {
            "text": "Share your thoughts on aspects of biodiversity net gain"
        },
        {
            "text": "There is still time to respond to the two public consultations seeking views on aspects of BNG policy. The deadline for responding is 24 July at 11.59pm."
        },
        {
            "text": "Both cover important considerations that are likely to shape the implementation of BNG for several years to come. We are keen to get a wide range of view to inform future direction, so please do respond."
        },
        {
            "text": "After the consultations close, we will publish a summary of everyone’s feedback before publishing the government’s full responses later this year."
        },
        {
            "text": "The consultations are as follows:"
        },
        {
            "text": "BNG will apply to our largest infrastructure projects, like power stations and highways, from May 2026."
        },
        {
            "text": "Many of these projects are already delivering biodiversity gains voluntarily, but this mandatory change will give nature in England a further boost.This consultation gives industry stakeholders an important opportunity to shape policy design, ensuring BNG is adapted to fit the scale and nature of these projects."
        },
        {
            "text": "We want to look at options to help smaller developers deliver BNG, whilst ensuring the policy continues to contribute to nature recovery targets."
        },
        {
            "text": "Since the introduction of mandatory BNG last year, one of the most widely acknowledged challenges is around how it works for minor developments – including smaller residential sites between 1 and 9 dwellings, and on sites of less than one hectare."
        },
        {
            "text": "The consultation seeks feedback on extending exemptions, simplifying the small sites metric and increasing ease of access to the off-site market. It also looks at how we can address specific challenges for brownfield developments."
        },
        {
            "text": "£10 million funding to help local planning authorities deliver BNG"
        },
        {
            "text": "Alongside the consultations, we have also announced £10 million funding for local planning authorities to deliver BNG for this financial year."
        },
        {
            "text": "We want to ensure that local planning authorities have the resources to implement BNG and support developers to meet their requirements. The funding will help them to recruit and expand ecologist teams, invest in green jobs and increase capacity to create their own wildlife-rich habitats for developers who need to go off-site within a planning authority’s area."
        }
    ]
}