{
    "url": "https://naturalengland.blog.gov.uk/2025/07/03/supporting-wellbeing-and-natures-recovery-learning-from-the-7th-nature-connections-conference/",
    "title": "Supporting Wellbeing and Nature’s Recovery – learning from the 7th Nature Connections Conference",
    "authors": [
        "Natural England"
    ],
    "categories": [
        "Connecting People with Nature",
        "Education",
        "Green Infrastructure",
        "Mental health and wellbeing",
        "Natural England",
        "Nature",
        "Nature Recovery",
        "Parks, trails and nature reserves",
        "Wildlife"
    ],
    "pub_date": "2025-07-03T10:07:40+01:00",
    "content": [
        {
            "text": "Human health and nature are deeply interconnected.  However, many people do not feel a strong connection to nature in their day-to-day lives. Strengthening our connection to nature can address shared challenges such as health and wellbeing, drive nature’s recovery and contribute to a thriving economy for all. "
        },
        {
            "text": "In June, University of Derby hosted the 7th Nature Connections Conference. The event celebrated the work over recent years on Nature Connectedness and brought together researchers, practitioners, and policy makers to reflect on recent evidence and insights. The conference reinforced the power of collaboration."
        },
        {
            "text": "In the opening address, the University of Derby’s Professor Miles Richardson, referenced the recent Intergovernmental Science-Policy Platform on Biodiversity and Ecosystem Services ‘Transformative Change’ report . The report highlights that ‘respectful and reciprocal human-nature relationships’ is key if we are to address biodiversity loss."
        },
        {
            "heading": 4,
            "text": "Nature Connection and Nature Recovery"
        },
        {
            "text": "Research confirms what many of us instinctively understand - when people develop meaningful connections with nature, they're more likely to care for it and take action to protect it. Understanding that this connection to nature can provide a way to enable the long-term behaviour change, can help us address many of today’s social and environmental challenges."
        },
        {
            "text": "Some of Natural England's own work demonstrates this. Initiatives like Nature Towns and Cities and the national Green Social Prescribing Programme engage communities in acting for nature while also bringing other benefits including health, wellbeing and social cohesion.  There are many community led examples too like the E2 Urban Garden project in Leicester, transforming derelict and contaminated land into a micro-scale public garden that is engaging and connecting people with nature and with each other."
        },
        {
            "heading": 4,
            "text": "Natural England’s Vision"
        },
        {
            "text": "David Drake, Director for People and Nature, provided a keynote speech. He highlighted that the importance of building nature connection has never been greater, particularly for those in society for whom access to nature is limited and have the least opportunities to develop a deeper connection with it."
        },
        {
            "text": "The speech explored some of the challenges our society and nature face. We need to recognise the fundamental connection between human wellbeing and environmental health, so we can find the solutions that can support outcomes for both our own wellbeing and nature recovery."
        },
        {
            "text": "David explained that this understanding sits at the heart of Natural England’s Strategic Direction 2025 - 2030. By increasingly embedding nature connection across our work, we are working toward a society where everyone can benefit from a meaningful relationship with the natural world."
        },
        {
            "heading": 4,
            "text": "Deepening our understanding"
        },
        {
            "text": "The conference highlighted several issues that are important to consider if we are to build the stronger relationships with nature across society that we need. For example:"
        },
        {
            "heading": 4,
            "text": "Going Forward"
        },
        {
            "text": "Armed with this insight, strengthening our connection to nature isn't just desirable – it is essential for creating resilient communities and nature. As we support nature's recovery, we also nurture our collective wellbeing, creating a positive cycle that benefits all."
        },
        {
            "text": "We invite partners to join us in considering how a connection to nature can support policy and practice. Evidence, tools, and guidance are available for local authorities, healthcare providers, businesses, and community groups. For example, the Natural England evidence summary for policy makers and the University of Derby’s Nature Connection handbook."
        },
        {
            "text": "Together, we can build a future where nature is woven into the fabric of everyday life."
        }
    ]
}