{
    "url": "https://dfedigital.blog.gov.uk/2025/07/03/using-research-crits-to-improve-our-work/",
    "title": "Using research crits to improve our work",
    "authors": [
        "Solène Heinzl",
        "Ella Beaumont, Senior User Researcher"
    ],
    "categories": [
        "user research"
    ],
    "pub_date": "2025-07-03T09:55:49+01:00",
    "content": [
        {
            "text": "A research crit is a place for researchers to come together and provide each other advice and feedback on their work. "
        },
        {
            "text": "The benefits of a crit are they:"
        },
        {
            "heading": 2,
            "text": "How they started"
        },
        {
            "text": "In the Children & Families Digital portfolio at DfE, we have a group of experienced user researchers working across several projects and policy areas.  We wanted to find ways to share our knowledge and experience with each other to improve the quality of our work. We also wanted to share more about what we’re working on across the portfolio."
        },
        {
            "text": "Crits are a well-established part of the UCD professions at DfE, but they’re often design focused. We wanted to see how well they could work for the research process. One of our researchers, James Bolchover, had run research crits in a previous role and suggested we trial them."
        },
        {
            "text": "We came together to agree the terms for the crit. This written agreement for how the crits should run is recorded at the top of the Lucid board we use to run the session. The agreement outlines that we:"
        },
        {
            "heading": 2,
            "text": "How we run them"
        },
        {
            "text": "We already have a fortnightly meetup together on Mondays. We agreed that once a month, we’d repurpose this for a crit."
        },
        {
            "text": "We started off by asking a week before over slack if anyone had things to bring to crit the following week. Uptake was low and we did have to skip a few crits to start with. When we investigated, we found that a week in advance was too far to wait to crit a problem. People needed feedback on things they were solving in the moment."
        },
        {
            "text": "We changed the process and now put a message on Slack on a Monday morning asking what people want to discuss that day. Doing it this way means people bring things that are top of mind for them, and we can give them timely feedback. "
        },
        {
            "text": "We’ve found recently that researchers are wanting crits more frequently, so we’re doing them almost fortnightly now."
        },
        {
            "heading": 2,
            "text": "Things we crit"
        },
        {
            "text": "We’ve covered many topics in our crits so far. The only criteria is that we don’t review anything that’s finished; it must be a work in progress. Some things we’ve looked at include:"
        },
        {
            "heading": 2,
            "text": "Tools we use"
        },
        {
            "text": "One of our principles is that crits shouldn’t take a lot of extra work. James created a Lucid board for us with the template below. This template covers:"
        },
        {
            "text": "The researcher fills out the relevant sections before the session, and we use the meeting to provide feedback and discuss it."
        },
        {
            "text": "We also have follow up sessions for researchers to share and reflect on what they eventually did with the work."
        },
        {
            "heading": 2,
            "text": "What we’ve learned"
        },
        {
            "text": "We’ve found research crits to be a great way to share what we’re working on without adding too much time and burden onto our researchers."
        },
        {
            "text": "They’ve improved our practice as we’ve consistently made changes because of each other's feedback. To name a few examples, we’ve restructured our insight library to make it easier to read with labels and tags, we implemented pre-briefing for participants trying out a role play method for the first time, and we rewrote an information sheet to reduce the text for young people."
        }
    ]
}