{
    "url": "https://mhclgmedia.blog.gov.uk/2025/09/12/housing-secretary-issues-call-to-arms-for-leading-developers-to-build-baby-build/",
    "title": "Housing Secretary issues ‘call to arms’ for leading developers to ‘build, baby, build’ ",
    "authors": [
        "mhclgpress"
    ],
    "categories": [
        "Housing"
    ],
    "pub_date": "2025-09-12T16:32:53+01:00",
    "content": [
        {
            "text": "This week the Housing Secretary, Steve Reed, brought together key developers and housebuilders, alongside Housing Minister Matthew Pennycook, to work in partnership with industry leaders to ramp up housebuilding."
        },
        {
            "text": "Discussions focused on tackling the remaining barriers, including complex planning processes, that stand in the way of building 1.5 million homes in this Parliament."
        },
        {
            "text": "The Housing Secretary also visited a housing site in Bedfordshire, witnessing first-hand the best ways to move forward and speed up building at sites up and down the country, with residents moving into the new homes being built."
        },
        {
            "text": "The ‘call to arms’ was covered exclusively by BBC News and aired on BBC Breakfast, who interviewed the Housing Secretary in Bedfordshire and focused on his commitment to build 1.5million homes and reduce barriers to development. Further coverage landed in the Independent outlining that the government will work in partnership with developers and housebuilders to build the homes people desperately need."
        },
        {
            "text": "Housing Secretary, Steve Reed, said:  “I want us to build, baby, build, so we can put the key to a decent home into the hands of every single family that needs it.  "
        },
        {
            "text": "“We are doubling down on our plans to unleash one of the biggest eras of building in our country’s history and we are backing the builders all the way.  "
        },
        {
            "text": "“Through major planning reform and investment, we will break down the barriers to development and build the 1.5 million homes this country needs as part of our Plan for Change.” "
        }
    ]
}