{
    "url": "https://hmlandregistry.blog.gov.uk/2025/09/12/how-to-deal-with-property-using-a-power-of-attorney/",
    "title": "How to deal with property using a power of attorney ",
    "authors": [
        "Nadia Abed, Assistant Land Registrar"
    ],
    "categories": [
        "Law and practice"
    ],
    "pub_date": "2025-09-12T14:41:10+01:00",
    "content": [
        {
            "text": " This guide explains how powers of attorney work for property transactions and what HM Land Registry needs when registering property transfers. It covers different types of powers of attorney, how they're created and used, and special rules for gifts and undervalued sales. "
        },
        {
            "heading": 2,
            "text": "What is a power of attorney? "
        },
        {
            "text": "A power of attorney is a legal document that allows someone you trust (called an \"attorney\") to act on your behalf. The person making the document is called the \"donor\". "
        },
        {
            "text": "\n"
        },
        {
            "text": "You might need a power of attorney if: "
        },
        {
            "text": "\n"
        },
        {
            "text": "\n"
        },
        {
            "text": "The attorney can make decisions about your health and welfare, or your property and money, permanently or temporarily - depending on what the document allows. "
        },
        {
            "text": "\n"
        },
        {
            "heading": 2,
            "text": "Types of power of attorney "
        },
        {
            "text": "\nThere are three main types of power of attorney: \n\n\n\nType\nDuration\nWhat it does\nWhen it can be used\nNote\n\n\n\n\nGeneral Power of Attorney (GPA)\nTypically temporary\nGives broad authority to act on your behalf\nOnly while you have mental capacity\nYou don’t have to register a GPA\n\n\nEnduring Power of Attorney (EPA)\nUsually permanent\nManages property and financial affairs\nCan continue if you lose mental capacity\nMust be registeredNo new EPAs can be made\n\n\nLasting Power of Attorney (LPA)\nUsually permanent\nTwo types available to manage property and finances or health and welfare\nCan be used before and after losing mental capacity\nReplaces EPAsMust be registered immediately\n\n\n\n \nKey differences: \n\nGeneral powers stop working if you lose mental capacity\nEnduring powers (EPAs) continue working if already registered, but new EPAs cannot be created any more \nLasting powers (LPAs) must be registered with the Office of the Public Guardian\n\nCreating and using a power of attorney \nWho can create one: \n\nYou must be over 18 \nYou must have mental capacity when making the document\n \n\n\nHow they work: \n\nAttorneys must act in your best interests \nYou can add restrictions to limit what they can do \nAll powers of attorney end when you die \nYou may cancel a power of attorney anytime while you have mental capacity\n \n\n\nGifts and undervalued sales \nWhat attorneys cannot usually do: \n\nGive your property to themselves or others as gifts \nSell your property for less than market value\n\n \nLimited exceptions: \nAttorneys can make gifts only in specific circumstances under the Mental Capacity Act 2005, for example: \n\nto charities you supported \nto family members in certain situations\n \n\n\nWhat HM Land Registry needs: \nWhen someone wants to transfer property for free or below market value, we need proof that the transaction is allowed. \nIf the donor still has mental capacity: \n\nthe donor themselves must sign the transfer deed \n\nIf the donor lacks mental capacity: \n\na Court of Protection order authorising the transaction\n \n\n\nMore information \nFor detailed guidance on property transactions involving powers of attorney, see our Practice Guide 9: powers of attorney and registered land. For gift-giving guidance, visit the Office of the Public Guardian.\nThis guidance helps ensure property transactions using powers of attorney are properly authorised and protect vulnerable people from financial abuse.   "
        }
    ]
}