{
    "url": "https://food.blog.gov.uk/2025/09/12/update-on-the-next-fsa-board-meeting/",
    "title": "Update on the next FSA Board meeting",
    "authors": [
        "Katie Pettifer, Chief Executive"
    ],
    "categories": [
        "Our mission"
    ],
    "pub_date": "2025-09-12T11:17:12+01:00",
    "content": [
        {
            "text": "Cymraeg"
        },
        {
            "text": "I hope you’ve had a good summer. For the FSA it’s been a busy few weeks since our last update to stakeholders, with some welcome announcements on our work to regulate the CBD market and the on-going fight against food crime. At the beginning of August, we launched a public call for evidence to assess whether the Government's new trade deal with India maintains statutory protections for human health, including food safety and nutrition."
        },
        {
            "text": "We are also very pleased that six new members have been appointed to the FSA Board, four of whom will be joining us for the first time at the next Board meeting on 17 September in Belfast. The September Board meeting will cover a broad range of the FSA’s work, from an annual update on science in the FSA, to a review of our work to enforce animal welfare requirements in abattoirs over the past year. The Board will also be discussing our latest assessment of the performance of local authorities, who ensure food hygiene and food standards are being upheld across nearly 600,000 food businesses in the UK."
        },
        {
            "text": "My own update to the Board, which we will publish on Monday, will cover, amongst other items, Defra’s recent announcement about border checks. Extra checks on live animal imports from the EU, and on specific animal and plant goods from Ireland will not now be introduced. This follows the agreement with the EU to pursue a new approach to border inspections. Checks introduced in January last year, with the FSA providing input on food and feed safety risks at the border, will remain in place."
        },
        {
            "text": "If you want to read more about these issues, we have published the Board papers for the September meeting. You can also register to watch the Board meeting."
        },
        {
            "heading": 1,
            "text": "Diweddariad ar gyfarfod nesaf Bwrdd yr ASB"
        },
        {
            "text": "Gobeithio eich bod wedi mwynhau’r haf. Mae wedi bod yn gyfnod prysur i’r Asiantaeth Safonau Bwyd (ASB) ers ein diweddariad diwethaf i randdeiliaid, gyda chyhoeddiadau cadarnhaol ar ein gwaith i reoleiddio’r farchnad CBD a’r frwydr barhaus yn erbyn troseddau bwyd. Ar ddechrau mis Awst, gwnaethom lansio galwad gyhoeddus am dystiolaeth i asesu a yw cytundeb masnach newydd y llywodraeth ag India yn cynnal mesurau diogelu statudol ar gyfer iechyd pobl, gan gynnwys diogelwch bwyd a maeth."
        },
        {
            "text": "Rydym hefyd yn falch iawn ein bod wedi penodi chwe aelod newydd i Fwrdd yr ASB, a bydd pedwar ohonynt yn ymuno â ni am y tro cyntaf yng nghyfarfod nesaf y Bwrdd ar 17 Medi yn Belfast. Bydd cyfarfod y Bwrdd ym mis Medi yn ymdrin ag ystod eang o waith yr ASB – o ddiweddariad blynyddol ar wyddoniaeth yn yr ASB, i adolygiad o’n gwaith ar orfodi gofynion lles anifeiliaid mewn lladd-dai dros y flwyddyn ddiwethaf. Bydd y Bwrdd hefyd yn trafod ein hasesiad diweddaraf o berfformiad awdurdodau lleol, sy’n sicrhau bod hylendid bwyd a safonau bwyd yn cael eu cynnal ar draws bron i 600,000 o fusnesau bwyd yn y DU.  "
        },
        {
            "text": "Bydd fy niweddariad i’r Bwrdd, a fydd yn cael ei gyhoeddi ddydd Llun, yn trafod cyhoeddiad diweddar Defra am wiriadau ar y ffin, yn ogystal â phynciau eraill. Ni fydd gwiriadau ychwanegol yn cael eu cyflwyno bellach ar fewnforion anifeiliaid byw o’r UE, ac ar nwyddau anifeiliaid a phlanhigion penodol o Iwerddon. Mae hyn yn dilyn y cytundeb gyda’r UE i ddilyn dull newydd o arolygu ffiniau. Bydd y gwiriadau a gyflwynwyd ym mis Ionawr y llynedd, gyda’r ASB yn rhoi mewnbwn ar risgiau diogelwch bwyd a bwyd anifeiliaid ar y ffin, yn parhau i fod ar waith."
        },
        {
            "text": "Os ydych chi eisiau darllen mwy am y materion hyn, rydym newydd gyhoeddi papurau’r Bwrdd ar gyfer cyfarfod mis Medi yma. Gallwch hefyd gofrestru i wylio cyfarfod y Bwrdd yma."
        }
    ]
}