{
    "url": "https://civilservice.blog.gov.uk/2022/01/25/civil-service-awards-2021-dwps-evolution-of-inclusion/",
    "title": "Civil Service Awards 2021: DWP's evolution of inclusion",
    "authors": [
        "Civil Service Blog Team"
    ],
    "categories": [
        "A great place to work",
        "A Modern Civil Service",
        "A Skilled Civil Service",
        "An Ambitious Civil Service"
    ],
    "pub_date": "2022-01-25T12:11:03+00:00",
    "content": [
        {
            "heading": 3,
            "text": "The Diversity and Inclusion team in the Department for Work and Pensions paves the way for civil servants in the North East to achieve successful careers."
        },
        {
            "text": "‘Diversity’ and ‘inclusion’ may look to some like a) a dance group, b) corporate buzzwords, or c) a box-ticking exercise for employers - but what does it actually mean in reality? And how is it done well?"
        },
        {
            "text": "Well, look no further than this fantastic team in DWP. The team was chosen by a panel of scrupulous judges to be worthy winners of this Civil Service Diversity and Inclusion Award recognising the tangible outcomes and positive impact that an effective D&I strategy can have on an organisation."
        },
        {
            "text": "Joanne Gartland, Service Leader for Universal Credit Support and Engagement Centres, was determined to make a difference to DWP, improving the way staff were treated and supported, regardless of background. After securing a D&I lead to take on the project, the journey to help the North East Centres embrace inclusivity began."
        },
        {
            "text": "With the pandemic seeing a rise in inquiries and applications for Universal Credit, 1,600 temporary staff were recruited to support the public during this challenging time. Many had very little experience of DWP, and fewer than 10% were from an ethnic minority background."
        },
        {
            "text": "Promoting diversity"
        },
        {
            "text": "“A Modern Civil Service should reflect the communities it serves,” says Jo, “and to do this it needs to encourage and promote the diversity of its workforce.”"
        },
        {
            "text": "To ensure DWP harnessed this talent, the team produced a Diversity & Inclusion strategy and Capability Plan. These ensured that employees had equal opportunities to access the support they needed to unlock their potential and thrive in the organisation."
        },
        {
            "text": "Sixty apprentices, 1,900 trained staff on career development, and 140 applicants to a new talent programme later, the project has seen huge success in the department and has prompted high praise and pledges from its senior leadership."
        },
        {
            "text": "Accomplish great things"
        },
        {
            "text": "One beneficiary of the programme says: “I started my DWP Social Mobility Apprenticeship in Universal Credit, after serving three years in prison. I do not feel like an outsider or any different, [which is] testament to DWP values and the working environment developed in Quarry House… It shows that no matter your past, you can always change and accomplish great things.”"
        },
        {
            "text": "But that’s not the end of the journey. “The Civil Service needs to prioritise its recruitment and ensure it is fully inclusive,” reminds Jo. “We’re increasingly living and breathing our values, as shown through the delivery of our Diversity & Inclusion plan and that is moving the national conversation on this forward.”"
        }
    ]
}