{
    "url": "https://civilservice.blog.gov.uk/2022/01/25/civil-service-awards-2021-all-aboard-the-data-train/",
    "title": "Civil Service Awards 2021: All aboard the data train",
    "authors": [
        "Civil Service Blog Team"
    ],
    "categories": [
        "A great place to work",
        "A Modern Civil Service",
        "A Skilled Civil Service",
        "An Ambitious Civil Service",
        "An Innovative Civil Service"
    ],
    "pub_date": "2022-01-25T09:37:36+00:00",
    "content": [
        {
            "heading": 3,
            "text": "The Analyst and Data teams from the Department for Transport have been responsible for helping you navigate your journey through the behaviours of coronavirus."
        },
        {
            "text": "The pandemic has highlighted many things in society; one of these is the importance of having accurate, substantiated data that guides us to live and work as safely as possible."
        },
        {
            "text": "It was crucial to know how the travelling public were responding to changes in regulations, and how people were moving about the country when outbreaks occurred in local areas.\n"
        },
        {
            "text": "DfT’s award-winning statistics and data teams worked with the central crisis response team to transform the way it handles and produces the data and insight the government uses to initiate and review effective policy to protect public health - and did this over just a matter of days! "
        },
        {
            "text": "Typically, data produced on transport could have a lag of a few months, but for a nation in the grip of COVID-19, and with the public desperate for a way forward, there is no option other than to have absolute real-time data. This is what the team managed to achieve, through innovative approaches and new partnerships and methods to keep the country moving safely. And now their achievements have been recognised by the Civil Service award for Evaluation and Analysis."
        },
        {
            "text": "Awards judges!"
        },
        {
            "text": "“It is a proud moment for a large, diverse range of people across many teams and functions, to recognise what we achieved when we can come together, innovated at pace and made a difference with data and analysis.” - Abby Sneade, Head of Unit, People Analytics"
        },
        {
            "text": "The team reckons the judges were swayed by their cross-discipline and innovative approach. By repurposing data from various transport ticketing systems, working with academia and other new industry partners to unlock novel data sources, and using telecoms to generate estimates in transport uses, the team has utilised all kinds of avenues to aid"
        },
        {
            "text": "Decision-making"
        },
        {
            "text": "“It’s always lovely to get recognition, especially given the wide range of people involved, and especially when it is in the context of the excellent work all departments have been doing,” says Abby, adding that she is “happy, happy, happy” about the team’s win."
        },
        {
            "text": "Although there was no celebration to mark the occasion, the team hope they will be able to get together soon to belatedly celebrate their well-deserved win."
        }
    ]
}