{
    "url": "https://insolvencyservice.blog.gov.uk/2022/01/25/drafting-the-dissolved-powers-bill/",
    "title": "Drafting the Dissolved Powers Bill",
    "authors": [
        "Jessica Bradbury"
    ],
    "categories": [
        "Insolvency profession",
        "Policy",
        "Rating (Coronavirus) and Directors Disqualification (Dissolved Companies) Act"
    ],
    "pub_date": "2022-01-25T09:23:18+00:00",
    "content": [
        {
            "text": "Hi, I’m Jess, and I'm a Senior Policy Advisor and Bill Manager at the Insolvency Service. Most recently, I was Bill Manager for the Rating (Coronavirus) and Directors Disqualification (Dissolved Companies) Act, which received Royal Assent on 15 December 2021."
        },
        {
            "text": "Following on from the Corporate Insolvency and Governance Act 2020, this was our second Bill in as many years. Although it was much, much smaller – a mere 12 pages instead of 255 – it was still a vital addition to the insolvency and enforcement framework."
        },
        {
            "heading": 2,
            "text": "Looking at ways to recover funds"
        },
        {
            "text": "The pandemic posed unprecedented problems and risks to every facet of our lives. While we stayed at home to stay safe, businesses struggled to stay afloat while restrictions were in place. As a result, Government put forward the Bounce Back Loan scheme and other pandemic support measures to shore up businesses until restrictions were lifted and the economy could begin to recover."
        },
        {
            "text": "Unfortunately, while the majority of applications for support were made in good faith and subsequently resulted in businesses surviving the lockdowns and restrictions, some decided to abuse that support."
        },
        {
            "text": "In early 2021, the Government began to look at ways of  recovering funds or penalising those who had defrauded the generous pandemic support schemes. One such measure, on which we had consulted in 2018, was the ability to investigate the conduct of former directors of dissolved companies."
        },
        {
            "heading": 2,
            "text": "Tackling phoenix companies"
        },
        {
            "text": "We had initially proposed this measure to tackle “phoenixing”, where one company is dissolved only for another to spring up doing the same thing, but without the debts. Frequently, this happens at the expense of small trade creditors or employees."
        },
        {
            "text": "While the Insolvency Service has long had the ability to tackle rogue directors of “live” companies or those that are subject to insolvency proceedings, we could only look into dissolved companies by restoring them to the Companies House register and then petitioning for insolvency."
        },
        {
            "text": "This isn’t just a time-consuming process, but an extremely costly one. By introducing this new power to investigate dissolved company directors, we would be empowered to tackle dissolved company directors without unnecessary delay and expense."
        },
        {
            "text": "Unfortunately, the need for this power grew as we began to see indications of some companies abusing the dissolution process in order to dodge paying back their Bounce Back Loans, or to avoid investigation into how their pandemic support funds might have been misused."
        },
        {
            "heading": 2,
            "text": "Preparing the new Bill"
        },
        {
            "text": "Once it was clear that this power could help, we found ourselves – with flashbacks to the previous year’s emergency Bill – again preparing primary legislation at speed."
        },
        {
            "text": "In order to ensure the measure could get before Parliament, we joined forces with another policy being led by the Department of Levelling Up Housing and Communities, about the impact of the pandemic on Business Rates."
        },
        {
            "text": "With less than two weeks to get ready for our draft law to be scrutinised by the Parliamentary Business & Legislation Committee, we worked closely with policy colleagues in HM Treasury, Cabinet Office, the Department for Levelling Up, Housing, and Communities, and our parent department BEIS to put the two halves of the Bill together."
        },
        {
            "heading": 2,
            "text": "The Bill is delivered to Parliament"
        },
        {
            "text": "As well as delivering our Bill to Parliament on a very expedited timetable, our “dual topic” Bill posed its own new challenges: two very different topics to keep clear in the minds of Parliamentarians, two different Ministerial teams, two groups of stakeholders to keep informed, and so on. Despite keeping the work between teams relatively separate, I still know far more information about Business Rates than I ever thought I’d need to!"
        },
        {
            "text": "Once introduced to the House of Commons, our Bill moved at a more normal pace through Parliament and  I’ll admit that it felt like something of a luxury to have 6-7 months rather than 6 weeks for Parliamentary scrutiny."
        },
        {
            "text": "The disqualification measure was generally well received by Parliamentarians and stakeholders alike. In particular, at Public Bill Committee, we were immensely grateful for the support of organisations like UK Finance and the Chartered Institute of Credit Management, as well as the expertise of Dr John Tribe from the University of Liverpool."
        },
        {
            "text": "We were also well supported by our fellow Insolvency Service colleagues in the Investigation and Enforcement directorate, who we worked with to ensure the policy could be put to operational use as soon as possible."
        },
        {
            "heading": 2,
            "text": "Tackling directors who abuse the process"
        },
        {
            "text": "Following 9 months of Parliamentary scrutiny and the Bill turning into Act following Royal Assent, I am happy and proud to pass the dissolved company director disqualification measure over to our colleagues in the Investigation and Enforcement Services directorate, who have prepared and are ready to bring the policy to life."
        },
        {
            "text": "Everyone’s aim is to use this measure to tackle directors who abuse the dissolution process to attempt to avoid paying liabilities to staff, creditors, taxpayers, as well as those who avoid repayment of Bounce Back Loans and exploited the COVID-19 support schemes."
        },
        {
            "heading": 2,
            "text": "Publicising the outcomes"
        },
        {
            "text": "If you want to read more about what we do, we publicise the detail and outcomes of cases on our GOV.UK news and communications page. Here you'll find all the latest news on cases where directors have abused the dissolution process, as well as news stories on all the other great work we do on delivering economic confidence by tackling financial wrongdoing."
        },
        {
            "heading": 3,
            "text": "Further information"
        },
        {
            "text": " "
        },
        {
            "text": " "
        }
    ]
}