{
    "url": "https://food.blog.gov.uk/2022/01/25/emily-miles-stakeholder-update-morrisons-milk-and-use-by-dates/",
    "title": "Emily Miles' stakeholder update - Morrisons, milk, and use-by dates",
    "authors": [
        "Emily Miles, Chief Executive"
    ],
    "categories": [
        "Business guidance",
        "Foodborne disease"
    ],
    "pub_date": "2022-01-25T10:29:00+00:00",
    "content": [
        {
            "text": "Cymraeg"
        },
        {
            "text": "FSA Chief Executive Emily Miles discusses Morrisons' recent news on using best before dates on some of its milk products."
        },
        {
            "text": " "
        },
        {
            "text": "Happy New Year to you from all of us at the FSA."
        },
        {
            "text": "The recent announcement that supermarket chain Morrisons is moving from use-by to best-before dates on its milk has generated some interest."
        },
        {
            "text": "This decision, which follows a similar move by Arla in 2019, is aimed at reducing the amount of milk thrown away every year unnecessarily."
        },
        {
            "text": "At the FSA, we welcome efforts to reduce food waste. We work closely with organisations like WRAP to encourage consumers to think carefully about their food purchases and how they can avoid waste."
        },
        {
            "text": "We are also clear that food businesses must make sure the right date label is applied to their products to help consumers make informed choices and stay safe."
        },
        {
            "text": "A best-before date is about the quality of the product and could be read as ‘best quality before’. Use-by dates are used for products that could be unsafe if left for too long, and could be read as ‘use by or you may get sick’."
        },
        {
            "text": "Whether milk will need a use-by or best before date will depend on the degree of processing, and a robust assessment of the microbiological risk by the food business."
        },
        {
            "text": "The FSA recommends that people only use sensory tests, like the ‘sniff test’, for foods with a best before date. If the product has a use-by date, the sniff test is not reliable. People can’t always smell the bugs that cause food poisoning."
        },
        {
            "text": "Back in 2016, we recorded a video so that people could get authoritative advice about use-by and best-before dates. It’s still relevant in 2022."
        },
        {
            "text": "We have a lot of further video content which explains food issues simply. Last year, for instance, we covered gene editing and the new labelling laws for food that is prepacked for direct sale. Feel free to use the ‘FSA Explains’ videos as a resource through your organisations and with your networks, if helpful."
        },
        {
            "text": "The FSA will continue to offer advice to consumers and businesses throughout 2022 so that we all have food we can trust."
        },
        {
            "heading": 2,
            "text": "Diweddariad i randdeiliaid gan Emily Miles - Morrisons, llaeth, a dyddiadau ‘defnyddio erbyn’"
        },
        {
            "text": "Emily Miles, Prif Weithredwr yr ASB, yn trafod newyddion diweddar Morrisons ar ddefnyddio dyddiadau ‘ar ei orau cyn’ ar rai o'i gynhyrchion llaeth"
        },
        {
            "text": "Blwyddyn Newydd Dda i chi oddi wrth bawb yn yr Asiantaeth Safonau Bwyd (ASB).Mae’r cyhoeddiad diweddar bod archfarchnad Morrisons wedi penderfynu rhoi dyddiadau ‘ar ei orau cyn’ ar laeth yn hytrach na dyddiadau ‘defnyddio erbyn’ wedi ennyn peth diddordeb."
        },
        {
            "text": "Mae'r ASB yn argymell bod pobl ond yn defnyddio profion synhwyraidd, fel y ‘prawf arogli’ ar gyfer bwydydd sydd â dyddiad ‘ar ei orau cyn’. Os oes gan y cynnyrch ddyddiad ‘defnyddio erbyn’, nid yw'r prawf arogli yn ddibynadwy. Ni all pobl arogli'r bygiau sy'n achosi gwenwyn bwyd bob amser."
        },
        {
            "text": "Yn 2016, gwnaethom ni greu fideo fel bod pobl yn gallu cael cyngor awdurdodol ar ddyddiadau ‘defnyddio erbyn’ a dyddiadau ‘ar ei orau cyn’. Mae’n dal yn berthnasol yn 2022."
        },
        {
            "text": "Rydym ni wedi creu llawer o fideos sy'n esbonio materion bwyd mewn ffordd syml. Y llynedd, er enghraifft, gwnaethom drafod golygu genynnau a'r gyfraith labelu newydd ar gyfer bwyd sydd wedi'i becynnu ymlaen llaw i'w werthu'n uniongyrchol. Mae croeso i chi ddefnyddio fideos 'ASB yn Esbonio' fel adnodd o fewn eich sefydliadau a gyda'ch rhwydweithiau, os ydyn nhw'n ddefnyddiol."
        },
        {
            "text": "Bydd yr ASB yn parhau i gynnig cyngor i ddefnyddwyr a busnesau drwy gydol 2022 fel bod gennym ni i gyd fwyd y gallwn ymddiried ynddo."
        }
    ]
}