{
    "url": "https://educationhub.blog.gov.uk/2022/01/25/how-we-plan-to-improve-school-attendance-following-the-covid-19-pandemic/",
    "title": "How we plan to improve school attendance following the COVID-19 pandemic",
    "authors": [
        "media officer"
    ],
    "categories": [
        "Attendance",
        "Coronavirus",
        "Schools",
        "Secondary schools"
    ],
    "pub_date": "2022-01-25T15:44:31+00:00",
    "content": [
        {
            "text": "Face-to-face education is important in helping pupils to fulfil their potential. During school time we believe pupils should be in class with their teachers and peers and enjoying all the benefits that brings."
        },
        {
            "text": "School attendance has obviously been affected by the pandemic – new data shows 87.4% of pupils attended school last week – but even before the pandemic there were issues that meant pupils who should be in school weren’t attending as regularly as they should."
        },
        {
            "text": "That’s why we are setting out a series of measures to help support schools to drive up attendance and help pupils and families overcome whatever obstacles they are facing."
        },
        {
            "text": "Here’s what you need to know about the new measures to increase attendance in schools."
        },
        {
            "heading": 3,
            "text": "What have you announced? "
        },
        {
            "text": "At the moment different schools in different areas tackle attendance differently and with varying degrees of success."
        },
        {
            "text": "We want to end that postcode lottery, so parents and teachers are being asked for their views. This will help us build a better picture of what works and what doesn’t and share best practice throughout the system."
        },
        {
            "text": "We are also asking all schools to set out an attendance policy that will detail how they can support pupils to attend as regularly as possible."
        },
        {
            "text": "To support staff, the proposals include guidance on when and how legal intervention including penalty notices are used in promoting good attendance by local authorities."
        },
        {
            "text": "This will make sure that interventions like fines are always used when all other options have been explored."
        },
        {
            "heading": 3,
            "text": "Why have you announced these measures? "
        },
        {
            "text": "Absence due to Covid is unavoidable but the disruption to education caused by the pandemic has exacerbated some of the issues that resulted in pupils missing school avoidably"
        },
        {
            "text": "Our new proposals will end the postcode lottery of how attendance is managed in different schools and parts of the country, and make sure every child and family gets the best possible support to attend school as regularly as possible."
        },
        {
            "text": "The number of pupils persistently absent increased to 501,642 in secondary schools in autumn 2020, compared with 454,167 in 2019, not including non-attendance in Covid circumstances."
        },
        {
            "text": "The latest data shows a radically different approach to sanctions across the country, with some local authorities issuing no fines in 2020/21, while others issued over 1,500. The new standards will make sure interventions such as fines are always used when all other options have been explored."
        },
        {
            "heading": 3,
            "text": "So how will it work? "
        },
        {
            "text": "From Tuesday 25 January, schools are being asked to sign up to a new real-time attendance data collection trial."
        },
        {
            "text": "Data will be gathered directly from school registers, potentially helping schools, academy trusts, local authorities and central government spot and address system-wide issues more quickly if the trial is successful."
        },
        {
            "text": "Local authorities and academy trusts will be expected to have plans for how they will provide targeted support for pupils who need it and work with schools to help spread best practice across the school system in driving good attendance."
        },
        {
            "text": "The Children’s Commissioner is also working with a number of local authorities to review interrogate their data and step-up efforts to support children that are persistently absent from school."
        },
        {
            "text": " "
        }
    ]
}