{
    "url": "https://educationhub.blog.gov.uk/2022/01/how-we-are-providing-more-support-for-schools-and-students-as-plan-b-covid-measures-come-to-an-end/",
    "title": "How we are providing more support for schools and students as plan B Covid measures come to an end",
    "authors": [
        "mediaofficer"
    ],
    "categories": [
        "Coronavirus",
        "Schools"
    ],
    "pub_date": "2022-01-25T15:37:00+00:00",
    "content": [
        {
            "text": "Last week, the Prime Minister announced the end of plan B Covid measures. To support schools as the measures come to an end, we have announced new funding for schools to help ensure our schools remain safe."
        },
        {
            "text": "These measures – enhanced ventilation, vaccines, as well as regular testing – remain crucial to keeping young people in classrooms, learning face-to-face."
        },
        {
            "heading": 3,
            "text": "What have you announced? "
        },
        {
            "text": "This week we have announced, new funding from NHS England to make sure all schools are able to fully support the in-school vaccination programme, and a commitment to provide air cleaning units in all classrooms and teaching spaces that need them"
        },
        {
            "heading": 3,
            "text": "How much is the funding? "
        },
        {
            "text": "We will distribute a total of £8 million in funding from NHS England to support secondary schools with the vitally important in-school vaccination programme for young people – hosting NHS vaccination teams and passing on materials about vaccination."
        },
        {
            "text": "This comes as over 50% of 12-15-year-olds – over 1.5 million people – have now had at least one dose of the vaccine."
        },
        {
            "text": "Doe this include funding to help ventilate my child’s classroom? "
        },
        {
            "text": "Yes. The government is committing to fulfil all eligible applications from 1,288 state-funded education settings for just over 8,000 air cleaning units."
        },
        {
            "text": "This is in line with the government’s expectations and initial order of 8,000 units. Up to an additional 1,000 units have now been ordered bringing the total purchase to up to 9,000, allowing all eligible applications to be fulfilled."
        },
        {
            "text": "This ensures poorly ventilated classrooms or teaching spaces where there are no immediate solutions to otherwise improve ventilation will benefit from a device."
        },
        {
            "text": "Special schools and Alternative Provision have already received the air cleaning units they applied for, while all other settings with eligible applications will receive them as planned from the start of February."
        },
        {
            "heading": 3,
            "text": "What else is the new funding going towards? "
        },
        {
            "text": "The funding for schools to continue to support the vaccine programme will provide secondary schools, special schools and alternative provision hosting vaccination teams with a one-off payment of £1,000 with an additional uplift based on pupil numbers."
        }
    ]
}