{
    "url": "https://digitaltrade.blog.gov.uk/2022/01/25/how-to-continue-your-professional-development-in-the-civil-service/",
    "title": "How to continue your professional development in the Civil Service",
    "authors": [
        "Amanda Elmitt, Data Strategy and Capability Lead",
        "Joanne Granton, Capability Lead"
    ],
    "categories": [
        "Apprentices",
        "Careers",
        "Culture",
        "People and Skills"
    ],
    "pub_date": "2022-01-25T11:52:57+00:00",
    "content": [
        {
            "text": "In the Digital, Data and Technology (DDaT) team, we strive towards a learning environment where our people continuously develop to be their best and deliver against the strategic vision of the Department for International Trade (DIT). For us, learning and development (L&D) means personal choice and self-empowerment, providing our employees with tangible opportunities for growth."
        },
        {
            "text": "Learning and development is a lifelong process and, as the Capability team in DDaT, we are here to help everyone on that journey. We provide the stepping stones to help people reach their next career goal, supporting them as they grow and change."
        },
        {
            "text": "Induction learning is the first step for all new joiners. It is important in ensuring corporate identity, getting to know your team, personal wellbeing, and sharing what learning and development is best suited to your career journey."
        },
        {
            "heading": 3,
            "text": "Opportunities available in the DDaT team"
        },
        {
            "text": "There is a wide range of learning available in DDaT."
        },
        {
            "text": "We offer:"
        },
        {
            "text": "Learning delivery is blended and we follow Civil Service and L&D Industry best practice. We do this by combining bite size activities with workshops, virtual sessions, free courses and learning within your Community of Practice."
        },
        {
            "text": "We are currently working to develop knowledge transfer opportunities across DDaT through Communities of Practice, job shadowing, and mentoring or coaching, creating opportunities to learn through collaboration, explore new areas of work, and to meet new teams. For mentors and coaches, it empowers and encourages them to become the expert while developing their communication skills and widening their networks."
        },
        {
            "text": "New and exciting learning opportunities are always being developed. These include a DDaT Line Manager Programme, Micro-behaviours and objective-setting workshops. We are launching training initiatives specific to DDaT teams, such as learning about producing data dashboards. To support colleagues’ preparation for promotions into a more senior position, we run bespoke Leadership and Management Apprenticeships."
        },
        {
            "heading": 3,
            "text": "Support on offer"
        },
        {
            "text": "A benefit of joining DDaT in DIT is the time allowed to complete learning. Learning is fully funded, with a supportive community of peers to help and guide you through the personal and professional learning you need to perform at your best."
        },
        {
            "text": "Your manager and Head of Profession will support you through career conversations and share development opportunities with you to allow you to further your career. This could be a sideways move, a promotion or creating depth in your current role. Our Line Managers have access to a core learning offer built around coaching, leadership and great line management to ensure that they are the best."
        },
        {
            "heading": 6,
            "text": "Joanne (left) and Amanda (right) from the Capability team"
        },
        {
            "text": "In the Capability team, we have a wide range of experience working within the Civil Service and large organisations. We are a team of HR professionals who constantly look to improve what we do to and how we do it, supported by evaluation. Between us, we share a range of professional accreditations and qualifications including Chartered Institute of Personnel and Development (CIPD) and Chartered Management Institute (CMI)."
        },
        {
            "text": "We work across the Civil Service and link into industry best practice. Measurements and metrics are embedded within our learning offer to evaluate personal and business impact. Whether early, mid, or senior career, we care about people's career paths, learner journeys, and development opportunities and we never stand still!"
        },
        {
            "text": "We connect with other government departments to build sustainable learner journeys, while collaborating with internal DIT teams to build a career framework for all professions. This provides the opportunity for people to explore possible new career routes."
        },
        {
            "heading": 3,
            "text": "Prioritising our people"
        },
        {
            "text": "Learning and development is important to us all. It gives us the skills to adapt to the changes happening in our professions and workplace. It also increases confidence and credibility, and helps us reach career goals and cope with industry change by constantly updating our skill set."
        },
        {
            "text": "Whether you are joining DIT as a DDaT professional or from another profession, we are here to support you on your career journey. Enabling your development allows us to deliver outstanding products and services that help UK businesses to export and grow into global markets, and overseas companies locate and expand here in the UK."
        }
    ]
}