{
    "url": "https://ruralpayments.blog.gov.uk/2022/01/25/key-dates-to-look-out-for-in-2022/",
    "title": "Key dates to look out for in 2022",
    "authors": [
        "RPA Editor"
    ],
    "categories": [
        "Basic Payment Scheme",
        "Countryside Stewardship",
        "Environmental Stewardship"
    ],
    "pub_date": "2022-01-25T10:12:37+00:00",
    "content": [
        {
            "text": "Ahead of Countryside Stewardship 2022 applications opening next month, we’ve published the Key dates for 2022 document on GOV.UK."
        },
        {
            "text": "It shows you important dates in 2022 for Basic Payment Scheme (BPS), Countryside Stewardship (CS) and Environmental Stewardship (ES), so you can start to plan ahead for your applications and claims."
        },
        {
            "text": "Here are some of the main dates for our schemes this year:"
        },
        {
            "heading": 3,
            "text": "Basic Payment Scheme applications"
        },
        {
            "text": "15 March – BPS applications open. All guidance available on GOV.UK.\n16 May – last day to submit a BPS application without penalty. This is also the deadline to transfer BPS entitlements for 2022.\n10 June – last day to submit a late BPS application, with penalty. This is also the deadline for making certain changes without penalty to a BPS application that was submitted by 16 May."
        },
        {
            "heading": 3,
            "text": "Countryside Stewardship applications"
        },
        {
            "text": "8 February – applications open for Higher Tier, Mid Tier, Wildlife Offers, Protection and Infrastructure, and Capital Grants.\n31 March – last day to request a Higher Tier application pack (paper or online.)\n29 April – last day to submit a Higher Tier application.\n27 May – last day to request a paper application pack for Mid Tier or Wildlife Offers. There’s no need to request an application pack if you’re applying online.\n29 July – last day to apply for Mid Tier or Wildlife Offers."
        },
        {
            "heading": 3,
            "text": "Countryside Stewardship/Environmental Stewardship revenue claims"
        },
        {
            "text": "15 March – CS/ES revenue claims open.\n16 May – deadline for submitting a CS or ES revenue claim without penalty.\n31 May – last day to make certain changes to a CS or ES revenue claim that was submitted by 16 May without receiving a reduction.\n10 June – last day to submit a late CS or ES revenue claim."
        },
        {
            "text": "Go to GOV.UK to read the key dates in full and download a PDF copy."
        }
    ]
}