{
    "url": "https://mojdigital.blog.gov.uk/2022/01/25/supporting-the-moj-social-mobility-strategic-plan-schools-outreach-in-yorkshire/",
    "title": "Supporting the MoJ Social Mobility Strategic Plan - Schools Outreach in Yorkshire",
    "authors": [
        "Nathan Leahy"
    ],
    "categories": [
        "a great place to work",
        "Diversity and Inclusion",
        "Social Mobility"
    ],
    "pub_date": "2022-01-25T15:01:56+01:00",
    "content": [
        {
            "text": "“For the MoJ to thrive as an organisation, it must reflect the society it serves at every level” - MoJ Social Mobility Strategic Plan 2019-2022"
        },
        {
            "text": "At the heart of the MoJ is the belief that diverse backgrounds can bring fresh perspectives and can help us to meet the challenges of a complex, rapidly changing world. By continuing to support efforts in the social mobility space, we can continue to create a more inclusive, diverse and representative workforce that better reflects society. Recently, I visited a target school in York to meet with students and discuss digital career opportunities in the MoJ and the Civil Service more widely. "
        },
        {
            "text": "Digital and technology skills are at the heart of transforming government. Here in the MoJ, our own Digital and Technology division continues to drive forward a mission to support and transform the justice system. Having the right technology skills on board, and bringing in diverse perspectives, is crucial in achieving that aim. However, many students, especially those from a lower socioeconomic background, are unaware of the potential career paths into digital careers open to them. As a result, we continue to see a deepening national digital skills shortage. For students from disadvantaged backgrounds, a career in digital may feel completely out of reach. "
        },
        {
            "text": "The first challenge for us as a leading digital employer is awareness. Students and teachers alike are unaware of the myriad of career opportunities across the Civil Service in digital and technology. Having attended a comprehensive school in a disadvantaged area of Lancashire, I am acutely aware of the lack of available information and knowledge on careers both in digital, and in the Civil Service more generally. If you had asked me in Year 11 where I saw myself in five years time - I’m sure I wouldn’t have said an Associate Delivery Manager within the MoJ! Reducing this knowledge gap is something I have been incredibly passionate about since starting my career, and a cause I have been excited to work on during my time with the MoJ. "
        },
        {
            "text": "In conversations with students at Millthorpe, one thing became very clear. There are a number of misconceptions and assumptions students have about digital careers. Many believe that you need to go to University, move to London, and that even then most of the roles in the industry required extensive work experience that seemed out of reach. It was great to be able to dispel these misconceptions and share with students the myriad of ways into a career in digital within government. As an employer, the MoJ and the Civil Service more widely have many schemes in place to support students into meaningful and rewarding digital careers, through clearly defined career paths and opportunities such as summer internships, work experience and mentoring."
        },
        {
            "text": "At the career fair, it was great to have meaningful conversations with teachers and local colleges on their push to get students to develop and focus on digital skills through initiatives such as T-Levels, which aim to equip students with practical and vocational skills to set them up for success in the workplace. A number of students commented after the event that they had no idea a career in the Civil Service could be so interesting! I look forward to another school outreach event in Yorkshire towards the end of the month, where I will continue to have conversations with students on how careers in digital, especially within MoJ D&T, are definitely within reach and open to all."
        }
    ]
}