{
    "url": "https://governmentscienceandengineering.blog.gov.uk/2024/09/27/highlights-from-the-government-science-and-engineering-conference-2024/",
    "title": "Highlights from the Government Science and Engineering Conference 2024",
    "authors": [
        "gseprofession"
    ],
    "categories": [
        "Blog Series",
        "Engineering",
        "GSE Opportunities",
        "GSE Profession Updates",
        "Science"
    ],
    "pub_date": "2024-09-27T16:32:21+01:00",
    "content": [
        {
            "heading": 2,
            "text": "Showcasing our science and engineering superheroes"
        },
        {
            "text": "The biennial Government Science and Engineering (GSE) Conference 2024, held on 18 September, was a great opportunity to showcase the science and engineering superheroes in the Profession. The conference brought together Profession members from the civil, crown and public sector to celebrate the theme of the day, ‘an innovative public sector’."
        },
        {
            "text": "Held at the Science Museum in London, and online, the event was packed with keynotes, engaging panel sessions, dynamic turbo talks, posters, the inaugural GSE awards ceremony, and concluded with a networking reception in the exciting Wonderlab exhibit."
        },
        {
            "text": "Keynotes"
        },
        {
            "text": "The conference kicked off with an address by Professor Dame Angela McLean, Government Chief Scientific Adviser and Head of Profession. Her opening remarks emphasised the incredible work happening across the Profession and why it is important to collaborate with one another, which set an inspiring tone for the rest of the conference."
        },
        {
            "text": "Next, the Royal Institution wowed the audience with a fascinating demonstration on a history of electrical innovation – complete with participation from some of our in-person audience, so thank you to the brave volunteers who came on stage to help with the experiments."
        },
        {
            "text": "Panel Sessions"
        },
        {
            "text": "The panel sessions were a major highlight, featuring senior leaders and experts discussing pressing topics such as innovation, AI and Net Zero. One notable session was “Collaboration for a more scientific civil service,” where Professor Dame Angela McLean was joined by Sir Ian Diamond, Government Head of Analysis Function; Tamara Finklestein, Government Head of Policy Profession; and Simon Baugh, Chief Executive of Government Communications Service."
        },
        {
            "text": "The discussion centred around how collaboration between key government groups is essential to achieving our Profession’s goals. Key takeaways from the session included:"
        },
        {
            "text": "The panel's diverse perspectives and practical advice seemed to resonate with the audience, hopefully inspiring many to seek out new collaborative opportunities within their own roles and organisations."
        },
        {
            "text": "Turbo Talks"
        },
        {
            "text": "The Turbo Talks segment of the conference was a dynamic and fast-paced highlight, where speaker had just five minutes to present their ideas. These short and impactful presentations spanned a diverse range of topics, from metascience and native oak trees in the UK to citizen science. A particularly memorable talk was delivered by the UK Space Agency, who showcased their work on removing space junk. All Turbo Talk speakers were GSE members, providing a fantastic opportunity to witness the breadth of work across the Profession.  "
        },
        {
            "text": "Posters on the Flight Deck"
        },
        {
            "text": "The virtual posters were displayed on screens during lunch around the Flight Deck and provided a platform for GSE members to showcase their work in a more informal setting. Attendees had the opportunity to watch the posters on the screen, but also online with the opportunity to vote for the best poster of the conference. Some poster authors were on hand to explain to delegates their work in more depth."
        },
        {
            "text": "GSE Awards Ceremony"
        },
        {
            "text": "The awards ceremony was one of the highlights of the conference, celebrating outstanding contributions to science and engineering across government. There were awards across different categories, with the 2024 Award being the Innovation Award to mark this year’s conference theme. Stacey Rothwell, from Kent Constabulary won the Innovation Award for her pioneering work on using rapid video response on transforming the way police provide a response to victims of domestic abuse. The ceremony was a testament to the incredible talent and innovation within the GSE community."
        },
        {
            "text": "Networking"
        },
        {
            "text": "The conference concluded with a vibrant networking reception, providing attendees with the chance to connect with peers, speakers, and senior leaders. The reception was held in the Wonderlab at the Science Museum. Attendees enjoyed refreshments, live science demonstrations and had the chance to forge new connections."
        },
        {
            "text": "The Government Science and Engineering conference 2024 was a fantastic event that highlighted the breadth of work undertaken by the Profession. We hope the day highlighted our Profession’s science and engineering superheroes and enabled us to celebrate the achievements of GSE members."
        }
    ]
}