{
    "url": "https://defraenvironment.blog.gov.uk/2024/09/27/how-the-national-forest-has-transformed-a-scarred-mining-landscape-to-a-thriving-haven-for-nature/",
    "title": "How the National Forest has transformed a scarred mining landscape to a thriving haven for nature ",
    "authors": [
        "Stuart Dainton"
    ],
    "categories": [
        "Access and engagement",
        "Community",
        "Forestry",
        "Land use",
        "Nature",
        "Wildlife"
    ],
    "pub_date": "2024-09-27T09:49:09+01:00",
    "content": [
        {
            "text": "The National Forest, located in the heart of the Midlands, has always been about finding hope in the face of big challenges, like biodiversity loss and climate change.  "
        },
        {
            "text": "I’m Stuart, Head of Land Management and Estate at the National Forest, and I support landowners to help plant and manage trees across the Forest. I’m passionate about supporting people and nature. "
        },
        {
            "text": "One site, the Minorca Woodland, has been a real example of how local efforts can make a difference for nature, people, and the economy. It shows how small actions, like planting trees and restoring habitats, can have a big impact on creating a more sustainable future. "
        },
        {
            "text": "Restoring Minorca Woods "
        },
        {
            "text": "Minorca Wood is a 175 hectare site between Swepstone and Measham in northwest Leicestershire. It’s part of a broader effort to transform areas affected by mining into thriving green spaces. These new habitats are a lifeline for local wildlife. "
        },
        {
            "text": "Minorca’s history is rooted in mining, which left its mark on the landscape. The mining took a toll, leaving parts of the area damaged and affecting the environment around it. Now, thanks to careful planning, the site is being restored to bring natural beauty. This restoration doesn’t just mean new woodlands but also connecting the site to nearby forests and habitats, creating larger spaces for wildlife to thrive. "
        },
        {
            "text": "In restoring the site, a great deal of thought went into which trees to plant. A mix of broadleaves and conifers have been chosen to create a balance for wildlife and help soak up carbon, which is great for tackling climate change and nature. For example, over 22,000 native trees and shrubs, like field maple, alder, birch, aspen, and rowan, were planted in the eastern part of Minorca. The goal was to create a woodland area that blends smoothly into the surrounding farmland. It’s about making sure the landscape feels connected.  "
        },
        {
            "text": "It’s not just about trees, though. New parkland, wetland ponds, and wildflower seeding areas are being added to attract a variety of birds, like tree sparrows, song thrushes, linnets, and yellowhammers. Wildflowers have been sown along the site’s edges, which not only make the area more colourful but also attract essential pollinators such as bees and butterflies. Plus, there are new public footpaths and bridleways for off-road walking and riding, making the area more accessible for all. "
        },
        {
            "text": "The Minorca East woodland is also part of an exciting research project. The University of Nottingham is testing biochar there, which is basically organic material that has been carbonised under high temperatures in the presence of little, or no oxygen. When added to the soil, it locks carbon in and we are monitoring plant growth and nutrients to determine the added benefits. This field trial is being extended to other parts of the site to learn more about sustainable land management. "
        },
        {
            "text": "Transformational results "
        },
        {
            "text": "All these efforts are paying off, bringing new life to an area where biodiversity was once in decline. We’ve gone from a dark, industrial landscape to a vibrant green one, all while creating spaces where nature can thrive, people can enjoy, and local communities can take pride in. "
        },
        {
            "text": "Minorca is now a place where animals can graze, wildlife can flourish, and new ideas about sustainability are being tested. It’s not just about planting trees but about making sure the area supports life in many ways. It’s also about making nature accessible to people, whether they want to take a peaceful walk, ride horses, or learn more about the environment. "
        },
        {
            "text": "The transformation of Minorca is a story of hope and possibility. It shows how, by working together and thinking long-term, we can turn even the most damaged environment into something beautiful and sustainable. It’s an example of how local actions can make a big difference for the planet, offering a model for a greener, healthier future for us all. "
        },
        {
            "text": "If you’re interested in finding out more about the Minorca Woods, watch the National Forest video on the site. "
        }
    ]
}