{
    "url": "https://charitycommission.blog.gov.uk/2024/09/27/my-charity-commission-account/",
    "title": "My Charity Commission Account",
    "authors": [
        "Nick Baker, Chief Operating Officer"
    ],
    "categories": [
        "Register",
        "Strategy",
        "Trustees"
    ],
    "pub_date": "2024-09-27T10:42:39+01:00",
    "content": [
        {
            "text": "When people interact with our services, we want this to be as efficient and helpful an experience as possible for them. That’s why we have set an ambition to embrace technological innovation and improve our online services as part of our new five year strategy. "
        },
        {
            "text": "Conscious of the pressures on trustees and their advisors, we have prioritised improving the systems they use to keep their charity’s entry on the Register of Charities up-to-date and file their charity’s financials. Last Summer we made a major change to these online systems, with the intention of helping charities to solve problems they had reported to us and making it easier for charities to engage with us.  "
        },
        {
            "text": "Previously, each charity had a single log-in and password to get into our system, with those details often known to several people, including staff members, third party advisors and potentially people who had subsequently left the charity. Such shared log ins are not what people are now used to when interacting with online platforms, nor was this satisfactory in the long term from a data protection perspective. More fundamentally, we wanted to create an online platform that would help us to build a more bespoke, two-way relationship with the people who are responsible for the charities we regulate.  "
        },
        {
            "text": "The result was the launch of My Charity Commission Account (MCCA). This is a new way for charities to access our online services, offering each trustee or authorised employee an individual login. This means it will also be easier for those who are trustees of multiple charities to see all the information they need on one dashboard. It is now the go-to place for trustees to submit their annual returns and update their charity details. In time, we hope it will also enable a long-term shift whereby individual trustees have a more direct digital connection with us. "
        },
        {
            "text": "The introduction of My Charity Commission Account was a big change for us and for charities. And we’re pleased that a year on, the large majority of charities are now set up on the system.  "
        },
        {
            "text": "But we recognise that, whilst most charities were able to sign up to MCCA without problems, for some people the process has been frustrated by technical or practical difficulties. As our former CEO acknowledged in our recent annual report, despite increased staffing levels, these issues increased volumes of calls and emails into our contact centre, which in turn put pressure on waiting times. These long waits, whilst perhaps not unusual in peoples’ experience of other call centres, are not to the standards we have grown used to providing to charity trustees and staff, and we apologise again to those who were kept waiting. Now call and email volumes are back at more manageable levels, waiting times have reduced significantly. "
        },
        {
            "text": "We are continuing to contact the minority of charities that have not yet signed up for logins to the new system. This is not an entirely new challenge as each year there are charities that stop operating or change details, and we are constantly working to keep the Register of charities up to date. "
        },
        {
            "text": "We have listened to feedback from those who already have accounts or have struggled to set them up and, to make things easier for trustees, we are making incremental changes to the MCCA system. We have already made some improvements, and we will be implementing further tweaks and fixes in the months ahead as we refine the system. And we’ll continue to use both your experience of using MCCA and our experience of rolling the system out to learn lessons and improve how we plan for future changes. "
        },
        {
            "text": "In the long-run, we are confident that MCCA will make it easier for charities to submit information to us, and to engage with us. It is still always advisable for trustees to file their charity’s annual returns in good time ahead of their deadline. This is particularly helpful for charities due to file in October and January, which are our busiest months and when our contact centre is always busier than at other times of the year. And it’s important that, if a charity contact moves on, they ensure that another person in the charity is set up to administer MCCA once they’ve left. There’s advice on this, and other aspects of managing an MCCA account, available on our website. "
        },
        {
            "text": "The launch of MCCA was a significant milestone for the Commission and the sector, and the culmination of years of work and planning. We are grateful to charities for their patience and for all their work to ensure they are keeping their details up to date and filing their annual returns and accounts. We are confident that MCCA will bring long-term improvements in trustees’ relationship with us, supporting charities to be transparent and accountable on our register and, ultimately, helping them to fulfil their essential role in enhancing lives and strengthening society. "
        }
    ]
}