{
    "url": "https://civilservice.blog.gov.uk/2023/06/26/from-paratrooper-to-padre-two-very-different-leaps-of-faith-one-calling/",
    "title": "From Paratrooper to Padre - two very different leaps of faith, one calling",
    "authors": [
        "Julian Hendy-Ibbs is a Parliamentary Casework Officer in the People Secretariat, Defence People Team at the Ministry of Defence"
    ],
    "categories": [
        "A Modern Civil Service",
        "A Skilled Civil Service",
        "An Ambitious Civil Service",
        "An Innovative Civil Service"
    ],
    "pub_date": "2023-06-26T13:45:08+00:00",
    "content": [
        {
            "heading": 3,
            "text": "Following a call to ordination in the Church of England, life took an unusual twist when civil servant Julian Hendy-Ibbs signed up to become a part-time paratrooper"
        },
        {
            "text": "I’m Lance Corporal Julian Hendy-Ibbs, I serve with Signals Platoon, HQ Company, 4PARA based in Pudsey. Previously I was an Air Training Corps cadet and instructor. "
        },
        {
            "text": "I joined both the Civil Service and 4PARA in 2017, passing Pegasus Company in 2019 aged 36. But I passionately felt a calling to serve as a military chaplain and believe I should serve in the frontline Reserves while I train to be an Anglican priest."
        },
        {
            "heading": 4,
            "text": "Maroon beret"
        },
        {
            "text": "Along the way, I’ve experienced many highs and lows. My low point was when a medical issue prevented me from attempting Pegasus Company, (aka P Company) the organisation that run the test week and build up exercises for those in selection to join the UK Airborne Forces. Continuing was difficult but I had the determination to achieve my aim and join the regiment and with a supportive chain of command, we were able to resolve the issue and I passed on my first attempt. Besides, any low points were vastly outweighed by the deep satisfaction on earning the famous maroon beret and parachute wings.  "
        },
        {
            "heading": 4,
            "text": "Special paid leave"
        },
        {
            "text": "It’s all a world away from the day job. I work in the Defence People Team’s secretariat. I currently co-chair the Civil Service Sexual & Domestic Abuse Network and I’m Vice Chair of the Defence Disability Network. The Civil Service gives me at least 15 days special paid leave for training, sometimes at short notice, to fulfil my reservist duties.  "
        },
        {
            "text": "The Reservists Networks, led by Warrant Officer Class 1 Simon Jeffery, provides invaluable support to both the reservist and employer.  If you are reading this and want to visit any Reserves unit CONTACT: simon.jeffery492@mod.gov.uk."
        },
        {
            "heading": 4,
            "text": "Skydiving in California"
        },
        {
            "text": "Since joining 4PARA, I’ve been very fortunate receiving a wide range of opportunities. I’ve completed courses as a team medic, basic radio user as well as a promotion course. The Reserves offers a range of qualifications, some are specific to service others have benefits externally, such as learning to drive. There are also opportunities for adventurous training including courses in skiing, kayak coaching courses and skydiving in the UK and California."
        },
        {
            "heading": 4,
            "text": "Supporting Sudanese evacuation"
        },
        {
            "text": "The reserves gave me the opportunities to travel overseas I attended annual camp in Cyprus last year and jumped into Arnhem in September, working alongside various allied nations.  More recently I deployed to Cyprus supporting the evacuation of British personnel in Sudan, which was done at short notice and support was provided to my family and employer by 4PARA.  "
        },
        {
            "text": "I’ve spotted that since becoming a Reservist, my organisation, communication, leadership skills and confidence - essential skills in both my careers - have improved.  My MOD career has given me a greater understanding about the development of reserve forces policy and our place in the wider armed forces."
        },
        {
            "text": "If you’re a civil servant considering joining the Reserves, go for it! Getting up on a freezing January morning at 5am can be challenging, but the people I’m lucky enough to work with, the friendships formed and exhilaration of seeing the Milky Way as I descend out of an aircraft at midnight are second to none. "
        }
    ]
}