{
    "url": "https://defrafarming.blog.gov.uk/2023/06/26/guest-post-upper-duddon-landscape-recovery/",
    "title": "Guest post: Upper Duddon Landscape Recovery",
    "authors": [
        "Professor Dominick Spracklen"
    ],
    "categories": [
        "Guest post",
        "Payments to restore landscapes and ecosystems"
    ],
    "pub_date": "2023-06-26T12:17:58+01:00",
    "content": [
        {
            "text": "Landscape Recovery supports groups of landowners and managers to take a large-scale, long-term approach to producing environmental and climate goods across their land. "
        },
        {
            "text": "In the first round of Landscape Recovery, £12 million of development funding was awarded to 22 projects. "
        },
        {
            "text": "This money supports plans to restore rivers, boost biodiversity and much more.  "
        },
        {
            "text": "The projects represent hundreds of farmers and landowners working together to deliver significant environmental change. "
        },
        {
            "text": "One such project is the Upper Duddon Landscape Recovery Project, for which I am the project lead. "
        },
        {
            "text": "In this post, I will shine a light on our work."
        },
        {
            "heading": 2,
            "text": "The project "
        },
        {
            "text": "The Duddon Valley is a quiet, remote valley in the Lake District National Park, Cumbria. "
        },
        {
            "text": "William Wordsworth wrote a series of sonnets on the Duddon Valley. He described the beautiful landscape, its plants and animals."
        },
        {
            "text": "Since then, some of the area’s most treasured wildlife has been lost or hangs on in isolated populations.  "
        },
        {
            "text": "Our project aims to restore nature over nearly 3,000 hectares of the Upper Duddon catchment and protect and enhance species native to the area. "
        },
        {
            "text": "The project area stretches from the top of Harter Fell and Cockley Beck down to the hamlet of Seathwaite. "
        },
        {
            "text": "In Upper Duddon, we are proud of our strong farming history, culture and tradition in the valley. "
        },
        {
            "text": "We are designing our project with local farmers, including tenants, so our upland fell farmers have a sustainable and resilient future.  "
        },
        {
            "text": "With farmers, we are developing a way of land management that allows both farming and nature to thrive and makes sure new local job opportunities are created along the way.  "
        },
        {
            "heading": 2,
            "text": "Farming in the Upper Duddon catchment "
        },
        {
            "text": "Farming is central to the community and economy of the Duddon Valley. Generations of farmers have shaped this landscape. "
        },
        {
            "text": "As is the case across much of the Lake District, farming is characterised by sheep and beef production. It is a challenging place to farm with steep slopes, high elevations and limited in-bye land. "
        },
        {
            "text": "5 of the farms involved in the project are managed by tenant farmers including 2 organic farms.  "
        },
        {
            "text": "In recent decades, an increased intensity of farming has caused the loss of species-rich habitats. Areas of peatland were drained, rivers were straightened, flower-rich meadows were lost and increased sheep numbers caused degradation of wood pasture and heathlands. "
        },
        {
            "text": "Local farmers remember the loss of species such as black grouse. These were found here as recently as the 1970s."
        },
        {
            "text": "Over the past 10 years, farmers have worked hard to reverse these declines, with Higher Level Stewardship (HLS) agreements to restore grassland, woodland and heath in some areas.  "
        },
        {
            "heading": 2,
            "text": "Our progress "
        },
        {
            "text": "We're currently in the development phase. In this phase, Landscape Recovery projects have up to 2 years to agree on the detail and get ready for delivery.  "
        },
        {
            "text": "This phase of our project provides an opportunity to build on these efforts and bring about joined-up nature recovery across the valley."
        },
        {
            "text": "We are scoping out ways to farm and manage the land to help nature thrive and recover. "
        },
        {
            "text": "At the end of this phase, local farmers involved in the partnership will have the option to enter a long-term agreement to implement these changes on their land and bring their plans to life. "
        },
        {
            "text": "Through these first 2 years, we are working closely with our partners to restore the land from the River Duddon at 100 metre elevation to over 700 metre elevation in the high fells, connect isolated patches of habitat and help wildlife to move freely across the landscape once more. "
        },
        {
            "text": "The ancient woodlands that span across the Upper Duddon project are home to trees covered in mosses, ferns and lichens that thrive in the clean air, plentiful rainfall and cool summer temperatures. They are our temperate rainforests and one of the rarest types of woodland in the world.  "
        },
        {
            "text": "We aim to restore these woodlands, as well as a rich mosaic of wood pasture, montane scrub, heath, bog and meadows, to allow species like tree pipits, adders and red squirrels to thrive. This gives us the opportunity to explore the possibility of reintroducing water voles, globeflower, black grouse and pine martens to the valley. "
        },
        {
            "text": "During this phase, we’re surveying these habitats and species to help us know where and how to restore and create habitats.  "
        },
        {
            "text": "We are learning more about rare resident species like the dormouse and lesser-known woodland residents such as the hairy wood ant."
        },
        {
            "text": "This undervalued ecosystem engineer has already disappeared from many woodlands in England. We still have a population in the Duddon Valley that we are determined to protect and restore. "
        },
        {
            "text": "With the results of the survey, we can be more confident about our next steps."
        },
        {
            "heading": 2,
            "text": "Working in partnership "
        },
        {
            "text": "We can’t do this alone. Our project has multiple partners and builds on existing projects, involving farmers, landowners and environmental organisations working together. "
        },
        {
            "text": "We have a number of project partners including many local farmers. "
        },
        {
            "text": "Together we are already working towards sustainable and environmentally friendly land management with support from the National Trust and Natural England. "
        },
        {
            "text": "Detailed ecological surveys conducted as part of the development phase will inform discussions around additional management changes that would deliver the biggest benefits for nature."
        },
        {
            "text": " Working with farmers to find ways to integrate these changes into their farming business is crucial. "
        },
        {
            "text": "At the centre of our project, we will work alongside Forestry England to develop a long-term vision to restore Hardknott Forest."
        },
        {
            "text": "Forestry England owns and manages that area. After engaging with people who live and enjoy the area, it created a plan to restore the forest to native woodland, bogs and open ground. "
        },
        {
            "text": "Crucially, the Landscape Recovery project allows us to work together to blur harsh boundaries between the forest and farmed landscape, further enhancing the valley’s natural beauty, and increasing its resilience to pests, diseases and climate change. "
        },
        {
            "text": "A water treatment works on the River Duddon provides clean water for over 20,000 people in South Cumbria. The South Cumbria Rivers Trust is part of the project, looking to explore opportunities for river restoration on the upper Duddon River and its tributaries.  "
        },
        {
            "text": "Re-naturalising and restoring the river will reduce the risk of flooding and improve the reliable supply of clean water from this facility. In addition to the benefits to the local community, restoring the river will also improve the habitat for European eel, salmon, brown trout and otters. "
        },
        {
            "text": "Our project also contributes to the South Cumbria Pine Marten Recovery Project through The University of Cumbria’s Back On Our Map project. "
        },
        {
            "text": "A local cliff, Mart Crag, named after the pine marten, provides clues to a rich ecological history when pine marten were found across the Duddon Valley and the Lake District. "
        },
        {
            "text": "We have already started talking to the local community about the opportunities and concerns so that we have well-considered plans for any reintroduction.  "
        },
        {
            "text": "Taken together, the project will protect and enhance the special qualities of the Lake District National Park. We will work with the Lake District Partnership to maintain vibrant communities and support farming and forestry to deliver nature recovery and climate action. "
        },
        {
            "text": "That means giving local people and visitors opportunities to learn new skills, meet like-minded people and contribute to habitat restoration. To achieve that, we will expand the existing Restoring Hardknott Forest volunteer programme and involve students from Millom School.  "
        },
        {
            "text": "We are proud that students will regularly visit, helping with practical restoration, like tree planting. Local primary schools have also visited and set up wildlife cameras. We send them photos of the wildlife captured by their cameras, helping to connect local children to their natural heritage.   "
        },
        {
            "heading": 2,
            "text": "Future funding  "
        },
        {
            "text": "Working to identify potential sources of private finance is crucial to the long-term success of the project. Our multi-partner project presents challenges, but also important opportunities.  "
        },
        {
            "text": "Woodland creation and peatland restoration will sequester and store carbon, providing an important future finance stream through the Woodland Carbon Code and Peatland Carbon Code.   "
        },
        {
            "text": "Conversations with a range of organisations are in their early stages and we are always keen to hear from people interested in supporting the restoration of this iconic landscape and wildlife. "
        },
        {
            "heading": 2,
            "text": "Apply for the second round of Landscape Recovery  "
        },
        {
            "text": "Building on the success of the first round, farmers and land managers are now able to apply for funding through the second round of Landscape Recovery."
        },
        {
            "text": "The deadline to apply is midday 21 September."
        },
        {
            "text": "The post I've linked above also contains a recording of a webinar on Landscape Recovery and an opportunity to sign up for the next one."
        },
        {
            "text": "The second round focuses on projects of at least 500 hectares. This could include landscape scale projects creating and enhancing woodland including temperate rainforest, peatland, nature reserves and protected sites such as ancient woodlands, wetlands and salt marshes. "
        },
        {
            "text": "We look forward to supporting up to a further 25 projects that will be making a positive difference in reaching net zero and supporting valuable habitats as well as continuing to support sustainable food production. "
        },
        {
            "text": "You can learn more about our project by clicking on the link to our site in the box below."
        }
    ]
}