{
    "url": "https://securityprofession.blog.gov.uk/2023/06/26/living-and-working-with-high-function-aspergers-syndrome/",
    "title": "Living and working with high function Asperger's syndrome",
    "authors": [
        "Birju Sonigra",
        "Angela Fisher"
    ],
    "categories": [
        "Government Security",
        "Guest blog",
        "Security and Diversity"
    ],
    "pub_date": "2023-06-26T10:35:42+01:00",
    "content": [
        {
            "text": "We spoke to Dean, the head of personnel security for the Department of Health and Social Care. He was diagnosed with high functioning Asperger syndrome in 2016, when he was in his early 40s.  We discussed how this affects his daily life, the misconceptions about Asperger’s and how managers and colleagues can be more supportive. Thank you Dean for taking the time to shed light on your experiences."
        },
        {
            "heading": 3,
            "text": "What is Asperger’s syndrome?"
        },
        {
            "text": "The National Autistic society classes Asperger’s Syndrome as an Autistic Spectrum Disorder. People with Asperger syndrome see, hear and feel the world differently to other people. They don't have the learning disabilities that many autistic people have, but they may have specific learning difficulties."
        },
        {
            "text": "Asperger syndrome generally involves:"
        },
        {
            "text": "Strengths can include:"
        },
        {
            "text": "Challenges can include:"
        },
        {
            "text": "The tendencies described above vary widely among people. Many learn to overcome their challenges by building on strengths."
        },
        {
            "heading": 3,
            "text": "\nLooking back at your career, the Civil Service and outside, did you ever feel excluded in certain situations? Did you ever feel like you can't take part in things?"
        },
        {
            "text": "“This might be a neurotypical kind of response, but I took steps to remove myself from those social situations before I became excluded. So I almost excluded myself in a lot of those because that was part of my coping mechanism. I thought “this is a difficult situation for me, and I could handle it by not going.”"
        },
        {
            "text": "Social gatherings or being friends with people outside of work is different. I have a very clear demarcation of what is work, and what is not work. I try to keep those separate as much as I can. I would often try not to take part in things like away days."
        },
        {
            "text": "There have been times when I've misread a room, or missed nuances and conversation. Oversharing is a very common one. These are all kinds of factors that would certainly affect my career. I'll pick up on conversations which don’t involve me in any way whatsoever, and then I'll go and introduce myself into that conversation because I overheard it, which sometimes is not very welcome!”"
        },
        {
            "heading": 3,
            "text": "Do you think you removed yourself from situations because you felt a little awkward or that you might be judged?"
        },
        {
            "text": "“I just find them difficult and confusing. They take a lot of effort for me because I will preload every conversation. My mind would already be thinking of conversation trees and where it's gonna go and what I'm going to say next and what you're going to say and what I'm going to say … which takes a lot of time and effort. And then after that, once this conversation's over and I'm at the end of day, I will stay up for a few hours thinking about these interactions. And did I say the right thing? And did I choose the right path on my tree? Was my face reflecting how I felt - it's a combination of all these little things.”"
        },
        {
            "heading": 3,
            "text": "What do you enjoy doing? What drives you?"
        },
        {
            "text": "“I love learning new things no matter what the subject is, honestly it doesn't matter. I will want to learn about it. That's always been particularly helpful because not only do I get to upskill all the time, but I can find areas where security interacts with another team or another department, and suddenly I want to learn everything about that team and that department. Which obviously, you know, is incredibly helpful."
        },
        {
            "text": "There's constant evolutions in the security sphere, things are often changing, especially in personnel security on so many levels. That keeps me engaged. Part of the role is reactive, so I don't know everyday what I'm doing. But once again, it enables me to keep my mind busy and focused and thinking about applying things which really engage me outside of work."
        },
        {
            "text": "I'm a massive geek, so I love movies and learning movie trivia and everything. I've got a kind of encyclopaedic knowledge of all these areas that I'm interested in, which I'm very conscious, is the Asperger’s. But if you need me for a pub quiz, I've definitely got some topics I'm particularly strong on!"
        },
        {
            "text": "But from that list you might notice, they're not social.  I'm just doing my own thing, even in multiplayer games.”"
        },
        {
            "heading": 3,
            "text": "What can line managers and team members do to incorporate you and your skill sets?\n"
        },
        {
            "text": "“Giving me things that enable me to go away and learn about something is always a really good engager. Projects where we don't know everything yet, that kind of stuff is always really good for me, making it time bound and having specific objectives is also really good because otherwise I have a tendency to stray and I just go down the rabbit hole. So it's good to keep it on track. And this involves a different kind of social interaction. Every interaction has a goal. It's not open-ended. It can't go off in a million directions. You've got set information that you need and your questioning is around that. This research can happen via email and it allows me to become a subject matter expert, which is great for me."
        },
        {
            "text": "But having a team that you can be upfront with, that you feel comfortable with, is so important. I have an excellent team who support me. My manager is really supportive of me, and wants to understand more about Asperger’s and how they can support me. So that's always been really positive. But then with other teams, I often own it. “Hi, I'm Dean, and I've got Asperger’s. I might talk over you, or I might do this. I'm not being impolite.” And that seems to work really well.”"
        },
        {
            "heading": 3,
            "text": "How did you feel before and after your diagnosis?"
        },
        {
            "text": "Getting that diagnosis, though, was such a breath of fresh air because I could go away. I could do the research. You don't want to do the research beforehand because you end up diagnosing yourself as something that you don't have. You want somebody else to assess you, and then you can go away and educate yourself. It made all the difference to me in a very affirming way. Getting a diagnosis was one of the best things that could have happened for me.”"
        },
        {
            "heading": 3,
            "text": "\nWhat can we do in the workplace and throughout programme design to make sure that we're including people with Asperger’s?"
        },
        {
            "text": "“The number one point  is that it's a spectrum. Aspergers is not a blanket condition. If you’ve met one person with Asperger’s, you’ve met one person with Asperger’s - some will be more severe than others. But there will be aspects you need to take care of."
        },
        {
            "text": "I think if you are running a project, it's important to recognise specific traits that are gonna affect engagement in the first place. If you're gonna go to an Asperger's network or neurodiversity network with a questionnaire, be very careful how you word your questions, because an “aspie” will look at a question in a very specific way."
        },
        {
            "text": "They won't read into a question. They won't look for nuance in the question. If you're trying to get a varied response from an answer, you might find a very direct and specific answer from somebody who's neurodiverse, which might not be helpful for you."
        },
        {
            "text": "You might need to ask very leading questions with very specific answers. For example I did a bit of work in developing the Vetting Standards, and they asked how my medication impacts my well-being. Rather than just put “not applicable”, I wrote paragraphs about why being Asperger’s meant I don't take medication, and why I don't. It’s one of the harshest things you can probably do to somebody on the spectrum because they will answer any question you put in front of them and they will be very focused on the question."
        },
        {
            "text": "If you're gonna run a project, or look for feedback or any kind of questionnaire or anything like that, you really need to take that on board.”"
        },
        {
            "heading": 3,
            "text": "Where can people go to learn more?"
        },
        {
            "text": "\"And it's good when somebody does ask questions rather than make assumptions. Because like I said, it's a spectrum. Everybody is a little bit different. Finding out your specific needs can make all the difference to a person in general, and there are plenty of resources. There are websites available. Most government departments have a neurodiversity network. You can go along and educate yourself, and listen to some of the conversations that we're having."
        },
        {
            "text": "Any neurodiversity network for your particular government organisation is always going to be a good first bet for you, either as an ally or as somebody who's neurodiverse.  The National Autistic Society is a really good fountain of information there. And obviously it's UK centric, which is really important as well. Action for Asperger’s is another good one that I've used on occasion and Mencap is another good one as well. So those are three I would definitely point people at if you wanna know more."
        },
        {
            "text": "And for people with Asperger’s who are a bit unsure how to navigate this in the workplace I would advise to be up front about it because you will find things get easier, not harder, because people will then know how to take you.”"
        }
    ]
}