{
    "url": "https://dfedigital.blog.gov.uk/2023/06/26/organising-work-experience/",
    "title": "Organising work experience at DfE Digital, Data and Technology",
    "authors": [
        "Laura Croft"
    ],
    "categories": [
        "Careers",
        "design",
        "multidisciplinary teams",
        "User-centred design"
    ],
    "pub_date": "2023-06-26T13:53:29+01:00",
    "content": [
        {
            "text": "For some time, I had been thinking about offering work experience. I just hadn’t quite got around to progressing the idea."
        },
        {
            "text": "So, when I received a message on my netball team WhatsApp chat, I jumped at the chance. A parent at the club was desperately seeking an opportunity for her daughter."
        },
        {
            "text": "In this post, I'll explain how I organised a 4-day experience for 4 students, and how my multidisciplinary team helped me."
        },
        {
            "heading": 2,
            "text": "Setting the right environment"
        },
        {
            "text": "I was working on a service for the public in a private beta phase. This meant that we didn’t have any concerns over sensitivities."
        },
        {
            "text": "I was in a well-established, high performing team - who all had time and desire to help. This was important as it was too much work for one person to take on alone. Input and ideas from others would also enrich and improve the week for the students."
        },
        {
            "heading": 2,
            "text": "Getting started"
        },
        {
            "text": "I had the basic idea:"
        },
        {
            "text": "I spoke with the work experience lead at the school to make sure that what I was preparing was appropriate."
        },
        {
            "text": "I asked if there were any other students that might want to join. I felt that if one student came on their own, it might be a bit daunting, and we typically work in teams. One student soon turned into 4."
        },
        {
            "text": "Each student came with their own laptop and worked from a room I’d booked out for the week."
        },
        {
            "heading": 2,
            "text": "Getting input from my team"
        },
        {
            "text": "The idea was for the students to get a taste of what it’s like to work in a service design team, and learn about working in a central government department."
        },
        {
            "text": "My aim for all students was to:"
        },
        {
            "text": "A group was formed to deliver sessions to cover these aims, and I brought other DDaT people in from outside of our team to share their experiences too."
        },
        {
            "heading": 2,
            "text": "The schedule"
        },
        {
            "text": "It was a busy week. I kept the agenda flexible, providing the students with lots of breaks."
        },
        {
            "text": "In short, 16 professionals delivered 15 sessions over 4 days. Most sessions were delivered in person, with some delivered through teams."
        },
        {
            "text": "Our sessions included:"
        },
        {
            "text": "The students had a ticket on our Jira board and gave updates on our daily stand-up calls. They worked with our multidisciplinary team to define the problem, understand user needs and come up with some prototype designs for their solution."
        },
        {
            "text": "We focused on user-centred design, and covered accessibility, research methods, personas, and problem statements. We worked on paper as well as digital tools like Lucid Spark."
        },
        {
            "text": "I used a Trello board to manage their schedule. The students could access the board and the team also used it to help provide additional resources. I also arranged for 2 of our Deputy Directors and 2 of our Heads of Profession to talk to them about their education and career paths."
        },
        {
            "text": "At the end of the 4 days, they presented their designs to some of the friendly faces they had met during the week. The students came up with 4 great design ideas. Our policy colleague was so impressed that they asked me to present the ideas to the project board."
        },
        {
            "heading": 2,
            "text": "The students’ feedback"
        },
        {
            "text": "We ran a survey at the end of the week to gather feedback. All 4 students said that they would recommend this experience to others."
        },
        {
            "heading": 2,
            "text": "Iterating and improving"
        },
        {
            "text": "We received excellent feedback, but there is always room for improvement."
        },
        {
            "text": "For example, the students said there was a lot of information to take in on the first day. They said it could have been more interactive, with perhaps a few quizzes. This is great, actionable feedback for us."
        },
        {
            "text": "There was also the way that the students were able to take up the opportunity. In future I want to think about ways to offer this experience in a more inclusive way. How could we attract various students from different backgrounds, with different interests and skills? Perhaps targeting students from less affluent areas who have fewer opportunities."
        },
        {
            "heading": 2,
            "text": "Give it a go and let us know"
        },
        {
            "text": "There are so many students each year seeking work experience placements. My team and I really enjoyed facilitating ours, so I'd recommend doing it too, if you can."
        },
        {
            "text": "For government departments - the school will ask you to provide a copy of your public liability and indemnity insurance. As a central government department employer, we do not have this - we are covered by the Crown indemnity. So, I just had to provide the link."
        },
        {
            "text": "I also needed to complete forms for the school, and make sure I understood any special requirements and have emergency contact details for each student."
        },
        {
            "text": "Overall, this experience made me understand how these types of placements form such an essential part of a students’ development. It helps to inspire them to explore ideas for future careers."
        },
        {
            "text": "If you or your team have any other tips on organising work experience, or if this post has inspired you to give it a go, please let us know – we'd love to hear from you."
        }
    ]
}