{
    "url": "https://educationhub.blog.gov.uk/2023/06/what-is-clearing-and-when-does-it-open-in-2023/",
    "title": "What is Clearing and when does it open in 2023?",
    "authors": [
        "mediaofficer"
    ],
    "categories": [
        "Universities"
    ],
    "pub_date": "2023-06-26T15:50:42+01:00",
    "content": [
        {
            "text": "Clearing is a term you might have heard in the context of university applications, but do you know what it means?"
        },
        {
            "text": "Some people might think that you can only apply through Clearing if you haven’t met the grade requirements of a conditional offer from a university. While it's true that many people who don’t receive the grades they expect secure an alternative place through Clearing, it can be a good option for those in different situations too."
        },
        {
            "text": "Here we tell you everything you need to know about Clearing and how it could benefit you."
        },
        {
            "heading": 3,
            "text": "What is Clearing?"
        },
        {
            "text": "Clearing is when UCAS provides students with the opportunity to apply for university places which haven’t yet been filled, outside of the normal application window."
        },
        {
            "text": "It’s a good option if:"
        },
        {
            "heading": 3,
            "text": "When does Clearing open in 2023?"
        },
        {
            "text": "Clearing is open from 5 July to 17 October 2023."
        },
        {
            "heading": 3,
            "text": "How does Clearing work?"
        },
        {
            "text": "Log-in to your UCAS account, or set one up here."
        },
        {
            "text": "From 5 July, you can check listings of available courses on UCAS. Almost every university participates in Clearing so there will be thousands of courses to choose from."
        },
        {
            "text": "Once you’ve found a course you want to apply to, get in touch with the university or college directly to see if they will accept you for the course you’re interested in."
        },
        {
            "text": "Once you have received permission from the university or college to do so, add your Clearing choice to your application so the university or college can officially accept you."
        },
        {
            "text": "If your exam results don’t meet the requirements of a conditional offer you’ve expected, you’ll be automatically entered into Clearing on results day, unless your university has confirmed your place anyway."
        },
        {
            "text": "You can find out more about clearing here: Clearing | UCAS."
        },
        {
            "heading": 3,
            "text": "Who can use Clearing? "
        },
        {
            "text": "You can apply for a course using Clearing if you’re not already holding an offer from another university or college, and the course still has places."
        },
        {
            "text": "You can use Clearing if:"
        },
        {
            "heading": 3,
            "text": "What are some alternative options to university?"
        },
        {
            "text": "Even if you’ve achieved the grades you were expecting, you might want to consider alternative routes, like doing an apprenticeship or going straight into work."
        },
        {
            "text": "If you want to get a degree but you’re having second thoughts about studying full-time at university, you could look into doing a degree apprenticeship. This route allows you to study towards an undergraduate or master’s degree while you work, gaining invaluable industry experience and earning a salary. Your off-the-job training takes place in your working hours, and you won’t have to pay for your tuition."
        },
        {
            "text": "There are an exciting range of degree apprenticeships available now, which could jumpstart your career in industries like finance, engineering, journalism and healthcare. Visit the UCAS website to find and apply to a degree apprenticeship."
        },
        {
            "text": "Find out more about alternative options to university here."
        },
        {
            "heading": 3,
            "text": "Where can I get support on what to do after school or college?"
        },
        {
            "text": "The National Careers Service provides a free-to-use exams hub which you can access here."
        },
        {
            "text": "If you need help or advice around your exam results or next steps, you can call the helpline to chat to a careers adviser on 0800 100 900 or use webchat."
        },
        {
            "text": "Careers advisers can help you navigate clearing, but they can also talk you through alternative options like starting work, gap years, deferred university entry, as well as potential future career paths."
        }
    ]
}