{
    "url": "https://enablingdigitalidentity.blog.gov.uk/2025/05/30/digital-identity-and-the-gov-uk-wallet-increasing-choice-accelerating-adoption/",
    "title": "Digital identity and the GOV.UK Wallet: increasing choice, accelerating adoption",
    "authors": [
        "Secretary of State"
    ],
    "categories": [
        "Digital identity"
    ],
    "pub_date": "2025-05-30T11:00:00+01:00",
    "content": [
        {
            "text": "Earlier this month I had the pleasure of hosting digital identity specialists from the tech sector to tell them more about our ambition for the GOV.UK Wallet.  "
        },
        {
            "text": "They represented the UK’s Digital Verification Services (DVS) sector, that provide the digital identity services millions of us have already used to prove our Right to Work, Right to Rent and more. "
        },
        {
            "heading": 3,
            "text": "A booming UK digital identity sector"
        },
        {
            "text": "I could not be prouder or more supportive of the contribution that this sector has made in helping to establish one of the cornerstones of a modern digital economy: a trusted system of digital identity. "
        },
        {
            "text": "As our recent report reveals, the sector is already a significant driver of economic growth, generating more than £2 billion in revenue each year and supporting over 10,000 jobs across the country. Measures in our Data Bill look to compound this further, supporting the sector to contribute a further £4.3 billion to the economy over the next decade."
        },
        {
            "text": "The introduction of the GOV.UK Wallet, which I announced in January, presents an opportunity to take these benefits to another level entirely.   "
        },
        {
            "text": "With this technology, people will for the first time be able to use digital versions of everyday government credentials such as driving licences or veteran cards. And over time, digital credentials will be usable for everything physical documents are used for now.  "
        },
        {
            "heading": 3,
            "text": "Increasing choice through the GOV.UK Wallet "
        },
        {
            "text": "One of the key principles for this new system is maintaining choice for consumers and businesses. We want people to be able to choose between – or use both – their GOV.UK Wallet or a private sector provider for different use cases across the economy. Or, they can choose to continue using the same physical documents they’ve relied on for decades. "
        },
        {
            "text": "This is about building a modern digital government, not stifling the brilliant growth and innovation in the private sector.  People in Britain are right to expect that their government will be able to issue them with key documents securely and digitally. "
        },
        {
            "heading": 3,
            "text": "The private sector as intermediary partners"
        },
        {
            "text": "There is also no doubt that the private sector, such as the providers I met earlier this month, will have a critical role in realising the benefits of the GOV.UK Wallet."
        },
        {
            "text": "If an individual wants to use GOV.UK Wallet in the private sector – for example in a shop or a pub – businesses will want to be confident that they can trust the information they’re seeing."
        },
        {
            "text": "That’s where trusted, registered DVS providers come in as critical intermediaries."
        },
        {
            "text": "They will be able to innovate and enable the safe and convenient disclosure of relevant information from the GOV.UK Wallet to businesses like pubs, shops or websites. They share the relevant data and provide reassurance that it is trustworthy and reliable. "
        },
        {
            "text": "The GOV.UK Wallet will only share information with DVS providers in the private sector where the recipient has been independently certified as meeting our high standards on security and privacy, and where they appear on the DVS register. And importantly, the user has full control over what data is shared, and who it’s shared with."
        },
        {
            "text": "We have released initial information on how we see this working in line with the principles of the digital identity trust framework, including initial technical documents. Registered DVS providers can take on different roles to meet their customer's needs - as orchestration, identity or holder service providers. "
        },
        {
            "text": "My department is now kicking off in-depth technical engagement with sector stakeholders to develop the detail of this system, and I would encourage anyone with an interest to participate.  "
        },
        {
            "heading": 3,
            "text": "Grasping the opportunity through collaboration and innovation"
        },
        {
            "text": "Through the Data Bill we are putting the UK’s digital identity trust framework on a statutory footing. "
        },
        {
            "text": "We are changing other laws – for example alcohol licensing requirements – to increase the adoption of these secure and trusted technologies.  "
        },
        {
            "text": "Through the GOV.UK Wallet we are making it easier for consumers to use their own government-held data within this ecosystem, if they so choose. "
        },
        {
            "text": "But we can only realise this huge potential through collaboration between government, digital verification services, and businesses like pubs and supermarkets. We’re ready to innovate and realise the benefits for people and businesses. Let’s move forward together.  "
        }
    ]
}