{
    "url": "https://actuaries.blog.gov.uk/2025/05/30/navigating-the-administration-transition/",
    "title": "Navigating the administration transition",
    "authors": [
        "Jen McBain - Actuary"
    ],
    "categories": [
        "Pensions",
        "Pensions administration",
        "Risk management"
    ],
    "pub_date": "2025-05-30T11:14:10+01:00",
    "content": [
        {
            "text": "In the ever-evolving landscape of pension schemes, transitioning to a new provider or transforming your existing administration services can be a daunting task."
        },
        {
            "text": "Whichever path you’re on, early consideration of what you can do to ensure a smooth and successful delivery is crucial. While each transition is unique, I have set out key areas to consider."
        },
        {
            "heading": 2,
            "text": "Scheme objectives"
        },
        {
            "heading": 3,
            "text": "Understanding your requirements"
        },
        {
            "text": "Before beginning any project it’s vital to define the aim; what is in the delivery scope and what is not. Consider what you want your service to look like once it is complete and then work out what you should do to deliver the transition."
        },
        {
            "text": "All parties should understand the requirements and potential challenges. This includes the scheme manager, the current and potential new providers and any supporting services."
        },
        {
            "text": "Understanding this ensures that an achievable project timeline can be established to support successful delivery."
        },
        {
            "heading": 2,
            "text": "Project management"
        },
        {
            "text": "A well-structured, detailed plan is the backbone of any project. Establish a realistic timeline with achievable, defined milestones. Clearly outline objectives, timelines and roles including how progress will be reported. Document any assumptions that you have made and any dependencies between different work areas – these can often be overlooked. Identify potential risks early and establish mitigation strategies. Ensure that your project management office has ringfenced resource to oversee the project."
        },
        {
            "text": "Develop backup plans, allocate a contingency budget, and establish protocols for resolving critical problems. Keep plans under constant review to identify deviations which may trigger contingency plans."
        },
        {
            "text": "Challenge your proposed timelines – are they achievable? Consider resource availability and any contractual agreements, in particular the exit agreement with your incumbent provider and the level of additional support that they are expected to provide during transition."
        },
        {
            "heading": 2,
            "text": "Governance and oversight"
        },
        {
            "text": "As mentioned, lack of knowledge or understanding of scheme requirements can hinder successful delivery and failure to challenge and document key decisions can lead to misunderstandings and/or missed deadlines.  "
        },
        {
            "text": "Leverage the expertise of staff, administrators and external support, to stress test planning and development. Ensure clear project documentation is maintained and keep plans under constant review to identify any deviations that may trigger contingency plans."
        },
        {
            "text": "You may need extra governance structures to manage the project effectively and to ensure that there are no gaps in control. Establish clear steering committees, schedule regular progress reviews and reporting requirements.  "
        },
        {
            "text": "Ensure that you have comprehensive documentation in place such as maintained data dictionaries, process maps, benefit specifications, and details of administration decisions and practices. If required, consider improving this documentation before transition begins, so that it can be used to provide continuity and consistency. Consider the transition as an opportunity to improve scheme documentation."
        },
        {
            "heading": 2,
            "text": "Data transfer"
        },
        {
            "text": "Migrating any data can be challenging. There may be risks to consider, including data loss or corruption, inaccurate mapping to the new system, security breaches or compliance issues. Here are some things to consider to reduce these risks:"
        },
        {
            "heading": 2,
            "text": "Data quality"
        },
        {
            "text": "Data drives all aspects of scheme management and so quality is paramount – if your data is inaccurate, everything else will be too. High-quality data enables informed decision making, greater automation, potential for enhanced member experience and trend identification. "
        },
        {
            "text": "Transition is an opportunity to conduct a data audit to assess the current state of the data, to cleanse data and enhance validation processes. Decide whether issues identified need to be addressed before, during or after transition. "
        },
        {
            "text": "Data quality can also be assessed through several different lenses – for example, is the data digital ready, is it fit for purpose for Pensions Dashboards? Your new provider should already be thinking about any data validation checks they will apply under the new contract, and this should feed into any quality assessment."
        },
        {
            "heading": 2,
            "text": "Calculations"
        },
        {
            "text": "The opportunity to embrace new technology during transition and enhance automation can help reduce errors and make administration significantly more efficient. You should consider:"
        },
        {
            "heading": 2,
            "text": "Business continuity and member experience"
        },
        {
            "text": "Transition is a resource intensive project for both the incumbent and new provider, and a narrow focus on transition can detract from regular operations, leading to inefficiencies or delays. "
        },
        {
            "text": "This can have a negative impact on members, reducing engagement and eroding trust. The incumbent should identify and protect key processes and staff to ensure good service is maintained. This is vitally important for processes such as retirements, deaths and ongoing pension payments. "
        },
        {
            "text": "It's important to develop a communications plan and regularly update members or other stakeholders such as employers about changes or delays that may affect them. "
        },
        {
            "text": "It may be that the current administrators will be transferred to the new provider under TUPE regulations. This can help to ensure knowledge retention and support the success of the new service. You should investigate whether TUPE will apply – if it does, staff engagement will be critical. Irrespective of the outcome on TUPE, you’ll need to consider how the experience and knowledge of the current administration team will be retained, and perhaps documented, as part of the transition. "
        },
        {
            "text": "A well-planned and executed transition can provide not only administration improvements, it can also help deliver the wider strategic goals of the sponsoring department. "
        },
        {
            "text": "Whilst this isn’t intended to be a comprehensive list of all the challenges, considering these areas should help you to navigate the complexities of transition with confidence and clarity."
        },
        {
            "heading": 3,
            "text": "Disclaimer"
        },
        {
            "text": "The views expressed are the author’s own and the opinions in this blog post are not intended to provide specific advice. For our full disclaimer, please see the About this blog page."
        }
    ]
}