{
    "url": "https://socialworkwithadults.blog.gov.uk/2025/05/30/open-call-for-evidence-review-of-cqc-regulation-9a-visiting-and-accompanying-in-care-homes-hospitals-and-hospices/",
    "title": "Open call for evidence - Review of CQC Regulation 9A: visiting and accompanying in care homes, hospitals and hospices",
    "authors": [
        "Sarah McClinton",
        "Deborah Sturdy"
    ],
    "categories": [
        "Care and support",
        "Communities",
        "Consultation and engagement",
        "Guidance",
        "Viewpoint"
    ],
    "pub_date": "2025-05-30T16:11:13+00:00",
    "content": [
        {
            "text": "The pandemic was a critical period in our history that highlighted more than ever the need for human contact. As we faced unprecedented times and restrictions to our liberty to mix socially and see our family, friends, colleagues and neighbours, some people in our communities were disproportionately affected."
        },
        {
            "text": "The enforced restrictions affected all of us and for people whose cognitive ability to understand what and why was impaired, the challenges were even more difficult to overcome. Social media, Teams meetings, FaceTime were well used across social care to support people, but nothing can substitute the human touch and what that conveys beyond words."
        },
        {
            "text": "As we continue to reflect and learn lessons, we are writing to ask for your help in reviewing the regulations introduced to protect visiting and accompanying in care homes, hospitals and hospices. What you have to say really matters and helps shape a better future response. We need to know how the regulations work in your setting, the impact on practice, access and support for those in your care and whom you support."
        },
        {
            "text": "In busy days we hope you can find time to contribute to the review by completing the survey."
        },
        {
            "text": "Thank you "
        }
    ]
}