{
    "url": "https://mhclgdigital.blog.gov.uk/2023/06/08/accelerating-the-adoption-of-digital-citizen-engagement-tools-in-planning-insights-from-dluhcs-proptech-innovation-fund-2/",
    "title": "Accelerating the adoption of Digital Citizen Engagement tools in planning: insights from DLUHC’s PropTech Innovation Fund",
    "authors": [
        "The Digital Planning team"
    ],
    "categories": [
        "Digital Citizen Engagement",
        "Digital Planning",
        "PropTech"
    ],
    "pub_date": "2023-06-08T17:06:35+01:00",
    "content": [
        {
            "text": "Following the publication of outcomes from Round 1 of the PropTech Innovation Fund, we are excited to share insights from Round 2 and our plans to celebrate these projects at the upcoming Local Planning Authority (LPA) Showcase Event on 14 June."
        },
        {
            "text": "As part of the wider DLUHC Digital Planning programme, Round 2 of the PropTech Innovation Fund was launched in March 2022 working with 36 LPA partners and 20 Property Technology (PropTech) companies to accelerate the adoption of digital tools and services in the planning process."
        },
        {
            "text": "The funded projects in this round spanned five key themes: Masterplanning, Council-Led Development, Estate Regeneration, Community Development, and ‘Wildcard’ pilots -  innovations which highlighted the art of the possible in terms of how digital citizen engagement tools could be applied to a broad range of planning areas and policy contexts. "
        },
        {
            "text": "The scale and impact of these projects has brought to life many local authority ambitions to make planning more accessible, inclusive and transparent to communities through developing and adopting tools in new and interactive ways. Reflections from Paul Barnard, Service Director for Strategic Planning and Infrastructure at Plymouth City Council bring this to life:"
        },
        {
            "text": "“The Proptech Fund has enabled us to accelerate our ambitious work  programme to deliver more innovative and legible planning policy services. Piloting  a digital engagement platform has allowed us to quickly realise some of our goals  for a digital Joint Local Plan. This work will profoundly shape the way we consult  our communities in the future.” "
        },
        {
            "heading": 3,
            "text": "Measuring impact"
        },
        {
            "text": "We recognise the importance of generating evidence across these projects that can support ongoing industry adoption beyond the length of the programme. To ensure this, we have worked closely with policy teams and local authorities to develop a monitoring and evaluation framework. "
        },
        {
            "text": "This framework has enabled us to work with local authorities and identify how the adoption of digital tools and outcomes could increase the quantity and quality of those who engage in planning, inform communities on the trade-offs inherent in planning and create time and resource efficiencies for planning officers. "
        },
        {
            "text": "As this evidence evolves, we have shared initial reflections with industry partners such as Homes England, Geospatial Commission, Digital Planning Taskforce,  PAS and RTPI which we hope speaks to increased industry awareness of the role that digital citizen engagement can have in the planning process. "
        },
        {
            "text": "Insights and outcomes from the pilots are already bringing to life progress across a range of LPAs including those in the graphic below. Key themes are also emerging, which this blog post explores in more detail. "
        },
        {
            "heading": 3,
            "text": "Using PropTech can increase the quantity and quality of community engagement responses"
        },
        {
            "text": "From developing digital consultation platforms and channels in different languages, the gamification of land use/density trade-offs, and building VR and 3D modelling to bring place making and public realm to life, these projects have shown how digital tools can make consultations more accessible to communities. "
        },
        {
            "text": "As a result, planners are hearing from new voices who have not traditionally engaged in the plan making process - bringing new ideas and perspectives to conversations around planning and regeneration. Examples include:"
        },
        {
            "heading": 3,
            "text": "Adopting a hybrid approach can engage different demographics"
        },
        {
            "text": "For many local authority projects, engaging more diverse community members, especially young people in the consultation process was a key priority and informed how they adopted a range of techniques to hear from seldom heard voices. This included both more direct targeting of responses through digital channels/platforms and also wider engagement initiatives focused on education, training and community activation. Examples included: "
        },
        {
            "heading": 3,
            "text": "Using PropTech helps to inform communities about the trade-offs involved in planning decisions"
        },
        {
            "text": "LPAs have witnessed the power of online platforms in fostering constructive and productive discussions surrounding planning initiatives. Some examples include:"
        },
        {
            "heading": 3,
            "text": "Using PropTech enables more capacity for Planning Officers"
        },
        {
            "text": "Traditionally, gathering and analysing consultation responses, as well as providing bespoke feedback to respondents, has been a time-consuming process, causing knock on effects for wider policy teams. However, with the adoption of PropTech digital consultation platforms, emerging examples of resource saving can be identified."
        },
        {
            "text": "Harborough District Council highlights the immense benefits of this approach, stating:"
        },
        {
            "text": "\"The greatest benefit of this project is the potential for time saving in terms of analysis and providing bespoke feedback... it’s envisioned that on average the [planning] officer time efficiency saving would be around 2 to 2.5 hours per week.\" "
        },
        {
            "text": "We hope that the efficient use of PropTech not only optimises resource allocation but could also support planning officers to dedicate their time and expertise where it matters most."
        },
        {
            "text": "Alongside these insights, there are a range of other outcomes we’ve witnessed through these projects including increased collaboration across local planning and PropTech teams, access to new community led data and insights for the first time at local authority level, skills and job growth and increased planning transparency and certainty on significant regeneration schemes. "
        },
        {
            "heading": 3,
            "text": "Sharing and scaling outcomes across the industry "
        },
        {
            "text": "These emerging insights and outcomes provide a glimpse into the transformative possibilities offered by digital citizen engagement tools and services."
        },
        {
            "text": "In the coming months, we plan to publish a series of case studies that delve into the achievements and challenges of local authorities working across the PropTech Innovation Fund. You can already explore the outcomes from Round 1 projects on the case study area of our website."
        },
        {
            "text": "We also invite you to mark your calendars for 14 June 2023, as we host a virtual LPA showcase for Round 2 of the PropTech Innovation fund. In partnership with the Digital Planning Taskforce, this event will feature presentations from several LPAs, who will share their projects and key learnings. It's a unique opportunity to gain first hand knowledge from those at the forefront of digital planning innovation. Sign up here to secure your place. "
        },
        {
            "text": "As we continue our journey with the PropTech Innovation Fund, we are excited to witness the continued growth and impact of these advancements in the planning and regeneration realms."
        },
        {
            "heading": 3,
            "text": "Contact the team"
        },
        {
            "text": "If you would like to receive fortnightly emails summarising LPA projects, or if you're interested in connecting with peers working in innovative councils across the country, we would love to hear from you. Feel free to reach out to us via email: digitalplanningteam@levellingup.gov.uk."
        },
        {
            "text": "You can keep up to date with the work of the whole Digital Planning Programme on our website, blog and social media channels, LinkedIn and Twitter."
        }
    ]
}