{
    "url": "https://socialcare.blog.gov.uk/2023/06/08/carers-week-a-personal-perspective-from-fatima-khan-shah/",
    "title": "Carers Week 2023: a personal perspective from Fatima Khan-Shah",
    "authors": [
        "Fatima Khan-Shah"
    ],
    "categories": [
        "Care and support",
        "Carers",
        "Communities",
        "Diversity",
        "Viewpoint"
    ],
    "pub_date": "2023-06-08T15:26:12+00:00",
    "content": [
        {
            "heading": 2,
            "text": "Complex, tough, rewarding"
        },
        {
            "text": "Being a carer can make life extremely complicated; not only do you hold a significant amount of physical, financial, and emotional responsibility, but you make sacrifices on a daily basis. You forgo social engagements, prioritise other people’s medical appointments, balance a million different tasks, but still feel you are rubbish at everything!"
        },
        {
            "text": "It's not always this dire, of course and there are many happy moments too. However, many more of us are becoming unpaid carers every single day. Friends, sons, daughters, grandparents, neighbours, parents, children, even the in laws!"
        },
        {
            "text": "Many do not realise they are already unpaid carers or the contribution they make to the wellbeing of our communities and to society as a whole. They are just kind individuals who may keep a loved one company, provide physical help, give medication, deal with care services, or even provide personal care."
        },
        {
            "text": "The latest carer research suggests one in five (20 percent) of us are currently unpaid carers and that one in two (50 percent) have provided care and support at some point to a loved one. However as many as 73 percent do not think of themselves as unpaid carers. Meanwhile, around 31 percent have said significant caring responsibilities have impacted their health and wellbeing."
        },
        {
            "text": "According to Carers UK, the value of unpaid care to the economy has been calculated to be a mind-blowing £445 million to every day – that’s £162 billion per year. It is therefore in our economic interest to support these incredibly dedicated people."
        },
        {
            "heading": 2,
            "text": "Commitment to a national resource"
        },
        {
            "text": "In West Yorkshire, we are committed to working across the system but also engaging with the grass roots of the region to identify our unpaid carers. Our relationship with the voluntary and community sector is an essential part of this, as is working with public and private employers to provide practical support during these challenging times."
        },
        {
            "text": "While the focus on unpaid carers this week is welcome, speaking as one myself, my sincere wish is for the profile of people in my circumstances to remain front and centre, as we continue to support the kindness, compassion and generosity of this wonderful community."
        },
        {
            "text": "As the newly appointed West Yorkshire Inclusivity champion, a vital element of my role will be to work with West Yorkshire Combined Authority and West Yorkshire Health and Care Partnership and the communities they serve. I’ll be providing expert advice on inclusion and addressing regional disparities including those relating to social, economic and health inequalities."
        },
        {
            "text": "Supporting unpaid carers is not just the social and morally right thing to do, it makes business sense. If we support them to live healthy, fulfilling, productive lives alongside caring it eases pressure on the health and care system, boosts their contribution to the economy through fewer lost work days and enhances their health and wellbeing. In that respect, we all win, so let’s keep raising awareness of unpaid carers and give back to them what they so selflessly give to us."
        }
    ]
}