{
    "url": "https://naturalengland.blog.gov.uk/2023/06/08/celebrating-world-ocean-day-2023-building-partnerships-for-planet-ocean/",
    "title": "Celebrating World Ocean Day 2023: Building Partnerships for Planet Ocean",
    "authors": [
        "Natural England"
    ],
    "categories": [
        "Biodiversity",
        "Climate change",
        "Coast and access",
        "Education",
        "Marine environment",
        "Natural England",
        "Protected sites and species",
        "Science and evidence",
        "Species recovery",
        "Wildlife"
    ],
    "pub_date": "2023-06-08T15:48:40+01:00",
    "content": [
        {
            "text": "World Ocean Day is an annual event celebrated on 08 June that not only serves as a day of observance but also fosters collaboration and encourages year-round conservation action. This global celebration unites individuals and organisations from around the world, aiming to raise awareness about the importance of our oceans."
        },
        {
            "text": "Under the theme \"Planet Ocean: Tides are Changing,\"  World Ocean Day 2023 seeks to inspire ocean conservation throughout the month of June and beyond. You can explore more about the significance of World Ocean Day at WorldOceanDay.org."
        },
        {
            "text": " "
        },
        {
            "heading": 3,
            "text": "Natural England's Commitment to Marine Conservation:"
        },
        {
            "text": "As an island nation, understanding the vital role our surrounding seas play in climate regulation, food security, and economic progress is of utmost importance. Natural England, in collaboration with various organisations, researchers, and stakeholders, is actively working to protect and enhance marine ecosystems, striving to achieve sustainable goals for England's seas. Here are some notable collaborative projects undertaken by Natural England:"
        },
        {
            "text": "1. \"Allis the Shad Who Wouldn't Give Up\" Book Launch: To mark World Ocean Day 2023, Natural England will release a thought-provoking children's book titled \"Allis the Shad Who Wouldn't Give Up.\" Written by Angela Gall, a senior marine adviser in Devon, Cornwall, and Isles of Scilly Area Team and beautifully illustrated by Sarah Gledhill, this enchanting book follows the journey of the rare Allis shad fish, which exclusively breeds in the River Tamar of the United Kingdom. The book highlights the significance of the Allis shad as a flagship species for the Tamar region, stressing the importance of conserving its habitat. The book's sales will contribute to the conservation efforts of the Westcountry Rivers Trust (WRT). Through intricate illustrations, Sarah Gledhill brings local scenes and wildlife to life, providing an enjoyable way to celebrate these extraordinary fish and educate adults about the critical need to care for freshwater habitats that sustain countless species."
        },
        {
            "text": "For more information about the WRT and to take a look at the book visit Allis The Shad Who Wouldn’t Give Up"
        },
        {
            "text": "2. Highly Protected Marine Areas (HPMAs):  In recent years, the urgent need for stronger protection measures in marine conservation has gained recognition. Highly Protected Marine Areas (HPMAs) have emerged as a crucial strategy to safeguard vulnerable and ecologically significant areas in our ocean. Natural England have supported Defra in the identification and designation of HPMAs in our English waters.  HPMAs impose restrictions on activities, removing pressures, creating safe havens for marine biodiversity, allowing marine ecosystems to regenerate, species to recover, and habitats to flourish."
        },
        {
            "text": "3. Eden Project Animation: The Hidden Seas team from Natural England has collaborated with The Eden Project to create an engaging animated film that raises awareness about the importance of seagrass. This captivating animation, titled \"Underwater Heroes,\" highlights the ReMEDIES restoration project while emphasising seagrass's pivotal role in combating climate change and the biodiversity crisis."
        },
        {
            "text": "It underscores seagrass as a habitat provider, carbon absorber, coastline protector, key fish nursery, and water quality enhancer. The animation offers practical tips and serves as a call to action for beachgoers, snorkelers, divers, recreational boaters, and everyone else who can contribute to reducing pollution."
        },
        {
            "text": "4. Marine and Coastal Wildlife Code: Natural England, in collaboration with the Department for Environment, Food and Rural Affairs (Defra), has contributed to the development of England's first-ever national Marine and Coastal Wildlife Code. This comprehensive code offers valuable advice and guidance for responsible visits to the coast. Created in partnership with organisations such as the Whale and Dolphin Conservation, the Royal Society for the Protection of Birds (RSPB), the Shark Trust, and the Cornwall Seal Group Research Trust, the code provides specific guidance on activities like coastal walks, kayaking, paddleboarding, and jet skiing. It offers insights into breeding seasons and helps visitors understand how their actions can minimise disturbance to seabirds, seals, dolphins, sharks, and turtles. This initiative builds upon the existing Countryside Code, ensuring enjoyable and safe experiences for coastal visitors."
        },
        {
            "text": "World Ocean Day 2023 serves as a powerful reminder of the vital importance of safeguarding our seas. The initiatives highlighted above demonstrate Natural England's dedication to marine conservation. Through collaboration with diverse organisations, researchers, and stakeholders, Natural England strives to enhance marine ecosystems and work towards sustainable goals for England's seas."
        },
        {
            "text": "For more information on Natural England's marine conservation work, please contact marine.communications@naturalengland.org.uk"
        }
    ]
}