{
    "url": "https://educationinspection.blog.gov.uk/2023/06/08/ofsteds-webinars-for-schools-summer-season/",
    "title": "Ofsted's webinars for schools - summer season",
    "authors": [
        "Lee Owston, Deputy Director, Schools and Education"
    ],
    "categories": [
        "curriculum",
        "deep dives",
        "early years",
        "inspection",
        "schools"
    ],
    "pub_date": "2023-06-08T16:59:53+01:00",
    "content": [
        {
            "text": "We're happy to invite you to hear directly from Ofsted in our summer webinars."
        },
        {
            "text": "We wanted to start by thanking everyone who attended or watched our schools webinars in spring. So far this year we've hosted webinars looking at:"
        },
        {
            "text": "Each webinar is available on YouTube if you missed them. We also publish the slides from the sessions on our SlideShare channel."
        },
        {
            "text": "This summer we'll be running webinars on:"
        },
        {
            "text": "In the first webinar, we'll look at how subject leaders are involved in Ofsted inspections. We'll also explore the evidence we gather on deep dives, the findings from our recent curriculum research reviews and share insights from our subject leads."
        },
        {
            "text": "In the second, we'll discuss communication and language and what inspectors look at including the use of phonics and early reading.  We'll explore what a reading deep dive is and share what we understand from inspection about the impact of COVID-19 pandemic on children’s learning and development."
        },
        {
            "text": "Please sign up for either or both sessions at this link: https://bit.ly/OfstedWebinars."
        },
        {
            "text": "Due to restrictions on our webinar platform, we can only accommodate 1,000 attendees per live event. We therefore recommend registering early to avoid disappointment. We'll also continue to publish the recordings of these sessions shortly after the event for those that are unable to attend."
        }
    ]
}