{
    "url": "https://insidehmcts.blog.gov.uk/2023/06/08/sharing-the-hmcts-change-framework-across-government/",
    "title": "Sharing the HMCTS change framework across government",
    "authors": [
        "Rachel Green - Lead CFT Business Architect"
    ],
    "categories": [
        "Court and tribunal reform",
        "General",
        "Training and support"
    ],
    "pub_date": "2023-06-08T10:00:37+01:00",
    "content": [
        {
            "text": "Over the past 7 years of the reform programme, HMCTS has been through a complex change process. Our Business Architecture team has proudly contributed to this agenda of modernisation for courts and tribunals in England and Wales."
        },
        {
            "text": "Business architecture focuses on helping everyone within an organisation to have a common understanding of it, so that its strategy can be translated into action. It has roots in other business disciplines such as strategy execution, enterprise architecture and business analysis."
        },
        {
            "text": "My team chairs the cross-government Business Architecture Forum, which aims to develop and promote the profession within the public sector. It includes representatives from the Home Office, HM Revenue & Customs, Department of Work and Pensions, Department for Education, Department for Levelling Up, Housing and Communities, and the Metropolitan Police, among others."
        },
        {
            "text": "Through this forum, I’ve been exploring how our own experience and learning could translate into a training package for potential use by other government departments when considering their own transformation activity."
        },
        {
            "heading": 3,
            "text": "Providing a structured change framework"
        },
        {
            "text": "I transferred some of our business architecture methodology into a detailed guide, the Executing Strategy and Enabling Complex Change (ExSECC) Framework. It incorporates service design, governance and delivery that places users at its heart. It describes how the business architecture team helped to achieve HMCTS’s vision and strategy for reform."
        },
        {
            "text": "Through the creation of a Target Operating Model (TOM), we provide a reference point for all projects and programmes to align progress with the reform strategy. Ultimately, the TOM illustrates HMCTS’s desired way of working to support organisational change."
        },
        {
            "text": "It has already been used successfully as a basis for transforming projects by other government departments, including Land Registry."
        },
        {
            "heading": 3,
            "text": "Advising Northern Ireland’s Courts & Tribunals Service"
        },
        {
            "text": "Earlier this year we were approached by the Northern Ireland Courts and Tribunals Service (NICTS) which is about to begin designing a new, modernising operating model as part of their ‘Vision 2030’."
        },
        {
            "text": "Karen Ward, their Chief Modernisation Officer, wanted to access the right set of skills and experience within the marketplace to upskill her team. She wanted to benefit from others who understood the unique challenges encountered when redesigning public services and operating models. Who better to approach than another government department who had exactly that expertise?"
        },
        {
            "text": "We provided them with our HMCTS Business Architecture training package and devised a learning plan which involved nearly 20 hours of workshops, covering 6 modules for 13 NICTS colleagues."
        },
        {
            "heading": 3,
            "text": "Bespoke training package"
        },
        {
            "text": "We tailored the training to suit their needs and devised a bespoke case study that was distinct from our courts and tribunals service, so that the package could be relatable and easily reapplied elsewhere."
        },
        {
            "text": "The 6 modules were delivered virtually using Microsoft teams, with 7 sessions over 6 weeks. We used breakout rooms to encourage discussion and opportunities to try out new ways of working. Reflecting on the training, Karen commented:"
        },
        {
            "text": "The framework is now available on the Government Project Delivery Hub which you can access once registered. Part 1 focuses on our story in a long-form case study, describing how we set up the business architecture function, developed our methodology and the team. Part 2, also on the hub, provides toolkits with suggestions on how to implement topics, tools and concepts which you can use to develop your own set of design artefacts."
        },
        {
            "text": "If you want to learn more about business architecture, enabling complex change, or how the ExSECC Framework could help your organisation, please contact me at HMCTSDesignAuthority@justice.gov.uk."
        }
    ]
}