{
    "url": "https://hmlandregistry.blog.gov.uk/2023/06/08/top-tips-have-everything-to-hand-and-pay-attention/",
    "title": "Top tips: Have everything to hand and pay attention",
    "authors": [
        "Andrew Robertson, Head of Customer Policy and Service Improvement"
    ],
    "categories": [
        "Law and practice"
    ],
    "pub_date": "2023-06-08T15:44:39+01:00",
    "content": [
        {
            "text": "We want to share the experiences of all our customers, from those managing large volumes of cases every month, such as enact Conveyancing and Blake Morgan LLP, to those perhaps handling just a few a year."
        },
        {
            "text": "It’s clear from our conversations that approaches to reducing requisitions can be very different depending on the nature of a firm’s work."
        },
        {
            "text": "We talked to Gina Payne, an Associate Solicitor and Head of the Property Team at Johnson Astills Limited, which has offices in Leicester and Loughborough."
        },
        {
            "heading": 2,
            "text": "Johnson Astills' approach"
        },
        {
            "text": "A member of the Law Society’s accredited Conveyancing Quality Scheme, Johnson Astills provides residential conveyancing services, and can help with all aspects of residential property, including leases and lease extensions."
        },
        {
            "text": "The firm does not have a post-completions department, so the team’s legal secretary lodges applications with HM Land Registry and, along with the relevant fee earner, deals with any requisitions that might arise."
        },
        {
            "text": "Gina tells us her team has been using our Digital Registration Service (DRS) for more than six months and they find the system easy to use and “quicker than preparing an AP1 and then uploading it to the portal”. Gina adds: “We can prepare the application in advance.”"
        },
        {
            "text": "The team makes good use of our free customer training and guidance, especially the webinars and our practice guides, which they regularly refer to for answers to queries before submitting applications."
        },
        {
            "text": "Gina’s suggestions for minimising avoidable requisitions: “Pay close attention to practice guides and make note of any changes to requirements that might result in a requisition. Make sure all documents are to hand before you start an application, and check that the transfer and documents are all signed correctly.”"
        },
        {
            "text": "Straightforward advice that seems to be working for this firm!"
        },
        {
            "text": "We’ll continue to feature the great work of firms across the property sector – if you have a top tip or helpful hint, get in touch at CustomerCommsTeam@landregistry.gov.uk."
        },
        {
            "text": "You can stay on top of practice guides with our Practice and Process newsletter – sign up to receive it monthly."
        },
        {
            "text": "For more help in avoiding requisitions, head to our customer training hub and download Quick wins for fewer requisitions (under Checklists)."
        },
        {
            "text": "Find out about our Digital Registration Service (DRS)."
        }
    ]
}