{
    "url": "https://socialcare.blog.gov.uk/2023/06/08/why-volunteering-is-good-news-for-the-social-care-workforce/",
    "title": "Why volunteering is good news for the social care workforce",
    "authors": [
        "Helena Maher"
    ],
    "categories": [
        "Care and support",
        "Communities",
        "Social care reform",
        "Workforce"
    ],
    "pub_date": "2023-06-08T10:14:19+00:00",
    "content": [
        {
            "text": "Helen Maher: \"While volunteers can’t help healthcare [colleagues] with the delivery of care, there is no doubt the team reaps the benefits of their support, giving them more time to focus on the wellbeing of residents.\"We’re fortunate to have a team of dedicated and enthusiastic volunteers coming in to help throughout the week. Before the pandemic, many volunteers came in to help with the many activities laid on in our homes. Lockdown stopped that. Even though some volunteers were able to continue, COVID-19 restrictions meant volunteering inside our home ground to a halt."
        },
        {
            "text": "As we emerged from the pandemic and reopened our doors, we started working with our fundraising and marketing team and appealed for volunteers to return. We were looking for “Chatty Companions” – people who could spend time with residents on a one-to-one basis, doing puzzles, reading newspapers and helping residents stay in touch with the outside world."
        },
        {
            "text": "We also looked for people to help the wellbeing team with various activities, including music, arts and crafts, quizzes and debating, and inspiring residents to join the fun. And we wanted people to help with the many outings we provide. We promoted this in local media and on social media and received a fantastic response."
        },
        {
            "heading": 2,
            "text": "Volunteering is a win/win"
        },
        {
            "text": "While volunteers can’t help our healthcare assistants and nurses with the delivery of care, there is no doubt the whole team reaps the benefits of their support, giving them more time to focus on the wellbeing of residents. This, in turn, leads to improved physical health, reducing the need for medical intervention, which eases workload pressure on care staff."
        },
        {
            "text": "Not all our volunteers are based in the home. We recently launched a Telephone Friendship Service. Volunteers call veterans and their partners who live in their own homes, anywhere in the country. The aim is to provide support and a friendly voice to someone who is feeling lonely or isolated, or who would simply like a chat."
        },
        {
            "text": "Volunteers often speak of the joy they get from spending time with our residents and helping staff focus on delivering great care. One said: “I give up my time, but I get so much back in return. I come away feeling elated, nourished and always glad I went.”"
        },
        {
            "text": "Find out more about the NHS and Care Volunteer Responders Programme and how it could support your care service or set you on the path to becoming a volunteer yourself."
        }
    ]
}