{
    "url": "https://insidehmcts.blog.gov.uk/2024/01/10/58-years-of-service-a-remarkable-journey-of-dedication-and-justice/",
    "title": "58 years of service: A remarkable journey of dedication and justice",
    "authors": [
        "Sarah Davies, Head of Crime Communications and Engagement"
    ],
    "categories": [
        "Crime",
        "Interviews",
        "Working at HMCTS"
    ],
    "pub_date": "2024-01-10T11:30:15+00:00",
    "content": [
        {
            "text": "[English] - [Cymraeg]"
        },
        {
            "text": " "
        },
        {
            "text": "In an organisation with many people dedicating their whole career to public service, few could beat Brian's contribution.  "
        },
        {
            "text": "He started working for HMCTS in the magistrates’ courts in January 1966, and in January 2024 will celebrate his 80th birthday and 58th year of working for the courts system, making him one of our longest serving members of staff."
        },
        {
            "text": "With a career spanning as long as Brian’s, he’s seen it all – from infamous London gangsters to high profile footballers in the dock and even appearing on the front of the News of the World, he certainly has a story or two to share. Ahead of his 58th work anniversary, we sat down with Brian to find out more about his extraordinary career and mark his exceptional contribution to public service.  "
        },
        {
            "text": "He originally started his career as an usher court assistant at the old Thames Magistrates’ Court, after a tip off from his soon to be father-in-law who worked with someone whose son worked at Bow Street Magistrates’ Court. Brian admits he didn’t know a great deal about the work of the courts or quite what to expect before he joined: "
        },
        {
            "text": "Brian worked his way up before qualifying as a legal adviser in 1970 and eventually becoming bench legal manager at Barking and Barkingside Magistrates’ Court where he was responsible for training the magistrates and committee work. No two days in the courts are the same, and it’s the variety of the role and the range of people involved that Brian really enjoys: "
        },
        {
            "text": "He has also trained many legal advisers over his career and shared a few tips for ensuring new joiners felt welcomed to the courts: "
        },
        {
            "text": "Brian is clearly very well-liked and respected by those who he’s trained, including Tom Ring, now Deputy Director of Legal Operations. Tom started out under Brian at Barking when he joined HMCTS in 1987 and reflected on some of his memories of him: "
        },
        {
            "text": "Brian also shared his advice for those considering a career as a legal adviser or those just starting out: "
        },
        {
            "text": "His sage advice is testament to his humanity towards those who find themselves at the court – one of HMCTS’ core values: "
        },
        {
            "text": "And he clearly has a passion for the work of the courts and the satisfaction he gets from helping those in court and told us he has no plans to retire anytime soon:  "
        },
        {
            "text": "From everyone at HMCTS – a massive thank you to Brian for his dedication over the past 58 years. We all wish him the very best as he celebrates his 80th birthday with his family."
        },
        {
            "text": " "
        },
        {
            "text": "[English] - [Cymraeg]"
        },
        {
            "text": " "
        },
        {
            "heading": 1,
            "text": "Dathlu 58 mlynedd o wasanaeth - blynyddoedd maith o ymroddiad a gweinyddu cyfiawnder"
        },
        {
            "text": "Mewn sefydliad lle mae cymaint o bobl yn ymroi eu gyrfa’n llwyr i wasanaeth cyhoeddus, mae’n anodd meddwl am neb sy’n gallu curo cyfraniad Brian Gilbert.  Dechreuodd weithio i GLlTEF yn y llys ynadon ym mis Ionawr 1966 ac yn ystod mis Ionawr eleni bydd yn dathlu ei benblwydd yn 80 oed a 58 mlynedd o weithio yn y llysoedd.  Does syndod felly ei fod yn un o’n staff sydd wedi rhoi’r gwasanaeth hwyaf i ni."
        },
        {
            "text": "O gael gyrfa mor faith mae ganddo sawl stori i’w rhannu ac mae wedi gweld llawer yn ymddangos yn y doc – o droseddwyr mwyaf enwog Llundain i bêl-droedwyr adnabyddus ac mae hyd yn oed wedi ymddangos ar dudalen flaen y News of the World.  Wrth iddo ddathlu 58 mlynedd o wasanaeth bu i ni gael sgwrs gydag ef i gael gwybod mwy am ei yrfa arbennig ac i nodi ei gyfraniad anhygoel i wasanaeth cyhoeddus."
        },
        {
            "text": "Dechreuodd Brian ei yrfa fel tywysydd cynorthwyol yn hen Lys Ynadon Tafwys a hynny yn sgïl ei ddarpar dad yng nghyfraith a oedd yn gweithio efo rhywun a oedd a’i fab yn gweithio yn Llys Ynadon Bow Street  yn sôn wrtho am y swydd."
        },
        {
            "text": "Cyfaddefodd nad oedd yn gwybod nemor ddim am waith y llys na beth i’w ddisgwyl cyn dechrau ar ei waith:"
        },
        {
            "text": "Gweithiodd Brian ei ffordd i fyny’r ysgol gan gymhwyso fel cynghorydd cyfreithiol yn 1970 ac ymhen amser daeth yn rheolwr cyfreithiol y fainc yn Llys Ynadon Barking a Barkingside lle roedd yn gyfrifol am hyfforddi ynadon a gwaith pwyllgor.  Roedd y gwaith yn amrywio o ddydd i ddydd a’r amrywiaeth hyn ynghyd â’r bobl oedd yn apelio fwyaf ato:"
        },
        {
            "text": "Bu i Brian hefyd hyfforddi nifer o gynghorwyr cyfreithiol yn ystod ei yrfa gan rannu ambell i gyngor ar sut i groesawu rhai newydd i’r llys:"
        },
        {
            "text": "Mae Brian yn boblogaidd ac uchel ei barch gan y rhai y bu’n eu hyfforddi, gan gynnwys Tom Ring sydd bellach yn Ddirprwy Gyfarwyddwr Gweithrediadau Cyfreithiol.  Dechreuodd Tom o dan adain Brian yn Barking pan ymunodd gyda GLlTEF yn 1987 a dyma rai o’i atgofion amdano:"
        },
        {
            "text": "Bu i Brian hefyd roi cyngor i’r rhai sy’n ystyried gyrfa fel cynghorydd cyfreithiol neu rai sydd megis yn cychwyn ar eu gyrfa:"
        },
        {
            "text": "Mae cyngor doeth Brian yn cyd-fynd gyda’i ddynoliaeth tuag at y rhai sy’n gorfod dod i’r llys – un o werthoedd creiddiol GLlTEF:"
        },
        {
            "text": "Mae’n amlwg bod Brian yn angerddol am waith y llysoedd a’r boddhad mae’n ei gael o helpu y rhai sy’n dod i’r llys a dywedodd nad yw’n bwriadu ymddeol yn y dyfodol agos:"
        },
        {
            "text": "Ar ran pawb ohonom yn GLlTEF hoffem ddiolch o waelod calon i Brian am ei ymroddiad dros 58 mlynedd a dymuno’n dda wrth iddo ddathlu ei benblwydd yn 80 oed efo’i deulu."
        }
    ]
}