{
    "url": "https://socialcare.blog.gov.uk/2024/01/10/boosting-careers-in-adult-social-care/",
    "title": "Boosting careers in adult social care",
    "authors": [
        "Oonagh Smyth"
    ],
    "categories": [
        "Care and support",
        "Social care reform",
        "Workforce"
    ],
    "pub_date": "2024-01-10T15:08:08+00:00",
    "content": [
        {
            "heading": 2,
            "text": "A positive direction for social care"
        },
        {
            "text": "I’m pleased we've begun 2024 with the Government's announcement of this workforce reform package. This includes the first version of a Care Workforce Pathway (‘Pathway') and a new Care Certificate qualification."
        },
        {
            "text": "Both developments will be essential in supporting learning and development opportunities for people who work in adult social care, as well as boosting recruitment and retention, which are persistent challenges for employers."
        },
        {
            "text": "Previously, there was no consistent career structure or clear articulation of the level of knowledge, experience and skill required to deliver high-quality, personalised care and support."
        },
        {
            "text": "The Pathway will help to articulate what a career in social care means and what is expected of those supporting people who draw on care and support."
        },
        {
            "text": "Critically, it will make sure colleagues working in social care are recognised as the skilled and committed professionals they are and supported to develop in their long-term roles."
        },
        {
            "heading": 2,
            "text": "The sector wants this"
        },
        {
            "text": "From discussions and responses to the call for evidence, it's clear there has been enthusiasm across the sector for the new Pathway. It will develop a universal understanding among people working in care, those drawing on care and support, employers, and commissioners, about the roles that exist in social care and what they offer."
        },
        {
            "text": "Following the Call for Evidence last year, the first phase of development is now complete. The DHSC and Skills for Care partnership benefited from invaluable support from and collaboration with:"
        },
        {
            "text": "This initial phase focused on articulating the knowledge, skills and behaviours associated with roles providing direct care; from those new to care, to those leading in specialist areas of practice. Importantly, it also articulated the values people working in care need to demonstrate. I’m now very excited to see the next phase of this work carried into other parts of the workforce."
        },
        {
            "text": "I’m also really pleased to see the development of the new Care Certificate qualification. We recommend everyone new to social care completes the Care Certificate as part of a robust induction process. We know from our data that 65% of direct care providing staff who’ve started work in the sector since January 2015 have engaged with the Care Certificate."
        },
        {
            "text": "Its further development will transform the certificate into a recognised qualification, something the sector has wanted to see for a long time."
        },
        {
            "text": "Skills for Care has been working on developing the content of the qualification, in collaboration with the sector through a series of focus groups and stakeholder meetings."
        },
        {
            "heading": 2,
            "text": "The work goes on"
        },
        {
            "text": "Over the next few months, awarding organisations will be using the content to create and launch their qualifications.  We expect these to be available to the sector in the summer."
        },
        {
            "text": "The new qualification reflects the existing content of the Care Certificate standards, with some updates based on emerging themes, such as personal wellbeing, digital skills and equality and diversity."
        },
        {
            "text": "The aim is to improve portability of the Care Certificate between different employers by creating a more robust delivery, assessment, and standardisation process."
        },
        {
            "text": "Skills for Care is looking forward to supporting DHSC with the next steps in both pieces of work and seeing the benefits they will bring to the sector in 2024 and beyond."
        }
    ]
}