{
    "url": "https://educationhub.blog.gov.uk/2024/01/family-hubs-everything-you-need-to-know/",
    "title": "Family hubs: Local support and advice for children and their families",
    "authors": [
        "mediaofficer"
    ],
    "categories": [
        "Families"
    ],
    "pub_date": "2024-01-10T09:15:13+00:00",
    "content": [
        {
            "text": "Whether you’re a parent looking for help with infant feeding, developing your child’s early language skills, or mental health support, family hubs provide a range of useful services for families in one location."
        },
        {
            "text": "Family hubs are now open in 75 local authorities, making it easier for families in those areas to access the vital services they need, and helping to improve health and education outcomes."
        },
        {
            "text": "We have also launched a series of free resources and advice to help parents make the most of every little moment together – even waiting for a bus or shopping together – to further their child’s development and make sure they have the best."
        },
        {
            "text": "Here’s what you need to know about family hubs, including where you can find your local hub."
        },
        {
            "heading": 3,
            "text": "What are family hubs?"
        },
        {
            "text": "Family hubs bring together different services in a ‘one stop shop’ to make it easier to get the help you and your family need."
        },
        {
            "text": "They provide a single place to go for face-to-face support and information from a variety of services."
        },
        {
            "text": "Family hubs make it easier for you to get the support you need, with trained staff on site who work together to help you overcome difficulties you might be facing."
        },
        {
            "text": "Services will vary, but at the heart of all family hubs are services for families with 0 to 2 year-olds, which give babies a great start for life."
        },
        {
            "text": "Services could include:"
        },
        {
            "text": "Family hubs could also help you access other support services that help your family, such as:"
        },
        {
            "heading": 3,
            "text": "Who are family hubs for?"
        },
        {
            "text": "You can get support from a family hub if you’re:"
        },
        {
            "heading": 3,
            "text": "Where can I find my local family hub?"
        },
        {
            "text": "Family hubs are currently only available in certain parts of England. Find out whether you have a local family hub here."
        },
        {
            "text": "If there are no family hubs in your local area you can find your local council and search for family support services, or find learning activities for your child."
        },
        {
            "heading": 3,
            "text": "Why are family hubs so important? "
        },
        {
            "text": "All kinds of families face challenges from time to time. Family hubs make it simpler to get the help that the whole family needs."
        },
        {
            "text": "Investing in families and making sure they get the support they need from birth through to adulthood helps with children’s educational attainment, wellbeing and life chances."
        },
        {
            "text": "We also know that the time from conception to the age of 2 lays important foundations for children’s emotional and physical development. We want to support parents through the early years of a child’s life, understanding how challenging it can be."
        },
        {
            "text": "By helping to establish nurturing, supportive environments for the youngest members of society, family hubs will make it easier for parents and carers to give their children the best start in life."
        }
    ]
}