{
    "url": "https://naturalengland.blog.gov.uk/2024/01/10/natural-england-welcomes-oxford-farming-conference-announcements/",
    "title": "Natural England welcomes Oxford Farming Conference Announcements",
    "authors": [
        "Natural England"
    ],
    "categories": [
        "Natural England"
    ],
    "pub_date": "2024-01-10T09:40:57+00:00",
    "content": [
        {
            "text": "By Geoff Sansome, Head of Agriculture for Natural England"
        },
        {
            "text": "Last week, I was delighted to be part of the Oxford Farming Conference and it is an honour to have been announced as the Chair of the conference next year."
        },
        {
            "text": "The theme this year was “The Power of Diversity”, covering all aspects of diversity in farming, and it was inspiring to hear from a wide range of speakers as well as chatting with many of the people that make our industry so special. During the conference, I was pleased to hear our Environment Secretary, Steve Barclay, announce a series of upgrades to the government’s environment and land management schemes."
        },
        {
            "text": "At Natural England, our priority is to work for the combined interests of nature and farmers who are key to restoring and managing the health of our natural environment as part of their everyday farming business. We welcome the government’s commitment to raise environmental ambition alongside sustainable food production, and make it easier for more farmers to enter the schemes and deliver positive outcomes for the environment."
        },
        {
            "text": "Natural England has worked extensively with Defra to provide technical advice on these new and revised actions and it’s great to see them well received. We’re pleased to see new actions on offer for livestock farmers where their grazing actions support some of our most important habitats on protected sites in the uplands and lowlands, while a new action that pays £1,070 per hectare for managing species-rich floodplain meadows is timely and will reward those farmers working with and storing water for the benefit of others. The schemes will continue to support some of our most threatened plant, animal and farmland bird species and we also welcome a new set of actions to help farmers control those non-native plant and mammal species competing within and damaging some of our most precious native habitats."
        },
        {
            "text": "We also welcome the introduction of premium payments for a range of actions providing the biggest environmental impacts or combinations of actions that deliver benefits at scale. Not only will these help address some of the biggest challenges we have around our valuable water, peat and moorland resources, they will also provide an opportunity to build on innovative approaches to Agroforestry with six new options ranging from £248-849 per hectare."
        },
        {
            "text": "Existing farmers who are embracing No-Till and a range of Precision Agriculture practices will now be rewarded for their innovation, and the incentive is there for others considering changing. Along with the other arable options already launched there is now a comprehensive set of actions and incentives to shift arable farming systems and soil management into a more regenerative space, benefitting bottom lines and the environment."
        },
        {
            "text": "In addition, new funding has been announced for farmers and landowners who want to create, maintain and upgrade permissive footpaths and bridleways. This is a welcome reintroduction of these options which many farmers have asked for since their demise from previous schemes and will help us to meet Environment Improvement Plan targets to increase access to nature and encourage more people to explore and connect with England’s countryside, farmland and woodland."
        },
        {
            "text": "It’s vital we support farmers to take care of our countryside and help nature recover. Our farm advisers will continue working with farmers and landowners across the country to help them submit their Countryside Stewardship Higher Tier applications, and we’re involved in delivering over 50 Landscape Recovery Projects that are supporting net zero, protected sites and habitat creation at a landscape scale."
        },
        {
            "text": "We look forward to hearing more information from Defra about how these upgrades will be delivered so we can support even more farmers and meet our nature recovery targets under the Environmental Improvement Plan."
        },
        {
            "text": " "
        }
    ]
}