{
    "url": "https://ruralpayments.blog.gov.uk/2024/01/10/rpa-2023-external-engagement-roundup-what-a-year/",
    "title": "RPA 2023 External engagement roundup - what a year!",
    "authors": [
        "RPA Editor"
    ],
    "categories": [
        "External engagement"
    ],
    "pub_date": "2024-01-10T11:44:02+00:00",
    "content": [
        {
            "heading": 5,
            "text": "RPA colleagues Sam Taylor, Holly Harbour, Hebe Adams and Robin Williams"
        },
        {
            "text": "We take a look back at our external engagement across 2023."
        },
        {
            "text": "We committed to getting out and about to engage with more farmers and rural communities than ever before. We’ve listened, taken onboard feedback and shared information on our schemes and services. We’ve increased our face-to-face engagement and offered our support to those navigating the agricultural transition."
        },
        {
            "heading": 2,
            "text": "Shows and Events"
        },
        {
            "text": "Our cornerstone of external engagement is our shows and events calendar and in 2023 we’ve attended more than ever across the country – 29 to be exact! We listened to feedback from the previous year and increased our presence to engage with more farmers and rural communities. We’ve had over 2,000 conversations at these events covering Sustainable Farming Incentive (SFI), Countryside Stewardship (CS), Basic Payment Scheme (BPS) and Grants."
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "heading": 5,
            "text": "Colleagues at a joint RPA and DEFRA stand"
        },
        {
            "text": "Our Shows and Events manager Sam Taylor said:"
        },
        {
            "text": "As well as farmers, land managers and agents we were also pleased to see Ministers, RPA Non Executive Directors, RPA Directors and our CEO visit our stand. This gave them the chance to hear directly from our customers."
        },
        {
            "text": "We also offer the opportunity for colleagues in the Agency to get involved and come along to our events to assist. This year we had 95 RPA staff join us at these events, bringing with them a breadth of knowledge and also serving as a development opportunity for many of them to do something a little different to the day job."
        },
        {
            "text": "But our attendance at shows is only one aspect of our external engagement."
        },
        {
            "heading": 2,
            "text": "MP Roundtables"
        },
        {
            "text": "Our MP Roundtables really ramped up in 2023, with 17 events held across the year. We had over 500 attendees at these sessions, and they were a great way to speak to farmers and land managers from all areas of the country. We worked alongside the MP’s office for each local constituency to ensure the events were meeting the needs of the constituents. We created a joined-up approach with colleagues from the Farming Programme in Defra, the Forestry Commission and Natural England."
        },
        {
            "text": "The Roundtables usually start with a presentation from RPA colleagues, followed by updates from other organisations in attendance, giving an update on the RPA 5 year strategy, our plans for working with rural communities and how we’ve been working to improve the customer experience. There is always time for a Q&A session and hot topics always centre around our main schemes - SFI, CS and the phase out of BPS – along with queries around our Grant schemes."
        },
        {
            "text": "To find out more about an MP roundtable, read the blog we published last year following the Roundtable with Dr Neil Hudson MP in Penrith and the Border constituency."
        },
        {
            "heading": 2,
            "text": "Ambassadors"
        },
        {
            "text": "Many of our people live and work in the communities we serve and are passionate about meeting our customers and developing their engagement skills, so this year we are proud to have rolled out our Ambassador network."
        },
        {
            "text": "An RPA Ambassador is someone who represents the RPA by engaging with a wide variety of people including farmers, stakeholders and careers partners to listen, share information and gather feedback. Our ‘Pathfinders’, a group of 20 colleagues from across the Agency, started their bespoke training in early summer and we now have around 100 Ambassadors signed up to the network."
        },
        {
            "text": "They attended 35 engagement events including, agricultural shows and MP roundtables, and as word of the network has begun to spread, we’ve received more invitations to events to build relationships with local communities. We’ve welcomed new opportunities, including working with the National Federation of Young Farmers Clubs and the Herefordshire Rural Hub."
        },
        {
            "text": "Helen Copeland, RPA Ambassador said:"
        },
        {
            "heading": 5,
            "text": "Helen Copeland, RPA Ambassador with her horse Mischief"
        },
        {
            "heading": 2,
            "text": "Other Opportunities"
        },
        {
            "text": "As well as the usual shows, events and MP Roundtables, we’ve undertaken some less ‘run of the mill’ opportunities too. Attending local events hosted by rural hubs and facilitation groups across the country."
        },
        {
            "text": "Sandy Kapila, Head of External Affairs, also had the opportunity to chat about the RPA’s progress to farmer Olly Harrison as he, and 3 others, drove a combine harvester from John o’ Groats to Land’s End. Sandy said:"
        },
        {
            "heading": 5,
            "text": "Sandy Kapila with Olly Harrison in the combine harvester"
        },
        {
            "text": "Sandy regularly posts about his travels around the country on X (formerly Twitter). You can follow him @KapilaSandy for more information."
        },
        {
            "text": "Our 2024 external engagement calendar is fuller than ever, and we are looking forward to getting out to meet even more people over the coming months."
        },
        {
            "text": "Our Shows and Events schedule will be published shortly, so keep an eye out on the blog for more information."
        }
    ]
}