{
    "url": "https://nationalscreening.blog.gov.uk/2024/01/10/uk-nsc-publishes-new-declaration-of-interests-guidance/",
    "title": "UK NSC publishes new declaration of interests guidance",
    "authors": [
        "Dexter Berridge"
    ],
    "categories": [
        "General"
    ],
    "pub_date": "2024-01-10T15:34:38+00:00",
    "content": [
        {
            "text": "The UK National Screening Committee (UK NSC) has updated its guidance and processes for individuals working with the committee to declare any of their interests that may conflict, or be perceived to conflict, with that work."
        },
        {
            "text": "The UK NSC holds members and stakeholders to the highest standards of integrity in line with its code of practice and values of independence, accountability and transparency."
        },
        {
            "text": "The new approach to declarations of interest forms part of the UK NSC’s expanded stakeholder engagement activities. As the committee reaches out to more and more diverse voices, it is essential that it maintains its independence, transparency, integrity, objectivity and public trust."
        },
        {
            "text": "The committee engages heavily with scientific experts, patient groups, condition-specific charities, industry, and other public bodies as part of its routine work in assessing the evidence base for screening."
        },
        {
            "text": "It is the responsibility of all individuals involved with and engaged by the UK NSC to make sure they disclose any actual, potential or perceived conflicts of interest before their involvement."
        },
        {
            "text": "We expect the new DOI process to evolve over time and we will keep you updated via the blog. We will publish further details and changes as they arise."
        },
        {
            "text": "The UK NSC will continue to publish and update its public register of interests that have been declared by members of the committee and its expert groups."
        },
        {
            "heading": 2,
            "text": "Keep up to date"
        },
        {
            "text": "The UK NSC blog provides up to date news from the UK NSC. You can register to receive updates direct to your inbox, so there’s no need to keep checking for new articles. If you have any questions about this blog article, or about the work of the UK NSC, please email screeninginformation@dhsc.gov.uk."
        }
    ]
}