{
    "url": "https://socialcare.blog.gov.uk/2024/01/10/unleashing-career-potential-in-adult-social-care/",
    "title": "Unleashing career potential in adult social care",
    "authors": [
        "Deborah Sturdy"
    ],
    "categories": [
        "Care and support",
        "Leadership",
        "Social care reform",
        "Workforce"
    ],
    "pub_date": "2024-01-10T15:33:49+00:00",
    "content": [
        {
            "heading": 2,
            "text": "New package of training, support and professional development"
        },
        {
            "text": "It feels like a long time coming (and there’s nothing wrong with extensive preparation to get things right) but finally, the Department of Health and Social Care has announced a package of measures to elevate the true value, variety and career potential of social care."
        },
        {
            "text": "For the first time, there will be a national care career structure, the Care Workforce Pathway, with clearly defined roles and routes to professional development, underpinned with quality training and opportunities to discover the rewarding reality of the care sector first hand."
        },
        {
            "text": "A new, accredited qualification, the Care Certificate, is also being introduced to further recognise and validate the work done by 37,000 colleagues. It is a benchmark standard, giving peace of mind to residents, families and care providers that people with the right skill set and values are joining the profession. This new qualification is portable, ending the need to waste time and resources retraining for skills already demonstrated in previous roles."
        },
        {
            "text": "There will also be funding for hundreds of apprenticeships and digital training places so that new and existing care colleagues can keep pace with - and make use of - the latest digital and technological innovations in social care."
        },
        {
            "heading": 2,
            "text": "Concerted effort by the sector"
        },
        {
            "text": "This robust package of reforms has been developed in close partnership with Skills for Care, Think Local Act Personal, the wise counsel of Lyn Romeo, Chief Social Worker for Adults and her network of principal social workers, care colleagues, those with lived experience and the wider sector. Find out more about our valued sector partners' contributions in this great blog from Skills for Care's Chief Executive, Oonagh Smyth."
        },
        {
            "text": "The overall aim, from the outset, has been to provide better training, clearer career paths and improved job prospects for the domestic care workforce. More importantly, it’s about attracting, nurturing and retaining great colleagues with the experience and expertise to deliver truly transformative care and support to those who need it most."
        },
        {
            "text": "Backed by £75 million in funding, the announcement is well timed as it coincides with another concerted push in our Made with Care recruitment campaign. Now more than ever, there are long term incentives for people considering this exciting, evolving and rewarding career."
        },
        {
            "text": "2024 has therefore got off to a positive start with this announcement. With work also continuing to elevate and embed the practice and voice of adult social care nurses (a new professor of adult social care nursing, nursing leadership programmes for global majority nurses, and the expansion of our research and evidence base), I believe we’re entering a new era for social care, where our skills, experience and values are recognised and used to transform many more lives for the better."
        }
    ]
}