{
    "url": "https://governmentscienceandengineering.blog.gov.uk/2023/03/22/celebrating-international-womens-day/",
    "title": "Celebrating International Women’s Day",
    "authors": [
        "gseprofession"
    ],
    "categories": [
        "Guest Blog"
    ],
    "pub_date": "2023-03-22T10:53:33+00:00",
    "content": [
        {
            "text": "Mary De Silva Deputy, Chief Scientific Adviser and Head of the Science and Engineering Profession (HoSEP) at Department of Health and Social Care (DHSC)"
        },
        {
            "text": "We know that Science, Technology, Engineering and Mathematics (STEM) subjects have a positive impact on the economy and society.  We also know that many fewer girls than boys choose them. If we are to grow our skills as a country, half the population need to see STEM as a viable option for them. My own story bears this out. I wanted to do Maths A-level (alongside my eclectic choice of Biology and English), but few girls did maths, and to be honest I didn’t fancy competing with my older brother for whom Maths was a natural language. It’s a decision I regret to this day. I went on to study Anthropology at Uni (which I loved), but I only managed to get into the science I am really passionate about through higher degrees in Epidemiology where I scoured A-Level maths textbooks to survive the statistics classes."
        },
        {
            "text": "We have some incredible women working in science across DHSC, and it is wonderful to be able to celebrate all our female scientists today.  The two stories from Glasha and Darshi below provide an intimate and enlightening insight into how women from very different backgrounds and with different experiences can carve a successful career in science. The work we do in the department is made better by these diverse voices – we should celebrate and support them."
        },
        {
            "text": "Dr Glasha Frank, Head of the Better Care Fund"
        },
        {
            "text": "As far back as I can remember, I’ve always been interested in Science and Maths and my life’s ambition was to be a doctor. I grew up in St Kitts in the West Indies where I benefitted from a strong national promotion of STEM subjects; where careers in medicine and engineering were celebrated. While I loved Maths and Science in secondary school, I struggled to get good grades in Chemistry and Biology. I remember pleading with my Biology teacher to allow me to sit the Caribbean Examination Council (CXC) exams (which were the GCSE equivalent in the Caribbean at the time). I clearly remember him throwing his hands up in the air and saying ‘Ok, if you want to fail, go ahead’."
        },
        {
            "text": "I did not fail (though I did not do particularly well either); but with much hard work and dedication, I went on to excel (to my utter surprise) in Chemistry, Biology and Maths at ‘A’ level. I completed an undergraduate degree in Clinical Science from Kings College London in 2002, before graduating from the same Medical School in 2007."
        },
        {
            "text": "After 6 years as a doctor,  I now work in health policy; and my approach to policy development is greatly influenced by my background in STEM. I have a very logical mind that craves clarity, specificity and ultimately- answers. This was a driver for me completing an MSc. in Health Policy.  I prioritise evidence, and an understanding of ‘what works’. When there are issues with policy implementation, it is imperative that I understand what went wrong first and build in a policy ‘fix’ before proceeding with more action. I greatly value the knowledge gained from ‘experiments’ or ‘pilots’ and see them as vital to understanding the likely impact of wider roll out of national policy."
        },
        {
            "text": "I am black and female, with a background in STEM/Medicine, who now works on government policy in the Civil Service. I am fiercely proud of, and seek to preserve, the uniqueness of the perspective that I bring. I was not always appreciative of this though. It is impossible to not notice the lack of diversity and representation for someone like me across STEM professions, including in the Civil Service. That can create a false ‘glass ceiling’. But my journey has taught me that really the only requirement for an exciting career in STEM is an enquiring mind, dedication, commitment and self-belief!"
        },
        {
            "text": "Darshi Veluppillai, Adult Safeguarding Official"
        },
        {
            "text": "Not many of my colleagues know this but I went to medical school. However, after failing my second year exams I questioned whether medicine was still for me and having seen the realities of life as a doctor I decided it wasn’t for me and left medicine."
        },
        {
            "text": "Unlike traditional medical schools at the University of East Anglia I was lucky to have patient contact from the first week, with weekly General Practice (GP) placements and hospital placements every term. Interacting with patients and doctors helped me understand the challenges they face beyond what was described in lectures, such as the difficulty of providing personal care in 10 minute GP appointments, or not seeing the full patient journey as a hospital specialist. Whilst my policy work so far hasn’t engaged with NHS policies, following my experience at medical school I can appreciate some of the stresses NHS staff are under."
        },
        {
            "text": "After medicine I strategically got myself onto a Biomedical Sciences course, thinking I’d have a head start having done two years of Medicine! After graduating I then landed my first job which led me to the world of medical communications (Medcomms). During my 2 years in a Medcomms agency I developed and monitored budgets and delivery plans for projects commissioned to the agency by pharmaceutical companies. I have definitely applied the project planning and financial management skills developed from this role to my policy work; for example developing publication timelines, organising stakeholder engagement events, and even ensuring purchase orders are monitored and policy work is delivered within the allocated budget."
        },
        {
            "text": "After realising the private sector wasn’t for me I left Medcomms and started a Master’s in Public Health (MPH) part time; and to fund my MPH I looked for part-time roles which led me to my first role at DHSC! Unsurprisingly I constantly apply the skills I developed during my MPH to my policy work. From critically analysing policies, applying theoretical models of policy development, and tailoring policies to meet the needs of the population; applying the theory from the course to address the policy challenges I have had during my time at DHSC has been invaluable."
        },
        {
            "text": "Whilst my professional experiences have helped my policy work; as a female, Sri Lankan, practicing Hindu I also bring a lot to the table due to the personal experiences I have had. I have come to appreciate the experiences I have had growing up due to my background are often different to those of my colleagues, and that this is the value I can bring to policy discussions. For example, I want to make sure the development and delivery of policies have taken into account whether the policy may impact people who look like me differently, and if so how should the policy be tailored so it impacts every member of society equitably."
        },
        {
            "text": "Diversity of thought is extremely important in policy making, and the value I bring as a Sri Lankan woman ensures people in society like me, whether they are an ethnic minority, a 0woman, grew up in an immigrant community, or anything else, are not forgotten about during policy discussions. Therefore, for any girl or woman, especially from a minority background, considering a career in policy please know that your input will be highly valued, and you have a lot to bring to the table."
        },
        {
            "text": "To find out more about the Government Science and Engineering Profession please email GSE@go-science.gov.uk"
        }
    ]
}