{
    "url": "https://hmlandregistry.blog.gov.uk/2023/03/22/celebrating-conveyancers/",
    "title": "Celebrating conveyancers",
    "authors": [
        "Mike Harlow, Deputy Chief Executive and Director of Customer and Strategy"
    ],
    "categories": [
        "Law and practice"
    ],
    "pub_date": "2023-03-22T13:55:00+00:00",
    "content": [
        {
            "text": "As this week is the first National Conveyancing Week, we wanted to take the opportunity to join others in showing our appreciation for all those who work in the profession."
        },
        {
            "text": "It has been a tough few years that has seen unprecedented sharp rises in volumes. And yet conveyancers have found a way through. Millions are now in their new home thanks to the care and attention paid by their hard-working conveyancer."
        },
        {
            "text": "Buying or selling a property is usually one of the most serious transactions any of us will ever undertake and it is often emotionally charged. Having an expert professional on your side, looking out for your interests at such a time, is essential. And, of course, HM Land Registry relies on the conveyancer’s professionalism in keeping property ownership accurate and secure."
        },
        {
            "text": "Conveyancers are critical for a healthy property market. And yet we know that recently you have often been working in an intensely pressured environment, with high workloads. SearchAcumen reported recently that average workloads have increased 15% for conveyancers, despite a less than 1% increase in law firm capacity over the same time."
        },
        {
            "text": "LawCare, the mental health charity for legal professionals, has also recently highlighted that 22% of conveyancers are concerned about their careers. This is up from 8% the previous year."
        },
        {
            "text": "So, we wanted to join the Conveyancing Foundation's campaign to #ShareTheLove, as part of National Conveyancing Week."
        },
        {
            "heading": 2,
            "text": "Working together"
        },
        {
            "text": "There will of course be some who would say, ‘you could help by increasing your speed of service at HMLR’ and they would be right."
        },
        {
            "text": "We do understand the situation and we are working to make things easier for you. It is our first priority."
        },
        {
            "text": "The unprecedented spikes in market volumes have affected us too. So, we have increased our overall caseworker resource by around 1,000 in the last few years to help process additional cases. We have created dedicated teams specifically focused on handling our oldest complex cases. We have invested in a Land Registration Academy to train our colleagues, boosting their expertise and accuracy in handling applications."
        },
        {
            "text": "We want to build resilience into land registration processes so that they can cope with significant changes in market activity without impairing service times. That’s why we are also working to increase the amount of cases that can be safely automated. This will be truly transformative. There is the potential to process instantly 70% or more of applications that are currently processed manually."
        },
        {
            "text": "We serve conveyancers so that they can serve their clients. That’s why our decisions are always going to be based on what you tell us. We conduct a lot of research and user-testing, with our digital services, to ensure we are making decisions based on what our customers need. We wrote about our research in January, showing how you can sign up to our research panel if you wish to contribute your views, and you can find out more on our research pages."
        },
        {
            "text": "We hope that everyone in conveyancing has found time to learn, celebrate and enjoy during this first National Conveyancing Week."
        },
        {
            "text": "Thank you, from everyone at HM Land Registry, for all that you do."
        }
    ]
}