{
    "url": "https://naturalengland.blog.gov.uk/2023/03/22/homes-around-the-heathland-giving-people-and-wildlife-the-best-place-to-live/",
    "title": "Homes around the heathland: Giving people and wildlife the best place to live",
    "authors": [
        "Allison Potts"
    ],
    "categories": [
        "Special Protection Area"
    ],
    "pub_date": "2023-03-22T08:43:20+00:00",
    "content": [
        {
            "text": "By Allison Potts, Thames Solent Area Manager"
        },
        {
            "text": "Nestled amongst the gorse and scrub of the Thames Basin Heath’s Special Protection Area lie some of the most important habitats for ground-nesting birds in the world."
        },
        {
            "text": "The nightjar, Dartford warbler and woodlark are all protected species, amongst many others, who make their home here, in the low-lying heathland, dotted across 8,200 hectares of Surrey, Hampshire and Berkshire."
        },
        {
            "text": "Surrounding this protected heathland is some of the most sought-after residential space in the country, with plenty of people also vying to make their home here."
        },
        {
            "text": "Amongst beautiful countryside, near to London, it is a prime location to help address England’s housing shortage, where over the last decade, Local Authorities planned to build upwards of 50,000 homes close to the heathland."
        },
        {
            "text": "The need to protect and enhance the precious wildlife and heathland might seem in conflict with the requirement to build so many homes. However, here across the Thames Basin heaths, we have been part of an innovative partnership that has managed to positively impact all parties - the protected sites, the protected species, developers and residents - both new and existing."
        },
        {
            "text": "It exemplifies how to embed quality green infrastructure in residential areas, giving people the chance to live within a 15-minute walk of green space. This proximity to green space has now become a key commitment for the whole country in the Government’s recent Environmental Improvement Plan."
        },
        {
            "text": "The Thames Basin Heaths Partnership is now a decade-old collaboration between Natural England, landowners, Local Authorities and environmental organisations. It was created to avoid negative impacts from a growing population on the protected sites and species of the heathland, and to turn this into a positive opportunity for the people and nature that live in the area."
        },
        {
            "text": "The partnership developed two new, developer-funded programmes which, due to their success, have now been rolled out in similarly important protected places across the country."
        },
        {
            "text": "The first was the creation of Suitable Alternative Natural Greenspaces, known as SANGs, which put simply means, more green spaces. There are now over 80 SANGs in and around the Thames Basin heaths, creating nearly 2000ha of additional or augmented green space. This alleviates pressure on the heathland, giving the protected birds the space they need."
        },
        {
            "text": "This additional space is particularly enjoyed by dogwalkers whose dogs can run off-lead without disrupting the birds and other species. On the heath, dogwalkers continue to be some of the most regular users of the heathland and while keeping their dogs on the paths, act as fantastic eyes and ears for potential fire risks which pose a huge threat to nesting birds."
        },
        {
            "text": "The additional green spaces have a wider impact too. They’ve turned agricultural fields or wasteland into nature-rich habitats with otters, Cinnabar moths and rare orchids now recorded in the area. This gives the residents more opportunities to enjoy nature locally, benefitting their mental and physical health, and overall makes this a great nature-filled place to live."
        },
        {
            "text": "The second aspect is called Strategic Access Management and Monitoring (SAMM) and centres on speaking to people who regularly use the heath, helping them do so in the best possible way, particularly by encouraging them to keep to the main paths. It also encourages and creates opportunities for those who do not regularly connect with green spaces to do so."
        },
        {
            "text": "This work is managed by a permanent partnership team, hosted by Natural England and funded by the developer’s levy, a set fee paid by developers based on the number of new dwellings and proximity to the SPA. The team, who are on site, have a wide range of responsibilities; from educating dog-walkers on the risk to the nesting birds, improving signage for heath users, to running educational programmes in local schools on the landscape and climate resilience, including fire risks."
        },
        {
            "text": "They also host a popular Heath Week celebration each year and engage with residents online through a website and social media channels, last year reaching over 530,000 people with a range of exciting and informative content."
        },
        {
            "text": "The two initiatives have led to a string of fantastic results for people and nature:"
        },
        {
            "text": "The success of the Thames Basin Heath Partnership has meant that these programmes are now replicated across the country, when new housing developments are built within visiting distance of a vulnerable Special Protection Area, or Special Area of Conservation."
        },
        {
            "text": "It has also been a precursor for our Green Infrastructure Framework, which Natural England launched at the end of January. The framework provides tools and advice to developers to ensure that we can raise the bar for the quantity and quality of Green Infrastructure in England, bringing nature to everyone’s doorstep. You can find out more about that here: Green Infrastructure Home (naturalengland.org.uk)"
        },
        {
            "text": "It means houses can continue to be built, and protected species can continue to be protected in a way that benefits everyone."
        },
        {
            "text": "This corner of the Thames Valley is a greener place because of this partnership, whose pioneering success has paved the way for others like it, supporting development that is truly sustainable, for people and for wildlife."
        }
    ]
}