{
    "url": "https://environmentagency.blog.gov.uk/2023/03/22/love-windermere-protecting-the-lake-districts-crown-jewel/",
    "title": "Love Windermere – protecting the Lake District’s crown jewel",
    "authors": [
        "Environment Agency"
    ],
    "categories": [
        "Environment Agency"
    ],
    "pub_date": "2023-03-22T09:32:35+00:00",
    "content": [
        {
            "text": "This World Water Day, Jim Ratcliffe, Chairman of the Love Windermere Partnership Board and Environment, Planning and Engagement Manager at the Environment Agency, explains how working in partnership is helping keep the beloved Lake Windermere clean and healthy for people and nature. "
        },
        {
            "text": "The largest water body in the Lake District, Windermere, has a special place in the hearts of many people, both locally and around the world. Situated within a UNESCO World Heritage Site, Windermere is used to attracting headlines but lately these have focussed more on blue green algal blooms, which seem to be becoming more frequent, and public concern about pollution."
        },
        {
            "text": "Lake Windermere plays a key role in the lives of communities and visitors to the Lake District national park, so it’s vital we work with others to ensure that Windermere is as healthy as possible."
        },
        {
            "text": "We have a long history of partnership working in Cumbria  and, since the late 1990s, by working together, we have improved the water quality and ecology of the Windermere and Leven catchment through regulation and investment, including investing over £700K in projects. However, the growing scale of the challenges facing water – caused by climate change and population growth amongst other factors - has seen the formation of the Love Windermere partnership in 2022."
        },
        {
            "text": "The  Environment Agency is the lead partner, working with the Freshwater Biological Association, Lake District Foundation, Lake District National Park Authority, National Farmers Union, National Trust, South Cumbria Rivers Trust, and United Utilities."
        },
        {
            "text": "Love Windermere is set to be the most ambitious environmental partnership to date in Cumbria. Looking at all sources of pollution, from septic tanks, to agriculture and water companies, our work combines expertise with new data to tackle the current challenges and bring long term benefits to everyone. The partnership seeks not only to reduce nutrients entering the lake but also to achieve improvements across nature recovery, climate resilience and reducing flood risk."
        },
        {
            "text": "Whilst we believe the partnership approach is the right way to go, any partnership presents its own challenges. However, all Love Windermere partners are passionate about protecting our environment and have the skills and influence together to make the changes needed to protect Windermere."
        },
        {
            "text": "Principally the Environment Agency is a regulator and quite rightly the public expect that we regulate effectively.  It’s also fair to be asked how we can work in partnership with those we regulate – in this case the water industry and the farming sector.  To give people a greater insight and provide reassurance into how we will be regulating the water environment on the catchment, from April we will be publishing a summary of our regulation and compliance work for the year ahead."
        },
        {
            "text": "Arguably the most contentious of all water quality issues at the moment are storm overflows. The Environment Agency took the right decision several years back to force the installation of event duration monitors on water companies’ sewage overflows and to make the data publicly available, which has informed the mainstream debate about water quality.  Currently the path we are travelling along feels bumpy, but it will lead to a better place – although the problems facing water, and the technical solutions, are complex and expensive."
        },
        {
            "text": "Everyone can play a small part in helping to improve water quality. The Lake District Foundation, one of the partners, is working with owners of septic tanks to develop community emptying schemes and share tips about how to best manage private sewerage systems. United Utilities is working with food outlets and restaurants in and around Windermere with tips to avoid constricting sewers with fatty waste which can lead to sewage spilling into the environment. And we are working with South Cumbria Rivers Trust trialling innovative technology that if successful could be used to remove nutrients from septic tank effluent at a relatively low cost."
        },
        {
            "text": "Farming is one of the biggest sources of pollution to water. A working group looking at the different aspects of land management and farming will soon be hosting an evening event with the local farming community so that they are also part of the conversation, and their views are heard too. This will complement Catchment Sensitive Farming (CSF), a national project which provides voluntary advice to farmers and land managers on best practice, with the aim of reducing diffuse water pollution from agriculture."
        },
        {
            "text": "In all partnership projects it is vital that the groundwork is done to understand the problem then work together to find sustainable and lasting solutions – that’s why we are developing a science-based environmental protection plan. We have started collating more scientific evidence to understand which solutions will be most effective, which will then enable us to prioritise out actions. We are working with the local community, for example hosting citizen’s panels to listen to what local people think about the water quality and raise awareness of the challenges affecting Windermere."
        },
        {
            "text": "We are confident that together we are going to make a real difference to Windermere and are excited about the future. Our main goal is to protect the lake and its surrounding area for generations to come. We are encouraging people to get involved and volunteer with partner projects that will improve water quality, such as helping South Cumbria Rivers Trust who are working to restore reed beds around the north of the lake, encouraging natural processes to remove nutrients from the lake sediment. If you want to join us or find out more, visit www.lovewindermere.co.uk"
        }
    ]
}