{
    "url": "https://socialcare.blog.gov.uk/2023/03/22/oranges-are-not-the-only-career/",
    "title": "Oranges are not the only... career?",
    "authors": [
        "Jim Thomas"
    ],
    "categories": [
        "Care and support",
        "Carers",
        "Communities",
        "Social care reform",
        "Viewpoint"
    ],
    "pub_date": "2023-03-22T11:49:26+00:00",
    "content": [
        {
            "heading": 2,
            "text": "A fresh perspective"
        },
        {
            "text": "I dawdled into my local supermarket recently and noticed a banner near the entrance advertising vacancies in store. Whilst I’m not thinking about a fruit and veg driven career change, I was struck by the way the supermarket had framed it’s job offers: \"Come and work for us - we can create a job for you that fits around your lifestyle.\""
        },
        {
            "text": "The idea that working with oranges, apples and pears could be a lifestyle choice intrigued me and made me wonder if working in social care is, or could be, a lifestyle choice too? In our everyday lives we are constantly deciding what to wear, what to eat, who to socialise with, what sort of books, music, films, sport and TV we are interested in, what hobbies and which groups or clubs we want to be a part of."
        },
        {
            "text": "All these choices are driven by our knowledge, our experiences and whether or not we can afford to participate. So could working in social care be a lifestyle choice and, if so, what would that look like? I’ve often seen people working in social care and the people they support learning new skills and enjoying new experiences together. Everything from yoga, going shopping and making meals together, to sky diving and bungee jumping."
        },
        {
            "text": "All of these examples go beyond what the public might see as social care work, and can be hard to get funding to support. However, these lifestyle choices are an important part of social care and often make the difference between surviving and thriving. The challenge is that we are often reluctant to share anything about social care that goes beyond basic care and support. We worry that the general public will see us as frivolous."
        },
        {
            "heading": 2,
            "text": "Fruit of our labours"
        },
        {
            "text": "However, seeing lifestyle choices as frivolous misses the point. I’d suggest that lifestyle based social care for workers and the people they support improves wellbeing, increases the quality of care and support, reduces dependence and improves retention (you are more likely to stay in a job if you enjoy what you do, feel valued and have autonomy to decide how you do your work)."
        },
        {
            "text": "So how can we demonstrate that social care can be a place to work where your lifestyle choices can be supported and encouraged? We could start telling people about all the different things you can do and learn working in social care. We could celebrate the diversity of roles and experiences that working in social care can offer. We could promote social care as a career that can fit round your lifestyle."
        },
        {
            "text": "What I mean by this is that we could pay more attention to matching the interests of workers with the people they are supporting (If a worker hates football, is getting them to support someone who is obsessed with football and good idea?) We could explore working patterns that suit the worker, the employer and the person with support needs. For example, if someone can only work three hours on a Tuesday, and ten hours on a Saturday, can we design working patterns that fit with their availability?"
        },
        {
            "text": "If someone needs to be home between four and six everyday can we create a work pattern that enables this? If someone needs to be confident that if required they are able to leave work at short notice once or twice a month, can we build this into our work programme? Can we personalise work for our workforce, as well as the people they support?"
        },
        {
            "text": "Social care organisations may not be able to pay people as much as they would like, but they may be able to offer a range of benefits that could be described as supporting or enabling the workforce to see working in social care as a life style choice. If you were to know - what would a lifestyle model of working in social care look like for you?"
        }
    ]
}