{
    "url": "https://cddo.blog.gov.uk/2023/03/22/setting-the-digital-function-up-for-success-with-a-new-digital-functional-standard/",
    "title": "Setting the digital function up for success with a new Digital Functional Standard",
    "authors": [
        "Sam Lawler, Deputy Director Strategy, Analysis and Reform, CDDO"
    ],
    "categories": [
        "CDDO",
        "Cross-government strategy",
        "DDaT",
        "Digital strategy",
        "Digital transformation"
    ],
    "pub_date": "2023-03-22T14:27:51+00:00",
    "content": [
        {
            "text": "CDDO has worked with experts and digital leaders from across government to develop the newly published Functional Standard for the Digital, Data and Technology (DDaT) function."
        },
        {
            "text": "The 14 functions in government represent priority areas of common, cross-departmental activity which require central leadership, such as commercial, human resources and for us, digital."
        },
        {
            "text": "Our aim is that the new Functional Standard will support organisations to deliver digital transformation with an ambitious, clear and simple framework for digital teams across government."
        },
        {
            "heading": 4,
            "text": "What is a functional standard?"
        },
        {
            "text": "Functional standards are published by each of the government functions to describe what they do and why, and to support the effectiveness and efficiency of functional work in government. "
        },
        {
            "text": "They set out what functions should do, whilst technical standards, like the Technology Code of Practice and Service Standard, describe how to do it."
        },
        {
            "heading": 4,
            "text": "Why are we publishing a new Digital Functional Standard?"
        },
        {
            "text": "The first Digital Functional Standard was published in 2020 and was part of a trial set of functional guidance. Over the past year, CDDO has worked with departments to review and update the content of the standard to ensure it is still relevant. "
        },
        {
            "text": "There has been quite a lot of change since we published the first functional standard. "
        },
        {
            "text": "In April 2021 CDDO was established to lead the DDaT Function, and in June 2022 we launched Transforming for a Digital Future, the cross-government digital and data strategy for 2022-25. We have worked hard to ensure the new Digital Functional Standard aligns to the strategy and its commitments."
        },
        {
            "text": "We have significantly revised it to reflect more of what comprises a high performing and progressive digital function. Major changes include:"
        },
        {
            "heading": 4,
            "text": "How the new standard was developed"
        },
        {
            "text": "In developing the updated Digital Functional Standard, we've collaborated with experts from across government. It has been a cross-departmental effort, with input coming from groups including Chief Digital and Information Officers, Chief Technology Officers and Chief Data Officers. We've also reached out beyond the digital function to get the views of other groups including Chief Operating Officers across government."
        },
        {
            "text": "Additionally, we've worked hard with the central functions team in Cabinet Office and their standards experts to ensure this aligns with the wider suite of Functional Standards and supports the broader work of functions."
        }
    ]
}