{
    "url": "https://dluhcdigital.blog.gov.uk/2023/03/22/supporting-the-development-of-transformative-leaders-within-local-government/",
    "title": "Supporting the development of transformative leaders within local government",
    "authors": [
        "The Local Digital team"
    ],
    "categories": [
        "Local Digital Declaration",
        "Local Digital Training"
    ],
    "pub_date": "2023-03-22T09:31:11+00:00",
    "content": [
        {
            "text": "Following the success of last year’s Executive Education Programme in Digital Transformation for UK Local Government, earlier this year we decided to run the programme again, this time in collaboration with the Amazon Web Services (AWS) Institute and the Society for Innovation, Technology and Modernisation (Socitm)."
        },
        {
            "text": "Over three half-day modules, 20 speakers from DLUHC, AWS, Socitm, and recognised academic, industry, and public sector leaders shared their knowledge, expertise and reflections. We were joined by more than 150 individuals from over 75 local authorities across the country."
        },
        {
            "heading": 2,
            "text": "Equipping local government with the knowledge to support transformation"
        },
        {
            "text": "The Executive Education Programme in Digital Transformation for UK Local Government aims to support the development of a global community of transformative leaders within local government. "
        },
        {
            "text": "Offered at no cost, it is designed to equip senior local government officers with the confidence and expertise they need to lead the successful digital transformation of public services to better meet the needs of their citizens."
        },
        {
            "text": "The programme is just one element of the Local Digital training offer, which aims to support local authorities to become better equipped with the skills, knowledge and tools they need to design and deliver modern digital public services. Co-created with AWS and Socitm, it’s designed to embed the principles of the Local Digital Declaration at the most senior levels of local government."
        },
        {
            "heading": 2,
            "text": "An overview of the programme"
        },
        {
            "text": "The programme was delivered through a combination of keynote talks, panel and Q&A sessions, and interactive workshops. In a similar manner to the previous programme, the sessions focused on the ‘what, the how and the why’ of digital transformation. Each module distilled lessons from years of digital transformation into a hands-on learning experience, with a particular focus on providing practical takeaways for senior leaders."
        },
        {
            "heading": 3,
            "text": "Module 1: Digital transformation - the story so far"
        },
        {
            "text": "The first module began with an introduction from Nadira Hussain (Chief Executive of Socitm), who set out the programme’s aim to encourage “better collaboration, improve adoption of digital, technology and data-related solutions and capability, and therefore help accelerate the pace of change to further help improve outcomes for people and communities.”"
        },
        {
            "text": "Nadira was followed by a welcome from DLUHC’s Chief Digital Officer, Gill Stewart. Gill outlined Local Digital’s mission to create the next generation of local public services where technology is an “enabler” not a “barrier”, by sharing knowledge, expertise and experience to help leaders to build modern, resilient organisations that embrace digital transformation."
        },
        {
            "text": "The morning’s sessions were then kicked off by Dr Catherine Howe (Chief Executive at Adur and Worthing Councils). In an inspiring keynote talk, Catherine outlined her unique journey from “telling the people around the top table how to use technology more effectively” to “the person around the top table responsible for doing it”, sharing valuable insights and lessons learnt."
        },
        {
            "text": "We then split into smaller groups for the first interactive workshop of the programme. In their groups, the participants discussed the challenges facing their organisations, with strategy, knowledge and resources emerging as key themes. The participants then shared how they are addressing these challenges, for example through offering employee incentives, creating a better work/life balance, and convincing other senior leaders of the importance of digitalisation. "
        },
        {
            "text": "We also heard about their plans for service improvements and digitalisation initiatives. If you’re interested in learning more about the workshops and what was discussed, you can download this summary report."
        },
        {
            "text": "The module continued with a keynote talk by Matt Prosser (President of SOLACE and Chief Executive of Dorset Council). Matt discussed how digital transformation played a pivotal role in the amalgamation of six councils into one unitary authority. "
        },
        {
            "text": "The module wrapped up with a Q&A session moderated by Nadira Hussain. Nadira was joined by Matt and Catherine, as well as DLUHC’s Lawrence Hopper and Katy Armstrong, the former and current Deputy Director of Digital Services. The panellists explored the challenges of advocating change and discussed ways to improve capability."
        },
        {
            "heading": 3,
            "text": "Module 2: Upskilling and future-proofing your organisation"
        },
        {
            "text": "Module 2 explored how digital transformation can be implemented, focusing on the skills and capabilities needed. Following a welcome from Helen Braithwaite (Local Digital Head of Engagement, DLUHC), the module commenced with remarks from Matt Lewis (Chief Operating Officer at the Shared Resource Service (SRS) in Wales and Vice President of Socitm). Matt reflected on his work to date to build an organisation that “gives people opportunities to learn, to grow, to shine and to contribute”."
        },
        {
            "text": "Alison MacKenzie-Folan (Chief Executive of Wigan) followed on from Matt, providing an insightful overview from a “digital enabled” council where digital is a fundamental part of the journey, not a separate “bolt on”. Alison reflected on the importance of bringing everyone on this journey—including politicians, staff, and local communities—and investing in behaviours so residents see digital “as part of who we are”."
        },
        {
            "text": "During the interactive workshop, participants discussed the qualities a leader should bring to drive transformation. The top qualities were open-mindedness, strong communication, and being a visionary, with one attendee commenting how a leader should “allow people to take risks and be more innovative, providing a safe space to facilitate this”. Another recurring theme was the importance of leaders being digitally literate. This echoed Dr Catherine Howe’s keynote, where she stated “I’m really over the idea that you can be a senior leader and not have a basic grip of technology”."
        },
        {
            "text": "Participants then discussed how they can personally help digitalisation thrive through creating community, demonstrating strong leadership and being an advocate for their teams. This was summed up nicely by one participant as the “willingness to embrace failure and use it as a springboard for success”. The workshop wrapped up with a discussion about the technical knowledge required to support the development of staff. Once again, download the summary report to read more about what came out of the workshop."
        },
        {
            "text": "Liam Maxwell (Director of Government Transformation, AWS) provided the second keynote address of the module. Using his experience of both local and central government, where he was the UK Government’s first Chief Technology Officer, Liam explored how we can build better citizen services."
        },
        {
            "text": "This was then followed by a panel discussion on digital skills, chaired by Helen Braithwaite. Panellists from across the sector explored the challenges to successful recruitment and retention of staff and how to embed digital skills into organisational strategy."
        },
        {
            "heading": 3,
            "text": "Module 3: Digital transformation in practice"
        },
        {
            "text": "The third and final module saw Jon McGinty (Managing Director, Gloucester City Council) give an inspiring keynote address on transformation delivery in practice. In just 30 minutes, Jon shared case studies from across local government, including everything from thermal cameras to Pokémon Go, virtual assistants to Smart Cows!"
        },
        {
            "text": "Jon was followed by a panel discussion moderated by DLUHC’s Egle Shaw (Local Digital Collaboration and Engagement Manager). The topic for the panel session was ‘collaboration as an enable for digital transformation’ and prompted a thought-provoking discussion about the benefits of collaboration across both public and private sector. "
        },
        {
            "text": "In breakout rooms, discussion continued around the theme of collaboration championed by the module’s speakers. As Catherine Neal reflected, “if you're collaborating across councils, you've already giving yourself a little bit more support to push the change forward”. Networking and embedding a positive culture were also key takeaways from the discussion, with one attendee highlighting the importance of “embedding culture that encourages innovation”. "
        },
        {
            "text": "At the end of the interactive workshop, participants reflected on practical actions to take forward in their digital transformation journey and were given a handout to help identify how they could improve their council’s digital transformation. To read a summary of what was discussed in all three workshops, download the report."
        },
        {
            "heading": 2,
            "text": "Determining the future of our training offer"
        },
        {
            "text": "We’re currently reviewing the outcomes of the programme as well as the feedback we’ve received to determine the future of our training offer and ensure it best meets the needs of local government. Learn more about our digital and cyber training offer and share your feedback on how we can improve it."
        },
        {
            "text": "We’ll be sharing more on our plans over the coming months but in the meantime, why not browse our library of training courses to develop your digital and cyber skills online?"
        }
    ]
}