{
    "url": "https://earlyyears.blog.gov.uk/2023/08/22/early-years-resources-information-and-updates/",
    "title": "Early years resources, information and updates",
    "authors": [
        "Lee Owston, Deputy Director, Schools and Early Education"
    ],
    "categories": [
        "Early years"
    ],
    "pub_date": "2023-08-22T11:44:53+01:00",
    "content": [
        {
            "text": "We know it’s a difficult time for the early years (EY) sector. We want to make it as easy as possible for you to find all the information you need from us so that you can focus on the children you educate and care for. This blog explains some of the resources we have published and how they might be useful to you."
        },
        {
            "text": "We are always looking at ways to make our guidance clearer for you. We have recently produced a range of resources about inspection and the early years foundation stage (EYFS). We hope that these resources answer some of your questions, reassure you about our work and clarify any misconceptions about inspection."
        },
        {
            "text": "Ofsted inspections: what EY providers and practitioners need to know "
        },
        {
            "text": "We have published a webpage containing answers to a range of questions that we are commonly asked about delivering the EYFS and about our inspections."
        },
        {
            "text": "There are 3 separate collections of questions and answers: one collection each for registered early years providers, childminders and those delivering the EYFS in schools. Each collection is organised into 2 sections, covering the EYFS and inspection. Some of the questions are relevant for all settings, but some are only relevant for certain types of provision. For this reason, the questions and answers in each guide have been adapted for the setting type."
        },
        {
            "text": "Our answers are provided by a team of experienced inspectors and are designed to clarify parts of the inspection process that we know practitioners can find confusing. We hope this helps you find what you need quickly and easily."
        },
        {
            "text": "Find us on social media"
        },
        {
            "text": "We have a range of social media channels where you can find information about our new publications, research about the early years, changes to the EYFS, and new initiatives such as our recent pilot into how we manage registration visits."
        },
        {
            "text": "You can view our videos and webinar recordings on www.youtube.com/Ofstednews. We often hold childminder webinars but if you’re unable to make them, you can watch them back."
        },
        {
            "text": "In July 2023, we launched a new YouTube series Early years FAQs for providers and practitioners. Each short video features an early years inspector answering a common question about inspection practice and the EYFS."
        },
        {
            "text": "The videos are freely available so please do share them with colleagues and with anyone else you think might find them useful. We will continue to release more videos throughout the rest of the year."
        },
        {
            "text": "We have a Facebook page dedicated to childminders – www.facebook.com/Childcareregistration. We post regularly on Ofsted news and updates about the early years."
        },
        {
            "text": "We tweet (or ‘X’) regularly about all our remits, news, publications, events and more on www.twitter.com/Ofstednews. We also share our early years videos, blogs and news stories here."
        },
        {
            "text": "Our recent blog posts"
        },
        {
            "text": "We regularly share posts on this early years blog since launching it last year. We hope that these help you to understand what we do and keep you updated with our work. Our most recent blogs cover:"
        },
        {
            "text": "You can also subscribe to receive an email notification when we post a new blog."
        }
    ]
}