{
    "url": "https://educationhub.blog.gov.uk/2023/08/free-schools-how-we-are-creating-12000-new-school-places-in-disadvantaged-areas/",
    "title": "Free schools – how we are creating 12,000 new school places in disadvantaged areas",
    "authors": [
        "mediaofficer"
    ],
    "categories": [
        "Academies",
        "alternative providers",
        "Education Standards",
        "Faith Schools",
        "Free schools"
    ],
    "pub_date": "2023-08-22T00:05:30+01:00",
    "content": [
        {
            "text": "We want every child to have access to a great education on their doorstep. That is why we are creating 15 new free schools in the most disadvantaged areas of the country, creating 12,000 additional school places for young people."
        },
        {
            "text": "But what are free schools and how are they improving opportunities for  young people? Here is everything you need to know."
        },
        {
            "heading": 3,
            "text": "What is a free school?"
        },
        {
            "text": "Free schools are funded by the government but are not run by the local authority. They are usually run by academy trusts, but they can also be run by universities, charities, businesses and faith groups. In fact anybody can apply to set up a free school if they have the necessary capacity and capability."
        },
        {
            "text": "Free schools are not-for-profit settings that are open to pupils of all abilities and have more freedom over things like the school curriculum and the length of the school day. They can also set teacher pay."
        },
        {
            "heading": 3,
            "text": "How are free schools improving access to quality education?"
        },
        {
            "text": "There are over 650 free schools in England with more than 350,000 pupils. They provide parents with more choice  and offer high standards of education."
        },
        {
            "text": "Secondary free schools are among the highest performing state-funded schools in the country. Primary, secondary and 16-19 free schools all out-perform the national average in Good or Outstanding Ofsted ratings."
        },
        {
            "text": "In this year’s A level results, free schools outperformed other types of non-selective state schools. Around 35 per cent of A levels taken by pupils in free schools achieved a grade A or A* compared to 22 per cent studied by pupils in local authority schools."
        },
        {
            "text": "That is why we are opening 15 more free schools in areas with the lowest educational outcomes – creating more school places where there is the greatest need. This means more children will have access to a great education in their local area."
        },
        {
            "heading": 3,
            "text": "Where will the new free schools be?"
        },
        {
            "text": "Free schools in this wave have been approved where there is the greatest need for good new places, prioritising parts of the country with lowest education outcomes."
        },
        {
            "text": "The full list of new free schools that have been approved and are expected to open in three or four years include:"
        },
        {
            "heading": 3,
            "text": "What is a BRIT School?"
        },
        {
            "text": "The BRIT School North will create opportunities for rising stars in the north of the country to break into the performing arts industry. It is based on the award-winning performing arts school in South London which helped to launch the careers of Adele, Amy Winehouse and Jessie J."
        }
    ]
}