{
    "url": "https://socialcare.blog.gov.uk/2023/08/22/honour-stories-an-outstanding-achievement/",
    "title": "Honour stories: an outstanding achievement",
    "authors": [
        "Zoe Fry"
    ],
    "categories": [
        "Care and support",
        "Recognition",
        "Workforce"
    ],
    "pub_date": "2023-08-22T15:22:37+00:00",
    "content": [
        {
            "heading": 2,
            "text": "Proud and humble"
        },
        {
            "text": "I have been recently honoured with the Order of the British Empire (OBE) medal for my contributions to social care and nursing, recognised in the King's Birthday Honours List. The recognition of my work by so many is a source of immense pride and I am deeply humbled that my efforts in the sector are deemed deserving of this prestigious award."
        },
        {
            "text": "The significance of being a voice for this sector is monumental and I am honoured to accept this honour on behalf of the incredible colleagues who consistently make a positive impact on people's lives every day."
        },
        {
            "text": "My journey in social care began at the age of 13 when I started part-time work at a residential nursing home. This experience ignited my interest in becoming a 'matron' in a nursing home, which eventually led me to pursue nurse training as soon as I was eligible in 1993."
        },
        {
            "text": "After a brief stint in the NHS, I returned to my genuine passion for social care. The motivation behind this decision was deeply personal, as the care received by my grandparents in nursing homes fell short of adequate. Their passing motivated my parents to suggest that I could effectively manage a care home, offering to invest in the project. I am naturally drawn to challenges, so I embraced this opportunity wholeheartedly."
        },
        {
            "text": "My journey led me to Valerie Manor, a 15-bed residential care home nestled in the picturesque setting of the South Downs in Sussex. This chance felt like a dream realized, and I swiftly secured planning permission to expand and establish a purpose-built nursing wing."
        },
        {
            "text": "For a decade, I lived on-site and served as the registered manager. Valerie Manor proudly received the Outstanding rating from the Care Quality Commission (CQC) on two separate occasions. Additionally, the home garnered numerous national awards, a testament to the dedication of my exceptional team."
        },
        {
            "heading": 2,
            "text": "Building on experience"
        },
        {
            "text": "In 2014, I played a pivotal role as one of the founders of The Outstanding Society. Emerging from a group of social care operators, this organisation was established to enhance the quality of care across the UK."
        },
        {
            "text": "Over the past two years, our founding team has transformed this supportive entity into a vibrant community interest company, now including over 3,000 members nationwide with seven directors."
        },
        {
            "text": "Throughout this journey, my role as a director has allowed close collaboration with various sector partners, including Skills for Care, DHSC, CQC, and Care England. My insights have contributed to addressing challenges and advocating for innovative best practice across the sector."
        },
        {
            "text": "Recently, I assumed the responsibility of Chair for the Social Care Nursing Advisory Council in Sussex. The importance of this role underscores my commitment to elevating social care nursing."
        },
        {
            "heading": 2,
            "text": "Nominate someone today!"
        },
        {
            "text": "The day my husband handed me the letter containing the momentous news of my Honour is etched on my memory forever. Upon opening the envelope, tears of joy and overwhelming gratitude flowed. Even today, the reality of receiving this recognition feels surreal. I am profoundly thankful for the recognition and feel privileged to collaborate with such incredible colleagues across the field of social care."
        },
        {
            "text": "I would encourage others to take the time to nominate colleagues to recognise the amazing work of adult social care professionals as a way of celebrating this amazing sector along with recognising the importance of social care nurses."
        }
    ]
}