{
    "url": "https://stratcommand.blog.gov.uk/2023/08/22/jacob-the-pilot-completes-gibraltars-med-steps-challenge/",
    "title": "JACOB ‘THE PILOT’ COMPLETES GIBRALTAR’S MED STEPS CHALLENGE",
    "authors": [
        "blythevictor"
    ],
    "categories": [
        "Gibraltar",
        "Health and Wellbeing",
        "Mental Health",
        "Overseas Bases",
        "Training",
        "Uncategorized"
    ],
    "pub_date": "2023-08-22T12:45:16+01:00",
    "content": [
        {
            "text": "Young Jacob Newson, known as ‘Jacob the Pilot’ because of his love of aviation and ambition to become a RAF pilot, who raises thousands of pounds for the RAF Benevolent Fund (RAFBF), recently visited Gibraltar to complete the Mediterranean Steps (locally known as the Med Steps) that ascend the 426-metre Rock of Gibraltar. Also taking part were personnel from RAF Gibraltar and No. 2 Gibraltar Air Cadet Squadron. On August 21, 2023, the group started their hike at MOD Gibraltar’s headquarters at HM Dockyard."
        },
        {
            "text": "Even though this is one of the smaller peaks Jacob has conquered, the conditions were particularly poor, with low visibility and 100% humidity. So far, he has raised over £1,300 for the RAFBF on this challenge."
        },
        {
            "text": "The Med Steps were built by the British military to allow access to various defensive positions around the southern part of the Rock. The route finishes adjacent to the summit of the Rock of Gibraltar at O’Hara’s Battery."
        },
        {
            "text": "All personnel taking part from the RAF are stationed at RAF Gibraltar and have volunteered their time for this good cause. Flt Lt Nurse was one of the participants and said, \"Walking with Jacob and the Air Cadets on such a steep route was made easier due to their unwavering enthusiasm. When you consider some of the steps were as tall as Jacob, it would have been easy for him to be put off by the route, but he took it all in his stride.\""
        },
        {
            "text": " "
        }
    ]
}