{
    "url": "https://competitionandmarkets.blog.gov.uk/2025/10/28/cartels-being-first-to-apply-for-leniency-matters-more-than-ever/",
    "title": "Cartels: being first to apply for leniency matters more than ever",
    "authors": [
        "Lucilia Falsarella Pereira"
    ],
    "categories": [
        "Competition Act 1998 and cartels"
    ],
    "pub_date": "2025-10-28T11:00:48+00:00",
    "content": [
        {
            "text": "The Competition and Markets Authority's (CMA) leniency regime is a powerful tool in the fight against cartels."
        },
        {
            "text": "Since the publication of our previous leniency guidance 12 years ago, we have received nearly 250 leniency applications. Cases with leniency applicants have resulted in more than £355 million in financial penalties and the disqualification of 24 company directors."
        },
        {
            "text": "Following a public consultation, we have updated our leniency guidance to:"
        },
        {
            "heading": 2,
            "text": "Cartel enforcement: a CMA priority"
        },
        {
            "text": "Cartels are a particularly damaging form of anti-competitive activity, where rivals agree not to compete so they can gain an unfair advantage. This can lead to higher prices and deprive people of genuine choice, as well as reduce incentives for business efficiency, investment and innovation."
        },
        {
            "text": "The CMA is committed to tackling harmful cartels, so that fair-dealing businesses can innovate and thrive – boosting the economy – and individuals can be confident that they are getting great choices and fair deals."
        },
        {
            "text": "An effective leniency regime is a crucial part of our strategy to detect and enforce against cartels and it helps ensure that we reach robust outcomes in an efficient way. The leniency regime also helps deter cartels, by making it riskier to be involved in one."
        },
        {
            "heading": 2,
            "text": "We proactively detect cartels"
        },
        {
            "text": "While leniency will always play an important role in the fight against cartels, it is far from being the only way the CMA detects them. Indeed, over the years we have kept a fairly even balance between own-initiative cases and those that start with a leniency application."
        },
        {
            "text": "Our detection work includes, for example:"
        },
        {
            "text": "That means we’re finding and stopping harmful cartels regardless of whether a cartelist decides to blow the whistle and apply for leniency – which is why it is important to come forward at the earliest opportunity."
        },
        {
            "heading": 2,
            "text": "Being first to apply for leniency matters more than ever"
        },
        {
            "text": "The changes we have introduced mean that being a Type A applicant (that is, the first to apply for leniency before the CMA has started to investigate) is the only way to get guaranteed immunity from:"
        },
        {
            "text": "Uncovering cartel conduct and adopting a ‘wait and see’ approach by applying for leniency only after a CMA investigation has begun now carries greater risk for businesses."
        },
        {
            "text": "We have removed the availability of upfront immunity for Type B applicants (that is, those who are the first applicant but who have only come forward after we have started to investigate) and clarified that Type B discounts are unlikely to be above 75% (reflecting our practice to date)."
        },
        {
            "text": "We have also removed automatic director disqualification protection for Type B and C applications (Type C applicants are those who apply after the first applicant). Such protection is now discretionary and will ensure that directors are only immunised from disqualification when this is in the public interest, thereby protecting the public by removing unfit directors."
        },
        {
            "heading": 2,
            "text": "Making our guidance clearer and processes better"
        },
        {
            "text": "We also wanted to ensure that the leniency guidance is as clear, accessible and user-friendly as possible. We have done this by:"
        },
        {
            "text": "Another important update was to the definition of ‘cartel activity’, so that it reflects the latest case law and CMA guidance and practice, while being flexible enough to cover cartel conduct that may be considered to fall within the policy in the future. We have also provided more examples of the types of conduct for which leniency is available. This includes conduct in labour markets, algorithmic collusion and agreements to limit innovation – for example, in order to meet or exceed a sustainability goal."
        },
        {
            "text": "We also no longer require applicants to confess at the start – something that the business community very clearly told us could have discouraged applications. This is now only needed when signing the leniency agreement, usually just before we issue the statement of objections."
        },
        {
            "text": "If you are thinking of applying and would like more clarity on specific points, we are happy to provide confidential guidance."
        },
        {
            "heading": 2,
            "text": "Act now"
        },
        {
            "text": "If you suspect you, your business or a client you advise is involved in cartel activity:"
        }
    ]
}