{
    "url": "https://medregs.blog.gov.uk/2025/10/28/clinical-trials-regulations-six-month-countdown-begins/",
    "title": "Clinical trials regulations: six-month countdown begins",
    "authors": [
        "James Pound",
        "Janet Messer"
    ],
    "categories": [
        "Clinical Trials"
    ],
    "pub_date": "2025-10-28T15:12:41+00:00",
    "content": [
        {
            "text": "In six months’ time, on 28 April 2026, the most significant update to UK clinical trials regulations in two decades will come into force."
        },
        {
            "text": "This will be a pivotal moment for the evolving clinical trial landscape and marks a new way forward for how trials involving medicinal products are set up and delivered across the UK."
        },
        {
            "text": "Together, the Medicines and Healthcare products Regulatory Agency (MHRA) and the Health Research Authority (HRA) have developed amended regulations that have been shaped by - and will benefit - patients, researchers, health professionals, and industry."
        },
        {
            "text": "The updated regulations are designed to protect trial participants, strengthen patient safety, and accelerate approvals by reducing unnecessary burdens on researchers, to support high-quality, trusted research taking place in the UK."
        },
        {
            "text": "The implementation of the latest international Good Clinical Practice (GCP) guidelines (ICH-GCP E6(R3)) will come into force in the UK, along with the updated regulations. All trials will need to adhere to the principles of GCP, and trials for marketing authorisation will need to comply with the full guidelines."
        },
        {
            "text": "By streamlining our approvals processes, reducing duplication and supporting a proportionate and flexible approach to regulation, it will be quicker and easier to set up and run clinical trials, while maintaining the highest standards of safety. This will speed up vital research that could lead to new and better treatments for patients."
        },
        {
            "text": "Greater transparency of clinical trial results will help boost participation, inclusion and diversity. Patients from all backgrounds will feel that their contributions are having a real effect on developing new treatments, placing them at the centre of medical research."
        },
        {
            "heading": 2,
            "text": "Our joint commitment"
        },
        {
            "text": "In October 2024, before the regulations had been signed into law, we ran our first joint webinar on the clinical trials regulations where we talked about what the amended regulations would mean for clinical trials in the UK."
        },
        {
            "text": "We spoke about our commitment to delivering the regulations and what we would do to support their successful implementation. As we reach the six-month countdown to the regulations coming into effect, we’d like to take this opportunity to reaffirm our joint commitment."
        },
        {
            "text": "MHRA and HRA, together with the devolved governments, have worked together with a wide range of people to develop guidance to support implementation of the regulations. We remain committed to supporting the clinical trial community to be ready for 28 April 2026."
        },
        {
            "heading": 2,
            "text": "Time to prepare"
        },
        {
            "text": "The updates to the regulations will result in new ways of working for researchers, sponsors and trial teams, and it will take time to embed new practices."
        },
        {
            "text": "At the beginning of October 2025, both the MHRA and HRA published guidance which sets out the updates to the regulations and provides practical information for how they should be implemented. MHRA’s guidance is currently still in draft, although minimal adjustments only will be made prior to go live. You can find the latest versions in the MHRA’s Clinical Trials hub.  "
        },
        {
            "text": "MHRA guidance focuses on issues relevant to MHRA applications and the reporting of key events such as safety information to the MHRA. HRA guidance covers issues related to the REC review of applications, as well as the new transparency requirements. We’ve worked together closely on the guidance to ensure they're aligned, and  include links to the other set of guidance."
        },
        {
            "text": "Based on feedback from stakeholders, our guidance is designed to help those involved in setting up and running clinical trials to navigate the changes and update their polices, processes, procedures and systems ahead of time."
        },
        {
            "text": "To support a smooth transition, we’re encouraging the clinical trial community to read our guidance and start planning for the changes now. What do you need to review? What can you update now? What do you need to be put in place to ensure you are ready for the 28 April 2026 implementation date?"
        },
        {
            "text": "It’s essential to start having these conversations now, to identify the changes that need to be made as soon as possible, and to create a plan for how they will be implemented."
        },
        {
            "heading": 2,
            "text": "Looking ahead"
        },
        {
            "text": "We’re committed to making sure that everyone has the support and information they need, and we’ll be setting up more events and engagement opportunities over the next six months to help researchers and sponsors prepare."
        },
        {
            "text": "In December 2025, the MHRA will publish a list of changes to definitions.  "
        },
        {
            "text": "Draft guidance for Good Clinical Practice (GCP) will be published on the MHRA clinical trials hub in January 2026.  "
        },
        {
            "text": "In March the MHRA will also provide updates to the process for the Modification of an Important Detail (MOID). "
        },
        {
            "text": "For the HRA, work continues on developing a set of principles to help sponsors use simplified arrangements for seeking and documenting consent in low intervention clinical trials. The principles will support clinical trials on existing medicines, as legislated in the updated regulations, while ensuring public trust is maintained."
        },
        {
            "text": "While there are no legislative changes for public involvement and inclusion and diversity as part of the regulatory reforms, new support and guidance will be available for the research community as recommended by the government."
        },
        {
            "text": "The HRA continues to work with key stakeholders to produce specific guidance for Phase 1 healthy volunteer trials, which will be published alongside existing guidance on involving the public in designing, delivering, and reporting clinical trials."
        },
        {
            "text": "Joint work between the HRA and MHRA is also ongoing to develop a set of questions and supporting guidance for researchers to consider when they design clinical trials and clinical investigations. This will help ensure clinical research is designed to include people who could be impacted from its findings, and that people underserved by research are not overlooked. "
        },
        {
            "text": "As we look to the future, we also want to take a moment to recognise and thank everyone who has worked with us or provided feedback along the way. We’ll continue to work closely together and talk with and listen to the research community to ensure an effective and successful implementation of the regulations."
        },
        {
            "heading": 2,
            "text": "Clinical trials regulations guidance"
        },
        {
            "text": "Read the HRA guidance."
        },
        {
            "text": "Read the MHRA guidance."
        }
    ]
}