{
    "url": "https://mhclgmedia.blog.gov.uk/2025/10/28/coverage-of-the-renters-rights-act-becoming-law/",
    "title": "Coverage of the Renters’ Rights Act becoming law",
    "authors": [
        "mhclgpress"
    ],
    "categories": [
        "Uncategorized"
    ],
    "pub_date": "2025-10-28T16:56:40+00:00",
    "content": [
        {
            "text": "There has been widespread national, trade and broadcast coverage on the department’s announcement on the Renters’ Rights Bill receiving Royal Assent."
        },
        {
            "text": "England’s 11 million private renters will have significant increase to their rights in a generation as the government’s Renters’ Rights Bill received Royal Assent."
        },
        {
            "text": "National coverage can be seen on BBC News online highlighting key measures of protection for private renters including abolishing no-fault evictions, limiting rent increases to once a year at market rate and limiting upfront deposits to one month rent. The Telegraph,"
        },
        {
            "text": "Independent and ITV News online write explainer pieces on how rental reforms will affect tenants and landlords."
        },
        {
            "text": "Across broadcast, BBC News and ITV News both ran packages across their evening news bulletins yesterday noting the greater protections for renters. BBC Radio 4’s Today Programme also featured the announcement noting that the Housing Minister has had to go back and forth on amendments with the Lords on the Act."
        },
        {
            "text": "City AM and the Big Issue focus on comments from the Prime Minister who said the government was “putting an end” to “rogue landlords or insecure contracts”. The Metro also carries exclusive words from the Housing Secretary explaining that the Bill the bill would ‘transform the experience of private renting’."
        },
        {
            "text": "The Secretary of State also took part in lunchtime interviews today with ITN, Jeremy Vine on Radio 2, World at One on Radio 4 and Radio 5 Live. A piece on the Andrew Marr show on LBC is also due to run this evening."
        },
        {
            "text": "Prime Minister Keir Starmer said:"
        },
        {
            "text": "“Every family deserves the dignity of a safe and secure home.  "
        },
        {
            "text": "“For too long, millions of renters have lived at the mercy of rogue landlords or insecure contracts, with their futures hanging in the balance. We’re putting an end to that.  "
        },
        {
            "text": "“A secure home isn’t just bricks and mortar – it’s the foundation for opportunity, safety, and a better life. No child should grow up without one.” "
        },
        {
            "text": "Secretary of State Steve Reed said:"
        },
        {
            "text": "“Our historic Act marks the biggest leap forward in renters’ rights in a generation. We are finally ending the injustice overseen by previous governments that has left millions living in fear of losing their homes.   "
        },
        {
            "text": "“For decades, the scales have been tipped against tenants. Now, we’re levelling the playing field between renters and landlords.  "
        },
        {
            "text": "“We are tearing down the walls of injustice in the private rented sector and building a future where tenants are protected, respected and empowered.  "
        },
        {
            "text": "“This is an historic moment for renters across the country and we’re proud to deliver it.”  "
        }
    ]
}