{
    "url": "https://ipo.blog.gov.uk/2025/10/28/whats-changing-supplementary-protection-certificates/",
    "title": "What’s changing – Supplementary Protection Certificates ",
    "authors": [
        "Simeon Bowen"
    ],
    "categories": [
        "Digital",
        "Innovation",
        "IPO",
        "Patents",
        "Transformation"
    ],
    "pub_date": "2025-10-28T14:52:40+00:00",
    "content": [
        {
            "text": "Spring 2026 marks the launch of our One IPO Patent Service – a digital platform that will change how patents are applied for and managed. "
        },
        {
            "text": "Our weekly guidance continues with posts covering different elements of the new service. We're working through the key changes to ensure you're fully prepared when the service goes live. "
        },
        {
            "text": "This week we're looking at Supplementary Protection Certificates (SPCs) and how they'll work in the new digital environment. "
        },
        {
            "heading": 3,
            "text": "What is an SPC? "
        },
        {
            "text": "SPCs are IP rights that last for longer than a standard patent. They are used for pharmaceutical or plant protection products, which typically take a long time to bring to market because they require extensive clinical trials and testing before they can be sold. The extended life of SPCs ensures that rights holders for these products aren’t disadvantaged. "
        },
        {
            "heading": 3,
            "text": "Can I apply for SPCs via the new One IPO Service? "
        },
        {
            "text": "You will be able to apply for SPCs via the One IPO Service. There are several benefits to this: "
        },
        {
            "text": "However, at launch the SPC functionality will be more limited than for patents. That is because we get a small number of SPC applications per year – typically less than 100. "
        },
        {
            "heading": 3,
            "text": "How will it work? "
        },
        {
            "text": "When you select the option to submit an SPC application, you will be prompted to download and complete a PDF form. Once you have completed the form you will upload it via your account. "
        },
        {
            "text": "After approximately five working days you will be able to see your application in the new service. SPCs are listed separately from other patents in your account on their own dedicated page. "
        },
        {
            "text": "The process is similar for other actions you may wish to complete on your SPCs, including paying annual SPC fees and applications to extend SPCs. You will find a link to the relevant PDF form and upload it via the new service. "
        },
        {
            "text": "The forms for these actions are unchanged from what you’re used to in the existing service. "
        },
        {
            "heading": 3,
            "text": "Responding to exam reports for SPCs "
        },
        {
            "text": "When your exam reports are ready to view, they will appear in your account. You will get an email notification when they are available to view, with a link to the relevant documents in the new service. You will have to be logged into your account to access the documents. "
        },
        {
            "text": "When you’re ready to respond to the exam report, you will upload your response by uploading your response documents via your account. "
        },
        {
            "heading": 3,
            "text": "Access controls and sharing "
        },
        {
            "text": "You will be able to set access controls on SPCs using the ‘groups’ functionality in the service. For example, if access to SPC applications should be limited to specific people in your firm, you can create an SPC group, which only the relevant people have access to. "
        },
        {
            "text": "However, you won’t be able to save and share draft applications when applying for SPCs at this time. "
        }
    ]
}