{
    "url": "https://ipo.blog.gov.uk/2021/07/19/closing-the-loop-on-your-feedback-part-two/",
    "title": "Closing the loop on your feedback (Part Two)",
    "authors": [
        "Jamie Edwards"
    ],
    "categories": [
        "Design",
        "Patents",
        "Renewals",
        "Trade marks",
        "User research"
    ],
    "pub_date": "2021-07-19T14:08:46+01:00",
    "content": [
        {
            "text": "In my last blog, I gave you an insight into how we close the loop on your feedback and explained why it’s so important for our customers to continue to provide us with their feedback so we can continue to improve our services."
        },
        {
            "text": "In this blog I want to tell you about upcoming changes we are making, based on things you have told us."
        },
        {
            "heading": 3,
            "text": "Customer service standards"
        },
        {
            "text": "We have recently published our customer service standards. These inform our customers of the level of service you can expect and how we are performing month on month."
        },
        {
            "text": "We are currently meeting, or exceeding, several of the standards. However, unprecedented demand is impacting our ability to meet them all. In April-May 2021 demand for domestic designs was up 175%, domestic trade marks 74% and for forms filed more than 200%, compared to the same period last year."
        },
        {
            "text": "Despite this increased demand, we are working hard to address any delays by recruiting and training additional staff and improving the efficiency of our processes. As you can see with domestic designs, in May it was taking around 10 weeks to receive a design exam report, by June it has reduced and is now taking around 6 weeks."
        },
        {
            "text": "We know our customers would still like to receive their exam report quicker than this, but within a month we have reduced this time by 4 weeks, and our examiners are working hard to reduce this further."
        },
        {
            "text": "If you have any feedback on the customer service standards, please fill out our  feedback form or email Customer Experience Unit"
        },
        {
            "heading": 3,
            "text": "Customer satisfaction survey"
        },
        {
            "text": "The customer satisfaction survey is now live. You have told us that the survey was long and took a while to complete. We have listened and shortened the survey so you can provide us with your feedback faster and more easily. Please do take the time to complete the survey so we can continue to close the loop on your feedback."
        },
        {
            "text": "If you’d like to see how we’ve recently been closing the loop on your feedback for patents, trade marks and designs, please watch the video ."
        }
    ]
}