{
    "url": "https://deframedia.blog.gov.uk/2021/07/19/consultation-launched-on-extending-ivory-ban-to-other-species/",
    "title": "Consultation launched on extending ivory ban to other species",
    "authors": [
        "Defra Press Office"
    ],
    "categories": [
        "Weekly stories"
    ],
    "pub_date": "2021-07-19T11:38:27+01:00",
    "content": [
        {
            "text": "There was widespread media coverage over the weekend following the launch of our consultation on extending our world-leading elephant ivory ban to other species. The story was covered by The Guardian, BBC News, I News, Daily Mail, Telegraph, Yorkshire Post and Western Morning News."
        },
        {
            "text": " "
        },
        {
            "text": "Elephants are not the only species targeted for their ivory - other endangered or near-threatened species such as hippo also face threats from poaching. Hunting practices also contribute to the trade in ivory, with killer whales and sperm whales targeted for their teeth, as well as narwhals and walruses for their tusks."
        },
        {
            "text": " "
        },
        {
            "text": "As laid out in our Action Plan for Animal Welfare, the proposals would see the UK’s Ivory Act, which will bring in a near-total ban on the import, export and dealing of items containing elephant ivory in the UK when it comes into effect, extended to other species such as hippos, narwhales, walruses and killer whales."
        },
        {
            "text": "The consultation asks for responses on allowing the ban to be extended to other, non-elephant ivory-bearing species and proposes three options:"
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": "Launching the consultation International Environment Minister Lord Goldsmith said:"
        },
        {
            "text": " "
        },
        {
            "text": "The responses to the consultation will inform future government policy on the issue."
        }
    ]
}