{
    "url": "https://civilservice.blog.gov.uk/2021/07/19/how-to-have-the-best-summer-ever/",
    "title": "How to have the BEST SUMMER EVER!",
    "authors": [
        "Andy Cope, Civil Service Live speaker, author, trainer and learning junkie"
    ],
    "categories": [
        "A great place to work"
    ],
    "pub_date": "2021-07-19T12:53:01+00:00",
    "content": [
        {
            "text": "Civil Service Live speaker, author, trainer and learning junkie Andy Cope shares a few timely tips how to squeeze the most of out of your summer."
        },
        {
            "text": "Your 2020 foreign trip was rolled over until this summer. Now you’ve had to kick it into 2022."
        },
        {
            "text": "I’m guessing you’re vacationing somewhere closer to home where all the good accommodation was already taken and the weather isn’t guaranteed."
        },
        {
            "text": "Not to worry. Here are six top tips, taken from the science of wellbeing, that will help you have the best summer of your entire life…"
        },
        {
            "text": "Happiness is infectious"
        },
        {
            "text": "Human beings are emotional creatures, and your feelings and attitudes will spread like wildfire. In holiday terms, if you have small children, they will be as happy in Margate as they are in Miami. So long as you are!"
        },
        {
            "text": "Similarly, one negative family member will lower the tone of the entire holiday party. Top tip: make sure it’s not you!"
        },
        {
            "text": "The $64,000 question"
        },
        {
            "text": "According to an esteemed researcher at the University of London’s Institute of Education, happiness can even be measured in terms of monetary values:"
        },
        {
            "text": "Hopefully you can tick some of those boxes, in which case, you are enjoying true ‘mental wealth.’ So, whatever the summer brings you, be grateful."
        },
        {
            "text": "Happiness is Maximized at 57°F"
        },
        {
            "text": "Weird I know, but the American Meteorological Society found current temperature has a bigger effect on our happiness than variables like wind speed and humidity. It also found that happiness is maximized at 57 degrees (13.9°C), so, technically, point no.1 is bang on – you’re more likely to find happiness in Margate than Miami!"
        },
        {
            "text": "Be a hugger"
        },
        {
            "text": "Human beings are social animals. That’s why social distancing has caused so much anguish. As we come out of lockdown, make up for lost time by applying the science of hugging. Bottom line: the average hug lasts 2.1 seconds There will be approx 12-15 people in your life who are emotionally close enough to warrant a big hug so (when social distancing permits), treat your nearest and dearest to the best hug ever. "
        },
        {
            "text": "Forest bathing"
        },
        {
            "text": "The Japanese call it shinrin-yoku. We call it ‘going for a walk.’ A study from the University of Sussex found that being outdoors made people happier. "
        },
        {
            "text": "“Being outdoors, near the sea, on a warm, sunny weekend afternoon is the perfect spot for most. In fact, participants were found to be substantially happier outdoors in all natural environments than they were in urban environments.”"
        },
        {
            "text": "To be fair, no university degree is required. The point is obvious; fresh air – lots of it – makes us feel fab. Top tip, while you’re out and about, walk with your senses open. Bathe yourself in mother nature."
        },
        {
            "text": "Be the Pied Piper of Happiness"
        },
        {
            "text": "Your emotions are contagious - they leak out of you and ‘infect’ those around you. So, when you make the conscious choice to be positive and upbeat, other people will catch your good vibes. So, top tip, be enthusiastic for four minutes and everyone else will feel great too."
        },
        {
            "text": "This is especially important if you’re camping in the rain. It only takes one idiot (you!) to be enthusiastically jumping in puddles and, before you know it, the entire campsite is doing the same. When you’re old and prune-like, you will look back on your life and realise that these ‘little moments’ were, in fact, the best bits of your life."
        }
    ]
}