{
    "url": "https://teaching.blog.gov.uk/2021/07/19/how-the-reception-baseline-assessment-will-be-a-fairer-progress-measure-and-give-teachers-more-recognition/",
    "title": "How the reception baseline assessment will be a fairer progress measure and give teachers more recognition",
    "authors": [
        "Claire Harnden"
    ],
    "categories": [
        "Primary schools",
        "Pupil wellbeing and behaviour",
        "Teacher wellbeing"
    ],
    "pub_date": "2021-07-19T17:12:04+01:00",
    "content": [
        {
            "text": "Claire Harnden is the Deputy CEO at South Farnham Educational Trust and has also advised the Department for Education through the Standard and Testing Agency’s Stakeholder reference group for the reception baseline assessment (RBA). Claire shares her experiences of introducing the reception baseline assessment in her school Trust."
        },
        {
            "text": "As we look ahead to the next academic year, one of the changes facing schools is the statutory implementation of the reception baseline assessment (RBA). While no change is easy, at South Farnham Educational Trust, having taken part in the RBA pilot two years ago, our view is that the RBA is one worth making."
        },
        {
            "text": "Given the impact of the pandemic on children’s experiences, from social isolation to the development of vocabulary – we believe it is now more important than ever to understand children’s starting points in their early mathematics, language, communication and literacy skills."
        },
        {
            "text": "Teachers will receive a series of short narrative statements after the assessment explaining what knowledge and skills each child demonstrated, which they can use to inform their teaching, and which will be a helpful snapshot of where each child is when they enter reception. We found taking time to sit with each child individually during their early weeks was hugely beneficial for both the child and the teacher and this will be even more important this year."
        },
        {
            "text": "The RBA is also essential for building a fairer progress measure for primary schools. Under the current arrangements, schools do not get the full credit for the important work that takes place between reception and year 2. The RBA will change this by establishing a new starting point to measure the progress pupils make by the end of year 6. Schools should receive the recognition they deserve for the work they do with their pupils throughout the whole of primary school, in particular for those where the intake has been significantly affected by the COVID-19 pandemic. More immediately, the narrative statements will help us respond to each child's individual needs when it comes to education recovery."
        },
        {
            "text": "I know one concern for school leaders is the impact on teacher workload, but having taken part in the RBA pilot a few years ago, we’re confident that preparation will not be onerous. For teachers, the training to administer the RBA is simple and straightforward, so they won’t need to spend a huge amount of time learning how to administer the assessment. For children, the assessment will be short, interactive, practical and fun. There is absolutely no requirement to prepare a child for this assessment and schools should reassure parents about that – it’s not delivered as a formal test. The activities are very simply designed, short and age-appropriate. The RBA takes a child along a dynamic pathway that will quickly ascertain if something is too challenging and will jump to the next section. The experience is usually really positive for the child – they’ve had the opportunity to sit with their teacher and take part in some fun activities, unaware that the activities form part of an assessment, and going forward, their teacher has a better idea of how to design learning especially for them."
        },
        {
            "text": "In the long run, this change should reduce burdens on schools: once the RBA is established, it will mean that statutory assessments at the end of year 2 will be removed, meaning fewer statutory assessments for pupils and lightening teacher workload."
        },
        {
            "text": "No doubt the next year will continue to present challenges for schools. But we believe the RBA will help us to meet those challenges and demonstrate clearly the impact of our teaching on children."
        },
        {
            "text": " "
        },
        {
            "text": "Read more about the reception baseline assessments and how to prepare: www.gov.uk/STA"
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": "Want to receive blog posts in your inbox?"
        },
        {
            "text": "Sign up to receive blog updates."
        }
    ]
}