{
    "url": "https://insolvencyservice.blog.gov.uk/2021/07/19/planning-insolvency-strategies-for-a-post-pandemic-economy/",
    "title": "Planning insolvency strategies for a post-pandemic economy",
    "authors": [
        "Laura B"
    ],
    "categories": [
        "People",
        "Policy",
        "Stakeholders"
    ],
    "pub_date": "2021-07-19T09:25:21+00:00",
    "content": [
        {
            "text": "When I joined the Insolvency Service in 2003, I immediately set about organising the office ‘Christmas do’—much to the bemusement of my lovely colleague Steve, who normally booked the pub and arranged the buffet."
        },
        {
            "text": "Fresh out of university, where I’d arranged scores of themed fancy-dress bops, formal dinners and a glamorous graduation ball, I loved planning events. My new job, as a case clerk for the Official Receiver in Manchester, was a temporary thing. My true calling was to plan lavish celebrity parties, obviously. “I’ll be here six months, tops!”, I thought."
        },
        {
            "heading": 2,
            "text": "My passion for planning"
        },
        {
            "text": "As a naïve graduate, I clearly underestimated the pull of the Civil Service. Swept up in a current of examiner qualifications, I was soon riding the waves of company investigations. In 2018 I landed on the exotic shores of our Policy Team."
        },
        {
            "text": "When I heard that Dean Beale, our Chief Executive Officer (CEO), wanted to host an annual conference—gathering together academics, industry professionals and other stakeholders together to showcase the latest research and technical thinking—my ears pricked up. Was this a chance to rekindle my early passion for planning events?"
        },
        {
            "heading": 2,
            "text": "Forming the committee"
        },
        {
            "text": "Shortly after I volunteered to help, I found myself on a small committee which included academics from some of the UK’s top universities. There was clear enthusiasm for a rebooted version of the conference which the Insolvency Service used to host every year."
        },
        {
            "text": "The conference allows the opportunity for anyone with an interest in insolvency to present a research paper, or a technical issue relating to insolvency practice. The audience will be comprised of academics, policy makers, regulators, industry professionals and anyone else interested in the world of insolvency. I could see it would be a win-win for everybody involved."
        },
        {
            "text": "For the Insolvency Service, it will help build our reputation as a centre of excellence and innovation for insolvency."
        },
        {
            "text": "For those insolvency experts presenting their considered papers, it will provide an opportunity to contribute to the policy debate and obtain valuable feedback from people with an interest in their field of work."
        },
        {
            "heading": 2,
            "text": "Build back better"
        },
        {
            "text": "The committee agreed to hold the conference at Aston University in Birmingham, on 19 November 2021. We're aiming to welcome people in person, as well as making the event accessible online to make sure as wide an audience as possible can participate."
        },
        {
            "text": "The most difficult part of the planning process so far has been deciding on a theme. Given recent world events, the response to the COVID-19 pandemic seemed an obvious choice."
        },
        {
            "text": "The committee felt strongly that our theme should also be upbeat and positive, to chime with the government’s roadmap for a future beyond the pandemic and the desire to ‘build back better’."
        },
        {
            "text": "Eventually we decided on Forward Thinking: Insolvency strategies for a post-pandemic economy. I hope this theme will generate a varied and interesting agenda that encompasses many different areas of personal and corporate insolvency."
        },
        {
            "heading": 2,
            "text": "Call for papers"
        },
        {
            "text": "We launched a call for papers in June, and submissions are already coming in, with plenty of time left until the closing date of 23 July. Over the summer, two specialist panels will narrow down the papers before deciding on a final agenda (an Insolvency X-Factor, if you will)."
        },
        {
            "text": "Meanwhile, I'm working with colleagues in the CEO’s technical team, commercial, business support and communications teams on plans for the big day itself."
        },
        {
            "text": "I fully expect it to be a thrilling and nerve-jangling experience—just like those university events of old. And who knows, I may yet persuade the committee that we really should have fancy dress."
        },
        {
            "heading": 3,
            "text": "Further information"
        },
        {
            "text": " "
        }
    ]
}