{
    "url": "https://healthcareleaders.blog.gov.uk/2021/07/19/putting-staff-wellbeing-at-the-centre-of-recovery-plans/",
    "title": "Putting staff wellbeing at the centre of recovery plans",
    "authors": [
        "Sajid Javid - Secretary of State for Health and Social Care, Department of Health and Social Care"
    ],
    "categories": [
        "Supporting NHS staff"
    ],
    "pub_date": "2021-07-19T13:20:48+01:00",
    "content": [
        {
            "text": "During my first few weeks as Secretary of State for Health and Social Care, I’ve been struck by the range of brilliant work being done by so many amazing people."
        },
        {
            "text": "My visits to hospitals, community health services and vaccination centres have been filled with inspiring stories of the work you’ve done to support our national effort."
        },
        {
            "text": "Now, we face the monumental task of recovering services. However, as we do this, I understand that NHS colleagues must be given the opportunity to recover too, and this is at the centre of our plans."
        },
        {
            "text": "Earlier this year, we made extra funding available to help Trusts bust the backlog, and complete more operations and other elective procedures through the £1 billion Elective Recovery Fund (ERF). It was really important to us that, in order to access the fund, Trusts have to demonstrate what they are doing to support their staff’s health and wellbeing."
        },
        {
            "text": "This might be giving the option for colleagues to carry over or buy back all unused annual leave, or making health and wellbeing a more prominent part of objectives and development plans."
        },
        {
            "text": "As well as the changes we’ve been making, it’s been really encouraging to hear about colleagues driving change where they work. One example is Wellbeing Guardians, members of staff who sit at Board level and are empowered to push for positive action around health and wellbeing where they work."
        },
        {
            "text": "Not only can they challenge the Board on the impact of its decisions on health and wellbeing, but they also play a vital role in making sure perspectives from across this diverse institution are being considered."
        },
        {
            "text": "You can find out more about becoming a Wellbeing Guardian here – I’d urge everyone to sign up and make a difference where you work."
        },
        {
            "text": "As I said in my letter to NHS colleagues last week, you have all done so much to support this country over the last 18 months. Just as you have been there for us throughout this national emergency, we will be there for you, giving you the support you need to recover."
        }
    ]
}