{
    "url": "https://educationhub.blog.gov.uk/2021/07/step-4-whats-changed-in-early-years-schools-colleges-and-universities/",
    "title": "Step 4: What’s changed in early years, schools, colleges and universities?",
    "authors": [
        "mediaofficer"
    ],
    "categories": [
        "Coronavirus",
        "early years",
        "Schools",
        "Universities"
    ],
    "pub_date": "2021-07-19T15:21:18+01:00",
    "content": [
        {
            "text": "Today (Monday 19 July), the country moved to Step 4 of the Government’s roadmap and further restrictions were lifted."
        },
        {
            "heading": 3,
            "text": "So what’s actually changed and what does it mean for me?"
        },
        {
            "text": "Early years, schools and colleges will no longer be asked to do routine contact tracing. NHS Test & Trace will do this rather than those working in education."
        },
        {
            "text": "Schools and colleges will also no longer be required to keep pupils or students in year group or classroom bubbles or to reduce mixing. In the early years children will be free to mix within groups."
        },
        {
            "text": "A lot of schools have already broken up for the summer holiday but some are still teaching this week. Those schools are able to remove bubbles now but we recognise that this may involve re-jigging the timetable so settings may keep bubbles in place until the end of term if they wish."
        },
        {
            "heading": 3,
            "text": "What about face coverings?"
        },
        {
            "text": "Face coverings will no longer generally be advised for pupils and staff either in classrooms or in communal areas."
        },
        {
            "text": "We still, however, expect and recommend that face coverings are worn in crowded and enclosed spaces when mixing with people you don’t usually meet. This will apply to some visitors to education and childcare settings."
        },
        {
            "text": "Pupils aged 11 and over should continue to wear face coverings on public transport, and on dedicated school or college transport, when travelling to and from school or college."
        },
        {
            "heading": 3,
            "text": "Will testing continue in the autumn term?"
        },
        {
            "text": "Testing is expected to resume in the autumn term for staff and for students of secondary age and above whether they have symptoms or not."
        },
        {
            "text": "Staff across all education settings should prepare to test regularly at home, subject to public health advice on the need to test people who have been vaccinated."
        },
        {
            "text": "University students should be encouraged to test before they travel back to university by collecting a free LFD home test kit from their local pharmacy or by ordering online."
        },
        {
            "heading": 3,
            "text": "What happens in the event of a pupil testing positive?"
        },
        {
            "text": "If a pupil tests positive – they will need to isolate."
        },
        {
            "text": "From today, NHS Test & Trace will contact the student and/or their parent or legal guardian to identify close contacts and will contact individuals who need to isolate."
        },
        {
            "text": "From 16 August, under 18s and fully vaccinated adults won't need to isolate if they are a close contact of a case, unless they develop symptoms themselves."
        },
        {
            "heading": 3,
            "text": "Can schools continue to carry on contact tracing until the end of term if they wish?"
        },
        {
            "text": "NHS Test and Trace will carry out all routine contact tracing in education settings from 19 July, as they do with other settings."
        },
        {
            "text": "There may be exceptional circumstances, for example when dealing with a major outbreak, where schools, colleges and nurseries may need to help with identifying close contacts."
        },
        {
            "text": "If schools are concerned they might have an outbreak they should call the dedicated advice service who will escalate the issue to the local health protection team where necessary and advise if any additional action is required, such as implementing elements of the outbreak management plan."
        },
        {
            "heading": 3,
            "text": "What about early years settings? What are the key changes there?"
        },
        {
            "text": "Very little is changing for early years settings like nurseries. We’ve removing the need to limit mixing between groups and contact tracing conducted by staff in early years settings, schools and colleges. NHS Test & Trace will now oversee contact tracing in all education settings. Settings should continue to report cases to Ofsted as previously."
        }
    ]
}