{
    "url": "https://accessibility.blog.gov.uk/2021/07/19/talking-thinking-and-learning-about-digital-accessibility-and-inclusion/",
    "title": "Talking, thinking and learning about digital accessibility and inclusion",
    "authors": [
        "George Papatzanis"
    ],
    "categories": [
        "Access needs",
        "Accessibility",
        "Assistive technology"
    ],
    "pub_date": "2021-07-19T09:00:39+01:00",
    "content": [
        {
            "text": "The 10th anniversary of the Global Accessibility Awareness Day (GAAD) was on 20 May 2021. To mark this anniversary, HMRC wanted to really engage with colleagues across the business and get everyone talking, thinking and learning about digital accessibility and inclusion."
        },
        {
            "text": "We all have a part to play, accessibility is everyone’s responsibility. Two months on, this is what we found out:"
        },
        {
            "heading": 2,
            "text": "How did HMRC play its part?"
        },
        {
            "text": "Everyone has a role and responsibility in creating an inclusive and accessible workplace, so it was important to create a varied programme of activities that allowed people to get involved, regardless of their level of knowledge or experience. HMRC held 19 events to celebrate how it is working towards creating accessible, inclusive services for all users and colleagues. The department delivered its biggest and best GAAD events yet and had over 2,250 registrations of attendance across the sessions."
        },
        {
            "heading": 3,
            "text": "Four key messages were identified"
        },
        {
            "text": "All the events were centred around different themes. We have reflected on the 4 key learnings taken from the event and how HMRC can make 2021 its most accessible year yet."
        },
        {
            "heading": 3,
            "text": "1) Understanding users and their needs: Recruit inclusively for user research"
        },
        {
            "text": "For HMRC, the needs of all of our users (including individual customers, businesses, agents and our own staff) should be at the heart and forefront of anything that is built, designed or purchased. It is a service team’s responsibility to make sure government services work for everyone and user research plays a key role in achieving this goal. Teams need to listen and reflect this in the way they build and design services. You need to recruit users with access needs and find how assistive technologies may interact with your service. Such users provide insight based on lived experiences and provide invaluable input into services and support models."
        },
        {
            "heading": 3,
            "text": "2) Testing digital services with accessibility in mind: Accessibility guidance is complex, but collaboration fosters innovation"
        },
        {
            "text": "Understanding Web Content Accessibility Guidelines 2.1 (fondly known as WCAG) has been a big focus for all government organisations during 2020 to 2021, with the Public Sector Bodies Accessibility Regulations 2018 coming into full effect, people across government had to engage with the very technical regulations for the first time. Legal changes such as these can make service owners, managers and their teams feel isolated, and unsure of where to turn for advice. This year, HMRC recognised that many government departments were in this position and ran a cross-government assistive technology audit demonstration to show what considerations it makes when building services. The session received positive feedback with some saying they will reflect some of HMRC’s techniques in their own audits in the future. The session is now available to view via YouTube."
        },
        {
            "text": "HMRC also organised smaller and more intimate sessions, including a drop-in accessibility clinic, run by digital inclusion consultants who were ready to offer advice and support on any issues (technical or not). A cross-discipline event was also organised, which explored the culture of inclusivity and accessibility across the organisation. No technical knowledge was required, just an ambition to improve and an enthusiasm for collaboration."
        },
        {
            "heading": 3,
            "text": "3) Working with assistive technology: Build empathy to build understanding"
        },
        {
            "text": "When HMRC colleagues return to an office environment, many offices will have Accessibility Empathy Hubs. A space which provides equipment and technology to help build an understanding of different assistive technologies and their uses. However, due to COVID-19, many colleagues have been unable to access these facilities so we wanted to find a different way to show what working with assistive technology was like."
        },
        {
            "text": "Plenty of technical sessions discussed this subject (including an entire session discussing HMRC’s assistive technology catalogue for colleagues), but some sessions focussed on the bigger picture and building empathy."
        },
        {
            "text": "Demystifying the topic of accessibility and making it accessible was a key objective of HMRC’s GAAD events. Many colleagues who have disabilities supported this vision by running sessions to show how they use assistive technology in their daily working lives. Attendee feedback commented that seeing and hearing a real person use the technology enhanced their understanding and significantly impacted their view of what ‘assistive technology’ was and what it meant to users of it."
        },
        {
            "heading": 3,
            "text": "4) Beyond technology - It is more than service design: Be brave and ambitious"
        },
        {
            "text": "When thinking about designing digital services, it is easy to get lost in the technical code and how the service is designed. However, it is important to:"
        },
        {
            "heading": 2,
            "text": "Putting people first!"
        },
        {
            "text": "If there is one thing that connects all these learnings together, it is that the accessibility conversation across government should not solely focus on adhering to guidelines and complying with regulations. Essentially, everyone should strive to make something that as many people as possible can use in an equal and equitable way. There will be technical challenges and complexities during the development process, but by engaging with people who have both lived experiences and subject matter expertise, teams can truly begin to build inclusive and accessible services that not only comply with regulations, but also embody the values of government organisations."
        },
        {
            "heading": 3,
            "text": "Some other tips for creating services and products that are accessible and inclusive"
        }
    ]
}