{
    "url": "https://ipa.blog.gov.uk/2022/10/12/defence-vehicle-demonstration-dvd-2022-bringing-to-life-the-transformation-of-the-british-army/",
    "title": "Defence Vehicle Demonstration (DVD) 2022: Bringing to life the transformation of the British Army",
    "authors": [
        "Lydia Randall"
    ],
    "categories": [
        "Major Projects",
        "Project Delivery",
        "Transforming Infrastructure Performance"
    ],
    "pub_date": "2022-10-12T16:42:15+01:00",
    "content": [
        {
            "text": "Project Delivery Advisor, Lydia Randall, from the Infrastructure and Projects Authority (IPA) shares her insights from an engaging visit to the Defence Vehicle Demonstration (DVD) 2022 with IPA Chief Executive Officer, Nick Smallwood and IPA Deputy Director of Defence, Martin Sturgeon."
        },
        {
            "text": "Why does the British Army need to transform?"
        },
        {
            "text": "UK Defence is facing challenges that are complex and dynamic with the new global threat rapidly evolving."
        },
        {
            "text": "To keep pace with the evolving shape of warfare, UK Defence released the Integrated Review in 2021, which sets out a strategic framework for achieving the UK’s national security and international policy objectives between now and 2025.  This laid the path for ‘Future Soldier’ which set out the most radical transformation of the British Army in decades, enabling it to tackle next generation threats and position itself as ‘a globally engaged fighting force’. It will move away from legacy systems, and adopt the use of intelligent data and optimisation of supply chain relationships to ensure access to the most modern equipment.  "
        },
        {
            "text": "What is DVD 2022?"
        },
        {
            "text": "DVD 2022 explores ‘Future Soldier’ and the Land Industrial Strategy, bringing transformation and sustainment of world-class capabilities across the spectrum of Land Equipment to life. Through themed areas, presentations and vehicle displays, it showcases how digital technologies and capabilities are changing the way the defence sector is adapting to confront new UK threats."
        },
        {
            "text": "Attending DVD provided the IPA with the opportunity to meet with a number of Senior Responsible Owners (SROs) who lead the delivery of the British Army’s largest and most complex programmes in support of ‘Future Soldier’. The SROs were able to give an insight into why UK defence needs to deliver transformational change and shared progress on what they are doing to set programmes up for delivery success. "
        },
        {
            "text": "The Collective Training Transformation Programme"
        },
        {
            "text": "We kick started our engagement sessions with Mike Cooper, SRO of the Collective Training Transformation Programme (CTTP). "
        },
        {
            "text": "Mike explained that the army’s current collective training system, although effective, is constrained by its inability to evolve at the same pace as changing defence threats and technological advancements. "
        },
        {
            "text": "He described the new system as encompassing digitisation, modern synthetics, data exploitation and connectivity and that it will provide the British Army with the flexibility required to create the widest possible range of training scenarios for the future. This will ensure that the British Army keeps pace with allies and stays ahead of adversaries. "
        },
        {
            "text": "To support cohesive delivery of the transformation programme, Mike described the work taking place to establish an integrated ‘delivery agent’ and Army programme team as it prepares itself for the programme’s next phase. The integrated programme team will not only create resource efficiencies, but it will further support MOD’s ambition to improve collaborative working, capitalising on skill sets and knowledge across the Defence enterprise."
        },
        {
            "text": "Boxer Mechanised Infantry Vehicle Programme"
        },
        {
            "text": "Our second engagement session was with Martyn Williams (SRO) and the team responsible for delivering the Boxer Mechanised Infantry Vehicle Programme."
        },
        {
            "text": "Martyn explained how the Boxer mechanised infantry vehicle is meeting the ambition of the UK Defence strategic requirements including the UK Integrated Review which sets out to establish a “modernised, adaptable and expeditionary fighting force” which would be “optimised to fight a peer adversary in a NATO context”. Boxer further supports the ambition of ‘Future Soldier’ which sought to reconfigure the army around the emerging Armoured Brigade Combat Team concept. This would create an army that is expeditionary by design, ensuring it can self-deploy and operate over long periods of deployment. "
        },
        {
            "text": "He described the programme as delivering a new ground manoeuvre capability based around Boxer, an all-terrain armoured vehicle which can deploy soldiers quickly and reliably over long operational distances, with minimal logistics and high tactical mobility to deter, constrain and defeat threats. Furthermore, he described the new Boxer as modular by design, allowing units to be designed around the task at hand. "
        },
        {
            "text": "In closing our discussion, Martyn explained that much of the programme’s success is built on a strong collaborative approach to delivery and maximising the off the shelf purchase of a vehicle in service with other allies. The programme draws on constructive external challenge and pragmatic engagement with stakeholders. Building relationships across defence, allies, industry and central government (including the IPA) to share plans and work innovatively."
        },
        {
            "text": "Following our briefing, we had the opportunity to experience the Boxer vehicle while it navigated the Millbrook test track. This allowed us to witness this cutting-edge technology in action. Swamp-like pools, steep terrain, and overhanging obstructions were no match for the mechanised infantry vehicle as it manoeuvred around the course with agility and speed. "
        },
        {
            "text": "Main Battle Tank - Challenger 3 Programme"
        },
        {
            "text": "To round off an excellent day of engagements, we met with Chris Bowbrick, SRO of the Challenger 3 Programme, supported by Programme Director, Col William Waugh."
        },
        {
            "text": "Chris explained that new global threats have shown the need to have a main battle tank which is capable of defeating and surviving the range of threats on a modern battlefield. Challenger 3 will be the British Army’s only guaranteed 24-hour, all-weather, mobile anti-tank capability. This will be achieved by pairing a new smoothbore 120mm gun with modular armour and state of the art electronic systems."
        },
        {
            "text": "William then explained details of the tank's planned upgrades. This included the new ammunition types, new target acquisition systems, mobility upgrades and a cutting-edge Active Protection System (APS) which allows the tanks to recognise incoming threats and neutralise them."
        },
        {
            "text": "Chris described the importance of working collaboratively with the delivery agent, Defence Equipment and Support (DE&S), as well as with the supply chain to ensure successful delivery. "
        },
        {
            "text": "How we are supporting the delivery of the British Army's major programmes"
        },
        {
            "text": "Sitting at the heart of government, reporting to the Cabinet Office and HM Treasury, IPA provides expert project delivery advice, support and assurance to ensure projects are delivered efficiently and effectively."
        },
        {
            "text": "The relationships we have with our stakeholders is fundamental in our ability to make a positive impact to programme delivery. A ‘one team’ approach underpins everything we do in the IPA Defence Team. We build a healthy understanding of the value each specialism in our team provides. This allows us to deploy our collective skills and experience to ensure we achieve aligned expectations and win-win outcomes."
        },
        {
            "text": "As the IPA Programme Advisor for the IPA Defence Team’s Army led major programmes, I work closely with programme teams to provide challenge and support to drive successful programme delivery. This involves working side by side with programmes - even at the back of a Chinook Helicopter!"
        },
        {
            "text": "Drawing on IPA assurance review recommendations and face-to-face engagement, I can drill down on specific challenges and constraints to ensure IPA provides the right support, at the right time, to drive performance improvements. This support may include the provision of embedded IPA commercial expertise to resolve gritty medium-term issues, or IPA associate support to provide short term bespoke advice and independent insights on programmatics. We also support the application of IPA tools and guidance which have been developed through data gathered from other major programmes. This ensures collective insights and lessons learned from across government’s major programmes are being fed back into the system to set programmes up for success."
        }
    ]
}