{
    "url": "https://socialcare.blog.gov.uk/2022/10/12/food-for-the-soul-nurturing-residents-and-careers-in-social-care/",
    "title": "Food for the soul: nurturing residents and careers in social care",
    "authors": [
        "Linda Aduma"
    ],
    "categories": [
        "Dementia",
        "Workforce"
    ],
    "pub_date": "2022-10-12T09:53:37+00:00",
    "content": [
        {
            "heading": 2,
            "text": "Care tailored to conditions"
        },
        {
            "text": "Around 900,000 people in the UK live with dementia. This is projected to rise to 1.6 million by 2040, yet little is still known about the disease. All the more reason, to do all we can to support those living with the condition."
        },
        {
            "text": "Every day is different when caring for people living with dementia,  but whatever we do it’s got to be right, it’s got to be first-class for the residents and the families who rely on us to deliver great care for their loved ones."
        },
        {
            "text": "I joined Vida in 2018, after a career in hospitality, so I am already used to striving for the highest standards in the kitchen. My main aim is to make sure our residents receive an enriched dining experience, with diets tailored to each individual. On an average day, I’ll work with my incredible kitchen team to take in food deliveries, coordinate specialist menus (three meals a day) and even arrange afternoon tea."
        },
        {
            "text": "For the majority of people, food plays a huge part in their happiness and this is no exception for people living with dementia. Since I first started working at Vida Healthcare I’ve understood the importance of providing meals which are nourishing mentally as well as physically."
        },
        {
            "text": "Whether it’s the menu, the texture of food, its colour, or specific ingredients, every choice we make is carefully considered."
        },
        {
            "text": "We only provide our residents with the freshest ingredients and we try to make each meal different to keep them excited and interested in the food they’re eating."
        },
        {
            "heading": 2,
            "text": "Thought for food"
        },
        {
            "text": "A significant consideration for anyone working in a care home or with people living with dementia are the different dietary requirements. For example, one symptom that can manifest is dysphagia, where a person has difficulty swallowing. This of course means that we have to make sure their food is prepared and cooked correctly for them to be able to eat and enjoy it."
        },
        {
            "text": "The most rewarding part of my day is seeing the positive impact we have on the health and wellbeing of Vida’s residents. For the right people, a career in care is extremely rewarding."
        },
        {
            "text": "Seeing the smiles on the residents’ faces as they enjoy my food gives me so much enjoyment and I couldn’t ask for more. It’s a mutual relationship, where we provide the care and support our residents and families need and we receive the gratification we’re having a positive impact on their lives."
        }
    ]
}