{
    "url": "https://valuationoffice.blog.gov.uk/2022/10/12/how-we-value-stables/",
    "title": "How we value: Stables",
    "authors": [
        "voadigitalpublishing"
    ],
    "categories": [
        "How We Value",
        "Surveying",
        "Valuation"
    ],
    "pub_date": "2022-10-12T10:35:09+01:00",
    "content": [
        {
            "text": "Amy Pratt is a National Valuation Lead in the Valuation Office Agency (VOA). In this blog, Amy explains what is involved in valuing stables."
        },
        {
            "text": "The sector"
        },
        {
            "text": "The VOA is required by law to value almost all non-domestic properties (properties that aren’t just private homes) in England and Wales. Once these properties have been valued, they are added to rating lists."
        },
        {
            "text": "There are currently around 11,000 stables (excluding racing stables) on the local rating list for England and Wales. This includes riding stables, livery stables and stud farms."
        },
        {
            "text": "The rating list also includes some stables that are used for private rather than businesses purposes. These ‘private use stables’ are added to the list if they are classed as non-domestic properties. Location of a private stable site in relation to a home is the main factor that determines whether it is entered into the rating list as a non-domestic property."
        },
        {
            "text": "Equestrian properties contain different types of stables. They range from traditional brick and tile buildings to more modern American barns. A range of facilities may also accompany the stables. These can include:"
        },
        {
            "text": "How are stables valued?"
        },
        {
            "text": "We value stables on a rental basis. This is based on an estimate of the property’s open market rental value on a specific date. This date is set out in legislation and is known as the Antecedent Valuation Date. For the 2023 Revaluation, this date will be 1 April 2021."
        },
        {
            "text": "We use rental information to give each stable a rental value. This figure does not include the value of non-rateable items, such as living accommodation or agricultural land. The value of a stable will vary depending on its location. More popular equestrian locations are often valued at a higher rate."
        },
        {
            "text": "Basic items that you would expect to find in a stable yard, such as offices, tack rooms and feed stores, are reflected within the stable value. However, this is only in proportion to the number of stables on the site. Any extra items that are not generally expected on a site, such as horse walkers and arenas, are then added to the valuation as an ‘other addition’. Stable requirements differ for every site, and every valuation will reflect the specific make-up of the stables being valued."
        },
        {
            "text": "After valuing each stable and any additional items, we determine the site’s total rateable value. The local council then uses this rateable value to work out how much the site is liable to pay in business rates. This includes applying any reliefs that they qualify for. In practice, these reliefs mean most private stables don’t pay any business rates at all."
        },
        {
            "text": "Industry discussions"
        },
        {
            "text": "We hold discussions on our approach to valuing stables with a variety of experts, including the British Horse Society. This helps us to better understand the industry and make sure our methods are up to date."
        },
        {
            "text": "Valuing stables is often complex as every site is different. However, the goal is always to arrive at an accurate rateable value for each property."
        }
    ]
}