{
    "url": "https://childrenssocialcare.blog.gov.uk/2022/10/19/fostering-for-adoption-early-permanence-carers/",
    "title": "Fostering for adoption: early permanence carers",
    "authors": [
        "Hannah Moss"
    ],
    "categories": [
        "Adoption"
    ],
    "pub_date": "2022-10-19T16:12:22+01:00",
    "content": [
        {
            "text": "Hannah Moss started her career in child protection and has been a social worker for 11 years. She is now an adoption manager and lead in early permanence, which is also known as fostering for adoption.  "
        },
        {
            "text": "I have always believed that wherever possible, children should remain with their parents or within their family, however where this is not possible, adoption provides a permanent family. In my adoption role, I have developed a greater understanding of the impact of trauma on attachment and brain development.  Early permanence is a way of supporting children to reach a place of stability, at the earliest point and minimise the impact of this trauma.  "
        },
        {
            "text": "When prospective adopters approach an adoption agency, they will primarily be thinking about becoming a permanent family; we support them to think about a route where permanence may take a bit longer and may not be with the first child they care for. "
        },
        {
            "text": "Although a placing local authority may think adoption is a likely outcome, these placements are not pre-emptive and if a family member is identified and positively assessed, the early permanence carers will support the children to move to that family member – annually, approximately 5-15% of children return to a family member.  "
        },
        {
            "text": "Hearing the experience of carers is always powerful, it helps to increase awareness amongst professionals and encourages other early permanence carers to come forward. I spoke with Peter and Irina who illustrate why early permanence is a fulfilling route to adoption and what they learnt from this experience.  "
        },
        {
            "heading": 4,
            "text": "What was your motivation to do early permanence (EP)? "
        },
        {
            "text": "Irina: When we started thinking about adoption, we thought we would choose the mainstream route. However, upon learning more about EP, we realised it gave us the option to get to know our future child as early as possible and prevent any attachment difficulties and trauma.  We felt that we were strong enough to deal with the uncertainties and the possibility that a child may return to their birth family. Being in a long, established, happy relationship, we knew that we could support each other.  "
        },
        {
            "text": "Peter: We were aware of the impact of trauma on development. With the EP route it was appealing, that it reduces the number of transitions and supports attachment.  "
        },
        {
            "text": "You had two placements before adopting as the first child you cared for returned to their birth family. Could you talk about how you managed the uncertainty?  "
        },
        {
            "text": "Irina: We focused on the child’s experience and the here and now. We tried not to plan for and project into the future. We focused on being foster carers, supporting the child and enjoying their company – having all the fun of looking after a little person.  "
        },
        {
            "text": "How did you decide to do it for a second time?  "
        },
        {
            "text": "Peter: It was difficult. However, as soon as we started the first child’s move to his birth family, we saw that this was the best possible outcome for him. We felt very sad, but despite this we knew we wanted to do it again.   "
        },
        {
            "text": "Irina: However hard it was to return that child, we felt we had gained so much. We really loved looking after him and going through that transition period really reinforced for us all the merits and benefits that EP can provide for children in a vulnerable place.  "
        },
        {
            "text": "It was difficult but very clear to us that he belonged there, and we felt really privileged that we could be part of it and support him through that period of uncertainty in his life.  It was a very beautiful thing to see him return to where he needed to be.  "
        },
        {
            "text": "Second time round your child was placed at 5 months [while still in care proceedings] from his previous foster carer to you. How did you handle this process?  "
        },
        {
            "text": "Peter: It was so powerful to have a relationship with his previous foster carer. We are still in contact, and she is still very much a part of the child’s extended family. "
        },
        {
            "text": "Irina: With the second placement, we were much more familiar with the whole process of being foster carers. One of the many wonderful things about young children is that they really allow you to live in the moment and anchor you in the here and now.  "
        },
        {
            "text": "What are your reflections on early permanence now you have adopted? "
        },
        {
            "text": "Peter: It was such a learning curve; it was an experience of a lifetime to be honest. It is very rewarding, despite the difficulties and the uncertainties.  "
        },
        {
            "text": "Irina: We just consider ourselves so lucky to have found our child through this route, it really meant we could bond with him as early as possible. We were there for many ‘firsts’ and that meant a lot.  "
        }
    ]
}