{
    "url": "https://defrafarming.blog.gov.uk/2022/10/19/future-farming-podcast-young-people-in-farming/",
    "title": "Future Farming Podcast: Young people in farming",
    "authors": [
        "Matt McGuire",
        "The Team"
    ],
    "categories": [
        "Future Farming Podcast"
    ],
    "pub_date": "2022-10-19T14:59:32+01:00",
    "content": [
        {
            "text": "To celebrate National Young Farmers' Week 2022, Matt McGuire welcomes 3 up-and-coming young people in farming to the podcast."
        },
        {
            "text": "Charlie Beaty, Ed Dungait and Charlotte Garbutt discuss how to get started in farming, the importance of education and the range of roles in agriculture. They also discuss the benefits new talent can bring to the sector."
        },
        {
            "heading": 2,
            "text": "Our guests"
        },
        {
            "heading": 3,
            "text": "Charlie Beaty"
        },
        {
            "text": "Charlie is a mixed beef, sheep and arable tenant farmer in north Warwickshire, lightly trialling and integrating the livestock and arable enterprises to reduce inputs and costs."
        },
        {
            "text": "Charlie is the current Warwickshire Young Farmers Club County Chairman."
        },
        {
            "text": "She holds a BSc in Agriculture from Harper Adams University (2017)"
        },
        {
            "text": "Follow Charlie on Twitter @MeridenFarm"
        },
        {
            "heading": 3,
            "text": "Ed Dungait"
        },
        {
            "text": "Ed is an arable tenant farmer at Morpeth, Northumberland. He works in partnership with his parents. Together they farm 600 acres of combinable crops."
        },
        {
            "text": "Ed is Chair of the National Federation of Young Farmers' Clubs."
        },
        {
            "text": "He holds a BSc (Hons) in Agriculture with Crop Management from Harper Adams University (2014)."
        },
        {
            "text": "Follow The National Federation of Young Farmers' Clubs on Twitter."
        },
        {
            "heading": 3,
            "text": "Charlotte Garbutt"
        },
        {
            "text": "Charlotte is an Area Manager for a global agrochemical company."
        },
        {
            "text": "Charlotte and her partner Josh are following their ambition to farm and have a small herd of pedigree Limousins on their smallholding which they bought together."
        },
        {
            "text": "She recently hung up her hat after a 2-year stint as Lincolnshire Young Farmers County Chair and is currently National Federation of Young Farmers Agri Chair."
        },
        {
            "text": "Charlotte holds a BSc in Agribusiness from Harper Adams University (2017)."
        },
        {
            "text": "Follow Charlotte @ThisIsGarbs on Twitter."
        },
        {
            "text": "Many thanks to all our guests for taking part."
        },
        {
            "text": "Follow the week's hashtags: #NationalYoungFarmersWeek and #homegrown"
        },
        {
            "text": "Read the full transcript of the podcast."
        }
    ]
}