{
    "url": "https://ukhsa.blog.gov.uk/2022/10/19/health-equity-and-the-uk-health-security-agency/",
    "title": "Health equity and the UK Health Security Agency",
    "authors": [
        "Adam Briggs",
        "Shona Arora",
        "Catherine Falconer"
    ],
    "categories": [
        "Health Equity"
    ],
    "pub_date": "2022-10-19T10:52:18+01:00",
    "content": [
        {
            "heading": 2,
            "text": "What is health equity?"
        },
        {
            "text": "The World Health Organisation defines health equity as “the absence of unfair and avoidable or remediable differences in health among population groups defined socially, economically, demographically or geographically.”"
        },
        {
            "text": "Crucial to this definition is that the differences are unfair and avoidable. This means that there are things we can do to achieve health equity by addressing health inequalities between individuals, communities, and populations."
        },
        {
            "heading": 2,
            "text": "Why should we aim to achieve health equity?"
        },
        {
            "text": "The UK Health Security Agency’s (UKHSA) mission is to prepare for, prevent, and respond to external hazards that could impact our health and to achieve more equitable outcomes. These hazards include infectious diseases and pandemics, the health impact of climate change and poor air quality, and radiological, chemical, and nuclear exposures."
        },
        {
            "text": "External health hazards are not experienced equally by everyone. Stark differences exist between communities and population groups in the risk of exposure to an external health hazard, susceptibility to poor outcomes, and the ability of an individual or community to recover."
        },
        {
            "text": "For example, women who live in the most deprived parts of England spend over 19 years longer in poor health compared to women living in the least deprived areas."
        },
        {
            "text": "The life expectancy of people who are homeless is over 30 years lower than the general population with individuals suffering from a disproportionate burden of infectious diseases such as tuberculosis, hepatitis C, and HIV. And during the first wave of the COVID-19 pandemic, men and women from Bangladeshi backgrounds were twice as likely to die from COVID-19 than people of White British backgrounds– even after accounting for differences in age, sex, deprivation and pre-existing health status."
        },
        {
            "text": "Reducing these unfair and avoidable differences are essential to realise UKHSA’s ambitions to address the burden of ill-health caused by infectious diseases and environmental hazards."
        },
        {
            "text": "At UKHSA, achieving more equitable outcomes is one of our priorities. One of the first steps is to ensure that everyone who works in the organisation and our external health partners understands their role in tackling health inequalities. We are embedding health equity in everything we do to help us to protect every person, in every community."
        },
        {
            "text": "Addressing the specific health security needs of disproportionately impacted communities will help us to protect the rest of the population. For example, improving rates of childhood vaccination among communities with low uptake will reduce the chance of local outbreaks of measles and mumps."
        },
        {
            "heading": 2,
            "text": "Our legal responsibilities"
        },
        {
            "text": "At UKHSA we also have legal responsibilities for tackling health inequalities. The Equality Act 2010 requires all public sector bodies to address inequalities related to the nine protected characteristics – age, disability, gender reassignment, marriage and civil partnership, race, religion or belief, sex, and sexual orientation."
        },
        {
            "text": "This is known as the Public Sector Equality Duty (PSED). Our specific PSED objectives reflect our aim to embed health equity across our work and we are monitoring our progress to ensure we meet our legal responsibilities."
        },
        {
            "heading": 2,
            "text": "What are we doing now about health equity?"
        },
        {
            "text": "We have a dedicated health equity team that is currently looking across our programmes, policies, and processes to develop our health equity strategy."
        },
        {
            "text": "This includes taking a ‘people and pathogen’ approach. This means not only preparing for and responding to external hazards like flu, but also focusing on how we can meet the needs of individuals and communities at greatest risk across multiple health threats. For example, vulnerable migrants or people in contact with the justice system."
        },
        {
            "text": "To help with this, we have adopted the Core20PLUS framework originally developed by NHS England. The framework defines the populations and communities that we routinely consider throughout our work to tackle health inequalities."
        },
        {
            "text": "The Core20 refers to people living the 20% most deprived places in the country, as defined by the national Index of Multiple Deprivation – an index made up of seven domains including many of the conditions in which people are born, grow, work, live and age (the wider determinants of health)."
        },
        {
            "text": "The PLUS refers to communities and populations defined by protected characteristics such as ethnicity, sexuality, and disability; geographic inequalities (for example, people living in coastal communities); and inclusion health groups. Inclusion health groups are socially excluded populations that are particularly vulnerable to external health threats."
        },
        {
            "text": "These groups are also less likely to be represented in routine datasets meaning inequalities are often hidden. Inclusion health groups include vulnerable migrants, people experiencing homelessness, and Gypsy, Roma, and Traveller communities."
        },
        {
            "text": "Our work with Core20PLUS communities and populations includes partnering with relevant community groups to develop culturally sensitive and language-appropriate communication materials in response to disease outbreaks. This ensures we are more effective at delivering our public health messages to individuals and populations that are often underserved. Another example is providing specific heat wave advice for vulnerable people living in settings such as care homes and places of detention."
        },
        {
            "text": "Embedding health equity into our practice also means ensuring our wider organisational activity supports health equity and inclusion through our recruitment policies, how we procure goods and services, and where we build new offices and laboratories."
        },
        {
            "text": "Alongside considering health equity across our programmes, we are focusing on three areas of work:"
        },
        {
            "text": "The first is how we can work with partners and stakeholders to maximise opportunities to improve health equity. This includes colleagues in national government such as the NHS and the Office for Health Improvement and Disparities, with local and regional stakeholders such as local government and NHS integrated care systems and with volunteer and community organisations."
        },
        {
            "text": "The second is continuing to improve our data and surveillance – working with the public to better understand the needs of the most deprived and vulnerable populations."
        },
        {
            "text": "And the third is ensuring that our science strategy informs how we work across society, aiming to improve outcomes for those with the greatest need. We will ensure our evaluations help us understand the impact of our work on tackling health inequalities."
        },
        {
            "heading": 2,
            "text": "What’s next?"
        },
        {
            "text": "Over the coming months, we will share some of this work with you through further blogs that take a look at our health equity data. These will focus on particular hazards and populations to explore health inequalities, explain what we do and don’t know from the data, and highlight what can be done to deliver more equitable health security outcomes for our whole population."
        }
    ]
}