{
    "url": "https://insolvencyservice.blog.gov.uk/2022/10/19/new-investigative-powers-enforcement-success-thanks-to-teamwork/",
    "title": "New investigative powers: enforcement success thanks to teamwork",
    "authors": [
        "Steven Fifer"
    ],
    "categories": [
        "Disqualification",
        "Enforcement",
        "Investigation and enforcement"
    ],
    "pub_date": "2022-10-19T10:02:23+00:00",
    "content": [
        {
            "text": "During summer 2022, the Insolvency Service announced it had successfully secured the first four disqualifications using new powers to tackle directors from abusing the dissolution process and walking away without paying their debts."
        },
        {
            "text": "The four directors were banned after they all falsely secured government bounce back loans before dissolving their companies, breaching the requirement to give notice to interested parties."
        },
        {
            "text": "In this blog, we explore how the Insolvency Service secured those disqualifications in a relatively short amount of time using brand new investigative powers."
        },
        {
            "text": " "
        },
        {
            "heading": 2,
            "text": "Be prepared"
        },
        {
            "text": "Elizabeth Pigney, a chief investigator for the Insolvency Service, said that following the groundwork and planning put in place by policy and other colleagues, work started in earnest in October 2021."
        },
        {
            "text": "This was two months before the new powers to investigate directors who abused the dissolution process to avoid paying their liabilities, as set out in the Rating (Coronavirus) and Directors Disqualification (Dissolved Companies) Act, was given Royal Assent."
        },
        {
            "text": "“A couple of months before the powers were enshrined in law, we put measures in place so we could hit the ground running once Royal Assent had been confirmed,” said Elizabeth. “We launched a brand-new taskforce, and the challenge was that we were facing somewhat of the unknown."
        },
        {
            "text": "“We didn’t have our normal sources of intelligence, couldn’t anticipate how many cases we were going to receive, or how difficult it was going to be to engage with directors.”"
        },
        {
            "text": " "
        },
        {
            "heading": 2,
            "text": "Alone we can do so little; together we can do so much."
        },
        {
            "text": "These are words attributed to Helen Keller but can also apply to the work of the taskforce as the key to their success was working in collaboration."
        },
        {
            "text": "The taskforce, led by Elizabeth, kicked off by looking at existing powers and processes used by the Insolvency Service. For intelligence, the taskforce could draw upon complaints received and reviewed by the agency’s Compliance and Targeting team."
        },
        {
            "text": "Investigators, however, found that complaints received into the agency were not always accurate and decided to engage with colleagues across the agency and wider government to strengthen intelligence gathering."
        },
        {
            "text": "“The majority of cases we were looking at were instances where directors had secured bounce back loans,” said Elizabeth. “But they ignored their obligations under the Companies Act and dissolved their companies without notifying their creditors, including government backed loan providers. Plus, they often left little details behind."
        },
        {
            "text": "“We worked with colleagues at Companies House to secure data so we could better reach-out to directors. To further bolster the quality of intelligence, the taskforce also worked with the agency’s investigation teams and also colleagues within Official Receiver Services to create a questionnaire which could be issued to directors engaged with during enquiries.”"
        },
        {
            "text": "The partnership working didn’t stop there. The taskforce was made up of investigators across the regions enabling them to share their unique local knowledge, while also sharing skills and ideas and developing best practice."
        },
        {
            "text": "The agency’s enforcement technical team were on-hand to provide procedure advice, while the  Legal Services Directorate helped with deciphering what constituted a criminal offence versus a civil offence considering the taskforce was touching upon new areas of misconduct."
        },
        {
            "text": "“This was very-much a successful demonstration of cross-agency working,” said Elizbeth. “Colleagues recognised we needed to work together as we were dealing with new powers. Everyone brought something different to the table to overcome barriers and help the agency achieve successful outcomes.”"
        },
        {
            "text": " "
        },
        {
            "heading": 2,
            "text": "Securing outcomes"
        },
        {
            "text": "Senior investigator Peter Smith joined the taskforce in May 2022 and helped provide leadership support to help streamline processes and ensure enforcement outcomes could be achieved."
        },
        {
            "text": "“Reaching out to directors is an essential part of the process,” said Peter. “We saw in several cases after we had reached-out where directors acknowledged they needed to pay back the government loan or even accept that they had walked away on purpose."
        },
        {
            "text": "\"However, there were others who denied all knowledge of receiving the loan but this didn’t dissuade us from using the full extent of the new powers.”"
        },
        {
            "text": "To date, the agency has secured six disqualifications against directors who dissolved companies to avoid paying their liabilities. Both Elizabeth and Peter agree that this is an excellent rate of success since the Insolvency Service secured the new investigative powers."
        },
        {
            "heading": 2,
            "text": "The next phase"
        },
        {
            "text": "Now that the first disqualifications have been secured, the taskforce is looking at the next phase of the project and is planning to engage with other regulators to talk about where else the new powers could be used to tackle misconduct."
        },
        {
            "text": "“We want to start talking with colleagues across government to spread awareness of our new powers,” said Peter. “We want to share what we have learnt over the past year and keep them informed of our activities in the enforcement space. There’s also a piece about using our new powers in other areas to educate and prevent directors from abusing their responsibilities."
        },
        {
            "text": "“Working with our enforcement colleagues across the agency and sharing our valuable insight is another key priority. For example, investigators who are looking at insolvent cases might spot abuses of the dissolution process and they should be able to come to us for advice about tackling that misconduct too.”"
        },
        {
            "text": "As someone who has been at the forefront of the taskforce since its inception, Elizabeth is in a good position to reflect on what has happened over the past year."
        },
        {
            "text": "“The taskforce has been a real successful demonstration of joint working,” said Elizabeth. “I am very proud of my colleagues on the taskforce who have got on with the job at hand and have been committed throughout, from understanding the new powers to devising new processes."
        },
        {
            "text": "“I also want to thank my colleagues from across the agency who have been keen to work with us and come up with solutions to ensure we removed from the corporate arena rogue directors who abused government support and the dissolution process to walk away from their debts.”"
        },
        {
            "heading": 3,
            "text": "Further information"
        },
        {
            "text": " "
        },
        {
            "text": " "
        }
    ]
}