{
    "url": "https://hmlandregistry.blog.gov.uk/2022/10/19/unlocking-automation-for-hm-land-registry/",
    "title": "Unlocking automation for HM Land Registry",
    "authors": [
        "Eddie Davies, Deputy Director – Digital Services (Head of Product)"
    ],
    "categories": [
        "Digital services"
    ],
    "pub_date": "2022-10-19T11:14:34+01:00",
    "content": [
        {
            "text": " "
        },
        {
            "text": "In a recent blog, Angie Clarkson explored how automation will transform our services. While the majority of our services are already automated, we believe we can automate much more and deliver faster, simpler services for our customers. However this is not going to be simple.  "
        },
        {
            "text": "While much of the groundwork for automation has been achieved through our previous Business Strategy, for us to be able to fully automate our work we will need to make some changes to the way that our customers submit applications.  "
        },
        {
            "text": "To explain this, we can break down the changes into what we’re calling‘the four keys of automation’: "
        },
        {
            "heading": 2,
            "text": "1. Digital Applications.  "
        },
        {
            "text": "We are seeing more and more of our applications coming into us via our digital application routes. These can either be through our award-winning Digital Registration Service on portal or, if customers want a more tailored and integrated experience, they can use conveyancing software that is connected to us via our Business Gateway APIs.​ Last financial year, only 8% of the applications to change or add to the register came in by post. The remaining 92% came from our online and digital channels.    "
        },
        {
            "heading": 2,
            "text": "2. Trust in application data "
        },
        {
            "text": "We need to place trust in the information provided to us, so we can move away from manually checking applications when they are submitted. We are piloting a system for conveyancers to submit confirmation of the data in their applications. We know that this will only be a success if the new system works for conveyancers and others, so we are listening to those involved in the pilot and talking to other conveyancers and stakeholders across the market to find the right solution. "
        },
        {
            "heading": 2,
            "text": "3. Application processing "
        },
        {
            "text": "We have invested heavily in a new caseworker system which can process the data from the digital applications. We have introduced the core of this new system and we’re rolling it out across application types. Our new Application Processing Engine has already reduced the time taken to process some applications by approximately 30% and we expect this to improve further. "
        },
        {
            "heading": 2,
            "text": "4. Digital Register "
        },
        {
            "text": "We need to store the data on the Land Register in a ‘digital’ way, this essentially means it can be read and understood by machines. Nearly 60% of all of our data is now machine readable. "
        },
        {
            "text": " We have shared a lot about our work toward Digital Applications, and we will continue to do so over the coming months as we approach our deadline of 30 November for becoming digital by default. We’ll also share more on the other components as they mature over the coming years and bring increasing benefits to our processing times. "
        },
        {
            "text": "We will also share more about initiatives to improve the quality of applications that come in to HM Land Registry. While our Digital Registration Service will help to reduce errors on applications, we will continue to explore other options to protect the integrity of the register while we introduce greater levels of automation. "
        },
        {
            "text": "We understand the challenges that our customer face. All of our work in this area is heavily informed and influenced by what our customers tell us. We regularly reach out to customers, with interviews and surveys, to discuss our ideas and plans. We talk regularly with stakeholders through our ‘industry forums’, community groups, and our Advisory Council. We’re testing systems – such as the one for customers to confirm the data in their applications - with customers as we build them.  "
        },
        {
            "text": "All of these are excellent channels for us to gain feedback and we believe it is only through working together that we can achieve our common goal, of benefitting from the advantages of digital technology. "
        },
        {
            "text": "Ultimately, we believe this is the start of a new era of instantaneous processing with applications to change the register started before completion and our requirements clearly understood and ticked off as part of the conveyancing workflow. "
        }
    ]
}