{
    "url": "https://forestrycommission.blog.gov.uk/2022/10/19/why-woods-are-so-important-for-nature/",
    "title": "Why woods are so important for nature",
    "authors": [
        "Kate Tobin"
    ],
    "categories": [
        "Ancient Woodland",
        "nature",
        "Tree Planting",
        "Woodland creation",
        "Woodland management"
    ],
    "pub_date": "2022-10-19T09:00:17+01:00",
    "content": [
        {
            "text": "Most of us have a favourite outdoor spot, a regular dog walk, a view from a window, a memory from a holiday or our own patch of ground – whether that’s a small front garden or something a bit bigger."
        },
        {
            "text": "We may love that spot for its peace, the birdsong, the buzz of the bees, the cool of the trees, or a sense of timelessness. Woodlands in particular can inspire us with a sense of going back in time, to an original wildwood – a simpler world, where nature was rich and dominant. Particularly relaxing of course, when we don’t have to deal with the awkward practicalities of fending off predators or finding food and shelter."
        },
        {
            "heading": 3,
            "text": "The Wildwood"
        },
        {
            "text": "The wildwood used to cover around three quarters of our islands, either as dense woodland or a more open wooded landscape, grazed by roe deer and wild horses, with huge ancient trees and a rich biodiversity in the woodlands and glades. By the end of the first world war, our woodland cover had shrunk to below 5% and – although we have made great strides to increase it – woodland still only covers 10% of England now, with only a quarter of that being ancient."
        },
        {
            "heading": 3,
            "text": "Our ancient trees and woodlands"
        },
        {
            "text": "Our ancient woodlands are the jewels in the crown of our remaining networks for nature. They are teeming with wildlife – rich irreplaceable communities of often rare species which have developed over centuries and found their last refuge here. But our ancient woodlands are fragmented, increasingly small and disconnected from each other. Our ancient trees are equally irreplaceable and even more isolated from each other, despite the UK having one of the most remarkable stocks of ancient trees left in Europe."
        },
        {
            "text": "The England Trees Action Plan recognises the value of our ancient woodland, ancient and veteran trees, and other semi-natural woodland. There are a growing number of inspiring initiatives across the country that are restoring and connecting ancient and native woodland at scale – showing what can be done when local partners and landowners come together to take action for nature."
        },
        {
            "text": "To really make a difference for nature, we need to reconnect our most wildlife-rich places – both wooded and open – to make them bigger, better, create more of them and join them up. This will help species move around the landscape, including through urban areas, and will become even more important as climate change makes some places too hot, too wet, too dry, or too unpredictable for species to survive. They need the escape routes provided by nature networks to move around the country, feed, breed and adapt their range to the new conditions."
        },
        {
            "heading": 3,
            "text": "Woodlands of all kinds contribute to nature recovery "
        },
        {
            "text": "Our wildlife doesn’t have centuries to wait for the woodlands we are creating today to develop long-established ecosystems they can thrive in. So, we need to create woodlands of all kinds now – allowing some woods to expand gradually and naturally, cycling through bramble and scrub, rich in butterflies, bats and birds, until oaks and beech punch through to race to the skies. In other places, we need to ‘fast forward’ the process, by planting much larger areas quickly to create big new woodland habitats that other species can move into at their own pace. And we also need to create woodlands for other reasons, like timber production and recreation, and which can still support a rich biodiversity, such as the Forest of Dean supporting goshawk, pine marten and thirty different species of butterfly in a huge diverse forested landscape. Or Wild Ennerdale, where a river valley is being re-naturalised at the heart of a farmed and forested landscape and seeing the return of salmon in the river and marsh fritillaries on the land."
        },
        {
            "text": "People often assume that woodlands for wildlife should contain native broadleaf species only, and it’s true that native woodlands tend to support more native species due to having evolved together. But woodlands with a high proportion of conifers, managed well to provide plenty of light and structure, can also support a wide range of native species, including many of our woodland birds, mammals, amphibians, reptiles, plants, and fungi. Douglas Fir, for example, has been studied in Europe (see the study) and shown to support 87 different species of arthropods – only a third of what it supports in its native habitat but still a significant contribution to wildlife. They provide roosting holes for bats, nest sites and perches for raven and goshawk, and seeds for siskins and crossbills. Even dormice will happily forage through mixed woodlands and use the bark of conifers for nest material. In a country that imports 80% of its timber, we still need conifers, which grow fast, sequester carbon like nobody’s business, produce essential timber and fuel and grow in woodlands that also support wildlife and semi-natural habitats on a truly landscape scale."
        },
        {
            "text": "All of these woodlands have their place and we need more of all of them; our job is to strike the right balance between our many different needs – human and wildlife – and plant the right trees in the right places, for the right reasons – and know when the right choice is actually not to plant trees at all. The Environment Act 2021 puts planning for nature on a statutory footing through the introduction of Local Nature Recovery Strategies."
        },
        {
            "heading": 3,
            "text": "Taking action for nature"
        },
        {
            "text": "In the meantime one of the most practical actions we can take is to plant trees now and create connected wooded habitat throughout our gardens, parks, road verges and farms. One of the most memorable moments of my life was revisiting, with my teenage sons, an oak woodland, created on an old landfill site by a mix of planting and natural colonisation from a nearby ancient woodland, on a nature reserve I managed 25 years ago. It was great to see the trees towering over my boys, one of whom already towered over me."
        },
        {
            "text": "Another favourite spot is to visit the spruce tree standing in the ruined grounds of an old school house on a desolate spot on Dartmoor, planted by my grandfather after Christmas 1924.  As a legacy, woodland and tree planting are hard to beat."
        },
        {
            "heading": 3,
            "text": "Take inspiration from nature"
        },
        {
            "text": "It's not always easy to choose what, where or how to plant. Usually, it is best to take your inspiration from nature. What is growing naturally on or near your land already? Where are the richest areas for wildflowers, where do the primroses grow on the hedgebanks, and where are the bluebells that tell you of a ghost woodland? Or the call of the curlews that tell you to keep the trees away from their breeding grounds."
        },
        {
            "text": "We can try hard to restore the natural ecosystems of today, but we need to remember that we aren’t planting for today. We are planting for our grandchildren’s generation and beyond. And our climate in two generations could be very different to what it is today. So when planting, it’s a golden rule not to put all your eggs in one basket and choose a diversity of tree species well suited to the soils and to predicted future climates."
        },
        {
            "heading": 3,
            "text": "Resilience to future change"
        },
        {
            "text": "As temperatures soar and wind speeds accelerate year on year, our homes, our land and our livelihoods are coming under more and more pressure. Floods threaten livestock and crops, and strip soil from the fields, while drought and wildfires become more frequent."
        },
        {
            "text": "Sustainable land use, both farming and forestry, not only provides our food and timber, but protects our soils and watercourses, sequesters and stores carbon, and also supports nature, including our pollinators – with traditional systems often supporting the most wildlife. By protecting what is called our ‘natural capital’ of healthy soils, air and water, they can be a good investment in the long term because they are more resilient to economic and environmental shocks like climate change, new pests and disease, or market changes. And this can help to protect the rest of society too."
        },
        {
            "text": "An increasingly popular approach to protecting assets is agroforestry, which combines growing trees with conventional farming. Some people describe it as farming on multiple planes, with some crops coming from the ground and others from the trees, e.g. wheat with fruit, or cattle with timber. Agroforestry systems are nearly always better for wildlife than monocultures, and usually benefit soils, water, and air as well. Of course, the principle is not new – traditional grazed orchards or wood pasture are both ancient and wildlife-rich forms of agroforestry – but innovative new ways of combining crops are appearing all the time."
        },
        {
            "heading": 3,
            "text": "Hedgerow heroes"
        },
        {
            "text": "I can’t finish without mention of the hedges that run quietly through the countryside, overlooked and over pruned. They are the ‘Clark Kent’ of the nature recovery world. The oldest hedges provide a wildlife habitat and seed source like no other running all over the countryside, with 500,000km estimated to be in the UK. In no time at all, they can be given the opportunity to sprout, grow and seed, providing a free tree nursery on our doorsteps. They can provide the networks we need for pollinators and pest control, supporting wildlife and making their contribution to net zero targets for carbon."
        },
        {
            "heading": 3,
            "text": "Engine Room for nature recovery"
        },
        {
            "text": "All woodlands can deliver for nature, with connected networks of ancient and native woodland and other wildlife-rich habitats creating an ‘engine room’ driving nature recovery throughout the landscape, the more sustainably farmed and forested the better. We can all play our part in helping to piece together the jigsaw of nature recovery. Creating woodlands in the right places for the right reasons is just one way of adding our own pieces to the board for future generations."
        }
    ]
}