{
    "url": "https://forestrycommission.blog.gov.uk/2022/03/09/celebrating-the-women-working-in-the-forestry-commission-alexandra-jenks/",
    "title": "Celebrating the women working in the Forestry Commission: Alexandra Jenks",
    "authors": [
        "Alexandra Jenks"
    ],
    "categories": [
        "International Women's Day",
        "Our Staff"
    ],
    "pub_date": "2022-03-09T12:52:29+00:00",
    "content": [
        {
            "text": "My name is Alexandra Jenks, and I am a Woodland Officer in Berkshire. I have been a Woodland Officer for eight months and prior to that I worked in utilities for both the water and power industry, as a game ranger in South Africa, a Land Management Lead Adviser at Natural England, various roles in the conservation industry, a ranger for National Trust as part of the Chartwell Estate and an underkeeper as part of an all women gamekeeping team on an estate in Sussex."
        },
        {
            "text": "I initially started my career at agricultural college about twenty years ago and I distinctly remember the principal asking me what I wanted to do and when I said I wanted to forestry, he told “You don’t want to do that, it’s not something that women go into”. He steered me towards Countryside Management which I am grateful for as it’s taken me in a number of directions. I gained my degree in Countryside Management at the University of Greenwich and got a 2:1 with full honours. I also met my boyfriend (now fiancé) there as he was on resettlement from the Army and would often ask to sneak him in the Union bar when we had a few spare hours between lectures!"
        },
        {
            "text": "With regards to discrimination in the workplace, in general it’s been small things such as PPE not fitting correctly or not available in the size I need. Luckily the Forestry Commission have been looking to address this and the days of wearing waterproof trousers that could double up as polytunnels are looking to be a thing of the past. Similarly I’ve met landowners that would only refer to you as “young lady” despite being older than their daughters!"
        },
        {
            "text": "I came across the role for the Forestry Commission last year during lockdown. I was beginning to miss being outside and making a different to the environment after being in a very corporate office environment for nearly four years prior to lockdown. To my joy I was accepted for the role, and it was like stepping back into the work I loved and initially studied so hard for. Similarly, my Great Aunt was an original lumberjill in WWII. My grandfather was the village wheelwright and due to her experience of working around heavy horses they asked her to help with timber extraction as part of the Women’s Timber Corps (part of the Women’s Land Army)."
        },
        {
            "text": "Most of my work involves liaising with landowners and agents on behalf of big commercial estates across Berkshire advising on how to manage their woodlands effectively, planting new woodlands and the incentives available to them. I love being out and about and sharing my passion for the countryside with interested parties."
        },
        {
            "text": "This includes site visits in relation to grant applications under the Countryside Stewardship Scheme, Woodland Creation and Tree Health Grants; reviewing woodland management plans; ensuring compliance with UK Forestry Standards, scheme rules and procedures; processing and inspecting felling licences, inspecting restocking notices, inspecting Enforcement notices, and responding to illegal felling reports and operations and much more."
        },
        {
            "text": "My previous experience in working the land and in an advisory role has really helped with getting a broader perspective on what people really want out of the various schemes and funding streams that the Forestry Commission offers."
        },
        {
            "text": "There is a still much a preconceived idea that forestry is all tree climbing and chainsaws. Had I known when I was leaving school there were so many different aspects to forestry, I would have pursued a career in forestry much sooner than I did. Science has always been one of my favourite subjects and I think there should be more emphasis on land based and research roles for school leavers. It’s such a broad industry to be in that it seems very short sighted to just focus on one facet of it."
        },
        {
            "text": "I’m proud to be one of the many women within the forestry industry as I feel I’m carrying on with a family tradition. I’ve found the Forestry Commission to be an extremely supportive organisation. They are very much on the front foot when it comes to #breakingthebias."
        },
        {
            "text": " "
        }
    ]
}