{
    "url": "https://civilservicelocal.blog.gov.uk/2022/03/09/financial-wellbeing-and-smarter-working-sessions-provided-by-the-charity-for-civil-servants/",
    "title": "Financial wellbeing and smarter working sessions  provided by The Charity for Civil Servants",
    "authors": [
        "Ian Barton"
    ],
    "categories": [
        "A National Spotlight",
        "East, South East & London"
    ],
    "pub_date": "2022-03-09T13:34:51+00:00",
    "content": [
        {
            "text": "The Junior Leaders Networking Event (JLNE) has teamed up with the Charity for Civil Servants ( The Charity) to bring junior leaders a wellbeing day to help colleagues adapt as we return to the workplace. The sessions aim to improve personal, emotional, digital and financial wellbeing."
        },
        {
            "heading": 3,
            "text": "Interactive sessions coming on Tuesday 22 March 2022"
        },
        {
            "heading": 4,
            "text": "Session 1 "
        },
        {
            "heading": 4,
            "text": "Financial wellbeing – Money and Stress (12pm – 12.45pm)"
        },
        {
            "text": "“At the Charity for Civil Servants we know that, for some people, poor financial wellbeing can have a detrimental effect on your physical and mental wellbeing.  Join us for a talk covering the key features of financial wellbeing, including budgeting and dealing with a redundancy or loss of income, debt advice and the steps you can take to help yourself.  We will also talk about our Money Advice and Guidance Service and how the charity can help.”"
        },
        {
            "text": " Session 2"
        },
        {
            "heading": 4,
            "text": "Smarter working for your wellbeing (1pm – 1.45pm)"
        },
        {
            "text": "“Smarter working will help junior leaders focus on making the right decisions for where, when and how we work. It helps us to optimise technology and the best use of our workplaces and spaces. By working smartly, we can appreciate a better work-life balance to support our own health and wellbeing.  During the session the Charity will share tools, tips and advice to help us work smarter - helping both our personal development and wellbeing."
        },
        {
            "heading": 4,
            "text": "Session 3 (5pm – 5.45pm)"
        },
        {
            "heading": 4,
            "text": "Overview of the Charity for Civil Servants – Financial capability, Mental Health and Wellbeing services"
        },
        {
            "text": "The Charity supports all civil servants, past and present, throughout their lives, when times are tough, listening without judgement and offering practical, financial and emotional support."
        },
        {
            "text": "Some of you may have heard of the Charity before, but if you think you already know what they offer, you might just be surprised by the breadth and number of the services they provide. The Charity’s wide variety of services can have a positive impact on just about anyone’s situation."
        },
        {
            "text": "The Charity are providing a half hour online presentation (followed by Q and A), which will explore their wide-ranging support services. Stress can affect every part of your life, including our finances, relationships, mental health and any caring responsibilities you may have. Their presentation covers all of these unexpected issues and how they can help you to combat them."
        },
        {
            "text": " "
        },
        {
            "heading": 3,
            "text": "About the Junior Leaders Networking Event and its achievements so far"
        },
        {
            "text": "The Junior Leaders Networking Event (JLNE) is a cross government network operating across the East, South East and London (ESEL) that connects colleagues in grades AO to EO in an environment where they learn and hear from senior leaders, network with their peers and receive tools to enhance their personal and professional development."
        },
        {
            "text": "During the last three years, JLNE has reached and supported over 1,500 junior colleagues across 14 departments and agencies. In 2019, four successful face to face events were held across four locations within ESEL. JLNE went virtual due to the pandemic. So far, we have delivered  5 virtual events and offered 12 learning and development sessions covering Career Development, Wellbeing, Bullying, Harassment and Discrimination, Leadership, Personal Branding, Imposter Syndrome, Mentoring and Building confidence."
        }
    ]
}