{
    "url": "https://apprenticeships.blog.gov.uk/2022/03/09/implementing-reforms-to-technical-education-at-level-3-and-below/",
    "title": "Implementing reforms to technical education at level 3 and below",
    "authors": [
        "Beth Chaudhary"
    ],
    "categories": [
        "Technical education"
    ],
    "pub_date": "2022-03-09T10:06:02+00:00",
    "content": [
        {
            "text": "Last year the Department for Education (DfE) confirmed its plans for changes to level 3 qualifications in its review of post-16 qualifications at level 3 in England. The aim of this review is to ensure both young people and adults have clearer qualification choices and confidence that the government-funded qualifications they choose are high quality and will support them in developing their careers."
        },
        {
            "text": "More recently, proposals for the level 2 landscape have been set out by DfE in its consultation review of post-16 qualifications at level 2 and below in England. Again, the aim is to provide more clarity and to ensure high-quality provision that helps learners realise their talents and achieve career aspirations. We welcome this ambition."
        },
        {
            "text": "The Institute – as the voice of employers in technical education – has been asked to lead the approval of technical qualifications in the new qualifications landscape. Technical qualifications are primarily designed to lead to skilled employment. Institute approval will ensure employer needs are being met by these qualifications as well as assuring learners that technical qualifications will enable them to be ready to move into skilled jobs."
        },
        {
            "text": "Our ambition is that, in the future, the vast majority of publicly-funded technical qualifications will be based on our employer-led occupational standards. These are the same standards used by apprenticeships, and they set out what it means to be competent in an occupation, in the form of the knowledge, skills, and behaviours required to succeed in the workplace. This represents a substantial expansion of the employer-led system across technical education, and a vital one that brings many benefits, including improving the link between the classroom and the workplace and ensuring that technical qualifications remain relevant and up to date."
        },
        {
            "heading": 2,
            "text": "Approving technical qualifications"
        },
        {
            "text": "Employers will play a key role in the approval of technical qualifications. Not only will technical qualifications in the future be aligned to employer-led occupational standards, but we also intend to consult employers during our approvals process. We will expect awarding organisations, who design the qualifications, to demonstrate how they have considered employer needs and engaged with employers as they have developed their qualifications."
        },
        {
            "text": "Our approvals process for technical qualifications is due to launch later in the year. As well as the expectations around meeting employer needs, we plan to seek evidence from awarding organisations as to how their qualification design meets the purpose of the qualifications in the technical education landscape. That is, how can we, or a learner, provider, or employer, be confident that a qualification that says it will get you into a particular occupation, will actually get you into that occupation? This will mean the qualification needs to be a reliable measure of a learner’s knowledge and skills, tested through valid methods of assessment."
        },
        {
            "text": "We intend to put in place criteria to promote appropriate qualification design and delivery. However, recognising the diversity of routes we will be approving qualifications for, we currently do not plan to set specific requirements governing assessment design. Our approvals criteria and process are currently in development. We plan to consult on these in the summer, but will be engaging before then with awarding organisations and others in the system as we refine our approach, to ensure it meets needs and delivers high quality qualifications."
        },
        {
            "heading": 2,
            "text": "Working with Ofqual and DfE"
        },
        {
            "text": "In order to carry out approvals, we will be engaging with Ofqual, the qualifications’ regulator, who has been asked to provide us with feedback about the quality of qualifications submitted for approval."
        },
        {
            "text": "You may have already seen that Ofqual is consulting at the moment on its overall regulatory approach to level 3 qualifications in the new landscape. They will regulate both technical qualifications, and academic qualifications (those designed primarily to enable a learner to progress to further study) and will provide feedback on quality to both the Institute, for technical qualifications, and DfE for academic qualifications."
        },
        {
            "text": "We are also working closely with DfE, as in future, they will only consider for funding those level 3 technical qualifications that have been approved by the Institute. At level 2, qualifications will also have to be approved in order to be considered for funding; arrangements for this will be confirmed after DfE’s consultation has closed. It will be important that approvals we undertake provide DfE with suitable assurance that public money is being spent on high-quality qualifications that learners and employers can trust."
        },
        {
            "heading": 2,
            "text": "Coherence in the system"
        },
        {
            "text": "We recognise that approval of technical qualifications, on the whole, is a new step in the system, and the three organisations involved (the Institute, Ofqual and DfE) plan to take a coherent approach that streamlines its administration."
        },
        {
            "text": "We currently work with Ofqual on other qualifications, including Higher Technical Qualifications and Technical Qualifications that are a part of T Levels. In developing approaches for approval for these, we have aimed to ensure we are making the most of our relevant expertise as well as our respective statutory powers. We intend to take the same approach here at level 3, and want to avoid imposing unnecessary requirements on awarding organisations."
        },
        {
            "text": "The Skills and Post 16 Education Bill sets out clear roles for the organisations in the oversight of technical qualifications and affords the Institute new statutory powers which will allow us to strengthen the technical qualifications system further. Subject to the Bill gaining Royal Assent, we will use the consultation planned for later in the year to provide clarity on how our new powers will be applied and to set out how a coherent approvals process involving the Institute, DfE and Ofqual will operate."
        },
        {
            "text": "We look forward to providing more detail on our upcoming consultation in coming months. In the meantime, if you have any questions, please contact Ifate.POST16@education.gov.uk. For any queries relating to Ofqual’s consultation then please do visit their consultation webpage."
        }
    ]
}