{
    "url": "https://ruralpayments.blog.gov.uk/2022/03/09/introducing-you-to/",
    "title": "Introducing you to…",
    "authors": [
        "Rural Payments Agency"
    ],
    "categories": [
        "Basic Payment Scheme",
        "Introducing You To"
    ],
    "pub_date": "2022-03-09T10:54:25+00:00",
    "content": [
        {
            "text": "Welcome to the first in a series of blogs introducing you to people who work in different areas of the Rural Payments Agency (RPA)"
        },
        {
            "text": "The idea is to give you a better understanding of what goes on behind the scenes, introduce you to the people involved, highlight the work we do and how we are working to support our customers. "
        },
        {
            "text": "We’ll be bringing you a whole series of these interviews with many colleagues from across the RPA during 2022."
        },
        {
            "text": "Today we would like to introduce you to Afshan who works in the Geospatial Mapping team. "
        },
        {
            "text": "Hi, I’m Afshan and I’m one of the team leaders working for the RPA, in the Operational Mapping Team at the Reading office"
        },
        {
            "text": "I manage a small team and in our Operational capacity we’re responsible for ensuring RPA’s digital mapping system is up-to-date and accurate to enable RPA to make area-based payments across various schemes."
        },
        {
            "text": "My team deals with various change requests coming either directly from our customers through submission of RLE1 forms or from other areas of the business."
        },
        {
            "text": "The Land Management System (otherwise known as LMS), is the application we use mostly in the Operational Mapping team. We look at customers’ requests relating to any changes that may be required to their land etc. The requests are processed by my team and some of them will result in mapping change request jobs which are created in LMS. These requests are sent through to our digitisers, as this is not something that is physically done within the Operational Mapping Team."
        },
        {
            "text": "Ideally, my team would be able to ensure any mapping changes are processed, actioned, and resolved straight away, but this is not often the case. Sometimes the details of the submitted change requests are not always clear and we need to contact the customer for further clarification. A typical example could be that the customer sends in a plan with measurements that don’t support the geometry annotated on their sketch map. In these cases, the digitisers are not able to complete the mapping because there are inconsistences with the customer’s suggested mapping change. My team therefore resolves this issue by contacting the customer to determine what action we should take. Once we have received a response from the customer, we would pass this information on to the digitisers so they can make sure the mapping changes are implemented correctly. Once mapping requests have been completed, the changes are then published and can be shared with our other systems and made available to customers in Rural Payments."
        },
        {
            "text": "It’s a varied job, but the aspect of my role that has the greatest impact on our internal/external customers is making sure that any mapping change requests submitted are captured accurately and digitised correctly on the LMS."
        },
        {
            "text": "I’ve been with RPA for 38 years and I’ve been in my current role for over five years. Before that I worked in Finance, on the Single Payment Scheme and the Basic Payment Scheme. I’ve also worked on the Over 30 Months Scheme and Milk Quotas. Before I joined RPA I worked for the Inland Revenue as a tax officer."
        },
        {
            "text": " I’ve enjoyed every aspect of my work over the years, whilst working for the RPA. Many of the areas I’ve been involved have always had a very strong customer focus. One of my favourite roles was managing the Drop-in Centre (DiC), at the Reading Office for approximate six to eight weeks of the year. I did this duty diligently for about six/seven years. I managed a small group of approximate ten to 12 volunteers from different areas of the RPA who manned the centre. It was always hands-on, and great meeting customers and agents face to face."
        },
        {
            "text": "I valued every single moment working in the Drop-in Centre (DiC): hearing customers’ stories, meeting them personally, helping and checking to ensure that their claim forms had been completed accurately. It was wonderful to have direct contact with the customers. I met a lot of friendly people during the years of running the DiC and formed good relationships with the customers and agents and some of them have continued to contact me over the years to help them with their enquiries."
        },
        {
            "text": "I do enjoy the variety of my role as my days are never the same. As a manager, one of the satisfying parts of my job is supporting team members, colleagues and working together as one team. We give customers clear guidelines and help them as much as we can and are always looking to improve customer satisfaction."
        },
        {
            "text": "Outside of work I have three daughters and a grandson aged three. My eldest is an English teacher, middle daughter is currently heading the Equality, Diversion, and Inclusion in her new school and my youngest is in her final year at university. I like reading, meeting with friends, cooking, walking, and spending time with my grandson. I have my parents who live nearby and feel truly blessed with family and friends."
        },
        {
            "text": " "
        }
    ]
}