{
    "url": "https://lifeathmrc.blog.gov.uk/2022/03/09/national-careers-week-university-isnt-your-only-option/",
    "title": "National Careers Week – University isn’t your only option",
    "authors": [
        "Faye Gardner"
    ],
    "categories": [
        "General",
        "Guest blog"
    ],
    "pub_date": "2022-03-09T12:36:56+00:00",
    "content": [
        {
            "text": "To continue our National Careers Week celebrations, we’re still sharing great stories from our people. Faye decided not to go to university after her A-Levels and joined us on a Fast-Track apprenticeship, here’s how it went…"
        },
        {
            "text": "Making a tough decision "
        },
        {
            "text": "I studied at college for 2 years and did my A-Levels in business, law and economics. The majority of my class were applying for different universities and attending open days, but I just remember sitting in a classroom and thinking that I’m not sure if I want to do this for at least 3 more years. I wanted to put all the information I had learned during my A-Levels into practice. I didn’t have much work experience so thought an apprenticeship would be a great way to get my foot in the door."
        },
        {
            "text": "I was also struggling with what subject to study at university. I really enjoyed business and law in college but neither subject was one that I could say ‘I definitely want to do that for my career’ and I wasn’t interested in studying something I wasn’t sure I would use in the future. That’s another reason why I chose an apprenticeship because once you’re in work, there’s so many different departments and roles for you to experience."
        },
        {
            "text": "I was often told that I still needed to apply for university because apprenticeships were difficult to get but I knew I just wanted to start working and building a career. I applied for several different apprenticeships ranging from business apprenticeships, legal apprenticeships and even a few marketing apprenticeships. I had one apprenticeship at the top of my list though, a Civil Service apprenticeship. I remember spending hours preparing for my interview with one of my college tutors as I really wanted to join the Civil Service."
        },
        {
            "text": "A month before my final exams, I was told I was successful in my application for the Civil Service Fast Track apprenticeship, which was amazing motivation for finishing my exams."
        },
        {
            "text": "Out of the various Civil Service apprenticeships available, I chose the Level 4 Business and Professional Administration apprenticeship because it provided me with a great starting salary, employee benefits, a permanent contract and the opportunity to get more qualifications."
        },
        {
            "text": "Joining the digital team "
        },
        {
            "text": "I wasn’t really sure what to expect when I thought about working for HMRC but it definitely exceeded my expectations. I immediately felt at ease working in the digital centre with such a positive team of people around me. It was tough getting to grips with the work that my team does, but they’ve been really supportive throughout."
        },
        {
            "text": "While completing my apprenticeship, I would typically spend 20% of the working week studying and the rest working. Every 6 weeks I would also have a full-day course for module-based learning, with an essay assignment after. It took me around 18 months to finish my apprenticeship, but it didn’t seem that long really. It was still a relief to finish it though as I wouldn’t need to do anymore 12,000-word essays!"
        },
        {
            "text": "I’ve worked in different areas of the digital team, from arranging service teams assessments to testing new COVID-19 digital services to ensure they are accessible for the public. One of my favourite projects was working on the Accessibility Empathy Hubs. The purpose of the Empathy Hub is to help people understand the barriers that can exist for someone with a disability when using a computer, our digital services and in everyday life. There’s various simulation equipment we have in place so we can better serve customers with a disability or impairment."
        },
        {
            "text": "I led the setup of the Empathy Hub in the Newcastle Delivery Centre for Global Accessibility Awareness Day in 2018. Since then, I have run various sessions with local councils and different communities within HMRC. Seeing the real-life impact of the work my team does has been inspiring, especially as I would have never thought about the accessibility of digital services before joining this team. Looking back now, my decision to do an apprenticeship was the best thing 17-year-old me did. Our team has set up another Hub in London and we’re looking to launch more Hubs around the country, so I can’t wait to get stuck in and develop my skills even further!"
        }
    ]
}