{
    "url": "https://space.blog.gov.uk/2022/03/09/the-night-sky-in-march-2/",
    "title": "The night sky in March",
    "authors": [
        "Derek Smale"
    ],
    "categories": [
        "Astronomy"
    ],
    "pub_date": "2022-03-09T17:10:38+00:00",
    "content": [
        {
            "text": "Although March sees the start of meteorological spring, it’s still a wonderful time to see the winter constellations, as they’re at their highest in the southern skies as darkness falls."
        },
        {
            "text": "Unmistakable Orion (between the trees in the image above) follows the distinctive pattern of Taurus across the sky, while high above them, bright stars Capella (constellation Auriga) and ‘the twins’ Castor and Pollux (constellation Gemini) remain high in the sky until late in the evening."
        },
        {
            "text": "The light we see from the star Castor is actually generated by a solar system made up of six stars around 50 light years away."
        },
        {
            "text": "Compared with our sun, the largest and brightest star in the Castor system is more than twice as large and 30 times as luminous, while the smallest star is about half the size of our sun, and only around 10 percent as bright."
        },
        {
            "text": "Pollux is almost nine times bigger than our sun, and lies around 34 light years away."
        },
        {
            "text": "It is swelling into a red giant (you may be able to see the slight colour difference with white-blue Castor), which will one day engulf the planet that’s been discovered to orbit around it. Named ‘Thestias’, the planet is around twice the size of our largest planet Jupiter, and it orbits Pollux at around the distance that Mars orbits our sun."
        },
        {
            "text": " "
        },
        {
            "heading": 3,
            "text": "The Spring Equinox"
        },
        {
            "text": "Our planet has a tilt of 23.5degrees relative to its orbit around the sun. This means that for half of the year, our northern hemisphere is tipped away from the sun when compared to the southern hemisphere, and for the other half it leans in towards the sun."
        },
        {
            "text": "On 20 March we pass through one of the midway points, the Spring or ‘Vernal’ Equinox.  This marks the point where both hemispheres are equally distant from the sun, and where the day and night are equal in length."
        },
        {
            "heading": 3,
            "text": "The Moon and Planets"
        },
        {
            "text": "Over the coming months we will be treated to some spectacular conjunctions of the planets in our pre-dawn skies."
        },
        {
            "text": "In June, Mercury, Venus, Mars, Jupiter and Saturn will line up in the early hours of the morning, in the order of their distance from the Sun."
        },
        {
            "text": "As the movement of the planets brings them into that position over the coming weeks, we’ll get the rare opportunity to see them seemingly pass very close to each other – even if in reality they are hundreds of millions of miles apart!"
        },
        {
            "text": "By the end of March, early risers will get a glimpse of Saturn, Mars and Venus clustered together low in the south-east in the hour before sunrise."
        },
        {
            "text": "They’re joined by the 20% illuminated moon on the morning of 28 March, a helpful marker if you’re not sure where to look."
        },
        {
            "text": "The conjunction of planets will be visible without any equipment, but anyone with binoculars or a small telescope should definitely set their alarm clocks early on the last few days of the month!"
        },
        {
            "text": "Meanwhile the full moon will appear in the constellation of Virgo on 17 March, while the new moon falls on 31 March."
        },
        {
            "text": "The European Space Agency’s ‘Solar Orbiter’ spacecraft witnessed a huge solar eruption in February.  The prominence was around three million kilometres (2 million miles) long – around 250 planet Earth’s laid side by side!  Thankfully, the eruption was not directed at earth."
        },
        {
            "text": " "
        },
        {
            "text": "Did you know:  The UK is playing a leading role in the development of the European Space Agency’s ‘Vigil’ space weather mission that will help forecast events like these.  This is vital for protecting our infrastructure and way of life should one of these events be directed toward our planet.  You can find out more about this mission here."
        },
        {
            "text": " "
        },
        {
            "heading": 3,
            "text": "The James Webb Space Telescope"
        },
        {
            "text": "The James Webb Space Telescope has been successfully positioned in space and has taken its first images. The aim of these is to align the 18 primary mirrors to produce clear, focused images.  You can find more information on that here."
        },
        {
            "heading": 3,
            "text": "The International Space Station"
        },
        {
            "text": "There are some bright passes of the Space Station over the UK in the early hours of the morning in the first half of the month, but the evenings in the second half of the month provides the best opportunity to see it.  Visit https://www.heavens-above.com/ to get information on all of the passes for your location."
        },
        {
            "text": "Join us next month to find out about the spring stars and constellations, more exciting planetary conjunctions, the Lyrid meteor shower and how you can see the spectacular Milky Way ‘core’."
        },
        {
            "text": "Until then, wishing you clear skies!"
        }
    ]
}