{
    "url": "https://companieshouse.blog.gov.uk/2022/03/09/the-importance-of-collaboration-and-open-culture-in-our-digital-teams/",
    "title": "The importance of collaboration and open culture in our digital teams",
    "authors": [
        "Ross Maude - Director of Digital, Data and Technology (DDaT)"
    ],
    "categories": [
        "Companies House transformation",
        "Digital transformation"
    ],
    "pub_date": "2022-03-09T15:28:25+00:00",
    "content": [
        {
            "text": "Companies House plays an important role in driving confidence in the UK economy. We incorporate and dissolve limited companies, register company information and make it available to the public. More than 4 million limited companies are now registered, with over 500,000 new companies incorporating each year."
        },
        {
            "text": "The company register allows people to understand what's inside the legal entity they're working with, and what it's made up of. Information such as director appointments or removals and the filing of accounts data can all be pulled together and used to help understand the activity of any organisation. This information supports the making of millions of business decisions and is also used by both UK and overseas law enforcement agencies who are trying to get a more data rich picture of particular activities."
        },
        {
            "text": "Our Digital, Data and Technology (DDaT) department plays a pivotal role in making sure that we’re able to provide an innovative, open and trusted company register. Our open data register was searched over 10 billion times in the last 12 months. And that’s only searches directly on our API, not those met by cached data from large search engines."
        },
        {
            "text": "With our information being searched so much, the accuracy of this data is extremely important - part of this is how the data needs to be treated, managed and how its looked after."
        },
        {
            "text": "We recently received figures that showed approximately £1.7 trillion is invested in UK business every year and that credit reference agencies use our data as one of the foundational elements to make those decisions. If our data is being used to inform that level of investment, then it's important that we have it right, available and in the right format so people can access it as easily as possible to then make those decisions."
        },
        {
            "text": "With all these users in mind, and the importance of our current and future data, we’re now undergoing a multi-year organisational transformation. All services, inside and out, are being renewed with digital journeys, using automation to improve the accuracy and efficiency of our data, while continuing to deliver an excellent customer experience. We’re moving all of our services off our legacy digital platforms on to our cloud platform, using the micro-service pattern we’ve adopted to rebuild them."
        },
        {
            "text": "Our services and data must be accessible and usable by all, so that creating and maintaining a company and searching about companies remains as simple as possible, maximising the value of the register to the UK economy."
        },
        {
            "text": "The recently announced legislative changes that will be brought in will also play a huge part in our transformation. They will give us the powers we’ve been looking for to tackle economic crime, transform our role, and achieve our strategy."
        },
        {
            "text": "The rates at which Companies House needs to adapt to changing customer, service user and stakeholder expectations, legislation and new technical capabilities is rising. This requires a high-performance culture of creative collaboration, supported by empowering leadership at all levels alongside technical innovations."
        },
        {
            "text": "Our transformation is as much cultural as it is about technology, and it is this area where I think Companies House has a real advantage. We use agile ways of working and we empower our teams to make the decisions about how best to collaborate and creatively solve problems together, based on user research, technical knowledge and performance."
        },
        {
            "text": "Our digital teams are offered a flexible half-day each week as ‘innovation time’ which can be used to:"
        },
        {
            "text": "Many members regularly collaborate on projects, which has led to us launching exciting new services such as voice search capabilities for Companies House, and new streaming service developments."
        },
        {
            "text": "A diverse workforce and inclusive culture are essential for effectively tackling complex challenges. Our ambition is to build an inclusive, positive culture where everyone can bring their whole selves to work and ‘find their passion’ in their career of choice. This culture enables our brilliant people to flourish and drives high performance. It's also critical for us as an organisation that we work to reflect the diversity of our customers through our own diversity."
        },
        {
            "text": "Here at Companies House, collaboration and open culture is at the heart of what we do. Our people, services and data are key to the successful delivery of our transformation and we are ambitious to build the best possible user experience and maintain our position as the most innovative, open and trusted register."
        }
    ]
}