{
    "url": "https://governmentscienceandengineering.blog.gov.uk/2024/11/13/national-engineering-day-2024/",
    "title": "National Engineering Day 2024",
    "authors": [
        "gseprofession"
    ],
    "categories": [
        "Blog Series",
        "Engineering",
        "Guest Blog"
    ],
    "pub_date": "2024-11-13T13:40:08+00:00",
    "content": [
        {
            "text": "Today is National Engineering Day and this year the focus is on making the UK’s engineers and engineering more visible, and to celebrate how they improve everyday lives and shape the world around us."
        },
        {
            "text": "One such engineer is James Ryan, a Senior Development Management Engineer for North Yorkshire Council and a GSE member. James is a civil engineer and a graduate member of the Institute of Civil Engineers. We caught up with James to discover more about his role in local government."
        },
        {
            "text": "GSE team: Good morning, James. Can you start by telling us about your current job and what you do?"
        },
        {
            "text": "James: Good morning. I am a Senior Development Management Engineer for North Yorkshire Council. My role involves responding to planning applications on behalf of the council as the local highway authority. I also manage changes funded by developers to the highway network, use parts of the Highways Act on behalf of the council, and ensure compliance. I also provide guidance to colleagues in other teams dealing with planning applications as the local highway authority."
        },
        {
            "text": "GSE team: That sounds like an interesting role. Can you tell us about your background? Are you a civil engineer?"
        },
        {
            "text": "James: Yes, I am a civil engineer. I've been in this role for just over five years. Before this, I wasn't from a civil engineering background, I had been in the Army, and then worked in the outdoor industry, so this was a completely new direction for me. To make this change, I had to undertake further education, so I went to Leeds Beckett University as a mature student and gained my civil engineering qualifications there. It was a fantastic experience. I'm also studying at the Open University and will be finishing my studies next year."
        },
        {
            "text": "GSE team: How does being an engineer help you with your role in local government?"
        },
        {
            "text": "James: Being an engineer is integral to my role as about 80% of my work involves technical checking, such as road construction details and drainage. Civil engineering forms the foundation of what I do, whether it's dealing with contractors on-site, or ensuring that all technical details are correct before adopting any works. Good communication skills are also essential, especially when explaining technical information to the public, who may not have a technical background."
        },
        {
            "text": "GSE team: What is your favourite aspect of engineering?"
        },
        {
            "text": "James: I particularly enjoy geotechnical engineering and the construction of highways. It might sound boring to some, but I find it fascinating how carriageways are designed for different traffic tolerances and how the underlying soil affects the construction. Conducting tests to understand ground movement before laying down materials is something I find really interesting."
        },
        {
            "text": "GSE team: Finally, how do you find being part of the GSE profession from a local government perspective?"
        },
        {
            "text": "James: Being part of GSE has been quite enlightening and it has allowed me to see what's happening at a national level across different aspects of science and engineering. Additionally, GSE has provided opportunities for me to gain chartership with the Institute of Civil Engineers through its professional recognition offer and this is something I am working towards now. It has been great networking with other engineers from diverse departments and has made me feel more connected to what is happening across the government from my local government vantage point."
        },
        {
            "text": "GSE team: Thank you for speaking to us James, it’s great to hear from our local government GSE members."
        },
        {
            "text": "To find out more about National Engineering Day, please visit the website of the Royal Academy of Engineering. "
        }
    ]
}