{
    "url": "https://environmentagency.blog.gov.uk/2024/11/13/our-enforcement-options-to-stop-waste-criminals/",
    "title": "Our enforcement options to stop waste criminals",
    "authors": [
        "Environment Agency"
    ],
    "categories": [
        "Waste"
    ],
    "pub_date": "2024-11-13T09:07:11+00:00",
    "content": [
        {
            "text": "To carry out our regulatory responsibilities to protect the environment, we have a range of powers at our disposal. The severity of waste crimes varies greatly and our response to each incident is proportionate to the permit breach or offence committed, the scale of the offence and impact upon the environment and communities.  "
        },
        {
            "text": "We start with advice and guidance, which sometimes is all a waste operator will need to come back into compliance with the regulations, when they have made a genuine mistake. We expect the operator to listen to our advice and take appropriate action to remedy their error, to return to compliance and stay compliant."
        },
        {
            "text": "When we believe an offence has been committed, we can issue a written warning. This would be taken into account if there is any further offending, significantly increasing any fine imposed by court following conviction."
        },
        {
            "text": "We enforce many different sets of environmental regulations. Some of these provide us with powers to issue enforcement notices, which must be complied with or when an offence is committed. We can use these kinds of notices to require the recipient to stop offending or to restore or remediate the environment."
        },
        {
            "text": "We also have a range of civil sanctions to address waste crimes. These avoid lengthy court processes. The key sanctions for waste offences include:"
        },
        {
            "text": "Sometimes these powers and actions are invisible to the public, who often perceive that nothing is being done to stop waste crime unless they hear or read about a prosecution or conviction."
        },
        {
            "text": "We pursue prosecution in the case of repeat offenders and criminals committing the most serious and large-scale types of waste crime."
        },
        {
            "text": "Preparing prosecution cases to present to court takes considerable time and resources. We may only proceed with a prosecution if we have sufficient evidence to be satisfied that there is a realistic prospect of securing a conviction and that it is in the public interest to start criminal proceedings. With that decision made, we can sometimes face long delays to get a court date or to proceed with a case in court. This can make it seem to onlookers that we haven’t acted quickly enough, but court dates are outside of our control. So too are the sentences imposed by the court. The court determines the punishments for the cases we bring before them, and we try to assist the court to come to the right sentence. Whilst we do sometimes feel the sentences are not severe enough this is not a matter for us."
        },
        {
            "text": "We can and do pursue the worst criminals. Under the Proceeds of Crime Act 2002, we seek to confiscate the profits offenders have made by committing waste crimes, to send a clear message that waste crime does not pay."
        },
        {
            "text": "You can read more about our enforcement and sanctions policy here: Environment Agency enforcement and sanctions policy - GOV.UK (www.gov.uk)"
        },
        {
            "text": "Waste crime charges consultation"
        },
        {
            "text": "Illegal waste activities cause significant harm to the environment and communities, costing the taxpayer and legitimate businesses nearly £1 billion each year. Recent data suggests that up to 18% of waste (about 34 million tonnes annually) may be handled illegally."
        },
        {
            "text": "Waste crime is becoming increasingly sophisticated, with organised criminal groups exploiting the sector due to the significant profits that can be made, and the limited resources available to enforcement agencies. To address this growing issue and protect legitimate businesses, greater investment in enforcement and improvements to our services are essential."
        },
        {
            "text": "Our current fees do not support the necessary investment and have not kept pace with inflation. Additionally, they do not fully cover our existing regulatory costs, and some areas, such as waste exemptions, receive no funding at all. This has put considerable strain on our regulatory activities and must be addressed."
        },
        {
            "text": "By increasing our charges, we can deliver a more effective service which helps protect the environment, supports law abiding businesses, and benefits communities affected by waste crime."
        },
        {
            "text": "The consultation is available here: https://www.gov.uk/government/consultations/environment-agency-charge-proposals-for-waste-crime-and-hourly-rates"
        },
        {
            "text": "Joanna Larmour, Deputy Director National Environmental Crime Unit"
        }
    ]
}