{
    "url": "https://marinescience.blog.gov.uk/2024/11/13/understanding-climate-change-risk-to-namibias-diverse-fisheries-sectors/",
    "title": "Understanding climate change risk to Namibia’s diverse fisheries sectors",
    "authors": [
        "Georg Engelhard"
    ],
    "categories": [
        "Climate Change",
        "Fisheries",
        "Policy"
    ],
    "pub_date": "2024-11-13T11:12:56+00:00",
    "content": [
        {
            "text": "In this Q&A, Georg Engelhard Principal Marine Climate Change and Fisheries Scientist at Cefas, discusses a new One Ocean Hub paper titled “Climate risk assessment of the fisheries in Namibia” and its associated policy paper. It is the outcome of a close collaboration between himself and Kieran Hyder, and a twenty-one strong team of Hub researchers in Namibia, South Africa and the UK, looking at the vulnerability of Namibia’s fishing sector to climate change."
        },
        {
            "text": "Why was it important to look at climate risks facing Namibia’s fisheries sectors?"
        },
        {
            "text": "Namibia is no exception when it comes to countries experiencing the effects of climate change, particularly on marine resources crucial to fisheries. Fisheries in Namibia are very important for food security (especially protein), trade and commerce; they support many livelihoods in the extremely dry, coastal regions of the country, often providing jobs where limited alternatives may be available. Commercial fishing is mainly dependent on hake, horse mackerel, monkfish, rock lobster and crab. Fisheries in Namibia are mostly large-scale due to the harsh and arid coastal environment, but locally, small-scale artisanal fisheries do exist and all sectors are affected by climate change. Climate change is also affecting weather, currents and storminess, and therefore the safety and effectiveness of fishing. The new paper asks some really important questions: What are the key risks from climate change to Namibia’s various fisheries sectors – including recreational and small-scale (artisanal) fisheries – and how could fisheries ‘adapt’ to climate change?"
        },
        {
            "text": "What approach did you take?"
        },
        {
            "text": "Climate change cuts through all sciences, so studying climate change requires multiple disciplines to meet the challenge. This is where the diverse ‘One Ocean Hub family’ made a real difference. One Ocean Hub works with local communities, researchers, decision makers, civil society, and international organisations across a range of disciplines related to law, science and policy to promote a more inclusive, equitable and sustainable approach to the use of ocean resources."
        },
        {
            "text": "In March 2023, One Ocean Hub organised an ‘expert elicitation workshop’ in Henties Bay, Namibia, where marine biologists, fisheries and social scientists, economists and legal scientists all got together and shared their expertise on climate change in Namibia – reflecting the multidisciplinary Hub spirit. It allowed a holistic assessment of the physical hazards of climate change, the sensitivities of the various fish species, and socio-economic vulnerability in each fishery sector."
        },
        {
            "text": "What were some of the climate risks identified?"
        },
        {
            "text": "Namibia’s fisheries sectors differ widely in how vulnerable they are to climate change – some more at risk than others. Our assessment found that the rock lobster fishery of Lüderitz (in the remote south of the country) has the greatest ‘climate risk’. This is perhaps unsurprising as Namibian rock lobster is very temperature-sensitive, and vulnerable to low oxygen levels in the water. The second most at-risk is the small-scale (artisanal) sector. This was an important finding, as most small-scale fishers are from marginalised communities, sometimes impoverished and with limited access to marine resources – in some cases even displaced from direct access to the coastline (as is the case with the Topnaar community, also investigated under One Ocean Hub). Thus the study fully endorsed the importance of Namibia’s new National Plan of Action for Small-Scale Fisheries."
        },
        {
            "text": " In other sectors, climate risk is more moderate; an example is the biggest and most valuable fishery of Namibia: the hake trawlers. However, the two hake species that form its target stock are still expected to shift their distributions in response to climate change, with possible knock-on effects on quota as hake is a transboundary stock shared between nations."
        },
        {
            "text": "Shifts in coastal fish species could also affect Namibia’s recreational sector – not just for anglers (who reported finding it harder to catch certain species), but those reliant on the industry for their jobs (for example, guides, guest house owners and employees). This was especially true at more remote locations where few alternative opportunities are available (making it more difficult to adapt). By and large, all ten fishery sectors of Namibia are affected by climate change, and the new paper gives a thorough overview of the impacts, risks, and adaptation options."
        },
        {
            "text": "How did you engage the local community and stakeholders with the report?"
        },
        {
            "text": "In September 2024, five workshops were organised where the team presented the key climate risks to diverse stakeholders all linked to fisheries or the marine environment in Namibia. The aim of the first four workshops – in the coastal towns of Henties Bay, Walvis Bay, Swakopmund and Lüderitz – was to understand the robustness of the assessment and potential for adaptation measures. This aim was reached through rich discussions with the stakeholders. In the fifth workshop, in the capital of Windhoek, we presented the findings including the stakeholder feedback to an audience that included policy makers and Namibia’s ombudsman, who is tasked to “support the rights of Namibia’s underrepresented, and the environment.” In addition, a representative of the Office of the Attorney General participated in the workshop, to explore the relevance of our findings for the role of the Attorney General in upholding Namibian constitution and reporting directly to the President of Namibia. "
        },
        {
            "text": "How will this report help Namibia’s fisheries sector better adapt to climate change?"
        },
        {
            "text": "Fisheries in Namibia are exposed to a range of climate risks that are different according to the sector.  I think this report and its policy recommendations are important in raising awareness of the key climate risks, and ensuring that new strategies, such as the National Plan of Action for Small-Scale Fisheries (NPOA-SSF) and the Marine Spatial Plan (CMSP), continue to adapt, reduce risks, and build climate resilience in Namibia’s fisheries. For the rock lobster fishery, adaptation options included temporarily switching to other species such as snoek and hake, and importing lobsters for local processing when stocks are low. For small-scale fisheries, adaptation approaches included promoting inclusion and securing the livelihoods of small-scale fishing communities to counter marginalisation, by recognising small-scale fisheries as a sector and allocating exclusive fishing areas to reduce competition with the recreational sector. In terms of recreational activities, providing more desert tours and non-consumptive marine tourism activities might be a better alternative to angling. However, going forward, much more evidence and policy support will be needed to ensure that climate adaptation is integrated into day-to-day decision making on the marine environment. It’s also important that the knowledge of fishers and anglers in Namibia continues be incorporated. This would provide an inclusive, bottom-up approach with better buy-in towards sustainable management."
        },
        {
            "text": "How would you describe your experience of working in Namibia and collaborating with diverse partners?"
        },
        {
            "text": "There is a saying which I learned in Namibia which I was told is also used widely in other African countries: “If you want to travel fast – then it’s best to travel alone. But if you want to travel far – then it’s best to hold each other’s hands, and travel together.” The latter sums up my experience of working with colleagues and stakeholders. I hope that the paper, and the policy brief make a real difference for climate change resilience in Namibia!"
        },
        {
            "text": "One Ocean Hub is led by the University of Strathclyde (Glasgow, UK), and it has 18 partner organisations and 21 research partners across the world. The Hub is funded by UK Research and Innovation (UKRI) through the Global Challenges Research Fund (GCRF) – a key component in delivering the UK AID strategy that puts UK-led research at the heart of efforts to tackle the United Nations Sustainable Development Goals."
        }
    ]
}