{
    "url": "https://defradigital.blog.gov.uk/2022/06/03/on-my-bike-using-pedal-power-for-my-volunteering/",
    "title": "On my bike – using pedal power for my volunteering",
    "authors": [
        "Simone Burke"
    ],
    "categories": [
        "Defra digital"
    ],
    "pub_date": "2022-06-03T07:00:39+01:00",
    "content": [
        {
            "text": "On World Bike Day Continuous Service Improvement Manager Simone Burke shares her experiences of volunteering at a Bath ‘not for profit’, work that involves her cycling around the city collecting and delivering everyday items to people."
        },
        {
            "text": "I volunteer as a courier cyclist for Bath Share & Repair, dropping off and picking up things that people borrow from Share & Repair’s library of things, or which they have had repaired. I’m very proud and privileged to be able to help such a wonderful, environmental not for profit."
        },
        {
            "text": "I got into it by being a user of the service myself. I had a radio repaired and I saw on their website that they needed a regular cyclist. I’m a keen, confident cyclist and thought I would enjoy getting out and about meeting people after lockdown. I believe in what they are doing; helping people save money and the planet through sharing and repairing things. It’s a great community project helping people connect, share, save and learn."
        },
        {
            "text": "This week is also Volunteering Week and I’m proud to be doing my bit. Volunteering is a brilliant way to support causes you care about. It’s also good for your wellbeing. I especially like this quote from the Action for Happiness website – ‘If you want to feel good, doing good is a great place to start’."
        },
        {
            "heading": 5,
            "text": "Share and Repair is a 'not for profit' in Bath"
        },
        {
            "heading": 2,
            "text": "How my flexible working enables me to volunteer"
        },
        {
            "text": "I am the Continuous Service Improvement Manager in the Digital, data and technology services Operations function. I manage a small team who support the function to improve efficiency and ways of working, and work with our suppliers on improvement plans. I set up the team in 2018 when I moved across from the central improvement team which I had joined in 2015."
        },
        {
            "text": "As a team we regularly take part in environmental outcome days. These are wonderful for team building and helping us to feel more connected to the natural world and Defra’s wider work. Most recently we did a day of conservation work at a one of Natural England’s National Nature Reserves and later in the year we are hoping to help out at an animal sanctuary."
        },
        {
            "text": "Prior to working in Defra and the Environment Agency, I worked for Citi Bank in Process Re-engineering and Project Management roles. I joined Citi’s graduate programme in 2009 and was placed in the re-engineering team for Europe Middle East and Africa, where I was trained in Lean Six Sigma process improvement and problem solving."
        },
        {
            "heading": 5,
            "text": "Simone sometimes takes her dogs with her when she goes out on the bike"
        },
        {
            "text": "In Defra I’m fortunate that I can work quite flexibly, for example I find it easier to prepare and follow up from workshops out of hours. My work can also involve a fair bit of travel. I have big dogs and I take breaks when I can to walk them, making up the time later on."
        },
        {
            "text": "When I started volunteering with ‘Share and Repair’ in September 2021, I used flexi time to do my volunteering shift on a Friday morning. I often found I needed longer than I had allowed for, and I was fairly tired afterwards. So now I’m trialling a four-day compressed week, meaning I work longer days Monday to Thursday."
        },
        {
            "heading": 2,
            "text": "The benefits of volunteering"
        },
        {
            "text": "Volunteering really boosts my mood. The shop has a friendly and welcoming atmosphere and all of us volunteers are well fuelled with cake. People are very happy to receive the items they’ve borrowed."
        },
        {
            "text": "I get to ride a big orange (my favourite colour) Tern electric bike that ‘Share and Repair’ call the ‘flying satsuma’. It’s really powerful, great for going up the hills in Bath. All sorts can fit on it: carpet cleaner, lawn mower, jet washer - you name it."
        },
        {
            "text": "In fact, at Christmas, I piled it up with toys like a futuristic sleigh. ‘Share and Repair’ ran an Elves workshop, repairing toys, and they set up a toy swap shop grotto in the centre of town. I had the delightful job of delivering some of the donated toys to a local nursery. I put on a Santa suit for the very jolly ride. I had plenty of people wanting to be on the nice list, waving and giving way for me."
        },
        {
            "heading": 5,
            "text": "Simone enjoys the freedom that cycling gives her"
        },
        {
            "heading": 2,
            "text": "Why I enjoy cycling"
        },
        {
            "text": "I love to ride. You see a lot more, and you’re more exposed to the elements. It’s great exercise, very freeing, relaxing, good for the environment, saves me money and is usually quicker. Mindful travel."
        },
        {
            "text": "I’m out on the bike fairly often. I do some big loops around the Cotswolds with friends. I enjoy road cycling and mountain biking."
        },
        {
            "text": "I also cycle the eight or nine miles to my base office, or to the station to catch a train to other cities. I’m lucky to live near a Sustrans cycle route that is mainly off road. I missed my commute during lockdown but enjoyed cycling on the quiet roads and discovering new routes in my area."
        },
        {
            "heading": 2,
            "text": "Consider giving volunteering (and cycling) a try"
        },
        {
            "text": "There are so many things to get involved with to meet new people and make a difference. Many charities and trusts will have ‘Volunteer wanted’ info on their websites, and volunteer newsletters you can sign up to, to see what is needed and what might be a right for you."
        },
        {
            "text": "British cycling has plenty of info and tips about getting into cycling. Many councils will have active, sustainable travel schemes, which will include advice on routes, bike safety and maintenance and even loan bikes to borrow to try."
        },
        {
            "text": "I’d love to hear what volunteering activities you’ve undertaken, or what you enjoy about cycling. So do please leave me a comment here."
        },
        {
            "text": "Simone Burke is a Continuous Service Improvement Manager in our operations team."
        },
        {
            "text": "World Bicycle Day draws attention to the benefits of using the bicycle — a simple, affordable, clean and environmentally fit sustainable means of transport."
        },
        {
            "text": "Volunteers' Week is an annual celebration of the contribution millions of people make across the UK through volunteering."
        },
        {
            "text": "Volunteer opportunities"
        },
        {
            "text": "NCVO volunteering opportunities"
        }
    ]
}