{
    "url": "https://educationhub.blog.gov.uk/2022/11/29/88-of-schools-now-rated-good-or-outstanding-and-how-were-making-sure-ofsted-ratings-are-up-to-date/",
    "title": "88% of schools now rated good or outstanding – and how we’re making sure Ofsted ratings are up to date",
    "authors": [
        "media officer"
    ],
    "categories": [
        "Ofsted",
        "Ofsted reports"
    ],
    "pub_date": "2022-11-29T15:57:07+00:00",
    "content": [
        {
            "text": "New data shows that 88% of schools are now rated good or outstanding, up from 68% in 2010."
        },
        {
            "text": "Ofsted ratings are an important factor in helping parents understand the standards of schools in their areas – and we’re making changes so the picture parents get is even clearer."
        },
        {
            "text": "Here’s what you need to know."
        },
        {
            "text": "When a school was rated outstanding by Ofsted between 2012 and 2020, that meant it was exempt from future routine inspections, unless there were specific concerns about the school."
        },
        {
            "text": "We have now removed that exemption, so all schools can be evaluated under Ofsted’s new framework."
        },
        {
            "text": "Parents rely greatly on schools’ Ofsted ratings to give them confidence in choosing the right school for their child, and this change will give parents even greater confidence, knowing that every Ofsted rating is up to date and relevant to their child."
        },
        {
            "text": "Exempting outstanding schools deprived parents of up-to-date information. It also left a lot of schools without the challenge that regular inspection provides."
        },
        {
            "text": "Ofsted resumed its routine inspection programme in September 2021, which includes inspection of formerly exempt schools."
        },
        {
            "text": "It has now published commentary on inspection outcomes for previously Outstanding schools that have been reinspected since the legal exemption on further inspections was dropped."
        },
        {
            "text": "Inspectors prioritised schools that have gone the longest without being inspected."
        },
        {
            "text": "The commentary finds that:"
        },
        {
            "text": "To ensure parents can have confidence in these ratings, Ofsted is continuing its mission to inspect every school in the country by summer 2025, meaning parents will have an up-to-date assessment of their child’s school."
        },
        {
            "text": "We will continue to invest in education with an extra £2 billion next year and the year after - the highest real terms spending on schools in history totalling £57.3 billion by 2024/25."
        }
    ]
}