{
    "url": "https://food.blog.gov.uk/2022/11/29/chairs-stakeholder-update-school-food-standards-compliance-pilot-announced/",
    "title": "Chair's stakeholder update - School Food Standards Compliance pilot announced",
    "authors": [
        "Professor Susan Jebb, FSA Chair"
    ],
    "categories": [
        "Our mission"
    ],
    "pub_date": "2022-11-29T11:59:35+00:00",
    "content": [
        {
            "text": "Cymraeg"
        },
        {
            "text": "I was very pleased to speak to the BBC this week about the work the FSA is doing with the Department for Education (DfE) to understand the role local authorities can play in assuring and supporting schools to comply with the school food standards. "
        },
        {
            "text": "This work is being carried out through the School Food Standards Compliance pilot which is running across 18 participating local authorities in England. The pilot is supported by the Office for Health Improvement and Disparities (OHID)."
        },
        {
            "text": "Schools play a crucial role in providing children with healthy food to help them concentrate and thrive in the classroom and beyond. We all want to ensure that the food served in schools meets the standards that have been set. The pilot will involve adding nutrition-focused questions and observations to the routine inspections carried out by local authority food safety officers, to promote compliance with School Food Standards. This will give insight into what's happening in schools today and identify whether school food standards checks, carried out by food safety officers, can drive positive change."
        },
        {
            "text": "The pilot was announced earlier in the year as part of the Levelling Up White Paper, which is the cross-government plan to transform the UK into a more equal society. At the FSA we are paying increasing attention across all of our work to identify and help reduce disparities and play our part in delivering a safe, healthy, and sustainable food system for everyone."
        },
        {
            "text": "We continue to be reminded of the challenges. We recently published new research which found that some people are taking food safety risks because of money pressures and rising energy costs. In the last month, one in three have cut down the size of their meals or even skipped meals because they didn’t have enough money to buy food."
        },
        {
            "text": "I’d be interested to know your thoughts on what we can do at the FSA to help reduce inequalities in the food system, so please do let us know in the comments section below."
        },
        {
            "heading": 1,
            "text": "Neges gan yr Asiantaeth Safonau Bwyd i randdeiliaid - Cyhoeddi cynllun peilot cydymffurfiaeth Safonau Bwyd Ysgolion"
        },
        {
            "text": "Roeddwn yn falch iawn o siarad â’r BBC yr wythnos hon am y gwaith y mae’r Asiantaeth Safonau Bwyd (ASB) yn ei wneud gyda’r Adran dros Addysg (DfE) i ddeall y rôl y gall awdurdodau lleol ei chwarae i sicrhau bod ysgolion yn cydymffurfio â safonau bwyd ysgolion, a’u cefnogi i wneud hynny. "
        },
        {
            "text": "Mae’r gwaith hwn yn cael ei wneud drwy’r cynllun peilot Cydymffurfiaeth Safonau Bwyd Ysgol sy’n cael ei gynnal ar draws 18 o awdurdodau lleol yn Lloegr. Cefnogir y cynllun peilot gan y Swyddfa Gwella Iechyd a Gwahaniaethau (OHID)."
        },
        {
            "text": "Mae ysgolion yn chwarae rhan hanfodol wrth ddarparu bwyd iach i blant i’w helpu i ganolbwyntio a ffynnu yn yr ystafell ddosbarth a thu hwnt. Rydym i gyd am sicrhau bod y bwyd a weinir mewn ysgolion yn bodloni’r safonau a osodwyd. Bydd y cynllun peilot yn cynnwys ychwanegu cwestiynau ac arsylwadau sy’n canolbwyntio ar faeth at yr arolygiadau arferol a gynhelir gan swyddogion diogelwch bwyd awdurdodau lleol, er mwyn hyrwyddo cydymffurfiaeth â Safonau Bwyd Ysgol. Bydd hyn yn rhoi cipolwg ar yr hyn sy’n digwydd mewn ysgolion heddiw ac yn nodi a all gwiriadau safonau bwyd ysgolion, a gynhelir gan swyddogion diogelwch bwyd, ysgogi newid cadarnhaol."
        },
        {
            "text": "Cyhoeddwyd y cynllun peilot yn gynharach eleni fel rhan o’r Papur Gwyn Codi’r Gwastad, sef y cynllun trawslywodraethol i drawsnewid y DU yn gymdeithas fwy cyfartal. Yn yr ASB, rydym yn rhoi sylw cynyddol ar draws ein holl waith i nodi a helpu i leihau gwahaniaethau, a chwarae ein rhan i ddarparu system fwyd ddiogel, iach a chynaliadwy i bawb."
        },
        {
            "text": "Rydym yn parhau i gael ein hatgoffa o’r heriau. Yn ddiweddar, cyhoeddom ymchwil newydd yn dangos bod rhai pobl yn cymryd risgiau diogelwch bwyd oherwydd pwysau ariannol a chostau ynni cynyddol. Yn ystod y mis diwethaf, mae un o bob tri wedi lleihau maint eu prydau neu hyd yn oed wedi hepgor prydau bwyd am nad oedd ganddynt ddigon o arian i brynu bwyd."
        },
        {
            "text": "Hoffwn glywed eich barn ar yr hyn y gallwn ei wneud yn yr ASB i helpu i leihau anghydraddoldebau yn y system fwyd, felly rhowch wybod i ni yn yr adran sylwadau isod."
        }
    ]
}