{
    "url": "https://educationhub.blog.gov.uk/2022/11/how-we-are-improving-support-for-children-with-send/",
    "title": "How we are improving support for children with SEND",
    "authors": [
        "media officer"
    ],
    "categories": [
        "SEND"
    ],
    "pub_date": "2022-11-29T15:55:08+00:00",
    "content": [
        {
            "text": "We want all children and young people to have the same opportunity to meet their potential – including children and young people with special educational needs and disabilities (SEND)."
        },
        {
            "text": "That’s why children and young people with SEND are set to benefit from more wellbeing and technology support. Here’s what you need to know."
        },
        {
            "heading": 3,
            "text": "How will children with SEND benefit from this additional support? "
        },
        {
            "text": "Funding worth £21 million will go towards training 400 more educational psychologists, who play a critical role in the educational support available to children with SEND. A training programme to help school staff use assistive technology to better support pupils with SEND will be extended to up to 150 more schools."
        },
        {
            "text": "The new £21 million funding, in place from 2024, builds on the £10 million announced earlier this year to train over 200 educational psychologists from September 2023."
        },
        {
            "heading": 3,
            "text": "How do educational psychologists help children and young people with SEND? "
        },
        {
            "text": "Educational psychologists provide input into Education, Health and Care assessments, and advise schools on how to support children and young people with SEND. They also offer wider support for the wellbeing of children and young people, families and teachers."
        },
        {
            "heading": 3,
            "text": "What will the assistive technology training programme help school staff with?"
        },
        {
            "text": "This course will teach school staff how to use assistive technology effectively, with a focus on the technology schools already have available or can easily obtain, such as text-to-speech software. This will give school staff the confidence and capability to take full advantage of the range of technology available in the classroom to support children with SEND."
        },
        {
            "text": "The next cohort of assistive technology training will run from March to July 2023."
        },
        {
            "heading": 3,
            "text": "Where can I read more about the SEND and Alternative Provision Green Paper?"
        },
        {
            "text": "The Education Secretary Gillian Keegan has confirmed that she and the Minister for Children, Families and Wellbeing Claire Coutinho will be taking time over the coming weeks to listen to children and parents, sector groups and teaching support staff before publishing a full response to the SEND and Alternative Provision green paper early next year."
        },
        {
            "text": "Proposals made through the Green Paper included introducing new national standards across education, health and care, simplifying the Education, Health and Care Plan (EHCP) process, and instilling a new culture and practice in mainstream education."
        },
        {
            "text": "You can find the SEND and Alternative Provision Green Paper here."
        }
    ]
}