{
    "url": "https://educationhub.blog.gov.uk/2022/11/29/message-to-the-education-and-care-sector-on-send-reform-from-the-secretary-of-state-for-education-gillian-keegan/",
    "title": "Message to the education and care sector on SEND reform from the Secretary of State for Education, Gillian Keegan",
    "authors": [
        "mediaofficer"
    ],
    "categories": [
        "SEND"
    ],
    "pub_date": "2022-11-29T12:20:42+00:00",
    "content": [
        {
            "text": "I passionately believe no matter where you are from or what stage of life you are at, you should always be able to get a high-quality education and receive the right support in the right place and at the right time. This includes children and young people with special educational needs and disabilities (SEND) and those in alternative provision (AP)."
        },
        {
            "text": "I know from experience that this is not the case. I have witnessed first-hand the challenges families have navigating a complex system in an effort to secure support for their child. Addressing this is a priority for me. It is a huge honour to be taking this work forward in my new role as Secretary of State for Education."
        },
        {
            "text": "The new Minister for Children and Families, Claire Coutinho, shares my passion for this work. As the former Minister for Disabled People, she brings a wealth of knowledge and experience to the role. I know she has plans to meet parents and carers, children and young people with SEND, as well as voluntary and community sector groups in the coming weeks. Similarly, I will also be having such meetings of my own."
        },
        {
            "text": "The SEND and Alternative Provision green paper, published in March this year, set out a bold and ambitious plan to equip children and young people with the skills they need to succeed in later life. It aims to improve experiences within a fairer, more inclusive and sustainable system across education, health and care, something I was deeply involved in while I served as a Health Minister."
        },
        {
            "text": "In that role, and through my own experiences I know meaningful and significant change is necessary to deliver a system that allows every child and young person to reach their potential. I do not underestimate the importance of getting this right. That is why I, alongside the new ministerial team, want to take time to listen to children and parents as well as those of you who work tirelessly in the system. I want to understand the extensive feedback we received through the consultation, before publishing a full response to the SEND and Alternative Provision green paper, in an Improvement Plan. I will publish this early in the new year."
        },
        {
            "text": "This plan will reflect the feedback we have heard throughout the consultation and be clear on Government’s next steps. It will focus on delivery; outlining the immediate steps we will be taking, and how we will ensure long-term sustainable systemic change."
        },
        {
            "text": "We know that children and young people need our support now. That is why, through the autumn statement, we committed to investing £2 billion in extra funding both this year and next, which will mean by 2025, we will be spending more in schools than ever before."
        },
        {
            "text": "Ahead of our Improvement Plan being published, I’m happy to confirm that we are taking forward two additional measures to support children with SEND: investing £21 million into training 400 more educational psychologists, who play a critical role in the educational support available to children with SEND, and extending a training programme to up to 150 more schools for teachers to use assistive technology to better support their pupils. This money will continue to support the system to deliver change and continue to improve the outcomes and experiences of children and young people with SEND and those who need alternative provision."
        },
        {
            "text": "My team and I very much look forward to working with you to deliver a change that supports all of our children and young people for generations to come."
        },
        {
            "text": "The Rt Hon Gillian Keegan MP\nSecretary of State for Education"
        }
    ]
}