{
    "url": "https://cddo.blog.gov.uk/2022/11/29/the-civil-services-digital-skills-imperative/",
    "title": "The Civil Service’s digital skills imperative",
    "authors": [
        "Megan Lee, Chief Executive, CDDO"
    ],
    "categories": [
        "CDDO",
        "Cross-government strategy",
        "DDaT",
        "Digital learning and development",
        "Digital strategy"
    ],
    "pub_date": "2022-11-29T10:00:38+00:00",
    "content": [
        {
            "text": "The Central Digital Data and Data Office’s (CDDO) vision is that by 2025, the UK government will be a transformed, more efficient digital government that provides better outcomes for everyone, as outlined in government’s Transforming for a Digital Future Strategy. "
        },
        {
            "text": "A central tenet to achieving that mission is equipping all our people with the capability and tools for a digital future, which is why we’re focused on upskilling not just digital, data and technology (DDaT) professionals in government, but all civil servants. "
        },
        {
            "heading": 3,
            "text": "Google Cloud skills survey   "
        },
        {
            "text": "I don’t underestimate the challenges we face when it comes to attracting and retaining top of the market digital talent in a fiercely competitive environment, or the benefits that could be reaped for the public if we are to succeed in building digital skills at scale. CDDO leads the Digital, Data and Technology (DDaT) profession, and we are fully committed to empowering all government departments to attract and build digital talent at scale. "
        },
        {
            "text": "In an increasingly challenging external environment, the Civil Service will need to work smarter and faster to deliver great services to the public, and to deliver policies with greater precision and impact. Only through leveraging the power of digital and data can we do that. It will take concerted cross-government effort and focus to make the type of progress we can be proud of. "
        },
        {
            "text": "We welcome the expertise of industry leaders, like Google Cloud, who recently supported Global Government Forum’s Civil Service Digital Skills Survey , which CDDO were pleased to introduce at Google Cloud’s Public Sector Transformation Forum held today at County Hall, London. The report is aimed at better understanding the scale and shape of digital skills across government. Adam Stewart, Head of Public Sector UKI, Google Cloud, explains: "
        },
        {
            "text": "“ The aim of this research was to understand more about digital skills capability across the civil service. Our key questions were: "
        },
        {
            "text": "“And, what’s clear from the findings is that we have conclusive answers. Civil servants absolutely feel that technology and digital skills are imperative to a modern, transformed government, with key challenges identified to achieve this. We are dedicated in our support for the government's plans to tackle these challenges.”"
        },
        {
            "heading": 3,
            "text": "The appetite for transformation "
        },
        {
            "text": "I was very pleased to read in the Civil Service Digital Skills Survey report that over 75% of civil servants would like to receive more digital skills training. Government is already rising to meet this demand through the plans set out in our strategy. By 2025, we’ve committed to:"
        },
        {
            "heading": 3,
            "text": "Facing hurdles head on  "
        },
        {
            "text": "We’ve already made a start on each of those commitments outlined above. Since the launch of the strategy in June, we’ve:"
        },
        {
            "text": "Digital teams across government have captured the imagination of colleagues, government leaders, ministers and the public by demonstrating what’s possible when we use digital ways of working to stand up efficient services quickly, using rich insights to inform and evaluate policy and deploying emerging tech to make experiences more effective. "
        },
        {
            "text": "This momentum for transformation presents an opportunity for us to rise to meet both citizen’s expectations, and the civil service’s appetite for digital. "
        }
    ]
}