{
    "url": "https://defradigital.blog.gov.uk/2022/11/29/why-we-have-research-panels/",
    "title": "Why we have research panels",
    "authors": [
        "Jason Stockwell"
    ],
    "categories": [
        "Defra digital",
        "User research"
    ],
    "pub_date": "2022-11-29T07:30:13+00:00",
    "content": [
        {
            "text": " "
        },
        {
            "text": "User research panel manager Jason Stockwell explains what a research panel is, why we have them and the value they bring to large-scale projects and programmes."
        },
        {
            "text": "Hi, I’m Jason, the panel manager on Collection and Packaging Reforms and Waste.  I run the research panel, which involves sourcing the right participants for user research. My colleagues wrote last year about how our digital teams, which include user researchers, are playing a key role in waste reforms."
        },
        {
            "text": "You may already have a research panel or are looking to implement one in the future. I thought it would be useful to explain what they are, why we have one and what it means to have a dedicated panel manager. So, let’s look at how research panels work, in more detail."
        },
        {
            "heading": 2,
            "text": "What is a research panel?"
        },
        {
            "text": "A research panel, first and foremost, is an internal tool to source participants for research sessions. A panel will consist of relevant panel members, who are opted-in for research, and who have the information needed to screen participants for relevant research."
        },
        {
            "text": "There are three different types of data typically collected in research panels:"
        },
        {
            "heading": 2,
            "text": "Why a research panel?"
        },
        {
            "text": "OK, so I’ve explained what a research panel is, but why might you need one for your programme? The answer isn’t easy, and you might not need one. If a service only has 23 users, and you know each of them, then you probably don’t need a sophisticated panel; rather, what you will need is an engagement tracker."
        },
        {
            "text": "However, many programmes aren’t in that position. The data captured in a research panel is used to select participants for research, saving user researchers time in participant recruitment and saving additional costs on external recruitment agencies."
        },
        {
            "heading": 2,
            "text": "When to use a research panel"
        },
        {
            "text": "To help us out, let’s define a panel as ‘an internal source we use to gather participants for user research’."
        },
        {
            "text": "Panels should be used across most or all programmes. Most of us will have an internal panel, database, or pool of addresses, so we don’t have to go to user research recruitment agencies for every UR project."
        },
        {
            "text": "One of the core times to think about a more structured research panel is when you have multiple stakeholders and user researchers recruiting participants for research. Often, these stakeholder or engagement groups don’t collaborate with user researchers to share who they are talking with."
        },
        {
            "text": "Within a user research panel, these interactions can be documented to ensure researchers are aware of any other internal interactions within Defra, and we can look to get other participants involved in research that have fewer interactions with other colleagues."
        },
        {
            "text": "Recruiting participants for research is HEAVILY time consuming for user researchers. We typically find participants through trade associations, social media, via previous research or however we source users. A user panel helps by facilitating a continual flow of users into the panel. This means timelines for user research are reduced, and we get the right people involved in the research projects."
        },
        {
            "text": "The other big expense, of course, is money. User research recruitment is expensive, and sometimes the profiles aren’t quite right; you can end up paying for that participant (plus incentives). In a way, it’s money for old rope. With a good pool of people in a research panel, a programme can save money on participants across research projects."
        },
        {
            "heading": 2,
            "text": "So, why a panel manager?"
        },
        {
            "text": "That rolls on nicely to the last point, what the heck does a panel manager do anyhow? There isn’t one answer for this, it’s a fairly new role in Defra, and is more about creating and optimising the processes for user research recruitment. A panel manager role will vary, depending on the number of researchers on the programme."
        },
        {
            "text": "A panel manager can often be responsible for doing a lot more than just finding the people to take part in research sessions. They can establish when participants are available for research, align diaries with the team, organise research sessions with consent forms, and attend the research themselves as an extra note-taker. The scope of research support isn’t limited and can depend on the researcher’s preferences."
        },
        {
            "text": "Having dedicated resources to grow the panel can’t be underestimated. It’s a massive task; finding new participants through digital means, partnerships and events is time consuming, and having the capacity to grow a research panel is really valuable."
        },
        {
            "text": "Alongside these ‘growth’ activities, we often work with internal teams in Defra and grow the panel through stakeholder engagement teams, social research teams and communications teams. This internal awareness is another role of a panel manager that traditionally goes a little further than user research panel growth."
        },
        {
            "text": "If you want to talk about your research panel, please feel free to reach out."
        }
    ]
}