{
    "url": "https://forestrycommission.blog.gov.uk/2022/11/29/woods-into-management-forestry-innovation-funds-2022-successful-applicants/",
    "title": "Woods into Management Forestry Innovation Funds: 2022 successful applicants",
    "authors": [
        "Jack Clough"
    ],
    "categories": [
        "Woodland management"
    ],
    "pub_date": "2022-11-29T08:00:37+00:00",
    "content": [
        {
            "text": "In the UK, it is often thought that woodlands should be left alone. However, much of our woodland ecology relies on disturbance to refresh natural life cycles. Before humans colonised, animals such as beavers and bison, as well as wind, fire, disease and flooding, would bring light to the forest floor, allowing seeds to germinate and the regeneration of flora and fauna. As these animals became extinct, their activity was replaced by that of humans."
        },
        {
            "text": "Our ancestors harvested timber to provide fuel and shelter and cleared woodland to free up land for agriculture. Over time, woodland ecosystems have adapted in response to these disturbances and many of our native species now depend upon them. In contrast, unmanaged woodland sees biodiversity begin to decline."
        },
        {
            "text": "Woodland management doesn't only benefit nature. Harvested timber is a valuable resource that can provide a sustainable source of income and jobs in rural areas and, if put into long-term use, acts as a carbon store."
        },
        {
            "text": "Climate change is an existential threat to woods and forests, and we need to give them the best chance to keep pace. This may be by introducing diversity, including species that will cope better with changing conditions. There are other threats too, our woodlands have to withstand browsing deer, bark stripping by grey squirrels, competition from invasive species (e.g. rhododendron), disease pressures (e.g. ash dieback), and a greater risk of drought. Sustainable management makes woodland more resilient to these pressures, ensuring that their benefits to both humans and wildlife can be reaped long into the future."
        },
        {
            "text": "Through the Woods into Management Forestry Innovation Funds, the Forestry Commission and Defra are supporting a range of projects designed to overcome barriers to woodland management and develop routes to market for domestic timber."
        },
        {
            "text": "A couple of the successful projects are outlined below."
        },
        {
            "heading": 2,
            "text": "Routes to market for ash timber Innovation Fund"
        },
        {
            "text": "Building a new, sustainable, and high value market for home grown Ash timber in the UK furniture market. A new supply chain for ash boards and ash plywood will be created by developing a range of furniture with ercol, the classic British furniture icon, to sell through high street retailers, partners and directly from ercol.com."
        },
        {
            "text": "Rachel Lawrence, Business Manager, Grown in Britain"
        },
        {
            "heading": 2,
            "text": "Regional Woodland Restoration Innovation Funds: South West"
        },
        {
            "text": "Applying active and targeted wildlife management over a 35 mile stretch of native North Exmoor coastal woodland via an intensive grey squirrel management programme. This landscape scale project will be taking a joined up and collaborative approach, bringing together landowners, academics, and trained volunteers. Continued management of the grey squirrel population will enable the woodland to regenerate and recover, creating a better-connected habitat and improving biodiversity, ultimately leading to reintroductions of Red Squirrels."
        },
        {
            "text": "Kat Webb, Charity Administrator and Project Co-ordinator, Red Squirrel South-West"
        },
        {
            "text": "A list of the projects and the successful lead applicants can be found on GOV.UK. Many of the projects listed will be completed over a period of two to three years, with several building on pilot work carried out in 2021/22. You can find out more about this work in our previous blog post;  Woods into Management Forestry Innovation Funds projects."
        }
    ]
}