{
    "url": "https://prisonjobs.blog.gov.uk/2023/10/27/from-crafting-mosaics-to-creating-better-futures/",
    "title": "From crafting mosaics to creating better futures",
    "authors": [
        "Ministry of Justice"
    ],
    "categories": [
        "Black History Month",
        "Career progression",
        "Culture",
        "Personal stories"
    ],
    "pub_date": "2023-10-27T15:20:30+01:00",
    "content": [
        {
            "heading": 3,
            "text": "From crafting mosaics to creating better futures "
        },
        {
            "text": "Being in the Civil Service for 15 years, Myra didn’t quite start her journey like most do. It was her love for mosaics which created her destiny in the Prison Service."
        },
        {
            "text": "Why did you join the Prison Service? "
        },
        {
            "text": "I didn't join the Prison Service through a job ad. I was out in the community doing mosaics as a community artist. I came in to do a project at a Cat A prison. The Muslim community had put together a lump sum of money for this project in order to create an ‘Islamic Garden’ for the prison so during family visits they could sit around the mosaics. I then shadowed an art tutor to get a feel of how to work within that environment."
        },
        {
            "text": "When a position became available, I was asked if I wanted to take over the class and that’s I how I got in. So, the mosaic didn’t end up happening until three years later because I ended up working in the Education department as an art teacher. I know that isn’t how you normally start working in the Prison Service. It felt more like destiny."
        },
        {
            "text": "After two years of being in the Education department, I went over from education to the uniform side as an instructional officer. It went from a class of eight then up to 12, 14, 22 – by the time I finished there were 80 prisoners that were doing mosaics. It’s great – there’s mosaics which prisoners have made which have been installed all around the UK."
        },
        {
            "text": "What did your family and friends think about you when joining the Prison Service?"
        },
        {
            "text": "They thought I was mad. My sons, in particular, were worried sick. Which is what the new HMPPS advert portrays. But they also supported the fact that they knew I loved every minute of working with the prisoners. I think they were just relieved to see me home every single day without having any harm done."
        },
        {
            "text": "My sons still feel the same - I don’t think that will ever change. But if I was to say, ‘I'm going to leave’, they'd all be relieved. But my comeback to that is: If you treat people with respect, they will treat you with respect. I’ve never experienced disrespect in all the years I’ve worked in the Prison Service. So, for me, I feel safe."
        },
        {
            "text": "What are your main responsibilities and how do these align with your values?"
        },
        {
            "text": "I think because I like to treat people with respect, I get that back. It comes down to communication. I have a positive attitude which rubs off onto people. If you go in with a positive attitude, make it clear what you want to achieve, what you expect from the prisoners, and how you’ll treat them, then expect that in return. I put across my values and it filters down."
        },
        {
            "text": "I remember thinking when I first started in the role that, everyday I step into the classroom, it’s a bit like going on stage and I’ve got to do a good performance – and if not, then these people will not come back. So it’s about being who I am and if I’m being respectful to them and treating them as equals as best I can, within the compliments that we have, then they will see that and that filters down."
        },
        {
            "text": "When I was doing the mosaics, we had a huge project for a park. It was a three-metre by three-metre Snakes and Ladders board which we created as a mosaic. It took 20 prisoners almost a year to complete it - they worked really hard on it. However, two of the prisoners were released before the project was finished but they knew the project installation date. On the day of the installation at the park, two men came out of a car and introduced themselves and the former prisoners. They proceeded to tell me how they couldn’t see the end of the project because they were released but they didn’t want me to install it on my own. They got the grout and buckets of water and helped me install it. I don’t think that would have happened if we didn’t have mutual respect."
        },
        {
            "text": "I’ve now been a chaplain for eight or nine years. I do all the meet and greets. So when anyone new comes in, it’s part of my role to see that they’re settled and have contact with their family. I cover funerals, deliver good news and bad news. The Chaplaincy department is the heartbeat of the Prison Service. We’re the ones who staff and prisoners come to. We’re out of uniform, we have the counselling techniques, and we’re there to listen. "
        },
        {
            "text": "What one piece of advice would you give to someone considering joining the Prison Service?"
        },
        {
            "text": "Don’t judge people because everybody has a back story. Their story might be so difficult for them to be able share to a complete stranger and someone in a uniform. They may have gone from institution to institution and lost trust along the way. The first encounter with them counts. It’s about adapting with each other."
        }
    ]
}