{
    "url": "https://mattersoftesting.blog.gov.uk/mot-halloween-horror-stories-night-of-the-living-tread/",
    "title": "MOT Halloween Horror Stories: Night of the Living Tread",
    "authors": [
        "Matters of Testing"
    ],
    "categories": [
        "Horror stories",
        "MOT testing service",
        "News and updates"
    ],
    "pub_date": "2023-10-27T10:01:52+01:00",
    "content": [
        {
            "heading": 2,
            "text": "Happy Halloween!"
        },
        {
            "text": "Forget the ghosts and ghouls banging on your doors, we’ve got some far scarier tales to share with you from some seriously spooked MOT testers. "
        },
        {
            "text": "When you think you’ve seen it all, we bring you some new tales that will have you wide eyed and white knuckled as you delve in to our latest edition of Halloween MOT Horror stories. "
        },
        {
            "heading": 2,
            "text": "Creeping Corrosion"
        },
        {
            "text": "This lower suspension arm on a Vauxhall Meriva was creepily close to failing on its way to the testing station. The tester was amazed that it hadn’t completely disintegrated under the weight of the vehicle."
        },
        {
            "text": "It’s very possible that this vehicle would have had an advisory on a previous MOT test for corrosion that has been ignored by the vehicle owner."
        },
        {
            "text": "Advisories are provided to alert drivers to future problems on their vehicles before they become serious or dangerous."
        },
        {
            "text": "The best course of action is to get advisories repaired before your next MOT test."
        },
        {
            "text": "This will ensure that your vehicle is in the best possible condition it can be, and normally the earlier you address an advisory the less costly it is likely to be to repair it."
        },
        {
            "heading": 2,
            "text": "Night of the living tread"
        },
        {
            "text": "A Local Authority tester was tread-ified after seeing the tyres on a motor caravan."
        },
        {
            "text": "One of the worst examples of tyre wear that we have seen so far. Made worse by the bulging sidewall of the tyre which is reminiscent of a scene from Alien."
        },
        {
            "text": "This tyre was at a serious risk of having a blowout and should have been changed at a much earlier date than at the MOT test. The law requires tyres to have a minimum tread depth of 1.6mm, although this is a case of the more you have, the better!"
        },
        {
            "text": "A low tread depth can make it more difficult to drive in adverse weather conditions, can cause you to aquaplane, result in blowouts, increase stopping distance, and cause maintenance issues with wheel alignment and balance."
        },
        {
            "text": "Our advice is to check your wheels before you get behind your wheel, and always make sure your tyres are pump-kined up."
        },
        {
            "heading": 2,
            "text": "Watch out, Tready Krueger’s about"
        },
        {
            "text": "A cracking example of what can happen if you don’t check your tyres regularly. You may end up with a visit from Tready Krueger!"
        },
        {
            "text": "Ignored by the driver despite a daily commute of 100 miles on the motorway, thankfully the vehicle was presented for MOT before it got a Boo-low out."
        },
        {
            "text": "You should always remember to check your tyres regularly, especially before a long journey."
        },
        {
            "text": "Tyres are one of the most common reasons for MOT fails, and damaged or inadequate tyres can seriously compromise your vehicle when driving, especially at speed."
        },
        {
            "text": "If you find a crack or bulge on your tyre, you should seek advice by taking it to your local garage to get it inspected."
        },
        {
            "heading": 2,
            "text": "Van-pire tales"
        },
        {
            "text": "The MOT tester really got his teeth into this one. After applying pressure to the brakes during an MOT test, an almighty bang echoed around the testing station."
        },
        {
            "text": "Upon inspection the brake servo had blown apart at the seam! Fixodent was no use here!"
        },
        {
            "text": "A brake servo is a device that increases the pressure applied by the brake foot pedal."
        },
        {
            "text": "Although this isn’t a common occurrence, if you detect any change in your vehicle’s braking system, get it checked out by a professional immediately."
        },
        {
            "text": "You’d be batty not to realise that we all have a stake in vehicle safety, so a Count of one new servo was ordered to ensure this one was back on the road."
        }
    ]
}