{
    "url": "https://environmentagency.blog.gov.uk/2025/11/25/2025-bathing-waters-classifications/",
    "title": "2025 Bathing Waters Classifications",
    "authors": [
        "Environment Agency"
    ],
    "categories": [
        "Cleaner Seas",
        "Water"
    ],
    "pub_date": "2025-11-25T12:45:20+00:00",
    "content": [
        {
            "text": "The Environment Agency published the 2025 Bathing Water Classifications earlier today, Tuesday 25 November. The results provide the latest national assessment of the quality of England’s 449 designated bathing waters out of a total of 451 as two were closed due to access issues. The results show continued improvement overall, alongside some persistent local challenges."
        },
        {
            "text": "Full results can be found via the following link: 2025 Statistics on English coastal and inland bathing waters: A summary of compliance with the Bathing Water (Amendment) (England and Wales) Regulations 2025 - GOV.UK"
        },
        {
            "text": "Strong National Performance"
        },
        {
            "text": "The 2025 results confirmed that bathing water quality across England remains high:"
        },
        {
            "text": "· 417 waters (92.9%) achieved an Excellent, Good, or Sufficient classification, up from 91.8% in 2024."
        },
        {
            "text": "· 297 waters (66.1%) were rated Excellent—the highest number since the current standards were introduced in 2015."
        },
        {
            "text": "· 32 waters (7.1%) were classed as Poor, down from 37 last year."
        },
        {
            "text": "These improvements underline the long-term progress achieved through regulation, investment, and increasingly coordinated catchment management."
        },
        {
            "text": "What Influenced the 2025 Results"
        },
        {
            "text": "The classifications reflect both seasonal weather and local pollution pressures. Much of the summer (May to August) was dry, supporting better water quality."
        },
        {
            "text": "Each bathing water also faces a unique mix of pressures—from storm overflows and agricultural runoff to urban drainage, misconnections, wildlife and, in some areas, groundwater contamination—making year-on-year changes difficult to attribute to any single type of pollution."
        },
        {
            "text": "Newly Designated Waters Face Steeper Challenges"
        },
        {
            "text": "Many of the poorer results came from recently designated sites that were not previously managed to bathing water standards. Of the 34 waters designated since 2021, 19 were classified as Poor this year, including 17 of the 27 designated in 2024. This was expected and reflects the early stage of investigation and improvement plans in these catchments."
        },
        {
            "text": "Improvements and Deteriorations"
        },
        {
            "text": "Six bathing waters improved from Poor in 2024 to Sufficient or Good in 2025, including:"
        },
        {
            "text": "· Deal Castle"
        },
        {
            "text": "· Heacham"
        },
        {
            "text": "· St Annes North"
        },
        {
            "text": "· Coniston Water–Boating Centre"
        },
        {
            "text": "· Bridlington South Beach"
        },
        {
            "text": "· Porthluney"
        },
        {
            "text": "Some benefited from specific partnership working, such as resolving misconnections, which are sewage pipes wrongly connected to surface water drains, or reducing agricultural runoff; others likely improved due to natural changes."
        },
        {
            "text": "Two sites deteriorated from Sufficient to Poor—Haverigg, which sat close to the threshold last year, and Stoke Gabriel, designated only in 2024 and therefore assessed on a smaller dataset."
        },
        {
            "text": "Sites With Persistent Problems"
        },
        {
            "text": "Under recently amended regulations, sites with five consecutive Poor classifications no longer face automatic de-designation. Instead, a Ministerial decision is taken on whether to grant an extension."
        },
        {
            "text": "Three sites reached this milestone in 2025:"
        },
        {
            "text": "· Tynemouth Cullercoats"
        },
        {
            "text": "· River Wharfe at Ilkley"
        },
        {
            "text": "· Weston Main"
        },
        {
            "text": "Each faces complex, long-standing pressures such as groundwater contamination, agricultural runoff, sewage inputs, and wildlife impacts. Several other sites may reach the same position if they remain Poor in 2026."
        },
        {
            "text": "Pollution Sources and Key Pressures"
        },
        {
            "text": "The results highlighted five main categories of pollution affecting Poor-rated waters:"
        },
        {
            "text": "· Sewage – including storm overflows, continuous discharges and private systems."
        },
        {
            "text": "· Agriculture – particularly livestock runoff and poor soil management."
        },
        {
            "text": "· Urban diffuse pollution – including highway runoff, misconnections, and sewer exfiltration."
        },
        {
            "text": "· Wildlife – seabirds and waterfowl in some coastal and inland locations."
        },
        {
            "text": "· Other sources – such as groundwater pathways, private drainage, or natural factors like sediment."
        },
        {
            "text": "Looking Ahead"
        },
        {
            "text": "The results demonstrate significant progress, with more sites than ever meeting high standards. However, they also show that improving the most challenging locations will require sustained investment, catchment-scale collaboration and continued reforms to the way bathing waters are managed."
        },
        {
            "text": "The 2025 classifications reinforce the importance of protecting the rivers, lakes and coastal waters that people rely on for recreation, health and wellbeing—and highlight that while improvements are real, the work is far from complete."
        }
    ]
}