{
    "url": "https://defraenvironment.blog.gov.uk/2025/11/25/a-future-filled-with-trees-national-tree-week-2025/",
    "title": "A future filled with trees: National Tree Week 2025 ",
    "authors": [
        "Richard Chapman"
    ],
    "categories": [
        "Forestry",
        "Tree planting"
    ],
    "pub_date": "2025-11-25T09:10:34+00:00",
    "content": [
        {
            "text": "National Tree Week marks the opening of the tree planting season, and this year there is substantial progress to report. The theme, \"A Future Filled with Trees,\" reflects our commitment to creating lasting environmental change. Communities across England will come together during National Tree Week to plant, protect, and celebrate trees that will stand for generations. "
        },
        {
            "text": "In 2024/25 alone, we planted over 10 million trees - more than at any point in the past two decades."
        },
        {
            "text": "These trees are already delivering cleaner air, restored rivers and streams, new wildlife habitats, green jobs, and a living legacy for future generations. "
        },
        {
            "text": "Building new National Forests "
        },
        {
            "text": "We are progressing with the establishment of three new national forests. The Western Forest - stretching from the Cotswolds to the Mendips - is the first of these flagship landscapes."
        },
        {
            "text": "A second will be created in the Oxford-Cambridge corridor, with a third site to be designated in the Midlands or the North. These forests will deliver significant environmental, social, and economic benefits for generations to come. "
        },
        {
            "text": "Building resilience for the future "
        },
        {
            "text": "In September, I was fortunate to attend the opening of Forestry England's new seed processing centre at Delamere in Cheshire. This hugely impressive timber-framed, net-zero facility is the largest and most advanced in the UK. It can process up to four tonnes of tree seeds each year, with climate-controlled storage that preserves seeds for up to 20 years. This facility will significantly expand our ability to grow climate-resilient tree species that can thrive in hotter, drier conditions. I have also been able to visit woodland creation sites across the country over the last year, seeing first-hand the tremendous effort and progress being made on the ground.  "
        },
        {
            "text": "We've awarded up to £7.5 million to boost capacity and resilience within the tree production sector. Our Tree Production Innovation Fund is supporting cutting-edge technologies like AI-powered grading and vertical farming, whilst our Seed Sourcing Grant is supporting disease-resistant and climate-adapted seed orchards. "
        },
        {
            "text": "Communities at the heart of change "
        },
        {
            "text": "Whilst Government sets the strategic framework and provides funding, delivery depends on local communities, landowners, and volunteers. Working with the Tree Council, the Trees Outside Woodland fund offers grants from £10,000 to £40,000 to support tree planting projects and the infrastructure needed to sustain them. The uptake has been fantastic. Local action remains central to achieving our national objectives. "
        },
        {
            "text": "Growing skills and safeguarding heritage "
        },
        {
            "text": "This week also marks an important milestone as the first cohort of professional forester apprentices graduate from the University of Cumbria. These individuals will shape the next generation of forestry - protecting biodiversity, supporting sustainable timber production, and strengthening our green economy. "
        },
        {
            "text": "Whilst we plant for the future, we are also protecting our past. Natural England is updating the Ancient Woodland Inventory, which records England's most precious habitats - woodlands that have existed for over 400 years."
        },
        {
            "text": "We have now completed half this work, adding 25,000 hectares and identifying over 52,000 ancient woodland sites. For the first time, the inventory includes Ancient Wood Pasture and Parkland sites, helping us safeguard what cannot be replaced. "
        },
        {
            "text": "Real environmental benefits "
        },
        {
            "text": "The impact of our work is measurable. "
        },
        {
            "text": "Research from Liverpool John Moores University shows that the initial stages of the Nature for Climate fund will absorb up to 1.6 million tonnes of CO2 - the equivalent of taking nearly 92,000 cars off the road for their entire lifetime. It will expand ecological networks by an area up to 11 times the size of Lake Windermere and improve air and water quality across England. Our £1 billion commitment will amplify this impact considerably. "
        },
        {
            "text": "And we’re working to make sure the research we are investing in gets the attention it deserves. Over 200 people including academics, practitioners, policy makers and environmental NGOs came together in Durham earlier this month to hear about the latest research from the Nature for Climate Fund, our Plant Health team and Treescapes programme to think about how we can apply it into practice. It was fantastic to be part of such a rich and energised set of conversations helping to challenge us all to think about next steps. "
        },
        {
            "text": "Taking action "
        },
        {
            "text": "Trees deliver multiple public benefits. They improve our air quality, protect our watercourses, enhance biodiversity and create stronger connections between people and place. They represent our commitment to stewardship beyond a single generation. "
        },
        {
            "text": "I would like to take a moment to thank everyone involved in this work - through our collective hard work we are achieving a huge amount. This year’s 50th anniversary of National Tree Week is a wonderful opportunity to celebrate all things trees."
        },
        {
            "text": "Whether as part of an organisation, a community group or individually, National Tree Week gives us all an opportunity to get involved."
        },
        {
            "text": "Together, we are creating a future filled with trees. Find out more at National Tree Week."
        }
    ]
}