{
    "url": "https://mhrainspectorate.blog.gov.uk/2025/11/25/contamination-control-reminder-managing-bacillus-risks-in-aseptic-processing/",
    "title": "Contamination Control Reminder: Managing Bacillus Risks in Aseptic Processing",
    "authors": [
        "Chris Jones",
        "Martine Powell",
        "Himal Makwana"
    ],
    "categories": [
        "Good manufacturing practice"
    ],
    "pub_date": "2025-11-25T14:04:45+00:00",
    "content": [
        {
            "text": "The MHRA’s inspectorate and the Defective Medicines Report Centre (DMRC) are actively liaising with NHS and Specialist Pharmacy Services (SPS), following an increase in reports of Bacillus contamination in aseptic facilities. While no firm link has been identified between these reports, previous instances have been linked to inadequate sanitisation of raw materials and consumables used in the manufacturing procedures."
        },
        {
            "text": "Reports have been received from NHS Trusts operating under both Manufacturer’s “Specials” (MS) Licences and Section 10 Exemptions."
        },
        {
            "text": "For reference, guidance on the manufacture of unlicensed medicinal products (“specials”) is available here: manufacture of specials"
        },
        {
            "text": "Bacillus is a genus of environmental bacteria that includes several pathogenic species, such as B. cereus. These organisms are ubiquitous and are notable for their ability to produce spores that are resistant to standard alcohol-based spray-and-wipe cleaning methods."
        },
        {
            "text": "Effective decontamination requires the use of sporicidal agents, particularly on the external surfaces of component materials. Sites should review their contamination control strategies, with particular focus on the transfer of materials into cleanrooms and the validation and routine effectiveness of sporicidal sanitisation methods."
        },
        {
            "text": "Sites are also strongly encouraged to review the MHRA’s May 2025 communication to MS Licence holders on aseptic operations, which sets out key regulatory expectations for contamination control and environmental monitoring: MHRA Letter to MS Licence Holders – Aseptic Operations (May 2025) .  This letter outlines regulatory expectations and reinforces the importance of robust sporicidal cleaning protocols in aseptic environments. Holders of manufacturing licenses must report defective medicines to the DMRC. Instances where contamination by Bacillus spp.  including morphologically similar microorganisms, is identified or suspected in Grade A or B environments, will be used  to support national trend analysis and root cause investigations. Sites operating under Section 10 Exemption must also notify their SPS or National QA teams if Bacillus is recovered in Grade A or Grade B environments. These notifications will also feed into the investigations."
        }
    ]
}