{
    "url": "https://charitycommission.blog.gov.uk/2025/11/25/getting-consent-for-charity-changes-the-commissions-role-in-supporting-trustees/",
    "title": "Getting consent for charity changes: the Commission’s role in supporting trustees",
    "authors": [
        "Christine Barker"
    ],
    "categories": [
        "Data",
        "Governance",
        "Regulation"
    ],
    "pub_date": "2025-11-25T12:09:42+00:00",
    "content": [
        {
            "text": "A £1bn collection of Chinese ceramics is now permanently at home in the British Museum, following a significant piece of consent granted by the Commission earlier this year. In March, we gave authority to the trustees of the Sir Percival David Foundation to amend their governing document, enabling them to donate the collection assembled by Sir Percival David across Europe, Japan, Hong Kong and China before his death in 1964."
        },
        {
            "text": "The collection had been on loan to the British Museum since 2009 and had been enjoyed by millions of visitors. By transferring the costs of maintaining the collection to the museum, the trustees were able to manage the charity’s resources effectively and ensure that examples of the finest Chinese craftsmanship could remain on public view, in line with their founder’s wishes."
        },
        {
            "text": "What is regulatory authority or ‘permissions’ casework?"
        },
        {
            "text": "This is an example of permissions casework – a crucial part of our regulatory role that enables well-run charities to adapt and thrive."
        },
        {
            "text": "Trustees come to us when they want to make changes to their governing documents, dispose of assets, merge with another organisation, or take other significant steps that fall outside their existing legal powers."
        },
        {
            "text": "It is distinct from our compliance and investigatory work, where we assess concerns about potential wrongdoing. Instead, this work is about empowering trustees who are acting in good faith to do what’s best for their charities and beneficiaries."
        },
        {
            "text": "The scale and breadth of this work"
        },
        {
            "text": "The scale of our permissions casework is significant, and we receive a high volume of applications every year. Our latest quarterly data shows that across July to September 2025 we considered 1,667 applications and granted 747 permissions. Adding the 734 granted in the previous quarter, that's almost 1,500 so far this year – averaging almost 57 separate permissions granted per week. Each enables trustees of charities, large and small, to take both routine actions and highly significant steps."
        },
        {
            "text": "The range and complexity of cases varies enormously as there are over 40 different types of consent we can give. Sometimes we need to provide trustees with advice or ask them for further information to help us decide whether we can give the authority. Some consents can be given with minimal engagement with the trustees, whilst others involve months of detailed work with trustees and multiple stakeholders to achieve complex outcomes."
        },
        {
            "text": "Protecting trustees facing threats"
        },
        {
            "text": "We have seen a significant rise in applications from trustees to remove their legal names from public display because the nature of their charities' work puts them in fear of threat or harm."
        },
        {
            "text": "In the summer of 2024, several charities were at risk from riots and public disorder after the atrocities in Southport. We took the unusual step of removing some trustee details for two weeks because of the immediate risk to charity premises and staff. In August this year we removed the names of trustees from several refugee charities after a far-right influencer named these charities in a YouTube broadcast, leaving trustees feeling unsafe and at risk of personal danger."
        },
        {
            "text": "In both instances we agreed to remove trustee details from the information available on the register of charities. This enabled those trustees to continue their important work without fear for their personal safety."
        },
        {
            "text": "Securing heritage for future generations"
        },
        {
            "text": "Recently, the Commission acted quickly to help to secure the future of Ironbridge Gorge Museums in Shropshire. This important tourist destination with UNESCO World Heritage status, run by Ironbridge Museum Trust, has seen fewer visitors since the pandemic. The high cost of running 10 museums and caring for 35 listed buildings put the charity into financial difficulty. Consequently, the trustees concluded that the best long-term solution for financial stability would be for the charity to transfer its museums and property to the care of the National Trust, a much larger organisation with similar charitable purposes."
        },
        {
            "text": "Our team worked with the trustees to provide the permissions needed to facilitate the transfer, which will take place in the spring of 2026. The National Trust has secured a £9 million Government grant that will enable it to take on the care of the site and secure it for future generations."
        },
        {
            "text": "Using new powers from the Charities Act 2022"
        },
        {
            "text": "Following the implementation of the Charities Act 2022, the Commission gained some new powers that have enabled us to help charities in situations that would previously have required costly court proceedings."
        },
        {
            "text": "We first used one of these powers to help a Parish Council resolve a misunderstanding dating back to 1973 that was preventing them from appointing new trustees to run a village hall that was important to the community. They had also unwittingly been operating outside the terms of the governing document for many years."
        },
        {
            "text": "By using a discretionary power (section 184b of the Charities Act), we were able to remedy the situation by validating the trustee appointments and the Parish Council's actions undertaken since 1973, which had been carried out in good faith. This avoided the need for costly court proceedings and meant the village hall could continue serving its community."
        },
        {
            "text": "Why timing matters"
        },
        {
            "text": "The breadth of cases we handle from agreeing changes to governing documents to complex heritage mergers, from protecting threatened trustees, to resolving decades-old governance issues – demonstrates both the importance and complexity of regulatory authority casework."
        },
        {
            "text": "We can move very quickly to provide authority in exceptional circumstances when trustees can demonstrate urgency because funding or their charities’ beneficiaries may be at risk. But where this is not the case, we are unable to work at the same pace. This underlines how important it is that when trustees are planning to make changes that require our authority, they come to us in good time so we can do all the necessary work to consider their applications and provide our decisions in line with any deadlines they may have."
        },
        {
            "text": "Empowering trustees to evolve their services and ways of working is a responsibility we take seriously. Each of the almost 1,500 permissions we've granted so far this year represents a charity that can now move forward with confidence, knowing they have the legal authority to act in the best interests of their beneficiaries."
        }
    ]
}