{
    "url": "https://mhrainspectorate.blog.gov.uk/2025/11/25/insurance-review-in-phase-1-clinical-trials/",
    "title": "Insurance Review in Phase 1 Clinical Trials",
    "authors": [
        "Rachel Mead",
        "Alastair Nicholson"
    ],
    "categories": [
        "Uncategorized"
    ],
    "pub_date": "2025-11-25T12:25:24+00:00",
    "content": [
        {
            "text": "On 28 April 2026, new regulations for Clinical Trials will come into effect - the most significant updates in two decades. To support a smooth transition, the Medicines and Healthcare products Regulatory Agency (MHRA) and the Health Research Authority (HRA) are working together to provide updated guidance and information about key changes for industry."
        },
        {
            "text": "In this joint blog, we set out to clarify the insurance requirements for Phase 1 clinical trials."
        },
        {
            "text": "Sponsors’ liability "
        },
        {
            "text": "For Clinical Trials of Investigational Medicinal Products (CTIMPs), in accordance with Part 2 (14) of Schedule 1 to UK Statutory Instrument 2004/1031, The Medicines for Human Use (Clinical Trials) Regulations and its subsequent amendments, the following condition applies:"
        },
        {
            "text": "‘Provision has been made for insurance or indemnity to cover the liability of the investigator and sponsor which may arise in relation to the clinical trial’ (and Part 2 (4) of Schedule 1 of UK Statutory Instrument 2025/5 which comes into effect on 28 April 2026. It is a requirement, that ‘any document providing evidence of insurance to cover liability of the sponsor or investigator’ be included with the Research Ethics Committee (REC) application, to comply with Regulation 15 (5 J) of SI 2004/1031 (and Part A1 (f) of Schedule 3 of UK Statutory Instrument 2025/538 which comes into effect on 28 April 2026 will include ‘proof of insurance, a guarantee, or any other similar arrangement’)."
        },
        {
            "text": "Responsibilities"
        },
        {
            "text": "The sponsor is responsible for ensuring that it has in place adequate insurance or indemnity to cover its potential liabilities arising from the design and management of the clinical trial."
        },
        {
            "text": "The REC is informed of the nature of this cover and is provided with evidence of any insurance procured by the sponsor for this purpose."
        },
        {
            "text": "Research sites are responsible for making arrangements for insurance or indemnity to cover potential liabilities arising from their conduct of the clinical trial."
        },
        {
            "text": "For Phase 1 trials being conducted outside of the NHS, research sites, including   Clinical Research Organisations (CROs) or Phase 1 Trial Organisations, should not rely upon the REC's favourable opinion alone to understand the details of the insurance or indemnity provided by the sponsor."
        },
        {
            "text": "For Phase 1 trials being conducted in NHS organisations, the UK study-wide review includes a check of sponsor insurance, to ensure that the insurance is appropriate to the clinical trial, with no inappropriate exclusions to its cover (or a statement is received from the sponsor to confirm that there are no exclusions).  Any relevant change to the insurance arrangements would constitute a substantial and study-wide reviewable amendment (modification from 28 April 2026) and be notified to the REC and a study-wide reviewer for review. NHS organisations should not duplicate these checks."
        },
        {
            "text": "Ensure you have appropriate cover in place"
        },
        {
            "text": "During recent good clinical practice (GCP) inspections, several examples have been identified where CROs and Phase 1 Trial Organisations have not undertaken a suitable check of the insurance cover for the trial because there has been an assumption that the REC has reviewed the suitability of the cover.  However, the review by the REC is only to determine that cover exists."
        },
        {
            "text": "Non-NHS Phase 1 sites should ensure that sponsor insurance or indemnity is appropriate to the clinical trial, with no inappropriate exclusions for each individual trial, and checks should also be undertaken on annual policy renewals."
        },
        {
            "text": "The checks for acceptability of cover and impact of any exclusions should be documented, signed off by a suitably trained and experienced individual and filed in the Trial Master File (TMF)."
        },
        {
            "text": "If any exclusions to cover, means that certain individuals would not be appropriately covered if they participated in the trial, robust arrangements should be made to ensure that they are not included (it would usually be expected that this is accounted for in the clinical trial inclusion/exclusion criteria, but research sites should be prepared to make additional arrangements where necessary).  "
        },
        {
            "text": "These checks are to demonstrate due diligence by the CRO and Phase 1 Trial Organisations that the insurance arrangements are adequate and sufficiently cover the participant population and IMPs being administered."
        },
        {
            "text": "Help and guidance"
        },
        {
            "text": "You will find the latest MHRA guidance in the Clinical Trials hub."
        },
        {
            "text": "Access HRA guidance on changes to clinical trials regulations."
        },
        {
            "text": "If you can’t find what you are looking for and need assistance from the MHRA, email ctdhelpline@mhra.gov.uk."
        },
        {
            "text": "Contact the HRA by emailing queries@hra.nhs.uk."
        }
    ]
}