{
    "url": "https://hmlandregistry.blog.gov.uk/2025/11/25/more-hm-land-registry-customers-are-saving-time-and-money-with-right-first-time-applications/",
    "title": "More HM Land Registry customers are saving time and money with right-first-time applications",
    "authors": [
        "Andrew Robertson, Head of Customer Policy and Service Improvement"
    ],
    "categories": [
        "Buying and selling property",
        "Data",
        "Digital services",
        "Law and practice"
    ],
    "pub_date": "2025-11-25T17:17:31+00:00",
    "content": [
        {
            "heading": 2,
            "text": "At a glance "
        },
        {
            "heading": 2,
            "text": "Why this matters "
        },
        {
            "text": "Requisitions cause delays that cost customers and their clients time and money. They also reduce the number of applications our caseworkers can deal with, and increase the time it takes to complete them. Reducing requisitions by improving application quality helps everyone by speeding up applications and improving accuracy. "
        },
        {
            "text": "In May, we emailed all qualifying customers with details of their avoidable requisitions along with links to free training and support. We also set out our plan to publish every firm’s overall avoidable requisition rate on GOV.UK, which we’ll do in December. Customers have welcomed this information and we want to make sure everyone has access as and when they need it. "
        },
        {
            "heading": 2,
            "text": "What are avoidable requisitions? "
        },
        {
            "text": "Requisitions – or queries on applications – can be divided into: "
        },
        {
            "text": "We have identified 30 of the most common administrative mistakes, from missing documents and witness details to incomplete or unsigned forms, as avoidable requisitions, which could be addressed before sending in the application. "
        },
        {
            "text": "This year, we began identifying avoidable requisitions from the overall total to help customers focus on what can be prevented before submission. In May we sent all customers details of their own avoidable requisitions, offering support in the form of training and our specialist support services. "
        },
        {
            "heading": 2,
            "text": "Progress so far "
        },
        {
            "text": "This is promising news for the sector, and we thank everyone for working hard to reduce requisitions. "
        },
        {
            "heading": 2,
            "text": "What we’re doing to help "
        },
        {
            "text": "We continue to develop and enhance our free training and guidance for customers: "
        },
        {
            "text": "And we’re introducing systemic improvements that benefit all customers: "
        },
        {
            "heading": 2,
            "text": "What’s next "
        },
        {
            "text": "In December, we will publish updated avoidable requisition data alongside our existing requisition dataset on GOV.UK. This will include: "
        },
        {
            "text": "We will also email firms with 10 or more completed applications between April and September 2025 with their individual figures. These emails will go to the main contact for each firm, so please alert your responsible user and update their details if necessary.  "
        },
        {
            "heading": 2,
            "text": "Resources to help "
        },
        {
            "text": "We offer free guidance, including: "
        },
        {
            "text": "Research shows only 40% of customers know these resources exist. If you haven’t explored them yet, visit our training hub. "
        },
        {
            "text": "*Qualifying customers are those who had 10 or more completed applications in the six-month period analysed, excluding discharges submitted via Portal E-DS1 and EDs.  "
        }
    ]
}