{
    "url": "https://defraenvironment.blog.gov.uk/2026/01/29/building-on-success-funding-for-new-ocean-projects/",
    "title": "Building on success: funding for new OCEAN projects",
    "authors": [
        "Ilona Drewry"
    ],
    "categories": [
        "Climate change",
        "Community",
        "Marine",
        "Nature"
    ],
    "pub_date": "2026-01-29T10:54:53+00:00",
    "content": [
        {
            "text": "I’m Ilona, and I work in the International Biodiversity and Climate team at Defra, leading on blue finance policy and international marine programmes. "
        },
        {
            "text": "In November 2024 at COP29, I shared the 20 projects we'd funded through the first round of our Ocean Community Empowerment and Nature (OCEAN) Grants Programme.  "
        },
        {
            "text": "Today, I'm delighted to be back with an update that we're building on first round success and awarding £14 million to community projects through the second funding round. "
        },
        {
            "text": "What's happened since COP29? "
        },
        {
            "text": "Our first round projects have been busy – in only one year of implementation, they've protected and restored more than 93,000 hectares of key ecosystems.  "
        },
        {
            "text": "From training in waste management to reduce pollution at its source, to putting local people at the heart of decision making, these projects are empowering coastal communities to protect and restore their marine environments. "
        },
        {
            "text": "In Bangladesh, the FISHNET project has helped lay the groundwork for the first community-managed Marine Protected Area. The project, which is dedicated to addressing the root causes of poverty among marginalised fisherfolk communities and combating the degradation of marine ecosystems, has organised 20,000 local people into community groups. The elected leaders of these groups are able to act as strong advocates for their communities and conservation of their environment. They have been engaging with local government and in doing so, previously excluded groups are beginning to shape decisions on resource management. "
        },
        {
            "text": "Our ZSL supported project in Northern Mozambique is working to establish a socio-ecological corridor of 20 Locally Managed Marine Areas along Nampula province’s 450km coastline – bringing valuable economic and livelihood benefits that coastal habitats provide. This is done through, sustaining biodiversity and supporting the recovery of sites more vulnerable to coral bleaching, while improving the management of food stocks that local communities depend on. "
        },
        {
            "text": "The project will strengthen the capacity of Fisheries Community Councils to support sustainable fishing practices. Already, through the training of oyster farmers, 112,000 oysters have been sustainably cultivated for collection. "
        },
        {
            "text": "Launching Round 2  "
        },
        {
            "text": "Like the first round, these grants will back locally led projects that protect precious marine habitats and support livelihoods in coastal communities worldwide.  "
        },
        {
            "text": "We're funding local solutions to local problems.   "
        },
        {
            "text": "In Ecuador, the Illuminar el Mar project is helping reduce the accidental capture of turtles, sharks, rays and whales in small-scale gillnet fishing by up to 73% through the innovative use of Green LED lighting in gillnets. Led by the Mare Nostrum Foundation, the project is working with University College London to develop a new, battery-free LED light technology for netting that aims to be longer-lasting and better for the environment. They're also providing training and support for women, young people, people with disabilities and marginalised groups. "
        },
        {
            "text": "Over in the Philippines, we're funding two brilliant projects tackling plastic pollution. Eco Kolek will expand its inclusive waste recovery system to reach 12,000 households and small businesses in on the island of Palawan, Western Philippines, and neighbouring island communities, diverting an estimated 1,100 tonnes of plastic away from landfill and the ocean. "
        },
        {
            "text": "Meanwhile, Resiklo Machine Shop is rolling out community-led, solar-powered recycling hubs that turn marine and household plastic waste into durable products for local use and sale. "
        },
        {
            "text": "Why this matters "
        },
        {
            "text": "The ocean is critical for climate regulation, biodiversity and livelihoods, yet it receives less than 1% of global Official Development Assistance.  "
        },
        {
            "text": "Communities on the frontline of climate change need support to protect their marine environments they depend on for food, income and protection from extreme weather. Project funding through OCEAN is used for piloting and scaling locally led approaches. They build capacity within communities for local solutions to challenges faced in their marine environments and generate important learning to share internationally. "
        },
        {
            "text": "For more information on Round 2, keep an eye on the OCEAN website for updates on how these projects progress. "
        },
        {
            "text": "And visit the OCEAN grants project page if you’re interested in finding out more about OCEAN round 1 projects.  "
        }
    ]
}