{
    "url": "https://dragonsden.blog.gov.uk/2026/01/29/dragons-den-ip-blog-series-23-episode-1/",
    "title": "Dragons Den IP Blog - Series 23 Episode 1",
    "authors": [
        "Meg Davies"
    ],
    "categories": [
        "Business",
        "Copyright",
        "Designs",
        "IP",
        "Licensing",
        "Trade marks"
    ],
    "pub_date": "2026-01-29T21:00:00+00:00",
    "content": [
        {
            "text": "When the winter nights are cold, dark and stormy, something warm and cosy on a Thursday night is always appreciated. Well, there’s nothing hotter than the fire of the Dragons – and nothing more heart-warming than seeing entrepreneurs' dreams being realised as the Dragons invest in businesses that mean so much to them. So, seeing the new series back on our screens, I grabbed a warm beverage and the last of the Christmas chocolate to see what this year’s entrepreneurs would have in store."
        },
        {
            "text": "The Den is looking a little different this season, as Sara Davies has left the Dragons’ lair. A new guest Dragon will be joining each week, and for this episode the guest was Jenna Meek, CEO of beauty brand REFY® who was ready and waiting to meet tonight’s band of keen hopefuls."
        },
        {
            "heading": 3,
            "text": "Fluff, flair and a fiery deal"
        },
        {
            "text": "The first entrepreneur who excitedly entered the famous lift was Chloe Messer, founder of Hat ‘n’ Spicy – a maximalist accessories brand that specialises in making custom, made to order upcycled fluffy hats from sustainable materials. Chloe came to impress, with a custom hat for each Dragon. Seeing the Dragons each donning a large fluffy hat certainly made them seem less intimidating! She was asking the Dragons for £50,000 in exchange for a 15% stake of her business.  "
        },
        {
            "text": "The panel got straight to it with their usual probing questions, and there was certainly interest in the Den and the entrepreneur – who Jenna commented had ‘something special’ about her.  "
        },
        {
            "text": "Not all of the Dragons were feeling hot about the hat investment potential – but luckily for Chloe, two of them were biting. Original Dragon Peter Jones and retail mogul Touker Suleyman agreed to enter a partnership, each contributing £25,000 for 15%. Despite agreeing to double the equity she had originally hoped to part with, the entrepreneur jumped at the offer and accepted, hopefully keeping the pair in fluffy headwear for life."
        },
        {
            "heading": 3,
            "text": "Picture-perfect pitching"
        },
        {
            "text": "Next to enter the Den was Murad Huseynov, seeking a £70,000 investment in return for a 4% stake in his business Mosaic Journal. The company delivers a photo album and has a corresponding app where you can upload a memory each day. Once a month , the photos you chose for the month get delivered straight to your door, ready to slot in, to create a journal of your life in pictures. This idea certainly appeals to me. I have, admittedly, too many photos in my camera roll and love reflecting on some of my favourite memories."
        },
        {
            "text": "Murad had certainly captured the attention of the Dragons, and it was Deborah Meaden and Steven Bartlett who wanted to get in on the picture. Deborah made the first offer – all of the money that the entrepreneur had been hoping for, in exchange for a 12% stake. Social media king Steven Bartlett was next, but asking for an additional 3%."
        },
        {
            "text": "Due to the social nature of the app that Murad created, after attempting to negotiate he asked Steven one simple question – do you love it? “Yes, I love it” replied Steven, confirmation enough for the owner of Mosaic Journal that the collaboration was worth parting ways with the greater equity share. They shook hands on the deal of 15% for an investment of £70,000."
        },
        {
            "heading": 3,
            "text": "A fierce finale"
        },
        {
            "text": "The final pitch of the night was Gulshen Bano, CEO of Strike Back Self Defence®; a business founded in a personal story that helps females to stay safe by teaching easy-to-learn self-defence skills. Gulshen was hoping for a £25,000 investment in exchange for a 10% stake of her franchise business."
        },
        {
            "text": " The Den had many questions for Gulshen around her franchise, but I had just one – does she have registered trade marks? A quick look on our trade mark search tool reveals that she has wisely protected this part of her IP. She has registered trade marks for her name and logo, as well as for one further logo that is currently under examination."
        },
        {
            "text": "What an episode! All that IP has certainly warmed me up on this January evening, and I can’t wait to see what the rest of the season and the guest Dragons have in store. The best way to hear about red hot businesses and IP straight to your inbox is to sign up to receive emails when we release new Dragons’ Den blogs. See you next week – same time, same place!"
        },
        {
            "text": "Disclaimer:"
        },
        {
            "text": "The purpose of the IPO's Dragons' Den IP blog is to help identify the IP in entrepreneurs’ pitches and highlight how IP works, or could work, in the real-life examples featured. IPO’s authorship of this blog does not constitute its endorsement or sponsorship of any products, individuals or businesses referenced within it. "
        }
    ]
}