{
    "url": "https://ofsi.blog.gov.uk/2026/01/29/new-and-updated-enforcement-framework-a-message-from-giles-thomson-director-of-ofsi/",
    "title": "New and updated enforcement framework – a message from Giles Thomson, Director of OFSI",
    "authors": [
        "OFSI"
    ],
    "categories": [
        "OFSI Blog"
    ],
    "pub_date": "2026-01-29T12:08:45+00:00",
    "content": [
        {
            "text": "Today, 29 January 2026, we are publishing OFSI’s public consultation response on proposed changes to our enforcement processes. Under our revised framework, these changes will support compliance, give firms greater certainty and ensure our approach to enforcing financial sanctions is fair, effective and robust."
        },
        {
            "text": "In 2025, a cross-government review of sanctions implementation and enforcement identified ways to further strengthen UK sanctions and increase the deterrent effect of enforcement. As part of that review, we identified five proposals to make resolving enforcement cases quicker, easier and more transparent. OFSI sought feedback through a 12-week public consultation, including by running a webinar with 615 participants to share information and seek feedback. I want to thank those who engaged with the consultation. These measures are better and will be more effective as a result of that engagement. We intend to proceed with all proposals from the original consultation, incorporating feedback from responses to the consultation. Proposals not requiring legislation will come into effect when OFSI’s updated Enforcement and Monetary Penalties guidance is published in February 2026."
        },
        {
            "text": "Enforcement of financial sanctions is a critical part of OFSI’s work in promoting and improving compliance. Robust and proportionate enforcement supports the integrity of the UK’s financial system and helps sanctions achieve their overall objectives to advance the UK’s foreign and security priorities. Over the past 12 months, we have imposed five penalties and issued two Disclosures for breaches of financial sanctions. While penalties are the most visible aspect of our enforcement activity, many other cases have been resolved through warning letters, engagement with firms, or no further action outcomes where appropriate."
        },
        {
            "text": "Over the past decade, there has been a significant increase in both the volume and complexity of enforcement investigations, largely following Russia’s illegal invasion of Ukraine in February 2022. As of April 2025, OFSI had 240 active cases under investigation, up from 172 as of April 2023. The changes we are making now will ensure that OFSI is in the best possible position to enforce financial sanctions in a more focused, responsive, and efficient posture."
        },
        {
            "text": "We will bring this number down by prioritising those cases which have the greatest deterrent or compliance impact. This does not always mean cases of the highest value. When considering which cases to prioritise, we will focus on those that: "
        },
        {
            "text": "Alongside a reduction in the number of cases being pursued at any one time, we will increase the speed at which we investigate cases. This will be done through a variety of means, but the Early Account Scheme will be one way we aim to expedite investigations where appropriate.  "
        },
        {
            "text": "Where OFSI decides to take enforcement action following an investigation, resolving cases through the Settlement Scheme means getting outcomes and the lessons of those outcomes into the public domain quicker. Faster outcomes allow OFSI to be more responsive to new risks or the heightened importance of different sanctions regimes, and for subjects to resolve uncertainty more quickly and focus their efforts on improving their compliance rather than responding to an investigation."
        },
        {
            "text": "As set out in the consultation response, OFSI will make the following improvements to how we enforce against breaches of financial sanctions:  "
        },
        {
            "text": "All proposals, except for changes to the statutory maximum penalty amount, will be implemented in the coming weeks through updates to OFSI’s public enforcement guidance. The updated guidance will explain how these updates to our enforcement processes will operate in practice, as well as simplifying and streamlining the guidance more widely. Once businesses have had time to digest both OFSI’s consultation and the forthcoming guidance, we will be hosting a webinar for interested parties. Changing the statutory maximum amount for civil monetary penalties requires legislative change and will be brought forward when parliamentary time allows."
        },
        {
            "text": "Alongside the changes we will be introducing next month, we will also start moving towards a model where we have greater dialogue with the subjects of enforcement action in some of the more serious cases we pursue. Whilst our primary means for gathering information from subjects will still be in writing, we want to give subjects the opportunity to provide relevant and useful information to OFSI in the most effective way possible. This may include meetings to discuss the technical details of a case or wider information which might assist OFSI in its investigation. "
        },
        {
            "text": "We will continue to review our enforcement guidance, policies and approach to ensure they best reflect and deliver our objectives. We are, as ever, open and keen to engage with businesses and stakeholders to ensure our guidance and decision-making is clear.  "
        },
        {
            "text": "In the meantime, to keep up with all sanctions enforcement-related matters, I encourage you to visit the recently launched GOV.UK webpage dedicated to enforcement. We hope you will find this consolidated resource helpful to gain compliance lessons from, including from cases from April and May of last year. "
        },
        {
            "text": "If you have any questions about this blog, please email ofsi@hmtreasury.gov.uk."
        }
    ]
}