{
    "url": "https://cyberandspecialistoperationscommand.blog.gov.uk/2026/01/29/operation-austral-endurance-building-antarctic-capability-through-cooperation/",
    "title": "Operation AUSTRAL ENDURANCE: Building Antarctic capability through cooperation",
    "authors": [
        "bobsendall"
    ],
    "categories": [
        "Uncategorized"
    ],
    "pub_date": "2026-01-29T07:44:13+00:00",
    "content": [
        {
            "text": "BFSAI personnel based at Mount Pleasant Complex have worked with Chilean counterparts and UK partners to strengthen safe, treaty‑compliant access to one of the world’s most demanding operating environments."
        },
        {
            "heading": 3,
            "text": "Background and direction"
        },
        {
            "text": "In December 2025, the Defence Single Tasking Authority directed BFSAI to conduct an overflight of the British Antarctic Territory during the Austral summer season ending March 2026. The task formed part of the UK’s routine, treaty‑compliant presence and helped mitigate the temporary absence of HMS PROTECTOR from the region. The intent is to continue building Antarctic cooperation and capability, strengthening the UK’s ability to support British Antarctic Survey and conduct safe, effective operations in the region."
        },
        {
            "heading": 3,
            "text": "Why it matters"
        },
        {
            "text": "In line with Commander British Forces South Atlantic Islands’ mission to safeguard UK interests and sovereignty while operating within international agreements, Operation AUSTRAL ENDURANCE contributes to the UK’s long‑standing presence in and around the British Antarctic Territory (BAT). The operation focused on support to science, the environment, flight safety and multinational cooperation—practical foundations that enable the UK to meet its Antarctic Treaty obligations while maintaining presence, access and logistical reach in the region. "
        },
        {
            "text": "Commander British Forces South Atlantic, Brigadier Charlie Harmer said:"
        },
        {
            "heading": 3,
            "text": "Partnering in Chile"
        },
        {
            "text": "The team’s engagement began in Santiago, where RAF personnel met the Chilean Air Force for a professional exchange on Antarctic flying. A joint brief set out the importance of the Antarctic Treaty, which dedicates the continent to peace and science, permits the use of military personnel and assets only for peaceful purposes (such as logistics, SAR and scientific support), and leaves territorial questions frozen while cooperation continues."
        },
        {
            "text": "Discussions then moved into flying practice: visibility and horizon contrast over ice, altitude selection, weather avoidance, and contingency planning far from alternate landing sites. To deepen practical cooperation, a Chilean Air Force captain joined the UK crew for the southern sortie, providing regional expertise, language support and local procedures—a straightforward step that measurably improved situational awareness and flight safety."
        },
        {
            "heading": 3,
            "text": "Into the South"
        },
        {
            "text": "From Punta Arenas, the RAF team departed with the UK Defence Attaché to Chile and their Chilean Air Force counterpart on board for a 12‑hour round‑trip to the Antarctic region. The route included two key waypoints of interest, BAS’s Sky Blu and Rothera Research stations, before transitioning to maritime integration."
        },
        {
            "text": "Low‑level cloud and intermittent visibility complicated the final phase, but the crew successfully established contact with RRS Sir David Attenborough, demonstrating the UK’s ability to integrate air and maritime assets to support national scientific endeavour. In conditions where contrast, wind shear and icing can change quickly, the combined expertise of the cockpit team—UK and Chilean—proved invaluable."
        },
        {
            "heading": 3,
            "text": "Enabling reach: Voyager air‑to‑air refuelling"
        },
        {
            "text": "None of this would have been possible without Voyager support. A tanker departed Mount Pleasant Complex, rendezvoused with the A400M, and delivered the critical air‑to‑air refuelling required for the sortie’s range and reserves. This was a textbook example of theatre enablers extending the safe operating envelope for Antarctic missions while maintaining prudent fuel margins and diversion options."
        },
        {
            "heading": 3,
            "text": "Strategic objectives in practice"
        },
        {
            "text": "Operation AUSTRAL ENDURANCE is part of the Ministry of Defence’s contribution to UK activity in the South Atlantic and Antarctica, alongside the Ice Patrol Ship HMS PROTECTOR. It supports British Antarctic Survey (BAS) operations and aligns with the Operate Programme Directive 2024 outcome to protect UK interests in the BAT and fulfil British obligations under the Antarctic Treaty."
        },
        {
            "text": "The activity enhances UK presence, access and logistical cooperation with BAS and regional partners, building the experience and capability required for future Antarctic operations. It also reinforces that UK assets based in the Falkland Islands contribute strategically to South Atlantic security, cooperation and scientific support, as well as the defence of the Falkland Islands."
        },
        {
            "heading": 3,
            "text": "Outcomes and learning"
        },
        {
            "heading": 3,
            "text": "What is the Antarctic Treaty?"
        },
        {
            "text": "Signed in 1959 and entering into force in 1961, the Antarctic Treaty sets Antarctica aside for peace and science. It prohibits military activity for hostile purposes but allows the use of military personnel and equipment for peaceful tasks such as logistics, research support and search and rescue. Existing territorial claims are neither recognised nor denied; instead, they are held in abeyance to enable practical cooperation and scientific progress. Operation AUSTRAL ENDURANCE is conducted fully within this framework."
        },
        {
            "heading": 3,
            "text": "With thanks to our partners"
        },
        {
            "text": "Captain Jason White QGM RN, UK Defence Attache to Chile said:"
        },
        {
            "text": "BFSAI acknowledges the Chilean Air Force for their professional collaboration and cockpit support, BAS and the crew of RRS Sir David Attenborough for coordination at sea, the UK Defence Section in Chile for facilitation, and RAF Voyager and A400M crews at Mount Pleasant Complex for enabling reach and resilience."
        }
    ]
}