{
    "url": "https://vmd.blog.gov.uk/2026/01/29/strengthening-antimicrobial-resistance-surveillance-in-pets-and-horses/",
    "title": "Strengthening antimicrobial resistance surveillance in pets and horses",
    "authors": [
        "Tamsin Dewé"
    ],
    "categories": [
        "Antimicrobial Resistance (AMR)",
        "VMD Voices"
    ],
    "pub_date": "2026-01-29T11:11:06+00:00",
    "content": [
        {
            "heading": 2,
            "text": "VMD Voices: Our Experts Explain"
        },
        {
            "text": "Welcome to the first post in our new series, 'VMD Voices: Our Experts Explain'. In this series, you'll hear from specialists across the Veterinary Medicines Directorate (VMD), from scientists and vets to enforcement and intelligence officers."
        },
        {
            "text": "In the first post we hear from Dr. Tamsin Dewé, the VMD’s Head of Antimicrobial Resistance (AMR) Surveillance and Evidence. Tamsin shares how the VMD is working to close critical gaps in AMR surveillance in two animal groups where companionship between humans and animals really matters: pets and horses.  "
        },
        {
            "heading": 2,
            "text": "About Tamsin"
        },
        {
            "text": "I’m an epidemiologist and veterinarian, and I’ve been interested in infectious diseases since I first qualified as a vet. After several years in clinical practice in Australia, South Africa, and the UK, I moved into disease control and epidemiology by way of masters degrees at the Royal Veterinary College and Imperial College London. I’ve been working exclusively on AMR since I started my PhD at Imperial in 2015, which focused on mathematical and statistical modelling of the associations between antimicrobial use and resistance in different populations. This work has given me a deep understanding of AMR evolution and spread, and I’ve been bringing this expertise to bear in my current role since 2020."
        },
        {
            "heading": 2,
            "text": "Why do we need AMR surveillance?"
        },
        {
            "text": "Surveillance is important because it allows us to monitor trends, detect emerging issues, identify effective interventions to mitigate AMR, and assess their impact. My team’s mission is twofold:"
        },
        {
            "heading": 2,
            "text": "Why monitor AMR in companion animals?"
        },
        {
            "text": "Pets live in close contact with people, often sharing our homes and daily routines. That’s why it’s important to understand antimicrobial resistance in these animals. Resistant bacteria can spread from pets to people, and from people to pets. This can happen even if our pets appear healthy."
        },
        {
            "text": "In the UK, we regularly monitor AMR in people and in livestock, but there’s been a big gap when it comes to companion animals. The VMD is working to change that by collaborating with academic institutions on different surveillance initiatives in pets and horses."
        },
        {
            "heading": 2,
            "text": "Healthy dogs and cats pilot"
        },
        {
            "text": "In July, we launched the world’s first pilot project to develop a national AMR surveillance programme for healthy cats and dogs. This project, delivered by Scotland’s Rural College (SRUC), marks a major step forward in closing critical AMR data gaps in companion animals."
        },
        {
            "heading": 3,
            "text": "Why is this project important?"
        },
        {
            "text": "There is currently no national system to monitor AMR in healthy cats and dogs, despite the fact that over half of UK adults share their homes with pets. Addressing this gap is very important for public health and for strengthening the UK’s One Health approach to AMR."
        },
        {
            "text": "The study has two main goals:"
        },
        {
            "text": "Researchers at SRUC will collect faecal samples from dogs and cats in a range of settings: households, veterinary practices and rescue centres. Using established microbiological techniques, the team will detect resistant bacteria and explore complimentary approaches such as national pet surveys and expert consultations."
        },
        {
            "heading": 3,
            "text": "Building better data for action"
        },
        {
            "text": "Baseline AMR data in companion animals will help:"
        },
        {
            "text": "Understanding transmission between pets, people, other animals, and the environment is vital. This pilot will help to investigate AMR transmission between these different sectors, the relationships between AMR in bacteria causing disease, and those carried by healthy pets.  "
        },
        {
            "heading": 2,
            "text": "Private Laboratories Initiative (PLI)"
        },
        {
            "text": "In the UK, much of the testing for AMR in sick animals happens in private veterinary laboratories, but this valuable data doesn’t get captured by government surveillance systems. Without it, our national picture of AMR is incomplete, making it harder to assess risks and respond to emerging threats."
        },
        {
            "text": "That’s where the Private Laboratories Initiative (PLI) comes in.  We are leading the PLI to build partnerships with private veterinary laboratories, thereby improving data sharing and strengthening AMR surveillance across four key animal sectors: companion animals, farm animals, fish, and equine."
        },
        {
            "text": "Through this collaboration between government and private labs, and academic partners, we will be able to spot risks sooner and take action to protect both animal and human health."
        },
        {
            "heading": 3,
            "text": "What we're aiming to achieve"
        },
        {
            "text": "We want to identify where AMR data is generated, how much, and in what form. We're working to understand testing methodologies and evaluate data quality, so we can assess the suitability of this data for integration into national surveillance systems. Ultimately, this will allow us to better understand the role of AMR in bacteria causing disease in companion animals and horses, and identify emerging resistance."
        },
        {
            "heading": 3,
            "text": "Driving innovation with academia"
        },
        {
            "text": "We’ve been working with the University of Liverpool and University of Cambridge, who lead on the companion animal and equine streams of the PLI, respectively."
        },
        {
            "text": "University of Liverpool’s Surveillance of Antimicrobial Resistance in Clinical Infections from Companion Animals, or VetCLIN AMR, is the companion animal stream of the PLI. Liverpool has an ongoing surveillance initiative, the Small Animal Veterinary Surveillance Network (SAVSNET), which contributes to VetCLIN AMR. "
        },
        {
            "text": "In August 2025, we visited the University’s Institute of Infection, Veterinary and Ecological Sciences.  The visit included a fascinating tour of their diagnostic laboratory and the Small Animal Teaching Hospital, offering a glimpse into cutting-edge facilities that support animal health. We also heard about some of the exciting research Liverpool is conducting in the companion animal and equine spaces, including a PhD project to explore AMR carriage in healthy horses, and another investigating epidemiology of AMR in bacteria from sick pets."
        },
        {
            "text": "In November, my team joined leading voices in veterinary medicine and diagnostics at the University of Liverpool, for an event hosted by Small Animal Medicine Society: \"Antimicrobial Resistance: Diagnostic Stewardship for Small Animal and Equine Practice.\" "
        },
        {
            "text": "This event brought together veterinary clinicians and veterinary laboratories to tackle the shared goal of improving antibiotic prescribing through better use and reporting of diagnostics. The event was run over two days: the first focusing on practical steps towards a harmonised approach to testing bacterial samples; and the second day including interactive talks and workshops. "
        },
        {
            "text": "Events like this are vital for collaboration, knowledge-sharing, and shaping practical solutions for antimicrobial testing and stewardship."
        },
        {
            "heading": 3,
            "text": "REIN In AMR"
        },
        {
            "text": "The University of Cambridge’s Equine Infectious Disease Surveillance (EIDS) group leads PLI efforts to bridge the AMR data gap in the equine sector. EIDS has established national-scale surveillance capacity for infectious diseases in horses and already works with an extensive network of equine private veterinary laboratories. Their new project is called Reporting Equine Infections and Non-susceptibility using In-vitro Antimicrobial Resistance testing, or REIN In AMR. REIN In AMR aims to collaborate with PVLs to broaden the scope of equine AMR surveillance in the UK."
        },
        {
            "text": "The REIN In AMR team have recently laid out their approach in the Vet Record, highlighting current AMR surveillance gaps and how the project aims to address them. They have also launched a new website offering information for private laboratories and others interested in the project, including opportunities to get involved.  "
        },
        {
            "heading": 2,
            "text": "Get Involved"
        },
        {
            "text": "I'm proud of the progress we’ve made in AMR surveillance across the UK’s animal health sectors. From pioneering initiatives like the Healthy Dogs and Cats pilot, to forging partnerships through the Private Laboratories Initiative, these efforts are closing critical data gaps and strengthening UK’s One Health approach to mitigate AMR."
        },
        {
            "text": "This progress is only possible through collaboration and there’s still more to do!"
        },
        {
            "text": "If you’re a vet who’d like to get involved in the Healthy Cats and Dogs study, please contact the SRUC team at amr.pets@sruc.ac.uk."
        },
        {
            "text": "If you’re from a diagnostic laboratory and would like to collaborate on AMR in diseased companion animals, please visit VetCLIN AMR  for contact details."
        },
        {
            "text": "If you are an equine diagnostic laboratory, then visit the REIN In AMR website to find out more."
        },
        {
            "text": "Want to hear more from VMD experts? Sign up for email alerts when we publish new posts."
        }
    ]
}