{
    "url": "https://educationhub.blog.gov.uk/2026/01/suspensions-how-suspensions-in-school-can-help-tackle-behaviour-and-boost-pupil-support/",
    "title": "Suspensions: How suspensions in school can help tackle behaviour and boost pupil support",
    "authors": [
        "mediaofficer"
    ],
    "categories": [
        "Behaviour",
        "Schools"
    ],
    "pub_date": "2026-01-29T09:16:17+00:00",
    "content": [
        {
            "text": "Schools will be supported to use internal suspensions effectively as part of their behaviour policies.  "
        },
        {
            "text": "Suspensions are a serious response to poor behaviour, and removing children from school will always be at the discretion of head teachers who know their children and families best.  "
        },
        {
            "text": "But when pupils are sent home, they can miss learning and fall further behind. This is exacerbated by the access young people now have to social media, gaming and the online world, risking further disengagement from education.  "
        },
        {
            "text": "Internal suspensions are already used by many schools to keep children safe, supervised and learning — while still making clear that their behaviour is not acceptable. "
        },
        {
            "text": "Here’s everything you need to know. "
        },
        {
            "heading": 3,
            "text": "What are internal suspensions? "
        },
        {
            "text": "An internal suspension is when a pupil is removed from their usual classroom for a short period but remains in school. "
        },
        {
            "text": "Instead of being sent home, the pupil works in a separate, supervised space. They continue with their schoolwork and are supported to reflect on their behaviour before returning to lessons. "
        },
        {
            "text": "Internal suspensions are intended to: "
        },
        {
            "text": "They are a short-term measure, not a long-term placement.  "
        },
        {
            "heading": 3,
            "text": "Do schools already use suspensions in school? "
        },
        {
            "text": "Yes. Many schools already use internal suspensions in different ways. "
        },
        {
            "text": "Schools will now be supported with clear, national guidance on how internal suspensions should be used well. This will help bring consistency across schools and highlight good practice — while still allowing headteachers to decide what works best for their pupils. "
        },
        {
            "text": "The aim is not to introduce something unfamiliar, but to improve how an existing approach is used, so pupils are better supported and learning time is protected. "
        },
        {
            "text": "The guidance will not require schools to follow a single staffing model — schools will decide what works best for them. They don’t need to use internal suspension if it isn’t right for their circumstances and pupils. "
        },
        {
            "heading": 3,
            "text": "Is this the same as isolation? "
        },
        {
            "text": "No. "
        },
        {
            "text": "Internal suspension is not the same as isolation or seclusion. "
        },
        {
            "text": "Isolation usually means a child is placed alone with very limited interaction. Internal suspension, by contrast, is: "
        },
        {
            "text": "Guidance will make clear that internal suspensions should not be used as isolation. "
        },
        {
            "heading": 3,
            "text": "Will this replace external suspensions? "
        },
        {
            "text": "No. "
        },
        {
            "text": "Headteachers will continue to decide when a pupil needs to be suspended from school or permanently excluded. "
        },
        {
            "text": "Internal suspension is another option, not a replacement. It may be used where behaviour is disruptive or escalating but does not meet the threshold for sending a pupil home. "
        },
        {
            "text": "Serious or violent behaviour should still result in pupils being removed from the school environment where appropriate. "
        },
        {
            "heading": 3,
            "text": "What about children who need extra support? "
        },
        {
            "text": "Schools should consider whether a child’s behaviour may be linked to: "
        },
        {
            "text": "Internal suspension should be part of a wider approach that focuses on early support, fairness and inclusion — not punishment alone. "
        },
        {
            "text": "Schools already have legal duties to support pupils with SEND and to treat children fairly. Those responsibilities will continue to apply. "
        },
        {
            "heading": 3,
            "text": "Will schools get more funding to deliver internal suspensions? "
        },
        {
            "text": "Many schools already deliver them successfully using existing staff and resources. Internal suspensions can also reduce the need for costly alternatives, such as sending pupils to other provision outside school. "
        },
        {
            "text": "The guidance will not require schools to follow a single staffing model — schools will decide what works best for them. They don’t need to use internal suspension if it isn’t right for their circumstances and pupils. "
        },
        {
            "heading": 3,
            "text": "When will this guidance be published?"
        },
        {
            "text": "The guidance will be developed with schools and trusts and will be consulted on before being finalised. "
        },
        {
            "text": "It will sit within existing suspension and permanent exclusion guidance, rather than creating a new system, with changes expected to come into effect next year. "
        },
        {
            "text": "Internal suspensions are about keeping children safe, learning and supported, while making clear that poor behaviour is taken seriously. By setting clear expectations and sharing what works, schools can tackle disruption while giving pupils the structure they need to succeed. "
        }
    ]
}