{
    "url": "https://marinescience.blog.gov.uk/2026/01/29/taking-flight-the-new-clean-catch-seabird-bycatch-monitoring-and-mitigation-trial/",
    "title": "Taking Flight- The new Clean Catch seabird bycatch monitoring and mitigation trial",
    "authors": [
        "Emily Roebuck"
    ],
    "categories": [
        "Fisheries",
        "Uncategorized"
    ],
    "pub_date": "2026-01-29T11:43:04+00:00",
    "content": [
        {
            "text": "Written by Emily Roebuck, Eastern England Fish Producer’s Organisation (EEFPO) trial lead, Cefas"
        },
        {
            "text": "On Monday 15 December 2025, the Clean Catch team was invited to present at the All-Party Parliamentary Group (APPG) on Fisheries. The APPG is a cross-party forum in Parliament that brings together parliamentarians and stakeholders to discuss fisheries policy, sustainability and industry concerns. The meeting, chaired by Melanie Onn MP, was titled Rebuilding Trust: Fisheries, Science, Management and focused on the low levels of trust between the fishing industry, scientists, managers and policymakers—particularly in government—and how this can undermine effective fisheries management in the UK."
        },
        {
            "text": "The event brought together scientific directors, researchers and fishermen to explore why trust has eroded and how it can be rebuilt through collaboration. Speakers shared case studies and developed recommendations for more sustainable, resilient and prosperous UK fisheries. Clean Catch, alongside its collaborating partner Dale Rodmell Chief Executive at the Eastern England Fish Producer’s Organisation (EEFPO), presented insights on how collaborative, fisher-led approaches can generate practical, evidence-based knowledge to address complex marine challenges."
        },
        {
            "text": "What is Clean Catch?"
        },
        {
            "text": "Clean Catch is a Defra-funded programme that supports the UK Government’s ambition to minimise, and where possible eliminate, bycatch of sensitive marine species such as marine mammals, seabirds, sharks, skates and rays. The programme is delivered by a consortium of partners—Arribada Initiative, Cefas, Mindfully Wired, MMO Consultancy and the Zoological Society of London—bringing expertise in technology development, scientific trials, communications, knowledge exchange and social science."
        },
        {
            "text": "Working closely with fisheries, Clean Catch employs fishery liaison officers at trial sites to ensure fishermen’s knowledge and voices are heard and are central to the trial delivery. The Clean Catch programme is underpinned by an equitable governance framework that supports fisher-led, science-based activities and transparent decision-making. This collaborative approach brings together fishing industries, environmental non-government organisations (eNGOs) and scientists, fostering trust and cooperation at local, national and expert levels."
        },
        {
            "text": "From cetaceans to seabirds: expanding the programme"
        },
        {
            "text": "Clean Catch is a fisher-led programme and has been working alongside fisheries since 2019 to improve bycatch monitoring and mitigation. Following the implementation of a cetacean bycatch mitigation trial with static net fishermen in the southwest of England, the programme expanded in 2024 into a second phase. This phase focuses on a different group of sensitive species, a new region and a different fishing gear type."
        },
        {
            "text": "As part of a proactive approach to understanding and managing seabird interactions, the North Sea whitefish fishery became a partner in a seabird monitoring and mitigation trial. The application, submitted by EEFPO on behalf of two fishing companies, focused on improving the evidence base around seabird interactions with fishing operations, including interactions with warp cables and observations of seabirds entering trawl gear. The fishery expressed interest in trialling bird-scaring lines as a means of evaluating their effectiveness and potential behavioural responses, with the aim of demonstrating whether seabird bycatch is an issue within the fishery and ensuring that any mitigation measures do not inadvertently alter seabird foraging behaviour."
        },
        {
            "text": "The North Sea whitefish fishery"
        },
        {
            "text": "The EEFPO North Sea whitefish fishery comprises a fleet of demersal trawl and pair-trawl vessels targeting species such as haddock and saithe. Based in Peterhead, vessels are operated by a skipper, relief skipper and several crew members. Fishing takes place year-round, except in extreme weather, with trips typically lasting seven to eight days and fishing operations running day and night."
        },
        {
            "text": "Designing the trial together"
        },
        {
            "text": "To introduce the programme and gain a detailed understanding of the fishery and its seabird interactions, the Clean Catch team visited Peterhead in spring 2025. These introductory discussions with vessel owners and skippers provided valuable insights into fishing operations, seabird behaviour around vessels and the practicalities of potential monitoring and mitigation tools. Early engagement with the fishery was essential to inform the design of a scientifically robust and operationally realistic trial."
        },
        {
            "text": "During summer 2025, two dedicated observer trips were undertaken by the Bycatch Monitoring Programme (BMP) to support the development of the seabird bycatch trial. This scoping work collected information on:"
        },
        {
            "text": "1. Seabird interactions, including bycatch in the net and physical interactions with fishing gear such as collisions with warp cables; and"
        },
        {
            "text": "2. The feasibility of collecting data using Remote Electronic Monitoring (REM), including identifying optimal camera locations."
        },
        {
            "text": "These trips revealed important insights. Physical interactions between seabirds and warp cables were observed to be brief and cryptic in nature, helping to explain why such events may not always be noticed during routine fishing operations. Large numbers of seabirds were also observed gathering around vessels during catch processing, when offal is discharged, increasing the likelihood of collisions with the warps."
        },
        {
            "text": "Trial monitoring through to future mitigation"
        },
        {
            "text": "Using information gathered directly from fishermen alongside data collected during observer trips, the Clean Catch team worked with the EEFPO, vessel owners and skippers to co-design the trial. Trial questions and monitoring options were discussed collaboratively, allowing participants to shape the approach and select methods that were both scientifically robust and practical to implement at sea."
        },
        {
            "text": "The agreed trial focuses on monitoring seabird bycatch and physical interactions around warp cables using REM, supplemented by skipper self-reporting of seabird bycatch and any other sensitive species bycatch, such as sharks, skates and rays. Data collection using REM and skipper self-reporting was established during autumn and winter 2025 and commenced before the end of 2025."
        },
        {
            "text": "Following an initial three-month monitoring period to establish baseline rates of seabird bycatch and the frequency and severity of warp interactions, bird scaring lines will be introduced as a mitigation measure. Their design and deployment will be co-developed with the fishery, ensuring industry knowledge and experience continue to inform the trial."
        },
        {
            "text": "Throughout 2026, the trial will continue working closely with the fishing industry to collect robust data on whether seabird bycatch is occurring and assess the appropriate use of any mitigation devices, should the science indicate their effectiveness. These findings will play a key role in guiding the wider Clean Catch programme, strengthening our understanding of bycatch risks and helping to progress mitigation options that have been codesigned with industry and are ready for adoption, where supported by evidence."
        },
        {
            "text": "Building trust for better outcomes"
        },
        {
            "text": "Throughout the seabird bycatch monitoring and mitigation trial, Clean Catch has prioritised clear, timely communication with all relevant actors from participating skippers to local and national industry groups. Information is shared in accessible formats to support informed decision-making, provide transparency in trial design and delivery, and manage expectations within and beyond the project."
        },
        {
            "text": "By placing collaboration at the centre of its work, Clean Catch has built, and continues to build, trust with the fishing industry. This trust is essential for delivering successful scientific trials and for developing practical solutions to the complex challenge of reducing bycatch of sensitive marine species."
        }
    ]
}