{
    "url": "https://ipo.blog.gov.uk/2026/01/29/the-uk-trade-mark-register-at-150-what-next/",
    "title": "The UK Trade Mark Register at 150: what next? ",
    "authors": [
        "Annabelle Whatmough",
        "Anne Barrett"
    ],
    "categories": [
        "AI",
        "IPO",
        "Trade marks",
        "Transformation"
    ],
    "pub_date": "2026-01-29T11:32:49+00:00",
    "content": [
        {
            "text": "Following the 150th anniversary of the UK Trade Mark Registry on 1 January 2026, we’ve heard the story of the first trade mark and we’ve seen how trade marks have evolved. Now, guest bloggers Annabelle Whatmough and Anne Barrett look at what the future holds. Annabelle is IPO’s Head of Future Frameworks for Trade Marks and Designs Policy, while Anne is IPO Head of Trade Marks Policy. "
        },
        {
            "text": "As the UK trade mark registry marks 150 years, this milestone offers an opportunity to look ahead at what the future may hold for the UK trade mark system. As part of IPO's Transformation Programme, the future move to the new One IPO digital platform will modernise how trade marks are applied for and managed, while AI is shaping how customers interact with the IPO and how people engage with brands. Trade marks are now used and experienced in more digital environments than ever before. This blog explores how these key drivers of change may influence what comes next for the UK trade mark system. "
        },
        {
            "heading": 3,
            "text": "Trade marks in a digital context "
        },
        {
            "text": "Over the past 150 years, there has been a huge evolution in the contexts within which trade marks are used. The Trade Marks Registration Act of 1875 limited trade marks to relating to goods. Over time legislation was expanded so that trade marks could also be registered in relation to services. A core principle of trade mark law is that trade marks are used in the course of business. Historically this would have related to physical commerce but the invention of the world wide web enabled the advertising of goods and services online, as well as e-commerce. As a result, trade marks are being used and interacted with in digital contexts more than ever before and in relation to goods and services someone in 1875 could never had imagined.  "
        },
        {
            "text": "These changing contexts could be having an impact on the types of trade marks being applied for. Previously the law defined trade marks in part as being “signs capable of being represented graphically” (Directive 2008/95/EC). This graphic representation requirement was later repealed with trade mark criteria being expanded to signs “…being represented on the register in a manner which enables the competent authorities and the public to determine the clear and precise subject matter of the protection afforded to its proprietor.” (Directive (EU) 2015/2436). This provides a far more flexible definition of a trade mark and the IPO now sees more applications for “unconventional” marks, such as motion marks (UK00003592978), multimedia marks (UK00004103352) and holograms (UK00003375918). The flexibility in the definition of a trade mark means we could see trade marks registered in new forms in the future.  "
        },
        {
            "text": "The Mirriad Advertising motion mark. View the motion mark in action (link):https://trademarks.ipo.gov.uk/ipo-mcase/page/Results/1/UK00003592978"
        },
        {
            "text": "Multimedia mark for National Trust. View the mark in action here (link):https://trademarks.ipo.gov.uk/ipo-mcase/page/Results/1/UK00004103352"
        },
        {
            "text": "Google LLC hologram mark. View the hologram in action here (link):https://trademarks.ipo.gov.uk/ipo-mcase/page/Results/1/UK0000337591"
        },
        {
            "heading": 3,
            "text": "Digital transformation of the IPO’s trade mark system "
        },
        {
            "text": "The IPO’s current trade mark system, TM10, has served us since 2013, but the environment in which it operates has changed significantly. To meet the needs of modern applicants, rights holders and legal representatives, our trade mark services and system will be transformed as part of Phase 2 of the One IPO Transformation Programme. While the IPO’s immediate priority is getting the new patents service right, some preparatory work is already underway in advance of the formal start of Phase 2. Phase 2 will formally begin once Phase 1 is complete and the new One IPO services for patents enters Public Beta in the coming months. "
        },
        {
            "text": "When the trade mark service transitions to the new One IPO system, customers can expect to see a number of key improvements. These include: "
        },
        {
            "text": "Together, these developments mean users can look forward to a more integrated and user‑centred UK trade mark system, that better supports businesses operating in a modern, digital environment. "
        },
        {
            "heading": 3,
            "text": "The impact of AI "
        },
        {
            "text": "AI is already having a noticeable impact on the trade mark system, with the IPO seeing AI‑generated content being filed as part of trade mark applications and during Tribunal proceedings.  As this inevitably increases, there may be a need for new or enhanced tools to support operations and manage demand. The Office’s trade mark pre‑apply tool - introduced in 2020 as an early example of AI adoption among global IP offices - demonstrates how AI can support applicants as well as create efficiencies for the IPO. "
        },
        {
            "text": "Beyond the growing use of AI by customers and its potential operational impacts, we may see AI affect the interpretation and development of trade mark law. Its growing role in commerce raises questions about how long-established trade mark principles apply in new contexts. For example, the concept of the ‘average consumer’—central to determining trade mark infringement and traditionally defined in case law as reasonably well informed, observant and circumspect—may shift as interactions become increasingly automated and mediated by AI. "
        },
        {
            "text": "We are already seeing the courts begin to explore how AI and trade mark law intersect. In the recent Getty Images v Stability AI decision, the judge considered whether synthetic watermarks on AI‑generated content infringed registered trade marks—the first UK ruling on this question. As AI use expands, more cases of this kind are likely to arise.   "
        },
        {
            "text": "Have you voted for your most iconic UK trade mark yet? We want to know which one you love the most and why it’s special to you.Take part in the poll."
        }
    ]
}