{
    "url": "https://naturalengland.blog.gov.uk/2025/07/02/enabling-sustainable-growth-natural-england-supporting-nature-positive-development/",
    "title": "Enabling sustainable growth — Natural England supporting nature-positive development ",
    "authors": [
        "Natural England"
    ],
    "categories": [
        "Development",
        "Growth",
        "Licensing",
        "Nutrient Neutrality"
    ],
    "pub_date": "2025-07-02T15:03:36+01:00",
    "content": [
        {
            "text": "By James Seymour, Natural England Area Manager for Kent and Sussex "
        },
        {
            "text": "At Natural England, we help facilitate housing developments by enabling developers to deliver vital environmental benefits through our strategic licensing tools. These include District Level Licensing for great crested newts, nutrient neutrality schemes to protect sensitive waterways and catchments, and ensuring Biodiversity Net Gain (BNG) — where developments leave the natural world measurably better off. "
        },
        {
            "text": "These schemes work together: developers can offset or mitigate habitat impacts by creating or restoring spaces for wildlife — such as ponds and wetlands — and sometimes generate biodiversity credits or nutrient mitigation units for other sites. This approach allows housing projects to progress while enhancing nature, rather than eroding it. On a recent site visit I got to see these policies in action and understand more about the benefits to nature and growth. "
        },
        {
            "text": "A show-home first — and a celebration of collaboration "
        },
        {
            "text": "A few weeks ago when I joined Redrow, Barratt Redrow, Kent County Council, Quinn Estates — and fellow representatives from Natural England — at the Crown Hill View development in Ashford, Kent. "
        },
        {
            "text": "The setting perfectly echoed our joint mission: homes in harmony with nature. For all of us, it was an energised moment — celebrating what we’ve already achieved and gearing up for what’s next through even stronger collaborative working. "
        },
        {
            "text": "The development and mitigation "
        },
        {
            "text": "Crown Hill View currently has 147 new homes and planning permission for about 280 homes. Delivered in partnership with developers, planners and Natural England, the site includes community amenities and the 3.2-hectare Conningbrook Wetland.  "
        },
        {
            "text": "Walking from the sleek show home into the adjacent green space, we heard cuckoos and crossed the Great Stour, which flows through the internationally important Stodmarsh catchment. This area, designated for its critical wetland habitats (home to species like bearded tit and bittern), has been under severe pressure from high nutrient levels (nitrogen and phosphorus). "
        },
        {
            "text": "Through the mandatory nutrient neutrality planning requirement in this catchment, the Conningbrook Wetland now provides mitigation for at least 725 homes, and may even generate surplus nutrient credits to support other developments. It looks entirely natural — 140,000 reeds waving and wildlife already arriving — yet is supported by sophisticated infrastructure, including an electric pumping station. "
        },
        {
            "text": "As the first nutrient mitigation scheme of its kind in Stodmarsh, it demonstrates that with sufficient planning, investment and partnership, development and nature enhancement can go hand in hand. "
        },
        {
            "text": "Strategic licensing to enable development "
        },
        {
            "text": "We then visited a District Level Licensing pond site facilitated by Kentish Stour Countryside Partnershipin 2021. Strategically placed in a damp valley beside grassland and woodland, it is prime habitat for great crested newts, a legally protected species. "
        },
        {
            "text": "Over four years it has naturally matured—and seems ready for newt colonisation. "
        },
        {
            "text": "Our Chair, Tony Juniper, joined ecologists in taking eDNA samples to test for newt DNA, and assessing habitat suitability. We have now received the  lab results and great crested newts are present in the pond. This is fantastic news and adds to the county-wide ,   success: since 2019, 61% of the 380 ponds created or restored through DLL in Kent have been colonised by great crested newts, well above the national average of 37%. "
        },
        {
            "text": "Collaboration in action "
        },
        {
            "text": "Through bringing developers, the council, environmental bodies and wildlife partners together, this project is about more than infrastructure — it’s building relationships, aligning shared objectives, elevating collective ambition, and finding positive solutions. "
        },
        {
            "text": "Standing inside that show home, it became clear: a novel venue doesn’t just make a nice story — it reflects the breakthrough solutions emerging when we work together. "
        },
        {
            "text": "Whether it’s through nutrient projects or DLL ponds, when we design and deliver development with nature in mind, the outcomes are real, measurable — and inspiring. That’s the future we’re building. "
        }
    ]
}