{
    "url": "https://mhclgmedia.blog.gov.uk/2025/07/02/government-confirms-plans-for-a-social-rent-revolution/",
    "title": "Government confirms plans for a social rent revolution",
    "authors": [
        "mhclgpress"
    ],
    "categories": [
        "Affordable housing"
    ],
    "pub_date": "2025-07-02T14:33:07+01:00",
    "content": [
        {
            "text": "Today the government has set out ambitions to deliver around 300,000 social and affordable homes through the new £39 billion Social and Affordable Homes Programme, with at least 60% for social rent."
        },
        {
            "text": "This significant package includes a long-term plan – Delivering a Decade of Renewal for Social and Affordable Housing – about how the government will deliver the biggest boost to social and affordable housebuilding in a generation, alongside driving up the safety and quality of homes."
        },
        {
            "text": "National outlets including The Independent and Sky News report about the government’s target for around 180,000 social rent homes, which is six times more than the number of social homes built in the 10 years up to 2024. Further coverage has also been picked up across sector media including Inside Housing, Housing Today, Property Week, and Big Issue."
        },
        {
            "text": "I News focuses on plans for a new Decent Homes Standard across the private and social rented sectors, making sure millions of renters across the country can live in safe and secure homes. The Daily Mirror reports separately about tenants living in social housing having greater access to information about their landlord, alongside new requirements to ensure housing management staff deliver high-quality services."
        },
        {
            "text": "The Deputy Prime Minister has written exclusively for LBC about how the government’s clear, well-funded plan will spark a decade of renewal and tackle the worst housing crisis in living memory.  "
        },
        {
            "text": "Deputy Prime Minister and Housing Secretary Angela Rayner said:“We are seizing this golden opportunity with both hands to transform this country by building the social and affordable homes we need, so we create a brighter future where families aren’t trapped in temporary accommodation and young people are no longer locked out of a secure home.   "
        },
        {
            "text": "“With investment and reform, this government is delivering the biggest boost to social and affordable housing in a generation, unleashing a social rent revolution, and embarking on a decade of renewal for social and affordable housing in this country.  "
        },
        {
            "text": "“That’s why I am urging everyone in the social housing sector to step forward with us now to make this vision a reality, to work together to turn the tide on the housing crisis together and deliver the homes and living standards people deserve through our Plan for Change.”"
        }
    ]
}