{
    "url": "https://insidehmcts.blog.gov.uk/2025/07/02/improving-court-buildings-making-justice-work-better-for-everyone/",
    "title": "Improving Court Buildings: Making Justice Work Better for Everyone",
    "authors": [
        "Rupert Morgan, Property Director, HMCTS"
    ],
    "categories": [
        "General",
        "User experience and research"
    ],
    "pub_date": "2025-07-02T09:00:00+01:00",
    "content": [
        {
            "text": "[English] - [Cymraeg]"
        },
        {
            "text": "We care deeply about our buildings – and even more about the people who use and work in them. That’s why I want to share how the £148m recently announced by the Lord Chancellor is being used this financial year for essential repairs and improvements across our estate. These upgrades are making our buildings more efficient, resilient, and – crucially – creating more positive and welcoming environments for everyone who steps through our doors, whether they’re working, supporting others, or seeking justice."
        },
        {
            "text": "Our estate is complex and is made up of more than 300 buildings, including older and listed sites, which often present unique challenges when it comes to maintenance and modernisation."
        },
        {
            "text": "We know that there is still much to do if we want to bring our buildings up to the standard that our staff and users rightly expect. At times, outdated facilities and recurring issues cause frustration, but this year’s increased funding - up from £120 million last year - is already enabling us to make visible, meaningful progress."
        },
        {
            "text": "We’re prioritising spending where it matters most - to keep buildings safe, secure, compliant with legal standards, and fully operational. Working closely with the judiciary and our staff across the country, we’re identifying and tackling the most urgent issues - from failing roofs and broken lifts to outdated electrical systems - focusing our efforts where they’re need most."
        },
        {
            "heading": 2,
            "text": "Building resilience"
        },
        {
            "text": "Across the country, we are already seeing improvements thanks to this investment – from new roofs and refurbished courtrooms and upgrades to heating and cooling systems."
        },
        {
            "text": "At Nottingham Crown Court, a major roof replacement is underway to stop recurring water leaks that have previously forced courtroom closures."
        },
        {
            "text": "Our court users at Manchester Crown Court (Crown Square) will soon see work start on the refurbishment of two aging courtrooms, providing modern seating, better lighting and improved accessibility for everyone."
        },
        {
            "text": "At Willesden Magistrates’ Court, we’re replacing the outdated heating, ventilation and cooling systems to provide more comfortable conditions for staff, judges and visitors alike."
        },
        {
            "text": "These handful of examples are just part of the more than 180 projects which are making local, but significant, improvements to the experience of people using our buildings, and moving them closer to the standards that they expect when they come to them."
        },
        {
            "heading": 2,
            "text": "New sites deliver modern courts"
        },
        {
            "text": "Away from our programme of repairs and refurbishment, we’re also investing in the courts of the future - delivering new, modern, and sustainable buildings that meet the needs of a changing justice system."
        },
        {
            "text": "In London, the new City of London Law Courts building can be seen rising from the ground as construction continues at Salisbury Square. The 18-room facility will be operational in 2027, hearing crown, magistrates, county and civil cases."
        },
        {
            "text": "The new London Tribunals building at Newgate Street will provide a flexible facility for the future, replacing two existing sites in the capital. We will welcome tribunal users to the venue early in 2026."
        },
        {
            "text": "In Blackpool, we are building a modern courthouse for magistrates and county court work – one that will serve local communities for many years to come."
        },
        {
            "text": "This is a time of real momentum across our estate. Investment is already making a tangible difference, creating better spaces for the public, the judiciary, and for all of our staff."
        },
        {
            "text": "These improvements go beyond just about bricks and mortar - they're about making sure justice is delivered in environments that are truly fit for purpose, reflecting the importance of the work we do and the vital role our courts and tribunals play in people’s lives. Much of our work focuses on core infrastructure that may go unseen - but is essential to keeping our courts running. From upgraded electrical systems to modern, accessible lifts, every improvement supports the smooth, safe and inclusive operation of our services."
        },
        {
            "text": "My team and I are fully committed to making sure that every penny of funding is spent wisely - bringing steady, meaningful improvements that benefit everyone who uses or works in our buildings."
        },
        {
            "text": "You can read more about how we are funding these projects and listen to our podcast about improving accessibility in our estate."
        },
        {
            "text": "[English] - [Cymraeg]"
        },
        {
            "heading": 1,
            "text": "Gwella Adeiladau Llys: Gwneud i Gyfiawnder Weithio’n Well i Bawb"
        },
        {
            "text": "Mae ein hadeiladau’n bwysig iawn i ni – ac mae’r bobl sy’n eu defnyddio ac yn gweithio ynddynt yn bwysicach byth. Dyna pam rwyf am rannu sut mae’r £148 miliwn a gyhoeddwyd yn ddiweddar gan yr Arglwydd Ganghellor yn cael ei ddefnyddio yn y flwyddyn ariannol hon ar gyfer atgyweiriadau a gwelliannau hanfodol ar draws ein hystad. Mae’r uwchraddiadau hyn yn gwneud ein hadeiladau’n fwy effeithlon, yn fwy cydnerth, ac – yn hollbwysig – yn creu amgylcheddau mwy cadarnhaol a chroesawgar i bawb sy’n camu trwy ein drysau, boed yn gweithio, yn cefnogi eraill, neu’n ceisio cyfiawnder."
        },
        {
            "text": "Mae ein hystad yn gymhleth ac mae’n cynnwys mwy na 300 o adeiladau, gan gynnwys safleoedd hŷn a rhestredig, sy’n aml yn cyflwyno heriau unigryw o ran gwaith cynnal a chadw a moderneiddio."
        },
        {
            "text": "Rydym yn gwybod bod llawer i’w wneud o hyd os ydym am wella'n hadeiladau i'r safon y mae ein staff a'n defnyddwyr yn ei disgwyl. Ar adegau, mae cyfleusterau hen ffasiwn a phroblemau cyson yn achosi rhwystredigaeth, ond mae’r cynnydd mewn cyllid eleni - i fyny o £120 miliwn y llynedd - eisoes yn ein galluogi i wneud cynnydd gweladwy ac ystyrlon."
        },
        {
            "text": "Rydym yn blaenoriaethu gwariant lle mae’n bwysicaf - i gadw adeiladau’n ddiogel ac yn saff, yn cydymffurfio â safonau cyfreithiol, ac yn gwbl weithredol. Gan weithio’n agos gyda’r farnwriaeth a’n staff ledled y wlad, rydym yn nodi ac yn mynd i’r afael â’r problemau mwyaf brys - o doeau sy’n methu a lifftiau wedi torri i systemau trydanol hen ffasiwn - gan ganolbwyntio ein hymdrechion lle mae eu hangen fwyaf."
        },
        {
            "heading": 2,
            "text": "Meithrin cydnerthedd"
        },
        {
            "text": "Ar draws y wlad, rydym eisoes yn gweld gwelliannau diolch i’r buddsoddiad hwn - o doeau newydd ac ystafelloedd llys wedi’u hadnewyddu ac uwchraddio systemau gwresogi ac oeri."
        },
        {
            "text": "Yn Llys y Goron Nottingham, mae gwaith mawr i ailosod y to ar y gweill i atal gollyngiadau dŵr cyson sydd wedi gorfodi cau ystafelloedd llys yn y gorffennol."
        },
        {
            "text": "Bydd ein defnyddwyr llys yn Llys y Goron Manceinion (Crown Square) yn gweld gwaith yn dechrau ar adnewyddu dau ystafell llys hen ffasiwn yn fuan, gan ddarparu seddi modern, goleuadau gwell a gwell hygyrchedd i bawb."
        },
        {
            "text": "Yn Llys Ynadon Willesden, rydym yn disodli’r systemau gwresogi, awyru ac oeri hen ffasiwn i ddarparu amodau mwy cyfforddus i staff, barnwyr ac ymwelwyr fel ei gilydd."
        },
        {
            "text": "Mae’r llond llaw o enghreifftiau hyn yn rhan o’r mwy na 180 o brosiectau sy’n gwneud gwelliannau lleol, ond sylweddol, i brofiad pobl sy’n defnyddio ein hadeiladau, ac yn eu symud yn agosach at y safonau y maent yn eu disgwyl pan fyddant yn eu mynychu."
        },
        {
            "heading": 2,
            "text": "Safleoedd newydd yn darparu llysoedd modern"
        },
        {
            "text": "Y tu hwnt i’n rhaglen atgyweirio ac adnewyddu, rydym hefyd yn buddsoddi yn llysoedd y dyfodol - gan ddarparu adeiladau newydd, modern a chynaliadwy sy’n diwallu anghenion system gyfiawnder sy’n newid."
        },
        {
            "text": "Yn Llundain, gellir gweld adeilad newydd Llysoedd Barn Dinas Llundain yn codi o’r ddaear wrth i’r gwaith adeiladu barhau yn Salisbury Square. Bydd y cyfleuster 18 ystafell yn weithredol yn 2027, gan wrando achosion y goron, ynadon, sirol a sifil."
        },
        {
            "text": "Bydd adeilad newydd Tribiwnlysoedd Llundain yn Newgate Street yn darparu cyfleuster hyblyg ar gyfer y dyfodol, gan ddisodli dau safle presennol yn y brifddinas. Byddwn yn croesawu defnyddwyr tribiwnlys i'r lleoliad yn gynnar yn 2026."
        },
        {
            "text": "Yn Blackpool, rydym yn adeiladu llys modern ar gyfer gwaith llys ynadon a llys sirol – un a fydd yn gwasanaethu cymunedau lleol am flynyddoedd lawer i ddod."
        },
        {
            "text": "Mae hwn yn gyfnod o fomentwm gwirioneddol ar draws ein hystad. Mae buddsoddiadau eisoes yn gwneud gwahaniaeth pendant, gan greu mannau gwell i’r cyhoedd, y farnwriaeth, ac i’n holl staff."
        },
        {
            "text": "Mae’r gwelliannau hyn yn mynd y tu hwnt i frics a morter yn unig – maent yn ymwneud â sicrhau bod cyfiawnder yn cael ei gyflwyno mewn amgylcheddau sy’n wirioneddol addas at y diben, gan adlewyrchu pwysigrwydd y gwaith a wnawn a’r rôl hanfodol y mae ein llysoedd a’n tribiwnlysoedd yn ei chwarae ym mywydau pobl. Mae llawer o’n gwaith yn canolbwyntio ar seilwaith craidd a allai fynd heb ei weld – ond sy’n hanfodol i gadw ein llysoedd yn rhedeg. O systemau trydanol wedi’u huwchraddio i lifftiau modern, hygyrch, mae pob gwelliant yn cefnogi gweithrediad llyfn, diogel a chynhwysol ein gwasanaethau."
        },
        {
            "text": "Mae fy nhîm a minnau wedi ymrwymo'n llwyr i sicrhau bod pob ceiniog o gyllid yn cael ei gwario'n ddoeth – gan ddod â gwelliannau cyson ac ystyrlon sy'n fuddiol i bawb sy'n defnyddio neu'n gweithio yn ein hadeiladau."
        },
        {
            "text": "Gallwch ddarllen mwy am sut rydym yn ariannu’r prosiectau hyn - a gwrando ar ein podlediad am wella hygyrchedd yn ein hystad."
        }
    ]
}