{
    "url": "https://environmentagency.blog.gov.uk/2025/07/02/improving-our-environmental-permitting-service/",
    "title": "Improving our Environmental Permitting Service",
    "authors": [
        "defrablogs"
    ],
    "categories": [
        "Environment Agency",
        "Regulated industry"
    ],
    "pub_date": "2025-07-02T13:51:19+00:00",
    "content": [
        {
            "text": "Effective regulation is essential to the country’s growth, providing a level playing field where businesses can operate, innovate and thrive.With the accelerating impacts of climate change and rising global tensions, the need for energy security and sustainable growth has never been more critical."
        },
        {
            "text": "Our permitting service must support this. It drives innovation, supports growth, and enables a low-carbon future while upholding high environmental standards. From fishing licences to nuclear waste, our permits regulate activities that impact land, air, and water. We process over 10,000 applications annually, rated from Category 1 (least complex) to 4 (most complex) and bespoke arrangements for new, novel and unique permitting requirements."
        },
        {
            "text": "Our permitting service has been under considerable capacity pressure. This has affected the timeliness of our services, especially in complex areas of regulation, causing understandable frustration for businesses, investors and communities."
        },
        {
            "text": "We have listened to feedback from the industry, and we recognise these concerns. We are dedicated to improving our service to deliver timely, high-quality decisions."
        },
        {
            "text": "What we've done so far…"
        },
        {
            "text": "We’ve taken several actions to improve the speed, consistency and quality of our permitting service. We know there is more to do and are committed to continuing our work in this area. "
        },
        {
            "text": "We have made sustained progress since 2022:"
        },
        {
            "text": "Around 25% of permit applications lack sufficient information, causing delays. We advise applicants to use the pre-application service for complex permits and ensure they are submitting high-quality information to reduce any subsequent processing times."
        },
        {
            "text": "Additionally, we've introduced an early validation step to identify and address issues within the first month. This reduces back-and-forth, improves the applicant experience, and speeds up decisions."
        },
        {
            "text": "The results are clear: permitting performance has improved by over 20% in two years, and backlogs have halved. We remain committed to supporting applicants and meeting their timelines."
        },
        {
            "text": "A commitment to long-term improvement: the Accelerated Permitting Transformation Programme"
        },
        {
            "text": "In 2025, we launched our Accelerated Permitting Transformation (APT) Programme to modernise the entire permitting system, working closely with the Department for Environment, Food & Rural Affairs (Defra)."
        },
        {
            "text": "We have already driven significant improvements to our permitting service, and APT will continue to build on this momentum. Our vision is to create a faster, smarter and more consistent service, delivering better outcomes for both applicants and the environment."
        },
        {
            "text": "APT focuses on these key areas:"
        },
        {
            "text": "The initial projects will support our ambition of 95% of permitting decisions delivered within target timeframes, starting with Category 1 permits. We will see beneficial outcomes arriving within a matter of months and then further progress over a longer period 2027-2028."
        },
        {
            "text": "What's next?"
        },
        {
            "text": "Successfully building a permitting service that is trusted and resilient to future challenges depends on continued collaboration and openness. We are committed to keeping all stakeholders informed of our progress and key developments, and permitting performance is tracked and shared via the annual Chief Regulator’s Report. This ensures ongoing transparency and accountability of our regulatory performance. As England’s principal environmental regulator, we’re working closely with Defra to implement recommendations from recent reviews and consultations including moving water resources regulation into the Environmental Permitting Regulations (EPR), consulting on allowing us to set exemptions to increase regulatory agility, and reducing the complexity of bespoke permits to provide more options for trials and new technology. We’re committed to playing a central role in the future of regulation."
        }
    ]
}