{
    "url": "https://ukhsa.blog.gov.uk/2025/07/02/the-essential-travel-checklist-to-keep-you-and-your-family-healthy-on-holiday/",
    "title": "The essential travel checklist to keep you and your family healthy on holiday",
    "authors": [
        "Blog Editor"
    ],
    "categories": [
        "Travel"
    ],
    "pub_date": "2025-07-02T12:14:27+01:00",
    "content": [
        {
            "text": "Planning a holiday abroad? This guide provides essential information to help you travel safely and minimise health risks. Whether you're planning a beach break, visiting family overseas, or embarking on a backpacking adventure, it’s worth thinking ahead so that you have the best time possible."
        },
        {
            "heading": 2,
            "text": "Before you travel"
        },
        {
            "text": "Ensure any underlying health conditions are stable before travelling and pack necessary medications and a small first aid kit. Remember to check rules around medication use and importation in your destination country, as common UK medications might be restricted elsewhere."
        },
        {
            "heading": 3,
            "text": "Research your destination"
        },
        {
            "text": "It's important to research your destination before travelling. The Travel Health Pro website, supported by UKHSA, provides comprehensive information on health risks worldwide and is an excellent resource for trip planning."
        },
        {
            "heading": 3,
            "text": "Routine vaccinations"
        },
        {
            "text": "Ensure you and your family are up to date with routine vaccinations before travelling. This protects both you and those around you, particularly vulnerable individuals such as babies."
        },
        {
            "text": "The measles, mumps and rubella (MMR) vaccine is especially important as measles continues to circulate in the UK and many international destinations are seeing outbreaks. If you haven't had both doses of the MMR vaccine, you can catch up at any time – contact your GP practice to check your vaccination status."
        },
        {
            "heading": 3,
            "text": "Additional vaccinations and preventative medications"
        },
        {
            "text": "Depending on your plans, you may need additional vaccinations. The typhoid vaccination is freely available from GP surgeries for travellers to regions where typhoid is a risk. Recent data shows travel-associated typhoid cases in England, Wales and Northern Ireland are mostly contracted by people visiting friends and relatives in Pakistan and India."
        },
        {
            "text": "Hepatitis A vaccination is recommended for those visiting high-risk areas, protecting against this liver infection that spreads through contaminated food and water. The vaccine is also freely available from your GP. Other vaccines such as those for  Japanese encephalitis (present in rural parts of Asia), rabies, dengue and yellow fever might be recommended based on your travel plans, activities and medical history.  Some countries may also require proof of yellow fever vaccination as a condition of entry even when there isn’t a risk of infection."
        },
        {
            "text": "Anti-malaria tablets may be necessary when travelling to malaria risk areas, including parts of Africa, Asia, Central and South America. Despite a slight decrease in 2024, imported malaria cases remain at concerning levels in the UK."
        },
        {
            "text": "Consult your GP, practice nurse, pharmacist or travel clinic at least 4 to 6 weeks before travelling (or 3 to 4 months before if considering the dengue vaccine) for personalised advice and necessary vaccinations."
        },
        {
            "heading": 2,
            "text": "During travel"
        },
        {
            "heading": 3,
            "text": "General health measures"
        },
        {
            "text": "While abroad, practice good hand hygiene by washing hands regularly with soap and water - alcohol gel is helpful when hand washing facilities are not available. Be mindful of water and food safety - when appropriate, drink bottled water. Traveller's diarrhoea is common in many destinations. If affected, rest, drink plenty of bottled fluids supplemented with rehydration salts if possible. Seek medical attention if symptoms are severe or don't improve within three days"
        },
        {
            "text": "Protect yourself from excessive sun exposure by staying in the shade between 11am and 3pm, wearing sunscreen, a hat and light clothing."
        },
        {
            "heading": 3,
            "text": "Disease prevention"
        },
        {
            "text": "Mosquito-borne diseases pose significant risks in many parts of the world, including some European destinations. Protect yourself by wearing long-sleeved clothing, using insect repellent (at least 50% DEET), and sleep under insecticide-treated bed nets where air conditioning isn't available."
        },
        {
            "text": "Be aware of dengue risk, particularly when travelling to destinations like India, Barbados Thailand, Brazil and Indonesia. There has been a global rise in Oropouche infections since 2024 (primarily spread through midge bites, not mosquitoes), and Zika virus continues to be reported - pregnant travellers should take extra precautions. Cases of chikungunya have also increased, with most UK cases linked to travel to Sri Lanka."
        },
        {
            "text": "Rabies presents a risk in many countries and is transmitted through bites or scratches from infected animals, usually dogs. It is an extremely serious infection which is almost always fatal once symptoms appear, but vaccination and early treatment can prevent it. Avoid animal bites, consider pre-exposure vaccination if recommended for your destination, and seek immediate medical advice for any possible exposure to the virus."
        },
        {
            "heading": 3,
            "text": "Sexual health"
        },
        {
            "text": "Practice safer sex abroad to reduce the risk of STIs, HIV and infections spread through close personal contact. Use condoms and have open conversations about sexual health. Be aware that antibiotic-resistant gonorrhoea is increasing in popular Asian-Pacific tourist destinations."
        },
        {
            "text": "Avoid sharing items like towels or bedding with anyone who has mpox or mpox symptoms."
        },
        {
            "heading": 2,
            "text": "When to seek medical help"
        },
        {
            "text": "Seek immediate medical attention if you experience fever of 38°C or more, blood and/or mucus in your stool, confusion or altered mental state, severe abdominal pain, or jaundice or unusual rash."
        },
        {
            "text": "All animal bites or scratches in rabies-endemic areas should be treated as potential rabies exposures requiring urgent medical attention."
        },
        {
            "text": "Suspected malaria is a medical emergency requiring urgent diagnosis and treatment. If you develop fever, flu-like symptoms or any unusual symptoms during or after visiting a malaria risk country, don't wait until returning to the UK – get medical help immediately."
        },
        {
            "heading": 2,
            "text": "Returning to the UK"
        },
        {
            "text": "If you feel unwell after returning to the UK, seek medical attention promptly and inform healthcare providers about your recent travel. If you've had unprotected sex abroad, get tested for STIs before having sex with anyone else."
        },
        {
            "text": "Planning ahead for your health is as important a part of your trip as buying travel insurance or making sure your passport is up to date. For more detailed information, visit the Travel Health Pro website."
        }
    ]
}