{
    "url": "https://socialcare.blog.gov.uk/2021/11/12/arise-infection-prevention-and-control-champions/",
    "title": "Arise, infection prevention and control champions!",
    "authors": [
        "Deborah Sturdy"
    ],
    "categories": [
        "Care and support",
        "coronavirus",
        "Workforce"
    ],
    "pub_date": "2021-11-12T10:46:38+00:00",
    "content": [
        {
            "heading": 2,
            "text": "Infection Prevention and Control Champions Network launched"
        },
        {
            "text": "While it is perhaps not surprising how vaccination has become a primary focus of efforts to end the coronavirus pandemic, there has been another shared endeavour, which has proven just as critical in helping us protect people from the virus: infection, prevention and control (IPC)."
        },
        {
            "text": "Social care colleagues have already demonstrated tireless commitment to the principals of IPC every day. More than that, they have motivated and inspired others to do the same, making a huge difference in the lives of those they care for. That’s why I am delighted to launch the IPC Champions Network, to maximise, celebrate and share best practice across care settings throughout the sector."
        },
        {
            "text": "When I took on the initially temporary role of Chief Nurse for Adult Social Care, one of my priorities was to make sure the best examples of infection prevention and control could be shared to raise standards everywhere."
        },
        {
            "text": "Now my role is permanent, I'm delighted to work with the Queen’s Nursing Institute to establish this network for the long term and support its mission to reduce the spread of infections, including COVID-19, flu and other viruses."
        },
        {
            "heading": 2,
            "text": "Who are the champions?"
        },
        {
            "text": "The network will be made up of frontline social care staff from care settings across England. They will lead infection prevention and control in their specific areas or homes. Through an initially online platform, they will share best practice, using a series of virtual meetings, newsletters and a discussion forum, all hosted by the Queen’s Nursing Institute. This will be shared to make sure a sustained focus on IPC continues beyond the pandemic."
        },
        {
            "text": "Having staff, at all levels, take the IPC lead in care homes, home care or supported living settings is vital. A designated lead will have the oversight to deliver essential information quickly and support colleagues to deal effectively with any IPC issues as they arise."
        },
        {
            "text": "More than that, they will be passionate about the cause and encourage individuals and teams to keep on track. We need to support these colleagues to share their work and come together to inspire others across the country. The network will be an important element in how we deal with the challenges of the winter months, including seasonal infections, whilst maintaining the continued pandemic response."
        },
        {
            "text": "Good IPC practice must and will continue throughout this pandemic and beyond. Please make sure your organisation joins the network and help us all provide exceptional practice for colleagues, residents and communities."
        }
    ]
}