{
    "url": "https://food.blog.gov.uk/2021/11/12/chairs-stakeholder-update-how-climate-change-will-impact-on-diet-and-what-is-the-regulatory-responsibility/",
    "title": "Chair’s stakeholder update - How climate change will impact on diet and what is the regulatory responsibility?",
    "authors": [
        "Professor Susan Jebb, FSA Chair"
    ],
    "categories": [
        "Our mission",
        "Science"
    ],
    "pub_date": "2021-11-12T16:06:34+00:00",
    "content": [
        {
            "text": "Cymraeg"
        },
        {
            "text": " "
        },
        {
            "text": "FSA Chair Professor Susan Jebb discusses climate change and this week’s Global Conference for Food Safety Regulation and Sustainability. "
        },
        {
            "text": "The impact of the food system on climate change is something that should concern us all. Almost twenty per cent of greenhouse gas emissions in the UK come from the food system."
        },
        {
            "text": "The FSA, with Food Standards Scotland, organised a conference this week with our key stakeholders to discuss what role regulators can play in helping the food industry find new ways of providing people with a more sustainable and safe supply of food."
        },
        {
            "text": "It is not just the science telling us our food needs to be kinder to the planet, the public are telling us this too. Our research shows more than half of us want to change our diet for the benefit of the environment."
        },
        {
            "text": "At our conference, I set out where I think regulators can help to address this urgent challenge. Our Chief Scientific Adviser Professor Robin May also spoke to the media about the potential benefits of eco-labelling to drive change in the food system."
        },
        {
            "text": "The UK’s regulatory landscape is changing fast. New technology and evolving consumer demands are making us think differently about how we regulate food businesses. This provides us with the perfect opportunity to put sustainability as well as safety at the heart of our regulatory system."
        },
        {
            "text": "We need this conversation to continue beyond the COP26. So, I have an ask: how can we work together on the challenges that climate change is creating for the food system? Please let us know, by commenting below, or getting in touch elsewhere."
        },
        {
            "text": " "
        },
        {
            "text": "I hope you’ve found this latest blog useful. If you’d like to get future editions direct to your inbox, sign up for the updates. You can also sign up to be notified of all FSA posts, not just my posts."
        },
        {
            "heading": 2,
            "text": "Diweddariad y Cadeirydd i randdeiliaid – Sut bydd newid yn yr hinsawdd yn effeithio ar ddeietau a beth yw'r cyfrifoldeb rheoliadol?"
        },
        {
            "text": "Mae Cadeirydd yr Asiantaeth Safonau Bwyd (ASB), yr Athro Susan Jebb, yn trafod newid yn yr hinsawdd a Chynhadledd Fyd-eang Rheoleiddio Diogelwch Bwyd a Chynaliadwyedd, a gynhaliwyd yr wythnos hon."
        },
        {
            "text": "Mae effaith newid yn yr hinsawdd ar y system fwyd yn rhywbeth a ddylai fod yn bryder i bawb ohonom. Daw bron i ugain y cant o allyriadau nwyon tŷ gwydr yn y Deyrnas Unedig (DU) o'r system fwyd."
        },
        {
            "text": "Trefnodd yr ASB gynhadledd yr wythnos hon gyda'n rhanddeiliaid allweddol i drafod y rôl y gall rheoleiddwyr ei chwarae wrth helpu'r diwydiant bwyd i ganfod ffyrdd newydd o ddarparu cyflenwad bwyd mwy cynaliadwy a diogel."
        },
        {
            "text": "Nid y wyddoniaeth yn unig sy'n dweud wrthym fod angen i'n bwyd fod yn well i'r blaned: mae’r cyhoedd hefyd yn dweud hyn wrthym. Mae ein hymchwil yn dangos bod mwy na hanner ohonom eisiau newid ein deiet er budd yr amgylchedd."
        },
        {
            "text": "Yn ein cynhadledd, nodais lle rwy’n credu y gall rheoleiddwyr helpu i fynd i’r afael â’r her daer hon. Fe wnaeth ein Prif Gynghorydd Gwyddonol, yr Athro Robin May, hefyd siarad â’r cyfryngau am fuddion posib eco-labelu i sbarduno newid yn y system fwyd."
        },
        {
            "text": "Mae tirwedd reoleiddiol y DU yn newid yn gyflym. Mae technoleg newydd a gofynion defnyddwyr, sy’n esblygu o hyd, yn peri inni feddwl yn wahanol am sut rydym ni’n rheoleiddio bwyd. Dyma gyfle perffaith i ni roi cynaliadwyedd yn ogystal â diogelwch wrth wraidd ein system reoleiddio."
        },
        {
            "text": "Mae angen i'r sgwrs hon barhau y tu hwnt i COP26. Felly, mae gen i gwestiwn: sut gallwn ni weithio gyda'n gilydd i fynd i’r afael â’r heriau y mae newid yn yr hinsawdd yn eu creu ar gyfer y system fwyd? Gadewch i ni wybod trwy adael sylwadau isod, neu drwy gysylltu mewn man arall."
        },
        {
            "text": " "
        },
        {
            "text": "Rwy’n gobeithio i chi gael y neges ddiweddaraf hon yn ddefnyddiol. Os hoffech gael rhifynnau’r dyfodol yn uniongyrchol i’ch mewnflwch, cofrestrwch am y diweddariadau. Gallwch hefyd gofrestru i gael eich hysbysu am bob blog gan yr ASB, ac nid y neges hon yn unig."
        }
    ]
}