{
    "url": "https://civilservicelocal.blog.gov.uk/2021/11/12/cs-eating-disorders-network-raise-awareness-of-body-image-food-and-exercise-struggles/",
    "title": "CS Eating Disorders Network Raise Awareness of body image, food and exercise struggles",
    "authors": [
        "Heather Flanagan"
    ],
    "categories": [
        "A National Spotlight",
        "Cymru Wales",
        "East, South East & London",
        "Midlands",
        "North East, Yorkshire and the Humber",
        "North West England",
        "Northern Ireland",
        "Scotland",
        "South West England"
    ],
    "pub_date": "2021-11-12T10:30:17+00:00",
    "content": [
        {
            "text": " "
        },
        {
            "heading": 3,
            "text": "Body image, food and exercise."
        },
        {
            "text": "For some, these words may provoke little anxiety. But for others, our relationship to our bodies, food and exercise can be complex or unhappy experiences. In a 2019 report, one in five people had felt shame and over one in three had felt ‘down or low’ due to their body image in that year."
        },
        {
            "text": "We don’t leave these thoughts at the door when we come to work – there are often pressures to look a certain way and food is a big part of workplace culture. However, we don’t often speak about these thoughts and feelings with each other, and for some, this silence can conceal fear, shame and stigma. For those who suffer from eating disorders and related issues, these thoughts and feelings can take over your life and are complex mental illnesses which can be difficult to manage."
        },
        {
            "text": "The Civil Service Eating Disorders Network (CSEDN) launched in March 2020. We directly support those who are affected by eating disorders and related issues through our monthly support group, open to all civil servants."
        },
        {
            "text": "Whilst around 1.25 million people in the UK have an eating disorder, eating disorders thrive on secrecy and it is estimated that a far larger number of people are affected. Eating disorders are severe mental illnesses and can have a significant impact not only on the sufferer, but those who care for them including parents, siblings, friends, and colleagues."
        },
        {
            "text": "As a network we also aim to raise awareness of the prevalence of eating disorders and how they can affect civil servants in the workplace. As well as providing direct support, we produce toolkits for departments which provide guidance and signpost resources, as well as running civil service-wide events to break the stigma around these issues and encourage a more inclusive workplace."
        },
        {
            "text": "MYTH: Eating Disorders are a choice"
        },
        {
            "text": "FACT: Eating disorders are complex mental illnesses – there is no single cause. Instead they are thought to be caused by a combination of biological, psychological, and sociocultural factors. Eating disorders are extremely distressing for both the individual and their loved ones, and often are accompanied by feelings of shame. They require specialist treatment, but people can and do get better. Eating disorders are mental health disorders and are never a personal choice, they take many different forms and can affect anyone regardless of age, socio-economic background, ethnicity, gender or sexuality."
        },
        {
            "text": "For more information on the CSEDN, whether that is for support or to get involved, please feel free to get in touch with us at EDSG@beis.gov.uk"
        }
    ]
}