{
    "url": "https://dcmslibraries.blog.gov.uk/2021/11/12/public-libraries-and-climate-change/",
    "title": "Public libraries and climate change",
    "authors": [
        "Cheryl Shorter, Libraries Team, DCMS"
    ],
    "categories": [
        "British Library",
        "Case study"
    ],
    "pub_date": "2021-11-12T12:45:44+00:00",
    "content": [
        {
            "text": "Over the last year, more and more organisations, business and governments across the world have paused to reflect and recommit to a better climate future.  "
        },
        {
            "text": "Libraries are no different.  At the heart of communities up and down the country, public libraries are an important driving force for change in our civic centres, a place of knowledge and a safe space to understand and commit to change.  At their heart too, libraries are hubs of sustainability.  Reusing and recycling books, and providing information to communities to underpin their own climate action, is at the core to what they do. "
        },
        {
            "text": "That’s why ahead of the COP26 Summit – the UN Summit on Climate Change – the British Library, alongside colleagues at Arts Council England and CILIP worked together to convene over 100 national and public libraries at a workshop to understand how libraries can work together to increase the impact of the library sector in bringing about a better climate future. "
        },
        {
            "text": "Organised by the British Library’s Living Knowledge Network – a partnership with public libraries to support cultural and knowledge exchange – the workshop brought together local, national and international speakers to explore what is already going on in the sector, to celebrate projects and initiatives developed on various levels, whilst also challenging ourselves to think about what more we can do on an individual, organisational and sector wide level to push this agenda further. "
        },
        {
            "text": "In the UK, we heard about the work of libraries in Wakefield who have worked hard to bring about festivals to celebrate spoken and written language – which this year was based on the theme of climate change.  From Helsinki, we heard about the ground-breaking work libraries have been doing over the last decade to inspire local communities to take action in the climate space. "
        },
        {
            "text": "From the Scottish Library and Information Council (SLIC) we heard about how climate has been deeply ingrained in the Scotland’s Public Library Strategy, and the team at the British Library outlined their three pronged approach to bringing about a climate future: committing to Net Zero and making extensive changes to make it happen in the years ahead, encouraging debate and discussion throughout public engagement programmes, and empowering staff to take action. "
        },
        {
            "text": "At the heart of the discussion and debate was recognising the power of public libraries in the communities they are based in, in being able to break down the sometimes overwhelming information and to disseminate this into the community. "
        },
        {
            "text": "But also, the role of public libraries to convene and encourage action.  We heard about libraries in Ukraine where children make things from recycled materials – encouraging a new generation of young people to think about sustainability – or libraries that act as a collection point for things such as waste electronics which has often been an issue for communities. "
        },
        {
            "text": "This was the first workshop of its kind for the UK public libraries.  And collectively, we hope to continue the conversations and inspire and support action in our sector.  "
        },
        {
            "text": "We know everybody will have to step up to play their role in bringing about a better climate future.  As national and public libraries, we know we are well placed to support this agenda. "
        }
    ]
}