{
    "url": "https://homeofficemedia.blog.gov.uk/2021/11/12/taking-action-to-tackle-channel-crossings/",
    "title": "Taking action to tackle Channel crossings",
    "authors": [
        "HO News Team"
    ],
    "categories": [
        "Fact sheet"
    ],
    "pub_date": "2021-11-12T18:11:41+00:00",
    "content": [
        {
            "text": "We are seeing an unacceptable rise in illegal migrants departing from France."
        },
        {
            "text": "The British public have had enough of seeing people die in the Channel while ruthless criminal gangs profit from their misery."
        },
        {
            "text": "These crossings are dangerous, with overloaded boats in busy shipping lanes."
        },
        {
            "text": "They are also unnecessary because France is a safe country and people should claim asylum there rather than risk their lives at the hands of criminal smugglers."
        },
        {
            "text": "This is part of a global issue. There are 80 million displaced people globally but not everyone who wants to come to the UK can do so. That’s why we prioritise those most in need through our safe and legal routes."
        },
        {
            "text": "Stopping the criminal gangs"
        },
        {
            "text": "The UK government, police, National Crime Agency and international partners are taking action at every level to take down the people smuggling gangs who are behind this surge in crossings."
        },
        {
            "text": "Having a maritime deterrent"
        },
        {
            "text": "It is critical that we have a maritime deterrent in the Channel."
        },
        {
            "text": "Border Force officers are authorised, trained and stand ready to use safe and legal options to stop these deadly crossings."
        },
        {
            "text": "All operational procedures used at sea comply with and are delivered in accordance with the law."
        },
        {
            "text": "Working with the French "
        },
        {
            "text": "It is disappointing how many migrants have managed to cross the Channel."
        },
        {
            "text": "The French have committed to working with us to prevent 100% of crossings, but it is vital they go further and faster to achieve this and do everything possible to stop people leaving French beaches in the first place."
        },
        {
            "text": "Our targeted efforts with the French have prevented more than 19,000 migrant attempts so far in 2021."
        },
        {
            "text": "Our long term plan to fix the broken system"
        },
        {
            "text": "The UK Government’s New Plan for Immigration is the only credible long-term solution to fix the broken system and seeks to make this route unviable."
        },
        {
            "text": "First published in March 2021, it has three fair but firm objectives:"
        },
        {
            "text": "At its heart is a simple principle: access to the UK’s asylum system should be based on need, not on the ability to pay people smugglers."
        },
        {
            "text": "Anyone who arrives in the UK illegally – where they could reasonably have claimed asylum in another safe country like France – will be considered “inadmissible” to the asylum system. We will seek to return them to a safe country."
        },
        {
            "text": "The legislation to support this plan is already making its way through Parliament and will:"
        },
        {
            "text": "These reforms will take time but the Government is determined to bring lasting change to the system so that it is fair but firm."
        }
    ]
}