{
    "url": "https://educationhub.blog.gov.uk/2023/05/kings-coronation-2023-why-are-primary-schools-receiving-wildflower-seeds/",
    "title": "King’s Coronation 2023: Why are primary schools receiving wildflower seeds?",
    "authors": [
        "mediaofficer"
    ],
    "categories": [
        "Schools"
    ],
    "pub_date": "2023-05-01T00:01:40+01:00",
    "content": [
        {
            "text": "We’re joining forces with the Eden Project to send thousands of packets of wildflower seeds to primary schools across the country to celebrate the coronation of His Majesty King Charles III."
        },
        {
            "text": "This will give schools the opportunity to mark this historic moment, while helping children to learn more about the importance of biodiversity."
        },
        {
            "heading": 3,
            "text": "Why are we sending schools wildflower seeds?"
        },
        {
            "text": "This initiative is inspired by His Majesty the King’s commitment to the environment. Working with the Eden Project’s National Wildflower Centre, over 200,000 seeds packets will be sent to schools."
        },
        {
            "text": "If planted together, around 40 rugby pitch sized wildflowers meadows would be created. The packets of seeds include native annual wildflower species, like cornflower, corn poppy and corn chamomile."
        },
        {
            "text": "Planting the seeds will be an opportunity for children to engage with the natural world and learn more about the importance of biodiversity, as well as being a way for them to celebrate a historic national moment."
        },
        {
            "text": "This is also a small but valuable way to improve biodiversity on school grounds, representing another step in our commitment to creating a greener, more sustainable world, as laid out in our Sustainability and Climate Change strategy."
        },
        {
            "heading": 3,
            "text": "When will children receive the seeds?"
        },
        {
            "text": "Seeds will be distributed to schools in the coming weeks. The Eden Project has made accompanying resources available here. Guidance for schools on where and how to plant the seeds is available here."
        },
        {
            "heading": 3,
            "text": "What else are schools doing to celebrate the Coronation?"
        },
        {
            "text": "To help schools to celebrate the Coronation, we have also commissioned a series of lesson plans and other teaching materials for primary and secondary schools to explain the significance of this historical moment."
        },
        {
            "text": "Schools and parents can also check out the Coronation map to find events happening in your area."
        },
        {
            "text": "Over the Coronation weekend, everyone across the country is also being invited to take part in nationwide events such as The Coronation Big Lunch and The Big Help Out on 8 May. Find out more about how children and families can get involved."
        },
        {
            "text": "Schools will be closed on Monday 8 May 2023 for the extra bank holiday."
        },
        {
            "heading": 3,
            "text": "What else are you doing to teach children about sustainability?"
        },
        {
            "text": "As laid out in our Sustainability and Climate Change strategy, we’re building a sustainable future by educating children about climate change and developing the skills needed for a green economy."
        },
        {
            "text": "For example, we’re rolling out the National Education Nature Park which brings together schools, colleges and other education settings into a vast virtual nature park, getting children and young people involved in improving the biodiversity of their schools."
        },
        {
            "text": "We’re also developing a new Natural History GCSE which will enable young people to explore the world by learning about environmental and sustainability issues, and gain a deeper knowledge of the natural world around them."
        },
        {
            "text": "Read more about the Sustainability and Climate Change strategy here."
        }
    ]
}