{
    "url": "https://naturalengland.blog.gov.uk/2025/10/10/a-landmark-year-for-englands-fungi/",
    "title": "A Landmark Year for England’s Fungi",
    "authors": [
        "Matthew Wainhouse"
    ],
    "categories": [
        "Evidence",
        "Monitoring",
        "Natural England",
        "Nature",
        "Protected sites and species",
        "Science and evidence",
        "Species re-introductions"
    ],
    "pub_date": "2025-10-10T23:22:00+01:00",
    "content": [
        {
            "text": "From international pledges to pioneering reintroduction projects, it’s been an exciting year for England’s fungi. Natural England Mycologist, Matt Wainhouse, reflects on remarkable year for fungal conservation."
        },
        {
            "heading": 4,
            "text": "Fungi on the global agenda"
        },
        {
            "text": "Fungi have often missed out in the global dialogue of nature conservation and were once described as the ‘orphans of Rio.'  So a major highlight came in October 2024 at the Convention on Biological Diversity (CBD) COP16 in Cali, Colombia, where the governments of the UK and Chile co-launched a ground-breaking Pledge for Fungal Conservation. This encourages nations to include fungi in their biodiversity policies, legislation and strategies. "
        },
        {
            "text": "By elevating fungi to the highest levels of global discussion, the Pledge has sparked a new international conversation—one that both governments remain committed to advancing."
        },
        {
            "text": "The Pledge recognises the fundamental role fungi play in the functioning of natural ecosystems and in human well-being. For example, they help keep the soil healthy by breaking down dead plants and animals, and they also help plants take in water and nutrients by working closely with their roots (mycorrhizal associations). This improves carbon sequestration, which is where carbon dioxide is removed from the atmosphere. Wild fungi are also important food sources for many people around the world. "
        },
        {
            "heading": 4,
            "text": "Red listing milestones and species recovery"
        },
        {
            "text": "Understanding how threatened a species is, is the first step towards recovery. "
        },
        {
            "text": "April saw a historic achievement: the Global Red List published its 1,000th fungal assessment. This is a big change from 2014, when only two fungi had been assessed in nearly 60 years. This progress is thanks to the dedication of a global network of mycologists ( scientists who study fungi). Now more than 1,300 species are on the list —including 77 from the UK, of which half live in natural grasslands that that haven’t been disturbed by farming or development."
        },
        {
            "text": "In the UK, work has started on creating the first official Great Britain Red List in nearly 15 years, of non-lichenised fungi (fungi species that don’t form lichens). This list will show which fungi are at risk and need protection. This collaborative assessment led by Natural England brings together fungi experts from Natural Resources Wales, NatureScot, Kew, Aberystwyth University, the British Mycological Society, as well as the wider mycologically community."
        },
        {
            "text": "The new Red Lists will cover around 600 species of grassland fungi (waxcaps and their allies) and Boletales, including an update of the Boletaceae Red List.  These add to the ongoing work on myxomycete and lichen Red Lists. The results from all these conservation status assessments will inform how we plan for their recovery through targeted conservation strategies and integrating their needs into new conservation projects.  "
        },
        {
            "heading": 4,
            "text": "Turning strategy into action"
        },
        {
            "text": "Many threatened species, including fungi, require bespoke measures to help their recovery, and in August, the Threatened Species Recovery Actions (TSRA) was published—outlining three key actions needed to support the recovery of over 1,000 species of animals, plants and fungi at risk of extinction. The list of species includes 155 species of fungi and lichen with more to be added in coming years as new Red Lists are produced."
        },
        {
            "text": "Bolete fungi and lichens currently make up 18% of the species on the Government’s Red List Index. TSRA actions range from taxonomic and ecological research to environmental DNA surveys, land manager guidance, and species reintroductions. These steps are essential to meet the government’s ambitious Environment Act target to reduce species’ extinction risk by 2042 compared to 2022. "
        },
        {
            "heading": 4,
            "text": "Breaking new ground with fungal reintroductions"
        },
        {
            "text": "Reintroductions are typically associated with animals and plants—but this year fungi joined the list. Two experimental fungal translocation trials have begun: "
        },
        {
            "text": "Both projects are carefully monitored and will provide vital evidence for future fungal and lichen restoration work. "
        },
        {
            "heading": 4,
            "text": "Unlocking the power of fungal data"
        },
        {
            "text": "Access to reliable data remains a key challenge for fungal conservation, often limiting inclusion in national assessments like State of Nature reports, research projects and conservation initiatives. To address this, Natural England partnered with the Biological Records Centre to map fungal data flows and highlight opportunities for improvements. "
        },
        {
            "text": "Crucially, this work engaged the field mycology community, revealing that their top motivations for recording are contributing to scientific knowledge and supporting conservation – making it all the more important to make their data accessible. In response, the Natural Capital and Ecosystem Assessment (NCEA) team at Natural England is now working with partners to mobilise fungal data, ensuring it reaches scientists and conservationists—exactly as recorders hope. "
        },
        {
            "heading": 4,
            "text": "A new era of collaboration"
        },
        {
            "text": "Perhaps the most inspiring moment of the year arrived this September with the launch of the Network for Fungal Conservation (NFC). Spearheaded by Plantlife mycologists and supported by Natural England, the NFC will bring together country agencies, environmental NGOs, botanic gardens, universities, land-owners, utilities and field mycologists."
        },
        {
            "text": "Its mission is to make sure fungi are firmly embedded in future nature recovery plans through strong collaboration. The inaugural event in Bristol was filled with the excitement and optimism needed to meet the ambition of the COP16 Pledge.  "
        },
        {
            "text": "We know fungi underpin healthy ecosystems, yet many species—and even entire communities—face growing threats. With progressive initiatives like the Fungal Conservation Pledge and the creation of the NFC, we now have a greater opportunity than ever to secure their future. "
        },
        {
            "text": "It's been a landmark year for fungi — and there's even more to look forward to. "
        }
    ]
}