{
    "url": "https://mhclgmedia.blog.gov.uk/2025/10/10/coverage-of-our-84-million-injection-to-tackle-homelessness/",
    "title": "Coverage of our £84 million injection to tackle homelessness",
    "authors": [
        "mhclgpress"
    ],
    "categories": [
        "Homelessness"
    ],
    "pub_date": "2025-10-10T16:18:01+01:00",
    "content": [
        {
            "text": "There has been media coverage today on our announcement on World Homeless Day confirming an extra £84 million for councils to tackle homelessness and rough sleeping."
        },
        {
            "text": "This is on top of the record £1 billion investment this year to end homelessness, the funding will support thousands of people facing homelessness, including immediate help for children and families in temporary accommodation."
        },
        {
            "text": "The Daily Mirror and Big Issue report that nearly £70 million will go towards helping to prevent rough sleeping, while children and families living in temporary accommodation will also receive help to cover essentials including food, school travel and laundry through a £11 million funding top up."
        },
        {
            "text": "Focussing on the money being given to each region, the London Standard focuses on the capital receiving a £36.5 million boost ahead of winter – the highest funding. BBC London also covered the story, featuring an interview with Minister McGovern during a visit to the Greenhouse Project, a homelessness support service in Hackney, alongside the Mayor of London.  "
        },
        {
            "text": "Local outlets, including the Bournemouth Echo, Westmorland Gazette, Cumberland News, Whitehaven News, BBC North West and BBC East Midlands positively report on the individual funds going to their areas to prevent and support homelessness."
        },
        {
            "text": "The £84m cash injection includes:  "
        },
        {
            "text": "Housing Secretary, Steve Reed said:"
        },
        {
            "text": "“Homelessness is a moral stain on our society. Growing numbers of people have been abandoned to sleep rough on the streets and children left in squalid, overcrowded conditions. "
        },
        {
            "text": "“This government will not stand idly by and allow that to continue. We will make different choices. That’s why we are investing £1 billion to give homeless people the security of a roof over their heads and get back on track to end homelessness for good.”"
        },
        {
            "text": "Homelessness Minister, Alison McGovern said:"
        },
        {
            "text": "“You can’t have a decent life without a decent home. Whether it’s rough sleeping or sofa surfing or, at its worst, children stuck in B&Bs, homelessness in the UK has been too high for too long.  "
        },
        {
            "text": "“This has to stop. Through our Plan for Change, the UK will build homes and get help to those who need it to put a roof over their head."
        },
        {
            "text": "“We’re providing extra cash now to address a crisis made over the past decade.  Both the government’s £39bn to build social and affordable homes and the Child Poverty Strategy to come will tackle the root causes of this problem, but we need action now to stop homelessness getting any worse.”"
        }
    ]
}