{
    "url": "https://socialworkwithadults.blog.gov.uk/2025/10/10/local-authorities-leaders-in-community-mental-health/",
    "title": "Local Authorities: Leaders in Community Mental Health",
    "authors": [
        "Christina Cheney",
        "Sarah McClinton",
        "Robert Lewis"
    ],
    "categories": [
        "Care and support",
        "Co-production",
        "Communities",
        "Mental health",
        "Our profession",
        "Viewpoint"
    ],
    "pub_date": "2025-10-10T09:21:25+00:00",
    "content": [
        {
            "text": "Introductions by Sarah McClinton and Robert Lewis"
        },
        {
            "text": "Local Authorities: Leaders in Community Mental Health by Christina Cheney"
        },
        {
            "text": "In recent years, approaches to mental health support have shifted towards more community based and socially informed care. This shift recognises that mental health issues are, at their core, social issues. Trauma, poverty, isolation, housing insecurity, oppression, discrimination, and unemployment are not just contributing factors — they are often the root causes of mental distress and addressing these social determinants is not a peripheral concern; it is central to effective mental health care. This is where social work and social care has so much to offer in this changing landscape."
        },
        {
            "text": "The Community Mental Health Framework for adults and older adults in England, promotes integrated and place-based care that is responsive to the full spectrum of an individual’s needs. Yet, despite the clarity of this vision, embedding a truly social approach within the medical, deficit-oriented, environment of the NHS remains a significant challenge. The culture of clinical diagnosis and treatment, while essential in many contexts, can inadvertently reshape or dilute strength-based and social work-led approaches. The NHS is a vast and complex system, turning its ship toward a more socially grounded model is no small feat."
        },
        {
            "text": "But perhaps we don’t need to turn that ship around. Perhaps the culture we seek already exists — and thrives — within our local authorities."
        },
        {
            "text": "Local authorities have long been the custodians of social care, and their infrastructure, ethos, and practices are inherently aligned with the principles of holistic mental health support. From prevention, rehabilitation and reablement through to crisis intervention, local authorities are not just stakeholders in community mental health — they are leaders. Their services span public health and suicide prevention to mental health social work, specialist commissioning, and the Approved Mental Health Professional (AMHP) function, all of which are designed to identify and address the social and structural issues that often lie behind mental distress and crisis."
        },
        {
            "text": "Mental health social work is delivered in a variety of settings nationally. Where there is strong local authority investment in, and oversight of, the profession, I believe there is greater opportunity to promote holistic and effective community mental health support. Systems can be optimised for social workers to help identify those social determinants of poor mental health and source solutions. To advocate for adjustments, build on strengths, support communities and, where necessary, commission non-medically oriented social care."
        },
        {
            "text": "In our current drive to build more integrated neighbourhood health services, there is much to learn from the decades of partnerships that local authorities have sustained with mental health colleagues – and the challenges that have led to so many of them being dissolved or redesigned. Are we learning from these experiences? The current 24/7 Neighbourhood Mental Health Pilots offer some insights. From their principles to their aims, these initiatives are a social model of mental health in action but, as with the Community Mental Health Transformation, are located and led by health partners. We need to be more proactive, host and lead these developments, not be included as stakeholders, we need our health systems to understand the value we bring.   "
        },
        {
            "text": "Local authorities bring expertise too to specialist commissioning. Their commissioning cultures are informed by social work practice, public health data, market engagement and co-production. This enables them to design services that are culturally competent, trauma-informed, and responsive to local contexts."
        },
        {
            "text": "As we look to embed the three shifts, from sickness to prevention, from hospital to community and from analogue to digital, it is imperative that we recognise and elevate the leadership role of local authorities and social workers in community mental health. They are not ancillary to the system — they are foundational. By investing in their capacity, listening to their expertise, and aligning national policy with their strengths, we can build a mental health system that truly meets people where they are, adapts to their needs and supports their recovery."
        }
    ]
}