{
    "url": "https://cyberandspecialistoperationscommand.blog.gov.uk/2025/10/10/minister-for-veterans-and-people-visits-british-forces-cyprus-in-first-overseas-engagement/",
    "title": "Minister for Veterans and People visits British Forces Cyprus in first overseas engagement",
    "authors": [
        "bobsendall"
    ],
    "categories": [
        "Uncategorized"
    ],
    "pub_date": "2025-10-10T08:48:22+01:00",
    "content": [
        {
            "text": "In her first overseas visit since taking office, Minister for Veterans and People, Louise Sandher-Jones, travelled to British Forces Cyprus to engage directly with personnel and families, reaffirming the UK Government’s commitment to supporting overseas postings."
        },
        {
            "text": "A veteran herself, the Minister reflected on her own service experience during her visit."
        },
        {
            "text": "During her time at BFC, the Minister met with service personnel and their families to hear about their lived experiences. Many shared that while overseas tours are seen as exciting opportunities, they also come with unique challenges – particularly the absence of extended family support. "
        },
        {
            "text": "Recognising support to family life, the Minister praised the Accompanied Established Long Term Relationship Overseas Pilot, which allows unmarried couples to access Service Family Accommodation (SFA). "
        },
        {
            "text": "During her visit, the Minister was shown infrastructure improvements that are in progress under Project Apollo. The Minister commended the upgrades at RAF Akrotiri, including enhancements to the runway and terminal, and the delivery of a new primary school for 450 pupils in Dhekelia."
        },
        {
            "text": "Meeting with veterans at the Royal British Legion Larnaca Branch in Cyprus, the Minister was interested to hear about the opportunities available to them and recognise their ongoing contributions. "
        },
        {
            "text": "British Forces Cyprus continues to play a crucial role in regional security, acting as a Forward Mounting Base for multiple operations and working closely with the Republic of Cyprus on joint training, delivering humanitarian aid, and most recently responding to wildfires. "
        },
        {
            "text": "Her visit sets a positive tone for her tenure, demonstrating a clear commitment to listening, learning, and advocating for those who serve."
        }
    ]
}