{
    "url": "https://defraenvironment.blog.gov.uk/2025/10/10/nature-by-the-numbers-what-the-2025-biodiversity-finance-trends-dashboard-reveals/",
    "title": "Nature by the numbers: what the 2025 Biodiversity Finance Trends Dashboard reveals",
    "authors": [
        "Hasan Hafeez",
        "Emma Jones",
        "Jessica Bridgman"
    ],
    "categories": [
        "Green finance",
        "Nature",
        "Research and data analysis"
    ],
    "pub_date": "2025-10-10T15:10:59+01:00",
    "content": [
        {
            "text": "Much of our work in Defra focuses on nature at home, but nature and its impacts do not adhere to national boundaries. International ecosystems directly affect our security and prosperity here in the UK. Global weather patterns, international supply chains, even our physical and mental health, all depend on thriving ecosystems worldwide. Protecting nature’s delicate balance requires us to invest in biodiversity internationally and embed nature into our economic systems to deliver real benefits at home and abroad.  "
        },
        {
            "text": "Yesterday at the UK’s Pre-COP event at the Natural History Museum, Defra’s Secretary of State, Rt Hon Emma Reynolds launched the 2025 Biodiversity Finance Trends Dashboard, which tracks global progress against biodiversity finance targets, as part of efforts to halt and reverse biodiversity loss as set out under the Kunming Montreal Global Biodiversity Framework (KMGBF). "
        },
        {
            "text": "We are part of the International Nature Finance Team in the International Biodiversity and Climate Directorate. In this post, we will share the history and purpose of the Dashboard and explore the trends in biodiversity finance. "
        },
        {
            "text": "Where it all began "
        },
        {
            "text": "The UK has long played a leading role within international nature finance.   "
        },
        {
            "text": "Prior to COP15, our team worked to convene a highly ambitious group of countries to map out the actions needed to plug the biodiversity funding gap of US$700 billion – in order to halt and reverse biodiversity loss by 2030.  "
        },
        {
            "text": "The commitments in the KMGBF were ambitious – but tracking progress was challenging as the monitoring framework was still to be agreed. To help keep up momentum, together with The Nature Conservancy (TNC), we pulled together data from a range of sources to develop indicators that offered an initial snapshot of progress against the finance targets in the KMGBF.  "
        },
        {
            "text": "This is now the third year of publishing the Dashboard. It serves as both a communication tool and a data resource to support complex biodiversity finance discussions. It helps maintain transparency where data is sparse and demonstrates UK leadership on advancing global biodiversity efforts. "
        },
        {
            "text": "What the latest trends tell us: the positives "
        },
        {
            "text": "The good news is that finance for nature has been steadily climbing year on year between 2019 and 2023, drawing from public bilateral, multilateral, philanthropic and some private finance sources.  "
        },
        {
            "text": "Preliminary OECD data for 2023 shows that collectively, we are on track to hit the US$20 billion 2025 interim target, with biodiversity-specific finance reaching US$16.8 billion and biodiversity-related finance hitting US$29.8 billion. "
        },
        {
            "text": "There is encouraging progress from the private sector with around US$23bn in private finance flowing to nature-based solutions in 2023, according to soon to be released UNEP data. More businesses are recognising their impact – and dependence – on the natural world, with many joining initiatives like the UK-supported Taskforce for Nature-related Finance Disclosures to better understand and report on nature-related risks. "
        },
        {
            "text": "We still face challenges ahead "
        },
        {
            "text": "Despite these positive trends, many indicators show we are still not on track to bridge the US$700 billion annual biodiversity finance gap needed to meet our 2030 targets. Public finance budgets are increasingly constrained, and private sector investment leveraged by public development finance in nature has been inconsistent. "
        },
        {
            "text": "Data availability and quality remain a significant hurdle. Getting timely, accurate, and transparent information across biodiversity finance indicators is challenging, and many indicators face a two-year time lag. Private sector finance data and information about reforming harmful subsidies remain frustratingly incomplete. "
        },
        {
            "text": "Looking ahead, several areas demand our attention "
        },
        {
            "text": "2025 brings several crucial deadlines, including the need for countries to identify incentives and subsidies that harm biodiversity – a vital first step towards reducing harmful finance flows by at least US$500 billion by 2030. Many countries have started this process. "
        },
        {
            "text": "The launch of the Cali Fund in February was a notable development, though no funding has yet been contributed. There is a clear expectation set by the Convention on Biological Diversity that businesses benefiting from the use of digital sequence information should share those benefits for the conservation of nature.  To support these efforts the UK and Chile launched the Friends of the Cali Fund at the UK-hosted Nature Action event in June 2025, a global coalition to drive progress and support the effective implementation of the mechanism. "
        },
        {
            "text": "More can be done to harness the connection between biodiversity and climate. While around 90% of bilateral biodiversity finance already contributes to climate goals, the reverse remains disappointingly low – it is critical that climate finance supports biodiversity outcomes. "
        },
        {
            "text": "Ensuring equitable access to biodiversity finance is also crucial. Preliminary OECD data shows biodiversity funds to Indigenous Peoples and Local Communities reached US$1.1 billion in 2023 – a welcome development, though there is room for significant improvement in getting finance to local nature stewards, and those who need it most. "
        },
        {
            "text": "National governments have a vital role in scaling up domestic finance through mechanisms like nature markets. The development and co-ordination of National Biodiversity Strategies and Action Plans, with National Determined Contributions and National Adaptation Plans should be a priority for every country. "
        },
        {
            "text": "The path forward "
        },
        {
            "text": "As we navigate an increasingly challenging economic and geopolitical landscape, the message is clear: we must urgently increase finance from all sources whilst phasing out harmful finance flows. "
        },
        {
            "text": "The Dashboard reminds us that protecting nature is not just an environmental imperative – it is an economic necessity. Whether you are a political or business leader, large landowner or small tenant farmer, the head of a local authority or region, or simply someone who cares about the natural world, we all have a role to play in ensuring finance flows towards nature, not away from it. "
        },
        {
            "text": "The numbers in this Dashboard are not just statistics – they represent our collective global commitment to safeguarding the biodiversity that underpins everything from our food systems to our climate resilience. We are making progress, but the scale of the challenge ahead means we need to accelerate our efforts across all sectors. "
        },
        {
            "text": "To find out more, access the Biodiversity Finance Trends Dashboard in full."
        }
    ]
}