{
    "url": "https://publicguardian.blog.gov.uk/2025/10/10/power-of-attorney-stories-nick/",
    "title": "Power of Attorney Stories: Nick",
    "authors": [
        "harryfortuna"
    ],
    "categories": [
        "Future planning",
        "lasting power of attorney",
        "LPA",
        "YourVoiceYourDecision"
    ],
    "pub_date": "2025-10-10T10:00:00+01:00",
    "content": [
        {
            "text": "[English] - [Cymraeg]"
        },
        {
            "text": "A lasting power of attorney (LPA) allows you to nominate someone you trust, known as an attorney, to step in if you lack the mental capacity to make certain decisions yourself. They are legal documents that cover decisions about health and welfare, or property and finance. "
        },
        {
            "text": "Nick, 68, from Wolverhampton, has been proudly championing power of attorney services for nearly a decade. When his mother was diagnosed with dementia, an LPA was quickly set up to allow Nick and his family to protect her autonomy. Without her LPA – and Nick’s foresight – he often wonders what may have happened during those final years.  "
        },
        {
            "heading": 4,
            "text": "Nick spoke to us about the power of proactivity, and how his early experiences with LPA’s shaped his decision to become a donor in his early sixties: "
        },
        {
            "text": "Like many of you reading this, I hadn’t given much thought to a lasting power of attorney – not at first, anyway.  "
        },
        {
            "text": "In some ways, that’s probably the point. LPAs aren’t meant to keep you up at night or sit in a desk drawer as a gloomy ‘what if’. They’re about giving you some peace of mind – just in case. Almost like a life jacket: you hope you never need it, but you wouldn’t get on a boat without one! "
        },
        {
            "text": "That’s exactly how I saw things when Mum was diagnosed with dementia. Everything felt so complicated. Things you take for granted – like managing a pension, sorting the bills, even getting carpets fitted – suddenly seemed like an uphill battle. I was doing my best to help, but without anything official in place, I kept hitting a brick wall. Banks wouldn’t talk to me, decisions were delayed, and in a situation that already felt overwhelming, everything became harder than it needed to be. "
        },
        {
            "text": "Once we had her LPA in place, however, everything changed. I could act on her behalf properly – officially – and with her best interests at heart. Anything she needed in those final years, she got, and I take a lot of pride and comfort in how we were able to care for her before the end.  "
        },
        {
            "text": "But I’ll be honest: we left it late. Her dementia progressed quicker than we expected, and although we had everything in place in time, that panic stuck with me. So, after Mum passed away, I thought: why wait? I’m still healthy, still thinking clearly – that’s the time to do it. "
        },
        {
            "text": "I couldn’t believe how straightforward it all was. I spoke to my wife and daughter, and within about half an hour I had everything printed, signed, and ready to post. Thanks to my mum, I learned that you never know what’s around the corner. I feel so much better knowing my family, and I, are taken care of should the unexpected happen.  "
        },
        {
            "text": "The thing is, it’s so easy to put off. We all do it. I’ve tried talking about LPAs with some of my golf buddies after a round, and the most common response I get is: “Yeah, yeah, I’ll sort that eventually.” But I know how quickly life can change. I’m already starting to see some of them becoming forgetful – and I don’t say that to be unkind. The truth is, we’re all living longer, and illnesses like dementia are becoming more common. I know some people find the idea a bit uncomfortable – like you’re always planning for the worst – but to me, it’s no different to sorting out a will, or having insurance. It’s not about being morbid; it’s about being prepared and protecting your choices. "
        },
        {
            "text": "And that’s the key thing for me: choice. I got to pick people I trust, who I know will act in my best interests, no matter what. It’s a simple right that everyone deserves.  "
        },
        {
            "text": "Setting up an LPA was one of the easiest things I’ve ever done – and one of the most significant. It gives you peace of mind, it gives your family clarity, and most importantly, it gives you control. So, if you're still on the fence, let me put it simply: don’t wait until you need one. Do it now, while it’s still your decision to make. "
        },
        {
            "text": "Nick and his mum are one of the many families across England and Wales that have made an LPA. "
        },
        {
            "text": "It's never too early to talk about lasting powers of attorney with someone you trust. Start a conversation today. "
        },
        {
            "text": "Find out more at  https://powerofattorney.campaign.gov.uk "
        },
        {
            "text": "[English] - [Cymraeg]"
        },
        {
            "heading": 1,
            "text": "Straeon Atwrneiaeth: Nick"
        },
        {
            "text": "Mae atwrneiaeth barhaol (LPA) yn caniatáu ichi enwebu rhywun rydych chi'n ymddiried ynddynt, a elwir yn atwrnai, i gamu i mewn os nad oes gennych chi'r gallu meddyliol i wneud rhai penderfyniadau eich hun. Maen nhw’n ddogfennau cyfreithiol sy'n ymdrin â phenderfyniadau ynghylch iechyd a lles, neu eiddo a chyllid. "
        },
        {
            "text": "Mae Nick, 68 oed, o Wolverhampton, wedi bod yn hyrwyddo gwasanaethau atwrneiaeth ers bron i ddegawd. Pan gafodd ei fam ddiagnosis o ddementia, sefydlwyd LPA yn gyflym i ganiatáu i Nick a'i deulu amddiffyn ei hymreolaeth. Heb ei LPA hi – a rhagwelediad Nick – mae o'n aml yn meddwl tybed beth allai fod wedi digwydd yn ystod y blynyddoedd olaf hynny.  "
        },
        {
            "heading": 4,
            "text": "Siaradodd Nick â ni am bŵer gweithredu’n rhagweithiol, a sut y gwnaeth ei brofiadau cynnar gydag Atwrneiaethau Arhosol lunio ei benderfyniad i ddod yn rhoddwr yn ei chwedegau cynnar: "
        },
        {
            "text": "Fel llawer ohonoch chi sy'n darllen hwn, doeddwn i ddim wedi rhoi llawer o feddwl i atwrneiaeth barhaol – nid ar y dechrau, beth bynnag.  "
        },
        {
            "text": "Mewn rhai ffyrdd, dyna’r pwynt, mae’n debyg. Nid bwriad LPAau yw eich cadw chi’n effro yn y nos nac eistedd mewn drôr desg fel ‘beth os’ digalon. Maen nhw’n ymwneud â rhoi rhywfaint o dawelwch meddwl i chi – rhag ofn. Bron fel siaced achub: rydych chi’n gobeithio na fydd ei hangen arnoch chi byth, ond fyddech chi ddim yn mynd ar gwch heb un! "
        },
        {
            "text": "Dyna'n union sut roeddwn i'n gweld pethau pan gafodd Mam ddiagnosis o ddementia. Roedd popeth yn teimlo mor gymhleth. Roedd pethau rydych chi'n eu cymryd yn ganiataol - fel rheoli pensiwn, trefnu'r biliau, hyd yn oed cael carpedi wedi'u gosod - yn sydyn yn teimlo fel brwydr lafurus. Roeddwn i'n gwneud fy ngorau i helpu, ond heb unrhyw beth swyddogol yn ei le, roeddwn i'n dal i daro wal frics. Doedd banciau ddim yn siarad â mi, roedd penderfyniadau'n cael eu gohirio, ac mewn sefyllfa a oedd eisoes yn teimlo'n llethol, daeth popeth yn anoddach nag oedd angen iddo fod. "
        },
        {
            "text": "Unwaith i ni roi trefn ar ei LPA, fodd bynnag, newidiodd popeth. Roeddwn yn gallu gweithredu ar ei rhan yn briodol – yn swyddogol – a hynny er mwyn ei buddiannau gorau. Unrhyw beth oedd ei angen arni yn y blynyddoedd olaf hynny, fe’i cafodd, ac rydw i’n cymryd llawer o falchder a chysur yn y ffordd y llwyddon ni i ofalu amdani cyn y diwedd.  "
        },
        {
            "text": "Ond mi fydda i’n onest: fe wnaethon ni adael pethau’n hwyr. Datblygodd ei dementia yn gyflymach nag yr oeddem yn ei ddisgwyl, ac er bod popeth yn ei le mewn pryd, arhosodd y panig hwnnw gyda mi. Felly, ar ôl i Mam farw, mi wnes i feddwl: pam aros? Rydw i’n dal yn iach, yn dal i feddwl yn glir - dyna'r amser i'w wneud. "
        },
        {
            "text": "Doeddwn i ddim yn gallu credu pa mor syml oedd y cyfan. Fe wnes i siarad â’m ngwraig a'm merch, ac o fewn tua hanner awr roedd popeth wedi'i argraffu, ei lofnodi, ac yn barod i'w bostio. Diolch i fy mam, mi wnes i ddysgu nad ydych chi byth yn gwybod beth sydd rownd y gornel. Rydw i’n teimlo gymaint yn well gan wybod bod fy nheulu, a minnau, yn mynd i dderbyn gofal petai’r annisgwyl yn digwydd.  "
        },
        {
            "text": "Y peth yw, mae mor hawdd ei ohirio. Rydyn ni i gyd yn ei wneud. Rydw i wedi ceisio siarad am LPAau gyda rhai o fy ffrindiau golff ar ôl rownd, a'r ymateb mwyaf cyffredin rydw i'n ei gael yw: \"Ie, ie, mi wna i sortio hynny yn y pen draw.\" Ond rydw i'n gwybod pa mor gyflym y gall bywyd newid. Rydw i eisoes yn dechrau gweld rhai ohonyn nhw'n mynd yn anghofus – a dydw i ddim yn dweud hynny i fod yn angharedig. Y gwir yw, rydyn ni i gyd yn byw'n hirach, ac mae afiechydon fel dementia yn dod yn fwy cyffredin. Rydw i'n gwybod bod rhai pobl yn gweld y syniad ychydig yn anghyfforddus - fel eich bod chi bob amser yn cynllunio ar gyfer y gwaethaf - ond i mi, dydi o ddim yn wahanol i drefnu ewyllys, neu gael yswiriant. Dydi o ddim yn ymwneud â bod yn morbid; mae'n ymwneud â bod yn barod ac amddiffyn eich dewisiadau. "
        },
        {
            "text": "A dyna'r peth allweddol i mi: dewis. Mae'n rhaid i mi ddewis pobl rydw i’n ymddiried ynddyn nhw, pobl rydw i’n gwybod a fydd yn gweithredu er fy lles gorau, beth bynnag fo’r amgylchiadau. Mae'n hawl syml y mae pawb yn ei haeddu.  "
        },
        {
            "text": "Roedd sefydlu LPA yn un o'r pethau hawsaf i mi erioed ei wneud – ac un o'r rhai mwyaf arwyddocaol. Mae'n rhoi tawelwch meddwl i chi, mae'n rhoi eglurder i'ch teulu, ac yn bwysicaf oll, mae'n rhoi rheolaeth i chi. Felly, os ydych chi'n dal ar y ffens, gadewch i mi ddatgan yn syml: peidiwch ag aros nes bod ei angen arnoch chi. Gwnewch o’n awr, tra’i fod yn dal eich penderfyniad chi i’w wneud.  "
        },
        {
            "text": "Mae Nick a'i fam yn un o'r nifer o deuluoedd ledled Cymru a Lloegr sydd wedi gwneud LPA. "
        },
        {
            "text": "Dydi hi byth yn rhy gynnar i siarad am atwrneiaethau parhaol gyda rhywun rydych chi'n ymddiried ynddynt. Dechreuwch sgwrs heddiw. "
        },
        {
            "text": "Dysgwch fwy yn https://powerofattorney.campaign.gov.uk/cy/home-page/"
        }
    ]
}