{
    "url": "https://educationhub.blog.gov.uk/2025/10/reducing-the-spread-of-illness-this-winter-seven-steps-to-healthier-schools-and-higher-school-attendance/",
    "title": "Reducing the spread of illness this winter: Seven steps to healthier schools and higher school attendance",
    "authors": [
        "mediaofficer"
    ],
    "categories": [
        "Attendance",
        "Schools"
    ],
    "pub_date": "2025-10-10T11:08:40+01:00",
    "content": [
        {
            "text": "As the colder months approach, we can expect to see increases in common airborne viruses. Illness is the biggest single reason for school absence; while some absences due to illness are unavoidable, many can be reduced through simple, proactive measures that minimise the spread of infections."
        },
        {
            "text": "Scientific evidence demonstrates that vaccination, disinfection (cleaning), handwashing, and ventilation can significantly reduce the transmission of infectious diseases. Schools can play an important role in helping reduce the spread of seasonal illnesses, helping keep pupils and staff healthy, supporting healthy learning environments and regular school attendance."
        },
        {
            "text": "In this blog, Professor Russell Viner, Chief Scientific Adviser at Department for Education sets out small actions schools can take across seven areas for maximum impact."
        },
        {
            "text": "Professor Russell Viner is a clinical paediatrician, professor at the University College London Great Ormond St. Institute of Child Health and former President of the Royal College of Paediatrics and Child Health."
        },
        {
            "heading": 3,
            "text": "1. Parents: Communicate to minimise unnecessary absence"
        },
        {
            "text": "The NHS provides clear guidance on when children are well enough to attend school. Most mild illnesses — such as a runny nose, sore throat, or slight cough — do not require time off school, unless a child has a temperature. Parents know their child best, but schools can support parents to make informed decisions by:"
        },
        {
            "heading": 3,
            "text": "2. Pupils and staff: Vaccinations for protection"
        },
        {
            "text": "Vaccinations are a key line of defence against flu and other preventable illnesses. When children and young people receive all the recommended vaccines in the national immunisation programme, it helps protect their health and support the wellbeing of the whole school community.  "
        },
        {
            "text": "School Age Immunisation Services (SAIS), commissioned by NHS England, deliver these free vaccinations in schools. This autumn, all school children in England (from reception to year 11) will be offered a flu vaccination at school."
        },
        {
            "text": "Schools can support vaccination programmes by:"
        },
        {
            "heading": 3,
            "text": "3. Pupils and staff: Handwashing is a simple but powerful tool"
        },
        {
            "text": "Hand hygiene is one of the most effective ways to prevent the spread of germs, particularly those that cause diarrhoea or vomiting. Schools can:"
        },
        {
            "heading": 3,
            "text": "4. Pupils and staff: Catch It, Bin It, Kill It approach to respiratory hygiene"
        },
        {
            "text": "Coughs and sneezes spread diseases, but simple everyday habits can help stop infection from spreading. Encourage children and staff to follow these easy habits: "
        },
        {
            "heading": 3,
            "text": "5. Environment: Good ventilation to provide fresh air"
        },
        {
            "text": "Good ventilation can help remove air that contains virus particles and prevent the spread of respiratory infections such as colds, flu and COVID-19. Here are some simple steps you can take: "
        },
        {
            "text": "Where spaces are mechanically ventilated, systems should be maintained to ensure their continued operation."
        },
        {
            "text": "Schools can consult this guidance on using CO2 monitors and air cleaning units."
        },
        {
            "heading": 3,
            "text": "6. Environment: Cleaning to keep a safe and healthy school environment"
        },
        {
            "text": "Regular cleaning helps reduce the spread of germs on surfaces. Schools should:"
        },
        {
            "heading": 3,
            "text": "7. Behavioural reminders: Small habits, big impact"
        },
        {
            "text": "Children (and staff!) benefit from regular reminders about hygiene and illness prevention. Schools can:"
        },
        {
            "heading": 3,
            "text": "Final thoughts"
        },
        {
            "text": "By taking simple, coordinated actions, schools can help reduce illnesses from spreading, promote pupil wellbeing, reduce illness-related absences and keep pupils learning through the winter months."
        },
        {
            "text": "Other useful links"
        },
        {
            "text": "Managing specific infectious diseases: A to Z - GOV.UK"
        },
        {
            "text": "Supporting vulnerable people before and during cold weather: for teachers and educational professionals - GOV.UK"
        },
        {
            "text": "Letter to school leaders on mild illness and school attendance - GOV.UK"
        }
    ]
}