{
    "url": "https://dwpdigital.blog.gov.uk/2021/11/22/british-muslim-and-proud/",
    "title": "British, Muslim and proud! ",
    "authors": [
        "Sadia Iqbal - Technology Services, DWP Digital"
    ],
    "categories": [
        "Digital Voices",
        "Diversity",
        "DWP Digital",
        "Women in Digital"
    ],
    "pub_date": "2021-11-22T12:12:08+00:00",
    "content": [
        {
            "text": "November is Islamophobia Awareness Month. Its purpose is to highlight the threat of Islamophobic hate crimes and showcases the positive contributions of British Muslims to society. "
        },
        {
            "text": "As I reflect during this month about why it’s important to recognise these forms of racism and bigotry, sadly the latest data reveals half of all recorded religious hate crime offences are targeted at Muslims. "
        },
        {
            "heading": 2,
            "text": "Discrimination, harassment and microaggressions "
        },
        {
            "text": "Personally, I’ve experienced several attacks. Following 9/11 I was in a North Eastern town and suddenly out of nowhere a man shouted “Taliban” at me.  "
        },
        {
            "text": "More recently in a busy city centre a man shouted racial abuse and told me “go back to where you come from. You come here and steal all our jobs”.  I was then followed for some few hundred yards and felt further intimidation.   "
        },
        {
            "text": "I've also experienced micro aggressions around the fact that I don’t drink alcohol or eat pork, been ridiculed for my choice of clothing and experienced assumptions that I’m not educated or cannot speak English. I’ve been offered the use of the toilet as a prayer area. And I’ve also been inappropriately questioned about whether I have hair beneath my scarf or whether I shower with my headscarf on. Sometimes I answer with equally ridiculous or frivolous answers, but most of the time I find it ignorant and upsetting.  "
        },
        {
            "heading": 2,
            "text": "Stereotyping and education "
        },
        {
            "text": "As a Muslim woman, there are so many stereotypes and preconceptions I’ve experienced. The most common of which has been due to my headscarf and being visibly Muslim. In fact, covering hair is hugely politicised like other aspects of women’s choices, be it about our bodies or our choice of clothing. Women in all walks of life, are criticised, harassed and even punished for their choices, from leaders, to politicians and celebrities.  "
        },
        {
            "text": "People often incorrectly assume I'm ‘oppressed’, forced to cover my hair or hold a subservient position. Yet this could not be further from the truth and for me wearing a headscarf is a personal choice. "
        },
        {
            "text": "I want to be judged on my skills and ability and not by my name, faith, or the way I dress.  "
        },
        {
            "text": "Muslim women often suffer hate crime daily and because it happens so often, they get so used to it and treat the experiences as normal, which needs to change through education and awareness. "
        },
        {
            "heading": 2,
            "text": "Confidence in the workplace "
        },
        {
            "text": "Despite my confidence there have been times when I’ve felt like an outsider in the workplace, from worrying about fitting in, to how I dressed. Regardless of securing roles by going through the many recruitment hoops, in my eyes I still felt that I got the jobs as a ‘fluke’. I think feelings of being an ‘outsider’ often stemmed from cultural and religious differences, for example, not participating in ‘lunch time’ or ‘Friday drinks’.  "
        },
        {
            "text": "My workplace experience completely changed a few years ago, when I joined one of the most diverse teams, I have experienced in my career in DWP, a team of skilled individuals from all walks of life. A team that was truly inclusive and representative of the citizens we serve, where individuals thrived and developed strong friendships too. A reminder that workplace diversity creates more successful organisations.  "
        },
        {
            "text": "I am really proud to be currently working in DWP Digital Workplace Transformation - another diverse team that strives to be inclusive. "
        },
        {
            "text": "Experiences of hate still hurt, despite experiencing them over many years. Sometimes I question whether I should be more ‘thick skinned’ but acknowledging and sharing my vulnerability is a sign of strength, and nobody should ever give in to discrimination. "
        },
        {
            "text": "Joining the DWP Digital Voices programme inspired me to share my story with you, and that showing some vulnerability is a sign of great leadership. Whoever you are, wherever you are, however you dress, be proud and continue to challenge and break barriers and stand up for others on a human level.  "
        }
    ]
}