{
    "url": "https://deframedia.blog.gov.uk/2021/11/22/consultation-launched-on-banning-single-use-plastics/",
    "title": "Consultation launched on banning single-use plastics",
    "authors": [
        "Defra Press Office"
    ],
    "categories": [
        "Uncategorized"
    ],
    "pub_date": "2021-11-22T12:25:33+00:00",
    "content": [
        {
            "text": "There has been widespread national media coverage including in BBC News Online, Sky News, the Telegraph, The Sun, the Guardian, the Independent, the i, the Times and the Daily Express of our announcement of the launch of a Government consultation on banning a number of single-use plastics."
        },
        {
            "text": "The story also featured on BBC Breakfast, and ITV News lunchtime and evening bulletins, while Sky News included a clip from an interview with Minister Churchill. This was also broadcast across a number of regional radio stations, including BBC Radio Northampton, BBC Radio Three Counties, BBC Radio Somerset, BBC Radio Lancashire, BBC Radio Hereford & Worcester, BBC Radio Cambridgeshire, BBC Radio Shropshire and BBC Radio London."
        },
        {
            "text": "The Government’s consultation is seeking views on the banning of single-use plastic plates, cutlery, expanded and extruded polystyrene cups and food and beverage containers."
        },
        {
            "text": "This is alongside the launch of a separate call for evidence to address other sources of pollution, which asks stakeholders for views on tackling commonly littered plastics such as wet wipes, tobacco filters, sachets and other single-use cups."
        },
        {
            "text": "Future policy measures that could be explored include banning plastic in these items, and mandatory labelling on packaging to help consumers dispose of these items correctly."
        },
        {
            "text": "The Government will also examine how we can put the responsibility firmly at manufacturers’ doors to make sure they are doing everything they can to tackle single-use plastics, including litter from cigarette butts."
        },
        {
            "text": "Environment Secretary George Eustice said:"
        },
        {
            "text": "“There is growing recognition of the damage that plastics cause to our environment and marine life in particular. We want to reduce the use of plastics in packaging and ban its use in items linked to littering."
        },
        {
            "text": "“We have already banned plastic straws, stirrers and cotton buds and now plan to extend the ban to cutlery and balloon sticks where alternative materials, like wood can be used.”"
        },
        {
            "text": "The consultation comes a week after the passage of the Environment Act which will enable tougher action on single-use plastics in England. The Act includes powers to place charges on single-use items, and the call to evidence will explore whether such a charge could be placed on single use cups or sachets to encourage a shift away from throwaway culture."
        },
        {
            "text": "The UK is a global leader in combatting plastic waste and has already taken major steps to tackle plastic pollution, banning microbeads in rinse-off personal care products, and restricting the supply of single-use plastic straws, stirrers and cotton buds."
        },
        {
            "text": "Following the huge success of the 5p charge on single-use carrier bags, which cut consumption in the main supermarkets by 95% since 2015, we increased the minimum charge to 10p and extended it to all retailers, ensuring we can take billions more bags out of circulation."
        },
        {
            "text": "Through the Environment Act, the Government is bringing in a wide range of further measures to tackle plastic pollution and litter, including:"
        },
        {
            "text": "We will also introduce a world-leading plastic packaging tax from April 2022, set at £200 per tonne, on plastic packaging which doesn’t meet a minimum threshold of at least 30% recycled content. This will encourage greater use of recycled plastic, leading to increased levels of recycling and plastic waste collection, helping to tackle the problem of plastic waste and protect our environment."
        },
        {
            "text": "Follow Defra on Twitter, and sign up for email alerts here."
        }
    ]
}