{
    "url": "https://defrafarming.blog.gov.uk/2021/11/22/preparing-for-bps-removal-why-you-should-consider-countryside-stewardship/",
    "title": "Preparing for BPS removal: why you should consider Countryside Stewardship ",
    "authors": [
        "Lauren Briggs"
    ],
    "categories": [
        "Countryside Stewardship"
    ],
    "pub_date": "2021-11-22T12:36:51+00:00",
    "content": [
        {
            "text": "Countryside Stewardship is a scheme which provides financial incentives for farmers, woodland owners, foresters and land managers to look after and improve the environment.  "
        },
        {
            "text": "The scheme will continue to be open to new applicants until 2023 (for agreements starting in 2024), while we develop and roll out our new environmental land management schemes. "
        },
        {
            "text": "I work for the Rural Payments Agency. We administer those payments.  "
        },
        {
            "text": "In this post, I’d like to share what we’ve done to make Countryside Stewardship a more attractive option for more farmers as they plan for the impact of Basic Payment Scheme (BPS) reductions and their subsequent removal.  "
        },
        {
            "text": "We’ve simplified things so that people have better experience when they apply - the scheme will open early next year (2022) for 2023 agreements. "
        },
        {
            "heading": 3,
            "text": "A quick overview of Countryside Stewardship  "
        },
        {
            "text": "Countryside Stewardship helps to protect and enhance our countryside.  "
        },
        {
            "text": "2023 will be the last year you can apply for agreements (to start in 2024) which will run for 5 years, which means you have a choice over the next few years on which scheme you’d like to take part in before we fully move over to the new environmental land management schemes. "
        },
        {
            "text": "The main elements are: "
        },
        {
            "heading": 3,
            "text": "Our improvements "
        },
        {
            "text": "People rightly expect an experience which is simple, fair and timely. We’ve worked closely with recipients to understand their experience and how it could be improved. "
        },
        {
            "text": "Here are the changes we’ve made as a result: "
        },
        {
            "text": "We also understand that the payment rate for options needed to be refreshed as they were set for 2013. We’ll be announcing the outcome of the review of the payment rates shortly. "
        },
        {
            "heading": 3,
            "text": "The impact of these changes "
        },
        {
            "text": "Encouragingly, so far the impact of these changes has been positive: application numbers have increased and we’ve been able to issue more payments, earlier in the payment window. "
        },
        {
            "text": "We’ve seen Countryside Stewardship applications more than double since 2018. At the moment, we have over 22,000 agreements in place, with around another 9,300 to be offered and accepted to start in January 2022. "
        },
        {
            "text": "To see whether Countryside Stewardship might be for you, visit our GOV.UK pages."
        },
        {
            "text": "If you have any questions about the changes, leave a comment below and my team and I will do our best to answer them.  "
        },
        {
            "text": "We’ll blog again when the scheme opens for applications. Do subscribe to the Future Farming Blog and the Rural Payments agency blog to hear the very latest. "
        }
    ]
}