{
    "url": "https://insidedio.blog.gov.uk/2021/11/22/revitalising-the-sand-dune-ecology-of-braunton-burrows/",
    "title": "Revitalising the sand dune ecology of Braunton Burrows",
    "authors": [
        "David Lincoln"
    ],
    "categories": [
        "Conservation",
        "Defence Training Estate (DTE)",
        "Environment and Ecology"
    ],
    "pub_date": "2021-11-22T18:41:34+00:00",
    "content": [
        {
            "text": "The Braunton Burrows sand dune system on the North Devon coast is the second largest dune system in the UK and a site of international importance for its wildlife and ecology. It’s also an excellent location for military training, with a rich history that includes the use of Braunton Burrows by American soldiers during World War Two in preparation for the D-Day landings. Today, DIO maintains the Braunton Burrows Training Area (BBTA) to enable all three services of the UK Armed Forces to carry out vital training."
        },
        {
            "text": "Unfortunately, an increase in vegetation across the site since the 1950s has reduced the number of open dune habitats which are essential for supporting wildlife, leading to a decline in several threatened species. To counter this, we are currently supporting Dynamic Dunescapes on a major project to restore Braunton’s sand dune ecology, with a focus on long-term sustainability."
        },
        {
            "heading": 2,
            "text": "About Braunton Burrows "
        },
        {
            "text": "Braunton Burrows is a Special Area of Conservation (SAC) and a Site of Special Scientific Interest (SSSI). In addition, Braunton forms the heart of North Devon UNESCO Biosphere Reserve and lies within the North Devon Area of Outstanding Natural Beauty."
        },
        {
            "text": "The site is home to rare and threatened plant life including the sea stock, round-headed club-rush and water germander, all of which have their largest native UK populations at Braunton. A total of 22 threatened or rare plant species can be found within the area, making Braunton Burrows a site of national botanical importance. In addition, a diverse range of moth, butterfly and mollusc species can be found within the dune habitats."
        },
        {
            "text": "For these plant and animal species to thrive, large areas of open dunes with plenty of bare sand are needed. However, over the decades vegetation and shrub growth has overrun much of the land, with as little as 5% of the dunes remaining ‘open’ by 2018. This has caused a drastic decline in several threatened species, with some becoming extinct from the area."
        },
        {
            "heading": 2,
            "text": "The project"
        },
        {
            "text": "To ‘wind back the ecological clock’ and revitalise the landscape of Braunton Burrows, Dynamic Dunescapes began a major dune restoration project in November 2020. The project is being carried out in partnership with Natural England, Plantlife, Natural Resources Wales, National Trust and The Wildlife Trusts, and is funded by the National Lottery Heritage Fund and the EU LIFE Programme."
        },
        {
            "text": "Much of the work currently underway involves ‘scraping’ of the dunes. This is a process whereby large diggers remove overgrown vegetation to expose the underlying sand, creating bare ground which can be colonised by threatened dune specialist species."
        },
        {
            "text": "To enable this work to be carried out safely, personnel from 29 Explosive Ordnance Disposal (EOD) and Search Group have been working alongside DIO’s Braunton Burrows Training Area training safety team. They are clearing the site of unexploded ordnance (UXO) dating back to World War Two, when American troops used Braunton Burrows for training ahead of the D-Day landings. Since the UXO clearance work began in April this year, some remarkable discoveries have been made including unexploded artillery and mortar shells as well as Sherman tank projectiles."
        },
        {
            "text": "Thanks to the support provided by 29 EOD and DIO's Braunton Burrows team, Dynamic Dunescapes have already been able to make major progress in the most recent phase of dune clearance, which began in October and will continue through this winter."
        },
        {
            "heading": 2,
            "text": "Looking to the future"
        },
        {
            "text": "The project will be completed by September 2023 and will restore dune habitats across a total area of around 65 hectares. Long-term sustainability is a key focus, and will be achieved through a range of actions including follow-up works such as scrub regrowth control, as well as carefully managed cattle grazing which has recently been re-instated on Braunton Burrows."
        },
        {
            "text": "We are proud to be supporting Dynamic Dunescapes in their ambition to restore 7,000 hectares of the UK’s most important coastal sand dune systems. As the project at Braunton Burrows progresses over the coming winter and beyond, I look forward to continued collaboration for the benefit of the local ecology and future generations of visitors to Braunton."
        }
    ]
}