{
    "url": "https://space.blog.gov.uk/2021/11/22/the-uk-and-canada-working-together-in-space/",
    "title": "The UK and Canada - working together in space",
    "authors": [
        "UK Space Agency"
    ],
    "categories": [
        "International"
    ],
    "pub_date": "2021-11-22T14:40:24+00:00",
    "content": [
        {
            "text": "Though separated by an ocean, the UK and Canada are working closer together in space than ever before, strengthening ties between our space companies, academics and governments for the benefit of our people and the planet."
        },
        {
            "text": "Last month, we signed a Memorandum of Understanding with the Canadian Space Agency at the International Astronautical Congress in Dubai, committing to working together to enhance bilateral cooperation opportunities."
        },
        {
            "text": "The agreement further enables collaboration on using space in vital and urgent areas, including studying our Earth to help fight climate change, and using satellites to keep us all connected wherever we are in the world."
        },
        {
            "text": "It also set a framework for future collaboration on space science and exploration, identifying areas to pool our world-space class space academics and technology to help discover more about our Universe."
        },
        {
            "text": " "
        },
        {
            "heading": 3,
            "text": "Canada House"
        },
        {
            "text": "The event on 17 November 2021 at Canada House was hosted with Canadian space company MDA, who also have a base here in the UK. MDA UK developed and built the high-speed ColKa antenna, which became the UK’s first industrial contribution to the International Space Station last year."
        },
        {
            "text": "The recent engagements with Canada build on a visit from a Canadian delegation in early 2020, which identified opportunities for collaborative research and commercial opportunities in the exploitation of space data."
        },
        {
            "text": "Our recently published National Space Strategy sets out international partnerships as one of the key priorities for UK in space, highlighting collaboration with our global partners as central to achieving our ambitions and building future global innovation."
        },
        {
            "text": "Our strengthening space collaboration with Canada builds on longstanding scientific ties between our two countries, where we already work together in areas including the COVID-19 response, genomics, AI and quantum technologies."
        }
    ]
}