{
    "url": "https://aphascience.blog.gov.uk/2021/11/22/world-antimicrobial-awareness-week-2021/",
    "title": "What you need to know about drug resistant infections: the invisible pandemic",
    "authors": [
        "Rod Card"
    ],
    "categories": [
        "Antimicrobial Resistance"
    ],
    "pub_date": "2021-11-22T09:00:48+00:00",
    "content": [
        {
            "text": "Spread awareness, stop resistance - the theme of this year’s World Antimicrobial Awareness Week. Taking place between 18 and 24 November this annual event aims to increase awareness and best practice to prevent the spread of drug-resistant infections."
        },
        {
            "text": "This year we hear from Rod Card, APHA Head of the United Kingdom’s Food and Agriculture Organization of the United Nations (FAO) Reference Centre for antimicrobial resistance. An expert in his field, Rod describes how APHA is working at the core of this global issue, sharing our world-renowned knowledge and expertise internationally."
        },
        {
            "text": "The COVID-19 global pandemic has changed the way many of us work. Home working and meetings via video link are now commonplace. Some jobs, however, cannot be done from home including laboratory-based roles, such as those undertaking surveillance and diagnosis of antimicrobial resistance (AMR) in bacteria."
        },
        {
            "text": "During the COVID-19 pandemic our AMR Reference centre has continued to support global efforts to tackle the threat of AMR and provide capacity development support to our partners."
        },
        {
            "text": "AMR was recently highlighted as an invisible pandemic and a profound threat to global health security, food safety, and food security at a High-Level Dialogue organised by the General Assembly of the United Nations."
        },
        {
            "heading": 3,
            "text": "Delivering Expert international training"
        },
        {
            "text": "Established in 2018, the UK FAO Reference Centre for AMR has visited 10 countries, to date, providing expert advice and training to help support their ambition to tackle the threat of AMR.  APHA has participated in collaborative projects in Ghana, Bangladesh, and Nigeria."
        },
        {
            "text": "The UK FAO Reference Centre for AMR is funded by Defra and the Department of Health and Social Care’s Fleming Fund*, with the aim of helping low- and middle-income countries fight antimicrobial resistance. Work with the Fellows was funded through the Fleming Fund’s Fellowship programme."
        },
        {
            "text": "Last year I wrote about hosting the Nigerian animal health Fleming Fellows we mentor, for training and coaching at our UK laboratories. Our work in Nigeria is done in close partnership with public health colleagues at the United Kingdom Health Security Agency (UKHSA) and the two human health Fleming Fellows they mentor. By establishing this community of practice we address AMR in a One Health manner, a multi-disciplinary approach to address threats to public and animal health and the ecosystems that interlink them."
        },
        {
            "text": "Unfortunately, international travel restrictions have prevented us from visiting Nigeria. We therefore changed to providing increased support remotely. In this way we were able to support the delivery of the One Health AMR training courses the four fellows have successfully delivered at their home institutes."
        },
        {
            "text": "I am pleased to say that a total of 132 scientists from government, academic, and private laboratories in Nigeria have received training through this programme."
        },
        {
            "text": "Training was led by the Fellows and delivered at their home institutes in Nigeria: National Veterinary Research Institute (Jos), University of Ibadan (Ibadan), Nigerian Centre for Disease Control (Abuja), and University College Hospital (Ibadan)."
        },
        {
            "text": "The two-to-three-day courses comprised a thoughtful balance of lecture room teaching and hands-on sessions in the laboratory. This gave the participants practical experience handling and testing bacterial cultures, as well as background and wider context for their AMR work."
        },
        {
            "text": "The courses were held on different days, enabling fellows to contribute remotely to each other’s training programmes. Furthermore, we benefited from the participation of another member of our community of practice, a Fellow specialising in veterinary antimicrobial use who is mentored by Denmark’s FAO Reference Centre for AMR."
        },
        {
            "text": "Subject matter experts from the AMR Reference Centre and UKHSA gave presentations via video link on a range of topics including: veterinary medicines regulation and policy, AMR susceptibility testing methods, AMR surveillance, AMR in aquaculture, quality control, and health and safety. We also presented on how to interpret susceptibility testing data to determine if a bacterium is resistant or susceptible to antibiotics. AMR Reference Centre staff from APHA, the Centre for Environment Fisheries and Aquaculture Science (Cefas), and the Veterinary Medicines Directorate (VMD) all contributed to these teaching sessions."
        },
        {
            "text": "Post-course feedback from participants was very positive and praised course quality and content. Participants expressed a strong desire to implement the new learning in their home laboratories, to improve the quality and value of AMR data they generate. We have already had many requests to run additional courses."
        },
        {
            "heading": 3,
            "text": "The value of our work"
        },
        {
            "text": "This training strengthened Nigerian institutional capacities through up-skilling of laboratory staff and enhancing their capacity to produce high-quality microbiological data. This all helps to help build a One Health AMR surveillance system and support implementation of Nigeria’s national action plan for AMR."
        },
        {
            "text": "This work also highlighted the value of our ‘train-the-trainer’ approach, in which fellows received instruction in the UK and then disseminated this learning to colleagues in their home institutions. As the UK team did not need to travel to Nigeria for this training, we were also able to use our funds more efficiently and reduce our travel-related CO2 emissions."
        },
        {
            "text": "We look forward to continued work with our colleagues in Nigeria and the UKHSA to tackle the threat of AMR in a One Health manner."
        },
        {
            "heading": 3,
            "text": "Further reading"
        },
        {
            "text": "You may be interested in reading related blogs in our antimicrobial resistance blog catalogue."
        },
        {
            "text": "* The Fleming Fund is a £265 million UK aid investment to tackle antimicrobial resistance in low- and middle-income countries around the world. The programme is managed by the UK Department of Health and Social Care."
        },
        {
            "text": " "
        }
    ]
}