{
    "url": "https://food.blog.gov.uk/2023/12/12/chief-executives-stakeholder-message-supporting-innovation/",
    "title": "Chief executive's stakeholder message - Supporting innovation",
    "authors": [
        "Emily Miles, Chief Executive"
    ],
    "categories": [
        "Our mission"
    ],
    "pub_date": "2023-12-12T12:24:27+00:00",
    "content": [
        {
            "text": "Cymraeg"
        },
        {
            "text": "One of the FSA’s guiding principles from our 2022 strategy is that we “anticipate change and respond quickly to fast-moving developments in the food sector”. "
        },
        {
            "text": "Since Brexit, the FSA has been responsible for making recommendations to ministers on the authorisation of new regulated food and feed products coming onto the UK market. By definition, this is where innovation is happening in the food industry."
        },
        {
            "text": "For example, cell-cultivated products, sometimes referred to as lab-grown meat, along with other new forms of protein, have the potential to be more sustainable. They must be subject to a rigorous and independent safety assessment before being placed on the market. We’ve recently published guidance on cell-cultivated products, to help businesses navigate the authorisation process."
        },
        {
            "text": "Earlier this year, the FSA Board asked the FSA to look at reforming the food and feed products approval system."
        },
        {
            "text": "We’re also looking at how to use large businesses’ data to regulate them at an enterprise level."
        },
        {
            "text": "If you would like to hear more about our reform programme on authorising products, or on enterprise-level regulation, you can watch the next FSA Board meeting live on Wednesday (13 December) at 9am. You can also read about our work in the papers we have published for the Board."
        },
        {
            "text": "If you have any thoughts or questions on the FSA’s work, please let us know in the comments section below."
        },
        {
            "heading": 1,
            "text": "Neges i randdeiliaid – Arloesi"
        },
        {
            "text": "Un o egwyddorion arweiniol yr Asiantaeth Safonau Bwyd (ASB) o’n strategaeth 2022 yw ein bod yn “rhagweld newid ac yn ymateb yn gyflym i ddatblygiadau cyflym yn y sector bwyd”. "
        },
        {
            "text": "Ers ymadael â’r UE, mae’r ASB wedi bod yn gyfrifol am wneud argymhellion i weinidogion ar awdurdodi cynhyrchion bwyd a bwyd anifeiliaid rheoleiddiedig newydd sy’n cael eu rhoi ar farchnad y DU. Yn naturiol, dyma lle mae arloesedd yn digwydd yn y diwydiant bwyd."
        },
        {
            "text": "Er enghraifft, mae gan gynhyrchion a wneir drwy feithrin celloedd (cell-cultivated products), a elwir weithiau’n gig a dyfir mewn labordy, ynghyd â mathau newydd eraill o brotein, y potensial i fod yn fwy cynaliadwy, ond rhaid iddynt fod yn destun asesiad diogelwch trwyadl ac annibynnol cyn cael eu rhoi ar y farchnad. Yn ddiweddar, rydym wedi cyhoeddi canllawiau ar gynhyrchion a wneir drwy feithrin celloedd i helpu busnesau i lywio’r broses awdurdodi."
        },
        {
            "text": "Yn gynharach eleni, gofynnodd Bwrdd yr ASB i’r ASB ystyried diwygio’r system cymeradwyo cynhyrchion bwyd a bwyd anifeiliaid."
        },
        {
            "text": "Rydym hefyd yn ystyried sut i ddefnyddio data busnesau mawr i’w rheoleiddio ar lefel menter."
        },
        {
            "text": "Os hoffech glywed mwy am ein rhaglen ddiwygio ar awdurdodi cynhyrchion, neu ar reoleiddio ar lefel menter, gallwch wylio cyfarfod nesaf Bwrdd yr ASB  yn fyw, ddydd Mercher (13 Rhagfyr) am 9am. Gallwch gofrestru i wylio’r cyfarfod yn fyw ar-lein yma. Gallwch hefyd ddarllen am ein gwaith yn ym mhapurau’r Bwrdd sydd wedi’u cyhoeddi."
        },
        {
            "text": "Os oes gennych unrhyw sylwadau neu gwestiynau am waith yr ASB, rhowch wybod i ni yn yr adran sylwadau isod."
        }
    ]
}