{
    "url": "https://naturalengland.blog.gov.uk/2023/12/12/dartmoor-next-steps-from-the-independent-review/",
    "title": "Dartmoor – next steps from the Independent Review",
    "authors": [
        "Natural England"
    ],
    "categories": [
        "Biodiversity",
        "Farming",
        "Landscapes",
        "Natural England",
        "Site of Special Scientific Interest",
        "wildlife and farming"
    ],
    "pub_date": "2023-12-12T16:47:01+00:00",
    "content": [
        {
            "text": "By Dave Slater, Natural England Regional Director for the South West"
        },
        {
            "text": "The Independent Review of Protected Site Management on Dartmoor has been published today and makes a number of recommendations on the future of Dartmoor."
        },
        {
            "text": "We welcome this review and will consider the recommendations in detail, along with our colleagues in Defra, the Rural Payments Agency and our partners on Dartmoor, before responding next year."
        },
        {
            "text": "The Farming Minister is writing to all HLS (Higher Level Stewardship) agreement holders whose agreements expire in 2024 and we and the RPA will be in touch with them again in advance of their expiry dates to agree continued funding for their work on conservation grazing on Dartmoor’s important wildlife sites."
        },
        {
            "text": "Our priority has always been, and will always be, to work in the combined best interests of nature and farmers on Dartmoor. The review however makes clear we need to look at how we can better communicate this with farmers and set out what support is available to them, and we have boosted the size of our team on Dartmoor as a first step in doing this."
        },
        {
            "text": "As the Government’s advisor for the natural environment, we have a statutory duty to protect those sites containing the nation’s most precious examples of wildlife and biodiversity and to meet legally binding targets for our most important protected sites. There is however clear evidence that, despite the efforts of farmers, Natural England and others such as the National Park Authority and wildlife organisations, the ecological condition on Dartmoor has declined significantly and, as the review sets out, there is no doubt that change is needed."
        },
        {
            "text": "We know the current approach is not working for any party: for nature, for farmers, and all those who treasure Dartmoor National Park. We welcome the call for collective change, including change by Natural England which we are committed to make. We now need to take stock of these findings and make sure that all partners, old and new, come together so we can learn from each other and pursue a shared long-term vision for Dartmoor."
        },
        {
            "text": "As the report rightly acknowledges, Dartmoor is a complex landscape and this will not be easy - but it is possible. We’ve seen how quickly landscapes can recover with the right management and are encouraged by the examples of farmers we work alongside in other parts of the country and on Dartmoor, who have adapted their farming systems in a way that allows nature to recover and thrive while supporting economically viable businesses."
        },
        {
            "text": "We have spent a lot of time listening this year. We recognise the uncertainty some farmers are feeling as the new agri-environment schemes are rolled out and, as we consider the review’s recommendations, there are steps we are already able to take. We have additional advisers working with farmers on Dartmoor, including on three ambitious new Landscape Recovery projects, and we are exploring what recommendations we might make to Defra about how we can offer more bespoke funding for farmers to pay them fairly for taking part in conservation grazing on Dartmoor, especially those who care for SSSIs, our most important wildlife sites."
        },
        {
            "text": "Dartmoor’s farming community is already playing a key role in supporting nature recovery across the National Park, including on SSSIs. Natural England is committed to recovering and improving Dartmoor’s habitats and, vitally, ensuring farmers are properly supported and rewarded for the role they play. This will require collective action and trust between all partners – and we are ready to play our part and make the changes required of us."
        }
    ]
}