{
    "url": "https://dluhcmedia.blog.gov.uk/2023/12/12/final-round-of-brownfield-land-release-fund-2-to-deliver-more-homes/",
    "title": "Final round of Brownfield Land Release Fund 2 to deliver more homes",
    "authors": [
        "dluhcpress"
    ],
    "categories": [
        "Housing"
    ],
    "pub_date": "2023-12-12T16:31:44+00:00",
    "content": [
        {
            "text": "The Department for Levelling Up, Housing and Communities has announced today that councils across England will be able to bid for a share of the final round of the £180 million Brownfield Land Release Fund 2."
        },
        {
            "text": "This latest round will release council-owned brownfield sites through up to £80 million to transform neglected and unloved land into thriving communities – creating thousands of construction jobs and delivering over 8,000 new homes by March 2028."
        },
        {
            "text": "The funding builds on the government’s long-term plan for housing which prioritises brownfield land for new homes to be on track to deliver the manifesto commitment of 1 million homes over this Parliament."
        },
        {
            "text": "Trade outlets such as Property Week have reported that the full Brownfield Land Release Fund 2 is expected to support the development of 17,600 new homes and create 56,000 new jobs over the next four years. The first two rounds, in November 2022 and October 2023, have so far supported 89 local authorities and more than 160 projects."
        },
        {
            "text": "As part of today’s announcement, the Minister of State for Housing visited Northampton where the Department previously awarded £470,000 to West Northamptonshire Council through the Brownfield Land Release Fund 1 to unlock land for affordable housing. Local outlet Northampton Chronicle reported on the Minister’s visit to New Southbridge Road to launch the final round of funding, carrying his quote, which referred to building more homes on brownfield land as “past of our mission to level up the country”."
        },
        {
            "text": "ITV Anglia accompanied the Minister during his visit for a package on their evening bulletins. They questioned him about the importance of using brownfield land to deliver more homes and how the government intends to meet its pledge to build 300,000 new homes a year."
        },
        {
            "text": "Minister for Housing Lee Rowley MP said:\n"
        },
        {
            "text": "Councils in England can apply for the final round of the Brownfield Land Release Fund 2 here."
        }
    ]
}