{
    "url": "https://forestrycommission.blog.gov.uk/2023/12/12/girdling-at-bullens-wood-a-management-technique-to-thin-trees/",
    "title": "Girdling at Bullens Wood – a management technique to thin trees",
    "authors": [
        "Hugh Dorrington"
    ],
    "categories": [
        "Woodland Ambassadors",
        "Woodland management"
    ],
    "pub_date": "2023-12-12T08:00:43+00:00",
    "content": [
        {
            "text": "Hugh Dorrington, one of the Forestry Commission’s Woodland Ambassadors, has been involved in tree supply and woodland planting since 1980. He is the owner of the tree nursery Aveland Trees and has written several blogs on planting and management which can be read on their website. In this blog, he discusses his experience with girdling at Bullens Wood."
        },
        {
            "text": "In 1989, I planted a hectare of mixed native broadleaved trees including ash, oak, grey alder, field and Norway maple to create Bullens Wood in Dunsby, South Lincolnshire. Bullens Wood was planted in a field corner that had been uncropped for three years and the biggest obstacle to its establishment was rank weed growth, mainly grasses."
        },
        {
            "text": "The trees were protected with 60cm spiral guards and supported by 90cm canes which allowed spot spraying with Glyphosate around all trees for the first two years. Ash was used for beating up (replacement of newly planted trees) after the first year only, and it took two or three years of maintenance to get the wood established."
        },
        {
            "heading": 2,
            "text": "Discovering a promising timber crop"
        },
        {
            "text": "I had a good look at the woodland in 2010 and discovered that I had some very promising timber trees growing tall and straight. Some of the oaks were being out competed by faster growing trees but those that remained were the best of the best."
        },
        {
            "text": "I realised that I would have to do some thinning straightaway to save the remaining oak and allow the best ash and Norway maple to develop broad healthy crowns. The grey alder produces much fewer cones than common alders and so were of less value to seed eating birds."
        },
        {
            "text": "I had to start thinning to allow the oaks to develop. This, combined with the fact that grey alder is a poor timber tree, meant that it was the obvious choice to start building up the dead wood habitat and soil carbon storage in Bullens Wood."
        },
        {
            "heading": 2,
            "text": "Thinning trees by girdling"
        },
        {
            "text": "I didn’t want the expense of employing felling contractors, and I wanted close control over the thinning operation, so I began trials of thinning trees myself by girdling (also referred to as ring-barking) – a technique that involves using a sharp tool to cut through a tree’s bark to kill the tree without having to cut it down. An advantage of girdling is that the trees do not need to be removed from site and can create an important habitat in the form of standing deadwood which will decompose over time benefitting woodland soils and biodiversity."
        },
        {
            "text": "Once the trees needing to be thinned were selected and marked, they could be quickly girdled – with all the protective equipment in place – you can hold a chainsaw against the tree at waist height and cut through the bark as you walk around the tree. Simple girdling is not enough to kill the tree – the cambium (the layer of the tree’s trunk beneath the bark) will regrow, so I applied a solution of Glyphosate with a hand applicator to the cut, which was 100% effective in killing the tree"
        },
        {
            "heading": 2,
            "text": "The encouraging signs of girdling"
        },
        {
            "text": "When trees are girdled in the autumn or winter, they will usually come into leaf the following spring. Carbohydrates produced by photosynthesis are unable to be transported through the tree, so the roots starve and die. The roots are then unable to pump sap up into the canopy and the tree dies."
        },
        {
            "text": "As the tree slowly dies it first sheds its leaves, then the smaller twigs and branches. Three years after girdling, most trees have a stem that is sound and dry (about 20% moisture, a bit more at the base and much less in the smaller branches of the crown, which will all dry quickly below 20% when prepared for burning). This is ideal for firewood, as it needs no further storage and can be taken straight from the wood to the stove."
        },
        {
            "text": "I fell my girdled ash trees for my own personal firewood, but other girdled trees are left to decompose and complete the woodland cycle, to benefit wildlife and boost biodiversity."
        },
        {
            "text": "A typical girdled tree will remain standing for many years because the branches become brittle and drop off, while the roots stay sound. Eventually, just the stump remains. There is little danger of a girdled tree toppling because the roots anchor the tree for many years even after it has died. On the other hand, a tree that has suffered root infections for many years may fall with a full crown at any time, possibly doing considerable damage to property and could endanger people."
        },
        {
            "heading": 2,
            "text": "How tree girdling benefits biodiversity"
        },
        {
            "text": "Conventional felling produces sudden gaps in the canopy that increase the exposure of neighbouring trees to the sun and wind. Thinning by girdling results in no sudden changes to the environment, and therefore no sudden changes to tree growth. Oaks often produce epicormic shoots (a shoot growing from a bud underneath the bark of a trunk, stem, or branch) after a thinning – this reduces the value of their timber. By contrast, girdling slowly opens gaps in the canopy over several years as the girdled tree dies, allowing plenty of time for the crowns of neighbouring trees to grow into the new space."
        },
        {
            "text": "Girdling results in a natural process like a tree dying slowly of disease. A complete woodland ecosystem requires standing and lying dead trees at all stages of decomposition. This can be achieved by girdling but not harvesting the trees."
        },
        {
            "text": "When a tree dies, its natural defences are removed. It becomes a particularly rich environment for insects and fungi as well as woodpeckers and other wildlife. When the dead branches fall they become lying deadwood. The dead wood becomes moist, and decay is hastened by insects and fungi making it their new home. Organic matter makes its way into the soil and the woodland begins to build up its carbon storage."
        },
        {
            "text": "When girdling, you should avoid creating lots of recently dead standing trees within a contained space. For example, if a species being girdled is prone to a wood boring pest such as Ips typographus in spruce, this deadwood could be a perfect habitat for the pest."
        },
        {
            "text": "Girdling is the same as felling as far as felling licences are concerned (five cubic metres are allowed for your own use each calendar quarter without a felling licence). When it comes to felling a girdled tree, no felling licence is required because the tree is already dead."
        },
        {
            "text": "Thinning by girdling has allowed me to manage Bullens Wood by myself, with just one or two days of light work each year using a battery powered chainsaw."
        },
        {
            "heading": 2,
            "text": "Nurturing a woodland habitat"
        },
        {
            "text": "Over the last 10 years or so I have removed most of the grey alder from Bullens Wood’s canopy. Over that time the roots will have fixed plenty of nitrogen in the soil. Now it is time for more valuable trees to benefit from this. The rotting alder stumps are full of insect holes, and large branches are scattered over the woodland floor – nurturing this woody habitat."
        },
        {
            "text": "Girdling can also be used to produce rotten limbs on living trees for conservation purposes. In this picture the side limb of a grey alder has been girdled. The soft, rotten wood would be ideal for a willow tit to excavate its nest site."
        },
        {
            "text": "The oaks in Bullens Wood are my pride and joy. Several of the weaker oak trees were suppressed before I started managing the woodland. I have been caring for the remaining trees by thinning any ash and Norway maple that shade the crowns of the oaks. The time will come when I must thin some of the oak trees where they are growing too close to each other. That will be a difficult decision to take."
        },
        {
            "heading": 2,
            "text": "Encouraging tall, straight trees"
        },
        {
            "text": "I have girdled about 50% of the ash trees so far, leaving the straightest trees to expand their crowns. Chalara has not affected any of the trees, although it has been present in neighbouring woodlands since 2014. Three years after girdling the ash trees they are felled and used for firewood as and when required."
        },
        {
            "text": "Many Norway maple in Bullens Wood have a fork in the main stem. These have also been removed by girdling to leave just the straight, single stemmed trees."
        },
        {
            "text": "The field maple trees are filling the woodland understorey and ensure that the canopy trees are growing tall and straight. It has not been necessary to thin the field maple as they are scattered throughout the wood and form the understory, typically not competing with the timber producing canopy trees for sunlight."
        },
        {
            "heading": 2,
            "text": "Is tree girdling for you?"
        },
        {
            "text": "The girdling technique may not be suitable for large commercial woodlands, and nor would it be suitable in open woodlands or for clear felling and coppicing. In these cases, the extra light would simply encourage a girdled tree to sprout new shoots from the base. The risks posed by creating standing deadwood must also be carefully considered in the context of public access and neighbouring infrastructure such as roads, building etc."
        },
        {
            "text": "However, I do think it will provide another tool to help the thousands of hectares of new woodland being planted now to be managed simply, effectively, and safely for quality timber production, biodiversity and nutrient recycling."
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        }
    ]
}