{
    "url": "https://defrafarming.blog.gov.uk/2023/12/12/improving-farm-productivity-grants-get-ready-for-round-2/",
    "title": "Improving Farm Productivity grants: get ready for Round 2",
    "authors": [
        "Izzie Wells"
    ],
    "categories": [
        "Payments for equipment, technology and infrastructure"
    ],
    "pub_date": "2023-12-12T12:36:06+00:00",
    "content": [
        {
            "text": "In a few weeks’ time, you will once again have the opportunity to apply for an Improving Farm Productivity grant. To help you prepare, we’ve published guidance on GOV.UK. "
        },
        {
            "text": "In this post, I’ll share an overview of the grant, the changes we've made in this round and a link to the guidance. "
        },
        {
            "heading": 2,
            "text": "Robotic and automatic machinery and the use of solar equipment "
        },
        {
            "text": "The Improving Farm Productivity grant is open to horticultural and arable businesses and will pay for capital items to improve farm and horticulture productivity through: "
        },
        {
            "text": "Contractors from those sectors are eligible to apply for grants towards the purchase of robotic and automated equipment, but not solar equipment. "
        },
        {
            "text": "For robotic and automated equipment, we are reducing the minimum grant available to £25,000 and the maximum grant available remains at £500,000. The grant will cover up to 40% of the cost of eligible items.  "
        },
        {
            "text": "For solar equipment, the minimum grant available is £15,000, with the maximum grant being £100,000. The grant will cover up to 25% of the cost of eligible items. "
        },
        {
            "text": "You can apply for both automated and robotic equipment and solar equipment, however your maximum grant amount cannot exceed £500,000 in total for both applications together. "
        },
        {
            "text": "The grant is part of the Farming Investment Fund. "
        },
        {
            "heading": 2,
            "text": "What’s new for Round 2 "
        },
        {
            "text": "Since launching Round 1, we’ve gathered valuable feedback on how we can improve the grant.  "
        },
        {
            "text": "Previously, the fund offered grants for robotic autonomous systems and slurry acidification equipment. "
        },
        {
            "text": "We are taking on board feedback received from stakeholders by decreasing the minimum grant amount to £25,000 and broadening the scope of the offer to fund both robotic and automated innovative equipment to aid crop and livestock production. "
        },
        {
            "text": "By doing this, we now hope to benefit a broader range of agricultural and horticultural applications in Round 2. "
        },
        {
            "text": "Round 1 of the grant included slurry acidification equipment, however this has now been removed from Round 2. "
        },
        {
            "text": "Following the announcements made at the Farm to Fork conference held at No.10 in May and on Back British Farming Day in September, we are also pleased to introduce a new solar equipment offer to the fund. "
        },
        {
            "heading": 2,
            "text": "Applying for a grant "
        },
        {
            "text": "The first step to apply will be an online checker, which is expected to open in January and run until March. This will assess your eligibility and likelihood of success and will, in turn, determine whether you are invited to submit a full application.  "
        },
        {
            "text": "We’ll blog again when it’s time to apply. "
        },
        {
            "text": "If you have any questions about the grant after reading the guidance, leave a comment below. "
        }
    ]
}