{
    "url": "https://naturalengland.blog.gov.uk/2023/12/12/new-area-added-to-licensing-scheme-to-protect-great-crested-newts-and-promote-sustainable-development/",
    "title": "New area added to licensing scheme to protect great crested newts and promote sustainable development",
    "authors": [
        "Natural England"
    ],
    "categories": [
        "Biodiversity",
        "Development",
        "Environment Act",
        "Natural Capital",
        "Natural England",
        "Protected sites and species",
        "Species recovery",
        "Wildlife"
    ],
    "pub_date": "2023-12-12T09:32:37+00:00",
    "content": [
        {
            "text": "Natural England has launched a new licensing scheme in Hertfordshire to help conserve local populations of great crested newts, while promoting sustainable development."
        },
        {
            "text": "Since Natural England launched District Level Licensing (DLL) in 2019, the scheme has expanded to cover 21 scheme areas each encompassing one or more counties. Excitingly, we are pleased to announce the scheme is expanding to its 22nd area, Hertfordshire, which developers can now apply to join."
        },
        {
            "text": "Great crested newt populations have experienced a significant decline over the last 60 years, despite being designated as a European Protected Species (EPS). This decline can be attributed in part to the loss of ponds in the UK during the 20th Century."
        },
        {
            "text": "The DLL scheme tackles this issue at the landscape scale by using innovative modelling to predict where great crested newts are now, and where the best places are to create and restore ponds to support them in the future. When a development commits to joining DLL, the impact of the development is converted into a financial contribution that the developer then commits to pay. 85% of the funding is used by Natural England and our delivery partners to create and restore ponds. This also covers monitoring, management, and maintenance of the ponds across 25 years."
        },
        {
            "text": "The scheme also benefits local people, developers, and local authorities by avoiding costly delays for developments, helping to ensure homes are built all year round and ensuring local authorities can deliver their plans."
        },
        {
            "text": "Duncan Brown, Natural England’s District Level Licensing Operations Manager, said:"
        },
        {
            "text": "\"Natural England is delighted to be working in partnership with the Farming Wildlife and Advisory Group (FWAG) East Consultancy, who have also delivered ponds in Cambridgeshire, Leicestershire and Essex for DLL, and Hertfordshire County Council to create and restore ponds for great crested newts. FWAG East have a proven track record of delivering DLL ponds and we’re excited to complete the roll out of DLL in the south-east of England."
        },
        {
            "text": "\"To service development immediately under the DLL scheme, we have already created over forty ponds in the county and we are welcoming enquiries to use the scheme from today."
        },
        {
            "text": "\"Early indications from the DLL ponds FWAG East have already created or restored in Hertfordshire are promising; great crested newts were found to be present in 70% of the 23 ponds surveyed in our annual monitoring from 2023. These ponds will also provide a critical role to support wider biodiversity and lead towards nature recovery.\""
        },
        {
            "text": "Lucy Jenkins, Farm Environment Adviser from FWAG East Consultancy Ltd. said:"
        },
        {
            "text": "“FWAG East are excited to continue working with Hertfordshire farmers and landowners to create and restore ponds across the county to provide new and better habitat for great crested newts and other wildlife. This project offers a fantastic opportunity for landowners to access funding to deliver high-quality freshwater habitats on their land, helping to conserve these important habitats and the myriad species that rely on them.”"
        },
        {
            "text": "You can apply to join a district level licensing scheme for great crested newts if you are developing land via GOV.UK."
        },
        {
            "text": "If you would like to learn more about how our scheme works, please check out our YouTube video."
        }
    ]
}