{
    "url": "https://moderncivilservice.blog.gov.uk/2023/12/12/project-simplify-keeping-it-simple/",
    "title": "Project Simplify: Keeping it simple",
    "authors": [
        "Government Reform"
    ],
    "categories": [
        "A Modern Civil Service",
        "Capability",
        "Data science",
        "Government Reform",
        "Innovation",
        "Proud Civil Servant",
        "Skilled Civil Service"
    ],
    "pub_date": "2023-12-12T09:40:25+00:00",
    "content": [
        {
            "text": "Project Simplify supports an Innovative Civil Service which is focused on rewarding and encouraging our staff to find innovative solutions to problems in order to deliver better outcomes for the public."
        },
        {
            "text": "Since the Machinery of Government change to create the Department for Business and Trade (DBT), teams have been grappling with unifying policies, bringing together people and building a shared culture and ways of working."
        },
        {
            "text": "Building a new organisation presented a unique opportunity to focus on modernisation and innovation, and streamlining inherited processes. There was no longer a shared history for ‘doing things the way they’ve always been done’ and instead offered an opportunity for staff to challenge the status quo."
        },
        {
            "text": "Project Simplify was launched by the Permanent Secretary, Gareth Davies, with an open invitation to colleagues to share their suggestions for how we could simplify processes and overcome barriers that make it harder to get their jobs done."
        },
        {
            "text": "Alex Ratcliffe, who coordinated the project, said: “Having visible sponsorship from the Permanent Secretary empowered people to make suggestions. We received over 300 staff suggestions that enabled us to understand where to focus our energy and effort and look at our processes and ways of working differently.”"
        },
        {
            "heading": 3,
            "text": "The mechanics"
        },
        {
            "text": "The project was run as a sprint, and staff were given six weeks to submit suggestions to the Simplify mailbox. Teams across DBT reviewed and scored the suggestions based on viability, the scale of benefit, and timescale to implement a practical solution.  "
        },
        {
            "text": "The Permanent Secretary brought together a Simplify Taskforce with representatives from across the Department to prioritise the areas of greatest importance to staff. Two-thirds of the suggestions fell in the following priority areas:"
        },
        {
            "text": "A shortlist of suggestions that could be implemented immediately or within three months were taken forward. The taskforce also agreed to take forward a small package of longer-term suggestions, where the nub of the issue related to systematic challenges or highly complex processes."
        },
        {
            "text": "Everyone who submitted a Simplify suggestion was kept informed and told whether a change had been made in response. Where a suggestion couldn’t be implemented, staff members were informed why and were told about the wider or linked changes that could be implemented. Open communication and upfront honesty that not every suggestion could practically be implemented was vital in managing expectations and closing the feedback loop."
        },
        {
            "heading": 3,
            "text": "What has changed?"
        },
        {
            "text": "As expected when establishing a new department, many suggestions related to how we connected with each other on shared policy areas and commissioning work. "
        },
        {
            "text": "In response, our Government Digital and Data team improved staff profiles on our intranet and made changes to the staff directory to ensure people’s details and location were more readily accessible, helping to improve collaboration. The team also made it clear who is responsible for each intranet page, making it easier for colleagues to contact the right person. These were some of the quicker wins overall."
        },
        {
            "text": "There were many suggestions relating to more systematic and complex challenges. The taskforce agreed the need for two longer term pieces of work led by HR and Finance to improve the recruitment process and the purchase to pay processes. "
        },
        {
            "text": "One example of this is that many staff thought that the process to recruit and onboard new starters could be much quicker. Security Vetting is one key aspect of recruitment and onboarding and in September, the Department implemented its own DBT Vetting Service, meaning that we now work directly with UKSV, the national vetting provider. "
        },
        {
            "text": "The impact of these changes is being monitored and in the longer-term the HR team are delivering a wider recruitment action plan, to pilot new ways of using our online recruitment system and gather feedback for continuous improvement. "
        },
        {
            "heading": 3,
            "text": "Next steps for Simplify"
        },
        {
            "text": "Most of the commitments from Simplify’s summer sprint have now been implemented. Between now and the new year, the focus is on communicating these improvements, so that staff understand and can test whether they value the benefits of the changes. We are keeping a close eye on the user experience and are currently collecting feedback."
        },
        {
            "text": "In 2024, we are going to formally launch the permanent Simplify initiative: keeping the central process for identifying and prioritising suggestions, and helping to embed a continuous improvement culture in the DNA of DBT."
        },
        {
            "text": "Simplify’s focus on practical changes made in direct response to staff ideas has captured colleagues’ imagination. For Sarah Moore, a Regional Support Manager in Cardiff, it has improved how she collaborates. Sarah said: “Updates to our staff directory to include detailed location information make it easier for me to find people and connect across the UK.” "
        }
    ]
}