{
    "url": "https://competitionandmarkets.blog.gov.uk/2023/12/12/secondment-opportunities-for-competition-and-consumer-lawyers-2/",
    "title": "Secondment opportunities for competition and consumer lawyers",
    "authors": [
        "John Bardsley"
    ],
    "categories": [
        "Life at the CMA"
    ],
    "pub_date": "2023-12-12T13:00:25+00:00",
    "content": [
        {
            "text": "We are launching a new round of secondment opportunities for lawyers, to start on 18 March 2024."
        },
        {
            "text": "Since its launch in June 2018, over 50 secondees from over 20 law firms have taken part in the programme and we are now accepting applications for the next round which is anticipated to start on 18 March 2024."
        },
        {
            "text": "We invite you to consider whether your firm and any of your associates wish to participate."
        },
        {
            "text": "The deadline for applications is 12 January 2024."
        },
        {
            "text": "Our programme offers an exciting opportunity for competition and consumer lawyers:"
        },
        {
            "text": "Comments from previous secondees:"
        },
        {
            "text": "“Being seconded to the mergers unit of the CMA as a principal case officer has been an incredible experience. I had the chance to work on very interesting cases, while working with very smart, thoughtful and friendly colleagues along the way. I would definitely recommend it to every competition lawyer.”"
        },
        {
            "text": "\"I thoroughly enjoyed my secondment to the CMA’s Consumer team. My colleagues were very welcoming and friendly, and got me involved from day one. I helped scope for new consumer law enforcement cases and this taught me a lot about strategy, prioritisation and working within a team to make decisions. I also helped launch and run enforcement cases over my secondment. Overall, this experience was incredibly valuable as I was able to develop my understanding of consumer laws and CMA enforcement powers.  The project I was on very much sat at the forefront of law and technology. Further, the CMA clearly value knowledge sharing as there is no shortage of talks and seminars to attend.”"
        },
        {
            "text": "\"Working within the Digital Markets Unit has been fantastic. I am so grateful for the opportunity and have learned a lot. It has been fascinating working on the shaping of future legislation.\""
        },
        {
            "text": "Application details"
        },
        {
            "text": "Secondments are open to all qualified lawyers currently employed in a law firm in the UK and with previous experience working on competition and/or consumer law or related litigation matters. While secondees to date have been based in our London office, we are open to consider requests for secondments to be based in CMA offices in Belfast, Edinburgh or Manchester."
        },
        {
            "text": "We aim to offer secondees a range of work suitable for their level of experience and to provide training as part of the role, Our secondments last for 6 months with two intakes annually on a rolling basis. The CMA will contribute a flat rate to the cost of secondees, with further details available on request."
        },
        {
            "text": "Firms that would like to put candidates forward should email a CV and covering letter for each candidate by 12 January 2024 to Simon Harms, David Riley, Victoria Oates and John Bardsley."
        },
        {
            "text": "As part of their covering letter, candidates should confirm that they are able to start their secondment on 18 March 2024 for a 6-month period."
        },
        {
            "text": "Candidates should also express any preference for particular types of work within the CMA which we will do our best to accommodate, including with a view to maximising a firm’s exposure to different CMA tools among their associates seconded over time."
        },
        {
            "text": "Candidates should be available to have a meeting or call with the CMA during the weeks of either 15 January 2024 or 22 January 2024 to discuss the secondment."
        },
        {
            "text": "Please note we will not consider applications via agencies."
        },
        {
            "text": "If you have any questions or would like to discuss the benefits of the programme, please contact any of Simon Harms, David Riley, Victoria Oates or John Bardsley."
        },
        {
            "heading": 3,
            "text": "Contact details for secondment programme queries:"
        },
        {
            "text": "Simon Harms "
        },
        {
            "text": "Legal Director Simon.Harms@cma.gov.uk"
        },
        {
            "text": "David Riley"
        },
        {
            "text": "Legal Director David.Riley@cma.gov.uk"
        },
        {
            "text": "Victoria Oates"
        },
        {
            "text": "Assistant Legal Director  Victoria.Oates@cma.gov.uk"
        },
        {
            "text": "John Bardsley"
        },
        {
            "text": "Assistant Legal Director John.Bardsley@cma.gov.uk"
        },
        {
            "text": " "
        }
    ]
}