{
    "url": "https://insidehmcts.blog.gov.uk/2023/12/12/supporting-students-to-understand-the-justice-system/",
    "title": "Supporting students to understand the justice system",
    "authors": [
        "Rachel Newman, Senior Legal Manager"
    ],
    "categories": [
        "General",
        "Working at HMCTS"
    ],
    "pub_date": "2023-12-12T13:00:34+00:00",
    "content": [
        {
            "text": "Earlier this year, I had the pleasure of organising a work shadowing and mentoring programme for law students from the University of West London. "
        },
        {
            "text": "The scheme gave students the opportunity to spend a week with HMCTS in the South East region, offering them an insight into the court system and highlighting the diverse range of work across the different jurisdictions. "
        },
        {
            "text": "As a Senior Legal Manager, I saw this programme as an opportunity not only for the students but also for HMCTS. It provided HMCTS with a chance to showcase the role of a legal adviser and raise awareness of the other varied career opportunities available within the organisation. "
        },
        {
            "text": "The students were placed in one of 10 courts across the region, and each was paired with a legal adviser mentor. Meetings were held between mentors and mentees at the beginning and at the end of the week to explain their roles and expectations during the work shadowing and mentoring programme. "
        },
        {
            "text": "The University decided which students would be offered the opportunity to participate in the programme and gave priority to those who had no connections in the legal profession and no-one to signpost them to work experience opportunities. "
        },
        {
            "text": "Students observed a variety of jurisdictions to give them a flavour of the diverse type of work HMCTS offers. Each student spent time observing magistrates’ courts, the Crown Court, county courts and tribunals. Throughout the week, the team supplemented the observations with daily webinars and presentations on Teams: "
        },
        {
            "text": "I worked closely with Philip Ells, Head of the Law School at the University of West London, to arrange the placements and to review how the week had been received. Phil echoed the importance of such opportunities for students, particularly those from diverse backgrounds:  "
        },
        {
            "text": "“Many of our students at the School of Law come from the most deprived economic and social backgrounds. We are always seeking ways of enhancing our students’ exposure to legal practice. The HMCTS mentoring scheme has proven universally popular and enjoyable from the positive feedback of our students and we very much hope that the success of this first iteration will be repeated across the regions and our students will have further opportunities in future”.  "
        },
        {
            "text": "The feedback we received from students was overwhelmingly positive:  "
        },
        {
            "text": "‘I had burnt out and lost my passion to pursue a legal career but deciding to participate in this work experience programme has motivated me so much’.  "
        },
        {
            "text": "‘The shadowing experience was exceptional and gave me the confidence to have my training contract with HMCTS after my LPC. I had never viewed this route before until this shadowing experience. I have literally fallen in love with law.’  "
        },
        {
            "text": "The week provided an opportunity to showcase the work of the courts whilst enabling students to learn more about the invaluable work that legal advisers play in the justice system. "
        },
        {
            "text": "I am delighted with the positive feedback we received from the students with a number confirming they are now considering a career within our organisation. The placement opened their eyes to potential career pathways, and due to its success, we hope to extend such opportunities to more universities and students in the next academic year.  "
        },
        {
            "text": "If you are a university lecturer or law student interested in future work shadowing opportunities, please contact Legalrecruitment@justice.gov.uk.\n"
        },
        {
            "text": "[English] - [Cymraeg]"
        },
        {
            "heading": 1,
            "text": "Rhaglen lleoliad gwaith ar gyfer Cynghorwyr Cyfreithiol y dyfodol"
        },
        {
            "text": "Awdur: Rachel Newman, Uwch Reolwr Cyfreithiol"
        },
        {
            "text": "Yn gynharach eleni, cefais y pleser o drefnu rhaglen cysgodi a mentora yn y gwaith ar gyfer myfyrwyr y gyfraith o Brifysgol Gorllewin Llundain."
        },
        {
            "text": "Rhoddodd y cynllun gyfle i fyfyrwyr dreulio wythnos gyda GLlTEF yn rhanbarth De Ddwyrain Lloegr, gan gynnig cipolwg iddynt ar y system llysoedd a thynnu sylw at yr ystod amrywiol o waith a wneir ar draws y gwahanol awdurdodaethau."
        },
        {
            "text": "Fel Uwch Reolwr Cyfreithiol, gwelais y rhaglen hon fel cyfle nid yn unig i'r myfyrwyr ond hefyd i GLlTEF. Rhoddodd gyfle i GLlTEF arddangos rôl cynghorydd cyfreithiol a chodi ymwybyddiaeth o'r cyfleoedd gyrfa amrywiol eraill sydd ar gael yn y sefydliad."
        },
        {
            "text": "Cafodd y myfyrwyr eu lleoli mewn un o 10 llys ar draws y rhanbarth, a chafodd pob un ohonynt eu paru â mentor a oedd yn gynghorydd cyfreithiol. Cynhaliwyd cyfarfodydd rhwng y mentoriaid a’r rhai hynny a oedd yn cael eu mentora ar ddechrau ac ar ddiwedd yr wythnos i egluro eu rolau a'u disgwyliadau yn ystod y rhaglen cysgodi a mentora yn y gwaith."
        },
        {
            "text": "Y Brifysgol wnaeth benderfynu pa fyfyrwyr fyddai'n cael y cyfle i gymryd rhan yn y rhaglen a rhoddwyd blaenoriaeth i'r rhai nad oedd ganddynt unrhyw gysylltiadau â’r proffesiwn cyfreithiol a neb i'w cyfeirio at gyfleoedd profiad gwaith."
        },
        {
            "text": "Arsylwodd myfyrwyr amrywiaeth o awdurdodaethau i roi blas iddynt o'r math amrywiol o waith y mae GLlTEF yn ei gynnig. Treuliodd pob myfyriwr amser yn arsylwi llysoedd ynadon, llysoedd y goron, llysoedd sirol a thribiwnlysoedd. Trwy gydol yr wythnos, mi wnaeth y tîm ategu at yr arsylwadau drwy gynnal gweminarau a chyflwyniadau dyddiol ar Teams:"
        },
        {
            "text": "Gweithiais yn agos â Philip Ells, Pennaeth Ysgol y Gyfraith ym Mhrifysgol Gorllewin Llundain, i drefnu'r lleoliadau ac i adolygu sut y derbyniwyd yr wythnos. Adleisiodd Phil bwysigrwydd cyfleoedd o'r fath i fyfyrwyr, yn enwedig y rhai o gefndiroedd amrywiol:"
        },
        {
            "text": "\"Mae llawer o'n myfyrwyr yn Ysgol y Gyfraith yn dod o'r cefndiroedd economaidd a chymdeithasol mwyaf difreintiedig. Rydym bob amser yn chwilio am ffyrdd i wella amlygiad ein myfyrwyr i ymarfer cyfreithiol. Mae cynllun mentora GLlTEF wedi profi i fod yn boblogaidd ac yn bleserus o’r adborth cadarnhaol a gafwyd gan ein myfyrwyr ac rydym yn mawr obeithio y bydd llwyddiant y cohort cyntaf hwn yn cael ei ailadrodd ar draws y rhanbarthau ac y bydd ein myfyrwyr yn cael cyfleoedd pellach yn y dyfodol\"."
        },
        {
            "text": "Roedd yr adborth a gawsom gan fyfyrwyr yn hynod gadarnhaol:"
        },
        {
            "text": "'Roeddwn yn flinedig ac wedi colli fy angerdd i ddilyn gyrfa ym maes y gyfraith ond mae penderfynu cymryd rhan yn y rhaglen profiad gwaith hon wedi fy ysgogi gymaint'. "
        },
        {
            "text": "\"Roedd y profiad cysgodi yn arbennig a rhoddwyd yr hyder i mi geisio cael cytundeb hyfforddi gyda GLlTEF ar ôl cwblhau fy LPC. Doeddwn i erioed wedi ystyried y llwybr hwn o'r blaen tan y profiad cysgodol hwn. Rwyf wedi syrthio mewn cariad â'r gyfraith.\""
        },
        {
            "text": "Roedd yr wythnos yn gyfle i arddangos gwaith y llysoedd tra'n galluogi myfyrwyr i ddysgu mwy am y gwaith amhrisiadwy y mae cynghorwyr cyfreithiol yn ei wneud yn y system gyfiawnder."
        },
        {
            "text": "Rwy'n falch iawn o'r adborth cadarnhaol a gawsom gan y myfyrwyr gyda nifer yn cadarnhau eu bod bellach yn ystyried gyrfa yn ein sefydliad. Agorodd y lleoliad gwaith eu llygaid i lwybrau gyrfa posibl, ac oherwydd ei lwyddiant, rydym yn gobeithio ymestyn cyfleoedd o'r fath i fwy o brifysgolion a myfyrwyr yn y flwyddyn academaidd nesaf."
        },
        {
            "text": "Os ydych chi'n ddarlithydd prifysgol neu'n fyfyriwr y gyfraith sydd â diddordeb mewn cyfleoedd cysgodi yn y gwaith yn y dyfodol, cysylltwch â Legalrecruitment@justice.gov.uk"
        }
    ]
}