{
    "url": "https://space.blog.gov.uk/2024/10/11/a-new-challenge-using-satellite-tech-to-monitor-algal-blooms-in-northern-ireland/",
    "title": "A new challenge: using satellite tech to monitor Algal Blooms in Northern Ireland",
    "authors": [
        "Chris McQuire"
    ],
    "categories": [
        "Earth observation",
        "Satellites"
    ],
    "pub_date": "2024-10-11T09:50:20+01:00",
    "content": [
        {
            "text": "For generations Lough Neagh, Northern Ireland’s largest freshwater lake, has been central to the livelihoods and well-being of those living nearby."
        },
        {
            "text": "In recent years, the lake's clear waters have faced a growing threat: harmful blue-green algal blooms. These not only disrupt the delicate ecosystem but also impact the lives of people who depend on the lake for fishing, recreation, and tourism. Addressing this challenge is no small task, but the power of space data and services has the potential to make a real difference."
        },
        {
            "text": "The UK Space Agency’s new challenge, Using Space-Based Technology to Monitor Blue-Green Algal Blooms, aims to do just that. By leveraging the unique capabilities of satellite technology, we can better understand, predict, and manage the spread of harmful algae in Lough Neagh and other waterways. This challenge is not just about solving an immediate environmental issue—it’s about exploring how space technology can provide new insights and tools to help preserve a vital part of Northern Ireland’s natural heritage."
        },
        {
            "text": "Seasonal algal blooms have become a serious concern, driven by excess nutrients from agriculture and wastewater, rising temperatures, and invasive species. In 2023, Lough Neagh experienced severe cyanobacterial growth over the summer, impacting the environment and local communities. Whilst reducing nutrient inputs is a key long-term solution, immediate efforts are needed to better monitor and predict these blooms."
        },
        {
            "text": "Satellite remote sensing can play a critical role in monitoring large and often remote areas, providing regular, consistent data of bloom development and movement that is not always possible through traditional methods."
        },
        {
            "text": "By analysing changes in water colour, temperature, and other indicators, remote sensing can help detect the presence of algal blooms and predict their spread. This is particularly useful in identifying early-stage blooms, allowing authorities to respond more quickly and effectively. Moreover, satellites can provide historical data to help scientists understand past patterns, contributing to a better long-term strategy for managing water quality."
        },
        {
            "text": "The challenge invites innovators to use satellite data, open data sources, AI, and meteorological information to create comprehensive monitoring systems. These solutions could provide a clearer picture of the current state of Lough Neagh’s waters and offer predictions that inform management decisions. The goal is to provide Northern Ireland’s Department for Agriculture, Environment and Rural Affairs (DAERA) with advanced tools that can make a real difference in how algal blooms are managed."
        },
        {
            "text": "This Contract for Innovation competition will provide up to £360,000 for Phase 1, which could see up to three successful bidders receive up to £120,000 to develop their ideas. Running until March 2025, this first phase will focus on demonstrating the technical feasibility of proposed solutions."
        },
        {
            "text": "While large algal blooms typically occur in spring and summer, there are opportunities to use real-time and historical satellite data to better understand their dynamics. This approach allows for continuous monitoring throughout the year, and helps establish a baseline for assessing long-term improvements in water quality."
        },
        {
            "text": "The UK Space Agency’s partnership with DAERA, and the Northern Ireland Space Office, highlights our commitment, through the Unlocking Space for Government programme, to drive up the use of innovative space technology and data to enhance public services. We aim to support sustainable management of ecosystems and resources, contributing valuable insights that can be scaled up to benefit other regions facing similar issues."
        },
        {
            "text": "The call goes live on Wednesday 9 October 2024. If you have an idea that could help monitor and manage blue-green algae using satellite data, register for the briefing event on 14 October 2024, and join us in shaping the future of environmental monitoring."
        }
    ]
}