{
    "url": "https://naturalengland.blog.gov.uk/2024/10/11/all-smiles-for-nature-and-health-in-the-humber-region/",
    "title": "All Smiles for Nature and Health in the Humber Region ",
    "authors": [
        "Natural England"
    ],
    "categories": [
        "Connecting People with Nature",
        "Education",
        "Mental health and wellbeing",
        "Natural England"
    ],
    "pub_date": "2024-10-11T11:19:30+01:00",
    "content": [
        {
            "text": "Esther Smith, Senior Officer, Health and Environment (Natural England Yorkshire and North Lincolnshire Area Team) and Anthony Hurd, Programme Manager (Green Social Prescribing, HEY Smile Foundation) "
        },
        {
            "text": "Imagination and collaboration go a long way in helping us to develop new and exciting initiatives for people and nature. Here in the Humber region, these tools are helping us work with partners to discover how people could be nature’s greatest asset."
        },
        {
            "text": "Two projects – ‘Nature Champions’ and ‘Healthy Humber’ - have developed the skills and enthusiasm of new nature allies, to help their communities protect and restore nature and gain benefits from spending time in nature for their health and wellbeing, all the while promoting inclusivity and partnership along the way."
        },
        {
            "text": "In early 2024, we launched the Nature Champions project, led by HEY Smile Foundation and York St John's University. The project was funded through Natural England's Protected Site Strategies pilot."
        },
        {
            "text": "The goal was simple, but transformative: to help leaders from ethnic minority communities to become \"Nature Champions\" and support those who might not typically engage with the outdoors for mental and physical health, and aid nature’s recovery. HEY Smile worked with local community groups Solidarity Hull, Welcome House, Hull Afro Caribbean Association, BAMEEN and Bora Shabaa to recruit the Champions. The project builds on and complements the region’s Green Social Prescribing pilot, delivered in partnership with HEY Smile and the NHS."
        },
        {
            "text": "The findings from the project highlighted some of the barriers faced by communities in engaging in outdoor activities. These include feeling unsafe in public parks and a lack of time due to shift work and family commitments. The importance of fostering a sense of belonging, making sure people felt comfortable and included in nature was highlighted. For example, language often used for outdoor activities or sites, such as 'fell walking', 'wetlands', or 'reserve' can be unfamiliar to some communities, so thoughtful communication about outdoor activities can help people feel more comfortable and included."
        },
        {
            "text": "The project supported four workshops:"
        },
        {
            "text": "It was moments of nature connection that really helped to light up the project. ‘Train the trainer’ activities such as mindful walking and sculpting with natural objects, were aimed at bringing people into closer contact with nature in ways that resonated most with them. One exercise used all five senses to help participants deepen their connection to the natural world, enabling them to support their communities to do the same."
        },
        {
            "text": "Champions reported increased understanding of and confidence to engage with nature."
        },
        {
            "text": "Dr Hannah Armitt from Humber Teaching NHS Foundation Trust said: "
        },
        {
            "text": "“As a psychologist working in the NHS, I am aware of how important communities are in supporting people’s mental and physical health and wellbeing. The Nature Champions programme was an excellent example of community empowerment and engagement… Accessing local green spaces and having the skills and knowledge to connect with local nature can be a powerful means of supporting your health and wellbeing.”"
        },
        {
            "text": "The Nature Champions are planting the seeds for long-term, community-led initiatives that will continue to flourish. They tell us that the project will inspire self-sustaining initiatives within their communities. One of the participating organisations has planned to implement what they have learned at a board level, ensuring that the benefits of nature engagement extend far beyond individual experiences."
        },
        {
            "text": "Alongside Nature Champions, the Healthy Humber project worked with HEY Smile and the University of York, to bring together conservationists, healthcare professionals, and community groups. The aim was to set up and improve lines of communication, explore existing offers and potential opportunities to work collaboratively for projects which can use nature connection to support both nature recovery and health and wellbeing."
        },
        {
            "text": "Healthy Humber: growing connection between health and nature recovery. Workshop report. University of York and HEY Smile Foundation. — York Research Database"
        },
        {
            "text": "Coming together in such a way sparked dialogue between people that do not always have the chance to work collaboratively, but who have huge potential to make a difference when they do."
        },
        {
            "text": "It was identified that whilst conservation organisations need more people to support their vital work, healthcare organisations are looking for engaging ways to support people in a more individualised, whole person approach. One conservation organisation highlighted that although social prescribers are reaching the communities that they want to connect with, working together more often will provide great benefits for both sectors. Future opportunities for nature connections include the use of citizen science and bringing nature closer to home."
        },
        {
            "text": "Laura Harrison from York University said:"
        },
        {
            "text": "\"Healthy Humber’ highlighted different needs and practices between organisations that are more ‘nature-based’ and those that are more ‘health-based’. It also demonstrated the enthusiasm people have for bridging this gap through collaborative working as green social prescribing pathways develop.\""
        },
        {
            "text": "Here at Natural England, we continue to seek out partnership opportunities that will help bring nature closer to local communities and build stronger connections with the natural world. Projects such as these highlight the importance of collaboration with a wide range of organisations in order to reach people from all backgrounds and ensure that everyone has the chance to connect with and engage with nature."
        },
        {
            "text": "Take a look at these great films to learn more about both of these exciting projects: "
        },
        {
            "text": "Get in touch with us for further information about projects for people and nature within the Humber region: NatureRecoveryYorksNLincs@naturalengland.org.uk"
        },
        {
            "text": "You can also find out more on the Smile Foundation site.  "
        }
    ]
}