{
    "url": "https://moderncivilservice.blog.gov.uk/2024/10/11/innovation-book-club-10-reads-for-problem-solvers-and-creative-thinkers/",
    "title": "Innovation book club: 10 reads for problem solvers and creative thinkers",
    "authors": [
        "Government Reform"
    ],
    "categories": [
        "A Modern Civil Service",
        "Ambitious",
        "Capability",
        "Government Reform",
        "Innovation",
        "Modernisation and Reform",
        "One Big Thing",
        "Proud Civil Servant",
        "Skilled Civil Service"
    ],
    "pub_date": "2024-10-11T13:28:48+01:00",
    "content": [
        {
            "text": "In support of this year’s One Big Thing, we’ve asked innovation leaders from across the Civil Service to give us their 2024 reading must-haves. Here are all the books and videos that were recommended to us to help kick off some creative, innovative thinking. You can also see our previous innovation book list and delivery book list if you’re in the mood for more reading!"
        },
        {
            "heading": 2,
            "text": "Innovation reading list"
        },
        {
            "text": "Right Kind of Wrong: How the Best Teams Use Failure to Succeed by Amy Edmondson"
        },
        {
            "text": "‘This book is a brilliant summary of Edmondson’s approach to harnessing the power of “intelligent failure” to support innovation, and develop better products and processes by learning to approach failures and mistakes in the right way.  She talks about creating the right conditions where people feel able to admit mistakes without fear, and how powerful this is for unlocking high performance and innovation.  It’s a great book with important lessons for us on how to take informed risks and innovate better.’ Mark Hayward, HM Revenue & Customs"
        },
        {
            "text": "Pirates in the Navy by Tendayi Viki"
        },
        {
            "text": "‘This text takes its title from Steve Jobs once saying that it's more fun to be a pirate (an innovative risk taker) than to join the Navy (the more conventional path). It's a fun metaphor, but I'm conscious that colleagues at the MoD might not agree with that!"
        },
        {
            "text": "Leaving the title to one side, this is essentially a survival manual for an innovator in a large organisation. It focuses on the corporate world but is definitely applicable to the Civil Service too."
        },
        {
            "text": "If you're in a role where you're looking to bring creativity and innovation to life in your department then this is a great read on the bigger picture and how to make that happen.’ Jonathan Rushton, Department for Science, Innovation and Technology"
        },
        {
            "text": "The Innovative Team by Chris Grivas and Gerard Puccio"
        },
        {
            "text": "‘We all like different parts of innovation. Some thrive on defining the problem, some on generating ideas, some on iterating and developing a solution and others on executing plans to make things happen. This book explores what happens when groups of people with clashing preferences try and work together to creatively solve problems. "
        },
        {
            "text": "The book  is in two parts, the first a story of a team overcoming their struggle to tackle creative problems together, and the second an introduction to an evidence-based framework for creative problem solving; the FourSight innovation thinking preferences. Since coming across this framework I’ve used it with numerous teams and individuals to unlock their problem solving potential and deliver better innovation.’  Katie C, Government Communications Headquarters"
        },
        {
            "text": " A Book About Innocent: Our Story and Some Things We’ve Learned"
        },
        {
            "text": "‘A brilliant, short, easy read that maps out the three Innocent founders’ journey and some of the practical steps they took.  It shows how some of the direction was serendipity, some was process-driven and some was graft and risk’. Rupert Cryer, Government Legal Department"
        },
        {
            "text": "Insanely Simple: The Obsession that Drives Apple’s Succes"
        },
        {
            "text": "‘The title passes the Ronseal test  (it does exactly what it says on the tin)  but the principle is fundamental: that it takes a lot of work to strip out the complexity to create a product that’s easy to use. But that work is vital to enable the success of the product.’  Rupert Cryer, Government Legal Department"
        },
        {
            "text": " 50 Things that Made the Modern Economy – BBC podcast  by Tim Harford"
        },
        {
            "text": "‘A masterclass in storytelling, anchoring some of history’s greatest innovations in context and extrapolating the much wider impact they have had on the world’.  Rupert Cryer, Government Legal Department"
        },
        {
            "text": " Innovation and Entrepreneurship by Peter Drucker"
        },
        {
            "text": "‘In this book, Drucker explains the crucial role public and private sector entrepreneurs play in spotting opportunities, challenging the status quo and turning creative ideas into practical solutions.’ Chris Webber, Open Innovation Team"
        },
        {
            "text": "The Innovator’s Dilemma by Clayton Christensen "
        },
        {
            "text": "‘This book is focused on private sector organisations getting better at disruptive innovation and not losing their market share. It's very good at setting an innovation mindset at a corporate level which is common to any organisation. For those seeking to innovate in government: it's crucial to take learnings elsewhere and setting your cultural preconditions is the one true necessary factor to becoming an innovation organisation.’ Simon King, Department for Work and Pensions "
        },
        {
            "text": "What Are Innovation Labs and How Can They Improve Development? Adarsh Desai and Innovation Labs and The Future of Human Rights Practice by Charity Ryerson"
        },
        {
            "text": "‘I have found the concept of Innovation Labs useful and fascinating in its application for societal change. It is something which the Civil Service could actually build upon for all future policy development and operational service transformation. These articles  articulate the diversity of the application of Innovation Labs - in human rights and in developing countries.’ Dr Nisha de Silva, Ministry of Justice."
        }
    ]
}