{
    "url": "https://otsi.blog.gov.uk/2024/10/11/introducing-otsi/",
    "title": "Introducing OTSI",
    "authors": [
        "Office of Trade Sanctions Implementation"
    ],
    "categories": [
        "Trade Sanctions"
    ],
    "pub_date": "2024-10-11T13:48:04+01:00",
    "content": [
        {
            "text": "Welcome to the Office of Trade Sanctions Implementation (OTSI) blog, where you will find helpful information about the work we do and see updates on our latest developments. "
        },
        {
            "text": "What are trade sanctions and why do we use them?  "
        },
        {
            "text": "The UK’s sanctions help advance foreign and security priorities around the world. This includes restricting terrorist groups’ ability to receive arms and funds and controlling the proliferation of weapons of mass destruction. "
        },
        {
            "text": "Following Russia’s full-scale invasion of Ukraine, the UK, along with our allies, imposed an unprecedented level of sanctions against Russia. The sanctions imposed by the UK seek to undermine Russia’s ability to fund and wage its war against Ukraine, and the government is cracking down on efforts to get around these sanctions. "
        },
        {
            "text": "What is OTSI and why were we created?  "
        },
        {
            "text": "OTSI has been created to strengthen the UK’s implementation and enforcement of trade sanctions - to maximise their impact. "
        },
        {
            "text": "OTSI’s powers are set out in The Trade, Aircraft and Shipping Sanctions (Civil Enforcement) Regulations 2024 (TASSCER). "
        },
        {
            "text": "A key aim of OTSI is to support businesses with compliance, helping them to understand sanctions and giving them the confidence to meet their obligations. We will also act where businesses are potentially in breach of sanctions. "
        },
        {
            "text": "OTSI leads on the civil enforcement of trade sanctions relating to UK services and international trade where the services and goods do not cross the UK border. As an example, OTSI would be responsible if a UK person buys critical industry or energy related goods in Turkey, and then exports them to Russia.  "
        },
        {
            "text": "OTSI works in partnership with HMRC, who lead on the criminal enforcement of trade sanctions. This role concerns the import and export of goods, the transfer of technology to and from the UK, and any relevant ancillary services (such as brokering and financial services) provided for trade-related activities.  "
        },
        {
            "text": "OTSI’s civil enforcement powers came into effect on 10 October 2024 and from that date OTSI:   "
        },
        {
            "text": "What does OTSI mean for UK businesses?  "
        },
        {
            "text": "OTSI’s main functions include: "
        },
        {
            "text": "Engagement and guidanceWe raise awareness of trade sanctions by talking to people. OTSI is a key point of contact and engages with businesses to support understanding and compliance with UK trade sanctions. We also do this through issuing user friendly and up to date guidance. We will meet with businesses and talk at industry events, ensuring we’re both accessible and a regular presence to provide support. "
        },
        {
            "text": "Licensing "
        },
        {
            "text": "OTSI is the licensing body for the provision and procurement of standalone services, such as professional and business services. "
        },
        {
            "text": "The Export Control Joint Unit (ECJU) will continue to manage licences for goods and ancillary services, as well as administering export controls and licensing for military and dual-use items. "
        },
        {
            "text": "Enforcement "
        },
        {
            "text": "OTSI has civil enforcement powers, where those are needed. We can levy penalties up to £1 million or 50% of the value of the breach, whichever is higher. We can also send out warning letters where monetary penalties are not deemed appropriate. "
        },
        {
            "text": "Where there is evidence of circumvention or high levels of recklessness and serious evasion, we can also refer such matters to HMRC, for consideration of criminal prosecution. "
        },
        {
            "text": "Reporting obligations and information requests There are reporting obligations for certain businesses to provide information, if they suspect a breach has occurred. This includes:  "
        },
        {
            "text": "OTSI also has powers to request information."
        },
        {
            "text": "Further information "
        },
        {
            "text": "Use our contact form for any enquiries. We encourage businesses/individuals to reach out to us with any questions. "
        },
        {
            "text": "You can visit our website to stay up to date with our guidance, access our breach reporting tool, apply for a licence, and access other useful information. "
        }
    ]
}