{
    "url": "https://socialcareinspection.blog.gov.uk/2024/10/11/regulation-45-reviews-and-reports-what-you-need-to-know/",
    "title": "Regulation 45 reviews and reports – what you need to know",
    "authors": [
        "Yvette Stanley"
    ],
    "categories": [
        "children's homes"
    ],
    "pub_date": "2024-10-11T13:33:26+01:00",
    "content": [
        {
            "text": "If you are the registered person for a children’s home, the law requires you to complete a regular review of the quality of care the home provides for children."
        },
        {
            "text": "These reviews, and the reports that follow them, are often called a ‘regulation 45 review/report’. This is because you will find out what you need to include in the review in regulation 45 of The Children’s Homes (England) Regulations 2015."
        },
        {
            "text": "Getting this review right is an important part of the oversight and improvement plan for each children’s home. Because of this, we know that some registered persons worry whether they are getting it right."
        },
        {
            "text": "In this blog, we’ll set out what you should use the reviews for, what a good report looks like, and how we use the reports."
        },
        {
            "text": "The review and the report"
        },
        {
            "text": "First, it’s important to understand the difference between the review and the report."
        },
        {
            "text": "You must complete a review of the quality of care provided for children in the home at least once every 6 months."
        },
        {
            "text": "After completing this review, you must then produce a written report. The report should include what the review found and any actions that you are taking as a result. It is this report that you must send to Ofsted – not the actual review."
        },
        {
            "text": "What the reviews are for"
        },
        {
            "text": "Although Ofsted do look at the reports, Regulation 45 reviews are not for Ofsted. They are for you and for your managers and staff."
        },
        {
            "text": "You should use them as an improvement tool to help managers:"
        },
        {
            "text": "What the reviews should contain"
        },
        {
            "text": "There is no expectation in the regulations (or from us) that you will review the home against every part of the quality standards every 6 months."
        },
        {
            "text": "You should use your professional judgement to decide which areas to focus on. You should use the review to identify areas of strength and possible weaknesses in your home’s care."
        },
        {
            "text": "The review should also contain opinions from the children in your care, their parents, the placing authorities and your staff."
        },
        {
            "text": "We have noticed that lots of providers do their reviews in April and October. This is fine if it is convenient for you, but there is no requirement that the reviews happen at this point in the year. So, do what works best for you."
        },
        {
            "text": "What the report should contain"
        },
        {
            "text": "There is no set format or template for the report, nor is there a required length."
        },
        {
            "text": "However, a good report should:"
        },
        {
            "text": "How Ofsted uses the reports"
        },
        {
            "text": "Every report is read by one of our inspectors, usually the inspector allocated to the home."
        },
        {
            "text": "We use the report to reassure ourselves that you and your leadership team are reflective and open to learning and that you are using the review process to improve your home for the children."
        },
        {
            "text": "We also use the reports to help us decide when to inspect and what we might want to look at when we do."
        },
        {
            "text": "But remember, overall, this process is for you. The review and the report should be used as a tool for continuous improvement in your home, making things better for children."
        }
    ]
}