{
    "url": "https://ruralpayments.blog.gov.uk/2024/10/11/the-rural-payments-agency-podcast-episode-10/",
    "title": "The Rural Payments Agency Podcast: Episode 10",
    "authors": [
        "RPA Editor"
    ],
    "categories": [
        "RPA podcast"
    ],
    "pub_date": "2024-10-11T11:35:25+01:00",
    "content": [
        {
            "text": "Welcome to the tenth episode of The RPA Podcast. In our latest episode, we have a roundtable discussion with RPA’s senior customer leadership team: ‘Inside the RPA: Leadership and Vision’.  In the second part of the podcast, we bring you an interview with the Farming Advice Service (FAS) to give you more information on their new partnership with Catchment Sensitive Farming."
        },
        {
            "text": "RPA senior leaders Marie Hardeman, RPA’s Customer Director, Emily Edwards, Head of Customer Insight and Gareth Jones, Head of Customer Experience engage in a discussion about how they’re working to improve customer service and how listening to, and understanding customers, are the pillars for improving the customer journey and satisfaction."
        },
        {
            "text": "In our second section, we speak with Laura Harpham from the Farming Advice Service (FAS) about their services and their new partnership with Catchment Sensitive Farming. The FAS is a national network of qualified, independent advisers under contract to Defra who provide free and confidential government advice to farmers and farming industry advisers. "
        },
        {
            "text": "The Podcast is also an opportunity for RPA to engage with farmers and land managers, and we encourage you to reach out to us with suggestions of particular topics that you’d like us to cover with our subject experts. You can e-mail us at External.Affairs@rpa.gov.uk."
        },
        {
            "text": "You can listen to episode 10 of The RPA Podcast on Apple and Spotify or through Buzzsprout. You can also listen to earlier episodes of The RPA Podcast on Apple and Spotify, or through Buzzsprout."
        },
        {
            "text": "Follow us on social media for the latest updates and information on the following accounts:"
        },
        {
            "text": "By following and subscribing to our social channels and blog, you’ll be able to see the latest updates about important information."
        }
    ]
}