{
    "url": "https://dwpdigital.blog.gov.uk/2023/12/29/celebrating-our-successes/",
    "title": "Celebrating our successes",
    "authors": [
        "Richard Corbridge, CDIO, DWP Digital"
    ],
    "categories": [
        "Cross Government",
        "Digital Academy",
        "Digital With Purpose",
        "Transforming Together"
    ],
    "pub_date": "2023-12-29T15:08:06+00:00",
    "content": [
        {
            "text": "After joining in April as CDIO (Chief Digital and Information Officer), I am delighted to be writing this end of year message. The months have flown since then and it’s clear the team has achieved so much together in 2023.  "
        },
        {
            "text": "It’s been quite a time for me to join. It’s not every year when you can say, without fear of contradiction, that we are on the cusp of major transformation of the way we work and live, thanks to digital technology, our use of data and the rise of generative AI (Artificial Intelligence). "
        },
        {
            "text": "Digital in DWP (Department for Work and Pensions) is at the heart of this revolution, which means it’s a great, if busy and challenging, place to work. "
        },
        {
            "heading": 2,
            "text": "Together we’re achieving "
        },
        {
            "text": "We started the year with no fewer than 204 new projects complementing an impressive 235 existing projects. Alongside these, we launched our ambitious Digital Business plan, with five goals that set us up for continued future success. "
        },
        {
            "text": "The work we do transforms how customers, colleagues, and taxpayers experience DWP’s services, providing impact and improving lives. Our focus in 2023 was on simplifying and streamlining customer and colleague experience and, in the process, delivering value quickly and efficiently. Here are some examples of how we’re doing that. These examples and others mean that we are playing an important role in the Government-wide Digital and Data Strategy Top 75 Services programme.  "
        },
        {
            "heading": 3,
            "text": "Delivering value faster "
        },
        {
            "text": "This year we made the move from monolithic IT applications to modernised digital services with common components. In 2023 our Strategic Reference Architecture (SRA) teams built 90 reusable features, making the delivery of solutions faster and more consistent. "
        },
        {
            "text": "The Health Assessment Service deployed a new microservice to make it quicker for teams to make changes to customer information in the future. "
        },
        {
            "heading": 3,
            "text": "Transforming how we use data "
        },
        {
            "text": "In Child Maintenance it’s now easier for parents to report a change of income online, making better use of HM Revenue and Customs real time information to manage expectations and deliver real-time decisions.  "
        },
        {
            "text": "The new Maternity Allowance calculator made its debut, helping colleagues process new claims by using real-time earnings data.  "
        },
        {
            "heading": 3,
            "text": "Adopting common approaches to drive improvements "
        },
        {
            "text": "From October applications for Access to Work became easier using a redesigned, more accessible online application platform. Simpler cases are processed faster, leaving colleagues more time to engage with those with more complex support needs. "
        },
        {
            "text": "The Apply for New Style Job Seekers Allowance online service was made available to customers in Northern Ireland for the first time. "
        },
        {
            "heading": 2,
            "text": "Recognising excellence and growing our capability "
        },
        {
            "text": "Our teams have been recognised with significant award wins this year – the ‘Founder’s Award’ at the Digital Leaders 100 Awards in June 2023, given for outstanding contribution to digital leadership. We were chosen because of our focus on the use of data, emerging technology, and innovation to drive our vision. "
        },
        {
            "text": "We demonstrated our commitment to diversity and inclusion winning the ‘Employer of the Year’ at the Women In IT Awards in February 2023 and ‘Company of the Year’ at the TechWomen100 awards.  Showcasing our female colleagues across our careers site helped us win 'Best Employer careers site’ at the Women in Tech Employer Awards with judges impressed with our dedication to closing the gender gap in tech. "
        },
        {
            "text": "We’re constantly striving to create a workplace that is diverse and genuinely inclusive. In doing so we will always be able to be the best we can at everything we try to achieve. These award wins are a true testament to our progress.  "
        },
        {
            "text": "We’ve made massive strides in our learning and training agenda in 2023. We’re making it even easier for teams to access professional memberships of organisations like BCS – The Chartered Institute for IT, and we’re bringing career development together through our Digital Academy. By giving colleagues access to even more learning and development opportunities, we’re ensuring a consistent level of professionalism across DWP Digital. "
        },
        {
            "heading": 2,
            "text": "Supporting our services into 2024 "
        },
        {
            "text": "AI and machine learning will continue to make the headlines. But of equal importance is how organisations like ours use data to improve the lives of millions of people.  "
        },
        {
            "text": "Bringing all these elements together will be DWP’s Digital Strategy, launching in 2024. With this strategy, we will be well positioned to realise the potential of data, providing us with the insight to refine and join up customer journeys where we can.  "
        },
        {
            "text": "We have an exciting 12 months ahead, but for now I'd like to wish everyone a very Happy New Year. "
        }
    ]
}