{
    "url": "https://educationhub.blog.gov.uk/2023/12/29/the-kings-new-year-honours-list-2024-honours-for-contributions-to-education-skills-and-childrens-social-care/",
    "title": "The King's New Year Honours list 2024: honours for contributions to education, skills and children’s social care",
    "authors": [
        "mediaofficer"
    ],
    "categories": [
        "Childcare",
        "Further education",
        "Higher Education",
        "Skills"
    ],
    "pub_date": "2023-12-29T22:40:06+00:00",
    "content": [
        {
            "text": "Over 90 Brits from across the country have been recognised in the King’s New Year Honours for their contribution to education, skills and children’s social care.  "
        },
        {
            "text": "Foster carers, campaigners, educators and fundraisers have been awarded an OBE, MBE, DBE, CBE and BEM from the King for their work making a positive difference to the lives of families and people in education. "
        },
        {
            "text": "Here are a few examples of some of the brilliant people who have made an outstanding contribution to education and childcare: "
        },
        {
            "heading": 4,
            "text": "Zamanganga Mbatha, MBE  "
        },
        {
            "text": "Zamanganga started a project which sees the specialised Special Education Needs (SEN) teachers from her special school unit paired up with teachers from mainstream education, helping them to develop their own strategies when teaching students with SEN.  "
        },
        {
            "text": "Her passion has meant that those with severe disabilities can enjoy a happy and purposeful educational atmosphere and leave school with the skills to achieve their full potential. "
        },
        {
            "heading": 4,
            "text": "James Boyes, MBE "
        },
        {
            "text": "In Autumn 2022 James was crowned the best skilled cabinet maker in the world. "
        },
        {
            "text": "Representing the high quality of UK skills to the rest of the world, James won a gold medal at the WorldSkills Special Edition 2022 competition in Basel, Switzerland.  "
        },
        {
            "heading": 4,
            "text": "Jack Deverson, MBE "
        },
        {
            "text": "As well as volunteering as a tutor for the Access Project, which helps disadvantaged pupils go to university, Jack has developed and provided evidence-based training for teachers as Co-Founder of Evidence Based Education, with an estimated 10,000 teachers benefiting from his work.  "
        },
        {
            "text": "In 2019 his innovative work was recognised with the Queen's Award for Enterprise, as well as recognition by peers in the North East.  "
        },
        {
            "heading": 4,
            "text": "Greta Edwards, BEM "
        },
        {
            "text": "As a cleaner and kitchen assistant at North Shore Academy in Stockton-on-Tees, Greta is a beacon of positivity to all those around her. She makes an astounding difference to the lives of all students and her dedication to serving her community is immeasurable.  "
        },
        {
            "text": "Knowing that a lot of children do not always have money to afford the food that is served at break times, Greta goes the extra mile to make sure that disadvantaged pupils have access to food. "
        },
        {
            "heading": 4,
            "text": "Ruth Miskin, DBE "
        },
        {
            "text": "Over last two decades, Ruth has developed Read Write Inc., a phonics programme which has made a significant contribution to teaching children to read across the country and has been adopted in 8000 schools across the UK and worldwide.  "
        },
        {
            "text": "Over the years she has been key in development of how English is taught in primary schools, as well as the more recent Reading Framework. "
        },
        {
            "heading": 4,
            "text": "June Nicol-Dundas, MBE "
        },
        {
            "text": "During her 30 year career as a teacher, June achieved excellent results for children, leading her school to achieve an Outstanding Ofsted rating in 2005.  Now, she is a carer for a sibling group of three boys aged 6 to 10 – her care has been described as “unconditional and resilient”.\n"
        },
        {
            "heading": 4,
            "text": "These are just a few of the many inspiring stories from those who received an award this year – congratulations to everyone, and thank you for your fantastic contribution. "
        },
        {
            "text": "Anyone can nominate someone for an honour. If you know someone who has achieved fantastic things worthy of recognition, go to https://www.gov.uk/honours to find out more about how you can put them forward."
        }
    ]
}