{
    "url": "https://insidedio.blog.gov.uk/2023/12/29/year-in-review-what-dio-has-achieved-in-2023/",
    "title": "Year in review: What DIO has achieved in 2023",
    "authors": [
        "DIO Communications Team"
    ],
    "categories": [
        "Accommodation",
        "Cyprus",
        "Defence Estate",
        "Defence Training Estate (DTE)",
        "Environment and Ecology",
        "Military Training",
        "Operation Nightingale",
        "Sustainability",
        "Working at DIO"
    ],
    "pub_date": "2023-12-29T09:52:04+00:00",
    "content": [
        {
            "text": "It’s been a busy year for us at DIO. From supporting the Coronation of King Charles III to supplying more than 20,000kg of turkey to Armed Forces personnel over Christmas, our teams have been working hard to help our Armed Forces to live, work, train and deploy."
        },
        {
            "text": "Here are just some of our many highlights."
        },
        {
            "heading": 2,
            "text": "January "
        },
        {
            "text": "In January, we launched the Historic Environment Record, a new tool to help our teams manage the Defence estate. We look after more than 800 listed buildings, 700 scheduled monuments and tens of thousands of archaeological monuments."
        },
        {
            "text": "Meanwhile, a project to re-establish a population of white-tailed eagles in parts of Southern England took a step forward, as our teams discovered two of the released birds had settled at Lulworth Ranges. The white-tailed eagle is Britain’s largest bird of prey."
        },
        {
            "heading": 2,
            "text": "February "
        },
        {
            "text": "Work began on a new £12 million band facility at Royal Military Academy Sandhurst in February. The purpose-built facility, part of the Defence Estate Optimisation (DEO) programme, was designed to house and support the musicians who serve in the British Army Band Sandhurst. The project, which completed in September, saw a new instrument store, music library, rehearsal rooms and a crew room built."
        },
        {
            "heading": 2,
            "text": "March "
        },
        {
            "text": "Rugby star Mike Tindall spent a day out on Salisbury Plain Training Area learning how to stay safe when accessing military land. As part of our Respect the Range campaign, he explored the training area in a Warrior vehicle, experiencing first-hand the risks that can arise, including live firing, unexploded ordnance and fast-moving military vehicles."
        },
        {
            "text": "Mike on Salisbury Plain Training Area, kitted up ready for a ride in a Warrior armoured vehicle. [Crown Copyright / MOD 2023]DIO hosted the 32nd Sanctuary Awards in March, celebrating the outstanding sustainability and conservation efforts that are taking place across the Defence estate."
        },
        {
            "heading": 2,
            "text": "April"
        },
        {
            "text": "In April, we celebrated 10 years since the MOD Guard Service (MGS) became part of DIO. There are now more than 2,700 MGS security officers delivering a high-quality service to ensure the safety of everybody at over 100 sites across the country."
        },
        {
            "text": "In the same month, we saw the completion of a £6.96 million project to extend the lifespan of runways and taxiways at the Mount Pleasant Complex airfield in the Falkland Islands. The project, completed by Mitie Defence Limited, saw markings repainted, airfield signage replaced and coating the runway with a layer of bitumen to extend the life of the surfaces."
        },
        {
            "heading": 2,
            "text": "May "
        },
        {
            "text": "In May, DIO completed the first phase of a £10 million project to deliver 34 new homes for service families at RAF Akrotiri. The homes were the first to be built under DIO and UK Strategic Command’s APOLLO programme."
        },
        {
            "text": "DIO offered around the clock support for the Coronation. [Crown Copyright MOD 2023]As thousands of Armed Forced personnel descended on London to prepare for the Coronation of King Charles III and Queen Camilla, DIO staff and contractors worked around the clock to offer support. In addition to supplying food, accommodation and cleaning services, our teams also helped with tailoring military uniforms, the provision of temporary stables for military horses and cobbling."
        },
        {
            "heading": 2,
            "text": "June"
        },
        {
            "text": "New Net Zero carbon accommodation was formally opened at the Defence School of Transport (DST) in Leconfield. The new buildings included rooftop solar panels, air source heat pumps and heat recovery systems."
        },
        {
            "heading": 2,
            "text": "July "
        },
        {
            "text": "A £150 million contract to provide key services in Germany and Italy was awarded to Mitie Defence Limited in July. It will provide hard facilities management, such as maintenance, repairs and servings alongside limited soft facilities management, including waste disposal and laundry services. It was the second contract to be awarded under DIO’s Overseas Prime Contracts programme this year."
        },
        {
            "text": "July also saw work begin on a new passenger and freight handling facility at RAF Akrotiri – another project under APOLLO. The existing facility dates back to the 1960s and it is being expanded to meet current requirements."
        },
        {
            "heading": 2,
            "text": "August "
        },
        {
            "text": "Our Respect the Range campaign lit up the sky in Tenby in August to highlight the importance of staying safe when accessing military land."
        },
        {
            "text": "More than 100 drones put on a light show in the early hours of the morning contrasting everyday activities with military images to promote how use of MOD land can change from calm to combat in an instant. A cyclist turned into a tank, a dog into a soldier and a bucket and spade into a missile to illustrate the important safety message."
        },
        {
            "heading": 2,
            "text": "September "
        },
        {
            "text": "The Bulford Kiwi was restored by our teams and partners in September. [Crown Copyright MOD 2023]The iconic Bulford Kiwi was re-chalked in September to restore the monument to its former glory. DIO worked with partners to breathe new life into the image, which was carved into the landscape by New Zealand soldiers waiting to return home after the end of World War 1."
        },
        {
            "text": "DIO supported the opening of the first of the King’s Nature Reserves in September. The nature reserve, on the Lincolnshire coast, includes areas of land owned by the MOD. DIO plays a key role in the management and conservation of the Defence estate at Donna Nook as part of our ongoing commitment to enhancing biodiversity and nature recovery."
        },
        {
            "heading": 2,
            "text": "October "
        },
        {
            "text": "To mark World Mental Health Day in October, we reflected on the work done through Operation Nightingale, and the positive impact the project has had on veterans. The DIO project assists the recovery of wounded, injured and sick military personnel and veterans by involving them in archaeological investigations."
        },
        {
            "text": "DIO worked with the British Army and Cornwall Wildlife Trust to improve sand dune wildlife at Penhale Training Area in Cornwall. Four 16-tonne diggers were used in the project to remove areas of overgrown scrub and expose bare sand to encourage new habitats."
        },
        {
            "heading": 2,
            "text": "November "
        },
        {
            "text": "We have supported the training of Ukrainian troops by building trench systems. [Crown Copyright MOD 2023]In November, we marked the training of 30,000 Ukrainian troops under Operation Interflex. DIO supports this by providing training areas, classrooms, creating trench systems, and supplying meals and accommodation for Ukrainian recruits."
        },
        {
            "text": "We announced an investment of £400 million into Service Family Accommodation over the next two years. This investment will help to modernise thousands of homes, with work to refit kitchens and bathrooms, boiler and heating upgrades and new doors windows and roofs already planned for many homes."
        },
        {
            "heading": 2,
            "text": "December"
        },
        {
            "text": "To round off the year, DIO launched its very first advert – to encourage sustainability across the estate."
        },
        {
            "text": "The video, made by our talented Campaigns and Marketing team, follows Father Christmas around DIO HQ switching off lights, monitors and other electrical items to help us all live more sustainably."
        },
        {
            "text": " "
        },
        {
            "text": "These are just some of the highlights DIO has seen during 2023. The work performed by our teams has demonstrated the true value of DIO as the estate expert for Defence and supporting our Armed Forces."
        }
    ]
}