{
    "url": "https://insideDIO.blog.gov.uk/2021/11/04/a-unique-approach-to-accommodation-for-the-royal-marines/",
    "title": "A unique approach to accommodation for the Royal Marines",
    "authors": [
        "Simon Jones"
    ],
    "categories": [
        "Accommodation",
        "Construction",
        "Royal Navy"
    ],
    "pub_date": "2021-11-04T16:55:13+00:00",
    "content": [
        {
            "text": "The new accommodation block at CTCRM Lympstone. [Crown Copyright / MOD 2021]I was proud to lead a recent DIO project to construct a new state-of-the-art bespoke accommodation block for injured Royal Marine recruits. The new block at Commando Training Centre Royal Marines (CTCRM) Lympstone in Devon was completed ahead of schedule and on budget."
        },
        {
            "text": "The new five storey accommodation at the CTCRM consists of a 181-bed block for trainees injured during phase one of training. They are separated from their normal unit and form a new troop until they have rehabilitated and can hopefully re-join their normal unit."
        },
        {
            "heading": 2,
            "text": "Planning and early stages"
        },
        {
            "text": "The project made the best use of the limited land available at CTCRM which is a highly congested site. The building replaces a small single storey office and store. In order to have sufficient space for the new building, we had to alter the course of an adjacent road, requiring some extensive retaining walls to be constructed."
        },
        {
            "text": "We had extensive discussions with the Royal Marines in the early stages of the project to establish exactly what they wanted and provide a design that met all of their needs."
        },
        {
            "heading": 2,
            "text": "The finished product"
        },
        {
            "text": "Thanks to those conversations, the new block is adaptable in how it can be used. It provides complete flexibility in how rooms and floors can be allocated. There are 21 eight-bed rooms and one ten-bed, as well as three single Duty of Care rooms for supporting staff. All rooms have been designed so that they can be allocated to either male or female occupants. This was achieved in part by incorporating en-suite ablutions to each room which allows each adjacent bedroom to be occupied by either male or female occupants. The mixture of male and females occupying the building is then not limited to either floors or proportionate size of communal ablutions."
        },
        {
            "text": "A Royal Marine recruit on the assault course during his Commando tests. [Crown Copyright]As well as bedrooms we’ve also provided supporting facilities, such as a large multiuse communal recreation area and administrative offices. The multifunction communal and recreation space has televisions and a projector and screen for both entertainment and education, a kitchenette for drinks and IT provision. It can be used as a classroom when required or for individual learning and has all amenities required to provide this alternative function. The ground floor also has toilet and washing facilities for visitors to the offices and classroom."
        },
        {
            "text": "The small space normally planned on each floor in an accommodation block was instead aggregated into the single large communal area. This allows our users to get out of their rooms and socialise and be entertained. The area includes a kitchenette for drinks. The space has the added benefit of being able to utilised as a classroom for both individual and group learning when not being used as a social area. There is IT provision for online learning in this room plus four adjacent offices."
        },
        {
            "text": "Each of the five floors has utility areas with Belfast sinks, washing machines and dryers and a dedicated drying room with extraction, low radiant heat and dehumidifiers to ensure clothes and kit can be quickly washed and dried."
        },
        {
            "text": "Final fixings and equipment such as Wi-fi, curtains, blinds, notice & white boards and TVs were installed throughout the building during construction, which avoided a costly and disruptive fit out after completion."
        },
        {
            "text": "A Royal Marine recruit on the assault course during his Commando tests. [Crown Copyright]This project was completed ahead of schedule despite the challenges of the  pandemic. I am incredibly pleased with what we have achieved, along with our partners Galliford Try and AECOM, for the Royal Marines. This highlights DIO’s expertise in delivering complex and bespoke projects safely for the Armed Forces."
        }
    ]
}