{
    "url": "https://socialcare.blog.gov.uk/2021/11/04/a-workforce-made-with-care/",
    "title": "A workforce 'Made with Care'",
    "authors": [
        "Deborah Sturdy"
    ],
    "categories": [
        "Care and support",
        "Social care reform",
        "Workforce"
    ],
    "pub_date": "2021-11-04T14:33:26+00:00",
    "content": [
        {
            "heading": 2,
            "text": "Career opportunity"
        },
        {
            "text": "I’m delighted Made with Care, the Government’s new social care recruitment campaign in England, has now launched to encourage many more people to pursue careers in social care."
        },
        {
            "text": "It’s estimated there will be almost half-a-million extra job opportunities in adult social care by 2035 and more than 105,000 vacancies to be filled. These roles, I have no doubt, will be exciting, varied and rewarding."
        },
        {
            "text": "It would be wrong not to acknowledge how vital it is we expand our ranks at this critical time, of course. The pandemic has stretched both health and social care workforces to the limit. We need many more new and returning care professionals with the same qualities of compassion, dedication and empathy to join our ranks and help ease pressure on the system."
        },
        {
            "text": "Regardless, we will continue to celebrate and acknowledge the contribution of one of the most diverse, rewarding and life affirming career sectors in the country."
        },
        {
            "heading": 2,
            "text": "Positive experiences"
        },
        {
            "text": "I have spent all my professional life working to support others. Knowing I have helped make a positive difference in people’s lives is a wonderful and humbling feeling. I must add, working with so many great people and teams, I have grown to appreciate the true value of working together. I want many more people to have this experience and realise social care is not merely a job, but a career opportunity ripe with possibilities."
        },
        {
            "text": "I’m talking about the chance to meet and work with wonderful people from diverse walks of life and to see, first hand, how their values, life experiences and commitment to care can be truly transformative for the people they look after. With the right support, I firmly believe these are careers many will want to stay in for the long term."
        },
        {
            "text": "The recruitment campaign has launched just as the Government announces its Winter Plan for social care, setting out how the sector will be supported over the coming months."
        },
        {
            "heading": 2,
            "text": "Big campaign"
        },
        {
            "text": "‘Made with Care’ is set to run for five months. This brilliant TV advert shows real care workers making a difference in people’s lives. I also applaud the campaign’s emphasis on the importance of personal qualities, alongside opportunities to grow professionally through new skills and qualifications."
        },
        {
            "text": "With all this in mind, I believe we can build a care workforce that truly reflects the best of our communities. Funding is important but attracting the right people even more so. If you think you’re one of those people, start your journey of discovery today and visit the campaign website to find out more?"
        }
    ]
}