{
    "url": "https://environmentagency.blog.gov.uk/2021/11/04/bonfire-night-is-no-excuse-to-burn-rubbish/",
    "title": "Bonfire night is no excuse to burn rubbish",
    "authors": [
        "elenaholmes"
    ],
    "categories": [
        "Regulated industry",
        "Waste"
    ],
    "pub_date": "2021-11-04T09:51:48+00:00",
    "content": [
        {
            "text": "Sam Pickard, Environment Officer for Devon, Cornwall and Isles of Scilly, discusses the regulations around planning a fire. "
        },
        {
            "text": "Bonfires burning, sausages sizzling and fireworks fizzing, it seems innocent enough but there is a more sinister side to Guy Fawkes Night."
        },
        {
            "text": "Part of my role as an Environment Officer is to check that commercial waste is not being illegally disposed of and burnt and using bonfire night as a cover to do this is an easy option for some. Smoke from any fire contains chemicals and particles which aren't great for humans or animals, this is especially the case when things are burnt that aren't supposed to be or when the wood being burnt is wet. The smoke travels and can potentially affect your whole local community. We understand that it is an important date in the cultural calendar and we want people to be able to enjoy Guy Fawkes Night."
        },
        {
            "text": "To help organisers understand what to do, the Environment Agency has a regulatory position statement which outlines what conditions must be followed when planning a fire. This is to ensure waste is not disposed of illegally and that human health is protected. Organisers can get a fine of up to £50,000 if these rules are not followed. To ensure you don't fall foul of the guidelines please:"
        },
        {
            "text": "Organisers are also reminded by the Environment Agency that the waste must not endanger human health or the environment before, during or after burning. Organisers must not cause a risk to water, air, soil, plants or animals, cause a nuisance through noise or odours, or adversely affect the countryside or places of special interest."
        },
        {
            "text": "Plastic, used furniture, household rubbish, old caravans, mattresses and broken boats: these are just some examples of items we have found being burnt illegally. If you notice a fire being put together in advance of bonfire night and it looks like it might contain anything other than dry, untreated wood please report it to the Environment Agency incident hotline on 0800 807060 or report it anonymously to Crimestoppers."
        }
    ]
}