{
    "url": "https://socialworkers.blog.gov.uk/2021/11/04/childrens-social-work-matters-10-years-of-collaboration-and-innovation-in-yorkshire-and-the-humber/",
    "title": "Children’s Social Work Matters: 10 years of collaboration and innovation in Yorkshire and the Humber",
    "authors": [
        "Karen Jones"
    ],
    "categories": [
        "Celebrating social work",
        "Leadership",
        "Social Work Awards"
    ],
    "pub_date": "2021-11-04T15:32:10+00:00",
    "content": [
        {
            "heading": 4,
            "text": "Last month marked 10 years since Children’s Social Work Matters (CSWM) was established. CSWM is a collaboration of all local authority (LA) children’s services in the Yorkshire and Humber region. Together, their focus is to raise the image of child and family social work, drive recruitment and support the ongoing collaboration and development of practitioners."
        },
        {
            "heading": 4,
            "text": "Importantly, CSWM is keen to continue adapting to meet new challenges and regional priorities. Karen Jones, Communications and Marketing Manager, discusses her role in the regional partnership and how CSWM has evolved over time."
        },
        {
            "text": "Back in 2010, I worked in the corporate communications team at Kirklees Council. It was there I got involved in a PR and marketing workstream to improve the image of child and family social work. It was my role to pull a long-term campaign together to attract more people with the right skills and expertise into the profession. The recruitment landscape was particularly difficult at that point, with a huge reliance on agencies. It felt like there were lots of things stacking up against the profession and preventing it from moving forward."
        },
        {
            "text": "In the early stages of CSWM, it was a challenge bringing professionals together so that we weren’t all grappling with issues in isolation. Due to the level of competition between LAs, many didn’t want to open up about the real challenges they were facing. It took a bit of time to build relationships and really get people behind the campaign to realise the benefits of true collaboration."
        },
        {
            "text": "Today, collaboration can still be hard work because I’m essentially asking people to go above and beyond their day job, and they don’t always get to see the benefits immediately. I’ve had to prove my worth, as well as the campaign’s worth, but over time LAs have started to see first-hand that by working together, we really do achieve more. In 10 years, there have been many milestones and the partnership has evolved and grown. We are always thinking about what we can do to support the profession more.  My role is very much about enabling and facilitating."
        },
        {
            "heading": 2,
            "text": "Watching our partnership evolve"
        },
        {
            "text": "Back in 2011, our primary objective was to raise the image of social work with children and families, resulting in the creation and development of the CSWM brand. This brought about spin-offs in support of the programme’s wider ‘Attract and Support’ recruitment and retention priorities. Today the CSWM brand is recognised nationally by the sector, as an example of what can be achieved through successful collaboration and innovation."
        },
        {
            "text": "Since then, we’ve continued to build a positive image of the profession; specifically of those working in Yorkshire and the Humber. We’ve reached our key target audiences through trade and mainstream PR. This includes existing child and family social workers working inside and outside the region, those considering a career in social work, returners and those working for agencies."
        },
        {
            "text": "Our private portal offer also extends to universities in our region, helping to bring research and practice together among over 5,000 members, as well as giving students free access to our wealth of resources."
        },
        {
            "text": "More recently, we’ve run several digital marketing campaigns. Some have been specifically aimed at increasing traffic to the jobs section of the CSWM website and others to support the ‘Improving Lives’ campaign. Each campaign burst has generated significant additional traffic to the website, which has attracted well over half a million visits to date."
        },
        {
            "text": "Farrah Khan MBE, Principal Child and Family Social Worker (PCFSW) at Leeds City Council, views CSWM as ‘the glue’ that has bonded social work in the region."
        },
        {
            "text": "“By raising the profile of social work, it makes a career in the field more attractive and achievable. CSWM does this by championing the voices of social workers through videos to give real insight into social work across the region, and by providing a learning platform on their website for social workers to access CPD. The approach is based on shared learning that allows LAs to share new initiatives and projects in their area.”"
        },
        {
            "heading": 2,
            "text": "Taking control of the narrative around social work"
        },
        {
            "text": "I was grateful to have the full support of my Director of Children’s Services (DCS) at the time, Alison O'Sullivan. She was great at galvanizing wider sector support, achieving early buy in from our region’s Association of Directors of Childrens Service (ADCS) group and getting senior leadership support. This was instrumental in driving change and improvement. Alison felt quite strongly about taking control of the profession’s narrative. She didn’t want to just allow the media to tell the story from their perspective."
        },
        {
            "text": "When working with the media, we always make sure that:"
        },
        {
            "text": "When Alison handed over the lead DCS reins to Rachel Dickinson, former DCS in Barnsley, that vital leadership and support of our regional work carried on. It continues today with Mel John-Ross who is Executive Director of Children’s Services in Barnsley and lead DCS for CSWM. I’d say one of the critical success factors from the beginning is that CSWM has the full support of senior leaders in our region. They are always accessible and keen to help drive new initiatives as needed."
        },
        {
            "heading": 2,
            "text": "Celebrating the difference we make"
        },
        {
            "text": "CSWM has a long-term strategy to recognise the value of children and family social workers in the region. The  Social Worker of the Year (SWOTY) awards are coming up on Wednesday 17 November 2021. They are a welcome celebration of all the great work that happens on a national scale. If somebody is shortlisted in our region, we’ll run a feature in our newsletter and website. It really helps to boost workforce morale and strikes up a bit of healthy competition between LAs. This year we are proud sponsors of the ‘Children’s Social Worker of the Year’ category."
        },
        {
            "text": "We are also continuing to curate compelling content for the ‘Improving Lives’ campaign. Children and families have agreed to share their experiences in a new series of case studies and videos, which will be promoted across the CSWM Twitter and digital platforms. In June 2022, we will be hosting the fifth Festival of Social Work Conference, so child and family social workers will be able to benefit from a range of new resources and access great keynote speakers, including industry experts and care leavers."
        }
    ]
}