{
    "url": "https://ipa.blog.gov.uk/2021/11/04/coping-with-the-change-managing-menopause-in-the-workplace/",
    "title": "Coping with The Change – managing menopause in the workplace",
    "authors": [
        "IPA Team"
    ],
    "categories": [
        "Diversity & Inclusion",
        "Project Delivery Profession"
    ],
    "pub_date": "2021-11-04T12:29:34+00:00",
    "content": [
        {
            "text": "Content warning: This article contains frank discussions of physical and mental health, including mentions of blood, pregnancy/childbirth, in/fertility, cancer and anxiety."
        },
        {
            "text": "We took a few minutes to speak to three women in the Project Delivery Profession, Karina, Annie and Sharon, who shared their experiences as part of World Menopause Awareness Day on 18 October."
        },
        {
            "text": "Menopause isn’t often spoken about, even with familiy or friends, let alone in a work context. Starting open conversations on the subject can help us to understand what our colleagues are going through so we can best support them. This will enable us to make the project delivery community a more inclusive workplace for individuals going through menopause, in turn helping us to build a more supportive and resilient community all round."
        },
        {
            "text": "There are a range of resources available to civil servants, including the Guiding Principles for Employees and their Managers."
        },
        {
            "text": "How would you describe your experience with the menopause?"
        },
        {
            "text": "Sharon: I had known for a long time that I couldn’t be prescribed HRT so knew I needed to manage it myself. I think I got away with it very lightly and was lucky."
        },
        {
            "text": "Annie: At 38 I really felt like something was happening to my moods that I couldn’t control. It was disconcerting at best and often quite distressing – particularly as I wasn’t sure what was triggering my moods. After a few weeks where I did a lot of crying in the evenings, I went to the GP to seek help and after some tests it was revealed that I was having an early menopause and I was ultimately prescribed HRT [Hormone Replacement Therapy]. I didn’t intend to have children, but I know this is something that really impacts many women who have an early change."
        },
        {
            "text": "Karina: I knew very little about the perimenopause, apart from the average age for women to stop bleeding is 51. I started reading up about it as I was approaching that age and then realised that I had been having symptoms for years! I couldn’t sleep, had night sweats, anxiety and brain fog since my mid-40s, which I hadn’t connected to the menopause. I never had hot flushes so I assumed that I was ok. A doctor recently described it to me – it’s a process, not an event, so the symptoms evolve over time as your hormones change."
        },
        {
            "text": "We hear about some of the more common symptoms. How did it impact you?"
        },
        {
            "text": "Sharon: Although I’ve had night sweats since childbirth, they became more frequent during menopause. I noticed I was waking up feeling sick each morning, a little like morning sickness. I had suffered periods of anxiety – overthinking things, worrying and feeling emotional over petty things – and only recognised it when one of my friends asked if I was ok. My initial reaction was, “Yes, I am fine,” but it made me realise I wasn’t - I had just internalised it. I have had the occasional hot flush during waking hours and have noticed that sugar and alcohol are usually contributory."
        },
        {
            "text": "Annie: I felt that I had to manage my emotions, especially whilst at work, and this meant that I was less in control of my feelings at home. I did, and still do, get hot flushes. They’re often worse when I am concentrating or when I am feeling stressed. It can happen in big meetings or recently, when I was in a job interview. It was really unpleasant and I felt that people could interpret it as severe nerves and be put off by it."
        },
        {
            "text": "Something that people often don’t feel comfortable to talk about is menstrual cycles – but these are a key part of menopause. I had two episodes where my cycle lasted for 9 months rather than a few days and the consultant asked me to consider a full hysterectomy to manage it. Suffice to say it was exhausting."
        },
        {
            "text": "Karina: No one talks about the changes to menstrual cycles. I had assumed that they would reduce in frequency and just stop. The bleeding can get heavier and more frequent towards the end. I ended up being severely anaemic and have had to change my diet to manage that. Working at home has been my friend, as there are days when I couldn’t be confident to travel to work without embarrassing myself."
        },
        {
            "text": "Sharon: This is where I was very lucky. I just stopped – no real changes to my cycle prior to that."
        },
        {
            "text": "Tell me more about brain fog. Is it real? How did you cope with it at work and home?"
        },
        {
            "text": "Sharon: Others may have a different view on this (particularly my husband, family and previous colleagues) but I wasn’t aware that I was impacted too much by this. I didn’t notice an impact on my work. However, my job was so busy and stressful I may not have attributed it to menopause."
        },
        {
            "text": "Annie: After the HRT, I didn’t have much brain fog, but before it, I developed a reliance on post-it notes. I wrote everything down as I didn’t trust myself to remember key things! I managed to convert my family too. There were notes scrawled everywhere until a whiteboard was purchased to mitigate my impact on the environment!"
        },
        {
            "text": "Karina: My brain fog crept up slowly and I was compensating by writing everything down. I ended up working longer hours, as I needed to make notes in advance of every meeting and at the end of the day, as I couldn’t trust myself to remember what I had read, discussed and agreed. I didn’t feel comfortable enough talking to anyone about it, but my team sometimes had to gently remind me of previous decisions. It also drove my daughters mad, as I would ask them the same questions again and again. I seriously thought I had early onset dementia. I’ve been on HRT for a few months now, and it’s helping."
        },
        {
            "text": "How do you feel about HRT?"
        },
        {
            "text": "Annie: I started HRT it at 38 and stopped at 41 as the risks begin to scale up after a few years on it. Would I take HRT again? Yes. I felt a huge and quick change in my mental wellbeing and if I feel that I need it in the future, I will weigh up the risks against quality of life. I felt so desperate at the time that I didn’t have much hesitation about taking it to be honest. The issue of menopause is beginning to be well known (I feel anyway) so more and more research about HRT will be available. It’s a very personal choice but I would absolutely take advice from a GP to help with decision making."
        },
        {
            "text": "Sharon: HRT was never an option because Mum has had breast cancer twice, so I haven’t visited a doctor."
        },
        {
            "text": "Karina: I was very reluctant to go down the HRT route, until a friend helped me see it differently. “You have supplements to address your iron deficiency, which has side effects,” she said. “What’s different about supplementing your hormones to address them depleting?” I started on HRT a few months ago, but have found it really difficult to get consistent and reliable medical advice about it."
        },
        {
            "text": "What support does your workplace provide?"
        },
        {
            "text": "Annie: I haven’t taken advantage of any workplace support, but I have seen support group notices in office walls and I am aware of the Menopause Toolkit and webinars for colleagues and for line managers which can be found by typing “menopause” into the search bar on the intranet."
        },
        {
            "text": "Karina: To be honest, I was too embarrassed to seek out help and have been trying to manage it myself. But I now know that there is a range of support available. That’s why we have decided to talk about the menopause today. The more we can normalise it and talk about it without embarrassment, the more we can support each other, as colleagues, line managers and the organisation."
        },
        {
            "text": "We can all help"
        },
        {
            "text": "Menopause affects everyone. It is not just an issue for women. Supportive conversations can really make the difference. If someone is sharing their experiences with you, it’s important to have an open mind, be sensitive to the issues and not make any assumptions. By doing this, we can help to make the project delivery community a more supportive and inclusive place to work."
        },
        {
            "text": "Search for “menopause” on your organisation’s intranet or read the Guiding Principles for Employees and their Managers."
        }
    ]
}