{
    "url": "https://openpolicy.blog.gov.uk/2021/11/04/crowdsourcing-policy-how-can-collective-intelligence-improve-policymaking/",
    "title": "Crowdsourcing policy: how can collective intelligence improve policymaking?",
    "authors": [
        "Ed Foale",
        "Stephen Bennett"
    ],
    "categories": [
        "News",
        "Policy Lab",
        "Skills, tools and techniques"
    ],
    "pub_date": "2021-11-04T14:26:11+00:00",
    "content": [
        {
            "text": "Today we launch a new Collective Intelligence Lab (CILab), a collaboration with the Policy Profession which has the potential to transform how policy is made. The CILab will be hosted by Policy Lab and sit alongside our other innovative approaches to policy, expanding the tools available to policymakers to tackle complex challenges and deliver real impact. We have been developing the CILab over the last year alongside working on COVID priorities, creating a vision for the Oxford-Cambridge Arc, improving UN guidance on peacekeeping, and reforming the environmental impact of the 'last mile' of delivery logistics to reduce emissions."
        },
        {
            "text": "Since launching in 2014, Policy Lab has been at the forefront of trialing the use of design thinking, ethnography, digital and data in policymaking. The new CILab builds on the insights from such work, with the emphasis on co-creating policy ideas from large, diverse groups of people, online. It will explore whether collective intelligence tools can help policymakers to co-design better policies with citizens, experts and institutions beyond government that secure high quality outcomes for the UK."
        },
        {
            "heading": 3,
            "text": "What is collective intelligence?"
        },
        {
            "text": "Collective intelligence is the shared or group intelligence that emerges from the collaboration and collective efforts of many diverse individuals. We know that when diverse groups get involved in policymaking, we are able to identify a greater range of viable solutions. The vTaiwan online discussion platform is a good example of how a government has used collective intelligence tools to resolve emerging policy issues relating, for example, to online alcohol sales, drones and e-bike regulation."
        },
        {
            "heading": 3,
            "text": "Learning from early experiments"
        },
        {
            "text": "The CILab will build on early experiments that Policy Lab ran in collaboration with the National Security Secretariat and the think-tank Demos early in 2021 on policy issues related to the Integrated Review of Security, Defence, Development and Foreign Policy. These experiments tested the value of a digital collective intelligence network - where people and computers can be connected so that collectively they act more intelligently than any person, group, or computer can in isolation. "
        },
        {
            "text": "Participants from three demographic groups (government, academics and targeted external experts, and the general public) took part in an online debate on the platform Pol.is. They were able to react to policy statements and submit their own. Although it's too early to assess the policy ideas generated by the collective intelligence network (we plan to publish case studies later), overall the network facilitated:"
        },
        {
            "text": "The CILab will give us the means to build on this early work, developing the use of collective intelligence networks in government and radically improving policymaking so that it delivers better outcomes for citizens."
        },
        {
            "heading": 3,
            "text": "Take part!"
        },
        {
            "text": "If you work in government then you may be interested in running a collective intelligence project with the CILab. You would be helping to support the Declaration on Government Reform’s aspirations to strengthen policymaking by diversifying who participates; using co-design to restore and enhance civic space, especially on contentious issues; and modernising and opening the operation of government."
        },
        {
            "text": "Get in touch if you would like to be updated on the CILab’s work, and potentially play a part, and subscribe to this blog to stay up to date on our work going forward."
        }
    ]
}