{
    "url": "https://apprenticeships.blog.gov.uk/2021/11/04/data-apprenticeships-for-building-back-greener/",
    "title": "Data apprenticeships for building back greener",
    "authors": [
        "Cambridge Spark"
    ],
    "categories": [
        "Training providers"
    ],
    "pub_date": "2021-11-04T05:23:27+00:00",
    "content": [
        {
            "text": "With COP26 in full swing, Cambridge Spark is joining the ‘green tech’ debate by asking what companies can do to align their strategy towards ‘sustainability through innovation’, and how data apprenticeships can support climate action efforts while the country ‘builds back greener’."
        },
        {
            "text": "The UK has a goal to end its contribution to climate change by achieving net-zero carbon emissions by 2050. We need to make sure the right skills are in place for the future workforce to deliver the green technology shift the UK needs."
        },
        {
            "text": "The country is committed to unlocking innovation in renewable energy and developing cutting-edge technology to transition us into a greener future."
        },
        {
            "text": "The questions that companies are asking themselves are what kind of innovation will create a more sustainable future and how can we achieve it? Does our workforce have the skills, knowledge or capability to deliver sustainability through innovation? And if so, to what extent can data apprenticeships bridge the gap?"
        },
        {
            "text": "The demand for people with data science skills is growing and it’s becoming increasingly difficult to find and keep people with this knowledge and experience. So, companies are taking a different approach. Businesses are retraining existing employees and technical teams. Data apprenticeships enable data science to be deployed by different teams across the organisation, providing new skills to workforces on the frontline of climate change."
        },
        {
            "text": "Whether a company is working on low-carbon projects, creating efficiencies in logistics or manufacturing, it’s data that keeps them laser-focused on their challenges and will drive clear decision making. Regardless of your sustainability vision or ideas for a solution, large volumes of information relating to ‘how things are done now’ must be gathered and analysed for inefficiencies to be identified; for example relating to manufacturing waste, plastic usage or retail transport standards."
        },
        {
            "text": "Through the support we provide at Cambridge Spark, our data apprentices are directing capability towards a green recovery from Covid which is having a meaningful impact on sustainability in the UK, and a positive effect on profit margins too."
        },
        {
            "text": "To increase the sustainability impact our apprentices can make, Cambridge Spark is developing a ‘data science for sustainability' curriculum. Using Cambridge Spark’s data science learning platform, EDUKATE.AI, apprentices will work on assignments that simulate real-world sustainability challenges and use data science to tackle them. This will accelerate their sustainability journey and deepen the impact of it for themselves and their employers."
        }
    ]
}