{
    "url": "https://giaa.blog.gov.uk/2021/11/04/embracing-opportunities-empowering-success-giaa-virtual-conference-2021/",
    "title": "‘Embracing opportunities, empowering success’ – GIAA virtual conference 2021",
    "authors": [
        "Elisha Smith",
        "Bex Smith"
    ],
    "categories": [
        "People"
    ],
    "pub_date": "2021-11-04T16:21:49+00:00",
    "content": [
        {
            "text": "We held our third annual GIAA all-Agency conference as an online event on 6 and 7 October. its Each year, we come together in one place – be that physical or virtual – to reflect on our work, look ahead and celebrate success."
        },
        {
            "text": "Our theme for this year, reflected in our eclectic agenda, was ‘Embracing opportunities, empowering success’. Over two short days, we enjoyed a diverse mix of sessions presented by our colleagues, our senior leaders and our wonderful guest speakers. Every presentation and panel discussion gave us plenty to think about for the future and some useful insights that we can learn from to help inform our everyday work and how we approach the bigger issues like our strategy and the continuous development of our people."
        },
        {
            "text": "This year, for the first time, we opened our event to colleagues from across government. We were very grateful to representatives from the Foreign, Commonwealth and Development Office, HM Revenue and Customs and the Ministry of Defence who joined us as our guests and contributed towards making our conference an engaging experience."
        },
        {
            "text": "Our yearly conference is an ideal opportunity for greater collaboration across our organisation and with external partners. Our shared goal of creating a worthwhile event is a powerful motivator for learning new skills and building stronger relationships."
        },
        {
            "text": "Two colleagues who were instrumental in enabling that collaborative approach, and who learned a lot along the way, are Elisha Smith and Bex Smith. We asked them to share their experiences."
        },
        {
            "text": "Bex Smith"
        },
        {
            "text": "We have just celebrated the 3rd GIAA conference, as a member of the conference production team, though I may be a little biased, but I still think we can all agree that the conference was a great success. It’s been another difficult year for us all with the continuing challenges of the Covid pandemic, so it was a welcome and positive change to be able to come together again like this, to focus on some of the amazing work we do in the Agency."
        },
        {
            "text": "Our theme this year was Embracing Opportunities and Empowering Success. I embraced the opportunity to be a member of our Diversity and Inclusion panel in the ‘Belonging: Diversity and Inclusion’ session. This involved being part of a live question and answer session, which also included our inspiring guest speaker, Bernadette Thompson OBE, the Deputy Director for Inclusion, Wellbeing and Employee Engagement at the Department for Levelling Up, Housing and Communities (DLUHC). I was honoured, and a little nervous at first, to be asked to take part.  I was invited onto the panel in my role as the chair of our new GIAA Green Network. I was worried about being able to articulate myself confidently in such an important live audience discussion, but I am very glad that I took up that challenge and stepped out of my comfort zone. Bernadette was such an amazing speaker; I am so grateful that I got to be part of such a meaningful discussion."
        },
        {
            "text": "At every GIAA conference, I am always struck by the level of support we show one another. Looking at the comments section during both days made me feel part of a real community as it filled with heart-warming messages and messages of pride. It reminded me that our people make the Agency successful because we empower one other."
        },
        {
            "text": "That empowerment was demonstrated clearly in one of my personal highlights from this year’s conference.  This was a video about our apprentices and trainees, and their development journey. It was a fine example of how the Agency empowers success, especially as it was created and edited entirely by Elisha Smith, a Government Communication Service (GCS) apprentice who is working in our GIAA Communication team."
        },
        {
            "text": "Elisha Smith "
        },
        {
            "text": "I was really excited about being involved in planning and delivering our conference. At GIAA, we are encouraged to take advantage of different opportunities and supporting the conference planning was the perfect chance opportunity for me to build and hone my skills set."
        },
        {
            "text": "As a GCS apprentice, working in our GIAA Communication team, planning the conference allowed me to apply my learning and experience whilst also developing a whole new set of skills to support project delivery. I had the opportunity to work with our external supplier and support in our weekly conference meetings. I was fortunate enough to work with colleagues from across the Agency in an incredibly supportive conference team to ensure the event was a success."
        },
        {
            "text": "Thanks to all the constructive and encouraging support I had from my colleagues in the team, I got to plan, direct and edit a video showcasing our talented apprentices to the wider Agency and beyond. This was a valuable task that enabled me to meet with more members of the wider GIAA trainee and apprentice community. And provided me with the chance to celebrate and showcase their talent as well as the support, that we receive in GIAA. It also let me consolidate and demonstrate how much I’ve learnt in my role to date."
        },
        {
            "text": "The absolute highlight of the conference for me was the GIAA Awards ceremony. It is always an inspiring afternoon full of support and encouragement from the Agency. I was fortunate enough to be shortlisted for the Agency’s ‘Respectful’ value award. The recognition and positive comments from colleagues across the Agency went a really long way in not only boosting my confidence but reminding me of the valuable contributions that we make to the Agency every day."
        }
    ]
}