{
    "url": "https://defrafarming.blog.gov.uk/2021/11/04/farm-visit-challacombe-farm-on-dartmoor/",
    "title": "Farm visit: Challacombe Farm on Dartmoor",
    "authors": [
        "Sarah Blatchford"
    ],
    "categories": [
        "A view from the farm",
        "Things we're doing",
        "Things we've learned"
    ],
    "pub_date": "2021-11-04T12:42:49+00:00",
    "content": [
        {
            "text": "Earlier this year, my colleague Michael Sturla explained the value of farm visits to us in Defra and how we adapted them during the pandemic by making them virtual. With restrictions easing and a plan in place to keep everyone safe, we have started to resume our in-person farm visits. "
        },
        {
            "text": "They are a useful way for us to understand the context in which farmers work and what’s important to them. In this post, I'd like to share what I learned during a recent visit to Challacombe Farm on Dartmoor. "
        },
        {
            "heading": 3,
            "text": "My role "
        },
        {
            "text": "I’m a senior policy adviser in the Future Farming Common Agricultural Policy (CAP) and Transition team. We are responsible for managing Environmental and Countryside Stewardship agreements under the European Union. We are also helping to develop and deliver the new environmental land management schemes.  "
        },
        {
            "text": "At the moment, I am working on a new round of the Countryside Stewardship facilitation fund which is due to launch in December. This will include, for the first time, funding for groups that have beavers in their area.   I am also working on the review of Countryside Stewardship payment rates – we’ll be publishing more information about that later this year.   "
        },
        {
            "text": "Finally, I'm also working with Local Nature Recovery colleagues on a future collaboration offer."
        },
        {
            "heading": 3,
            "text": "Our visit"
        },
        {
            "text": "On 5 October members of my team visited Challacombe Farm on Dartmoor. The farm is run by Naomi Oakley and Mark Owen.  "
        },
        {
            "text": "I had previously visited the farm with colleagues from the Rural Payments Agency. In my free time I love visiting the area for the beautiful landscape.  "
        },
        {
            "text": "I think it's important that colleagues see, first hand, what our work funding environmental improvements can achieve. I also wanted them to meet Naomi and Mark, who are truly inspirational farmers.   "
        },
        {
            "text": "Their approach: that you enhance and improve through organic methods, that you work with nature, that you put your animals first and that you positively encourage the public to explore the land – is one I wanted to share with colleagues.  "
        },
        {
            "text": "The farm is an upland farm with significant archaeological features that need careful management. It is a mixed grazing system where the cattle are exclusively grass fed and the lambs are kept on farm until 18 months old.   "
        },
        {
            "text": "The farm has numerous diversification interests including selling fleeces to a local business that makes felt coffins, honey sold on the farm, raising piglets for their owners before they are sent to market and selling grass seed and hay from their native flower meadows to local farmers.   "
        },
        {
            "heading": 3,
            "text": "Managing the transition: what Naomi and Mike showed us  "
        },
        {
            "text": "Naomi and Mark’s farm is a good example of how environmental payments can indirectly fund important things for the landscape.  "
        },
        {
            "text": "Challacombe is in a Higher Level Stewardship agreement. It includes environmentally-sensitive land, including Rhôs pastures (these are enclosed species-rich purple moor-grass and rush pastures. On Dartmoor, they are found in valley systems away from the open moor, usually in a mosaic with wet woodland, other species-rich grasslands and oakwood). It is also home to acres of wild bluebells and heathers which cover much of the valley in June.  "
        },
        {
            "text": "Their Higher Level Stewardship payments indirectly fund the continued presence of a 19-year-old cow who leads the herd. The cow, in effect, manages the behaviour of the herd. She instinctively moves the herd around so they don’t over-graze one area. If the HLS scheme wasn't in place, the cow wouldn’t earn its place in the herd because she’s no longer breeding or being productive.  "
        },
        {
            "text": "By avoiding over-grazing, they secure micro-environmental benefits through better grassland management and reduced negative impact of the herd on the land. This is one of the ways that the farmers use nature to their benefit without it costing them money.  "
        },
        {
            "text": " They also showed how we could fund things differently for better environmental actions. To protect water quality, they agreed to install a silt trap to filter streams coming off the moor with silt and animal waste in them. Instead of a concrete filtration system (which we fund in our schemes), they devised and installed their own natural system, working with the natural topography of the land.  "
        },
        {
            "text": "As a bonus, they secured a new freshwater pond for their cattle to drink from. In the last year they used Lidar data to map the soil levels on an area of previously-drained bog.   "
        },
        {
            "text": "Using this data, they created new scrapes. Scrapes are shallow depressions with sloping edges, which seasonally hold water. They create obvious in-field ponds that are very attractive to wildlife. Ponds store and release water slowly, improving the natural flood management of the land. I would like to see this sort of practice encouraged through our schemes.  "
        },
        {
            "text": "We discussed the Countryside Stewardship facilitation fund. Naomi and Mark are members of the local Dartmoor facilitation group. This scheme funded facilitators to bring farmers, foresters and land managers together for training and advice. It also co-ordinated environmental actions, the idea being that you get better outcomes through collaboration than acting alone.   "
        },
        {
            "text": "Naomi found working with others inspiring and had a hand in their group plan for improving the habitat of the highly protected Marsh Fritillary and other butterflies.   "
        },
        {
            "text": "They also learned that grazing their cattle in summer away from the riverbed would allow native salmon to spawn on their land. The number of salmon has increased downstream because their eggs have not been disturbed by cattle in search of cooling water. Instead, the cattle now graze on the hill where the summer winds prevail which keeps them cool naturally.  "
        },
        {
            "text": "The valley is home to several birds that are either nationally scarce, such as Ring Ouzels and Hen Harriers, - or locally rare like the cuckoos who fly in from South Africa every year to predate on the Meadow Pipits who breed amongst the gorse and heather. Their sensitive landscape and forestry management in tandem with the British Trust for Ornithology (BTO) has created an area which has become well-known for its birds.   "
        },
        {
            "text": "It was wonderful to see how this farm and its tenants, like many across the country. are already doing so much to safeguard their livestock and land. Additionally, that outcomes from environmental agreements can go beyond our policy intention.  "
        },
        {
            "text": "If you have any questions about our farm visits or my work, do leave a comment below.   "
        },
        {
            "heading": 3,
            "text": "Pictures from the farm"
        }
    ]
}