{
    "url": "https://governmentscienceandengineering.blog.gov.uk/2021/11/04/gse-role-modelling-blog-being-a-good-ally/",
    "title": "GSE Role Modelling Blog: Being a Good Ally",
    "authors": [
        "Selina Khan"
    ],
    "categories": [
        "Diversity & Inclusion",
        "Guest Blog",
        "Our People & Deep Dives",
        "Role Model Series"
    ],
    "pub_date": "2021-11-04T10:10:16+00:00",
    "content": [
        {
            "text": "GSE Role Modelling Blog: Being a Good Ally"
        },
        {
            "text": "An ally is someone who takes action to support an underrepresented group but is not a member of that group. Rameya, the Chair of the Diversity and Inclusion Ethnic Minorities working group and Senior Technical Advisor Department for International Trade writes about how allies should be good every day role models."
        },
        {
            "text": "I believe the key to being a good ally is taking time to listen. Good allies should deepen their understanding on issues whether that be around  gender, race, disability, cultural or social issues. Being an ally means using your privilege to understand the needs of minority groups."
        },
        {
            "text": "I believe education is key for strong allyship. Being an ally is making sure you can have difficult conversations, listen and understand issues underrepresented groups are dealing with. Actions allies can take include speaking about any injustices such as workplace bullying. They can also help educate colleagues, friends, and family about being an ally, acknowledge their privilege and be active in supporting others."
        },
        {
            "text": "Black History Month is a good reminder for everyone to think about their own history and how it affects the lives of others. It is a good anchor for us to think about these issues, discuss them with friends and colleagues, and take time to think about how we can make a difference to the lives of others."
        },
        {
            "text": "Allyship is about how we use our privilege. If we own our privilege and recognise how we benefit from it, then we can utilise our opportunities to help underrepresented groups."
        },
        {
            "text": "Allies need to listen, read, reflect and think about how they can make a change to the system and policies to help create a more inclusive workplace culture. Allies can offer their support by becoming sponsors and champions."
        },
        {
            "text": "Being an ally, and encouraging others to be one, is a positive and powerful action. Allyship is important to create diverse, inclusive cultures, where differences of all kinds are recognised and celebrated. So, think about being an ally, join your local network groups and see how together we can make the GSE profession a more diverse and inclusive workforce."
        },
        {
            "text": "The GSE Board is committed to improving diversity and inclusion in Government Science and Engineering. Rameya’s blog is thought-provoking and we can all learn from the messages conveyed about allyship and how we can work together to improve the workplace and society - Vicki Chalker (Chair GSE Diversity and Action Inclusion Group, HOSEP UKHSA)"
        },
        {
            "text": "If you are interested in supporting the DIAG Ethnic Minority working group, please contact Rameya.  Most GSE organisations have inclusivity networks, why not become an ally for one of these networks?"
        },
        {
            "text": " "
        }
    ]
}