{
    "url": "https://digitalpeople.blog.gov.uk/2021/11/04/introducing-the-number-10-innovation-fellows/",
    "title": "Introducing the Number 10 Innovation Fellows",
    "authors": [
        "Sonya Hussain - Community Support Manager"
    ],
    "categories": [
        "Digital data and technology",
        "People and Skills"
    ],
    "pub_date": "2021-11-04T08:30:37+00:00",
    "content": [
        {
            "text": "We are delighted to welcome our first cohort of Number 10 Innovation Fellows. Inspired by similar schemes in the US and Canada, this flagship fellowship programme brings leading digital and tech talent into government to help improve public services by accelerating the adoption of cutting-edge approaches."
        },
        {
            "text": "Over the next 12 months, our Fellows will devote their time to solving challenges of national importance across several departments:"
        },
        {
            "text": "To learn more about the projects Fellows are working on, visit the website."
        },
        {
            "text": "“I cannot think of a time in the last century when the population of this country has been so deeply indebted to science and technology. It is thanks to vaccine research that we all have an immediate future that is happier and full of more opportunity. We’re putting the UK at the forefront of attracting, developing and retaining world-class talent, making it easier for top scientists and technologists to move to the UK and creating programmes to develop the brightest at home. And we want this world-class talent in government as well as in our industries and our universities. That is why we have launched the No.10 Innovation Fellowships to bring brilliant minds from the digital and tech sector into government, to help tackle some of the most pressing public policy challenges of our time.  I very much enjoyed meeting the first cohort on the programme, and look forward to seeing their progress over the next 12 months”"
        },
        {
            "text": "Rt Hon Steve Barclay MP, Chancellor of the Duchy of Lancaster and Minister for the Cabinet Office. "
        },
        {
            "heading": 2,
            "text": "Meet our Fellows"
        },
        {
            "text": "Our 7 Fellows are a mix of entrepreneurs, technologists, and digital engagement specialists:"
        },
        {
            "heading": 3,
            "text": "Daniel James (Joint Biosecurity Centre)"
        },
        {
            "text": "With a background in bioinformatics and artificial intelligence, Daniel was previously the Chief Product Officer at one of Europe’s fastest growing deep-tech startups, where he worked  with institutions including Bayer, Harvard University's Belfer Center and the United Nations Economic Commission for Africa. Prior to this, Daniel was a research scientist and full stack engineer at University College London. He holds a BSc in Biochemistry from UCL and an MSc in Bioinformatics and Genetic Epidemiology from Cardiff University where his research focused on the prediction of antibody structures targeting Ebola virus and other pathogens."
        },
        {
            "text": "“I’m looking forward to being able to work with some exceptional people to build a world-leading health security platform.”"
        },
        {
            "heading": 3,
            "text": "Helen Balinsky (Department for Education)"
        },
        {
            "text": "Helen is a 20+ year veteran of Hewlett-Packard/HP and has served in a variety of roles since joining the company in early 2001. Prior taking on the No10 Innovation Fellowship, she served as a Principal Research Scientist and Tech Lead. Helen also founded and led the pan-HP Data Science and Knowledge Discovery community with over 3000 members across the company. Her research and leadership resulted in a multitude of successful HP products and services with over 80 patents filed in USPTO and 50 patents awarded.  She authored over 50 scientific publications in ACM, IEEE, and other top conferences and journals. In 2012, Helen was elected Fellow of Institute of Mathematics and Its Applications. Since 2018, she is a  Visiting Professor at Royal Holloway University of London. "
        },
        {
            "text": "I look forward to  discovering new opportunities, leading the way, and delivering the results that matter!"
        },
        {
            "heading": 3,
            "text": "Joe Blair (Department for Education)"
        },
        {
            "text": "I previously spent 13 years as a digital and product leader at The Key, creating online support and cloud-based systems that are used by the majority of schools in England. The Fellowship is a unique opportunity to influence how government works, but what really matters to me is having an impact on day-to-day life in schools and colleges. "
        },
        {
            "text": "“I've been struck by the talent and dedication of everyone I've met. I'm excited to bring new ideas, and help others do the same.”"
        },
        {
            "heading": 3,
            "text": "Johannes Petrat (Foreign, Commonwealth and Development Office)"
        },
        {
            "text": "In my role as an applied scientist in the tech sector, I worked on simulations enabling military planners to explore complex security threats in the safety of a virtual world before taking action in real life. Over the course of the fellowship, I hope to amaze senior leaders with what modern technology can achieve for them."
        },
        {
            "heading": 3,
            "text": "Nicole Kayode (NHSX)"
        },
        {
            "text": "I’m the founder of a healthcare technology startup called Medixus, which connects healthcare workers across Africa to collaborate on patient cases remotely, providing clinical decision making support and ultimately a higher quality of patient care. Outside of this, I have led product teams at all stages from idea to roll out. In the next year, my main goal is to learn as much as I can and positively impact as much as I can over the duration of my Fellowship! I hope to highlight that innovation is not only about technology, but a way of thinking and working - and to embed that within the teams I will work with."
        },
        {
            "heading": 3,
            "text": "Onyeka Onyekwelu (Foreign, Commonwealth and Development Office)"
        },
        {
            "text": "Prior to joining the Innovation Fellowship, I specialised in public policy advocacy and strategic engagement. I’ve worked with the London Office of Technology and Innovation (LOTI), Greater London Authority (GLA), Equality and Human Rights Commission (EHRC) and Bar Associations nationally and internationally. My work has focussed on developing user-centred campaigns and projects exploringintelligent use of data, digitisation of public services, rule of law, and diversity and inclusion."
        },
        {
            "heading": 3,
            "text": "Rudy Benfredj (NHSX)"
        },
        {
            "text": "I am the founder of Mendelian.co, a company focused on supporting clinicians to reach quicker, accurate diagnoses of rare diseases using electronic health records. I'd like to deepen my understanding of how the most important decisions are being made and what incentives exist for the system to change efficiently and at scale."
        },
        {
            "heading": 2,
            "text": "What’s to come?"
        },
        {
            "text": "Over the next 11 months, the fellows continue to work on projects hosted at the Department for Education, the Foreign, Commonwealth and Development Office, the UK Health Security Agency and the National Health Service. As part of our ongoing commitment, the Fellows will have access to a programme of events dedicated to furthering their learning and development during their time on the scheme."
        },
        {
            "text": "To register your interest please visit our campaigns page. "
        }
    ]
}