{
    "url": "https://nda.blog.gov.uk/robot-revolution-in-a-nuclear-world/",
    "title": "Robot revolution in a nuclear world",
    "authors": [
        "Melanie Brownridge"
    ],
    "categories": [
        "Innovation/savings"
    ],
    "pub_date": "2017-06-28T15:10:34+01:00",
    "content": [
        {
            "text": "People may not realise the important role robots play in helping us to clean-up our nuclear sites."
        },
        {
            "text": "The image people have in mind when they think about robots, is very different from the reality of the cutting-edge remote technology being used on our sites."
        },
        {
            "text": "Many of the clean-up decommissioning challenges we face at our sites often involve working in hazardous environments. With our main aim to keep our people safe, remote technology really comes into its own. It can also be instrumental in helping us achieve our mission sooner."
        },
        {
            "heading": 2,
            "text": "Investing in solutions"
        },
        {
            "text": "The NDA invests around £85 million each year into technology and innovation to help find solutions to the decommissioning challenges and ultimately clean up 17 of the UK’s earliest nuclear sites sooner and cheaper. Use of new technology can mean safer sites and better value for money to the UK taxpayer."
        },
        {
            "text": "A fantastic example of where the benefits of robotics are being reaped, is at Sellafield. The site, in west Cumbria, is Europe’s largest and most complex nuclear site, dating back to the 1940s. The site, like our 16 other sites, is being cleaned-up and decommissioned. Remote technology is helping to cut up old materials like vessels, support structures, flasks and pipework in areas that are hard or too dangerous to get into."
        },
        {
            "text": "The LaserSnake2 technology, successfully deployed at Sellafield last year was a world first in combining laser cutting and snake-arm robotics to cut up radioactive vessels."
        },
        {
            "text": "The project was collaboratively funded by Innovate UK and the NDA and is a great example of specialist organisations and the wider supply chain helping us to develop the technology we need.  By 2020 we hope to see 30 per cent of our spend with the supply chain going to Small and Medium-sized Enterprises (SMEs)."
        },
        {
            "text": "Organisations wanting to find out how they can win business in the nuclear decommissioning sector should register to come along to our Supply Chain Event, on November 2 – the largest of its kind in Europe and aimed at suppliers of all sizes. In particular, we're looking forward to the showcase of the latest gizmos, gadgets and technologies in the innovation zone at this event that focuses on the challenge of nuclear decommissioning."
        },
        {
            "heading": 2,
            "text": "Winning opportunities"
        },
        {
            "text": "Building on the success of projects such as Lasersnake2, together with Sellafield Ltd and Innovate UK, we've had an excellent response to our recent innovation competition. Over 200 organisations, with various new approaches - some including the use of robotics, responded to the opportunity to apply for a share in £3.5 million to help solve our nuclear decommissioning challenges."
        },
        {
            "text": "The window for applications closed in April this year. I’m delighted to say that NDA and Innovate UK will be able to support more proposals, due to the high quality of the submissions. We'll be ensuring these are aligned and link to the government’s Industrial Strategy Challenge Fund which is also focussing on robotics."
        },
        {
            "text": "I can’t wait to see how these projects develop and help drive forward the progress being made in nuclear decommissioning through innovative technology."
        },
        {
            "text": "UK businesses can still apply for grant funding. Up to £16 million is available to UK business across 2 competitions for technologies and systems for extreme and challenging environments."
        },
        {
            "text": "Funding competition (open until 2 August 2017): research and development competition for RAI in extreme and challenging environments"
        },
        {
            "text": " "
        },
        {
            "text": "Find out more about UK Robotics Week"
        },
        {
            "text": "Find out more on Twitter: #UKRW2017 and #IndustrialStrategy"
        }
    ]
}