{
    "url": "https://environmentagency.blog.gov.uk/2022/11/25/anthropys-vision-for-britain-the-environment-agency-welcomes-a-new-leadership-conference/",
    "title": "Anthropy’s ‘Vision for Britain’: The Environment Agency welcomes a new leadership conference",
    "authors": [
        "Van Griffiths"
    ],
    "categories": [
        "Sustainability"
    ],
    "pub_date": "2022-11-25T09:09:49+00:00",
    "content": [
        {
            "text": "A major new leadership gathering took over the Eden Project earlier this month, for three days of visioning, networking and partnering. A small EA team participated in the event. Here, Van Griffiths, Deputy Director of the Environment Agency’s Sustainable Business team, explains what Anthropy is and why the EA got involved. "
        },
        {
            "text": "Anthropy was established to bring senior leaders and influencers together, to share thoughts on the future and help to shape our national narrative. From 2 to 4 November, over 1000 ‘Anthropists’ - from across the public, private and voluntary sectors - met together in Cornwall, to explore what we need to do, to build a more equitable, sustainable and successful Britain. The resulting conversations and ideas are now being distilled into a new ‘Vision for Britain’ report, which will be presented to the House of Lords in March 2023."
        },
        {
            "text": "When we were initially approached about attending, we did some due diligence and soon realised that the aspirations for the event were a strong fit with our core mission and business plan: which aim to create a better place. The purpose of Anthropy also chimes with our duty to promote sustainable development (as outlined under the 1995 Environment Act, which established the EA) and with our value statements about being visible, seeking partnership and showing leadership. Deepening and broadening collaborative efforts will be key to tackling the climate and nature emergencies, driving positive change, and creating a better future, so we decided to support the event by becoming a founding partner."
        },
        {
            "text": "The EA core event team comprised representatives from the Devon, Cornwall and Isles of Scilly Area, members of the sustainable business team and senior Local Operations and Environment and Business departmental leads. Colleagues from Natural England also attended the event, as did teams from organisations such the Royal Parks and National Emergencies Trust, along with senior leaders from over 300 of Britain’s most progressive businesses and environmental organisations."
        },
        {
            "text": "There were over 160 sessions at Anthropy. We led a couple of key events ourselves in the wonderful Rainforest Biome, surrounded by coffee bushes and strutting Malaysian wood partridges (the latter having been recently introduced as an effective form of pest control). Sarah Chare (Director of Operations, South East & East) spoke on a panel about the essential role of water in a climate-altered world. She asked whether our water infrastructure in this country was keeping pace with a rapidly changing climate – whatever the answer, it’s certain that we need long-term, adaptive planning and timely investment to respond to the nature and climate crises."
        },
        {
            "text": "The EA’s sustainable business team ran a session on sustainable supply chains, using the examples available to us, in the Rainforest Biome. We explored - in a highly interactive and lively discussion - how we could work together, to protect and enhance the rainforest’s role in providing us with climate control, building materials, medicines, food and drink, in a truly sustainable fashion. We came away from the session with a host of new contacts: in  businesses, community groups, universities and data consultancies. The event also produced three brilliant ideas for future supply chain partnership work: which we are already following up. We were able to link up with the team from Digital Catapult who are looking at using blockchain technology to bring transparency to supply chains from rainforest to product.  We’re looking at how we could work together on some key products where we currently have concerns."
        },
        {
            "text": "For most of the gathering, the EA team spread out and split up, to ensure that we covered as many of the amazing talks and panel discussions as possible. We were particularly interested in the sessions on sustainability, environmental management, equity, wellbeing and partnerships looking to tackle the climate and nature crises. But there was also time to hear inspirational speakers from other fields: with highlights including Sir Anthony Seldon talking movingly about grief and the importance of lifelong learning and the actions we can take to improve our own wellbeing and discover more happiness in these challenging times."
        },
        {
            "text": "We had hoped Anthropy would be an extraordinary event, and we were not disappointed. We were exposed to some stimulating new ideas and able to build relationships with many current - and potentially future - partners. We were also able to raise the profile of the valuable work which the EA carries out, every day, with businesses and communities across Britain, to protect and enhance our natural environment. It was also enriching to be able to spend time at the Eden Project: to wander through the botanical gardens and wonder at the transformation of the reclaimed china clay pit into a visitor attraction which now receives around a million visitors a year."
        },
        {
            "text": "At the end of the event, Sir Tim Smit, founder of The Eden Project, offered Anthropy an open invitation to return to the site, for a second year. From our experience as delegates and partners, its first year seems to have been a tremendous success, so if it does take place again, we are looking forward to remaining involved and helping to deliver any relevant recommendations in the new ‘Vision for Britain’ report."
        }
    ]
}