{
    "url": "https://history.blog.gov.uk/2022/11/25/curzons-comeuppance/",
    "title": "Curzon's comeuppance",
    "authors": [
        "Professor Jonathan Conlin"
    ],
    "categories": [
        "Foreign affairs and diplomacy",
        "What's the context? series"
    ],
    "pub_date": "2022-11-25T12:31:42+00:00",
    "content": [
        {
            "text": "Professor Jonathan Conlin of The Lausanne Project explains how that \"most superior person\" (as he was described by contemporaries at Oxford) met his match at Lausanne 100 years ago."
        },
        {
            "text": "Of all the treaties negotiated in the wake of World War 1, the Treaty of Lausanne has usually been seen as the most successful. Or perhaps more accurately, as the least worst. Thrashed out a century ago this year, it was, after all, the second attempt by Britain and her former Allies to reach a lasting peace in the Balkans and Middle East. The first attempt to settle the fate of the defeated Ottoman Empire had been worked out 3 years earlier, in Paris. Like their German allies, so the Ottoman representatives in Paris were hardly consulted, being simply presented with a treaty and told to sign it."
        },
        {
            "text": "This treaty was signed in August 1920 in the renowned French state porcelain factory at Sèvres. The treaty called for the partition of the vast Ottoman Empire among the victorious British, French and Italians, with substantial territories promised to the Greeks, Armenians and (vaguely) the Kurds. This vision of a once-mighty Empire reduced to an Anatolian rump would prove as fragile as the exquisite coffee services for which Sèvres was famous. So would the 'Megali Idea', the vision of an enlarged Greek state straddling the Aegean. Even before this humiliating diktat was signed, in May 1919 Greek armies landed at Izmir and occupied the territory assigned to them."
        },
        {
            "text": "A new Turkish nationalist movement established its own representative assembly in April 1920, in Ankara rather than Istanbul, where the Sultan's government was based. The movement's leader, Mustafa Kemal Pasha, led a successful military campaign that stopped the Greek advance in September 1921. Within a year the invaders were pushed back to Izmir. Meanwhile, to the north, Kemal's forces came toe-to-toe with British forces occupying the Dardanelles Straits. The resulting Chanak Crisis of September 1922 led Conservative backbench MPs to revolt,  toppling the coalition government and ending the spectacular career of the 'Welsh Wizard', David Lloyd George."
        },
        {
            "text": "The Swiss resort of Lausanne was selected as venue for a new round of Near East peace talks. British Foreign Secretary George Nathaniel Curzon probably thought his moment had come. Whereas Lloyd George had sidelined Curzon in Paris in 1919 (leaving him in London), now Curzon had the diplomatic field to himself. Experience of travelling across the Ottoman and Persian empires decades before, followed by a stint as Viceroy of India led Curzon to claim particular expertise in the region, adding to a somewhat inflated sense of his own importance. Although he was careful to limit the Americans' role at Lausanne to that of observers, otherwise he welcomed the opportunity to give that new world power a master-class in how to bargain with 'orientals'."
        },
        {
            "text": "It was not to be. Within months Curzon had left Lausanne in disgust, passing the baton to Sir Horace"
        },
        {
            "text": "Rumbold, former British High Commissioner at Istanbul. Though inexperienced in diplomacy, the Turkish delegation's leader Ismet (İnönü) proved to be far from inept, using promises of Mosul's oil to widen the cracks that already divided the British, French and American delegations. As Curzon noted, the former Allies were negotiating with a former enemy who still had an army in the field. Any idea of imposing reparations (as had been imposed on the Ottoman Empire's German allies) was quickly dropped, as was any talk of compensation (in whatever form) for Armenian victims of the 1915 to 1916 genocide."
        },
        {
            "text": "Unable to imagine a return to a multi-ethnic state, Turkish and Greek delegations agreed to a population exchange that forcibly relocated 1.6 million people. Though the exchange helped earn the Norwegian Fridtjof Nansen his Nobel Prize, since the 1990s we have come to recognize that, of all people, it was Curzon who got it right. Forced population exchange was “a thoroughly bad and vicious solution, for which the world would pay a heavy penalty for a hundred years to come.”"
        },
        {
            "text": "From Armenian hopes of homecoming through the violent legacy of Partition in India (itself modelled on Lausanne) to the internal power structures of the British Conservative Party, the legacies of 1922 to 1923 are all around us. This is certainly the case in the Republic of Turkey, where perceptions of Lausanne have shifted remarkably. Hailed for decades as a victory, as 'the birth certificate of the Republic', Lausanne has now come to be viewed (by the Erdogan regime at least), as a defeat thanks to fictional 'secret clauses'; these will, so the myth runs, 'elapse' on 24 July 2023."
        },
        {
            "text": "In the 100 years since 1923, 'Lausanne' has become variously a 'syndrome', 'ethnic cleansing' and much besides. My colleague Ozan Ozavci and I founded the Lausanne Project in 2017 concerned that the Lausanne centenary might nonetheless fail to receive as much attention as the centenaries of the other postwar settlements. Our website provides a space for scholars to share the latest research, as well as being a clearing-house for journalists and others interested in informed discussion. Alongside an edited volume to be published by Gingko in July 2023 we plan to publish a graphic novel, in which the worldly-wise heroes of Near Eastern shadow-puppet theatre, Hacivat and Karagöz, will give their own perspective on doings at Lausanne in 1922-3."
        },
        {
            "text": "Curzon, we suspect, would not be amused."
        },
        {
            "text": " To watch Lausanne unfold through the words and images of a century ago, follow The Lausanne Project's 'Lausanne Diary' @LausanneProject"
        },
        {
            "text": " "
        }
    ]
}