{
    "url": "https://ruralpayments.blog.gov.uk/2022/11/25/field-officers-offering-guidance-and-support-to-farmers/",
    "title": "Field Officers: Offering guidance and support to farmers",
    "authors": [
        "RPA Editor"
    ],
    "categories": [
        "Basic Payment Scheme",
        "Countryside Stewardship",
        "Environmental Stewardship",
        "Farm Safety"
    ],
    "pub_date": "2022-11-25T10:34:17+00:00",
    "content": [
        {
            "text": "With the introduction of a more supportive, partnership-based approach to site visits, moving away from the penalty-based system of inspections under the EU, to farmer-focused visits for schemes such as the Sustainable Farming Incentive (SFI) and Countryside Stewardship (CS), Field Officer Nathalie McKee talks about her role and the difference it’s making to farmers. "
        },
        {
            "text": "Hi, I’m Nathalie and I’ve been a Field Officer for RPA since November 2015. There’s not a ‘typical’ day in this role.  I usually do an early morning workout before the rest of the house is up, followed by a dog walk. If I’m out on farm then I’ll gather all my field kit (Land Inspection Device, backpack, maps, PPE, phone, food and drink) and double check everything is charged and working. "
        },
        {
            "text": "I’m currently covering three counties so it can take a little while to drive to some of the holdings. I’m trained in most of the environmental schemes and it depends on the time of year as to what scheme I’m undertaking a visit for. I’m currently switching between Sheep and Goat visits and Insitu Visits but come January, the focus will shift to Cattle Identification Visits."
        },
        {
            "text": "When I’m not out on a farm there’s a fair amount of preparation required before conducting each visit, followed by re-mapping to do and reports to write up following each one."
        },
        {
            "text": "Because Field Officers do a lot of chopping and changing between schemes, I make sure I give myself time to read guidance and refresh my knowledge on each scheme.  Farming has seen lots of change in the past few years and it’s important to keep abreast of those changes and current rural affairs, so I can impart my knowledge to the farmer."
        },
        {
            "text": "I think that changing our role from ‘Inspectors’ to ‘Field Officers’ and moving to ‘visits’ rather than ‘inspections’ have helped change farmer opinions of the RPA for the better. Field Officers can now spend more time offering guidance and support to farmers and they really welcome this and it’s encouraged their trust in, and respect of, RPA. I’m certainly experiencing a more relaxed and transparent relationship between ourselves and farmers."
        },
        {
            "text": "Generally, the feedback has been positive and farmers have warmed to us. Our visits give us the opportunity to offer farmers guidance and support in an ever-changing environment, not penalise and find fault. This is generally welcomed and appreciated but I cannot lie and say we’re welcomed by every farmer we visit. I’ve had some tricky interactions over the years and it has taken every ounce of my customer service skills to persuade farmers to allow me on farm to complete a visit.  I recognise that farmers get frustrated but I don’t take it personally.  I’m patient and honest and give farmers time and space."
        },
        {
            "text": "I love working outside (even when the weather is grotty) and being surrounded by nature.  It sounds corny and even though I’m not religious, being surrounded by nature is my church.  I get to see some amazing farms and beautiful countryside.  As a people person I really enjoy meeting farmers and supporting them where I can."
        },
        {
            "text": "For as long as I can remember I’ve had a fascination with animals and the environment.  I did a GCSE in Agricultural Science and have worked with animals from a young age, initially a Saturday job as a Kennel and Cattery Maid and then as a volunteer Primate Keeper at London Zoo while I was at university. I graduated with a BSC Honours degree in Zoology and took a gap year to travel and work on a 103,000 acre sheep and cattle station in the Australian outback. On my return to the UK I got a job as a Farm Manager at a Llama Farm and worked there for eight years before starting a family. I decided to return to work when my son started school and I wanted an active job where I could utilise my agricultural experience, but have more flexibility."
        },
        {
            "text": "I like keeping fit (even fitter then the job does).  I run and have completed four half marathons and do a lot of strength training at home with an online personal trainer. I have a dog and live on the coast by the South Downs, so can enjoy long family walks in the countryside or warm Summer days on the beach.  My son is at secondary school so I’m often ferrying him about to different clubs and I’m the administrator for his rugby team.  This involves processing registrations, booking referees, arranging catering and being a general cheerleader!  I love cooking and travelling and after our foreign trips were cancelled during the pandemic, we decided to buy a caravan.  It’s been great exploring the UK as a family and we love our little home on wheels."
        },
        {
            "text": " "
        }
    ]
}