{
    "url": "https://insolvencyservice.blog.gov.uk/2022/11/25/iair-annual-conference-insight-from-the-insolvency-service/",
    "title": "IAIR Annual Conference: insight from the Insolvency Service",
    "authors": [
        "Steven Fifer"
    ],
    "categories": [
        "Insolvency",
        "Insolvency profession",
        "Uncategorized"
    ],
    "pub_date": "2022-11-25T11:30:51+00:00",
    "content": [
        {
            "text": "The International Association of Insolvency Regulators (IAIR) is the international body that brings together the collective experiences and expertise of government insolvency regulators from jurisdictions around the world."
        },
        {
            "text": "The IAIR’s Annual Conference and AGM this year took place in Stratford Upon Avon at the end of September. The theme of the conference was ‘Post COVID – Recovery & Renewal in the Insolvency Profession’ and brought together insolvency professionals to share their experiences and insight to help insolvency regulators across the world develop the systems that will provide insolvency support for individuals and businesses in a post covid world."
        },
        {
            "text": "On this year’s agenda, the Insolvency Service was privileged to have several speakers on the bill."
        },
        {
            "text": "Chief Executive, Dean Beale, opened proceedings on the first full day before chairing a panel debate looking at environmental liabilities and the potential impacts on insolvency systems."
        },
        {
            "text": "Head of the Insolvency Practitioner Regulation Section, Claire Hardgrave, jointly hosted a session with the US Department of Justice looking at what we need from regulators and whether that has changed in a post-covid world, before leading a workshop on implementing diversity in the insolvency profession."
        },
        {
            "text": "Paul Bannister, Head of Policy, led a session looking at how the UK responded to the retail energy insolvency crisis and what early lessons have been learned. While Frances Couslon, Head of Insolvency and Restructuring at Wedlake Bell and one of our non-executive directors, gave her views on handling insolvency fraud in a post-covid world."
        },
        {
            "text": "In this blog, we asked our Insolvency Service colleagues to talk about what they presented, what they learnt from the event and their views on the current state of the insolvency landscape."
        },
        {
            "heading": 2,
            "text": "What did you present at the IAIR conference?"
        },
        {
            "text": "Dean Beale: As the conference chair I was busy presiding over the event and making sure everything went to time – ably assisted by the Executive Director of IAIR, Rosemary Winter Scott."
        },
        {
            "text": "I did, however, jointly deliver a session with Elisabeth Lang, the Superintendent of Bankruptcy in Canada, on the treatment of environmental liabilities in the insolvency process. In the session we set out the challenges posed to business rescue where there are historic and current environmental liabilities, the different approaches adopted by the courts in Canada and the UK, and the use of the disclaimer by liquidators.  "
        },
        {
            "text": "Frances Coulson: I was pleased to have the opportunity to explain to the international audience the tools and flexibility of the UK insolvency regime in tackling fraud in terms of civil and criminal or quasi criminal penalties."
        },
        {
            "text": "I also spoke about the overall reform of the UK Company registration and sanctions regime to make this a hostile landscape for fraud. I explained a little of how the public sector in the form of the Insolvency Service and HMRC work together with the private sector in insolvency to expand the disruption of fraud and the recovery of ill-gotten gains from fraudsters and their enablers."
        },
        {
            "text": "Claire Hardgrave: In our panel session on what we need from regulators post-covid, it was clear that many other jurisdictions have been going through the same challenges and adjustments as us in response to covid. But it’s also clear that many of everyone’s existing regulatory challenges are essentially unchanged.  Issues that were causes of concern before covid continued throughout covid, and they are still priority matters now."
        },
        {
            "text": "But that said, how we address those has shifted online and hybrid, and there have been impacts on the insolvency market owing to the volumes of asset-light and zero-asset insolvencies, and increases in individual debt. We’ve needed to be fleet of foot in deciding how and whether to change our systems and rules in response to external pressures. For example, by permitting more ‘payment holidays’ for people with an IVA during covid."
        },
        {
            "text": "Paul Bannister: My presentation was about the energy insolvency crisis. But I focused on two things: how Government responds when an important sector of the economy goes into meltdown; and the experiences and lessons of running the very first energy supplier special administration regime."
        },
        {
            "text": "From the many questions I got, including during the coffee and lunch breaks, is that most jurisdictions are having similar issues and there was an eagerness to know more detail of how the UK responded."
        },
        {
            "heading": 2,
            "text": "What else did you learn or find interesting at the conference from your international colleagues?"
        },
        {
            "text": "Dean Beale: It had been some time since the IAIR members had come together at a conference, so there was a good deal of catching up on developments in policy and practice across the globe."
        },
        {
            "text": "In particular, I was interested to hear how technology was being used to support the role of government bodies and regulators responsible for insolvency. For example, using AI to target regulatory activity. "
        },
        {
            "text": "Frances Coulson: It was good to see such a range of international representatives exchanging ideas and best practice."
        },
        {
            "text": "Claire Hardgrave: We were really grateful to be able to hear from a UK Insolvency Practitioner about her perspective on the importance of diversity and inclusion in the profession.  She talked incredibly powerfully about her own career journey, her successes and the challenges she’d faced, and the fantastic role of her mentors, champions, and inclusive employers over the course of her career."
        },
        {
            "text": "It was a real eye-opener to many in the room to hear first-hand of the discrimination that can be experienced, and it galvanised a huge sense of commitment to drive forward action that would see the positive and impactful action in many countries."
        },
        {
            "text": "Paul Bannister: I found it interesting to hear how different regimes responded to the challenges of Covid and the cost of living challenges. It’s surprising just how much commonality there is as much as there is difference. It was also good to hear from new insolvency members."
        },
        {
            "heading": 2,
            "text": "What are your views on the state of the insolvency landscape?"
        },
        {
            "text": "Dean Beale: Economies across the globe have been severely tested throughout the pandemic and the consensus across IAIR members was that the changes, some temporary some permanent, to insolvency regimes had been of vital importance in supporting citizens and businesses through a really challenging time. This gives me confidence that regimes, including ours in the UK, have the resilience to deal with current and future economic challenges."
        },
        {
            "text": "That doesn’t mean we can sit still, and there is definitely work to do to ensure that the insolvency profession remains in a healthy state, attracting talented, diverse people into its ranks, governed by a regulatory framework which those affected by insolvency can have confidence in."
        },
        {
            "text": "Claire Hardgrave: It was fascinating to hear the range of issues being experienced by, and learnings we can take from members. Some are struggling to attract insolvency practitioners to act in personal insolvency cases, for example, while others with incredibly sophisticated AI data analysis feeding into their risk assessment programmes."
        },
        {
            "text": "Paul Bannister: The way in which insolvency professionals and regulators are coping with the many challenges happening now, and what has happened overed the last two years – I would say that the landscape is in good shape."
        },
        {
            "text": "But there is uncertainty and stress that arises from the need for reform and what the market economy may do from the ever-increasing rate of economic shocks that seem to be happening."
        },
        {
            "heading": 3,
            "text": "Further information"
        },
        {
            "text": " "
        }
    ]
}