{
    "url": "https://defradigital.blog.gov.uk/2022/11/25/leaders-view-reflections-from-cop27/",
    "title": "Leader’s view: Reflections from COP27",
    "authors": [
        "Chris Howes, Chief Digital and Information Officer"
    ],
    "categories": [
        "Defra digital",
        "Defra Science and Innovation",
        "Digital transformation",
        "ICT sustainability"
    ],
    "pub_date": "2022-11-25T07:30:01+00:00",
    "content": [
        {
            "text": "Chris Howes shares his learnings from COP27 and how we need to think differently about sustainable Information and Communications Technology (ICT)."
        },
        {
            "text": "I recently spent a week at COP27 in Sharm El Sheikh, Egypt.  I returned energised and enthused by what I saw and heard, not least because I feel my visit was a success, particularly in terms of the recognition of the role ICT has in delivering a sustainable future but also a strong recognition that ICT needs to be more sustainable."
        },
        {
            "text": "In Defra, and across UK Government, we’re doing this by lowering our ICT carbon footprint, reducing cost, eliminating negative social Impacts from our ICT, and removing waste from our processes and maximising efficiency. We’re going further by harnessing technology to enhance sustainability - using technology to meet departmental and government-wide sustainability goals and commitments."
        },
        {
            "text": "And that’s the message I took with me to COP27, as well as a call to arms for partners and organisations to join our Government Digital Sustainability Alliance (GDSA), formerly the Defra e-Sustainability Alliance."
        },
        {
            "heading": 2,
            "text": "But emissions from technology and digital need to grow..."
        },
        {
            "text": "I know this looks odd at first reading, but I firmly believe this to be the case. As lead for sustainable ICT across Government, you’d expect me to be focused on reducing the impact of ICT on the environment. Just last week the publication of the 2021-22 Greening Government ICT report marked the latest milestone on our important journey."
        },
        {
            "text": "And yes, I’m really proud of what we’ve achieved in reporting and reducing the impacts of Government ICT – and proud of the collaboration, through the GDSA, between large and small technology companies."
        },
        {
            "text": "After a week at COP27 I drew a few other conclusions. There is an order to the priority actions to deliver a path to a two degree rise in global temperatures, let alone 1.5 degrees."
        },
        {
            "text": "In any organisation, business measures of success and sustainability objectives must align. If there is a tension, sustainability goals probably won’t be met. Sustainability must be how we do things – not an add-on, or a green wash."
        },
        {
            "heading": 2,
            "text": "Incentive or disincentive, that is the question"
        },
        {
            "text": "That’s also true at a national or global level – yet the reality is there is a clear tension. Current measures of growth, especially GDP, contradict the sustainability goals the world needs. In particular, they reward production and materialism, including extraction of resources from the planet regardless of environmental (or social) impact."
        },
        {
            "text": "That must change – positive growth has to be sustainable growth. Unsustainable growth must be seen as a negative indicator in risk and improvement terms. If we change those measures, to focus on decarbonisation, circular economy, and wellbeing, we then need to use systems thinking (as we would in a good digital delivery) to refocus on the actions really required."
        },
        {
            "text": "What this means is reassessing the capabilities we want as a society (not on modernising old ways of doing things). One great example I heard at COP is in relation to transport. Modernising old practices would replace all cars with internal combustions engines with electric cars. But that is simply modernising an old and flawed model."
        },
        {
            "text": "The idea that we all need cars doesn’t stand up to analysis. It is estimated that the 1.5bn cars in the world typically stand idle for 90% of the time. And they are in traffic jams for around 3-5% of the time. So why would we invest in, and extract minerals to build, over a billion cars that are only used 5% of the time?"
        },
        {
            "heading": 2,
            "text": "How we might think differently in the future"
        },
        {
            "text": "The capability (or outcome) we actually need is effective transportation; effective transport, as a service, could achieve the same outcomes (admittedly with a massive culture change), with a much lower carbon impact (and cost, come to that)."
        },
        {
            "text": "As my digital team always remind me – we shouldn’t digitise or automate a broken process. Fix the process first. These modernised, outcome-based services will require massive investment in technology to be effective and support modern life."
        },
        {
            "text": "Our future, such as energy supply, is likely to be much more distributed than centralised to ensure lower transmission loss and increased resilience. And digital technologies will be needed to increase productivity in sectors such as farming, whilst reducing its impact."
        },
        {
            "text": "It’s also inevitable, and right, that developing countries will want to grow and build technology capability to reduce, if not eliminate, poverty, especially in the global south, to improve quality of life. Almost a billion people in Africa have no access to the internet."
        },
        {
            "text": "A smart transition out of poverty for those countries and their communities, will require massive investment to avoid that transition being powered by old fossil fuel reliant systems. Investment is needed to keep carbon in the ground."
        },
        {
            "text": "So, will this growth in CO2 from technology cause problems? If we accept that the current contribution of ICT to global CO2 emissions is estimated at around 2-4%, then a doubling of digital carbon is likely to be less than 8%. This is dwarfed by industries like energy production, steel production and transport."
        },
        {
            "text": "I’ve even heard it said that some projections for digital and tech are much higher than the doubling I’ve just stated; some suggest 25% global energy use, for example by 2050, and similar with carbon."
        },
        {
            "text": "Therefore, emissions from technology will increase – but they will directly contribute to massive reductions in emissions from other sectors, such as mineral extraction, steel making and energy production. Whilst we should be conscious of the increase, our focus should be on the carbon emissions avoided as a result of the digital carbon investment."
        },
        {
            "text": "A stronger focus on making ICT more sustainable, thus enabling the new technology that will assist with wider decarbonisation to be sustainable, in itself means that ICT would increasingly become part of the solution and not part of the problem."
        },
        {
            "text": "Does this mean we can just focus on technology for sustainability, and can afford to lose focus on sustainable technology? Absolutely not. Managing and mitigating the impact of digital, data and technology is incredibly important. And especially on circularity of precious resources."
        },
        {
            "text": "But we should not save carbon by cutting digital – but by investing in technologies that reduce emissions in other sectors. It is the carbon and climate version of invest to save."
        },
        {
            "text": "I sometimes feel we sell ourselves short on shouting about our achievements. We’ve shown in Defra, and wider Government, where this approach can work. For example, our work on Clean Air Zones, and the work being done in the Future Farming programme to support the reform of the agricultural sector."
        },
        {
            "text": "We achieved consensus back in April with our sustainability alliance on the need to focus on sustainable ICT. In the months ahead my focus will be on developing a plan that really focuses on how we can bring innovation, policy, and digital sustainability expertise together for mutual benefit."
        }
    ]
}