{
    "url": "https://defencedigital.blog.gov.uk/2022/11/25/mod-prove-there-is-no-escaping-cyber-awareness-month-in-2022/",
    "title": "MOD prove there is no escaping Cyber Awareness Month in 2022",
    "authors": [
        "D. Cottey-HIll"
    ],
    "categories": [
        "Cyber",
        "Cyber Confidence"
    ],
    "pub_date": "2022-11-25T11:00:05+00:00",
    "content": [
        {
            "text": "In an increasingly digital world, the threat posed by hostile actors is greater than ever. It is therefore crucial that everyone, no matter their role or seniority, takes cyber accountability. But as the threat grows, so too does the risk that conventional messaging regarding cyber security may lose its impact with a target audience whose inboxes are increasingly filled by guidance documents containing cyber jargon and highly technical phrases. "
        },
        {
            "text": "Enter the MOD’s approach to the international initiative, Cyber Awareness Month (CAM). Building on the success of last year’s campaign, CAM 22 focussed on delivering memorable and novel ways of learning that gave MOD personnel the opportunity to actively understand their role in protecting Defence through hands-on, gamified experiences."
        },
        {
            "text": "CAM 22 saw the return of the hugely popular Cyber Confident Escape Room, this time with a completely new and bespoke scenario focussed on the concept of an insider threat. The room toured across multiple UK sites, and saw 63 teams from various roles, ranks and experience fighting both an insidious hacktivist organisation, and the clock, to foil a cyber-attack against a remote Forward Operating Base."
        },
        {
            "text": "Whilst no actual fighting took place, we were tremendously impressed by the teamwork and problem-solving skills of all who took part. The scenario may – thankfully – not represent an average day for MOD personnel, but many of the take-home points, including password security and the separation of work and personal devices, certainly apply to more familiar environments."
        },
        {
            "text": "As the fictional hacktivist group, the ‘Ministry of Defiance’, attempted to break into the escape room, the MOD’s cyber experts were hard at work on their own mission: securing a copy of the hacktivists’ annual recidivist publication, Revolt Magazine! The magazine, which was subsequently distributed to MOD personnel across a number of sites and online (available here), provides a detailed look at the cyber methodology of hostile actors, written from their own perspective. We sincerely hope MOD cyber experts can replicate their success in 2023 by securing the next copy of Revolt Magazine."
        },
        {
            "text": "CAM 22 also saw the release of four video episodes covering subjects including online gaming, phishing, and how hostile actors could use social engineering to gain access to secure sites and systems. Our CAM 22 presenters also had the opportunity to speak to Cpl Natalya Platonova, who spoke frankly about social media and how winning reality TV show 'The Circle' impacted her life and career. "
        },
        {
            "text": "Finally, CAM 22 saw the release of a virtual game, the ‘Capture the Flag’, where participants were tasked to find out as much personal information on a target as possible, simply by going through their social media profiles; a truly eye-opening experience for all involved! Whilst the competition element of the game only lasted through CAM, the game is still playable here. Please view the CAM 22 highlights video below."
        },
        {
            "text": "Thanks to all those that took part in CAM 22. The Cyber Confident team look forward to seeing many more MOD personnel participating in next year’s CAM. However, it is important to remember that cyber security isn’t just for October, but all the time, online or offline, in the office or out and about."
        },
        {
            "heading": 2,
            "text": "And remember, the front line is you.  "
        },
        {
            "text": " "
        }
    ]
}