{
    "url": "https://naturalengland.blog.gov.uk/2022/11/25/new-scheme-to-protect-our-waterways-from-pollution-and-enable-home-building-set-to-launch/",
    "title": "New scheme to protect our waterways from pollution and enable home building set to launch",
    "authors": [
        "Natural England"
    ],
    "categories": [
        "Biodiversity"
    ],
    "pub_date": "2022-11-25T14:03:01+00:00",
    "content": [
        {
            "text": "by Mike Burke, Programme Director – Sustainable Development"
        },
        {
            "text": "The Dasgupta review has shown that nature underpins everything we do, and investing in nature generates prosperity. Leonardo Da Vinci said that “water is the driving force of all nature”, and no society can thrive without clean water. All rivers run to the sea, meaning pollution inland can also ultimately impact our marine environment. Recent river and coastal pollution incidents have brought the health of our rivers and coasts into sharp public focus."
        },
        {
            "text": "Natural England and Government are working with local planning authorities (LPAs) to ensure that wastewater produced by new homes does not increase pollution in our rivers and coasts, in line with regulatory requirements, whilst also allowing swifter decisions that enable the building of the homes the country needs."
        },
        {
            "text": "LPAs are the decision makers on housing developments and in doing so must comply with environmental regulations that apply to our nationally protected rivers and coasts. Using tools like nutrient neutrality, LPAs can permit new homes to be built without adding nutrient pollution to the worst affected rivers. Nutrient neutrality ensures that any increase in pollution is offset by a reduction in pollution in the same area - this is called mitigation. Mitigation can be achieved through a very wide range of measures right up to the creation of new wetlands or woodlands to capture nutrient pollution."
        },
        {
            "text": "The majority of housing developments across the country are not affected by nutrient pollution, but in 74 of the 333 Local Authorities in England, pollution levels in some nature-rich sites are so high that extra mitigation measures are needed. A number are already in place, established by for example LPAs, environmental Non-Governmental Organisations (eNGOs) and private landowners. However, we recognise that finding suitable mitigation for housing projects can be difficult and in some areas, the demand for mitigation is outstripping the supply. Natural England is therefore also establishing a scheme to help fill the gaps and make finding solutions quicker and simpler. Defra and DLUHC are investing up to £30 million over the next three years to fund the Natural England-led Nutrient Mitigation Scheme."
        },
        {
            "text": "The scheme was announced by Government in July 2022 to alleviate the impact of pollution in wastewater from new housing developments and support sustainable development. The scheme will complement other mitigation solutions and help LPAs and developers to bring forward the housing they consider right for their area, while protecting fragile rivers, lakes, estuaries and wildlife. It will also serve as a powerful and sustainable mechanism to secure the finance needed to help recover nature. It will bring benefits for the country through new, sustainable homes surrounded by the healthy natural environments that we all depend on and value."
        },
        {
            "text": "Since July we have been working with eNGO partners who are well placed to manage land for pollution mitigation and to realise the wider benefits of nature recovery. One of our early partners are The Wildlife Trusts. Dr Rob Stoneman, Director of Landscape Recovery, said: “We are pleased to be able to work with Natural England to provide nutrient mitigation solutions to protect some of our most precious wildlife and rivers from pollution. With funding from Natural England, we can help to reduce nitrogen and phosphorus entering estuaries and rivers by creating wetlands that filter pollutants whilst also creating habitats that lock up carbon and benefit people.”"
        },
        {
            "text": "We have been working with partners in impacted catchments to identify and develop additional mitigation projects. The first projects are currently being negotiated with two partners in the Tees catchment. Investment in feasibility studies in five further catchments is underway to determine the schemes next mitigation sites. We are currently identifying places most likely to be suitable for nutrient mitigation provision, and from December 2022 will approach landowners in a targeted way to invite them to offer their land as potential sites for nutrient mitigation. These sites will start to provide the mitigation needed by LPAs and developers, and we will expand across the country to facilitate building thousands of new homes as well as making a major contribution to nature recovery through the creation of new wetlands."
        },
        {
            "text": "The scheme will be open to all developers, with credits offered in batches for which developers can apply. Where demand for credits exceeds supply, applications will be prioritised to minimise nutrient neutrality related delays to development, to enable construction of the most homes most quickly, to facilitate small and medium enterprises who usually find it harder to access on site mitigation, and to support the delivery of affordable and social housing."
        },
        {
            "text": "We will formally launch the scheme by inviting applications for credits from developers before the end of March 2023. Details of how the scheme will work in practice will be available at scheme launch. It is envisaged that the scheme will enable LPAs to grant permission subject to conditions or obligations securing mitigation and phasing developments (if needed) so that mitigation is operational and in place, prior to any nutrient pollution being discharged. The Department for Levelling Up, Housing and Communities (DLUHC) will update the Planning Practice Guidance on the application of the Habitats Regulations Assessment in this regard and consider additional revisions as necessary."
        },
        {
            "text": "The scheme is developing rapidly, recognising the urgency with which mitigation options need to be brought forward. However, it will not meet the known demand for mitigation in all locations right away. Developers and LPAs will need to continue to explore all existing mechanisms to reduce nutrient loads. To assist, Natural England has worked with industry experts to develop further guidance. The recently published Wetland Mitigation Framework offers guidance on constructed wetlands to deliver nutrient neutrality. The guidance can be accessed via the Constructed Wetland Hub (arcgis.com)."
        },
        {
            "text": "We want to collaborate with LPAs, developers and land managers to realise the benefits:\n• We will continue to work with all parties to design the scheme. We will ensure regular two-way feedback enables ongoing improvements.\n• We will work closely with people interested in offering their land for targeted local mitigation projects. We will be approaching landowners and managers to do this."
        },
        {
            "text": "To deliver nature recovery and grow our economy we need to develop and deploy innovative tools. The new Nutrient Mitigation Scheme is a great example, showing how we can protect our natural assets and go further to achieve our socio-economic goals. We look forward to expanding our collaboration with partners and customers and innovating in the pursuit of nature recovery and sustainable development."
        },
        {
            "text": "If you have a query that is not covered by the previous blog or the frequently asked questions below, please email the nutrient mitigation team at nutrientmitigation@naturalengland.org.uk"
        },
        {
            "text": "Nutrient Mitigation Scheme Frequently Asked Questions"
        },
        {
            "text": "1. When will developers be able to buy credits and when will developers be able to start building?\nNatural England will launch the scheme by inviting applications from developers for mitigation certificates or credits from March 2023. Information for developers on credit availability and price will be released ahead of the first credit sales.\nNatural England is working closely with LPAs and other partners to identify opportunity and need in each catchment. The scheme will develop at different rates in different catchments based on these factors.\nBy reserving credits (via nutrient certificates issued by Natural England) developers provide assurance to LPAs that they can satisfy nutrient neutrality planning conditions. This will allow them to proceed with the development subject to any other planning conditions. Once payment for credits has been made, and any related planning conditions discharged, new homes can be occupied."
        },
        {
            "text": "2. How will Natural England provide confidence to LPAs and developers?\nNatural England will be accrediting mitigation projects according to environmentally robust standards.\nNatural England will issue certificates to developers to demonstrate they will meet their nutrient neutrality requirements.\nDevelopers will submit the certificate to LPAs as part of the planning process providing assurance to LPAs that they can satisfy nutrient neutrality planning conditions. Therefore, LPAs can be confident that the mitigation provided meets the requirements of the Habitats Regulations. Natural England are working with LPAs to ensure the scheme is designed in a way that meets the needs of Habitats Regulation Assessments."
        },
        {
            "text": "3. How will credits be distributed? Will larger developers buy up all the credits? What about smaller developers?\nAs the scheme is rolled out into each catchment, credits will be offered in batches and any developer requiring credits can apply for them.\nWorking in consultation with Defra, DLUHC, Homes England, and LPAs, a process has been designed to ensure distribution of credits is fair and transparent. The scheme will not allow banking of credits by developers.\nDevelopers will still be able to source credits from other suppliers/ markets, deliver credits via on-site features such as Sustainable Drainage Systems and/or deliver their own off-site nutrient mitigation in consultation with Natural England and the LPA.\nApplications will be assessed where projects can demonstrate:\n• Minimising delays to development as a result of nutrient pollution\n• Enabling development of the most homes, most quickly\n• Supporting small and medium-sized enterprises (SMEs) for which mitigation is harder to deliver on-site and for which the cost of mitigation is proportionally higher per house.\n• Development of affordable and social housing"
        },
        {
            "text": "4. If the Wastewater Treatment Works near me gets upgraded in future does that devalue the credits I might have sold or bought?\nNo, once credit transactions are completed, the upgrades will not have an impact. Depending on the timing of WWTW upgrades, developers may need to pay for a combination of temporary credits to cover the time gap and / or permanent credits. The upgrades will, in the longer term, reduce the amount of mitigation needed by developers."
        },
        {
            "text": "5. How much funding will government provide for the scheme?\nDefra and DLUHC will provide Natural England with up to £30m to establish Nutrient Mitigation Schemes in affected catchments.\nThe scheme will be run as a revolving fund whereby funds recouped from the sale of credits to developers will be used to fund subsequent mitigation projects. The scheme will initially aim to run until 2030 as under the proposed LURB amendment: this is the date by which water companies will be expected to have upgraded their wastewater treatment works (WWTW) to Technically Achievable Limits."
        }
    ]
}