{
    "url": "https://supportingfamilies.blog.gov.uk/2022/11/25/team-around-the-school/",
    "title": "Team Around the School",
    "authors": [
        "ballypahal"
    ],
    "categories": [
        "Early Help",
        "Education",
        "Multidisciplinary Teams"
    ],
    "pub_date": "2022-11-25T10:34:04+00:00",
    "content": [
        {
            "text": "What is a Team Around the School (TAS) model? "
        },
        {
            "text": "Team around the School (TAS) models are developing across the country with the aim of supporting schools to identify and support families earlier when the needs arise by increased collaboration with key partners. In April 2021 we shared a blog from Sheffield City Council on their Building Successful Families (BSF) model which included a significant team around the school element."
        },
        {
            "text": "The national Supporting Families team have recently engaged with a number of Local Authorities (LAs) within the Greater Manchester worked with the Innovation Unit and Greater Manchester Combined Authority to develop and adapt TAS models as part of Greater Manchester’s Innovation Spread & Scale programme. To gain further insight the national team spoke to Bury Council, Tameside Metropolitan Borough Council and Stockport Metropolitan Borough Council to understand how their TAS model was developed, and the benefits achieved through this model."
        },
        {
            "text": "In addition, the team also spoke to Newcastle City Council about their emerging model."
        },
        {
            "text": "Why is TAS important? "
        },
        {
            "text": "TAS models provide a structure for services to collaborate and meet regularly to support families alongside the school. Each model has been carefully thought through to ensure it is beneficial to the children, their families and the core team. Depending on each area, the core team can include Schools, Early Help Coordinators, Social Workers, School Nurse/ Health Representatives, Neighbourhood Coordinators and many other multi-agency partners, for example Police, probation and mental health services to provide whole family working and achieve positive outcomes."
        },
        {
            "text": "To identify the children and families to support, LAs utilised a mixture of data sources and matched these across families to develop a RAG (Red-Amber-Green) rating system of children in the school. The data streams included children on free school meals, Children in Need (CIN), Special Education Needs and Disabilities (SEND) as well as others. Using data in this way enabled a more ‘scientific’ method of determining vulnerability with an evidence base. One of the LAs interviewed said their list was ‘scarily’ similar to the list the school had, but it was built up over months of getting to know the children and their families. However, the list also contained children not on the school radar with low level or increasing vulnerabilities, demonstrating the importance of data alongside professional judgement in identifying vulnerabilities early."
        },
        {
            "text": "What are the benefits? "
        },
        {
            "text": "Local Authorities have told us some of the benefits they have achieved using the TAS models:"
        },
        {
            "text": "What are the top tips to implement a successful TAS? "
        },
        {
            "text": "‘It is key to be honest, open and transparent with key partners from the beginning to be successful- ensure strong collaboration with the schools to support and be involved in the development of the model… Plan a sample pilot before rolling out across areas’ Kirsty Walton & Karen Overy, Bury Council "
        },
        {
            "text": "‘Engage with schools from the beginning to ensure they are part of building the model, listen, adapt and evolve to school needs- use the resources and advice from health professionals and children service leads- ensure you build a good governance structure’ Lorraine Hopkins & Emma Lewis Tameside Metropolitan Borough Council "
        },
        {
            "text": "‘Give yourself time to implement a successful model-ensure the core team learn and understand each other’s roles so they can build relationships and work seamlessly together- every interaction is a possible intervention’ Jakki Rogers & Philip Wilkinson, Stockport Metropolitan Borough Council"
        },
        {
            "text": "How can I find out more about the TAS models Local Authorities are using?"
        },
        {
            "text": "To view the individual TAS process of the LAs interviewed (Bury Council, Tameside Metropolitan Borough Council, Stockport Metropolitan Borough Council and Newcastle City Council), please click here https://delta.communities.gov.uk/document-repository/public/download?uri=/document-repository/Team-Around-the-School-Models-Nov-22.docx"
        },
        {
            "text": "This forms part of the Supporting Families sharing good practice blog programme to showcase processes and procedures Local Authorities have implemented to inform decisions and provide early intervention to encourage better outcomes for families."
        },
        {
            "text": "For more information on the good practice happening in local areas through the Supporting Families programme please contact families.team@levellingup.gov.uk"
        },
        {
            "text": " "
        }
    ]
}