{
    "url": "https://hmlandregistry.blog.gov.uk/2022/11/25/working-in-user-centred-design-at-hm-land-registry/",
    "title": "Working in user-centred design at HM Land Registry",
    "authors": [
        "M Rowlands, Senior Content Designer"
    ],
    "categories": [
        "Working at HM Land Registry"
    ],
    "pub_date": "2022-11-25T09:31:49+00:00",
    "content": [
        {
            "heading": 2,
            "text": "Why user-centred design is so important"
        },
        {
            "text": "HM Land Registry records ownership changes for every registered property and piece of land in England and Wales. It’s a huge job and we need services that let people and businesses tell us about changes quickly and easily. We also need systems that let caseworkers process all these changes so we have an up-to-date and accurate record of land and property ownership."
        },
        {
            "heading": 2,
            "text": "How our design community works"
        },
        {
            "text": "The design community in HM Land Registry is a supportive group of designers (there must be a collective noun for designers!) with varied interests and experience."
        },
        {
            "text": "There are currently 28 people in the community, made up of service, interaction and content designers. We work on a variety of projects for internal and external services."
        },
        {
            "text": "Once a quarter we have an in-person away day to talk and learn about design."
        },
        {
            "text": "In addition, we have an online community session every week. In  previous sessions we’ve had an external guest speaker, quizzes, show and tells and sharing learning from courses, all of which helps us to build on our skills."
        },
        {
            "text": "We also have monthly Town Hall sessions where each project provides an update. This is a really useful way to make sure we share work and are aware of what others are working on."
        },
        {
            "heading": 2,
            "text": "Interesting projects"
        },
        {
            "text": "One of the projects I am currently working on is Application Processing. This is a system that allows caseworkers to process applications and update property titles. Applications coming into HM Land Registry range from a simple change of name to extremely complicated legal situations or changes in multiple ownership."
        },
        {
            "text": "When designing any new system and especially one on this scale, there are often technical limitations and compromises we need to make. This is a big piece of work with lots of interesting problems to be solved. We work closely with developers and testers to find ways to solve problems. I really value being able to speak regularly with developers and understand how our designs will get built."
        },
        {
            "text": "Within the agile framework there is flexibility in how we work. For example, we can decide on the structure of collaboration sessions and try different methods of working. We recently held a co-creation workshop which worked well for designers and caseworkers."
        },
        {
            "heading": 2,
            "text": "Getting feedback on our work"
        },
        {
            "text": "One of the advantages of working on an internal system is easy access to our users. This means we can get constant feedback on designs and know what our users need. Accessibility considerations are also incredibly important. We’ve been able to hold research sessions with the Disabled Employee Network who have provided valuable insights."
        },
        {
            "text": "During research, caseworkers said they find Application Processing easier to use and the language simpler than the system they used previously. The challenge will be keeping this approach as we design for more and more complex types of application."
        },
        {
            "text": "Ultimately, the better we can make Application Processing, the better it will be for caseworkers, solicitors and anyone who has ever bought or sold property. It’s satisfying to be part of something with such wide-reaching implications."
        },
        {
            "text": " "
        },
        {
            "text": " "
        }
    ]
}