{
    "url": "https://civilservice.blog.gov.uk/2024/10/02/five-of-the-best-civil-service-online-learning-courses/",
    "title": "Five of the best Civil Service online learning courses",
    "authors": [
        "Government Campus"
    ],
    "categories": [
        "A Modern Civil Service",
        "An Innovative Civil Service"
    ],
    "pub_date": "2024-10-02T08:13:06+00:00",
    "content": [
        {
            "text": "Government Skills online learning business partner, Gail Charlton picks out five of the best courses available to all civil servants."
        },
        {
            "text": "Gail says: “In the past year alone, civil servants completed around 2 million courses from the hundreds available on the Civil Service Learning website.”"
        },
        {
            "text": "But what makes great online learning?"
        },
        {
            "text": "Government Skills believes great online learning needs to be engaging, relevant and self-paced."
        },
        {
            "text": "Here they’ve picked out five of the best …"
        },
        {
            "heading": 3,
            "text": "Civil Service Expectations"
        },
        {
            "text": "Eleven quick-bite modules covering the Civil Service Code, the 2010 Equality Act, the importance of diversity and inclusion, where to go for help and support and much more. It’s part of our Civil Service Essentials learning package which aims to give those new to the civil service the very best grounding for their role."
        },
        {
            "heading": 3,
            "text": "Understanding data"
        },
        {
            "text": "With nine online learning modules, this course is for everyone who is new to data literacy but wants to learn. It’s part of our Civil Service Essentials learning package and an important part of the Civil Service recommended learning curriculum which featured in last year’s One Big Thing campaign."
        },
        {
            "heading": 3,
            "text": "Artificial Intelligence: Fundamentals"
        },
        {
            "text": "Ideal awareness-level learning, provided by industry leaders and selected by the Central Digital and Data Office, this course is part of Government Skill’s recommended Digital and Data learning curriculum."
        },
        {
            "heading": 3,
            "text": "Civil Service Line Management Induction Programme"
        },
        {
            "text": "This online course has been designed to help line managers get the best out of themselves and their teams and to ensure exceptional outcomes for both ministers and citizens. It works well with the Line Management Induction Programme and both are part of the Civil Service recommended collection of management courses."
        },
        {
            "heading": 3,
            "text": "Foundations of writing in government (JASPER)"
        },
        {
            "text": "A highly-rated course of  bite-sized learning, focusing on some basic principles of writing. A good refresher and great to work through as a team, it is part of Government Skills’ Writing skills learning curriculum."
        },
        {
            "text": "Explore Civil Service recommended learning."
        }
    ]
}