{
    "url": "https://naturalengland.blog.gov.uk/2023/09/13/farmers-lead-the-way-toward-sustainable-food-production-in-east-kent/",
    "title": "Farmers lead the way toward sustainable food production in East Kent",
    "authors": [
        "Natural England"
    ],
    "categories": [
        "Natural England"
    ],
    "pub_date": "2023-09-13T15:26:23+01:00",
    "content": [
        {
            "text": "Natural England adviser, Dan Tuson, writes on Back British Farming Day…"
        },
        {
            "text": "As a farm conservation adviser for Natural England, I’ve been working closely with farmers across Kent for 25 years to support them to incorporate wildlife friendly farming practices across 25,000 hectares of farmed landscape."
        },
        {
            "text": "By building long term, collaborative relationships with farmers on the ground and helping them enter environmental schemes such as Countryside Stewardship, farmers are driving significant changes on both a farm and landscape scale to increase food production while simultaneously protecting and enhancing the environment."
        },
        {
            "text": "As part of my work, I’m delighted to be involved in the East Kent Downs Landscape Recovery Project, a Natural England initiative involving a network of 100 farms across East Kent who come together to deliver environmental outcomes and share knowledge. Creating a new generation of wildflower grasslands forms the central pillar of the network, supplemented by the broader range of stewardship scheme measures common to all the farms’ schemes. ‘One to one’ close working between Natural England adviser and farmer provides the tailored advice and encouragement critical to creating these ‘high nature value’ habitats. Working together as a group, and with us coordinating and driving forward the ambitious expansion of the network year by year, the farms can share ideas, knowledge and equipment and celebrate their successes."
        },
        {
            "text": "To date, we’ve seen 992 hectares of new wildflower grasslands created from arable land and the restoration and enhancement of 1147 hectares of permanent grasslands. This has led to an abundance of butterflies such as the adonis blue, chalk hill blue, small blue and silver spotted skipper across these habitats, in turn providing enough food for a range of mammals, birds and reptiles. Habitat ‘specialists’ such as duke of burgundy and black veined moth are now enjoying dramatic upward trends in their distribution and abundance whilst the continual succession of species colonising the newly created wildflower grasslands, year on year, provides us with the confidence that this ‘habitat creation-led’ approach is truly delivering nature recovery for a wide range of species."
        },
        {
            "text": "Most significantly, these environmental benefits are being delivered alongside our target to increase domestic food production – a goal which remains a central part of my role in supporting farmers. The project’s winning formula centres on our approach of simply maximising the wildlife value and nature recovery potential of the more marginal areas of each farm’s land, ensuring that no productive area is taken out of food production. Making wildflower grassland creation the number one priority and not being fussy about where its located means that the farms receive a stable income on their unproductive areas of land whilst keeping the higher yielding areas of the farm under production. Compromise is key, and working with the equipment, livestock and resources unique to each farm makes for a wide spectrum of grassland management types which caters for a varied and diverse mosaic of wildflower habitats."
        },
        {
            "text": "The diversity of insect life, in turn, provides a great resource of natural crop predators that all help in maintaining healthy and more productive crops. Augmented with a range of more traditional stewardship measures that complement the new grasslands, such as field margins, cover crops and herbal leys, many farms are reaping the rewards of the integral role that nature can play in producing healthy crops and livestock at this critical time in agricultural transition. One of our farms, Nonington Farms, who have created wildflower grasslands as part of a wider approach to embracing regenerative farming, have been undertaking trials this year showing the benefits of wildlife friendly farming.  Examples include grazing cover crops before drilling spring oats, which increased yields by 0.5 tonnes per hectare demonstrating that adopting a regenerative approach to agriculture doesn’t necessarily impact on crop yields – quite the reverse in fact."
        },
        {
            "text": "Delivering for nature and food production is the very backbone of our new farming schemes such as Countryside Stewardship which provides financial incentives for farmers, foresters and land managers to look after and improve the environment, enabling farmers and landowners to be financially supported as they continue to produce food more sustainably."
        },
        {
            "text": "The Countryside Stewardship scheme provides funding for some of our projects most important improvements such as the native provenance wildflower seeding work and green hay spreading which has so far been used on 530ha of the new grasslands with another 100ha planned for this autumn."
        },
        {
            "text": "We’ve seen the Countryside Stewardship Scheme evolve over the last few years following direct farmer feedback. There are already 32,000 agreements successfully in place across England for 2023, which represents a 94% increase in uptake since 2020 – including nearly 26,000 Mid-Tier agreements – and additional investment has been put into online systems to increase capacity."
        },
        {
            "text": "Although my focus is fixed within the North Downs of Kent, projects such as The East Kent Downs Landscape Recovery Project are progressing right across the country. With many Natural England Farm advisors like me working to deliver tangible, on-site results for farmers during this transition period, I believe we can make a big difference for British farmers so we can both boost food production and protect our precious habitats."
        }
    ]
}