{
    "url": "https://vmd.blog.gov.uk/2023/09/13/its-illegal-to-advertise-products-imported-under-the-special-import-system/",
    "title": "It’s Illegal to advertise products imported under the Special Import System",
    "authors": [
        "Jackie Catterall",
        "Stacey Brown"
    ],
    "categories": [
        "Advertising",
        "Enforcement",
        "Inspections"
    ],
    "pub_date": "2023-09-13T11:15:02+01:00",
    "content": [
        {
            "text": "Manufacturers, distributors, and wholesalers cannot promote or advertise products imported under the Special Import Scheme. Jackie Catterall, Regional Managing Inspector (Northern Region) and Stacey Brown, Head of Supply Team, explain why."
        },
        {
            "heading": 2,
            "text": "Specially imported products are considered to be unauthorised veterinary medicines"
        },
        {
            "text": "These products do not hold a UK marketing authorisation, so they are classified as unauthorised medicines even though you have been granted permission to import and supply them in line with a valid certificate from us."
        },
        {
            "text": "They may only be supplied against a veterinary prescription, which means that under Regulation 11 of the Veterinary Medicines Regulations (VMR), a supplier cannot advertise or promote this type of product."
        },
        {
            "heading": 2,
            "text": "What is considered advertising?"
        },
        {
            "text": "We have defined ‘advertising’ in our guidance, Advertise veterinary medicines legally, as any activity that is aimed or designed to promote the sale, supply or use of a veterinary medicine, whether for profit or not. This includes electronic advertising such as website banners and emails."
        },
        {
            "text": "Manufacturers, distributors and wholesalers cannot advertise unauthorised veterinary medicines, either in writing or verbally. This includes use of:"
        },
        {
            "text": "Types of promotional material considered to be advertising includes:"
        },
        {
            "heading": 3,
            "text": "However, you can keep your veterinary surgeon customers informed by:"
        },
        {
            "heading": 3,
            "text": "Products can only be imported when there is no suitable authorised product available"
        },
        {
            "text": "The Special Import Scheme is an important tool to help ensure that vets can access the medicines they need to treat animals under their care when there is no authorised alternative product available."
        },
        {
            "text": "The Scheme ensures that certificates are only issued in response to an exceptional clinical need where we have assessed that the product is required to protect animal health and welfare."
        },
        {
            "text": "Do not abuse this system and put animals at unnecessary risk."
        }
    ]
}