{
    "url": "https://defrafarming.blog.gov.uk/2023/09/13/sfi-pinned-post/",
    "title": "The Sustainable Farming Incentive",
    "authors": [
        "The Team"
    ],
    "categories": [
        "Sustainable Farming Incentive"
    ],
    "pub_date": "2023-09-13T12:16:53+01:00",
    "content": [
        {
            "heading": 2,
            "text": "SFI: enhancing income, productivity and the environment"
        },
        {
            "text": "The Sustainable Farming Incentive (SFI) offers a reliable income which supports food production and the environment. "
        },
        {
            "text": "We've expanded and improved SFI based on your feedback. It’s now a much more flexible, broad and attractive offer with something for every kind of farm. "
        },
        {
            "text": "By having an SFI agreement, you will get paid for actions that support your business, food production and the environment. "
        },
        {
            "text": "Your agreement will start the month after you accept it.  "
        },
        {
            "text": "We’ve changed the way we check delivery to make it more flexible and pragmatic. You will be treated fairly and supported if things go wrong. We recently published a series of ‘how to’ guides for each SFI action. These guides are not mandatory, they are just intended to give you a bit more support.  "
        },
        {
            "text": "SFI is not competitive. Anyone who applies and is eligible will get an agreement. You can enter as much land as you choose: there is no minimum or maximum area.  "
        },
        {
            "text": "You can choose how many actions you do. Once you’re in SFI, you can add more land and actions to your agreement each year. "
        },
        {
            "text": "You will be paid quickly. As mentioned above, we know that inflation and rising input costs impact farming businesses. So, to help with cash flow, farmers who have a live 2023 agreement before the end of the year, will receive an accelerated payment in the first month of their agreement. "
        },
        {
            "text": "It’s possible to be in SFI and Countryside Stewardship at the same time if the actions are compatible and you are not being paid for the same action twice. "
        },
        {
            "heading": 2,
            "text": "Get ready "
        },
        {
            "text": "1. Read the official scheme guidance.  "
        },
        {
            "text": "The SFI Handbook for the 2023 offer sets out the official guidance in a single PDF document"
        },
        {
            "text": "The official guidance is also presented in individual, accessible webpages on GOV.UK"
        },
        {
            "text": "2. Check that you’re eligible to apply."
        },
        {
            "text": "3. Check that your land is eligible.  "
        },
        {
            "text": "4. Check the registered details on your digital maps are up to date. Requesting updates before you apply will make it easier when you fill in your application. It takes time for changes to be actioned so it’s best to request them as early as you can. "
        },
        {
            "text": "5. Check your contact details are up to date and your permissions are correctly set for SFI in the Rural Payments service. "
        },
        {
            "text": "6. Register your interest."
        },
        {
            "heading": 2,
            "text": "Things to consider "
        },
        {
            "heading": 3,
            "text": "When to carry out actions "
        },
        {
            "text": "If you’re planning to enter SFI, you can start some actions now and still be paid. For example, to take advantage of the autumn cover crop window. "
        },
        {
            "heading": 3,
            "text": "Hedgerow actions and digital maps "
        },
        {
            "text": "If you’re thinking of applying for the SFI actions for hedgerows (HRW1, HRW2 or HRW3), you do not need to check your hedgerows on your digital maps before you apply. You’ll find guidance on this in the SFI Handbook (section 3.1). "
        },
        {
            "heading": 3,
            "text": "If you farm on common land  "
        },
        {
            "text": "Those who farm on common land are eligible for SFI through group agreements. These agreements are likely to take longer to arrange and will require some manual processing because of the multiple parties involved. We will work closely with commons associations to help them get ready to apply, including providing access to commons maps. We will give an additional payment to those who farm on commons, to recognise the extra work required to enter into the scheme. "
        },
        {
            "heading": 2,
            "text": "Those with SFI 2022 standards agreements "
        },
        {
            "text": "Those with SFI 2022 standards agreements are encouraged to express their interest in the 2023 offer if they haven't already."
        },
        {
            "text": "The RPA will make contact to discuss options for coming into the new scheme. If you have an existing SFI 22 standards agreement, you can include this land or additional land in your application. The RPA will work with you to arrange this once they receive your application."
        },
        {
            "text": "If you’d like to contact the RPA now, you can:"
        },
        {
            "text": "We might be able to invite those with SFI 2022 standards agreements to apply before the end of their agreement. We will let them know.  "
        },
        {
            "heading": 2,
            "text": "Learn more "
        },
        {
            "heading": 2,
            "text": "Talk to us "
        },
        {
            "text": "If you have a question, post it in the comments section below. "
        },
        {
            "text": "Remember, Basic Payment Scheme recipients can get free business advice from independent providers. To find a provider in your area, visit the Farming Resilience Fund page on GOV.UK."
        }
    ]
}