{
    "url": "https://civilservice.blog.gov.uk/2021/10/12/baby-loss-awareness-week-our-stories-so-far/",
    "title": "Baby Loss Awareness Week - Our stories so far ",
    "authors": [
        "Katie James-Manning, Policy Adviser, Cabinet Office",
        "Helen Mallison"
    ],
    "categories": [
        "A great place to work",
        "A Modern Civil Service",
        "An Innovative Civil Service"
    ],
    "pub_date": "2021-10-12T12:28:47+00:00",
    "content": [
        {
            "heading": 3,
            "text": "This year’s theme for Baby Loss Awareness Week - from 9 to 15 October - is wellbeing.  Katie James-Manning and Helen Mallison, who were impacted by their experience in different ways, reflect on what personally helped them."
        },
        {
            "heading": 3,
            "text": "KATIE’S STORY"
        },
        {
            "text": "I’m Katie. I think if you’d asked me this question after my first loss in June 2020, I would have struggled to say anything. Even more so, after my second loss in December 2020. After both losses, it was too incomprehensible to imagine a time moving forward without pain. But the more I reflected, I started to think about what actually  helped pull me through this first year. These are a few of my thoughts. "
        },
        {
            "heading": 4,
            "text": "Time"
        },
        {
            "text": "For me, the one thing that I didn’t want to hear was that “time is a great healer.” It  seemed too hard to take when getting through every day felt so excruciating. With that, I am pretty sure I muddled  through all the stages of grief and then back again. Ultimately, what really helped was realising and accepting that my grief would always remain part of me. "
        },
        {
            "text": "In that way, it took the pressure off thinking I could grieve only for a set period of time, at the end of which I would move on and that would be it. I now know  I can think about it, talk about it, cry about it at any point in my life when I need to - and that’s ok. "
        },
        {
            "heading": 4,
            "text": "Good to talk "
        },
        {
            "text": "Being able to talk about loss openly was really important to me. I needed to be able to talk about my experiences, about how they affected me: physically, emotionally and mentally. "
        },
        {
            "heading": 4,
            "text": "Daring to hope"
        },
        {
            "text": "This included processing some questions that I didn’t know if I would ever find the answers to, such as: why me? Did I do something wrong? Will it happen again? Can I dare to think of myself as a mother? "
        },
        {
            "text": "I needed to be able to process these questions so I could regain hope for my future. I did this by talking to friends, family and a counsellor. I also needed to talk to people with shared experiences because my isolation, confusion and loneliness made it incredibly difficult to process the losses. "
        },
        {
            "heading": 4,
            "text": "Support group"
        },
        {
            "text": "This is one of the reasons why in March this year, I set up a Baby Loss Support Group within the Cabinet Office. It has helped me to connect with others by providing a safe, non-judgmental space to find support, advice and guidance from people who have had similar experiences. "
        },
        {
            "heading": 4,
            "text": "Memorial"
        },
        {
            "text": "I wanted to be able to remember our babies and commemorate their lives. As my losses were early, it meant that I had nothing to say that they ever existed and I found that very difficult to process. "
        },
        {
            "text": "My husband James and I decided to give our babies names. Our first baby is called Charlie and our second, Jesse. For us, it helped to use their names in conversations and to keep their memories alive. "
        },
        {
            "text": "We also decided to create a quiet, tranquil space in our garden that acts as a living memorial to them. It’s a place where we can go to feel connected to them and it’s our way of showing them that we think about them and love them, always. "
        },
        {
            "heading": 3,
            "text": "HELEN’S STORY"
        },
        {
            "text": "I’m Helen. I lost my baby, Amber, at term. Her heart stopped beating inside me at 39 weeks over 10 years ago.  This doesn’t mean it’s less painful, but I’ve had a full decade of managing my grief, and celebrating her life. "
        },
        {
            "text": "Katie is right - nothing ‘helps’ when you've lost something so precious. I struggled to accept the finality of her funeral and the scattering of her ashes. I didn’t want Amber to be forgotten - so I found things that I could do in her memory. I wanted to celebrate the life Amber should have had, and that we should have enjoyed with her here."
        },
        {
            "heading": 4,
            "text": "Stories"
        },
        {
            "text": "When Amber arrived, we read stories to her. On what should have been her first birthday, we had over 100 friends and family reading stories all the way through the night in her memory, raising money for Tommy’s, a pregnancy and baby loss charity. The year she should have started school, we donated books to the school library in her name. Each year on her birthday, we read stories by candlelight in her memory with our two living children.  "
        },
        {
            "heading": 4,
            "text": "Birthday Cake"
        },
        {
            "text": "I didn’t have many ideas for Amber's first birthday. By her second birthday, I knew I wanted it to be a celebration. So ever since, I’ve made her a birthday cake to mark her day. I found this really therapeutic, thinking about her, thinking how old she should be, what things she might be into, what cake would make her smile."
        },
        {
            "text": "These are my two favourites of all the cakes I’ve made for her. On her 6th birthday, I was lost - I didn’t feel I knew what a six-year-old girl would enjoy. I settled on a weird mix of batman/princess/unicorn."
        },
        {
            "text": "Amber’s special place"
        },
        {
            "text": "We scattered Amber’s ashes somewhere special with meaning. We return each year to read her special story and leave a flower (the children leave raisins or sweets). These are not sad trips, but special shared family moments. We smile, we laugh, we play. The visits usually encourage questions from the children that maybe haven’t occurred to them before, and seem to help them feel comfortable talking about their feelings about the older sister they never got to meet."
        },
        {
            "text": "Me time"
        },
        {
            "text": "I find the run up to Amber's birthday tough. I’m not as emotionally resilient. But once it gets to her birthday, that’s usually a happy day, with amazing memories of holding my first born baby girl. I remind myself each year to be gentle on myself and to take time out if I’m having a wobble. On her birthday, I allow myself to wallow in my memories - it’s not for everyone - but allowing myself that time works for me."
        },
        {
            "text": "Want to find out more? Civil servants can contact: baby-loss-support-group@cabinetoffice.gov.uk "
        }
    ]
}