{
    "url": "https://civilservicelocal.blog.gov.uk/2021/10/12/black-history-month-2021-proud-to-be-honours-recipients/",
    "title": "Black History Month 2021: ‘Proud to be’ honours recipients",
    "authors": [
        "Sophie Kimber, Cabinet Office"
    ],
    "categories": [
        "A National Spotlight",
        "East, South East & London"
    ],
    "pub_date": "2021-10-12T09:28:11+00:00",
    "content": [
        {
            "text": "Civil Service Local East, South-East and London (ESEL), the Civil Service Race Forum (CSRF) and the Cabinet Office’s Honours and Appointments Secretariat are pleased to invite you to an event on the honours system to mark Black History Month. "
        },
        {
            "heading": 4,
            "text": "Why join us:"
        },
        {
            "text": "You will hear from Black civil servants who have been awarded honours about their experiences as well as how to make a nomination for someone who is going above and beyond in their work."
        },
        {
            "heading": 4,
            "text": "What is the honours system? "
        },
        {
            "text": "The honours system celebrates the people who go over and above to change the world around them for the better. The system recognises the people who have:"
        },
        {
            "text": "Anyone can nominate someone for an honour. The nomination needs to show how the person has gone above and beyond and made an exceptional contribution to their community, workplace or country. "
        },
        {
            "text": "Civil servants are just one of the groups of people who receive honours annually. Honours are bestowed on civil servants for a number of reasons - from creating and leading a staff network to delivering on a major government project that affects millions of people. This event will highlight the diversity of contribution from those who are awarded honours. "
        },
        {
            "heading": 4,
            "text": "Our speakers: "
        },
        {
            "text": "You will hear firsthand from four honours recipients about what being awarded an honour means to them. They include: "
        },
        {
            "text": "Hosted by Justin Placide, Assistant Director at at ‎Department of Business Energy & Industrial Strategy."
        }
    ]
}