{
    "url": "https://governmentscienceandengineering.blog.gov.uk/2021/10/12/celebrating-women-across-the-civil-service-on-ada-lovelace-day/",
    "title": "Celebrating women across the Civil Service on Ada Lovelace Day",
    "authors": [
        "Professor Christine Maggs, Chief Scientist JNCC"
    ],
    "categories": [
        "Blog Series",
        "Diversity & Inclusion",
        "Guest Blog"
    ],
    "pub_date": "2021-10-12T10:30:11+01:00",
    "content": [
        {
            "text": "Tuesday 12th October 2021 is Ada Lovelace Day, an international day celebrating the achievements of women in science, technology, engineering, and maths."
        },
        {
            "text": "It originated as a pledge to write about someone we admire.  Ada (1815-1852), daughter of the mathematician Lady Byron and her estranged husband the poet Lord Byron, is often seen as the world's first computer programmer.  She was introduced by Mary Somerville (subject of an earlier GSE event) to Charles Babbage, “the father of computing”, and worked with him on his Analytical Engine, the cornerstone of most modern computers.  She had three children, was considered very eccentric, and died from cancer when only 36 (Wikipedia)."
        },
        {
            "text": "Last year I participated in a poetry reading with my hero, Jocelyn Bell Burnell (https://www.ria.ie/news/membership-public-engagement-discourse-series/watch-astronomy-and-poetry-discourse).  Jocelyn’s work has been widely recognised and in 2018, she received the Special Breakthrough Prize of US$3 million (https://breakthroughprize.org/News/45), an award previously won by Stephen Hawking.  Today I want to celebrate all the talented and high-achieving, but often publicly poorly known, female scientists in the Civil Service and Public Service."
        },
        {
            "text": "At the Joint Nature Conservation Committee, the ALB where I work, women comprise 70% of staff, attracted by the inclusive culture that provides opportunities and options for part-time working, job sharing and remote working, in an environment where family life is high on the agenda.  We are delighted to have Dr Gemma Harper as our new CEO, and the Executive Leadership Team is now 50% female."
        },
        {
            "text": "Across the Civil Service, female staff members, at all grades, and in all sorts of roles, are role models, through the day-to-day management of their careers and family lives, both within the organisation and beyond.  Without these female staff, the Civil Service would be unable to deliver on its commitments, particularly in the highly stressed conditions of the pandemic."
        },
        {
            "text": "Ada Lovelace day will be marked this year by the Met Office hosting an inspirational woman, Dr Helene Hewitt at 13:00 – 14:00.  Link: Talk and Q&A with Dr Helene Hewitt."
        },
        {
            "text": "Sign up to the GSE blog to receive an email when a new blog is published and keep up to date with the work of the GSE profession."
        }
    ]
}