{
    "url": "https://companieshouse.blog.gov.uk/2021/10/12/choosing-a-standard-industrial-classification-sic-code-for-your-company/",
    "title": "Choosing a standard industrial classification (SIC) code for your company",
    "authors": [
        "Gary Townley - Senior communications manager"
    ],
    "categories": [
        "Company guidance"
    ],
    "pub_date": "2021-10-12T09:58:37+01:00",
    "content": [
        {
            "text": "According to our colleagues at the Office for National Statistics, the UK standard industrial classification of economic activities, abbreviated as UK SIC, is a 5-digit classification providing the framework for collecting and presenting a large range of statistical data according to economic activity."
        },
        {
            "text": "To put it simply, when you start your business you need to tell us what type of business you’re starting."
        },
        {
            "text": "There are over 600 individual SIC codes to choose from and you’ll need to provide at least one code to describe what your business does. By supplying this data, it allows us to track the number of companies operating in the different type of industries. This gives an indication of emerging trends and the strength of the UK economy."
        },
        {
            "heading": 2,
            "text": "Choosing your SIC code"
        },
        {
            "text": "You can find the most appropriate SIC code for your company by searching our condensed list of SIC codes. The list is divided into 21 main industry categories and within each category there will be more specific trade activities."
        },
        {
            "text": "If your company provides an array of different trades or goods, you can select up to 4 SIC codes to describe the diverse nature of your activities."
        },
        {
            "text": "Even if your company is dormant (99999) or non-trading (74990), you still need to supply a SIC code."
        },
        {
            "text": "In our recent series of short videos, some of the company directors on our register tell us about running their companies and how they manage their legal responsibilities. We can also take a look at their choice of SIC codes."
        },
        {
            "text": "Panel Graphic Limited are a supplier of enhancement screens for electronic information displays based in Norwich. With a diverse range of services, they have chosen 3 SIC codes:"
        },
        {
            "text": "Shearer Candles have been creating candles in Scotland since 1897. Throughout their long history, it's always been a family business and is now proudly run by Barnets & Daughters Limited. Using all 4 SIC codes, they have:"
        },
        {
            "text": "At Foxes Academy, students learn the skills, knowledge and confidence to successfully shape their own futures. Its mission is to help young adults with learning disabilities find sustainable employment in the hospitality sector and live independently. They've used one SIC code - 85590 Other education not elsewhere classified - to describe their business area."
        },
        {
            "text": "SIC codes appear on the overview screen for each limited company on the register. If after making your SIC choice you need verification, use the Find and update company information service to find a company who offer the same services as you. For example if you’re thinking of opening a coffee shop which sells records then a quick search for Hard Lines Limited will show that they have used SIC code 47250 Retail sale of beverages in specialised stores, and this may also be the right choice for you."
        },
        {
            "heading": 2,
            "text": "Changing your SIC code"
        },
        {
            "text": "If you provide the wrong SIC code when you set up your company, or your main business activities change after company formation, you can update your SIC code when you file your next confirmation statement. If you need to change your SIC code immediately, you can file a confirmation statement early."
        },
        {
            "text": "It’s good practice to keep your information up-to-date so anyone looking to do business with your company has accurate information. If you need to update your information, you can make most changes using our online services."
        }
    ]
}