{
    "url": "https://dvladigital.blog.gov.uk/2021/10/12/dvla-supporting-women-in-stem/",
    "title": "DVLA supporting women in STEM",
    "authors": [
        "Natalie Jones",
        "Nicola Porter"
    ],
    "categories": [
        "DVLA Digital Services"
    ],
    "pub_date": "2021-10-12T11:12:13+01:00",
    "content": [
        {
            "text": "Every year, on the second Tuesday of October, we celebrate Ada Lovelace Day."
        },
        {
            "text": "Ada Lovelace paved the way for future generations of women in science, technology, engineering and maths (STEM). A 19th century mathematician, she is often referred to as the ‘world’s first computer programmer’ for writing an algorithm for an early version of the computer."
        },
        {
            "text": "The aim of Ada Lovelace Day is to increase the profile of women in these industries by celebrating their contribution and achievements, helping create role models and encouraging more girls and women into a career in STEM."
        },
        {
            "text": "At DVLA we continuously share our knowledge and expertise to encourage more women into STEM roles. As one of the first government departments to bring its IT function in house and having one of the largest self-sufficient IT departments in government, DVLA is in a perfect position to support this, with various programmes and opportunities in place to support women who are interested in a career in STEM."
        },
        {
            "text": "We caught up with Natalie Jones and Nicola Porter about their first steps on their journey to a career in STEM at DVLA."
        },
        {
            "heading": 3,
            "text": "Tell us about yourself and your background"
        },
        {
            "text": "Natalie: For the last 7 years I worked in DVLA’s contact centre as part of the multi-channel team, answering customers’ queries via webchat, email and social media. More recently I became a student in the Business Analysis Development Programme."
        },
        {
            "text": "Nicola: My career so far has been spent in finance. I started as a Finance Graduate in a manufacturing plant, before progressing to Finance Analyst in the same company. I moved to DVLA in the finance team for the IT department as the Budget and Reporting Coordinator. Like Natalie, I too recently became a student in the Business Analysis Development Programme."
        },
        {
            "heading": 3,
            "text": "Why did you choose a career in the STEM industry? "
        },
        {
            "text": "Natalie: I am quite inquisitive and enjoy knowing and learning how things work. I have good general IT skills and with technology now playing such a vital part in our lives, and more so in the future, I want to be a part of that."
        },
        {
            "text": "Nicola: I don’t have any previous experience working in a STEM industry, but it’s always something I’ve been interested in pursuing. Last year I joined DVLA’s Code Learning Community. In this group, we learned about other IT areas and began learning how to code."
        },
        {
            "text": "I also started studying at home using resources such as FreeCodeCamp and Udemy. Joining the Information and Technology Services (ITS) directorate and the Code Learning Community introduced me to other STEM career paths I otherwise wouldn’t have known about."
        },
        {
            "heading": 3,
            "text": "How did you get involved with the Business Analyst Development Programme?"
        },
        {
            "text": "Natalie: I’ve been interested in a new career that was IT-related for a little while now, but I didn’t know where to start without any qualifications. I was pointed to the advert for the Business Analysis Development Programme on Civil Service Jobs after my friend, who is currently a BA at DVLA, recommended the role."
        },
        {
            "text": "It instantly caught my attention, and with the opportunity to ‘earn as you learn’, it was a no-brainer to apply. I know DVLA has a strong learning and development culture, and I have been supported really well throughout my transition to an IT role."
        },
        {
            "text": "Nicola: I signed up to the Digital Voices group early this year – this is a DVLA-run group that supports colleagues interested in developing their skills and confidence in IT further or those seeking a new career path. In one of the meetings, they had a talk on the new Centre of Digital Excellence (CoDE) roles that would be coming up soon. This is where I first heard about the Business Analysis Development Programme."
        },
        {
            "text": "After the meeting, I was intrigued about the programme so decided to find out more information about the previous intake via blogs and intranet articles. It seemed like a good fit with the skills I’d gained from previous employment and a very interesting career path."
        },
        {
            "heading": 3,
            "text": "How is the programme so far? "
        },
        {
            "text": "Natalie: So far I’ve learnt the basics around the role of a Business Analyst (BA), what techniques BAs use and how important the role of a BA is to a company, particularly in DVLA. It’s been amazing to be given the opportunity to be part of this programme and to learn new skills."
        },
        {
            "text": "Nicola: The course has been great so far. I’ve learnt about different tools and techniques and met the other BAs. Completing team exercises with the other members of the cohort has been great for learning on the job, as well as meeting new people."
        },
        {
            "heading": 3,
            "text": "What does the future hold?"
        },
        {
            "text": "Natalie: I’d love to have gained my BA qualifications as well as insight into other areas in STEM and I hope to work towards a promotion as I see this as a career for life. My long-term goal is to become a Senior Business Analyst."
        },
        {
            "text": "It's important to evolve with the forever changing technology world that we live in and we are given great support at DVLA, so the future is bright!"
        },
        {
            "text": "Nicola: I’m very much looking forward to my future at DVLA and want to continue learning to further my career. By using resources, as well as the knowledge and expertise within DVLA, I hope to increase my skill set and progress."
        },
        {
            "heading": 3,
            "text": "Do you have any advice for someone interested in a career in STEM? "
        },
        {
            "text": "Natalie: Believe in yourself. If there is an opportunity to get involved in STEM, take a chance and go for it! If you're unsure where to start, I've found DVLA a great place to begin my journey. The variety of roles and learning opportunities make it easy to try new things."
        },
        {
            "text": "Nicola: There are so many free resources online now, it’s easy to find out about the different STEM career paths available and find the one that really interests you! Setting up Civil Service Jobs alerts for any areas that interest you is a good way to see which jobs are available to you and what skills you need to develop to apply for those roles."
        },
        {
            "text": "Subscribe to our blogs for updates on the current Business Analysis Development Programme. If you’re interested in a career in STEM in a supportive and dynamic organisation, check out our current roles on Civil Service Jobs."
        }
    ]
}