{
    "url": "https://hodigital.blog.gov.uk/2021/10/12/establishing-the-home-office-user-research-ethics-board/",
    "title": "Establishing the Home Office User Research Ethics Board",
    "authors": [
        "Sian Cook",
        "Liam O'Brien"
    ],
    "categories": [
        "Continuous improvement",
        "User research"
    ],
    "pub_date": "2021-10-12T14:41:05+01:00",
    "content": [
        {
            "text": "In Home Office Digital, Data and Technology we are leading the way across the UK Civil Service in embedding a considered approach to ethics into our research."
        },
        {
            "text": "We’ve established an Ethics Board to ensure the rights, safety, wellbeing and dignity of all participants and researchers involved in our research. We draw on national regulations and sector specific guidance and are overseen by our Head of User Research."
        },
        {
            "heading": 2,
            "text": "What does a user researcher do?"
        },
        {
            "text": "As user researchers we plan, design and carry out research activities with you, the users of Government services. We share that research with our teams to help them understand how you use those services."
        },
        {
            "text": "This research informs policy, proposition, service, content and interaction design and has helped shaped Home Office services like ‘Apply online for a UK passport’ and ‘View and Prove your Immigration Status’."
        },
        {
            "text": "As user researchers working on these projects, we make key decisions about the involvement of participants and researchers, the treatment of data and the analysis approach. Many of these decisions have ethical implications."
        },
        {
            "heading": 2,
            "text": "The Home Office User Research Ethics Board"
        },
        {
            "text": "We have developed a set of policies, processes and resources that help our 70 user researchers maintain high ethical standards."
        },
        {
            "text": "Our approach is guided by departmental rules and data regulations. We are a Market Research Society (MRS) Company Partner, so we also align our policies with the MRS Code of Conduct."
        },
        {
            "text": "At the heart of our approach sits the User Research Ethics Board.  Overseen by our Head of User Research, the board is a committee of 11 user researchers from across the department, plus representatives from Social Research, Accessibility and Inclusion, Research Operations and Content Design."
        },
        {
            "text": "Our members apply to the board via an expression of interest, and we look for diverse skills, experiences and perspectives."
        },
        {
            "text": "We are the first ethics board of our kind in the UK Civil Service, so we base our approach on ethics boards in academic and medical contexts."
        },
        {
            "heading": 2,
            "text": "How does the ethics review process work?"
        },
        {
            "text": "One of the main things our ethics board does is review research proposals. We require researchers to submit their plans to the board if their research involves vulnerable participants or poses a significant risk to the researchers involved."
        },
        {
            "text": "We define exactly what kind of research requires a submission, but we also rely on individuals to contact the board when they feel it is appropriate. Researchers must use our ethics submission form which guides them through all the aspects of research they need to consider."
        },
        {
            "text": "When a proposal is submitted, two to four board members volunteer to review it. We then consolidate feedback into clear, actionable recommendations along with one of three decisions:"
        },
        {
            "text": "Where revisions are needed, the board collaborates with researchers to help improve their proposals. The vast majority of research is approved."
        },
        {
            "text": "The submission process normally takes five to seven working days. Our fast turnaround times are essential to ensuring we meet the needs of our researchers, who all work in fast-paced agile delivery teams."
        },
        {
            "text": "Diagram showing the ethics submission process."
        },
        {
            "text": "We’re constantly looking to improve the way we review submissions.  For example, we recently conducted usability testing to make the submission form clearer and easier to complete."
        },
        {
            "heading": 2,
            "text": "How our ethics board supports our user researchers"
        },
        {
            "text": "The board provides ethics guidance and resources to the Home Office research community, including:"
        },
        {
            "text": "We embed our ethical standards by training all our researchers in ethics and data handling. The course covers:"
        },
        {
            "text": "We regularly update our guidance, resources and training materials to improve clarity, usability and accessibility."
        },
        {
            "heading": 2,
            "text": "User research ethics across government"
        },
        {
            "text": "The board plays an active role in the cross-government research community."
        },
        {
            "text": "We hosted the first cross-government ethics meetup in 2019 to help improve ethical user research practice."
        },
        {
            "text": "We are keen to hear from others across government about user research ethics and exchange best practice."
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": "Sian and Liam are user researchers at the Home Office. They sit on the User Research Ethics Board alongside their project roles."
        },
        {
            "text": " "
        },
        {
            "text": " "
        }
    ]
}