{
    "url": "https://environmentagency.blog.gov.uk/2021/10/12/partnership-is-king-for-positive-progress/",
    "title": "Partnership is key for positive progress",
    "authors": [
        "elenaholmes"
    ],
    "categories": [
        "Waste"
    ],
    "pub_date": "2021-10-12T13:47:03+00:00",
    "content": [
        {
            "text": "Lee Marrs, Intelligence Research Officer at the Environment Agency, discusses working with industry partners to prevent the illegal export of waste."
        },
        {
            "text": "Last month we took big strides towards our ambition to stop illegal export of waste to protect the environment and human health."
        },
        {
            "text": "We held a conference bringing together industry partners, influential shipping lines, including Maersk and Competition and Markets Agency (CMA), freight forwarders, UK governing bodies and members of tyres and recycling associations. The aim of the day was to highlight the legal responsibilities of all involved in the waste exports market to establish a collaboration between them and us."
        },
        {
            "text": "Conference delegates learned many lessons:"
        },
        {
            "text": "I was thrilled to see such fantastic attendance from many large companies. This gave us our best opportunity to help them understand the issues and how together we can prevent these. Through simple checks before waste leaves our shores, costly repatriations can be prevented. This message was echoed throughout the day from our Illegal Waste Exports team and external partners, including The European Union Network for the Implementation and Enforcement of Environmental Law (IMPEL) and The International Criminal Police Organisation (INTERPOL)."
        },
        {
            "text": "IMPEL opened the conference, presenting the work of the Shipment of Waste Enforcement Actions Project (SWEAP). This really emphasised to everyone where the common trends are in illegal waste exports, from paperwork administrative offences to contaminated waste loads. Delegates couldn’t ignore the clear evidence uncovered by the SWEAP project that shows where we all need to focus our attention!"
        },
        {
            "text": "INTERPOL reinforced this, providing an eye-opening view into how we need to tackle waste crime pollution happening at sea as a result of illegal waste exports. Their 30 Days at Sea Projects have already achieved results, including the first ever South African conviction for maritime pollution and 1318 arrests for numerous waste crime pollution offenses. For me this really showed the scale of the problem we all face and how it will take all of us to stop these crimes and bring offenders to justice."
        },
        {
            "text": "Bringing the focus to plastic waste exports from the UK, Carl, one of our Technical and Port Officers shared a case study from his own personal experience of tackling this problem, presenting information on trends and risks. The case study highlighted a recovery facility entered onto exports documentation. By doing a small amount of research he discovered that the destination address for the waste plastic was in fact a hairdressers! Amusing but, the message was strong and clear - criminals will enter false information onto an Annex VII in an attempt to mislead us or hoping we will not check. Industries as well as us can and should carry out these checks. This is a really quick, effective way to reduce opportunities for criminals to break the rules. To bring home the importance of doing these checks, Carl played a BBC video that showed plastic being dumped and burned in the deserts of Turkey. This had a powerful impact on everyone watching, showing how important it is that we work together to protect and preserve both environment and human health."
        },
        {
            "text": "Onto tyres and what happens when they become scrap. In my role as an Intelligence Research Officer, I presented delegates with the ugly truth about the volume of scrap tyres illegally exported to India and Pakistan. I shared how intelligence we received led us to discover that a facility who are only allowed to export two containers per week, were actually exporting 30 containers per week. Hearing this shocked numerous attendees. I explained the vital role those present have in reducing the chances of a costly repatriation or quay fees by implementing simple checks into their booking process. They would soon know if that booking is legal or not."
        },
        {
            "text": "Showing photos from his inspections checking for End of Waste status, Technical Officer, Graham explained End of Waste status is achieved via one of three ways:"
        },
        {
            "text": "He explained to delegates how it applies to exports, detailing the risks, including huge reputational damage to those companies at the conference, if they are involved in the movement of material that has not been certified as End of Waste. This soon had attendees realising collaboration with the Environment Agency would be beneficial to their company."
        },
        {
            "text": "Positive change began on the day, with Turkon Line leaving with ideas for new procedures to put in place within their business so they can play their part in reducing illegal waste movements. Post conference we’ve heard from shipping lines and freight forwarders telling us they are looking at implementing the checks into their booking procedures and are truly on board with collaborating with us. This is an absolute joy for me and my colleagues confirming that what we started at this conference, with those partners and companies, is already making a difference"
        }
    ]
}