{
    "url": "https://accessibility.blog.gov.uk/2021/10/12/save-the-date-get-online-week-returns-for-2021/",
    "title": "Save the date! Get Online Week returns for 2021",
    "authors": [
        "HMRC Digital Inclusion, Accessibility & Standards Team"
    ],
    "categories": [
        "Accessibility",
        "Events"
    ],
    "pub_date": "2021-10-12T10:00:06+01:00",
    "content": [
        {
            "text": "Get Online Week is back! Between 18 and 22 October, HMRC along with organisations across the UK will be running events to raise awareness around digital inclusion and will help people all over the country find the support they need to improve their digital skills. This time of the year provides us with an opportunity to raise the profile of digital inclusion in our professions and examine what we can do as government departments - and individuals - to help more people get online."
        },
        {
            "heading": 2,
            "text": "What does digital inclusion mean and why is it so important?"
        },
        {
            "text": "Digital inclusion is about helping and enabling everyone to get online and empowering them to join in activities online in a meaningful and productive way. Many of us have used digital tools to help stay in touch with friends and family, or access entertainment in new and different ways in the past year. They have helped us at times when face to face contact wasn’t possible. We’ve used digital skills and services for essential tasks too. Perhaps to shop online, book medical services, or work from our homes. Imagine how different life would have been without access to digital services, skills, or tools. That’s the experience for more than 2.6 million people who are still offline in the UK and/or find themselves digitally excluded."
        },
        {
            "heading": 2,
            "text": "What is HMRC doing?"
        },
        {
            "text": "HMRC is continuing its journey to become a fully digital tax system which can support everyone’s needs. We want to enable all of our customers to engage digitally with confidence and feel at ease. Get Online Week will help us do this. We will run a varied programme of online sessions between 18 and 22 October, which is tailored to a cross government audience. By sharing data and insights, we aim to enhance knowledge, identify opportunities, and encourage everyone to consider digital inclusion in the work that they do. High-profile organisations such as Lloyds Bank, The Good Things Foundation, and the Office of National Statistics will also be joining us, so ensure you sign up early to avoid disappointment."
        },
        {
            "heading": 2,
            "text": "How can I sign up?"
        },
        {
            "text": "You can find our agenda and session descriptions on Eventbrite. For those who are unable to use Eventbrite but would like to attend a session, please send an email to digital.inclusion@hmrc.gov.uk"
        },
        {
            "heading": 2,
            "text": "What else can I do?"
        },
        {
            "text": "Consider volunteering in your local community or at a charity to help people learn basic digital skills. By doing this, you can demonstrate the potential of using online services, allowing people to find new ways to shop, find entertainment, and stay in touch with friends and family."
        }
    ]
}