{
    "url": "https://educationhub.blog.gov.uk/2021/10/what-are-institutes-of-technology/",
    "title": "What are Institutes of Technology?",
    "authors": [
        "Media Officer"
    ],
    "categories": [
        "Further education"
    ],
    "pub_date": "2021-10-12T09:18:32+01:00",
    "content": [
        {
            "heading": 3,
            "text": "What are Institutes of Technology? "
        },
        {
            "text": "Institutes of Technology, or IoTs for short, are one of the most exciting new developments in post-16 and adult education. They are  collaborations between further education colleges, universities and local employers, all working together to deliver high quality technical education in subjects as diverse as advanced manufacturing, cyber security, agri-tech and many more."
        },
        {
            "text": "By having local employers at their heart, IoTs focus on giving people the technical skills that businesses need, which helps them to prosper and leads to more and better local jobs"
        },
        {
            "heading": 3,
            "text": "How are they different to other schools or colleges?"
        },
        {
            "text": "The three main differences between IoTs and other education establishments are:"
        },
        {
            "heading": 3,
            "text": "Why were they needed? "
        },
        {
            "text": "IoTs were created to increase the supply of the higher-level technical skills to boost the economy and maximise productivity now and in the future. They are part of the our reforms to technical education to address skills gaps and show how technical education is a credible route to exciting and secure jobs. To deliver the right skills at the right level, we needed a new type of institution that was large enough to benefit from the expertise already in our education system and flexible enough to specialise to local needs and trends."
        },
        {
            "heading": 3,
            "text": "Who can go to an IoT?"
        },
        {
            "text": "IoTs are open to almost anyone in the area. Their main focus are higher technical courses and higher apprenticeships, although many also offer T Levels, technical degrees and flexible courses for those who are looking to reskill or boost their technical skills."
        },
        {
            "heading": 3,
            "text": "Where are the IoTs? "
        },
        {
            "text": "There are currently 12 Institutes of Technology across the country, with a further 9 to be established in 2022/23. More than 40 Colleges, 18 universities and around 60 leading employers are directly involved in IoTs, with more to follow. Learning is being delivered across over 50 sites at present. This means best practice and ideas can be shared across the network."
        },
        {
            "text": "Currently there are IoTs in Black Country and the Marches, Greater Birmingham and Solihull, Lincolnshire, North East, South Central, South West, Swindon and Wilshire, West of England and Yorkshire and the Humber. There are also 3 in London; East London, West London and London City."
        },
        {
            "heading": 3,
            "text": "How can I find out more?"
        },
        {
            "text": "Visit gov.uk for more information and for links to the current IoTs."
        },
        {
            "text": " "
        },
        {
            "text": " "
        }
    ]
}