{
    "url": "https://geospatialcommission.blog.gov.uk/2021/10/12/why-the-new-space-enabled-and-geospatial-dps-is-good-news/",
    "title": "Why the new Space-Enabled and Geospatial DPS is good news",
    "authors": [
        "Rosie Shelley, Commercial Civil Service Fast Stream"
    ],
    "categories": [
        "Data",
        "Procurement",
        "Technology"
    ],
    "pub_date": "2021-10-12T08:01:29+01:00",
    "content": [
        {
            "text": "Yesterday the Crown Commercial Service (CCS) opened the Space-Enabled and Geospatial Dynamic Purchasing System (DPS) to buyers right across the public sector. The new DPS will make it easier for the public sector to procure access to a broad range of space-enabled and geospatial data and services more rapidly and easily than ever before - and to put it frankly we are really excited about it!"
        },
        {
            "text": "You may be thinking, you're from the Geospatial Commission and the DPS has geospatial in the title so of course you will be excited about it. Equally, you may also rightly think that the government already has a range of technology focused DPS in place, so what makes this one special? Well I think there are three key reasons that you should also be getting excited about this too."
        },
        {
            "text": "Firstly, the Frontier Economics Geospatial Data Market Study published in November 2020, identified a number of points of friction that were hindering the public sector's access to valuable geospatial data and services. These included barriers associated with the FAIRness (Findability, Accessibility, Interoperable and Reusable) of the data that the public sector was trying to access. The new DPS helps to address the F, A, and R challenges:"
        },
        {
            "text": "We are in a period of unprecedented technological change. Innovations in both data capture and the application of data are providing insights that were simply not possible even three years ago, which somewhat conveniently brings us to the second aspect of the DPS that we are really excited about. That is that the DPS is in actual fact a DPS. Allow me to explain. "
        },
        {
            "text": "A DPS functions in a similar way to traditional CCS frameworks in that it offers a range of services that are searchable, allowing buyers to engage with the suppliers that offer the relevant services that they are looking for. It also offers those services on largely preset contract terms making the procurement process more efficient. So far, so standard. It is the D(ynamic) in the DPS that makes this arrangement really sparkle for space and geospatial data and services. The DPS allows suppliers to join at any time, remaining open to new businesses, innovations and emerging technologies. In short, it is a marketplace that can continuously keep up with the evolving technology, offering the potential for the public sector to be able to rapidly access new data and capabilities much sooner than more traditional procurement approaches would do. "
        },
        {
            "text": "The third reason that we are really excited about the launch of this DPS is that it is one of the first to incorporate the Net Zero requirements for bidding suppliers to provide a Carbon Reduction Plan confirming the supplier’s commitment to achieving Net Zero by 2050 in the UK. Given the ever growing importance of space-enabled and geospatial data and services to monitoring and managing climate change, it is somewhat serendipitous that this DPS is leading the way in implementing these requirements.  "
        },
        {
            "text": "By now I am sure you can see why we are excited about today’s announcement. I encourage public sector geospatial users to have a look at what is available on the DPS including in the following data and services categories:"
        },
        {
            "text": "Equally if you are a company who has products or services that would fit within any of the above categories (and odds on if you are from a company and have got this far into this blog then you probably do) get in touch with CCS and sign up to the DPS which will help potential public sector buyers to find you and your services more easily. "
        },
        {
            "heading": 2,
            "text": "My personal reflections of the development of the DPS"
        },
        {
            "text": "Hopefully by now I have sold you on why the DPS is a good thing, and as soon as you get to the end of this blog you will be off to go and explore what it has to offer. However just before you do that I wanted to briefly share my personal reflections on the process that we in the Geospatial Commission and Crown Commercial Services have been through in creating the DPS. "
        },
        {
            "text": "I am on the commercial fast stream, and working in the Geospatial Commission was my first posting. I was new to geospatial and to the Civil Service last September and therefore leading on this work on behalf of the Geospatial Commission and working with domain experts in the Crown Commercial Service and wider public sector was both daunting and exciting."
        },
        {
            "text": "However, I should not have worried, as one of the key aspects of developing the DPS, and my personal highlights has been speaking with the end users and suppliers. We ran a range of engagement sessions between the public sector buyers and the market. These were all held virtually, which we were worried would perhaps limit the level of engagement. However, once we all overcame the usual ‘you’re on mute’ and ‘my camera is broken’ issues, the sessions were extremely successful and the amount of engagement from all attendees was incredible. I learnt so much, and everyone I spoke with was so supportive and excited about the creation of the DPS, they were really happy to share their time and expertise with me."
        },
        {
            "text": "As someone new to the geospatial and space ecosystem when I started this role, I was blown away by both the innovation and passion both within the public sector and supplier market. There are critical and knotty issues across the public sector that space-enabled and geospatial data and services can provide new insight on. Equally there are cool products and services out there in the market that we may not come across without these engagement sessions. "
        },
        {
            "text": "I am confident that through the creation of the DPS we will bring buyers and suppliers together to realise the opportunities that are offered by geospatial data to make a real and positive difference to people’s lives. As I reach the end of my posting with the Geospatial Commission I am really proud to have been a part of this, and I am excited to see what it enables now that it has gone live."
        }
    ]
}