{
    "url": "https://valuationoffice.blog.gov.uk/2024/08/30/how-we-value-petrol-filling-stations/",
    "title": "How we value: petrol filling stations",
    "authors": [
        "Dave Hughes - National Valuation Lead"
    ],
    "categories": [
        "Business Rates",
        "How We Value"
    ],
    "pub_date": "2024-08-30T12:53:53+01:00",
    "content": [
        {
            "text": "The Valuation Office Agency (VOA) is responsible for valuing all business properties in England and Wales, including petrol stations."
        },
        {
            "text": "With over 7,000 stations registered in England and Wales, they play a big role in the daily lives of commuters and communities. Alongside supplying fuel, they are important hubs for a range of services including retail, ATMs, car washes, and even postal services."
        },
        {
            "text": "Our valuation method"
        },
        {
            "text": "We value petrol stations using the rental comparison method. This means that a property's rateable value is calculated based on its rental value. Specifically - the annual rent it could reasonably be expected to generate at a certain date (this is known as the Antecedent Value Date, or AVD)."
        },
        {
            "text": "When valuing a property, the best evidence we look for is rents that have been agreed around the AVD. However, the rent paid on a petrol station may not always reflect its true market value. This is because some contracts include conditions that affect the rental price."
        },
        {
            "text": "For example, some contracts may require the tenant to purchase petrol exclusively from a specific oil company. The oil company benefits from guaranteed fuel sales. In return, they may offer the tenant a rental price that is lower than what the petrol station would be worth on the open market."
        },
        {
            "text": "To account for these factors, we need to look at other evidence that helps us to understand what a property is worth on the open market. The measure we use for petrol stations is Fair Maintainable Trade (FMT)."
        },
        {
            "text": "Fair Maintainable Trade (FMT)"
        },
        {
            "text": "FMT simply means the earning potential of a property – so what an efficient operator could expect to turnover."
        },
        {
            "text": "We use the concept of ‘earning potential’ rather than actual trade, as for some types of property the level of trade could be deceptive. For example, if a pub was run by a celebrity, it would probably generate more trade than if Joe Bloggs ran it. As we value property – not business models – we need to make sure our valuations are based on what a reasonably efficient operator could earn."
        },
        {
            "text": "However, unlike properties such as pubs, the FMT of a petrol station is usually very similar to its actual trade."
        },
        {
            "text": "We consider trade information because it helps us to understand what a reasonable rent would be. This is because prospective tenants will be aware of the trading potential before signing a lease and will factor this into the rent they are willing to pay."
        },
        {
            "text": "Calculating Fair Maintainable Trade (FMT)"
        },
        {
            "text": "We work out FMT by considering income from various revenue streams, including fuel sales, shop sales and car wash services."
        },
        {
            "text": "We consider the specifics of the petrol station, like its design and location, because this will impact its revenue. For example, a modern petrol station on a busy road with a range of facilities will achieve better trade than one that is older and in an area with low traffic."
        },
        {
            "text": "The VOA also works closely with the petrol station industry to stay up to date on trends and practices that could affect a site’s trading potential. For example, we consider the pricing policies of individual petrol stations and request trade information from operators directly."
        },
        {
            "text": "So, petrol stations are valued by calculating the annual rent they could realistically generate on the open market. In simple terms - if a petrol station has a high earning potential and turnover, it is likely to be able to achieve a higher rent and will therefore have a higher rateable value."
        },
        {
            "text": "Agreeing our approach with industry experts"
        },
        {
            "text": "Our approach to valuing petrol stations has been established in collaboration with industry experts, including the Petrol Retailers Association (PRA) and Fuels Industry UK."
        },
        {
            "text": "We have recorded a webinar with the PRA, which goes into more detail about how petrol stations are valued for business rates. You can watch this on our YouTube channel: https://youtu.be/B7YBvPqyP10"
        },
        {
            "text": "We also outline our approach in full in our Rating Manual. We use recognised valuation methods approved by the Royal Institution of Chartered Surveyors (RICS)."
        }
    ]
}