{
    "url": "https://ruralpayments.blog.gov.uk/2024/08/30/inside-the-rpa-maria-hardeman/",
    "title": "Inside the RPA: Marie Hardeman",
    "authors": [
        "RPA Editor"
    ],
    "categories": [
        "Defra",
        "External engagement",
        "Inside the RPA",
        "Rural Payments service"
    ],
    "pub_date": "2024-08-30T12:40:04+01:00",
    "content": [
        {
            "text": "In our series of blogs from the Rural Payments Agency’s Customer Directorate, we are featuring video interviews and blogs from some of the key people whose roles are focussed on delivering and improving the services provided to customers. "
        },
        {
            "text": "In the second video of the series, Customer Director Marie Hardeman talks about her role and the importance of customer service within RPA."
        },
        {
            "text": "Hi, I’m Marie Hardeman and I’ve been RPA’s Customer Director for just over a year. Across the RPA, we want to make sure our customers are at the heart of everything we do - bringing them and their feedback to life across RPA to shape how we deliver our services."
        },
        {
            "text": "There’s no such thing as a typical day in my role! On one day I could be engaging directly with customers, visiting farms or rural events. On another I could be leading colleagues across RPA to deliver improvements to services, and the next I might be working with Defra and RPA leaders to make sure we're delivering value for public money."
        },
        {
            "text": "Part of my role is to engage with customers and farming sector stakeholders, working in partnership to understand how RPA can continuously improve how we support customers to deliver better outcomes for them. We’ve been improving how we listen. Our Customer Insight service focuses on hearing the voice of our customers to collect accurate, useful feedback across as many customer groups as we can. This is through direct engagement with customers contacting us as well as surveys, focus groups and feedback from stakeholders. We’re also improving how we use our data to gather insight. This could be why customers are calling us or how long things take to complete, such as applications for funding, so we can better understand the impact of this and prioritise improvements to make the most difference."
        },
        {
            "text": "Our new Customer Experience service takes that insight to understand the things we're doing well and the root cause of any poor experiences to shape improvements. Our Customer Engagement and Support service leads our engagement activity - things like agricultural shows and events and our support teams."
        },
        {
            "text": "I believe the part of my role that provides the greatest benefit to our customers is understanding what impacts them to make sure we're focussing our efforts on making things easier for the many, not the few. The part of my role I enjoy the most is learning and engaging by getting to know the fantastic work our customers are doing to deliver outcomes that improve the environment, food production and sustainable farming and how we can best support that. Taking that learning and turning it into action - directly making an improvement to how we provide our services is what motivates me the most."
        },
        {
            "text": "I also sponsor several work areas that are aimed solely at making things easier for customers. One is around how customers get the information they need from us, whether that be through self-serve using our digital channels or through direct contact with our people for those more complex queries. We want to make sure the simple things customers need to do can be done easily, quickly and at a time convenient to them. We then want to have knowledgeable people providing support to customers across their whole business for more complex things."
        },
        {
            "text": "Before joining RPA, for 24 years I worked in local government, then social housing, delivering welfare services to customers. This included community funding and welfare benefits, or preventing homelessness, unemployment and supporting people in vulnerable communities to improve their lives. I joined the Civil Service and Rural Payments Agency in April 2023 and I’m really enjoying supporting rural communities."
        },
        {
            "text": "I was born in Stourbridge and lived and worked across the West Midlands and Shropshire, until I moved to London with my now husband. I enjoyed living in an amazing city and then chose to move to Lancashire where I can enjoy wonderful countryside on my doorstep. My husband and I love walking and living close to the Lake District so I’m very lucky to be able to walk the Cumbrian fells most weekends. We also love scuba diving and spend most holidays under the sea. I'm trying to explore as much of the planet as possible. I'm also a proud Auntie to two wonderful nephews who I love to spend time with."
        }
    ]
}