{
    "url": "https://naturalengland.blog.gov.uk/2024/08/30/natural-englands-role-in-licensing-to-control-badgers-to-prevent-the-spread-of-bovine-tuberculosis/",
    "title": "Natural England’s role in licensing to control badgers to prevent the spread of bovine Tuberculosis",
    "authors": [
        "Natural England"
    ],
    "categories": [
        "Farming",
        "Licensing",
        "Natural England",
        "Science and evidence",
        "Wildlife",
        "wildlife and farming"
    ],
    "pub_date": "2024-08-30T12:39:16+01:00",
    "content": [
        {
            "text": "Current government policy is to enable culling or vaccination of badgers to control bovine Tuberculosis (bTB). The Minister of State for Food Security and Rural Affairs has today (30 August) announced a refresh of the strategy for control of bovine TB and signalled his intention to phase out culling of badgers by the end of the current Parliament."
        },
        {
            "text": "Natural England welcomes this work to refresh the strategy and has previously signalled its view that vaccination of badgers and other disease control measures should be accelerated to reduce the need for culls. We look forward to working with government on that refresh in our role as statutory conservation adviser. Badgers are an important (and highly protected) part of England’s wildlife and play a vital role in sustaining functioning ecosystems. We look forward to ensuring disease free badger populations continue to thrive."
        },
        {
            "text": "However, until those new measures are in place Natural England has a duty to continue to determine a number of existing licences to manage badger populations to reduce the risk of bovine TB, in line with current government policy and wildlife law. This article explains Natural England's role and considerations in re-authorising existing licences, including those recently determined."
        },
        {
            "text": "Government policy "
        },
        {
            "text": "Since it was launched under the previous government, the policy has been to enable the licensed culling or vaccination of badgers for the purpose of controlling the spread of bovine Tuberculosis (bTB), as part of the strategy for achieving Officially Bovine Tuberculosis Free (OTF) status for England. Licences are required because badgers are designated by law as a protected species (Protection of Badgers Act 1992). There are three types of culling licence, which are issued by Natural England. Which licence is applicable will depend on the phase of the proposed culling operations and the TB risk area in England concerned:"
        },
        {
            "text": "Natural England’s role "
        },
        {
            "text": "Natural England has two statutory roles in relation to the bTB policy: one is that of granting wildlife licensing authority for England; the other is conservation adviser to government."
        },
        {
            "text": "Protected species such as badgers can be managed through licensed control, such as controlled shooting and dispatch of cage-trapped animals, in certain circumstances, including to prevent the spread of disease, as long as a relevant licence is obtained from Natural England following an evidence-based review. This licensing work is not undertaken lightly, and Natural England staff take the welfare of badgers very seriously."
        },
        {
            "text": "In its licensing role Natural England independently considers licence applications to cull badgers, while taking into account published guidance from the Defra Secretary of State, ensuring that the licensed activity is justified in terms of delivering disease control benefits."
        },
        {
            "text": "Natural England officers carry out monitoring visits during the culls to check that contractors are complying with licence conditions and best practice guides on shooting and cage trapping."
        },
        {
            "text": "Conservation is also a big part of our licensing work on the badger cull. Natural England carries out detailed assessments of possible impacts that licensed activity may have on Protected Sites, imposing conditions on the licences to ensure that no harm is caused."
        },
        {
            "text": "In addition, conservation of badger populations is a consideration of the licence. Licence conditions will ensure local extinctions are avoided and disease-free badger populations can be sustained."
        },
        {
            "text": "Main considerations in deciding to licence"
        },
        {
            "text": "Questions Natural England considers when assessing licence applications"
        },
        {
            "text": "Natural England must consider five key questions when deciding whether to license any activity:"
        },
        {
            "text": "What has Natural England licensed this year"
        }
    ]
}