{
    "url": "https://educationhub.blog.gov.uk/2024/08/30/speaking-children-young-people-about-violent-disorder-southport-attack/",
    "title": "Speaking to children and young people about violent disorder and the Southport attack",
    "authors": [
        "mediaofficer"
    ],
    "categories": [
        "Curriculum",
        "Further education",
        "Higher Education",
        "Schools",
        "Universities"
    ],
    "pub_date": "2024-08-30T17:16:12+01:00",
    "content": [
        {
            "text": "The horrific attack in Southport on 29 July 2024 and the violent disorder in its aftermath, have caused grave concern across the country."
        },
        {
            "text": "Following the attack, rioting coordinated by right-wing extremists was initiated by the spread of misinformation about the perpetrator of the Southport attack, resulting in in violent, racist and Islamophobic attacks on our communities by extremists."
        },
        {
            "text": "We understand that such events are likely to spark conversations in schools, colleges and universities, and will have an impact on pupils and students, including those who may have family and friends who have been affected."
        },
        {
            "text": "Guidance is available to help teachers, education leaders and students navigate some of the issues that might be triggered by the recent outbreaks of violence, and make sure everyone feels safe and protected whether in school, college or university."
        },
        {
            "text": "Here, we explain more about the support available for schools, colleges and universities to talk about such difficult issues with children, young people and adult learners."
        },
        {
            "heading": 3,
            "text": "Talking to pupils about distressing, complex and emotive news stories  "
        },
        {
            "text": "Pupils and students will have a range of viewpoints on things happening around the world, including at home."
        },
        {
            "text": "It’s important that everyone in the classroom feels their voice is heard and that they can express their opinions."
        },
        {
            "text": "Classroom discussions are a great opportunity for learners to take part in respectful debates and can offer a safe space where they feel comfortable expressing their perspective and confident they’re in a position to appropriately challenge others’ views."
        },
        {
            "text": "When engaging with classroom debates, learners should be aware of how they can politely disagree with another opinion."
        },
        {
            "text": "For example, teachers should work to avoid the disagreement becoming personal by encouraging learners to express their disagreement with the view, rather than with the individual."
        },
        {
            "text": "Teachers should be aware of our political impartiality guidance"
        },
        {
            "heading": 3,
            "text": "What resources are available for teachers to help facilitate difficult discussions about sensitive issues at school and college?"
        },
        {
            "text": "All schools must promote community cohesion and have specific duties to promote the spiritual, moral, social and cultural development of their pupils and to prepare them for the opportunities and responsibilities of adult life."
        },
        {
            "text": "But it’s also important for teachers and educators to understand that they are not expected to know all the answers to the questions their students may ask."
        },
        {
            "text": "We’ve published advice for schools and colleges on promoting these values and made resources available through the Educate Against Hate website to help them do so."
        },
        {
            "text": "In particular, the  Let’s Discuss: Fundamental British Values (FBVs) and Let’s Discuss: Extreme Right-Wing resources can support you in facilitating difficult classroom conversations with your learners."
        },
        {
            "text": "Each Let’s Discuss pack can help you teach students about extremism and includes teacher guidance, a short video, and a slide pack that will help you start difficult discussions with young people."
        },
        {
            "text": "Our political impartiality guidance for teachers sets out the importance of making sure that on political or contentious issues, any conversation is carefully balanced."
        },
        {
            "text": "This means challenging some concepts and views that may be believed to be shared principles that underpin our society, and not political issues."
        },
        {
            "text": "For example, a belief in upholding certain rights, such as freedom of speech and protection from violence and criminal activity, or challenging discrimination and prejudice, including racism."
        },
        {
            "heading": 3,
            "text": "What are we doing in schools to tackle children and young people engaging in misinformation spread online? "
        },
        {
            "text": "The violent unrest seen this summer was fuelled by hateful views and misinformation being spread online."
        },
        {
            "text": "It’s more important than ever that we give young people the knowledge and skills to be able to challenge what they see online."
        },
        {
            "text": "That’s why the Curriculum Review which we announced earlier this month will develop plans to help arm our children against the disinformation, fake news and conspiracy theories awash on social media."
        },
        {
            "text": "Educate Against Hate offers an educational programme developed by the Institute of Strategic Dialogue and YouTube which covers topics including:"
        },
        {
            "text": "Educate Against Hate also hosts a one-hour lesson plan from the Economist Educational Foundation that explores why conspiracy theories are more common in times of crisis, why people spread them and how they should be debunked."
        },
        {
            "text": "Alongside resources on the Educate Against Hate website, there are a range of other resources available to schools on these topics, including:"
        },
        {
            "heading": 3,
            "text": "How can university students and staff approach the subject on campus and in lectures?"
        },
        {
            "text": "Universities should be safe places where all students can focus on learning in an inclusive and respectful environment, free of harassment, intimidation or discrimination."
        },
        {
            "text": "In the wake of the recent violent disorder across the country we urge university leaders to focus on fostering cohesion on campus as well as meeting their free speech duties."
        },
        {
            "text": "In this context, actively supporting opportunities for students and staff to discuss these issues in a calm and constructive way will be important."
        },
        {
            "text": "Universities UK has published useful resources for Higher Education Providers on tackling harassment, available here."
        },
        {
            "heading": 3,
            "text": "What safeguarding and security guidance is available?"
        },
        {
            "text": "It’s important parents and guardians feel it’s safe to send their children to school or college, particularly for those from communities who have been most affected by the recent riots."
        },
        {
            "text": "We provide extensive safeguarding and security guidance and training for education and out of school settings, including afterschool clubs, community activities and tuition, as well as higher education settings. These include:"
        },
        {
            "heading": 3,
            "text": "What if children and young people are expressing extreme views?"
        },
        {
            "text": "The education sector plays a vital role in safeguarding students from radicalisation and intervening early to divert them away from extremist influences."
        },
        {
            "text": "If there is a concern about potential radicalisation or a reason to believe that someone is at risk of becoming involved in terrorism or supporting it, a Prevent referral should be made."
        },
        {
            "text": "Find out more about how to safeguard students and learners from radicalisation  here."
        }
    ]
}