{
    "url": "https://marinedevelopments.blog.gov.uk/2024/08/30/strategic-renewables-unit-update/",
    "title": "Strategic Renewables Unit – Update",
    "authors": [
        "David Patrick, Digital Communications Manager"
    ],
    "categories": [
        "marine planning"
    ],
    "pub_date": "2024-08-30T10:43:56+01:00",
    "content": [
        {
            "text": "The Strategic Renewables Unit (SRU) aims to ensure the MMO’s vision of a prosperous future for our seas, coasts and communities is supported through deployment of sustainable offshore wind and other marine renewables. To learn more about the SRU, please contact SRU@marinemanagement.org.uk."
        },
        {
            "text": "Offshore Wind:"
        },
        {
            "text": "One gigawatt (GW) of offshore wind capacity is roughly enough to power 1 million UK homes. The UK currently has 14.73 GW of offshore wind installed in our waters. With deployment accelerating, another 5.13GW is under construction and 17.66GW have been granted consents. To meet our energy security and net zero targets, deployment needs to accelerate even further. The MMOs Strategic Renewable Unit (SRU) are involved in an array of projects to ensure the MMO’s vision of a prosperous future for our seas, coasts and communities is supported through deployment of sustainable offshore wind. Here, we highlight two areas where the SRU are playing an important role in environmental management of offshore wind deployment:"
        },
        {
            "text": "Over 30 GW are expected to be delivered within the east marine plan areas, which is also home to the Southern North Sea Special Area of Conservation (SNS SAC), designated for the noise sensitive harbour porpoise. The SRU collaborates closely with colleagues across government, including Defra, the Offshore Petroleum Regulator for Environment and Decommissioning (OPRED), and the Department for Energy Security and Net Zero (DESNZ), as well as marine energy infrastructure developers, to manage underwater noise levels in the SNS SAC. There efforts include:"
        },
        {
            "text": " "
        },
        {
            "text": "Underwater noise could represent a significant blocker to deployment, making the SRUs management and co-ordination work vital to meeting our offshore wind targets."
        },
        {
            "text": "Post-consenting monitoring is a condition of all offshore wind consents, it requires applicants to monitor their environmental impacts throughout the lifetime of their project. This includes impacts on benthic environments, birds, and marine mammals. The SRU is currently undertaking an evidence project focused on standardising the data collection and reporting of post-consent monitoring."
        },
        {
            "text": "Standardisation offers numerous benefits, it makes the process clearer, more robust, and more reliable, it will also enable effective cumulative and in-combination assessments, and improves the functionality of data repositories. This approach may also contribute to strategic monitoring, where a joint approach to monitoring can deliver programmes of a greater scale and scope, providing a greater understanding of ecological impacts, sensitivity or recovery."
        },
        {
            "text": "The SRU is in the early stages of this project, targeting completion by spring / summer 2025. Their approach involves identifying receptors and current monitoring approaches, liaising with our marine licensing team, interested stakeholders, advisors and agencies to develop a template for post-consent monitoring standards and implement them through licensing conditions."
        }
    ]
}