{
    "url": "https://defrafmp.blog.gov.uk/2024/08/30/welcome-aboard-our-fisheries-management-plans-blog/",
    "title": "Welcome aboard our Fisheries Management Plans blog",
    "authors": [
        "Nicola Lewellen, Programme Engagement and Communications lead",
        "Claire Dyer, Policy Advisor, Defra"
    ],
    "categories": [
        "-Defra FMP programme"
    ],
    "pub_date": "2024-08-30T08:30:45+01:00",
    "content": [
        {
            "text": "We’re back following the General Election to share the latest on Fisheries Management Plans (FMPs).   "
        },
        {
            "text": "We have been busy behind the scenes preparing for the public consultation on four new Defra-led draft FMPs on: "
        },
        {
            "text": " We are also taking forward the implementation of the existing published plans: "
        },
        {
            "text": "With the support of new ministers, we’re excited to move forward with fresh ideas, energy and direction. Our blog is one part of our approach to working collaboratively with you, so with that we are officially relaunching our blog, and we encourage you to guide us on what you want to see about FMPs.  "
        },
        {
            "text": "You can do this by commenting on our posts and you can also tell us what you want to hear about by following the feedback link on About this blog – Fisheries Management Plans  to contact us. "
        },
        {
            "text": "We’re got some exciting new content coming soon, aimed at providing transparency to FMP development and implementation. As things progress you can expect to hear about progress and how decisions are being made. We’ll take you behind the scenes to meet our policy teams, understand the processes and see change in action.  "
        },
        {
            "text": "Our goal is to make everything more open, accessible, inclusive and to keep you informed and at the centre of everything we do. Your voice matters, and your needs and opinions will help to drive actions and decisions as we navigate this new period of change.    "
        },
        {
            "text": "Thanks for joining us on this journey and subscribe to make sure you don’t miss any of our updates!  "
        }
    ]
}