{
    "url": "https://deframedia.blog.gov.uk/2023/09/21/changes-announced-to-better-protect-englands-chalk-streams/",
    "title": "Changes announced to better protect England’s chalk streams",
    "authors": [
        "Defra Press Office"
    ],
    "categories": [
        "water"
    ],
    "pub_date": "2023-09-21T12:25:59+01:00",
    "content": [
        {
            "text": "The Government has brought forward changes to the Levelling Up and Regeneration Bill (LURB) to help better protect England's chalk streams. The proposed amendments would add chalk streams into the definitions of ‘environmental protection’ and ‘natural environment’ in the Bill, meaning that the Government must consider chalk streams when setting the outcomes which will form the framework of environmental assessments in the future."
        },
        {
            "text": "The amendment will enable us to ensure that Environmental Outcome Reports suitably reflect our chalk stream interest when they are developed with the Department for Levelling Up, Housing and Communities. It will ensure that chalk streams are specifically named in the bill, recognising the value of these distinctive habitats."
        },
        {
            "text": "England is home to 85% of all chalk streams and restoring these internationally important habitats is a government priority. We reaffirmed this commitment in our Plan for Water, which recognises chalk streams as having special natural heritage. Furthermore, we are defining chalk streams as priority sites in our Storm Overflows Discharge Reduction Plan with a target of 75% reduction in harmful spills into these rivers by 2035."
        },
        {
            "text": "Today’s amendment feeds into the government’s commitment to better protect England’s waterways through stronger regulation, as set out in our Plan for Water, and builds on the work already done to support chalk streams. This includes supporting the Chalk Streams Restoration Group; beginning a national programme of flagship chalk catchment restorations launched by water companies and driven by local communities; and investment of more than £5 million by the Environment Agency to support 53 chalk stream restoration partnership projects nationwide."
        },
        {
            "text": "Follow Defra on Twitter, and sign up for email alerts here."
        }
    ]
}