{
    "url": "https://nda.blog.gov.uk/learning-from-canada-q-a-with-jamie-matear/",
    "title": "Learning from Canada -  Q & A with Jamie Matear",
    "authors": [
        "kristinadrake"
    ],
    "categories": [
        "Innovation/savings",
        "International activities",
        "Research and development",
        "Skills",
        "Waste management"
    ],
    "pub_date": "2023-09-21T16:18:41+01:00",
    "content": [
        {
            "text": "Q & A with Jamie Matear, Director of Siting Coordination at Canada’s Nuclear Waste Management Organization (NWMO)"
        },
        {
            "text": "Jamie visited Nuclear Waste Services earlier this year as part of a collaboration and learning visit. We sat down with Jamie to find out more about the progress Canada is making with their own GDF programme & what we can learn from each other ..."
        },
        {
            "text": "What is your role at Nuclear Waste Management Organization and what are you responsible for?"
        },
        {
            "text": "My title is Director of Siting Coordination. It's a multiple pronged role that has touch points with engaging community leaders, working with the communities on funding programs, sponsorships and donations, annual engagement and reporting. We have a requirement to manage stakeholder engagement records, and ultimately will be having to provide that to the regulator to show that we've engaged with our communities.  I'm also responsible for preparing what's called our final decision document, which is summarising everything that we've done up to making the decision which is expected in 2024."
        },
        {
            "text": "What made you want to get involved with this programme?"
        },
        {
            "text": "I've got a close family member who works in the nuclear industry, and we talked quite regularly about nuclear. He's a proponent of what nuclear brings to society as a safe and non-carbon generating energy source. I recognised this project would be a great opportunity and project to be involved with, and to do something responsible with Canada’s used nuclear fuel."
        },
        {
            "text": "What stage is NWMO currently at with its GDF plans?"
        },
        {
            "text": "We are getting towards the end of what we call our site selection process. We had 22 communities express an interest in potentially hosting a GDF and we've narrowed down through technical and social research,  to the final two siting areas. We expect to be making a decision on which of the two sites would continue by the end of 2024."
        },
        {
            "text": "What have you done so far and how long has it taken to get to this stage in the process?"
        },
        {
            "text": "We started in 2002, so we're 21 years into our process. It's 170 year process for us, give or take. We formed in 2002 as a result of the Nuclear Fuel Waste Act. Federal legislation that said the nuclear industry had to establish an organisation to create a plan to manage Canada's used nuclear fuel."
        },
        {
            "text": "What were the first stages of the process?"
        },
        {
            "text": "In the early days there was a study period. And through the study period, we asked Canadians what's important, and they told us. Safety first and foremost, and that our generation should deal with the issue. We created a plan which recommended a GDF and took that to the federal government. In 2007, they said they liked our plan and we implemented it.  We developed something called the ‘site selection process’, which is a volunteer process by which Canadian municipalities and Indigenous communities could come forward and express an interest in learning about the process to potentially be a repository host."
        },
        {
            "text": "This process started in 2010, and between 2010 and 2012, not knowing how many communities were going to put up their hands, we had 23 communities express initial interest. From this group, 22 of the communities advanced into preliminary site investigations."
        },
        {
            "text": "What happened in the next stage of the programme after discussions started?\nOver the next decade we conducted technical and social research activities. These included looking at the community’s current and long-term vision and their potential willingness and how neighbouring communities viewed the project. We also reviewed a lot of technical information including geology, the safety case and the ability to build a facility on site. We've now narrowed down to the two final areas."
        },
        {
            "text": "What site evaluations are you conducting at the moment and how long will they take?"
        },
        {
            "text": "On the technical side, confidence in safety reports were published last year. They're quite substantial documents describing the confidence the model has in the potential for building a repository at either site."
        },
        {
            "text": "That information is then communicated back to the communities, to delegations of council and to the public in general. These reports will change over time as we get more information from our technical research programs."
        },
        {
            "text": "We are also working with our communities to understand how they will define a process to establish their willingness to be a host community for the GDF. For example, a community referendum or vote. A lot of effort is required to develop and communicate this process within our remaining communities."
        },
        {
            "text": "How much borehole drilling have you done?"
        },
        {
            "text": "Our initial borehole drilling programs have been completed.  We drilled six boreholes in our northern Ontario site and we drilled two boreholes in the south. For context, we only drilled two in the south because of the homogeneity of the sedimentary rock there. We were able to use results from other boreholes that had been drilled throughout the area to help with the evaluation at the site."
        },
        {
            "text": "What’s next after site selection in your plan?"
        },
        {
            "text": "Once we’ve chosen a site, we're going to move into the regulatory decision-making phase. But, there's a lot of studies that will continue as we must do detailed site characterisation. There will be more boreholes drilled, there'll be more studies done. We're currently doing environmental baseline studies."
        },
        {
            "text": "On our engineering side, we conducted a full scale demonstration of what we call our engineered barrier system. This includes the used fuel container “a UFC” , a steel and copper container for used fuel placed within a bentonite clay box emplaced in the host rock - that's our multi barrier system. It was quite a milestone for us."
        },
        {
            "text": "What is your long-term programme timeline?"
        },
        {
            "text": "After 2024, we move into something called the regulatory decision-making phase. This is when we take our project to the impact assessment Agency of Canada, where they'll do an environmental impact assessment. We then go to the Canadian Nuclear Safety Commission who will provide us with the approval for our licenses to prepare the site and then a license to construct a site. The initial impact assessment process should take five years or so years to complete with licensing to follow."
        },
        {
            "text": "With our permissions we hope to begin construction in the early 2030s. It will take about ten years to construct the facility to such a point where we could actually start to bring in the used fuel from where it's currently located. It then takes about 40 years after that to fill the repository. After the facility is filled, we will move to long-term monitoring and eventually decommission the site. In total, the conception of the project is approximately 170 years in length."
        }
    ]
}