{
    "url": "https://dragonsden.blog.gov.uk/2023/09/21/never-give-up-inclusive-clothing-for-all/",
    "title": "Never give up – inclusive clothing for all",
    "authors": [
        "Kayleigh Enticknap"
    ],
    "categories": [
        "Business",
        "Designs",
        "IP",
        "Trade marks"
    ],
    "pub_date": "2023-09-21T11:18:55+01:00",
    "content": [
        {
            "text": "When we first met entrepreneur Ben Pearson, he was keen to tell us how registering the intellectual property (IP) in his plus-size clothing company, Big Clothing 4 U, helped him protect and grow his business."
        },
        {
            "text": "In 2020, Ben launched his own trade marked brand called ‘Uptheir Clothing’. Self-starter Ben, managed to bag a perfect fit when he appeared on the Dragons’ Den show in Series 20 Episode 2, with Touker Suleyman offering 150k for 35% of his business."
        },
        {
            "text": "A fashion entrepreneur, Ben speaks openly about how he has embraced his autism and difficult past. He entered Dragons’ Den as an entrepreneur, determined to motivate others and show that there are no barriers to success."
        },
        {
            "text": "From the start, Ben's success story was nothing short of remarkable. His tenacity and determination won him admirers, with Steven Bartlett calling his pitch “one of the best he’s seen since being in the Den”."
        },
        {
            "text": "Having watched Ben’s performance, his pitch to the Dragons was compelling and inspirational, telling them:"
        },
        {
            "text": "We caught up with Ben several months after his success in the Den to find out more about his story."
        },
        {
            "heading": 3,
            "text": "Ben, how did your journey begin and what was your inspiration?"
        },
        {
            "text": "Now, having trade marked ‘Uptheir’ as a brand name, more than 90% of Ben’s products are ‘own brand’. This means more favourable margins by not having to pay other brands for use of their brand name."
        },
        {
            "text": "Giving an insight into his personal life, Ben told us he was diagnosed with autism from a young age and spent the majority of his life in social care, young offenders’ institutions and homeless."
        },
        {
            "text": "Speaking of his autism, his advice for others with similar challenges was loud and clear:"
        },
        {
            "heading": 3,
            "text": "What impact has the Dragons’ Den experience had on your business?  "
        },
        {
            "heading": 3,
            "text": "When appearing on Dragons’ Den, Steven praised you for successfully securing Harvey Price as a brand ambassador. Can you tell me how that happened? "
        },
        {
            "heading": 3,
            "text": "What advice would you give to businesses on how to make the most of their intellectual property?"
        }
    ]
}