{
    "url": "https://socialcare.blog.gov.uk/2023/09/21/take-the-adult-social-care-workforce-wellbeing-survey/",
    "title": "Take the adult social care workforce wellbeing survey",
    "authors": [
        "Lyn Romeo",
        "Deborah Sturdy"
    ],
    "categories": [
        "Care and support",
        "Social care reform",
        "Workforce"
    ],
    "pub_date": "2023-09-21T13:55:40+00:00",
    "content": [
        {
            "heading": 2,
            "text": "Shaping support for adult social care workforce of the future"
        },
        {
            "text": "In collaboration with Skills for Care, Ipsos, and The University of Kent, a national survey was recently launched to learn more about how we can improve support for the adult social care workforce."
        },
        {
            "text": "We want to measure your experience at work and understand what support is needed to make sure the adult social care sector is a great place to work, where people can excel and be happy in their careers and provide the highest quality care to the people we support. We’re encouraging everyone working across all care roles and care settings to complete the survey."
        },
        {
            "text": "If you’re responsible for the employment, management, supervision, or commissioning of staff, we’re also encouraging you to share the survey with your colleagues. By contributing, you and your colleagues will be helping policy makers and funders to understand what working in the social care sector is like right now, what's positive about it, the challenges you face, and what support you need to make it better."
        },
        {
            "heading": 2,
            "text": "Why this matters"
        },
        {
            "text": "The insights gained will contribute to our understanding of how working conditions, working hours, pay, learning and development, working relationships and more affect your quality of life and wellbeing. This will help inform decisions around how we support the adult social care sector and how we measure the effectiveness of the support provided."
        },
        {
            "text": "This is an important opportunity which will allow thousands of colleagues to share their experiences and views and for people working at all levels in social care to have their voices heard."
        },
        {
            "heading": 2,
            "text": "Get involved"
        }
    ]
}