{
    "url": "https://hodigital.blog.gov.uk/2023/09/21/the-engineering-profession-at-the-home-office/",
    "title": "The Engineering Profession at the Home Office",
    "authors": [
        "Imran Mirza, Head of Role, Engineering",
        "Naomi Yemitan, Engineering Community Lead"
    ],
    "categories": [
        "Engineering",
        "Recruitment"
    ],
    "pub_date": "2023-09-21T10:22:58+01:00",
    "content": [
        {
            "text": " "
        },
        {
            "text": "Engineering at Home Office Digital, Data and Technology (DDaT) is a recognised DDaT Profession under the DDaT Profession Capability Framework. Our DDaT Profession teams are dedicated to providing clear career paths and continuous learning programmes to our digital, data and technology colleagues.  "
        },
        {
            "text": "The Engineering Profession consists of over 2,000 engineers (civil servants and supplier partners) within 4 main job roles:"
        },
        {
            "text": "Our engineers are responsible for building and maintaining Home Office applications and platforms, ensuring they remain accessible to users."
        },
        {
            "text": "We manage over 600 services spanning Borders, Immigration, Citizenship and Policing. Every year our systems support over 3 million visa applications, checks on 100 million border crossings, 5 million passport applications and 140 million police checks on people, vehicles, and property."
        },
        {
            "heading": 2,
            "text": "The benefits of belonging to the Engineering Profession at the Home Office"
        },
        {
            "text": "The Engineering Profession team supports our engineers by offering ‘communities of practice’."
        },
        {
            "text": "As part of our communities of practice offering we hold monthly community meet-ups, where our engineers hear from speakers on a range of topics such as artificial intelligence, FinOps and IT sustainability. These talks provide insight for our teams, challenge ways of thinking and provide an opportunity to share knowledge and experience."
        },
        {
            "text": "Our Profession team also focus on ensuring clear career pathways for our engineers. We have a skills and competency model based on the Skills Framework for the Information Age (SFIA), mapped to all role levels in Infrastructure, Network, DevOps and Software Engineering. It helps colleagues easily map which skills they need to develop for promotion or sideways career moves. The framework includes a distinction between managerial and technical pathways."
        },
        {
            "text": "Our Engineering Profession team champion continuous professional development (CPD). We’ve launched an engineering training catalogue with an extensive list of courses aimed specifically for our engineers’ continuous learning. This includes training in both technical and soft skills."
        },
        {
            "text": "The courses include Cloud, Application Security, Frameworks, Source Code Management and presentation skills. We encourage our engineers to undertake Amazon Web Services (AWS) and Azure training and certification."
        },
        {
            "text": "We recently enjoyed collaborating with AWS to deliver AWS GameDay. Our engineers joined hands-on labs, diving into services such as Elastic Compute Cloud (EC2), virtual machines, Virtual Private Cloud (VPC) networking and storage on AWS. These events help educate our teams about AWS products and services, developing the skills needed to build, deploy, and operate our infrastructure and applications in the cloud."
        },
        {
            "text": "So that we can continue to grow our in-house engineering capability, we encourage our engineers to support our recruitment efforts. By getting involved in interviewing, tech testing and recruitment events our engineers improve their own career prospects by better understanding how to apply for promotion and excel at interviews."
        },
        {
            "text": "The Engineering Profession create learning opportunities across the Home Office. National Coding Week has been running since 2014 and encourages people of all ages and abilities to give coding a try. During National Coding Week we introduce colleagues to coding by offering them hands-on taster sessions and interactive events."
        },
        {
            "heading": 2,
            "text": "'Valuable experiences, fostering my growth as a software engineer': Meet Katie Beckett"
        },
        {
            "text": "Hi, I’m Katie, a Software Developer in Shared Applications Services."
        },
        {
            "text": "I help develop and maintain various features of the Modern Slavery Statement Registry (MSSR). The MSSR is an online platform for organisations to voluntarily publish their modern slavery statements."
        },
        {
            "text": "Working with the Modern Slavery Team has been rewarding and exciting. Although the transition from a Junior Software Developer to this position was initially challenging, it afforded me the opportunity to contribute to an important cause, while being a valued member of a supportive team."
        },
        {
            "heading": 3,
            "text": "What does a Software Developer at the Home Office do?"
        },
        {
            "text": "I work on a wide range of projects in Home Office DDaT, such as:"
        },
        {
            "text": "One of my favourite projects so far has been the ‘Dashboard Project’."
        },
        {
            "text": "I helped develop a custom dashboard to provide visibility into the health of the MSSR and its services. I gained competence in using previously unfamiliar tools and technologies, such as Terraform and Azure Functions. I also developed an understanding of system monitoring and observability practices and have shared these experiences with the engineering Observability guild."
        },
        {
            "text": "We’re guided by the Software Engineering Profession Guidance and Standards (SEGAS), which is a community (or set of 'guilds') that strive to provide a baseline of cohesive standards for software development at the Home Office. As the guilds are community-based everyone gets to be a part of the discussions around these standards. Being a member of the guilds will give you opportunities to develop your confidence by presenting your work to peers and gaining feedback from the community on how to move forward with, or improve, projects."
        },
        {
            "heading": 2,
            "text": "'A day in the life of a Lead Network Engineer at the Home Office': Meet Imu Karim"
        },
        {
            "text": "Hello, I’m Imu. I lead the Programme Delivery team in Networks and Infrastructure."
        },
        {
            "text": "I provide leadership to senior network engineers and architects who work on the network demands and changes needed by our national police to keep our citizens and country safe."
        },
        {
            "text": "I work across multiple projects and programmes that require technical support to deliver project milestones in accordance with the DDaT strategic roadmap."
        },
        {
            "text": "I guide engineers through the full life-cycle of a project, starting from discovery and design through to implementation, testing and documentation."
        },
        {
            "text": "My role includes prompt response to high-impact incidents. If these occur, I lead on incident resolution management. I minimise disruption and investigate service outage and recurrence."
        },
        {
            "heading": 3,
            "text": "Making a positive impact as an engineer at the Home Office"
        },
        {
            "text": "In the policing network, not a single day is the same. Our police forces need round-the-clock access to our systems and services without disruption."
        },
        {
            "text": "Managing the policing network is exciting. I can make a positive impact and give back to the community. This is a great place for personal development, work - life balance and career progression."
        }
    ]
}