{
    "url": "https://environmentagency.blog.gov.uk/2023/09/21/working-to-improve-yorkshires-globally-rare-habitats/",
    "title": "Working to improve Yorkshire’s globally rare habitats",
    "authors": [
        "Environment Agency"
    ],
    "categories": [
        "Environment Agency"
    ],
    "pub_date": "2023-09-21T11:28:35+00:00",
    "content": [
        {
            "text": "By Amanda Foster, Environment Agency Catchment Co-Ordinator. "
        },
        {
            "text": "Chalk is a defining feature of the landscape here in Yorkshire. We boast the most northerly chalk streams in Britain and some of the most northerly in the whole of Europe."
        },
        {
            "text": "Our chalk aquifers underlie a huge area of East Yorkshire, and the clear springs and chalk river systems they support are globally rare, internationally significant habitats which enable a rich biodiversity to flourish."
        },
        {
            "text": "So it’s vital we do all we can to enhance and protect them for future generations."
        },
        {
            "text": "In the lead up to World Rivers Day on 24 September – which highlights the value of our rivers and what is being done to improve them – I’m reflecting on the work that has taken place in Yorkshire, and our plans for the future."
        },
        {
            "text": "As catchment co-ordinator for the Environment Agency in East Yorkshire, my role involves working with partners to develop projects to improve our rivers, as well as organising some of the funding. I also support catchment partnerships, which are Defra funded partnerships of organisations that come together to improve the water environment."
        },
        {
            "text": "A big part of my job is looking at how we can work with others to improve chalk streams."
        },
        {
            "text": "In June, the Implementation Plan for the recommendations in the Chalk Streams Restoration Strategy was formally launched. You can read more about the official launch here:"
        },
        {
            "text": "Launch of the Chalk Stream Strategy’s Implementation Plan by Charles Rangeley-Wilson, Chair of the Chalk Stream Restoration Group - Creating a better place (blog.gov.uk)"
        },
        {
            "text": "Collaboration is at the heart of the strategy. By working together with partners across the region the Environment Agency is supporting the delivery of a range of projects to enhance and protect Yorkshire’s chalk streams."
        },
        {
            "text": "One of these is a £110,000 project on the Gypsey Race, which is the UK’s most northerly chalk stream and winds its way from Duggleby to Bridlington. New ponds have been created that collect the run off of water from the land, reducing pollution by preventing silt and nutrients going into the water."
        },
        {
            "text": "The project also improved the in-channel and riverbank habitat along a 600m length of Gypsey Race, creating meanders and installing woody debris to create a change in flow patterns, which alters the bed morphology and moves silt and uncovers gravels."
        },
        {
            "text": "This is just one of many projects I’ve been involved in. Over on the River Hull Headwaters, which is also a Site of Special Scientific Interest (SSSI), a further £130,000 of partnership funding has created and restored habitat on one of its chalk streams."
        },
        {
            "text": "The stream had suffered from being straightened and modified in the past, but several of the old meanders still remained in the fields. We facilitated the restoration and reconnection of two of the meanders to the original watercourse, creating a section of re-naturalised chalk stream."
        },
        {
            "text": "Earlier this year, working with East Yorkshire Rivers Trust, we enabled the restoration of a livestock trampled section of a spring-fed tributary of Foston Beck, known as Rattling Water, also part of the River Hull Headwaters."
        },
        {
            "text": "This £15,000 project saw the stream fenced off, preventing livestock from going into the water and allowing the natural habitat to thrive. Dense shrubs and brambles that were blocking natural light were also removed."
        },
        {
            "text": "It also included woody debris installations in the river that help vary the flow of water, creating a more natural watercourse which will benefit fish and invertebrates, and in turn improve water quality."
        },
        {
            "text": "In the future, the partnership ‘Chalkshire’ project will bring more restoration projects to fruition. Restoration feasibility projects on four of Yorkshire’s chalk streams were carried out and importantly, it’s bringing together the community, landowners and businesses to foster a greater understanding and commitment to work together to protect and enhance the chalk landscape and streams for future generations."
        },
        {
            "text": "Yorkshire also has a flagship project, the Hull Headwaters, part of the Chalk Stream Restoration Strategy and one of 12 projects in the country which will act as exemplars to assist in the restoration of other chalk streams."
        },
        {
            "text": "Facilitated by Yorkshire Water in collaboration with Yorkshire Wildlife Trust, Natural England and ourselves we are currently at the stage of engaging with communities and stakeholders to produce a strategy that will identify, prioritise and implement river restoration activities to mitigate against chalk stream pressures, enhance the chalk streams and increase the long-term ecological resilience of the catchment."
        },
        {
            "text": "Yorkshire’s precious chalk habitats are vital for the landscape, wildlife and people, and we’re committed to working in collaboration with partners, landowners and the community and protect and enhance them into the future."
        },
        {
            "text": "Follow the Environment Agency Yorkshire and North East on X."
        }
    ]
}