{
    "url": "https://educationhub.blog.gov.uk/2021/07/do-you-have-a-nature-hero-how-children-and-young-people-can-plantforourplanet/",
    "title": "Do you have a nature hero? How children and young people can #PlantForOurPlanet",
    "authors": [
        "mediaofficer"
    ],
    "categories": [
        "Holidays"
    ],
    "pub_date": "2021-07-16T15:39:43+01:00",
    "content": [
        {
            "text": "Playing in the local park, helping water the garden plants or picking home-grown strawberries – green spaces and gardens have brought sheer joy to children’s and families lives during some of the most difficult months our country has ever known."
        },
        {
            "text": "With a generation full of budding environmental activists, there is no doubt we have ‘Nature Heroes’ who are going the extra mile to protect and preserve nature. But how as parents can you nurture this?"
        },
        {
            "text": "Here’s how you can support your own ‘Nature Hero’ with Defra’s new Plant for our Planet campaign."
        },
        {
            "heading": 3,
            "text": "What is Plant for our Planet?"
        },
        {
            "text": "Defra’s new campaign – Plant for our Planet – is aimed at inspiring the public to get planting, helping us to build back greener from the pandemic as well as stepping up our efforts to tackle climate change and biodiversity loss."
        },
        {
            "text": "The campaign asks individuals, businesses and communities to play their part in helping reduce carbon dioxide in the atmosphere and support nature to bounce back – like planting a plant, a simple action which helps contribute to protecting the natural world."
        },
        {
            "heading": 3,
            "text": "Why is this important for children and young people?"
        },
        {
            "text": "What comes across time and again is that when we help nature thrive and recover, we are helping our climate and our communities as well – a lesson which is vital for our children and young people to learn."
        },
        {
            "text": "Ahead of our leadership of the all-important climate change COP26 summit, we want parents to encourage their children and young people to take a small action of their own."
        },
        {
            "heading": 3,
            "text": "How do I get my ‘Nature Hero’ involved?"
        },
        {
            "text": "Whether it is planting a window box, flexing green fingers out in the garden to pop in a plant or sprucing up a community space, the public are encouraged to #PlantForOurPlanet and share their actions on digital channels and social media."
        },
        {
            "text": "Fun activities for families include planting flowers for pollinators to planting a tree in a garden, or wider nature activities such as building insect hotels, growing some vegetables or simply letting your grass grow to encourage plants like daisies and white clover to flower."
        },
        {
            "text": "There are also a variety of existing nature projects you can join. These include:"
        },
        {
            "heading": 3,
            "text": "How do I nominate a ‘Nature Hero’?"
        },
        {
            "text": "Do you know someone, young or old, who’s going the extra mile to protect and preserve nature? There might even be on in your school? To nominate a “Nature Hero”, please contact plantforourplanet@defra.gov.uk."
        },
        {
            "text": "To get involved and planet for our planet you can download the Plant for our Planet partner pack here."
        },
        {
            "text": "Read more about the Plant for the Planet campaign: Public urged to Plant For Our Planet in a new campaign launched today - GOV.UK (www.gov.uk)"
        }
    ]
}