{
    "url": "https://cspl.blog.gov.uk/2021/07/16/follow-the-money-time-to-repair-election-finance-regulation/",
    "title": "Follow the money – time to repair election finance regulation",
    "authors": [
        "Lord Jonathan Evans"
    ],
    "categories": [
        "Elections"
    ],
    "pub_date": "2021-07-16T09:58:51+01:00",
    "content": [
        {
            "text": "Following the money spent at elections is no easy task. Cumbersome and fragmented electoral law, new digital campaign methods, different regimes for candidates and parties, a system run largely by volunteers in the heat of the hustings makes for a particularly complex picture."
        },
        {
            "text": "We need an effective system with robust rules that are simple to understand and enforced proportionately."
        },
        {
            "text": "Our electoral system should support democracy, making sure that parties and candidates — particularly those who might not have the backing of an experienced and well-resourced compliance team — can comply with the rules."
        },
        {
            "text": "It’s important that the complexity of the system doesn’t deter people from standing for election. Equally, non-compliance needs to be dealt with firmly and swiftly."
        },
        {
            "text": "Our role as an independent committee is — as John Major once described — to act as a body to do “running repairs” to maintain ethical standards. We believe that election finance regulation is badly in need of some attention."
        },
        {
            "text": "Our new report today suggests practical steps to modernise and streamline the way donations and spending are reported, regulated and enforced."
        },
        {
            "text": "Our recommendations include tightening the requirement to identify the true source of donations to reduce the potential for foreign money to influence UK elections, and increasing information about how money is spent at elections and referendums on digital campaigning."
        },
        {
            "text": "Improving the regulation of money spent by third parties at elections and rebalancing the criminal and civil sanctions available for breaches of the law, leaving criminal sanctions for the most serious breaches, such as deliberate attempts to circumvent the system."
        },
        {
            "text": "Decriminalising offences relating to administrative requirements and increasing the effectiveness of the civil regime through time limits for Electoral Commission investigations, proportionate fines and improvements to guidance and advice."
        },
        {
            "text": "And finally, extending civil sanctions to include candidate finance laws, ending the current “cliff edge” where candidates face either criminal prosecution or nothing, and greater transparency about how parties, campaigners and candidates spend money through a single, centralised database."
        },
        {
            "text": "The public deserves to know how money is being spent to influence their vote — and where that money comes from."
        },
        {
            "text": "The government and the Electoral Commission could prioritise many of these changes now, well in advance of any election. The passage of the Elections Bill offers a ready opportunity to make these proportionate changes."
        },
        {
            "text": "Our recommendations deliver significant improvements to give a more transparent, proportionate and effective system for candidates, campaigners, parties and the public alike. It’s time to repair the system."
        },
        {
            "text": " "
        },
        {
            "text": "This blog first appeared in The Times on 7 July 2021."
        }
    ]
}