{
    "url": "https://companieshouse.blog.gov.uk/2021/07/16/in-conversation-with-hmrc/",
    "title": "In conversation with: HMRC",
    "authors": [
        "Alison Rees - Senior Policy Adviser",
        "Mark Chandler - Advisory Accountant at HMRC"
    ],
    "categories": [
        "Companies House transformation",
        "Digital transformation"
    ],
    "pub_date": "2021-07-16T11:37:44+01:00",
    "content": [
        {
            "text": "Delivering value for money is high on the agenda for all government organisations."
        },
        {
            "text": "In this blog post, Alison Rees from Companies House and Mark Chandler from HM Revenue & Customs (HMRC) discuss how both organisations have collaborated to achieve efficiencies."
        },
        {
            "text": "Mark: I’m an accountant at HMRC and the sort of things I work on include supporting my tax specialist colleagues including  on budget and tax legislation queries and external consultations. My work with Companies House stems from the senior leaders of our organisation meeting to discuss ways to improve efficiencies through collaborative working, both internally and with other parts of government."
        },
        {
            "text": "In these instances, I project manage the team assembled at HMRC. We then work together to generate ideas, suggestions and deliver them. We’ve worked with lots of organisations and Companies House is one that we have a strong relationship with."
        },
        {
            "text": "Alison: I'm a senior policy adviser at Companies House and I primarily work on accounts. I've been very much involved in the workstream Mark mentions and essentially it looks at how we can align and simplify our processes to help users and make cost savings for ourselves and the public."
        },
        {
            "heading": 2,
            "text": "How have Companies House and HMRC worked together in the past?"
        },
        {
            "text": "Mark: We’ve worked on lots of projects together. HMRC and Companies House have got the common area of financial statements and accounts, but with our remit surrounding taxation, we rely on business accounts and the Companies House register to assist our work."
        },
        {
            "text": "I think one of the biggest things we’ve collaborated on is the consultation document for Corporate Transparency and Register Reform, a huge project for the Department for Business, Energy & Industrial Strategy (BEIS) which will increase data transparency and help to tackle economic crime and fraud. Register reform will not just impact HMRC and Companies House; it will have a positive impact on the wider UK economy."
        },
        {
            "text": "Alison: We’re also collaborating with HMRC and The Charity Commission on the potential for a ‘file once with government’ approach. It’s a long-term ambition. It’s a simple and sensible concept included in the register reform consultation which proposes that company accounts should be filed in one place at one time, and then that information can be reused across government. This links to the UK government’s strategic direction around data sharing and how to make the most of it."
        },
        {
            "text": "Getting the right data in the right place at the right time is a huge driver for efficiencies across government."
        },
        {
            "text": "At the moment we don’t have something like that for all companies– and there are lots of reasons why – but we’re working hard to break through those barriers to deliver huge cost savings and to also improve things from a user experience and anti-fraud perspective."
        },
        {
            "text": "We have also worked collaboratively on a data pilot."
        },
        {
            "text": "During the pilot, we compared data filed with Companies House against data filed with HMRC and identified almost £15 million of fraud and error. We identified this because of our collaborative working and our shared goal to drive more efficiencies. It’s a brilliant example of how our joint work has helped to make huge public savings."
        },
        {
            "text": "Mark: It’s amazing and that work has also been absorbed into our 'business as usual' activity, so it’s not a one-off gain."
        },
        {
            "text": "“I also think it’s worth mentioning that there's a large digital focus right across government. At HMRC, we already receive XBRL tagged documents and we recently consulted on Making Tax Digital for Corporation Tax.  Collaborative discussions with Companies House about your digital journey, help ensure that inefficiencies aren’t created. For example, we need to make sure that our timelines, taxonomies and IT proposals align.  There’s a lot of integration needed and it’s amazing how you don’t realise how much you need until you start having conversations with each other and get the right contacts involved. "
        },
        {
            "text": "The current strategic direction is around data strategy and making the most of data. HMRC holds a lot of data and so does Companies House, both public and back-office data. The data on the Companies House register alone is worth billions to the UK economy, so there’s a lot of valuable information there that we can use. We’re trying to do this by establishing data gateways where we can exchange information and if we can share data more freely it will minimise the potential for fraud."
        },
        {
            "text": "Alison: It’s also important because we want our services to give a great user experience and allow companies to file online successfully the first time. The digital agenda is mirrored between us and HMRC because the world is going in a digital direction and that’s where a lot of these efficiencies can be realised."
        },
        {
            "heading": 2,
            "text": "Why is delivering value through efficient use of resources so important?"
        },
        {
            "text": "Mark: Certainly for HMRC it’s at the heart of what we do. We’re a revenue generator for the government and that income is translated into schools, hospitals, public services, roads and so on. One of the reasons I joined HMRC was because of the public benefit mindset and it's something that's important to me, not only as an HMRC employee but also as a member of the public."
        },
        {
            "text": "Alison: And it’s the same for Companies House. Delivering value for money has always been extremely important to us and as public sector department, it's a fundamental consideration in any decision-making process when using public funds. It doesn’t matter where you are in government, we’re all accountable for how we spend public money. We’ve got a joint aim to administer our systems in the most efficient way, which provides savings for our users and for the public purse."
        },
        {
            "heading": 2,
            "text": "What have been the main challenges you’ve faced while trying to deliver value?"
        },
        {
            "text": "Mark: We’ve already touched upon data sharing as one of the biggest challenges. HMRC and Companies House are both trusted holders of information, so protecting customer confidentiality is hugely important. We need to ensure that we continue to prioritise and protect this when we share data."
        },
        {
            "text": "Alison: I think there's a lot of potential for Companies House and HMRC to work even closer in the future. We both play key roles in helping to achieve the wider government's economic aims and the objective to combat economic crime. But I think there's even more we can do to protect citizens and to make sure that our information supports better business decisions and helps the economy."
        }
    ]
}