{
    "url": "https://space.blog.gov.uk/2021/07/16/looking-earthward-for-inspiration-to-clean-up-space/",
    "title": "Looking Earthward for inspiration to clean up space",
    "authors": [
        "Harriet Brettle"
    ],
    "categories": [
        "Space surveillance and tracking"
    ],
    "pub_date": "2021-07-16T10:19:45+01:00",
    "content": [
        {
            "text": "As space becomes busier and critical orbits become increasingly crowded, there is a pressing need to ensure the safe and sustainable use of the outer space environment."
        },
        {
            "text": "At the recent G7 summit in Cornwall, G7 nations published a joint statement committing to the safe and sustainable use of space in recognition of the growing hazard of space debris and increasing congestion in Earth’s orbit. This proliferation of space debris leads to higher risks and increased costs for satellite operators individually, as well to the environment holistically."
        },
        {
            "text": "Addressing the requirement to return environments back to their natural state is not without precedent on Earth. Industries on Earth already consider how to deal with assets that pose a danger to the environment once they have reached the end of their operational life. The process, known collectively as decommissioning, is undertaken across the oil and gas, nuclear and offshore wind industries."
        },
        {
            "text": "Putting this in a space context, we consider decommissioning to include removing satellites from operational service and returning the environment of Earth's protected orbits to its natural state, through either re-entry into the Earth’s atmosphere or moving satellites to a graveyard orbit."
        },
        {
            "text": "Decommissioning can be undertaken either using a satellite’s own propulsion capabilities, outsourcing to third party debris removal services, or through passive decay for satellites operating at very low altitudes."
        },
        {
            "text": "The complexity, and therefore cost, of satellite decommissioning may vary dramatically depending on the asset’s health and capabilities at the time of decommissioning. In practice, satellites are not always decommissioned and can remain in critical orbits for many decades. The case for decommissioning is clear. It can:"
        },
        {
            "text": "With the growing awareness of the need for effective decommissioning practices to ensure a sustainable future in space, there is an opportunity to learn from other industries much more evolved in their thinking. In space, as in other industries, assets historically have not been designed with decommissioning in mind, rendering decommissioning more complex and costly."
        },
        {
            "text": "Challenges in understanding asset conditions in extreme environments (whether in a high-radiation nuclear environment or isolated in space) mean that operators are faced with conflicting incentives on the appropriate time to decommission assets."
        },
        {
            "text": "Decommissioning funding schedules are complex since assets are often no longer revenue-generating at the time decommissioning is required."
        },
        {
            "text": "Across all sectors, decommissioning requires significant innovation and novel engineering approaches. To address this, decommissioning on Earth is often outsourced to specialised third-party providers. Decommissioning across extreme environments presents similar challenges and a compelling opportunity for cross-sectoral learning between space-faring nations, industry, and academia."
        },
        {
            "text": "Whilst decommissioning in space is an emerging market; the challenges faced by the satellite industry are not new or unique."
        },
        {
            "text": "Decommissioning is an industry in itself, and that presents opportunities for innovation and growth. The satellite industry can learn from other sectors and integrate decommissioning practices into the satellite life cycle to ensure a more sustainable future both on Earth and in outer space."
        },
        {
            "text": "Read the detailed analysis in this report: ‘Decommissioning in Extreme Environments, Insights for the Satellite Industry’."
        },
        {
            "text": "Written by Harriet Brettle, Head of Business Analysis, Astroscale UK"
        }
    ]
}