{
    "url": "https://educationhub.blog.gov.uk/2021/07/16/what-catch-up-activities-are-available-for-children-over-the-summer-holidays/",
    "title": "What catch-up activities are available for children over the summer holidays",
    "authors": [
        "mediaofficer"
    ],
    "categories": [
        "Coronavirus",
        "Holidays",
        "Schools"
    ],
    "pub_date": "2021-07-16T15:25:46+01:00",
    "content": [
        {
            "text": "We know it’s been a hard year for everyone. This summer we want children and young people to take part in fun activities to get moving and learning, to help them get off to a flying start for the next stage of their education in the autumn."
        },
        {
            "text": "That’s why we’ve launched a new information site, designed especially for parents, to support children of all age ranges and abilities to catch-up on lost learning and make the most of the summer."
        },
        {
            "heading": 3,
            "text": "So what is it and what’s available?"
        },
        {
            "text": "In short – the website is there for you and your children. It offers a wealth of information on catch-up programmes and fun activities across England for children and young people aged 0-19 to take part in this summer as well as advice and support for parents."
        },
        {
            "text": "Find out more about what is on offer to help your child’s academic catch-up and physical, social and mental wellbeing here: https://educationcatchup.campaign.gov.uk/."
        },
        {
            "heading": 3,
            "text": "Summer activities"
        },
        {
            "text": "Alongside the ideas and activities on the new parent website there are a number of other schemes running over the holidays."
        },
        {
            "text": "Explore activities available to children including the Holiday Activities and Food Programme (HAF) which offers free places to those on benefits-related free school meals to learn new things, have fun and socialise with friends."
        },
        {
            "text": "Your child’s secondary school may also be running a one-or two-week Summer School with a mix of catch-up lessons and fun activities."
        },
        {
            "text": "This summer we're also encouraging families to explore themed activities in their local area and nationally with the Rediscover Summer campaign, from sport and creativity to nature and heritage."
        },
        {
            "heading": 3,
            "text": "Term time and extra learning support"
        },
        {
            "text": "If you’re looking for academic catch-up support for your child the website includes:"
        },
        {
            "text": "For those aged 4-16, there are lots of free online lessons and resources for maths and science as well as information on tutoring for primary and secondary pupils. For parents of SEND children the site offers information on tutoring for 5-16 year-olds and post-16 and; wider support and advice for families with disabled children and young people."
        },
        {
            "text": "Those aged 16-19, if eligible, can access tutoring support, free courses with The Skills Toolkit, A level physics resources and advanced maths help for those post-16."
        },
        {
            "text": "Parents and carers with children in early years can access speech and language support for those in reception and support on childcare costs through Childcare Choices."
        },
        {
            "text": "There is also a wealth of mental health support available for your child and family. For a full list of resources read our mental health blog."
        },
        {
            "text": "Information on all of these activities and programmes is available here: Education catch-up – Find out more about what is on offer to help your academic catch-up and physical, social and mental wellbeing (campaign.gov.uk)."
        }
    ]
}