{
    "url": "https://prisonjobs.blog.gov.uk/2024/10/14/becoming-a-community-payback-supervisor-is-a-great-career-choice/",
    "title": "\"Becoming a Community Payback supervisor is a great career choice.”",
    "authors": [
        "Ali Searle"
    ],
    "categories": [
        "Community Payback",
        "Personal stories",
        "Probation",
        "Ways of working"
    ],
    "pub_date": "2024-10-14T13:44:15+01:00",
    "content": [
        {
            "text": "Since joining the Probation Service as a community payback (CP) supervisor 25 years ago, Ali Searle has never looked back. She tells us what she’s learnt along the way, why she’s still so passionate about working in CP now, and about the career opportunities it’s given her."
        },
        {
            "text": "If you're looking for meaningful work where you can make a real difference, find out more about working in CP and take a look at our latest vacancies."
        },
        {
            "text": " “I was a working Mum with two small children when I started out as a community service supervisor, as the role was known at the time. It was the perfect job for me: I got to work in the field I was interested in, and as I worked Fridays to Mondays, my hours fitted around my childcare arrangements. I enjoyed working with people on probation and seeing them learn new skills and make progress towards turning their lives around. I was also very proud of the unpaid work my groups did in the community and the appreciation the public showed."
        },
        {
            "text": "At the time, it wasn’t practical for me to commit to doing the qualification that was needed to be a probation officer. So, this job was a great route into the Probation Service and gaining experience of working with offenders. My initial training gave me a really good grounding in a range of subjects to help me work effectively and safely with them. Among other things, I learnt ways of dealing with people who were exhibiting challenging behaviour, and how to role model positive behaviours.”"
        },
        {
            "text": "The importance of mutual respect and clear boundaries"
        },
        {
            "text": "“While leadership skills are an essential part of the CP supervisor role, mutual respect between you and the people on probation is key. Simple things like asking rather than telling people what to do is so important and helps to increase their motivation. In turn, people work more effectively as part of a team – a vital part of completing their unpaid work tasks while on CP."
        },
        {
            "text": "I learnt that people respect having clear boundaries and rules to work within, and that being confident in your instructions and using a firm voice when needed are important skills to have as a CP supervisor. You also need to be resilient and an active listener, alert to what’s going on around you at all times and respond quickly and appropriately. A good sense of humour when things don’t go quite to plan doesn’t go amiss either.”"
        },
        {
            "text": "Moving on to other CP roles "
        },
        {
            "text": "“When my children were older I became a community service officer, a role that’s similar to the current probation practitioner role. This involved managing a team of CP supervisors, allocating people on probation to their CP work placements, and ensuring people on my caseload turned up to do their unpaid work and completed their allocated hours. Having done the CP supervisor role myself, I knew what was expected of my team and what support they needed from me."
        },
        {
            "text": "Sometime later, I took a promotion to become a CP quality assurance manager. This gave me a great opportunity to review and assure the quality of the delivery of our CP service across the region I worked in, plus to make improvements where needed. I also worked with other trainers to deliver CP training across the Probation Service. Currently, I'm National Senior Policy Lead, influencing the delivery of Community Payback services nationwide and I recently achieved Ministry of Justice awards team finalist in May 2024."
        },
        {
            "text": "Valuable career development experience "
        },
        {
            "text": "“The skills I learnt in my CP roles gave me the experience and confidence to do other jobs within the Probation Service and wider criminal justice system. I managed the region’s Courts and Assessment team for a while. And, after that, I worked in the Ministry of Justice as the assistant private secretary to the prison and probation minister – an amazing and exciting role that I got because of my experience of working directly with people on probation while in my CP roles."
        },
        {
            "text": "Throughout my career, I’ve retained my passion for CP. For me, it ‘does what it says on the tin’: giving people an opportunity to pay back to their communities for the crimes they’ve committed and to change their lives for the better by giving them the tools to see a life without crime. So, I’m delighted my career has come full circle and I’m back working in CP again – this time as the national senior policy lead, helping to shape the delivery of CP services and ensuring staff joining us have robust training to help them get the most out of their roles.” "
        },
        {
            "text": "A great career choice "
        },
        {
            "text": "“If you’d like to work with people at a challenging time in their lives, becoming a CP supervisor is incredibly fulfilling and a great career choice. It’s meaningful work that can be life changing for people on probation and the communities they improve while doing their CP. And, if you’re interested, it can open up a wide range of opportunities to work in other CP roles or to move into other areas of work in the Probation Service or more widely across His Majesty’s Prison and Probation Service (HMPPS).” "
        },
        {
            "text": "Find out more"
        },
        {
            "text": "If you’ve been inspired by Ali’s story, visit our website to find out more about working in Community Payback and apply today."
        }
    ]
}