{
    "url": "https://environmentagency.blog.gov.uk/2024/10/14/spotlight-on-the-field-teams-working-in-hampshire-and-sussex-to-reduce-flooding/",
    "title": "Spotlight on the field teams working in Hampshire and Sussex to reduce flooding  ",
    "authors": [
        "Environment Agency"
    ],
    "categories": [
        "Environment Agency",
        "Flood",
        "Flood Maintenance"
    ],
    "pub_date": "2024-10-14T09:02:02+00:00",
    "content": [
        {
            "text": "It’s Flood Action Week so we’re showcasing the great work of our field teams in Hampshire and Sussex.  "
        },
        {
            "text": "These teams play a vital role reducing the risk of flooding to communities in the south east of England. In Hampshire and West Sussex alone, the Environment Agency maintains 4,500 flood risk structures which protect approx. 5,500 properties.  "
        },
        {
            "text": "Jack Pardoe works in the West Hampshire Field Team. He is lucky enough to work in a county that includes the coastal towns of Lymington, Hythe and Southampton and the important, beautiful River Test and River Itchen chalk streams.    "
        },
        {
            "text": "His job is to maintain and operate flood and coastal defence structures. He is also required to respond to flood incidents.  "
        },
        {
            "text": "Jack says  "
        },
        {
            "text": "“Most of my working day is spent outside, using a wide range of tools and equipment. No day is ever the same.   "
        },
        {
            "text": "“Throughout the year, I’m wearing my waders in streams and rivers, clearing debris, removing fallen trees and cutting back vegetation.  "
        },
        {
            "text": "“I recently cleared a build-up of vegetation from Mead End Stream in Denmead in Hampshire. After the clearance, the water was able to flow more freely, reducing flood risk to local homes and businesses”.  "
        },
        {
            "text": "Photos before and after the vegetation was cleared from Mead End Stream."
        },
        {
            "text": "An important part of Jack’s job is to inspect, and repair broken or damaged structures. His team have recently repaired the seawall between Lymington and Keyhaven in the New Forest to prevent water from overtopping the defence.  This seawall is also part of the popular Solent Way Walk.    "
        },
        {
            "text": "Photo: The repaired sea wall between Lymington and Keyhaven"
        },
        {
            "text": "Vicky Bowen is a member of the East Hampshire Field Team. Her job mainly involves on-the-ground operational work protecting communities from flooding. "
        },
        {
            "text": "Photo: Vicky Bowen"
        },
        {
            "text": "Vicky says \"I’m proud to be a woman doing a physically demanding job, that reduces the risk of flooding to people and the environment. I’ve learnt so much doing this role, from laying new hedges to confidently using a chainsaw.  "
        },
        {
            "text": "“I love being out and about, seeing the seasons change and working with nature. It’s really rewarding and great fun at the same time”. "
        },
        {
            "text": "This autumn, her team cleared a substantial amount of vegetation from the River Alver in Peel Common near Fareham and Gosport. Their work transformed the riverbed and will reduce the flood risk to the local area this winter.   "
        },
        {
            "text": "Photos: before and after the vegetation was cleared from the River Alver"
        },
        {
            "text": "Last year’s flooding was a challenging time for many of the local communities. As part of Vicky’s incident role, she helps reduce the impact of flooding.  "
        },
        {
            "text": "In April 2024, following the highest recorded tides, she was part of the team that installed high volume pumps on Hayling Island. These pumps drained the floodwater away so that the community could finally access their services and properties again."
        },
        {
            "text": "Photo: Installing pumps in Mengham on Hayling Island."
        },
        {
            "text": "Josh Payne is in the Chichester Field Team in West Sussex. Their work covers the coastal towns of Bognor Regis and Selsey and communities inland including Chichester City."
        },
        {
            "text": "Photo: Josh looking at images from the robot camera."
        },
        {
            "text": "Autumn is a busy time for the team as they prepare for the winter. This year it’s already been unusually wet, and with climate change, extreme weather events are happening more frequently.  "
        },
        {
            "text": "Earlier this month, Josh and his team did a routine CCTV inspection of Spring Vale Brook culvert at Seaview village on the Isle of Wight. They used a camera robot to check the condition of the culvert to make sure it wasn’t blocked or damaged.  "
        },
        {
            "text": "The camera showed that there was a small amount of silt in the culvert so they cleared it and reduced the risk of flooding to the local community.  "
        },
        {
            "text": "Photo: The camera robot to check the condition on of the culvert"
        },
        {
            "text": "Photo: The image from the camera robot                                                                                                               "
        },
        {
            "text": "Josh says"
        },
        {
            "text": "“While my team are stepping up their winter preparations to increase resilience to flooding in West Sussex, we encourage the public to take small steps to be prepared”"
        },
        {
            "text": "“It’s essential everyone does their part by preparing early,  checking their flood risk and signing up for flood warnings this Flood Action Week. "
        },
        {
            "text": "“I also encourage members of the public to report blocked main rivers or damaged riverbanks by calling the Environment Agency incident hotline on 0800 80 70 60”.  "
        },
        {
            "text": "To find out more about the work of the teams in Hampshire and Sussex follow @johnoflynnEA on X. "
        },
        {
            "text": "The Environment Agency is urging the public to ensure they are prepared for a flood as the nation marks the annual ‘Flood Action Week’, which runs from 14-20 October. "
        }
    ]
}