{
    "url": "https://icsdigital.blog.gov.uk/2024/10/14/when-ucd-and-popcorn-collide/",
    "title": "When UCD and popcorn collide",
    "authors": [
        "Nindy Scott"
    ],
    "categories": [
        "How we work",
        "User-centred design"
    ],
    "pub_date": "2024-10-14T11:27:58+01:00",
    "content": [
        {
            "text": "No we’re not planning an away day social to the cinema - 'popcorn' is a method to bring change incrementally. It’s also the name of a new project and way of working the User-Centred Design team are trying.  "
        },
        {
            "text": "When our new Lead Service Designer joined, he brought with him new ideas and suggestions to address challenges with our ways of working that we knew we had, but were struggling to address effectively without it snowballing. "
        },
        {
            "text": "One of his ideas was to use the popcorn method. Read this useful blog explaining how it works."
        },
        {
            "text": "Rather than trying to change a culture by doing a big project, you experiment with lots of little tasks and projects that are safe to fail and move you towards the end goal.  "
        },
        {
            "text": "Some things will work, others won’t and that’s absolutely fine.  As long as we learn from each experiment and why they did or didn’t work.   "
        },
        {
            "heading": 2,
            "text": "Getting started"
        },
        {
            "text": "So, with all the enthusiasm and energy that a new team member brings, we ploughed into building our popcorn board on Jira.  "
        },
        {
            "text": "We held team workshops to bring together and prioritise our list of epics. We identified 10 high level 'How might we' problems that helped set the strategic priority. Then we came up with ideas, over 70 small problems we might want to solve. These are going to become our experiments. "
        },
        {
            "text": "We combined our new ways of working with our usual agile working practices, so we are working in 2 week sprints and we have weekly show and tells.  We have sprint planning and retros every 2 weeks.  If you’re not on a project, then you’re expected to pick up a ticket, and try something new. "
        },
        {
            "text": "Every team member has the autonomy to run their experiment how they like and can collaborate with others. That means that everyone has a chance to shine, while still working towards strategic priorities of the team.   "
        },
        {
            "heading": 2,
            "text": "What we’ve learnt so far"
        },
        {
            "text": "In our retros, it became clear that: "
        },
        {
            "heading": 2,
            "text": "Breaking it down"
        },
        {
            "text": "As with all things agile, we’re continuously iterating how we work in this style and adapting to the challenges that are raised.  "
        },
        {
            "text": "For example, when it was clear that overlapping tasks were stopping action, we changed the board to bring the tasks down to a more detailed functional level. So instead of 'Fix the UCD sharepoint area', the task became 'Run a workshop on the challenges of the as-is sharepoint site'. "
        },
        {
            "text": "We also need to work on our definition of done and how we maintain momentum and reporting while we have people in and out of the 'project' depending on their other work.   "
        },
        {
            "heading": 2,
            "text": "Next steps"
        },
        {
            "text": "It's too early to assess how well the project will go – but as a team of UCD professionals, we should be able to adapt and change as needed and I’m sure we’ll be back to tell you how it’s going. "
        },
        {
            "text": "How do you report on and champion continuous improvement projects? "
        }
    ]
}