{
    "url": "https://environmentagency.blog.gov.uk/2024/10/14/working-together-to-improve-waste-regulation/",
    "title": "Working together to improve Waste Regulation ",
    "authors": [
        "Environment Agency"
    ],
    "categories": [
        "Waste"
    ],
    "pub_date": "2024-10-14T11:47:54+00:00",
    "content": [
        {
            "text": "The Waste Industry Placement Scheme (WIPS) is a collaborative venture between the ourselves at the Environment Agency, alongside the Environmental Services Association (ESA) and their members, who operate recycling and waste treatment infrastructure. It aims to provide our officers with hands-on operational experience, supporting their ability to regulate with greater understanding, credibility and confidence by undertaking short placements with participating waste companies. It also presents an opportunity for both us as the regulator, and regulated organisations to develop a shared understanding of waste regulation. This enables each to gain a greater appreciation of the problems and issues on both sides, allowing us to create a better place for people and wildlife while supporting sustainable development.  "
        },
        {
            "text": "History - Background to the Waste Industry Placement Scheme "
        },
        {
            "text": "WIPS was originally launched in 1999. The basis of the scheme is the belief that by working together in this way, standards in operation and regulation will improve with enhanced levels of compliance and environmental protection to the benefit all. However, we get much more out of the scheme than merely training regulators.  We have also found that site operators receive as much valuable feedback from the process as our staff do from the operators.  As with all good collaborations, the scheme is viewed as being mutually beneficial and leading to a better understanding of each other’s needs and responsibilities. "
        },
        {
            "text": "Following the trial in 1999 with just three people, the scheme was properly launched in 2001 with twenty members of staff. Over the years, WIPS has subsequently become a long running and successful collaborative venture between ourselves, Environmental Services Association and Waste Industry Operators. Following the successful pilot in 1999, the scheme ran up until 2019 before having to temporarily close due to the covid19 pandemic. Such was the success and positive feedback from both the industry and Agency staff, the scheme was relaunched for 2024 in May, at an opening event in Birmingham."
        },
        {
            "text": "Georgina Collins, our Director for Energy & Resources, who attended the relaunch event, said: “The Waste Industry Placement Scheme is a brilliant example of the regulator and the regulated coming together to get a better understanding of how the other works. We want to make sure our officers have the best skills, knowledge and experience to do their jobs effectively, so we are delighted to reinstate this scheme so that more people can benefit. We look forward to collaborating with the ESA and the waste industry on the scheme for years to come.” "
        },
        {
            "text": "Jacob Hayler, the ESA’s Executive Director, said: “The Waste Industry Placement Scheme provides a great opportunity for EA officers to experience first-hand the wide range of operations undertaken by ESA members which will help develop a deeper mutual understanding of how regulation impacts and supports our sector. We believe unequivocally in the importance of having a strong and effective regulator and supporting the Agency in this way aligns with ESA’s core strategic objective to raise standards across the sector. Our members look forward to welcoming EA officers to their placements and working with them over the next few months.” "
        },
        {
            "text": "Placements for the 2024 scheme subsequently started in June and will run until December.  "
        },
        {
            "text": "Participating companies in this relaunch year included Suez, Veolia, Augean, Biffa, EMR, FCC, Grundon, Hills, Sherbourne Recycling and Encyclis.  "
        },
        {
            "text": "Hear from our officers "
        },
        {
            "text": "Jake Boyle, one of our Environment Officers from Newcastle was placed with a Suez Recycling facility in Kirklees in June, speaking on his experience he said:  "
        },
        {
            "text": "“The placement has been significant in developing my understanding of the waste industry,”  "
        },
        {
            "text": "“I entered the placement with entry level knowledge but now have a more in-depth understanding of the how the industry functions and how it works to better itself and meet the standards set out by ourselves and other regulators. Being able to see the quantity of waste entering the site, the different types of waste and the challenges this presents has made me develop an appreciation for the work that goes into running a waste operation while prioritising the environment.  "
        },
        {
            "text": "This began with the materials recycling facility where great care is taken to separate out all individual waste types to avoid waste lingering on site. I have seen the challenges sites face around different types of waste as well as the risks posed by waste types such as gas bottles. The biggest lesson I have taken from this is that the types of waste coming into a plant have the most significant impact on the performance of the plant. I will be considering this more when performing my regulatory work at transfer stations as I will be stricter when it comes to assessing what waste types are being sent for incineration as I am now aware of the environmental impacts this can have.” "
        },
        {
            "text": "Mark Ryan, the Suez Plant Manager, said.  "
        },
        {
            "text": "“From an operator’s perspective, the Waste Industry Placement Scheme offers a valuable opportunity for Environment Agency officers to gain hands-on experience and an insight into waste industry operations, on this occasion energy from waste and recycling plants. By participating in these placements, staff can enhance their understanding of the latest technologies and best practices used in the waste management sector, ultimately contributing to more effective regulation and a better understanding of the way operators of these facilities manage their activities to comply with legislation & best practice.” "
        },
        {
            "text": "Sophie Allen, one of our officers based in Bristol, and Wiseman Ndlovu, an Environment Officer from the Newcastle Area Team, were placed at another Suez site in Manchester. Sophie and Wiseman learned a great deal from touring and speaking with staff at the different sites, observing the practicalities of waste management and experiencing first hand, the operations of a diverse range of waste facilities which in turn helped them to understand the regulatory pressures. At the site, they had the opportunity to ask questions and observe the logistics, providing a comprehensive understanding of the site’s day-to-day operations"
        },
        {
            "text": "Sophie reflected on her placement and said:  "
        },
        {
            "text": "“The placement at Suez will greatly benefit my work at the Environment Agency”  "
        },
        {
            "text": "“I now have a greater understanding of a wide range of waste sites. We helped with various tasks, which benefitted the site and gained an insight into a different area of waste management.” "
        },
        {
            "text": "Wiseman added that: “I benefited a lot from the knowledge and expertise shared by the operator through their sites. The placement has enhanced my personal development, which in turn will benefit my ability to regulate by always considering the broader picture.”  "
        },
        {
            "text": "The relaunch of the Waste Industry Placement scheme in 2024 has been a huge success and will now run annually from next year, allowing us to create a better place for people and wildlife while supporting sustainable development.  "
        }
    ]
}