{
    "url": "https://food.blog.gov.uk/2020/09/22/the-food-allergy-and-intolerance-research-programme-dr-paul-turner/",
    "title": "The Food Allergy and Intolerance Research Programme - Dr Paul Turner",
    "authors": [
        "Food for Thought"
    ],
    "categories": [
        "Allergy"
    ],
    "pub_date": "2020-09-22T10:39:03+01:00",
    "content": [
        {
            "text": "Cymraeg"
        },
        {
            "text": "​Food for Thought is a series of seminars to improve understanding of the food space and share the latest insight on matters concerning the food industry."
        },
        {
            "text": " "
        },
        {
            "text": "We invite experts and external speakers to present their research to FSA staff. We will be publishing a selection of Food for Thought seminars on our blog to share knowledge and encourage conversations among consumers, the food industry and the scientific community."
        },
        {
            "text": "In this seminar, recorded on Tuesday 4 August 2020, Dr Paul Turner provides an introduction to food allergy in the UK. The talk assesses the impact of the Food Standards Agency's Food Allergy and Intolerance Research Programme over the past 10 years at a national and global level."
        },
        {
            "text": "Dr Paul Turner is a Clinician Scientist and Honorary Consultant in Paediatric Allergy & Immunology at Imperial College London, and Clinical Associate Professor at the University of Sydney, Australia."
        },
        {
            "text": "Please note: Views expressed are those of the external speaker and do not necessarily represent those of the FSA."
        },
        {
            "heading": 1,
            "text": "Y Rhaglen Ymchwil Alergedd ac Anoddefiad Bwyd – Dr Paul Turner"
        },
        {
            "text": "Cyfres o seminarau yw Food for Thought i wella dealltwriaeth o'r gofod bwyd ac i rannu'r mewnwelediad diweddaraf ar faterion sy'n ymwneud â'r diwydiant bwyd."
        },
        {
            "text": " "
        },
        {
            "text": "Rydym ni’n gwahodd arbenigwyr a siaradwyr allanol i gyflwyno eu hymchwil i staff yr Asiantaeth Safonau Bwyd (ASB). Byddwn ni’n cyhoeddi detholiad o seminarau Food for Thought ar ein blog i rannu gwybodaeth ac annog sgyrsiau ymhlith defnyddwyr, y diwydiant bwyd a'r gymuned wyddonol."
        },
        {
            "text": "Yn y seminar hon, a recordiwyd ar 4 Awst 2020, mae Dr Paul Turner yn rhoi cyflwyniad i alergedd bwyd yn y Deyrnas Unedig. Mae'r sgwrs yn asesu effaith Rhaglen Ymchwil Alergedd ac Anoddefiad Bwyd yr ASB dros y 10 mlynedd diwethaf ar lefel genedlaethol a byd-eang."
        },
        {
            "text": "Mae Dr Paul Turner yn Wyddonydd Clinigydd ac yn Ymgynghorydd Anrhydeddus mewn Alergedd ac Imiwnoleg Pediatrig yng Ngholeg Imperial Llundain, ac yn Athro Cyswllt Clinigol ym Mhrifysgol Sydney, Awstralia."
        },
        {
            "heading": 4,
            "text": "Safbwyntiau’r siaradwr allanol yw'r rhai a fynegir ac nid ydynt o reidrwydd yn cynrychioli safbwyntiau’r ASB."
        }
    ]
}