{
    "url": "https://prisonjobs.blog.gov.uk/2021/10/29/black-history-month-2021-celebrating-black-british-trailblazers/",
    "title": "Black History Month 2021: Celebrating Black British trailblazers",
    "authors": [
        "Mary Pilgrim"
    ],
    "categories": [
        "Probation"
    ],
    "pub_date": "2021-10-29T06:00:51+01:00",
    "content": [
        {
            "text": "Mary Pilgrim wanted to be a probation officer since the age of 13. Living with her parents and seeing some of the injustices and racism they experienced spurred her on to work with vulnerable individuals."
        },
        {
            "text": "Mary is now the Regional Probation Director for Kent, Surrey and Sussex. She has worked in probation for 27 years, dedicating her career to helping prison leavers turn their backs on crime and live a better life."
        },
        {
            "text": "How long have you worked in Probation and why did you join?\nI joined the Probation Service as a probation officer in 1994. Back then, we used to write up our notes or dictate them! Technology has advanced so much and we have also become more advanced in how we commission services to support people on probation."
        },
        {
            "text": "I am still very passionate about this work and the important role we all have in making our communities safer. My days are so varied and, Covid aside, I like to meet staff and people on probation - recently I was at the Worthing Women’s Breakfast Club and the art exhibition at HMP Send."
        },
        {
            "text": "I have never shied away from working outside of my comfort zone in different settings, undertaking different roles. My proudest career achievement to date was being appointed Regional Probation Director. When I got the call to find out, I just cried! I was also very touched by all the messages I received from staff I had known or worked with over my 27 years in service."
        },
        {
            "text": "What does your black identity mean to you?\nI am proud of my dual heritage and ultimately it is who I am. I will never want to forget my roots and the journey my father had before and after he arrived in the UK in 1959 from the Caribbean. I also celebrate my mother’s side of the family. My grandfather and great grandfathers fought in both the first and second world wars. It was natural for people to see me with my late father but even today if people see me with my 76-year-old mum they have this surprised look on their face. It is so important that we don’t make assumptions not least because many of our staff are in biracial relationships with children of dual heritage, which is to be embraced."
        },
        {
            "text": "Are there specific issues or challenges facing Black people in the workplace, and how can we address them?\nI am mindful that often Black, Asian and Minority Ethnic staff are perceived as the experts and that we have all the answers to what we know are very complex and sensitive issues. We often forget that for many of us reliving our own experiences can be very traumatic and, in many cases, like reliving those situations. We are all so different and need to be aware of our own biases, talk about them and take responsibility for our own learning."
        },
        {
            "text": "Going forwards, it is important that HMPPS continues to invest in learning and development and raises our profile when we are recruiting staff so we are appealing to Black candidates too. Being supportive of our staff networks is important and ensuring we hold ourselves accountable for continued progress in this area through initiatives like the Race Action Programme."
        }
    ]
}