{
    "url": "https://ukhsa.blog.gov.uk/2021/10/29/eligible-for-a-free-flu-vaccine-this-winter-dont-wait-book-it/",
    "title": "Eligible for a free flu vaccine this winter?  Don’t wait, book it.",
    "authors": [
        "Blog Editor"
    ],
    "categories": [
        "Coronavirus (COVID-19)",
        "flu",
        "Winter"
    ],
    "pub_date": "2021-10-29T12:16:25+01:00",
    "content": [
        {
            "text": "With flu and COVID-19 expected to be in wide circulation together this winter, we are urging more people than ever to get their free flu vaccine, if they are eligible. In this blog we answer some common questions about this year’s flu season."
        },
        {
            "heading": 2,
            "text": "Why are we expecting a difficult winter?"
        },
        {
            "text": "This is the first winter when COVID-19 and seasonal flu will be circulating together without a nationwide lockdown which helped to stop the spread last year."
        },
        {
            "text": "Flu is unpredictable and levels of activity vary from year to year.  However, health experts warn that this winter we could see a resurgence of flu following low levels last winter.  Different strains of flu are present each year and we’ve got less population immunity after very little flu last year. At the same time, fewer people than last year are social distancing and wearing masks."
        },
        {
            "text": "We also know that people who are infected with both COVID-19 and flu are at a higher risk of dying – so if you are eligible it is critical that you get your flu jab as well as any COVID-19 vaccine doses that you are due to have."
        },
        {
            "heading": 2,
            "text": "What can you do to protect yourself and others?"
        },
        {
            "text": "The best way to protect yourself and others is to get vaccinated, ideally in the autumn or early winter before flu starts spreading. It is also important to stick to good habits, like wearing masks in crowded spaces and regularly washing your hands."
        },
        {
            "text": "If you do get ill, you need to avoid mixing with others to stop passing it on. Stay hydrated, stay warm, and call 111 if you are concerned, especially if you have underlying health conditions, are pregnant or are 65 years old and over."
        },
        {
            "text": "Taking measures such as staying at home if possible while unwell can reduce the spread of infection. There are some settings, for example care homes, where staff will need to stay off work if they are symptomatic in a flu outbreak and residents will be asked to isolate if they test positive for flu, as set out in guidance published by the UKHSA."
        },
        {
            "heading": 2,
            "text": "Who is eligible for a vaccine? "
        },
        {
            "text": "In England, more than 35 million people are now eligible for a free flu vaccine and so far 7.5 million people have been invited to take up an offer of a free COVID-19 booster jab."
        },
        {
            "text": "More than 80% of people aged 65 and over had their flu jab last year in the UK – exceeding a global target of 75% – and we have a target of reaching at least 85% of this group this flu season."
        },
        {
            "text": "We also strongly encourage other eligible groups to get their vaccines, including people with underlying health conditions, such as asthma and heart disease, pregnant women and eligible children (2 and 3 year olds; and schoolchildren aged up to year 11). Schoolchildren should receive their flu vaccine at school."
        },
        {
            "text": "If you are eligible for a free flu vaccine, you may get it either from your own GP practice or any pharmacy offering NHS flu vaccinations. Some people may receive an invitation to come forward for a vaccination from their GP surgery or by letter. However, you do not have to wait to be invited before booking an appointment at your GP practice or pharmacy."
        },
        {
            "text": "Frontline health and social care worker should be offered the flu vaccine through their employer. They may be able to get it at their workplace or through another local service. Health or social care workers employed by a registered residential care or nursing home, registered homecare organisation or hospice and anyone providing health or social care through direct payments or personal health budgets can also have it at a GP surgery or a pharmacy."
        },
        {
            "heading": 2,
            "text": "Do pregnant women need a flu vaccination this year?"
        },
        {
            "text": "All pregnant women should have the flu vaccine to protect themselves and their babies. Pregnancy alters how the body handles infections such as flu. Flu infection increases the chances of pregnant women and their babies needing intensive care."
        },
        {
            "text": "The flu vaccine can be given safely at any stage of pregnancy, from conception onwards."
        },
        {
            "text": "Pregnant women benefit from the flu vaccine because it can:"
        },
        {
            "heading": 2,
            "text": "What flu vaccines are available in the UK?"
        },
        {
            "text": "There are several types of flu vaccine. The Joint Committee on Vaccination and Immunisation (JCVI) reviews the latest evidence on influenza vaccines every year and recommends the type of vaccine to be offered to patients. Recommended vaccines vary according to age.  You will be offered one that is most effective for you."
        },
        {
            "text": "Some children cannot have the nasal spray so they will be offered an injected vaccine instead.  And children under the age of 2 years who are in a high-risk group for flu will also be offered an injected flu vaccine as the nasal spray is not licensed for children under 2 years old."
        },
        {
            "heading": 2,
            "text": "What should you do if you are unsure whether you’ve got flu or COVID-19?"
        },
        {
            "text": "If you are unwell with cold and flu like symptoms, try to stay at home if you can, until you are better to stop passing it on to others. Some COVID-19 and flu symptoms overlap, so get a PCR test, if you experience:"
        },
        {
            "text": "If you have any of the above symptoms, stay at home until you receive your result. If your PCR test result is negative but you still have symptoms, you should avoid mixing with others until you feel well."
        },
        {
            "heading": 2,
            "text": "Is it safe to get the flu jab and COVID-19 jab close together?"
        },
        {
            "text": "The flu programme will run alongside the COVID-19 booster programme. Mostly, the patients eligible for the COVID-19 booster are also eligible for a flu vaccine."
        },
        {
            "text": "In some areas, people may be offered the COVID-19 jab in one arm and the flu vaccine in the other on the same day, although this will not be available in every area. Doing them at the same time is generally fine. However, it is important that you do not delay either vaccine in the expectation that you can have them together."
        },
        {
            "text": "As is the case with any vaccination, it is not a good idea to be vaccinated whilst you are ill from something else. It’s advisable to wait until you recover before booking your appointment."
        },
        {
            "heading": 2,
            "text": "Do people get tested for flu in the UK?"
        },
        {
            "text": "Flu is usually diagnosed on clinical signs and symptoms rather than tests. These symptoms can include fever, cough, runny/blocked nose, sore throat, tummy or intestinal symptoms (more commonly in children), and generalised symptoms (headache, tiredness or muscle pain). Flu symptoms can come on quickly."
        },
        {
            "text": "Flu testing is mainly done as part of clinical care for inpatients, A&E patients or people with risk factors such as severely impaired immune systems. For suspected care home influenza outbreaks, testing can be done in regional public health laboratories."
        },
        {
            "heading": 2,
            "text": "Further information"
        },
        {
            "text": "The NHS website has more information on flu and the vaccination programme."
        },
        {
            "text": " "
        },
        {
            "text": " "
        }
    ]
}