{
    "url": "https://actuaries.blog.gov.uk/2021/10/29/gads-getting-ready-for-glasgow/",
    "title": "GAD’s getting ready for Glasgow",
    "authors": [
        "Edward Cole - Actuary"
    ],
    "categories": [
        "Actuary",
        "Analysis",
        "Climate change"
    ],
    "pub_date": "2021-10-29T17:38:31+01:00",
    "content": [
        {
            "text": "I live in Glasgow: a city where ‘climate’ often means ‘wet’. A short walk away from my flat, the United Nations COP26 conference is just about to begin on 31 October down by the River Clyde."
        },
        {
            "text": "Delegates from across the world are coming together with the aim of obtaining agreement about minimising and adapting to climate change. It will be an exciting time round here, even though I might not be able to find a spare restaurant table for a couple of weeks. As well as COP26, climate change continues to move up the agenda of governments around the world including in the UK."
        },
        {
            "text": "A key aim that you may have heard of is ‘net zero’, which means that any carbon released into the atmosphere is balanced by removing carbon from it. To reach net zero, ‘decarbonisation’ is necessary: reducing carbon emissions to close to zero and removing any remaining emissions that are produced."
        },
        {
            "heading": 2,
            "text": "Decarbonising government"
        },
        {
            "text": "At the Government Actuary’s Department (GAD), we’re working on some really interesting projects relating to climate change. As an example, we are supporting government departments on decarbonisation projects to help them reach net zero by 2050."
        },
        {
            "text": "A Power Purchase Agreement (PPA) is a contract that allows an electricity user to buy directly from a renewable energy provider at an agreed cost for an agreed length of time. We chair cross-department discussions on PPAs and consider the types of financial risk that these contracts may involve."
        },
        {
            "text": "We also carry out financial modelling for the Department for Education to help them decarbonise. This includes converting school minibus fleets to electric vehicles, and identifying schools most in need of replacing gas boilers with heat pumps."
        },
        {
            "heading": 2,
            "text": "A picture of future finances"
        },
        {
            "text": "It’s important that companies and other organisations report information about the impact of climate change on their financial health. The Task Force on Climate-related Financial Disclosures (TCFD) has made recommendations which will become mandatory for large organisations in the UK by 2025. We are developing our advice to public sector pension schemes and other clients, to understand their financial risks from climate change and how they can report them."
        },
        {
            "text": "As discussed in this earlier blog scenario analysis is a valuable tool for looking at possible versions of the future, especially where there is a lot of uncertainty. As an example, we can estimate the ‘funding level’ (financial health) of a pension scheme based on different climate change outcomes. Funding levels can fluctuate.  A 100% funding level is generally a target as 100% indicates that a scheme should have just enough money to pay for its members’ pensions.  A lower funding level indicates that remedial action may be required."
        },
        {
            "text": "When considering the financial impact of climate change it is not just the overall temperature increase that matters: how we get there is also important. So, a long-term 2°C increase in temperatures might be reached in various ways."
        },
        {
            "text": "With an orderly 2°C transition, where financing is available to support decarbonisation and governments co-ordinate action, adverse financial impacts are likely to be minimised. On the other hand, a disorderly 2°C transition is possible if early inaction leads to a more abrupt repricing of carbon-intensive industries later."
        },
        {
            "text": "This scenario is likely to lead to more severe economic disruption, with more severe negative impacts on pension schemes and other asset owners. If no action is taken and global temperatures increase by 4°C, even more disruption is expected with even worse financial outcomes. Shown together in a graph, these scenarios show the benefits of addressing climate change early. (The example is the impact on a pension scheme funding where the lower the funding level is, the worse the financial situation.)"
        },
        {
            "heading": 2,
            "text": "Webinar"
        },
        {
            "text": "Recently we held a climate change-themed webinar which should be available to watch soon by searching for ‘Government Analysis Function’ on YouTube. As well as a talk which I gave, we were also delighted to include the Environment Agency, who have worked with GAD on climate-related projects. In 2 fascinating talks they discussed the benefits of investing in flood alleviation schemes."
        },
        {
            "heading": 2,
            "text": "Latest developments"
        },
        {
            "text": "Recently the UK government has issued two key reports outlining its climate change strategy. The report on Greening Finance outlines new reporting requirements that organisations will be expected to comply with in order to inform investors and consumers. Central to these requirements are Sustainability Disclosure Requirements, which will build on existing reporting requirements to give a fuller picture of each organisation’s environmental credentials."
        },
        {
            "text": "The Net Zero Strategy outlines how the government intends to reach the target of net zero by 2050, including the role of green investment. HM Treasury also released its own analysis of some key issues raised if the economy is to transition to Net Zero."
        },
        {
            "heading": 2,
            "text": "COP26"
        },
        {
            "text": "At GAD we are assessing the implications of these recent announcements for our clients. We expect further news very soon as COP26 takes place, and where we hope that agreements on the conference’s goals are secured."
        },
        {
            "text": "We are especially interested in Finance Day on 3 November since mobilising finance is one of COP26’s key goals. The chair of our climate change group at GAD is currently on secondment to the team supporting Mark Carney, the Prime Minister’s Finance Adviser for COP26. We’re sure she’ll have some valuable experience to share when she returns."
        },
        {
            "text": "It is a busy time for climate change analysis, as well as for my adopted home of Glasgow! Please contact climatechange@gad.gov.uk for further information."
        },
        {
            "text": "Disclaimer"
        },
        {
            "text": "The opinions in this blog post are not intended to provide specific advice. For our full disclaimer, please see the About this blog page."
        }
    ]
}