{
    "url": "https://teaching.blog.gov.uk/2021/10/29/how-can-schools-get-involved-with-cop26-and-climate-change-lessons/",
    "title": "How can schools get involved with COP26 and climate change lessons?",
    "authors": [
        "DfE"
    ],
    "categories": [
        "Primary schools",
        "Secondary schools"
    ],
    "pub_date": "2021-10-29T14:39:06+01:00",
    "content": [
        {
            "text": "What is COP26? "
        },
        {
            "text": "For nearly three decades the United Nations has been bringing together almost every country on earth for its global annual climate change conference – called COPs – which stands for ‘Conference of the Parties’. This year will be the 26th annual summit – giving it the name COP26."
        },
        {
            "text": "The 2021 conference in Glasgow, hosted by the UK in partnership with Italy, will take place from 31 October – 12 November."
        },
        {
            "text": "The UK government will be taking a prominent role in the conference, with the Department for Education (DfE) leading the conversation on how to fight climate change through education, as part of an international effort to reduce carbon emissions and protect our planet."
        },
        {
            "text": "How can you involve your pupils in climate action?"
        },
        {
            "text": "Education is a vital tool in raising awareness and equipping future generations with the skills and knowledge needed to tackle climate change."
        },
        {
            "text": "We know schools, teachers and pupils are already doing great things to respond to the climate change challenge and play their part in creating a sustainable future. Throughout COP26 and beyond, we’ll be sharing examples of green success stories from teachers and pupils for inspiration and ideas."
        },
        {
            "text": "In the meantime, if you’re looking for campaigns and activities to engage pupils of all ages with climate change and the conference, here are some supporting resources:"
        },
        {
            "text": "At COP26 the DfE will be hosting a number of events to discuss climate change and sustainability in education. If you aren’t attending the conference, make sure you subscribe to: The DfE YouTube Channel and The official COP26 YouTube Channel to livestream events or watch on demand."
        },
        {
            "text": "Generation Zero classroom events "
        },
        {
            "text": "Watch live"
        },
        {
            "text": "Teach the Teacher Lesson | 4th November | 13:00-14:30"
        },
        {
            "text": "Students from the Teach the Teacher campaign will deliver a lesson to help improve both teachers and pupils’ understanding of climate change, climate justice and show how this could be brought into learning across different subject areas."
        },
        {
            "text": "Too Wet or Too Dry: adapting schools to water risks and a future climate | 8th November | 13:30-14:00 | 14:15-14:30 "
        },
        {
            "text": "How can your school be resilient to the impacts of flooding now and in the future? Could your school save water, money and help the environment? The DfE’s Water Strategy Team will address these questions and more in two sessions for school decision makers (13:30-14:00) and teachers and pupils (14:15-14:30)."
        },
        {
            "text": "Watch on demand"
        },
        {
            "text": "Climate Solutions Lecture"
        },
        {
            "text": "Professor Dave Reay from the University of Edinburgh will host a talk on 'Climate Solutions' exploring the ways we can all tackle climate change from what we do at home through to our schools, jobs, shops, and governments."
        },
        {
            "text": "Green Skills and Careers"
        },
        {
            "text": "This exclusive session will focus on ‘Green Skills and Careers’ including a variety of presentations from industry experts such as Microsoft and Centrica as well as various post-16 skills programmes supporting green career pathways offered by the DfE."
        },
        {
            "text": "Official COP26 events"
        },
        {
            "text": "Watch live"
        },
        {
            "text": "DfE launch biodiversity and nature initiatives | 5th November | 14:30-15:30 "
        },
        {
            "text": "We will be launching two new initiatives from the UK Pavilion in the official COP26 venue. Tune into the COP26 broadcast to watch."
        },
        {
            "text": "Education and Climate Ministers Summit | 5th November | 16:00-17:30"
        },
        {
            "text": "This event will bring Education and Climate Ministers from the across the world together, to discuss how education can help everyone tackle climate change. The UK has asked countries to make a pledge to do more to ensure young people are taught about climate change and prepared with the right skills for a green economy. Secretary of State Nadhim Zahawi will set out the UK’s Sustainability and Climate Change Education Strategy."
        },
        {
            "text": "Green career pathways | 7th November | 9:30-10:30 "
        },
        {
            "text": "The DfE, in partnership with the University of Edinburgh, is delivering a discussion on how Higher and Further Education providers can establish pathways to prepare young people for a green career. Minister Donelan will deliver a keynote speech to set out the UK government’s plans."
        },
        {
            "text": "So you want a green career? | 7th November | 15:30-17:30"
        },
        {
            "text": "We are working with One Young World and the Prince’s Trust to share the stories of several green entrepreneurs and discuss the best route to a green career. This event will also feature a mini careers fair in the Green Zone at COP26."
        },
        {
            "text": "Visit the Together for our Planet website to get involved and inspired."
        },
        {
            "text": " "
        }
    ]
}