{
    "url": "https://educationhub.blog.gov.uk/2021/10/how-does-school-funding-work-and-how-does-the-budget-affect-it/",
    "title": "How does school funding work and how does the Budget affect it?",
    "authors": [
        "Media Officer"
    ],
    "categories": [
        "School spending"
    ],
    "pub_date": "2021-10-29T17:09:43+01:00",
    "content": [
        {
            "heading": 6,
            "text": "This chart illustrates per pupil funding in real terms taking into account both funding through the National Funding Formula and other revenue streams."
        },
        {
            "text": "Every area, school and child is different so the way in which schools are funded can seem complicated because it needs to reflect that."
        },
        {
            "text": "Yesterday in the Government’s Spending Review and Autumn Budget the Chancellor announced that per pupil funding would go up by an average of £1,500 by 2024-24 compared to 2019-20 levels."
        },
        {
            "text": "Here we explain how school funding and this increase will work."
        },
        {
            "heading": 3,
            "text": "So how are schools funded? "
        },
        {
            "text": "Schools get two main streams of money from the Government. Their core funding – known as revenue funding – is the money that is spent on running costs, like salaries.  They then have capital funding which is for buildings."
        },
        {
            "text": "All state-funded schools, whether they are academies or council-run schools, get their funding from the Government. Independent or private schools operate outside this system and raise their funding through fees."
        },
        {
            "text": "And how do you decide how much each school gets for educating pupils?"
        },
        {
            "text": "All schools are funded on a per pupil basis.  We have a National Funding Formula (NFF) to make sure that a school’s per-pupil funding reflects a number of factors including the characteristics of their pupils (like how many pupils have fallen behind), how many pupils receive free school meals, the geographic location of the school (to reflect different salary costs) and much more."
        },
        {
            "text": "You can read more about the National Funding Formula here."
        },
        {
            "text": "So is that why a school in one area might get a different level of funding to a school in another areas? "
        },
        {
            "text": "Yes – but what it means is that if two schools have the same level of pupils on free school meals, are similarly affected by things like how remote they are from other services and the other factors that dictate the NFF then the government provides the same funding for both. Under the previous system schools saw differences in their funding levels that were unfair and dictated by historic factors."
        },
        {
            "text": "Are there other factors that can affect how much money schools receive?"
        },
        {
            "text": "At the moment the money that we calculate schools need through the NFF is then given to councils to allocate across both council-run schools and academies. Local authorities then set their own local formulae to hand out their total allocation between all the schools in their area."
        },
        {
            "text": "This means that while the Government’s NFF determines how much money each local authority receives, it is the local authorities’ own formulae that determine how much each school finally receives."
        },
        {
            "text": "This can result in some amounts that schools actually receive being lower or higher than what they “attract” through the NFF. There can be cases where schools would receive significantly different funding levels, if they happened to be located in a different area."
        },
        {
            "text": "We are consulting on changes that would mean local authorities would no longer use their own formulae to hand out final allocations, and schools’ budget would be set directly by the NFF."
        },
        {
            "text": "This means that funding will be better matched to the needs of schools, regardless of where they are located."
        },
        {
            "text": "The Chancellor said at the budget that by 2024-25 school funding will go up by £1,500 per pupil compared to 2019-20 levels. How does that work?"
        },
        {
            "text": "The government has confirmed that it will continue to deliver year on year, real terms per pupil increases to school funding, investing a further £4.7bn in the core school budget in 2024-25 compared to previous plans. This is on top of the settlement at the 2019 Spending Review which provided the biggest increase in school funding for a decade."
        },
        {
            "text": "Overall, this is equivalent to a cash increase of £1,500 per pupil by 2024-25 compared to 2019-20."
        },
        {
            "text": "So what’s the average spend per pupil now?"
        },
        {
            "text": "It’s important to say that it can be misleading to use a single average figure for how much is spent per pupil because of the reasons set out above. Per pupil spend in a school with high levels of deprivation and children with additional needs will be a lot more than per pupil spending in an area where pupils do not face these additional challenges."
        },
        {
            "text": "That said, the average per pupil spend at the moment is £4,679 in primary schools and £5,992 in secondary schools. *"
        },
        {
            "text": "How have school funding levels changed over the last 10 years – I’ve heard this increase in funding only takes us back to 2010 levels. "
        },
        {
            "text": "This commitment takes us beyond 2010 levels – although it’s important to say that comparisons over long periods of time like this are very complicated because of rates of inflation and other changes that mount up over time. We recognise that in the years following the recession schools have faced cost pressures. That is why at the spending review in 2019 we delivered the biggest funding boost for schools in a decade, increasing funding significantly above real terms per pupil. Since then schools have seen sharp year-on-year increases in their funding levels and yesterday’s commitment is set to continue that."
        },
        {
            "text": "*To note: The overall core schools funding presented in the charts covers funding through the schools, high needs and central school services block of the dedicated schools grant (DSG), and other smaller grants such as pupil premium and the public sector compensation for employer costs of the Health and Social Care Levy. The per pupil figures are therefore higher than the funding schools are allocated through the schools NFF, and paid via the schools block of the DSG."
        },
        {
            "text": "The following charts illustrate schools’ revenue funding in real terms and then cash terms"
        }
    ]
}