{
    "url": "https://equalities.blog.gov.uk/2021/10/29/launching-a-consultation-on-conversion-therapy/",
    "title": "Launching a consultation on conversion therapy",
    "authors": [
        "Equality Hub"
    ],
    "categories": [
        "LGBT"
    ],
    "pub_date": "2021-10-29T11:12:34+01:00",
    "content": [
        {
            "heading": 3,
            "text": "Mike Freer was recently appointed the Minister for Equalities, with a specific focus on LGBT rights. Read our Q and A with him where he discusses today's launch of the government’s proposals to ban conversion therapy and the accompanying consultation on a ban, and why it is vital all those with an interest respond to the consultation."
        },
        {
            "text": "Equality Hub: Tell us about your role"
        },
        {
            "text": "Mike Freer: I’m Mike Freer, a member of parliament for Finchley and Golders Green. Along with that, I’m also the Minister for Exports and the Minister for Equalities with a focus on LGBT rights."
        },
        {
            "text": "Equality Hub: How do those portfolios go together?"
        },
        {
            "text": "Mike Freer: You might think that is an odd mixture, but it’s not unusual that ministers will have portfolios which are slightly, or even quite a lot, different from each other. So I’m focusing on the domestic LGBT issues, and also, when it comes to exports, that I’m ensuring the supply chain is as diverse as possible."
        },
        {
            "text": "The two roles can often tie in quite nicely with each other. While in America this week I’ll be speaking to our big exporters and speaking to a variety of LGBT groups, in particular the Houston LGBT Chamber of Commerce to see how they operate."
        },
        {
            "text": "Equality Hub: What are your priorities?"
        },
        {
            "text": "Mike Freer: My priorities are primarily domestic, working with the Prime Minister’s envoys, like Lord Herbert and Iain Anderson, and particularly alongside the Foreign Secretary Liz Truss, who heads up our work on Women and Equalities."
        },
        {
            "text": "“Safe to be me”, the first Global LGBT conference, is next year, and we’re putting a huge amount of effort into it."
        },
        {
            "text": "I have lots of other priorities: getting the conversion therapy ban through, LGBT homelesses, particularly how that can often lead into sex work, health - whether that be transgender health services or sexual health.  "
        },
        {
            "text": "Equality Hub: Why is it important that we tackle conversion therapy?"
        },
        {
            "text": "Mike Freer: Well, not only does it not work, but it’s an abhorrent practice. One of the first things I did when I got the job was to work on the consultation document. I was keen to make sure it was as hard hitting as possible. "
        },
        {
            "text": "When we talk about talking therapies it all sounds a little fluffy. It’s important to emphasise what abhorrent practices conversion therapy can involve. It can cause lasting harm to people, it can be a violent act upon a person. It is important that we stop it."
        },
        {
            "text": "Equality Hub: What are the next steps on the consultation?"
        },
        {
            "text": "Mike Freer: The next steps will be to publish it. It will be a relatively quick six week consultation. That’s because the consultation is not about whether we should ban conversion therapy, but how we ban conversion therapy. People will have views as to how this should be done, and it’s important that we get all of those views. Some of them we will agree with, some of them we won’t agree with. "
        },
        {
            "text": "Equality Hub: How can people have their say?"
        },
        {
            "text": "Mike Freer: It is important that we get a volume of people taking part in the consultation. People shouldn’t be afraid to have views that they don’t think are mainstream. I do want to hear a wide range of views. "
        },
        {
            "text": "They can do that by going on the government website. It won’t take a lot of time to complete, but it is important. This is a massive piece of legislation for government and will have a massive impact on the lives of many of our friends and colleagues in the LGBT community."
        }
    ]
}