{
    "url": "https://defrafarming.blog.gov.uk/2021/11/02/an-update-on-the-farming-investment-fund/",
    "title": "An update on the Farming Investment Fund",
    "authors": [
        "The Team"
    ],
    "categories": [
        "Payments for equipment, technology and infrastructure"
    ],
    "pub_date": "2021-11-02T13:13:41+00:00",
    "content": [
        {
            "heading": 4,
            "text": "UPDATE:"
        },
        {
            "heading": 4,
            "text": "The Farming Investment Fund is open."
        },
        {
            "heading": 4,
            "text": "People are able to apply for grants for both smaller investments  (The Farming Equipment and Technology Fund) and for larger investments (The Farming Transformation Fund)."
        },
        {
            "heading": 4,
            "text": "Find out more and apply here "
        },
        {
            "text": "We would like to give you an update on the Farming Investment Fund."
        },
        {
            "text": "As we've said in previous posts, the Farming Investment Fund is one of the ways through which profitability and environmental good can be achieved. It is designed to help farmers invest in things like new farming technology and equipment."
        },
        {
            "text": "We had hoped to be in a position to announce more details of when the fund would be available by now. Unfortunately we’re not quite there yet."
        },
        {
            "text": "We are almost ready and we're on track to announce the details this month. We're just going through the final stages at the moment."
        },
        {
            "text": "We understand that this delay is frustrating, but it's really important that we get things right before we launch."
        },
        {
            "text": "To reassure you, nobody will lose out as a result of this delay. The application window will remain open for the length of time that was originally intended. "
        },
        {
            "text": "Thank you for your patience and for your interest in the fund. As soon as we have any updates, we'll post them here on the blog. Make sure you subscribe to get the latest updates. "
        }
    ]
}