{
    "url": "https://civilservice.blog.gov.uk/2021/11/02/bridging-the-divide-to-train-civil-service-leaders/",
    "title": "Bridging the divide to train Civil Service Leaders",
    "authors": [
        "Fisayo King, Talent Lead - GDS"
    ],
    "categories": [
        "A great place to work",
        "A Modern Civil Service",
        "A Skilled Civil Service"
    ],
    "pub_date": "2021-11-02T11:09:45+00:00",
    "content": [
        {
            "heading": 3,
            "text": "A new Government Digital Service leadership programme aims to help support our Grade 6 and 7 future leaders"
        },
        {
            "text": "The Government Digital Service is an 800-strong unit whose mission is to transform the provision of public services. Our goal is to create a simple, joined up experience of government for everyone in the digital age."
        },
        {
            "text": "Over the last 15 months, the Talent Team at Government Digital Service (GDS) has reviewed how our Grade 6s and 7s are supported in leadership training and skills. Through our study of the Grade 6/7s in GDS, we recognised that we needed to do more to support our future leaders. "
        },
        {
            "heading": 4,
            "text": "Review of leadership programmes"
        },
        {
            "text": "To tackle this, we reviewed our leadership programmes for Grade 6/7s and found that we heavily relied on the Future Leaders Scheme (FLS). The downside to depending on the Future Leaders Scheme is that we only have a small percentage (fewer than 1%) of our Grade 6/7s accepted onto the programme each year. "
        },
        {
            "text": "Our top priority was to draw up a plan on the new GDS leadership programme to take a hard look at our purpose, our future, target audience, stakeholders and - as is always the way - budget."
        },
        {
            "text": "The programme soon morphed into a new GDS leadership programme called Leading for Success."
        },
        {
            "text": "We researched and set up meetings with a variety of learning providers and universities that deliver leadership programmes at Grade 6/7 level. We wanted to know if they could provide what we needed - and, of course, what the programme would cost! "
        },
        {
            "heading": 4,
            "text": "Focus groups"
        },
        {
            "text": "We set up a Senior Civil Servants focus group at GDS to discuss our findings and get their buy-in. We focused on identifying  the leadership skills and wider capability challenges for Grade 6/7 colleagues at GDS. Then we scrutinised the requirements for operating at Senior Civil Service level - in terms of leadership skills for those in Grade 6/7 roles, and understanding what it takes to step up and make the grade into the Senior Civil Service."
        },
        {
            "heading": 4,
            "text": "Key modules"
        },
        {
            "text": "We took the focus group's findings and recognised the leadership programme's key modules: inclusive leadership, change management, and strategic management. We also added a project work module because we want the individuals on the programme to apply what they have learnt back at work."
        },
        {
            "heading": 4,
            "text": "Pilot"
        },
        {
            "text": "We agreed that to kick off the pilot year, we would take on 12 individuals, equivalent to supporting 3% of our Grade 6/7 population and our goal is on track to increase the percentage in the next intake. "
        },
        {
            "text": "Coming up with a name was tricky but we settled on Leading for Success. We linked in with Civil Service HR to ensure that we have gone through the approved learning providers list, to avoid any duplication of the programme we were trying to create. The programme is funded by GDS through a centralised pot. We also designed an application process, created a sift criteria and created a comms plan about the new leadership programme."
        },
        {
            "heading": 4,
            "text": "Teething problems"
        },
        {
            "text": "We learned so much through the process of developing the leadership programme. Naturally there were teething problems but we were able to overcome several challenges and are keen to improve for the next cohort. "
        },
        {
            "text": "For example, the initial plan for the programme was to target only Grade 6s. However, presenting to the People Matter Board highlighted that we could potentially miss out on high performing Grade 7s. We had to rethink our approach and opened the applications to both Grade 6/7s. "
        },
        {
            "heading": 4,
            "text": "Leading for Success today!"
        },
        {
            "text": "We were excited to launch Leading for Success in June 2021 with a diverse cohort. The cohort has had their first module delivered in July, second module in September, with the third module on track to be delivered in early November. "
        },
        {
            "text": "We look forward to giving you an update this winter, hopefully from an individual who has been on the programme to convey their frank feedback."
        }
    ]
}