{
    "url": "https://gott.blog.gov.uk/2021/11/02/cop26-climate-change-special-climar-framework/",
    "title": "COP26 - Climate Change Special: CLIMAR Framework",
    "authors": [
        "Professor Gavin Shaddick",
        "Dr Kirstine Dale"
    ],
    "categories": [
        "Met Office",
        "University of Exeter"
    ],
    "pub_date": "2021-11-02T17:09:29+00:00",
    "content": [
        {
            "text": "The changing climate, and the requirement to transition to a low-carbon economy, mean businesses and governments will increasingly need access to decision-ready environmental information."
        },
        {
            "text": "The Joint Centre for Excellence in Environmental Intelligence (JCEEI) is a world-leading collaboration between the UK Met Office and the University of Exeter providing the expertise, skills and capability to fully utilise Artificial Intelligence (AI) in order to address the escalating threat of climate change."
        },
        {
            "text": "The Centre of Excellence builds on the South West region’s globally recognised strengths in environmental science and digital innovation. It works with partners to optimise environmental related decision-making, improve risk management and lead the UK towards a sustainable interaction with the natural environment and delivery of Net Zero – thus making it very important to a range of customers and sponsors within the UK (policy makers, businesses, and individuals)."
        },
        {
            "text": "In this article the co-Directors of the JCEEI, Professor Gavin Shaddick from the University of Exeter and Dr Kirstine Dale from the Met Office, discuss ‘CLIMAR’, the Centre’s revolutionary decision-making framework (Climate Impacts Mitigation, Adaption and Resilience). This framework uses data science and AI to integrate multiple sources of data to quantify and visualise the risks of climate change on populations, infrastructure and the economy."
        },
        {
            "text": "What is Environmental Intelligence?"
        },
        {
            "text": "Environmental Intelligence (EI) uses rapid advances in AI and computing to extract meaning and value from vast amounts of environmental data. This is done to transform the UK’s understanding of the complex interactions between the environment, climate, natural ecosystems, and human social and economic systems."
        },
        {
            "text": "EI will provide critical support to the global response to the effects of a changing climate on energy, food and water security, critical infrastructure, and health. It will transform the UK’s understanding of the future impacts of hotter and colder temperatures, flooding and drought on both people and their environment – ultimately saving lives and livelihoods."
        },
        {
            "text": "Revolutionising decision-making processes"
        },
        {
            "text": "Three factors, when combined, present an opportunity to deliver transformative EI technologies that will transform the UK’s ability to tackle some of the biggest challenges facing society: access to volumes of environmental data orders of magnitude greater than previously available; the development of data science and AI tools and skills to interrogate the data; and increasingly powerful computing and technical infrastructure."
        },
        {
            "text": "The CLIMAR framework estimates risks by looking at two data models. Firstly, it looks at models for climate related hazards, such as flooding, wind speeds and increased summer temperatures. It then looks at data models for assets, such as electricity substations, windfarms, roads and vulnerable members of the population, to understand their exposure to the hazard."
        },
        {
            "text": "For context, climate risks are determined by how vulnerable we, and our surroundings, are when exposed to climate-related hazards.  The risk of climate impact is the combination of three components: hazard; exposure; and vulnerability (as shown in the model below)."
        },
        {
            "text": "A schematic showing the integrated components of a climate impact risk "
        },
        {
            "text": "The CLIMAR framework creates decision-ready information in a form that is accessible to a range of audiences, including policy makers, industry and the public. Examples include:"
        },
        {
            "text": "This ability is going to be crucial across a wide variety of sectors in designing pathways to NetZero and enhancing the UK’s resilience to climate change."
        },
        {
            "text": "Please visit this YouTube video on CLIMAR for more information."
        },
        {
            "text": "A screenshot of the CLIMAR framework explained on YouTube   "
        },
        {
            "text": "Real-world applications"
        },
        {
            "text": "CLIMAR is currently being used in a range of real-world applications, including energy system security, telecommunications, critical infrastructure, water and sewage networks, and health."
        },
        {
            "text": "For further information, please see www.jceei.org"
        }
    ]
}