{
    "url": "https://deframedia.blog.gov.uk/2021/11/02/coverage-of-second-day-of-cop26/",
    "title": "Coverage of second day of COP26",
    "authors": [
        "Defra Press Office"
    ],
    "categories": [
        "Weekly stories"
    ],
    "pub_date": "2021-11-02T14:20:35+00:00",
    "content": [
        {
            "text": "On the second day of the climate change summit COP26, coverage focuses on key announcements from the World Leaders Summit on Forests and Land Use. More than 100 leaders will commit to halt and reverse forest loss and land degradation by 2030 today, in a pledge backed by almost £14 billion in public and private funding."
        },
        {
            "text": "The leaders represent over 85% of the world’s forests. The finance will support activities in developing countries, including restoring degraded land, tackling wildfires and supporting the rights of indigenous communities."
        },
        {
            "text": "There was widespread coverage in The Guardian, the Daily Mail ,  the BBC ,  The Independent, the The Telegraph, the Financial Times and Reuters."
        },
        {
            "text": "The Guardian also published an interview piece from Lord Goldsmith highlighting the importance of today’s news and the Prime Minister’s call for world leaders to commit to radical action to reverse deforestation."
        },
        {
            "text": "The Environment Secretary also featured on broadcast outlets including  BBC Radio Scotland, Sky News, Times Radio,  BBC Breakfast, and GMB."
        },
        {
            "text": "Lord Zac Goldsmith, International Environment Minister, UK, said:"
        },
        {
            "text": "The UK will commit £1.5bn over five years to support the forests pledge, including £350m for tropical forests in Indonesia, and £200m for the LEAF Coalition.The UK will also contribute £200m, alongside 11 other donors, as part of a new £1.1 billion ($1.5bn) fund to protect the Congo Basin. The area is home to the second-largest tropical rainforest in the world which is threatened by industrial logging, mining and agriculture."
        },
        {
            "text": "Follow Defra on Twitter, and sign up for email alerts here."
        }
    ]
}