{
    "url": "https://insidehmcts.blog.gov.uk/2021/11/02/exploring-misconceptions-about-the-single-justice-procedure/",
    "title": "Exploring misconceptions about the Single Justice Procedure",
    "authors": [
        "Siân Jones"
    ],
    "categories": [
        "Crime"
    ],
    "pub_date": "2021-11-02T11:00:49+00:00",
    "content": [
        {
            "text": "In an earlier blog, I explained what the Single Justice Procedure is and how it works. Here I want to explain the protections and safeguards in place to ensure this process adheres to the same principles that underpin the whole justice system."
        },
        {
            "heading": 3,
            "text": "What is the Single Justice Procedure?"
        },
        {
            "text": "To recap, prosecutors can decide to take a case through SJP. It allows them to deal with cases involving adult defendants accused of lesser offences that cannot result in a prison sentence."
        },
        {
            "text": "SJP has been in place for six years, but many of its procedures have been used for much longer under different legislation."
        },
        {
            "heading": 3,
            "text": "In-built protection"
        },
        {
            "text": "There are several levels of protection in SJP proceedings to ensure that justice is done and seen to be done:"
        },
        {
            "heading": 3,
            "text": "Making sure SJP is used for minor offences"
        },
        {
            "text": "SJP can only be used for summary, non-imprisonable, offences. The prosecutor, the legal adviser, and the magistrate would all have to make a really basic mistake for an offence that does not match these criteria to slip through."
        },
        {
            "text": "Even during COVID-19, when new, complex regulations were introduced quickly, mistakes were detected by magistrates, justices’ legal advisers, and prosecutors, and as a result cases wrongfully brought were dismissed."
        },
        {
            "heading": 3,
            "text": "Maintaining transparency"
        },
        {
            "text": "In practice, SJP proceedings can be more transparent and accessible than traditional proceedings."
        },
        {
            "text": "Although traditional proceedings are carried out in a public courtroom, very few people attend to observe them. The reality is that magistrates are sitting in a public courtroom, but effectively in private."
        },
        {
            "text": "In our media protocol, we set out an approach to circulating lists of SJP cases – but we know we have more to do to execute this consistently and are working to make improvements. A reporter can also request both the prosecution statements and the defendant’s representations. Previously they had to attend court in person and write everything down. The public can also ask for the outcome of any case – including SJP."
        },
        {
            "heading": 3,
            "text": "Single Justice Procedure notices"
        },
        {
            "text": "Summonses and requisitions have been served by post for well over 100 years – and SJP is no different. The defendant has 21 days to reply with their plea. After that, if they have not replied, the case will be heard by SJP. If the written evidence proves the charge beyond reasonable doubt, the magistrate convicts, and if it does not, they acquit. The protections outlined above allow for the defendant to declare that they did not receive the summons or appeal against the sentence."
        },
        {
            "heading": 3,
            "text": "Absent defendants"
        },
        {
            "text": "Courts have been dealing with defendants in absence since the 18th Century."
        },
        {
            "text": "Both in requisition procedure and under SJP there is no obligation on a defendant to attend court.  Legally courts must deal with defendants in their absence if they were aware of the proceedings and do not have a reasonable excuse for not attending (s. 11 Magistrates’ Courts Act 1980)."
        },
        {
            "text": "In general, courts can compel appearance by issuing a warrant, followed by police arresting the defendant and taking them to court in custody.  However, this wouldn’t be appropriate for the minor offences that SJP deals with. As a result, magistrates’ courts cannot force defendants to appear for these offences; defendants are free to choose whether to attend or not. Even if a warrant could be issued, it delays the proceedings, and if the police can’t find the defendant, the defendant evades justice."
        },
        {
            "heading": 3,
            "text": "An effective procedure"
        },
        {
            "text": "Checks and balances are in place to make sure SJP is fair and transparent.  As a modification of procedures that have in place for many years, sometimes centuries, SJP allows defendants, prosecutors and courts to reach a resolution to minor offences without having to attend court (unless they choose to do so). It saves time, resource and inconvenience for all involved, while also delivering justice."
        }
    ]
}