{
    "url": "https://mojdigital.blog.gov.uk/2021/11/02/my-path-to-becoming-a-senior-agile-delivery-manager/",
    "title": "My path to becoming a Senior Agile Delivery Manager",
    "authors": [
        "Amy Cufflin"
    ],
    "categories": [
        "a great place to work",
        "Agile",
        "Delivery Manager",
        "Our services"
    ],
    "pub_date": "2021-11-02T15:40:07+01:00",
    "content": [
        {
            "text": "I started out as a linguist. I remember when I was at school, whenever people would ask me what I wanted to do and my answer was “languages”, they always asked, “Oh, do you want to be a bilingual secretary?”. I could never understand why people’s imaginations were so limited (my answer was usually “no, but I might have a bilingual secretary”). So, language degree accomplished, but beginning to realise my superpower was actually organising stuff, I looked around to see what to do next and discovered there was such a thing as a Translations Project Manager. This seemed to perfectly merge the two, so off I went on my career. I spent 10 years at that, eventually running a small translation company, all during a period when the internet was just starting to exist. Out of necessity, I kept up with the opportunities presented by doing stuff digitally and did what was necessary to make the workflow as efficient as possible, learning a lot about IT along the way. "
        },
        {
            "text": "I moved into the digital world via multilingual Content Management at an online sports betting company, which in turn led to project management of software development projects in betting and gaming. I was always frustrated at the waterfall ways of doing things, so when I first heard about Agile, my world started to change."
        },
        {
            "text": "I just couldn’t get the concept of sprints, committing to a sprint backlog and protecting the team from additions to that backlog for a 2-week period to be accepted. I facilitated workshops to ensure new products and features started to be designed well in advance. But changing a whole organisation’s way of thinking is not a quick or easy task, even in a small company like that one. I learned that for this stuff to work, the senior leaders need to be bought into it and championing the change alongside you."
        },
        {
            "text": "Fast forward a number of years to spring 2019, when I joined HMPPS Digital. By this time, I had been working in organisations that had formally adopted Agile, but none of them quite to the extent that we have here.  We have real multidisciplinary agile teams delivering services following GDS guidelines, with the autonomy to do the work to understand users’ needs and solve their problems. We are supported by senior leadership, who are as agile as the teams (by this time I had also learned that agile is something you are, not something you do).  Although I’d like to say the environment is one where Delivery Managers and their teams are encouraged not to be afraid to fail/learn, I think we’re still working on that. But it’s something we’re actively working towards and I’m sure will come soon. "
        },
        {
            "text": "We have a Community of Practice, where Delivery Managers come together every week to share and learn from each other.  On top of that, I work condensed and flexible hours, which is pretty standard for many roles in Digital. Taking learning and development time is actively encouraged and supported, be that time to read books/websites about DM techniques, watch tutorials and talks, or attend a conference or training course.  These are some of the things that, for me, make the MoJ a special place to be a DM. "
        }
    ]
}