{
    "url": "https://rpc.blog.gov.uk/2021/11/02/rpc-corporate-report-2021/",
    "title": "RPC Corporate Report 2021",
    "authors": [
        "Stephen Gibson"
    ],
    "categories": [
        "Better regulation",
        "Independent scrutiny"
    ],
    "pub_date": "2021-11-02T15:03:02+00:00",
    "content": [
        {
            "text": "We have today published the RPC’s Corporate Report summarising our activity over the year from April 2020 to March 2021."
        },
        {
            "text": "The year saw much Government regulatory activity in response to the Covid pandemic. Because much of this was temporary (at least when introduced), it was exempt from the Better Regulation Framework and so submission of Impact Assessments to the RPC was not required. As a result, the number of cases we considered during the year was lower than in previous years. It also means that many of the most significant regulations introduced by government have not been subject to independent scrutiny and are not included in the Business Impact Target – a point that we made in our Blog post on the scope of the Better Regulation Framework and in our response to the Government’s consultation on reforming the BRF."
        },
        {
            "text": "I am pleased that we can report improvements both in our delivery of opinions to our target deadline (up to 92% from 89% the previous year) and in the quality of the impact assessments and other submissions we received (83% were fit for purpose as first submitted, up from 74% in the year before)."
        },
        {
            "text": "In operational terms, we found ourselves working from home for the entire year. As I say in the foreword, I have been very impressed by the way both the members of the committee and our secretariat responded to this challenge. I believe we have delivered our responsibilities every bit as effectively as if we had been operating in more normal times – with the possible exception of our international engagement work which was heavily impacted by the travel restrictions."
        },
        {
            "text": "Alongside the report for last year, we have published our business plan for the current year (April 2021 to March 2022). It is worth noting however that we are currently waiting to hear what the Government proposes for the future of the better regulation framework following the consultation mentioned above (which closed on 1st October). That is likely to require some adjustment of our objectives and future plans. We will be offering some initial views on the proposals as soon as they are announced."
        },
        {
            "text": "If you have any comments or thoughts, either on our work or on how we might improve this report for the future, we would be pleased to hear them. Please either comment below or email us at regulatoryenquiries@rpc.gov.uk."
        }
    ]
}