{
    "url": "https://defradigital.blog.gov.uk/2021/11/23/celebrating-success-with-our-technology-innovation-team/",
    "title": "Celebrating success with our Technology Innovation team",
    "authors": [
        "Tony Riggs"
    ],
    "categories": [
        "Defra digital",
        "Defra Science and Innovation",
        "Digital transformation"
    ],
    "pub_date": "2021-11-23T12:49:33+00:00",
    "content": [
        {
            "text": "Our team’s role is to help the Defra group make the most of new digital technologies, which we do through identifying relevant technologies and enabling our business colleagues to practically explore business opportunities through these. Our work, delivered through collaboration with key technology partners, has recently been recognised for pushing boundaries and using emerging technologies to bring positive change.We recently received accolades for two of our exploration initiatives. Firstly, our proof-of-concept with Forestry Commission Forest Research colleagues and our technology partner Vodafone, which explored the use of emerging Internet of Things (IoT) technologies to remotely monitor how effective trees in forests are at absorbing carbon dioxide. This work, which answered very pressing questions in the world of forestry science regarding climate change, has won the National Technology Award – ‘Tech for Good’ 2021."
        },
        {
            "text": "It has practically proven that it’s now possible to do this kind of remote monitoring, with new IoT technologies enabling us to reach remote locations – by overcoming the technical and cost constraints that prevented us from doing so in the past."
        },
        {
            "heading": 2,
            "text": "It's about more than trees"
        },
        {
            "text": "It’s important for forest trees, but it’s important for much more - as the IoT technologies can be used to extend Defra group’s monitoring to anything in the environment that has previously been out of reach. This innovative initiative has been widely reported in the press (googling will link to many articles!). A useful overview can also be found here."
        },
        {
            "text": "The potential to make use of this IoT technology is huge, enabling us to increase the scale of our monitoring, including finally being able to get to those locations that have been impossible to get to and providing significantly more data for supporting policymaking and our operations."
        },
        {
            "text": "We are already expanding our practical exploration to monitor natural flood defences (to better understand flood risks) and the movement of trees ‘blowing in the wind’ (to better understand the risk of falling or loose branches). The second example is our proof of concept with Environment Agency colleagues, and our technology partner Atos, to practically explore high performance compute (HPC) technology for speeding up flood modelling. This work was shortlisted for the Responsible Business Alliance Compass 2021 Awards - 'Innovation' Category."
        },
        {
            "text": "During a flood incident it’s critical (given the huge risks to life and property) to be able to predict as quickly as possible what might happen, and therefore anything that can speed up the computer modelling is really valuable."
        },
        {
            "heading": 2,
            "text": "Going beyond the practical"
        },
        {
            "text": "The work practically showed how HPC technology (the tech used – just facilities) could be used to significantly speed up the processing time required to run some specific large complex flood models not currently used for supporting incidents. The findings of the proof-of-concept work are feeding into the Environment Agency’s current strategic work on defining its modelling capability."
        },
        {
            "text": "The team is delighted with this news, and want to thank our Forest Research, Environment Agency, Vodafone, and Atos colleagues for being such positive partners in delivering these innovative initiatives."
        },
        {
            "text": "It’s obviously nice to be nominated, and sometimes even win, innovation awards for our work - but that’s not our goal. Our goal, as I said at the start, is to help Defra group make the most of new digital technologies, and it’s probably worth me pointing out the key common aspects essential for doing this successfully:"
        },
        {
            "text": "Find out more about our work."
        },
        {
            "text": "Check out our Emerging Technology Radar on YouTube."
        }
    ]
}