{
    "url": "https://teaching.blog.gov.uk/2021/11/23/celebrating-excellence-in-education-and-recognising-the-amazing-work-of-teachers/",
    "title": "Celebrating excellence in education and recognising the amazing work of teachers",
    "authors": [
        "Kirsty Gaythwaite",
        "Paul Phillips"
    ],
    "categories": [
        "Inspiring teachers"
    ],
    "pub_date": "2021-11-23T16:29:53+00:00",
    "content": [
        {
            "text": "Kirsty Gaythwaite and Dr Paul Philips were both Gold Award winners at last year's National Teaching Awards. Kirsty is a maths teacher at Goodwin Academy and was awarded Outstanding New Teacher of the Year. Paul is Principal at Weston College and was recognised for Lifetime Achievement. We asked them both what it was like to win an award and to share any advice they have for those in the profession."
        },
        {
            "text": "How did it feel to win a Gold Award?"
        },
        {
            "text": "Kirsty: There are no words to describe how I felt when I found out that I had won the Gold Award for Outstanding New Teacher of the Year; I was genuinely speechless. The influx of messages, emails and phone calls I received that evening were overwhelming - from old friends, colleagues, family members and even complete strangers. I spent the rest of the evening feeling emotional and full of pride. I had won a national award! An award for simply doing what I love - teaching! It’s a privilege not only to help shape my students’ success but to also mentor student teachers and help them be the best they can be."
        },
        {
            "text": "Paul: Finding out that I had won the Gold Award was one of the most unique events in my life. To hear it announced on the One Show and to moreover receive it for my leadership in Further Education came as a massive surprise, but I also felt elated for all the talented staff and learners I have had the pleasure to work with over my career. It was a privilege to be among such esteemed company – the passion, the hunger from my fellow winners to achieve greatness for all their learners, is remarkable. I would really encourage those who know people making a difference to the lives of young people to enter the awards - there are awards for innovation, excellence and being that bit unique and it was a delight to be part of such a special celebration."
        },
        {
            "text": "Can you share any advice for teachers or leaders?"
        },
        {
            "text": "Kirsty: As a new teacher it’s important is to reflect, as this will help you recognise your strengths, as well as areas for development that will allow you grow and improve. I’d also encourage you to talk to colleagues about how you’re feeling or anything you are worried about. They can listen, provide advice and, most importantly, relate. Lastly, prioritisation is key. Consider what tools and techniques you can use to manage your time and reduce workload where possible. Your own wellbeing should be a priority, as well as that of your students."
        },
        {
            "text": "Paul: Achieving the award has reinforced my belief in strong leadership and the need to do even more for learners with learning difficulties and disabilities. The one thing I tell all my leadership team is to look beyond expectations, believe in the impossible and that we excel when a learner, who others had given up on, becomes one of our success stories. Contributing to that transformation of a student is really meaningful."
        },
        {
            "text": "What do you do to set your students up for success?"
        },
        {
            "text": "Kirsty: I try to foster a strong sense of self-belief in the students I teach and be a positive presence in and outside the classroom. I also work hard to develop their resilience, helping them to recognise that it is ok to make mistakes and often these are opportunities to learn. Also, I remind them to reward themselves for achievements - even if it’s something small - like finishing a piece of work or grasping a new concept."
        },
        {
            "text": "Paul: I believe staff and learners need to feel empowered, if they are to realise their goals. There are many ways to achieve success but for me, focusing on careers not courses is key. I have established individual Career Excellence Hubs to link learners and their teachers to industries and employers. It’s different, and it stretches all concerned. Suddenly there is a vibrancy, a hunger to succeed and we can help them exceed their own expectations through these joint projects, with innovative and proven support."
        },
        {
            "text": " "
        },
        {
            "text": "The National Teaching Awards recognise and celebrate excellence in education. Watch the moment when Kirsty found out she had won a Gold Award in 2020."
        },
        {
            "text": "This years Gold Award winners will be announced on the BBC One Show from 22nd-26th November, and you can read about the Silver Award winners on the Teaching Awards website."
        },
        {
            "text": " "
        }
    ]
}