{
    "url": "https://hmlandregistry.blog.gov.uk/2021/11/23/customers-support-time-saving-form-rxc/",
    "title": "Customers support time-saving form RXC",
    "authors": [
        "Pascal Lalande, Central Operations Manager"
    ],
    "categories": [
        "Law and practice"
    ],
    "pub_date": "2021-11-23T10:35:24+00:00",
    "content": [
        {
            "text": "Following customer feedback we have just published version 2 of our form RXC. And we’re delighted to hear some of our biggest customers are adopting the form and embedding it into their own systems."
        },
        {
            "text": "Christine Walsh, Post Completions Manager at Stockport-based O’Neill Patient Solicitors LLP, said: “We are incorporating [form RXC] into our case management system as it will mean we can automate the form for signature, therefore freeing up time for the case managers to deal with other aspects of their files. This will help with the reduction of requisitions.”"
        },
        {
            "text": "Requisitions – or requests for information – cause extensive delays both to conveyancing and registration times, and compliance with a restriction in the register is one of the main reasons for raising a point.  For example, between 1 October 2020 and 31 October 2021 more than 1 million applications received a requisition in relation to restrictions, with more than 134,000 points raised for one of 60 reasons."
        },
        {
            "text": "It’s why we devised the form RXC and why it’s good to know it is helping our customers."
        },
        {
            "heading": 2,
            "text": "What prompted an updated version? "
        },
        {
            "text": "At HM Land Registry, we really appreciate feedback from our customers about all aspects of our services. Recently, we’ve used this feedback to help us make changes to form RXC."
        },
        {
            "text": "Form RXC (RX=restriction; c=consent/certificate) is a new way to provide a consent or certificate to comply with a restriction in the register and has been available to our customers since the end of July 2021."
        },
        {
            "text": "In September, we held a series of popular webinars to introduce form RXC. If you missed them, a recording is available on GOV.UK. This gave us the chance to hear first-hand what you, our customers, thought of the form and how we could improve it. We have also had a good response to our request for feedback through our online blogs."
        },
        {
            "text": "Thanks to this, we have made some improvements to the form and a new version is now available."
        },
        {
            "heading": 2,
            "text": "What’s changed and why"
        },
        {
            "text": "You told us:"
        },
        {
            "heading": 2,
            "text": "What’s next?"
        },
        {
            "text": "We hope these changes will enable more customers to follow O’Neill Patient’s lead and adopt form RXC, which makes the process of complying with the terms of a restriction easier for everyone involved."
        },
        {
            "text": "The form will continue to evolve based on customer feedback, which you can provide by completing our short survey."
        }
    ]
}