{
    "url": "https://food.blog.gov.uk/2021/11/23/path-safe-tracking-foodborne-pathogens-and-antimicrobial-resistant-microbes/",
    "title": "PATH-SAFE: Tracking foodborne pathogens and antimicrobial-resistant microbes",
    "authors": [
        "Eva Scholtus, Head of Policy and Engagement, Microbiology Society",
        "Dr Emily Parr, Policy and Engagement Manager, Microbiology Society"
    ],
    "categories": [
        "Foodborne disease",
        "Science"
    ],
    "pub_date": "2021-11-23T18:06:58+00:00",
    "content": [
        {
            "text": "Cymraeg"
        },
        {
            "text": "To mark the end of World Antibiotic Awareness Week, Eva Scholtus and Emily Parr from the Microbiology Society discuss our collaborative workshop series as part of the Pathogen Surveillance in Agriculture, Food and the Environment (PATH-SAFE) programme."
        },
        {
            "text": " "
        },
        {
            "text": "In October 2021, the Microbiology Society and the Food Standards Agency (FSA) hosted a series of online focus groups as part of a new cross-government programme in Pathogen Surveillance in Agriculture, Food and the Environment (PATH-SAFE) to track foodborne pathogens and antimicrobial resistant (AMR) microbes in all four nations of the UK."
        },
        {
            "text": "To mark the end of World Antimicrobial Awareness Week (WAAW), we take a look back at those events and present PATH-SAFE in more detail. PATH-SAFE aims to pilot a national genomic surveillance infrastructure, harnessing existing data and undertaking new sampling and analysis in order to create a national ‘map’ of pathogen and AMR populations, allowing for rapid identification and tracking of disease outbreaks."
        },
        {
            "text": " "
        },
        {
            "heading": 2,
            "text": "The PATH-SAFE project"
        },
        {
            "text": "Foodborne diseases are a major public health risk for both humans and animals. The majority of human disease is caused by a handful of pathogens that, in most cases, enter the food chain from farmed animals or the environment. In addition, the agri-food supply chain also poses a risk for the transmission of AMR as it is transmitted through food, animals, humans, or water. The combined threat of foodborne and AMR pathogens will create an even bigger problem for the food chain and so these threats need to be investigated together.  "
        },
        {
            "text": "Recent advances in technology and data management offer the opportunity to create a new surveillance system to protect public health. This PATH-SAFE pilot project aims to significantly improve existing surveillance activities by testing if new technologies such as whole-genome sequencing and a national sampling database can make the diagnosis of pathogens more accurate, more rapid and more efficient."
        },
        {
            "text": "A key element of the project is to involve, from the very beginning, experts in microbial genomics to guide early development and priority setting for the PATH-SAFE project. We convened 40 experts across academia, industry and government over a three-day virtual workshop series to discuss the challenges and opportunities for data curation, sampling and sequencing, and remote diagnostics of foodborne and AMR pathogens."
        },
        {
            "text": "Here, we share the main take-home messages from the week."
        },
        {
            "text": "Read the video transcript for PATH-SAFE introduction from Professor Robin May."
        },
        {
            "text": "Professor Robin May is the FSA’s Chief Scientific Adviser."
        },
        {
            "heading": 2,
            "text": "Data curation"
        },
        {
            "text": "The data curation focus group, co-chaired by Professor Sharon Peacock and Dr Colman O’Cathail, aimed to explore how to build a new database that can allow for the analysis, storage and sharing of pathogen sequence and source data, collected from multiple locations across the UK by both government and public organisations."
        },
        {
            "text": "Read the video transcript for PATH-SAFE Data curation by Dr Colman O’Cathail."
        },
        {
            "text": "Dr Colman O’Cathail is a Bioinformatician at the European Bioinformatics Institute and Chair of the Early Career Microbiologists’ Forum Executive Committee at the Microbiology Society."
        },
        {
            "text": "Professor Nick Loman, Professor of Microbial Genomics and Bioinformatics at the University of Birmingham and a COG-UK Principal Investigator, kicked off this discussion with a talk about CLIMB (Cloud Infrastructure for Microbial Bioinformatics), and how it was used during the COVID-19 pandemic to integrate SARS-CoV-2 viral genomes. Interestingly, many of the learnings from this platform during the last 18 months could be applied to the farm-to-fork database. However, the PATH-SAFE project will tackle new challenges such as the diversity of pathogens captured and the different environmental sources."
        },
        {
            "text": "Attendees also discussed the data fields that will need to be inputted, how to ensure quality and how to store and analyse the data. They explored ways to link together different datasets, how to make these datasets easily accessible and ensure that a government-led system is effectively used by academics and other stakeholders."
        },
        {
            "text": "The overriding impression from the focus group was that many of the ideas and expertise for data curation for the PATH-SAFE database are already available. One of the main challenges will be creating the user-friendly dashboard, as integrating data that can easily be used by a range of different end-users can be difficult."
        },
        {
            "text": "Professor Robin May highlighted that the real legacy for this database will be building the community which can help keep the project going."
        },
        {
            "heading": 2,
            "text": "Sampling and sequencing"
        },
        {
            "text": "The following day, Dr Alison Mather, Dr Andrew Page and Dr Aimee Murray co-chaired a focus group on ‘how data can be sampled and sequenced’ to feed into the database. The discussion revolved around which foodborne pathogens should be monitored, which scenarios should be considered to monitor the incidence and spread of diseases, and how environmental sampling should be tackled."
        },
        {
            "text": "Dr Aimee Murray is a Lecturer in Microbiology researching the evolution and ecology of antimicrobial resistance at the University of Exeter."
        },
        {
            "text": "The main takeaway from this focus group was that sampling and sequencing data is complex and it is best to choose a starting point that can be refined at a later stage in the project. There was a consensus around focusing on specific environments, such as screening abattoirs, rather than on specific named pathogens."
        },
        {
            "text": "Attendees also highlighted that the two parallel strands for the project, foodborne pathogens and AMR, are different challenges, since tracking foodborne pathogens relies on mapping specific isolates whilst AMR concerns focus on genetic elements which can often be mobile and hard to track."
        },
        {
            "text": "It was interesting to hear attendees highlighting examples of projects that have developed surveillance systems in localised areas. Attendees suggested that piggybacking on some of the existing programmes as well as incorporating new techniques will be valuable for the project."
        },
        {
            "heading": 2,
            "text": "Remote diagnostics"
        },
        {
            "text": "The final day, co-chaired by Professor Neil Boonham and Dr Natalie Ring, tackled the benefits and pitfalls of remote diagnostic technologies, particularly looking at in-field technologies. This focus group looked at what is available currently rather than what might be available in the future."
        },
        {
            "text": "Dr. Natalie Ring is a postdoctoral research fellow at the Roslin Institute at the University of Edinburgh."
        },
        {
            "text": "Attendees discussed the viability of in-field technology both from a technical and operational point of view. One of the main technical issues raised was sample isolation and preparation, as DNA extraction is the current limiting step for in-field diagnostics, while sequencing is easier. Attendees also considered the possibility of setting up regional infrastructure, to help deliver surveillance for a range of different public health agencies."
        },
        {
            "text": "Overall, attendees agreed that the deployment of technologies requires a range of stakeholders, and it is crucial to determine where the benefits lie for them to ensure buy-in. The consensus was that the technology is currently not yet ready for deployment. However, in order to deploy in-field diagnostics in the future, early engagement with stakeholders is essential."
        },
        {
            "heading": 1,
            "text": "PATH-SAFE: Olrhain pathogenau  a gludir gan fwyd a microbau sydd ag ymwrthedd gwrthficrobaidd."
        },
        {
            "text": "I nodi diwedd Wythnos Ymwybyddiaeth Gwrthfiotigau Fyd-eang, mae Eva Scholtus ac Emily Parr o’r Gymdeithas ar gyfer Microbioleg yn trafod ein cyfres o weithdai cydweithredol fel rhan o’r rhaglen Cadw Gwyliadwriaeth ar Bathogenau mewn Amaethyddiaeth, Bwyd a’r Amgylchedd (PATH-SAFE)."
        },
        {
            "text": " "
        },
        {
            "text": "Ym mis Hydref 2021, fe wnaeth y Gymdeithas ar gyfer Microbioleg a’r Asiantaeth Safonau Bwyd (ASB) gynnal cyfres o grwpiau ffocws fel rhan o raglen draws-lywodraeth ym maes Cadw Gwyliadwriaeth ar Bathogenau mewn Amaethyddiaeth, Bwyd a’r Amgylchedd (PATH-SAFE) a microbau sydd ag ymwrthedd gwrthficrobaidd (AMR) ym mhob un o bedair gwlad y DU."
        },
        {
            "text": "I nodi diwedd Wythnos Ymwybyddiaeth Wrthficrobaidd Fyd-eang (WAAW), rydym yn bwrw golwg yn ôl dros y digwyddiadau hynny a chyflwyno PATH-SAFE mewn mwy o fanylder. Nod PATH-SAFE yw treialu seilwaith gwyliadwraeth genomig cenedlaethol, gan harneisio data cyfredol ac ymgymryd â samplu newydd er mwyn creu ‘map’ cenedlaethol o’r poblogaethau pathogenau a microbau sydd ag ymwrthedd gwrthficrobaidd. Bydd yn galluogi nodi ac olrhain brigiadau achosion o glefydau yn gyflym."
        },
        {
            "heading": 2,
            "text": "Y prosiect PATH-SAFE"
        },
        {
            "text": "Mae afiechydon a gludir gan fwyd yn risg fawr i iechyd y cyhoedd ac anifeiliaid fel ei gilydd. Mae’r mwyafrif o glefydau dynol wedi’u hachosi gan ddyrnaid o bathogenau, sydd, yn y rhan fwyaf o achosion, yn mynd i mewn i’r gadwyn fwyd trwy anifeiliaid a ffermir neu drwy’r amgylchedd.  Yn ogystal, mae’r gadwyn gyflenwi bwyd-amaeth hefyd yn peri risg o ran trosglwyddo microbau ag ymwrthedd gwrthficrobaidd, gan eu bod yn cael eu trosglwyddo trwy fwyd, anifeiliaid, pobl, neu ddŵr. Bydd bygythiad deublyg pathogenau a gludir gan fwyd a phathogenau ag ymwrthedd gwrthficrobaidd yn creu problem fwy byth i’r gadwyn fwyd, felly dyma fygythiadau mae angen ymchwilio iddynt gyda’i gilydd."
        },
        {
            "text": "Mae datblygiadau diweddar mewn technoleg a rheoli data yn cynnig cyfle i greu system wyliadwriaeth newydd i ddiogelu iechyd y cyhoedd. Nod y prosiect peilot PATH-SAFE hwn yw gwella gweithgareddau gwyliadwriaeth presennol yn sylweddol trwy brofi a all technolegau newydd fel dilyniannu genom cyfan a chronfa ddata samplu genedlaethol wneud diagnosis pathogenau yn fwy cywir, yn gyflymach ac yn fwy effeithlon."
        },
        {
            "text": "Elfen allweddol o'r prosiect yw cynnwys, o'r cychwyn cyntaf, arbenigwyr mewn genomeg ficrobaidd i arwain datblygu cynnar a gosod blaenoriaethau ar gyfer y prosiect PATH-SAFE. Gwnaethom gynnull 40 o arbenigwyr ar draws y byd academaidd, y diwydiant a'r llywodraeth dros gyfres gweithdai rhithwir dri diwrnod i drafod yr heriau a'r cyfleoedd ar gyfer curadu data, samplu a dilyniannu, a diagnosteg o bell ar gyfer pathogenau a gludir gan fwyd ac AMR. Yma, rydym yn rhannu’r prif negeseuon i’w cymryd o’r wythnos hon."
        },
        {
            "text": "Darllenwch y trawsgrifiad fideo ar gyfer y cyflwyniad i PATH-SAFE gan yr Athro Robin May."
        },
        {
            "text": "Yr Athro Robin May yw Prif Gynghorydd Gwyddonol yr ASB."
        },
        {
            "heading": 2,
            "text": "Curadu data"
        },
        {
            "text": "Nod y grŵp ffocws curadu data, dan gadeiryddiaeth yr Athro Sharon Peacock a Dr Colman O'Cathail, oedd archwilio sut mae adeiladu cronfa ddata newydd a all galluogi dadansoddi, storio a rhannu dilyniant pathogen a data’r ffynhonnell, wedi’u casglu o sawl lleoliad ar draws y DU gan y llywodraeth a sefydliadau cyhoeddus."
        },
        {
            "text": "Darllenwch y trawsgrifiad fideo ar gyfer curadu data PATH-SAFE gan Dr Colman O’Cathail."
        },
        {
            "text": "Mae Colman O'Cathail yn Biowybodwr yn Sefydliad Biowybodeg Ewrop, ac yn Gadeirydd Pwyllgor Gweithredol Fforwm Microbiolegwyr Gyrfa-Gynnar y Gymdeithas ar gyfer Microbioleg. Darganfyddwch ragor am waith Colman yma."
        },
        {
            "text": "Dechreuodd yr Athro Nick Loman, Athro Genomeg Ficrobaidd a Biowybodeg ym Mhrifysgol Birmingham a Phrif Ymchwilydd COG-UK, y drafodaeth hon gyda sgwrs am CLIMB (Seilwaith Cwmwl ar gyfer Biowybodeg Ficrobaidd), a sut y cafodd ei ddefnyddio yn ystod y pandemig COVID-19 i integreiddio genomau feirysol SARS-CoV-2. Yn ddiddorol, gallai llawer o'r hyn a ddysgwyd gan y platfform hwn yn ystod yr 18 mis diwethaf gael ei gymhwyso at y gronfa ddata o’r fferm i’r fforc. Fodd bynnag, bydd y prosiect PATH-SAFE yn mynd i’r afael â heriau newydd fel amrywiaeth y pathogenau a ddelir a'r gwahanol ffynonellau amgylcheddol."
        },
        {
            "text": "Bu'r cyfranogwyr hefyd yn trafod y meysydd data y bydd angen eu mewnbynnu, sut mae sicrhau ansawdd a sut mae storio a dadansoddi'r data. Fe wnaethant archwilio ffyrdd o gysylltu gwahanol setiau data, sut mae gwneud y setiau data hyn yn hygyrch, a sicrhau bod system a arweinir gan y llywodraeth yn cael ei defnyddio'n effeithiol gan academyddion a rhanddeiliaid eraill."
        },
        {
            "text": "Yr argraff bwysicaf a gafwyd gan y grŵp ffocws oedd bod llawer o'r syniadau a'r arbenigedd ar gyfer curadu data ar gyfer cronfa ddata PATH-SAFE eisoes ar gael. Un o'r prif heriau fydd creu'r dangosfwrdd hawdd ei ddefnyddio, oherwydd gall integreiddio data y gellir ei ddefnyddio'n rhwydd gan ystod o wahanol ddefnyddwyr terfynol fod yn anodd. Amlygodd yr Athro Robin May, Prif Gynghorydd Gwyddonol yr ASB, taw gwir waddol y gronfa ddata hon fydd adeiladu'r gymuned a all helpu i gadw'r prosiect i fynd."
        },
        {
            "heading": 2,
            "text": "Samplu a dilyniannu"
        },
        {
            "text": "Y diwrnod canlynol, cyd-gadeiriodd Dr Alison Mather, Dr Andrew Page a Dr Aimee Murray grŵp ffocws ar 'sut y gellir samplu a dilyniannu data' i’w fwydo i'r gronfa ddata. Roedd y drafodaeth yn ymwneud â pha bathogenau a gludir gan fwyd y dylid eu monitro, pa sefyllfeydd y dylid  eu hystyried i fonitro nifer yr achosion a lledaeniad afiechydon, a sut y dylid mynd i'r afael â samplu amgylcheddol."
        },
        {
            "text": "Mae Dr Aimee Murray yn Ddarlithydd mewn Microbioleg ym Mhrifysgol Caerwysg sy'n ymchwilio i esblygiad ac ecoleg ymwrthedd gwrthficrobaidd. Darganfyddwch ragor am waith Aimee yma."
        },
        {
            "text": "Prif gasgliad y grŵp ffocws hwn oedd bod samplu a dilyniannu data yn gymhleth, ac mae’n well dewis man cychwyn y gellir ei fireinio ar gam diweddarach yn y prosiect. Cafwyd consensws ynghylch canolbwyntio ar amgylcheddau penodol, fel lladd-dai sgrinio, yn hytrach nag ar bathogenau penodol a enwir. Amlygodd cyfranogwyr hefyd fod y ddau edefyn cyfochrog ar gyfer y prosiect, sef pathogenau a gludir gan fwyd ac AMR, yn heriau gwahanol, gan fod olrhain pathogenau a gludir gan fwyd yn ddibynnol ar fapio arunigiadau penodol tra bo AMR yn canolbwyntio ar elfennau genetig a all yn aml fod yn symudol ac yn anodd eu holrhain."
        },
        {
            "text": "Roedd yn ddiddorol clywed cyfranogwyr yn tynnu sylw at enghreifftiau o brosiectau sydd wedi datblygu systemau gwyliadwriaeth mewn ardaloedd lleol. Awgrymodd y cyfranogwyr y bydd neidio ar gefn rhai o'r rhaglenni cyfredol ynghyd ag ymgorffori technegau newydd yn werthfawr i'r prosiect."
        },
        {
            "heading": 2,
            "text": "Diagnosteg o bell"
        },
        {
            "text": "Aeth y diwrnod olaf, dan gadeiryddiaeth yr Athro Neil Boonham a Dr Natalie Ring, i'r afael â buddion a pheryglon technolegau diagnosteg o bell, gan edrych yn benodol ar dechnolegau yn y maes. Edrychodd y grŵp ffocws hwn ar yr hyn sydd ar gael ar hyn o bryd yn hytrach na'r hyn a allai fod ar gael yn y dyfodol."
        },
        {
            "text": "Mae Natalie Ring yn gymrawd ymchwil ôl-ddoethurol yn Sefydliad Roslin ym Mhrifysgol Caeredin. Darganfyddwch ragor am waith Natalie yma."
        },
        {
            "text": "Trafododd y cyfranogwyr hyfywedd technoleg yn y maes o safbwynt technegol a gweithredol. Un o'r prif faterion technegol a godwyd oedd arunigo a pharatoi sampl, gan taw echdynnu DNA yw'r cam cyfyngu cyfredol ar gyfer diagnosteg yn y maes, tra bod dilyniannu yn haws. Ystyriodd y cyfranogwyr hefyd y posibilrwydd o sefydlu seilwaith rhanbarthol, i helpu i ddarparu gwyliadwriaeth ar gyfer ystod o wahanol asiantaethau iechyd y cyhoedd."
        },
        {
            "text": "Ar y cyfan, cytunodd y cyfranogwyr bod angen ystod o randdeiliaid ar gyfer gosod technolegau, ac mae'n hanfodol penderfynu ble mae'r buddion iddyn nhw er mwyn sicrhau eu bod yn ymrwymo. Y consensws oedd nad yw'r dechnoleg yn barod i'w defnyddio ar hyn o bryd. Fodd bynnag, er mwyn defnyddio diagnosteg yn y maes yn y dyfodol, mae'n hanfodol ymgysylltu'n gynnar â rhanddeiliaid."
        }
    ]
}