{
    "url": "https://naturalengland.blog.gov.uk/2021/11/23/the-environment-act-2021-a-turning-point-for-nature/",
    "title": "The Environment Act 2021 – a turning point for Nature",
    "authors": [
        "Tony Juniper"
    ],
    "categories": [
        "Biodiversity",
        "Environment Act",
        "Natural Capital",
        "Nature Recovery Network"
    ],
    "pub_date": "2021-11-23T10:33:04+00:00",
    "content": [
        {
            "text": "By Tony Juniper, Chair of Natural England"
        },
        {
            "text": "In years to come we might well look back on November 2021 as a turning point in our relationship with Nature. It will be remembered as the month when the UK helped to forge commitments at COP26 that we hope, with the goodwill and action of the governments involved, will give us a chance of limiting the global temperature increase to 1.5C. Perhaps even more than that, though, COP resulted in world leaders seeing Nature in a new light – as an essential part of the drive to tackle climate change through Nature-based solutions such as sustainable farming and reducing deforestation."
        },
        {
            "text": "In England, November 2021 also saw the very welcome addition to the statute book of a new Environment Act, the most ground-breaking piece of environmental legislation in many years. For the first time this Act will set clear statutory targets for the recovery of the natural world in four priority areas: air quality, biodiversity, water and waste, and includes an important new target to reverse the decline in species abundance by the end of 2030. It sets in law new tools that Natural England and others can use to help meet those targets, which will at last enable us to lift the grim graphs of species decline upward towards a Nature-positive 2030."
        },
        {
            "text": "With such transformational potential, it really does change the context in which we work and means the 25 Year Environment Plan can move from ambition to reality as the first statutory Environmental Improvement Plan. The inclusion of five Environmental Principles in the Act (namely integration, prevention, rectification at source, polluter pays and precautionary), and the need for all Government Ministers to consider them when making policy, will help increase the opportunities for Nature recovery across Government."
        },
        {
            "text": "There will also be a new Office for Environmental Protection. Natural England very much welcomes the formation of this new body and we are already developing an open, collaborative working relationship to help further our joint goals of environmental protection and improvement. The Act will also enable reform of the Habitats Regulations following public consultation. We will be closely involved in this process, helping to ensure that any revised regime is able to go beyond protection and to also support the restoration of Nature."
        },
        {
            "text": "Natural England is proud to have played an important part in shaping the Act since its inception. We are continuing to work with Defra and other Government Departments on developing the targets and drafting the statutory guidance that underpins the enhanced NERC (biodiversity reporting) duty on public authorities, Local Nature Recovery Strategies, the power to create protected site and species conservation strategies and the whole new system for biodiversity net gain. The latter will require developers to ensure an increase in biodiversity through their projects, and Natural England is pleased to see it extended to include Nationally Significant Infrastructure Project developments and the marine environment."
        },
        {
            "text": "These measures will give us a great opportunity to develop even closer relationships with our partners as we work together to restore Nature at a landscape and local scale. For example, Natural England is working with Defra, local authorities and place-based stakeholders such as the Wildlife Trusts to deliver Local Nature Recovery Strategies which will help deliver Nature recovery within a national framework. We are helping develop the use of Conservation Covenants and will  apply to become a responsible body, enabling us to enter into voluntary agreements with landowners to conserve their land’s natural or heritage features for the long-term."
        },
        {
            "text": "With these additional tools and strengthened relationships we can do even more to establish a Nature Recovery Network that creates new places for Nature, linking up our best wildlife sites and bringing new ones much closer to places where people live."
        },
        {
            "text": "Alongside a new farming policy and renewed ambition for our protected landscapes, the new Act is a powerful piece of legislation containing many of the measures that the environment sector has been seeking for some time. At this turning point for Nature, however, it is important to remember that the law is but one tool that will enable us to achieve Nature recovery, and alongside that will be the essential partnerships that in the end will be vital to the progress that we must make during the years ahead."
        }
    ]
}