{
    "url": "https://digitalpeople.blog.gov.uk/2024/11/22/2024-interns-natalia-sienkiewicz/",
    "title": "2024 Interns - Natalia Sienkiewicz",
    "authors": [
        "Natalia Sienkiewicz, Intern, CDDO"
    ],
    "categories": [
        "Apprenticeships and internships",
        "Diversity and Inclusion",
        "Government Digital and Data"
    ],
    "pub_date": "2024-11-22T18:30:00+00:00",
    "content": [
        {
            "heading": 3,
            "text": "Introduction "
        },
        {
            "text": "I joined the Central Digital and Data (CDDO) Communications team at the beginning of July and I already feel like it is a place I want to belong to. I received many warm welcomes and all the needed support to start work and take my own initiative. "
        },
        {
            "heading": 3,
            "text": "My Experience "
        },
        {
            "text": "Since the start, my time in the government has had plenty of exciting events going on. My internship started by joining Civil Service Live in London - the annual all staff learning conference, where I had the opportunity to meet numerous inspiring people and take part in various sessions which provided me with a deeper understanding of Civil Service work. "
        },
        {
            "text": "It is also a privilege to witness changes in government in the post-election period, especially in the government digital services and see the Government Digital and Data hub in person!"
        },
        {
            "text": "The internship offers countless learning opportunities, including collaboration with staff members, shadowing professionals from different teams, and various courses on the government learning platform. Even after a few days I could already handle various tasks, like helping with weekly internal newsletters and preparing performance analysis reports. I’ve also helped with preparing an evaluation dashboard for our team to help the team digest key information to then make informed decisions for improvements. In addition to this, I’ve also been getting involved with organising communications campaigns for Government Digital and Data, the brand for the function and profession leading digital transformation. Although it is something that I would not have predicted before for my career, I feel lucky to be part of this experience. My team supports me on every step and gives me freedom to explore different areas of government work too. Due to my interest in data science, I can shadow the data team here at CDDO and help with tasks assigned by them. It’s a great insight and aid in decisions about my future career. "
        },
        {
            "heading": 3,
            "text": "Conclusion"
        },
        {
            "text": "The internship also motivated me to consider applying for the Fast Stream Programme, where I would love to continue supporting the Civil Service. The time I’ve spent at work was enough for me to realise how great is the culture at Civil Service and the impact on people’s lives to deliver modern digital services. It is amazing to be a part of it. "
        }
    ]
}