{
    "url": "https://mhclgmedia.blog.gov.uk/2024/11/22/leasehold-reforms-to-improve-millions-of-lives/",
    "title": "Leasehold reforms to improve millions of lives",
    "authors": [
        "mhclgpress"
    ],
    "categories": [
        "Housing"
    ],
    "pub_date": "2024-11-22T17:09:01+00:00",
    "content": [
        {
            "text": "Yesterday, 21st November, the Housing Minister Matthew Pennycook provided an update to the House on sweeping reforms starting in the new year to improve the lives of millions of existing leaseholders, and a timeline of vital steps being taken over this Parliament to end the feudal leasehold system once and for all."
        },
        {
            "text": "What is leasehold is and why are you bringing it to an end?"
        },
        {
            "text": "Properties (both flats and houses) in England and Wales can be purchased as a leasehold or freehold. Around five million homes are leasehold properties. If you ‘own’ your home, but it is a leasehold, you actually only own a right to occupy the property via a lease for a diminishing number of years, from a freeholder (or landlord). "
        },
        {
            "text": "Millions of leaseholders feel they have been misled and their hard-earned achievement of homeownership has fallen short of the dream. This is because leaseholders can be faced with unexpected and unaffordable costs imposed on them by the freeholder, for example service charges and ground rent."
        },
        {
            "text": "While some charges are necessary to fund a key service for leaseholders, for example a service charge might cover cleaning of communal hallways in a block of flats, in recent years some bad actors have taken advantage of leaseholders, charging excessive, opaque and escalating costs."
        },
        {
            "text": "What is the government doing?"
        },
        {
            "text": "The government is fully committed to bringing the leasehold system to an end and also recognises the need to act quickly to provide relief to existing leaseholders. This requires a suite of legislative reforms.  As an incredibly complex area of property law, the timing of ‘switching on’ certain measures in the Leasehold and Freehold Reform Act is crucial to ensure reforms bring the intended and long-lasting benefits to current leaseholders and future homeowners across the country."
        },
        {
            "text": "However, some specific but serious flaws in the Act have meant some provisions would not operate as intended. This government must therefore lay primary legislation to rectify these, before bringing certain provisions in the Act into force, including the new valuation process."
        },
        {
            "text": "The Leasehold and Freehold Reform Act 2024"
        },
        {
            "text": "The Leasehold and Freehold Reform Act was passed in May 2024 and contained measures to better protect existing leaseholders. However, a number of these measures need secondary legislation in order to be implemented, starting with the following provisions:"
        },
        {
            "text": "Engaging with stakeholders and delivery partners in consultations is a crucial part of this reform to ensure the legislation is watertight, brings the intended outcomes and avoids any disruption to the housing market. Before the end of next year we will have consulted on how various provisions in the Act will operate, including:"
        },
        {
            "text": "Are you doing anything else?"
        },
        {
            "text": "First announced in the King’s Speech, and intended to be published in the second half of next year, the government’s landmark Draft Leasehold and Commonhold Bill will go further than the 2024 Act."
        },
        {
            "text": "Prior to the Bill, a Commonhold White Paper will be published as part of our plan to  transition away from leasehold to a more modern, fit-for-purpose commonhold system, to be followed by  a consultation on banning new leasehold flats."
        },
        {
            "text": "The government is acting at pace to bring forward its commitments to:"
        },
        {
            "text": "All of these reforms will ensure existing leaseholders and future homeowners in England and Wales get the security, control and freedom deserved of their homes."
        }
    ]
}