{
    "url": "https://defrafarming.blog.gov.uk/2024/11/22/new-guidance-page-for-integrated-pest-management/",
    "title": "New guidance page for Integrated Pest Management",
    "authors": [
        "The Team"
    ],
    "categories": [
        "environmental land management schemes",
        "Farmers",
        "Sustainable Farming Incentive",
        "Things we're doing"
    ],
    "pub_date": "2024-11-22T11:59:03+00:00",
    "content": [
        {
            "text": "Integrated Pest Management (IPM) is a whole-farm approach that uses all available methods to prevent, monitor, and control pests, weeds and diseases. "
        },
        {
            "text": "It can help manage pesticide resistance and minimise the risks of environmental harm by targeting application and making use of non-chemical alternatives. "
        },
        {
            "text": "IPM is not a fixed set of practices but a flexible approach to help you make the best decisions for your farm. "
        },
        {
            "text": "It blends farming skills, conventional wisdom and approaches with the latest technology and scientific research and development.  "
        },
        {
            "text": "To help farmers, growers and land managers adopt different IPM approaches, we’ve published a new guidance page on GOV.UK. This post includes a link to the new guidance page and background on IPM.  "
        },
        {
            "heading": 2,
            "text": "Guidance "
        },
        {
            "text": "The new guidance page on GOV.UK provides practical information to help you increase your use of IPM approaches.  "
        },
        {
            "text": "It includes:   "
        },
        {
            "heading": 2,
            "text": "Video series coming soon"
        },
        {
            "text": "In collaboration with ADAS, a new series of videos will be launched in January. "
        },
        {
            "text": "14 videos will bring to life the science behind IPM and showcase best practice for managing diseases in cereals. "
        },
        {
            "text": "The videos will focus on:   "
        },
        {
            "text": "The videos appear weekly along with related IPM content and will be hosted on the ADAS YouTube channel. ADAS produced a PDF which goes into more detail. "
        },
        {
            "text": "The new UK Pesticides National Action Plan will be published next year and will set out the government’s strategy for sustainable use of pesticides.  "
        },
        {
            "heading": 2,
            "text": "The Sustainable Farming Incentive"
        },
        {
            "text": "As mentioned above, within the Sustainable Farming Incentive (SFI)’s 102 actions, there are payments for carrying out specific IPM actions. "
        },
        {
            "text": "For example, £1,129 will be paid for action CIPM1: Assess integrated pest management and produce a plan (the payment is for the assessment and plan per year)."
        },
        {
            "text": "Other actions, which you can find on the FIND tool cover: "
        },
        {
            "text": "You no longer need to complete the expression of interest meaning applicants no longer need to wait to be invited to apply by the Rural Payments Agency (RPA).  "
        },
        {
            "heading": 2,
            "text": "Case study "
        },
        {
            "text": "Emma Hamer, a Farmer and Voluntary Initiative (VI) champion, from Meadowsweet farm in Oxfordshire shares her approach: "
        }
    ]
}