{
    "url": "https://naturalengland.blog.gov.uk/2024/11/22/offshore-wind-farms-our-role-in-advising-on-the-right-place-for-low-impact-on-marine-and-coastal-nature/",
    "title": "Offshore wind farms — our role in advising on the right place for low impact on marine and coastal nature",
    "authors": [
        "Natural England"
    ],
    "categories": [
        "Climate change",
        "Environmental Improvement Plan",
        "Evidence",
        "Green Infrastructure",
        "Marine environment",
        "Protected sites and species",
        "Science and evidence",
        "Seabirds",
        "Special Protection Area"
    ],
    "pub_date": "2024-11-22T10:17:02+00:00",
    "content": [
        {
            "text": "By Tamara Rowson, Natural England Offshore Renewables Industry Specialist"
        },
        {
            "text": "Since 11 November delegates from across the world have been in attendance at COP29 in Baku, Azerbaijan, focusing on “delivering deep, rapid, and sustained emission reductions now to keep temperatures under control and stay below 1.5°C”.  "
        },
        {
            "text": "At the start of the COP process, the Prime Minister set out his vision for Britain leading the world in the green energy transition and with 43% of European Offshore Wind Farm (OWF) capacity in UK water and the second globally only behind China, the UK is well placed to do so. UK OWF supplied electricity needs of 50% of UK households in 2023 which is expected to increase in line with the Government’s Make Britain a clean energy superpower mission.  "
        },
        {
            "text": "Natural England’s role "
        },
        {
            "text": "Natural England supports the government’s targets for green energy and we have published our Approach to Offshore Wind where we strive for ‘Thriving marine and coastal nature alongside low impact offshore wind energy, tackling both climate and biodiversity emergencies’. To achieve this, we need to locate offshore wind farms and cables in areas which will avoid irreparable damage and implement evidence-based mitigation where impact is predicted.  "
        },
        {
            "text": "Our role in Offshore Wind is an example of how the organisation is thinking globally while acting locally. Our Sustainable Development programme focusses on proactive and strategic advice at a plan level; building environmental considerations in at an early stage; and developing strategic solutions to environmental challenges.  "
        },
        {
            "text": "We leverage our offshore wind expertise to support government initiatives including the Environmental Improvement Plan and UK Marine Strategy.  Working across government we collaborate with the Crown Estate to create a programme of how we will achieve increased offshore wind capacity as set out in the Whole of Seabed Programme and Future of Offshore Wind reports, whilst also advising Defra on its projects to identify appropriate Offshore Wind Environmental Standards.  "
        },
        {
            "text": "Planning casework "
        },
        {
            "text": "This year Natural England’s Offshore Wind casework teams have provided environmental advice for 10 proposed offshore wind sites where applications are being prepared and consent is being sought from the Planning Inspectorate and the Secretary of State. As well as providing advice to developers and regulators looking at current sites that have ongoing construction, operations and maintenance plans. "
        },
        {
            "text": "Research and evidence  "
        },
        {
            "text": "As well as our statutory duty to provide advice, Natural England produces research and evidence publications aimed at filling gaps and improving decision making. In the last year we have published; "
        },
        {
            "text": "Additionally Natural England currently manages two multiyear multi-stakeholder offshore wind projects (funded through The Crown Estates Offshore Wind Evidence and Change programme): "
        },
        {
            "text": "Best practice "
        },
        {
            "text": "Natural England has developed offshore wind best practice advice and environmental best practice for subsea cables (jointly with JNCC), which are setting the standards for other marine industries and have been shared with more than 450 stakeholders both nationally and internationally. These documents are live and undergo regular review to ensure they refer to best available evidence, we will be updating these in the new year. For access, email NEOffshoreWindStrategicSolutions@naturalengland.org.uk. "
        }
    ]
}