{
    "url": "https://vmd.blog.gov.uk/2024/11/22/unza-vmd-postgraduate-programme-improving-antimicrobial-stewardship-in-zambia/",
    "title": "UNZA-VMD postgraduate programme: Improving antimicrobial stewardship in Zambia",
    "authors": [
        "Sannah Malik",
        "Claire Gilbert"
    ],
    "categories": [
        "Antimicrobial Resistance (AMR)",
        "VMD News"
    ],
    "pub_date": "2024-11-22T15:37:31+00:00",
    "content": [
        {
            "text": "The UNZA-VMD postgraduate programme is a collaboration supporting students and research in Zambia. Through the UK Fleming Fund, two MSc students and one PhD student are being sponsored to complete training and research focussed on antimicrobial resistance (AMR), led by academics at UNZA and supported by technical specialists from VMD. The programme has recently expanded to include additional research projects relating to AMR and antimicrobial use in livestock, and residues of veterinary medicines in food products.   "
        },
        {
            "text": "For World AMR Awareness Week, we interviewed two postgraduate students participating in the programme to learn more about their background and research. They have provided an insight into the development of their projects and the real-world impact they hope their research will have in improving antimicrobial use in livestock in Zambia. It’s exciting to learn about the invaluable work being conducted by these students, aiming to strengthen animal health systems to tackle AMR in a sustainable way."
        },
        {
            "text": "In this first interview, Inyambo Mumbula, a PhD student, talks about his background and research into attitudes of Zambian smallholder farmers and antibiotic stewardship."
        },
        {
            "text": "Please start by telling us about your career so far"
        },
        {
            "text": "I am a PhD student in the School of Veterinary Medicine, Department of Disease Control, at the University of Zambia. I am honored to be a recipient of the UNZA-VMD scholarship, which aims to develop behavioral interventions to improve antimicrobial stewardship among smallholder dairy farmers in Zambia. This scholarship aligns perfectly with my career aspirations."
        },
        {
            "text": "I hold a Bachelor's degree in Biotechnology with a specialization in Food Security and Sustainable Agriculture, and a Master’s in Public Health (MPH) in Health Promotion and Education. My expertise bridges the fields of agriculture and public health, with a focus on developing and promoting evidence-based interventions. My PhD research allows me to integrate these skills, creating interventions that enhance awareness of antimicrobial resistance (AMR) and improve antimicrobial stewardship among smallholder farmers."
        },
        {
            "text": "Could you describe the research you are doing for your PhD and how you shaped your research questions?"
        },
        {
            "text": "The core aim of my research is to co-design an intervention with users that is relevant to local contexts. This goal informed the shaping of my research questions, which are structured around the Human-Centered Design (HCD) framework. The HCD approach guided the development of questions at each stage—discovery, design, and delivery and measurement."
        },
        {
            "text": "How did you develop your research - who has influenced your thinking?"
        },
        {
            "text": "Developing this research has been a collaborative effort involving professionals with similar goals. My supervisors, Dr. Doreen Sitali and Dr. Lydia Trupe, have provided invaluable guidance in shaping my research questions. Additionally, Dr. Aisling Glennie and Dr. Anil Gorle from VMD have offered technical expertise and critical insights into AMR. Regular supervisory meetings not only refine my research direction but also keep me informed about global developments in antimicrobial resistance."
        },
        {
            "text": "What has your research shown so far?"
        },
        {
            "text": "Preliminary findings from my data collection on the knowledge, attitudes, and practices of smallholder farmers regarding AMR and antimicrobial use (AMU) reveal significant gaps. Most farmers have limited knowledge of AMR, with over half reporting they had never heard the term “antibiotics.” Those familiar with antibiotics often lacked accurate understanding, such as their role in treating bacterial infections in cattle."
        },
        {
            "text": "Could you describe the research you are doing for your PhD and how you shaped your research questions?"
        },
        {
            "text": "The core aim of my research is to co-design an intervention with users that is relevant to local contexts. This goal informed the shaping of my research questions, which are structured around the Human-Centered Design (HCD) framework. The HCD approach guided the development of questions at each stage - discovery, design, and delivery and measurement."
        },
        {
            "text": "How did you develop your research—who has influenced your thinking?"
        },
        {
            "text": "Developing this research has been a collaborative effort involving professionals with similar goals. My supervisors, Dr. Doreen Sitali and Dr. Lydia Trupe, have provided invaluable guidance in shaping my research questions. Additionally, Dr. Aisling Glennie and Dr. Anil Gorle from VMD have offered technical expertise and critical insights into AMR. Regular supervisory meetings not only refine my research direction but also keep me informed about global developments in antimicrobial resistance."
        },
        {
            "text": "What has your research shown so far?"
        },
        {
            "text": "Preliminary findings from my data collection on the knowledge, attitudes, and practices of smallholder farmers regarding AMR and antimicrobial use (AMU) reveal significant gaps. Most farmers have limited knowledge of AMR, with over half reporting they had never heard the term “antibiotics.” Those familiar with antibiotics often lacked accurate understanding, such as their role in treating bacterial infections in cattle."
        },
        {
            "text": "Additionally, risky practices like milking and consuming products from treated animals persist, increasing the risk of antibiotic exposure to humans. These results underscore the urgent need for awareness campaigns and targeted interventions to promote antimicrobial stewardship among smallholder farmers."
        },
        {
            "text": "What impact do you hope your work will have?"
        },
        {
            "text": "This research will result in a practical, accessible tool for smallholder farmers, equipping them with knowledge and guidance for prudent antimicrobial use. By improving awareness and promoting better practices, the study will contribute to reducing the risks associated with AMR, protecting both human and animal health, and fostering sustainable farming practices."
        },
        {
            "text": "How do you think the scholarship will benefit your long-term career and impact?"
        },
        {
            "text": "This scholarship positions me as a key contributor in the One Health space, particularly in addressing AMR, zoonotic diseases, and tropical infectious diseases. It provides me with the foundation to build capacity for tackling public health threats at local, national, and global levels. I aspire to establish myself as an academic and practitioner who develops sustainable solutions for pressing global health challenges."
        },
        {
            "text": "Any thoughts on the global perspective—what can we all learn from each other and how can we work together to tackle AMR? "
        },
        {
            "text": "On a global level, collaboration is vital in addressing AMR. By sharing strategies, strengthening AMR surveillance systems, and implementing behavioral interventions, we can pool resources and expertise to create impactful solutions. The UK-Zambia partnership and One Health collaborations exemplify how cross-disciplinary and cross-country teamwork can accelerate progress. Such partnerships should serve as a model for building strong networks to combat AMR and other global health threats."
        }
    ]
}