{
    "url": "https://marinescience.blog.gov.uk/2024/11/22/world-amr-awareness-week-working-together-to-tackle-the-global-challenge/",
    "title": "World AMR Awareness Week - working together to tackle the global challenge",
    "authors": [
        "Andrew Joseph",
        "Athina Papadopoulou"
    ],
    "categories": [
        "Animal Health",
        "Aquaculture",
        "International",
        "Middle East",
        "Seafood Hazards",
        "Uncategorized"
    ],
    "pub_date": "2024-11-22T14:14:27+00:00",
    "content": [
        {
            "text": "World AMR Awareness Week 2024 takes place this week, 18-24th November, a global campaign to raise awareness and understanding of Antimicrobial Resistance (AMR) and to promote best practices to reduce the emergence and spread of drug-resistant infections."
        },
        {
            "text": "Antimicrobial resistance occurs when bacteria, viruses, fungi and parasites no longer respond to antimicrobial agents. As a result of drug resistance, antibiotics and other antimicrobial agents become ineffective and infections become difficult or impossible to treat, increasing the risk of disease spread, severe illness and death. AMR is one of the most pressing global challenges threatening human health and economic security in the 21st Century. Today, AMR is estimated to be responsible for 1.2 million deaths per year globally, and this is expected to increase significantly by 2050. The threat of AMR is primarily of concern in human healthcare settings, but it is increasingly clear that AMR can develop and spread in the environment, including freshwater and marine environments."
        },
        {
            "text": "Cefas, the Animal and Plant Health Agency (APHA) and the Veterinary Medicines Directorate (VMD) jointly hold the UK Food and Agriculture Organisation of the United Nations (FAO) Reference Centre, which is funded by the Fleming Fund, a UK Aid programme managed by the UK Department of Health and Social Care."
        },
        {
            "text": "The Reference Centre provides independent technical and scientific advice to safeguard animal and human health from the threat of antimicrobial resistance. Our mission is to provide world leading scientific and policy expertise within the global community to tackle antimicrobial resistance in terrestrial and aquatic animals and their environments."
        },
        {
            "heading": 2,
            "text": "UN FAO AMR reference centre and Fleming Fund activity in Ghana"
        },
        {
            "text": "The Reference Centre was recently honoured to co-deliver a comprehensive training programme aimed at improving AMR data in the agri-environmental sector. The training was hosted at the National Food Safety Laboratory (NFSL) in Accra, Ghana. The event brought together 14 laboratory scientists from five animal health laboratories and one environmental health laboratory across Ghana. Participants attended from the Accra Veterinary Lab (NFSL), Kumasi Veterinary Lab, Takoradi Veterinary Lab, Dormaa Veterinary Lab, Central Veterinary Lab-Tamale, Ho Veterinary Lab, and the Council for Scientific and Industrial Research (CSIR) Ghana Laboratory in Accra. The training course combined classroom instruction with practical laboratory sessions, providing participants with hands-on experience in handling and testing bacterial cultures. The programme covered essential aspects of antimicrobial susceptibility testing, including quality control and interpretative criteria."
        },
        {
            "text": "This training is part of the Fleming Fund Phase 2 West Africa AMR One Health (WA AMROH) programme. The UK FAO Reference Centre for AMR and the UN FAO West Africa Office are regional grantees for the Animal Health portfolio in Ghana, Nigeria, Sierra Leone, and Senegal."
        },
        {
            "text": "The event featured distinguished speakers including the Chief Veterinary Officer, the FAO AMR Country Coordinator, NFSL staff, FAO Reference Centre for AMR (UK) experts, Aurum Institute representatives, and officials from the British High Commission. This initiative is a critical component of Ghana's National Action Plan on Antimicrobial Resistance (NAP AMR), which aligns with the World Health Organization’s (WHO) Global Action Plan on AMR and Quadripartite One Health Joint Plan of Action."
        },
        {
            "text": "This initiative underscores Ghana's commitment to advancing laboratory capabilities in terrestrial and aquatic bacterial diagnostics and antibiotic susceptibility testing to generate high-quality data on AMR, ensuring a healthier future for animals, humans, and the environment."
        },
        {
            "heading": 2,
            "text": "AMR work around the world"
        },
        {
            "text": "Cefas is also active in other parts of the world to support the collaborative approach to tackling AMR."
        },
        {
            "text": "During WAAW, the Cefas Reference Centre team participated in an international hands-on training course, Utilising Microbe and Genomic Resources for Understanding & Mitigating Antimicrobial Resistance in the One Health Context, hosted by Nitte University, Mangalore, India, an FAO Reference Centre for AMR and Aquaculture Biosecurity. The course brought together trainees from Asia, Southeast Asia, Africa, and the Middle East. The Cefas Reference Centre team supported the attendance of four trainees from Bangladesh, Ethiopia, and Zambia and provided presentations and training on Antibiotic Susceptibility Testing (AST). This initiative exemplified collaboration and expertise-sharing among FAO Reference Centres, aiming to build capacity to understand and mitigate AMR.  "
        },
        {
            "text": "Cefas Reference Centre members were also invited speakers at the webinar Antimicrobial Resistance, organized by the Abu Dhabi Agriculture & Food Safety Authority (ADAFSA) and World Organisation for Animal Health (WOAH) Collaborating Centre for Camel Disease. This webinar provided a platform for knowledge exchange and discussions on diagnostics, practical approaches, and innovative tools to address AMR in the animal, plant, and human health sectors."
        },
        {
            "text": "The Cefas Reference Centre team is also collaborating with Defra colleagues to deliver Official Development Assistance (ODA) Technical Assistance and research programmes in Western and Southern Africa, including via the Ocean Country Partnership Programme (OCPP) and Animal Health Systems Strengthening (AHSS) projects. Additionally, the team is supporting FCDO programmes such as our Climate, Health, and Environment Resilience Programme (CHERP) in the Gulf Cooperation Council countries including the publication of a paper about marine monitoring programme to assess antibiotic resistance. We also support other countries’ work to tackle AMR via the Blue Belt programme."
        },
        {
            "text": "With thanks to all our partners both in the UK and around the world for the collaborative work to tackle the challenge of antimicrobial resistance."
        }
    ]
}