{
    "url": "https://sustainableict.blog.gov.uk/2025/09/08/beyond-the-award-how-esims-saved-6-million-and-cut-carbon-emissions-by-99/",
    "title": "Beyond the award: How eSIMs saved £6 million and cut carbon emissions by 99%",
    "authors": [
        "Lydia Tabbron"
    ],
    "categories": [
        "Sustainable ICT",
        "Sustainable procurement"
    ],
    "pub_date": "2025-09-08T14:58:55+01:00",
    "content": [
        {
            "text": "Lydia Tabbron, Digital Sustainability Lead, shares how designing digital services with sustainability at their heart can lead to solutions that are more efficient, more cost-effective, and better for users."
        },
        {
            "text": "Defra’s Mobile Voice and Data Services (MVDS) team recently won the 2025 Defra Sustainability Award for their work on the roll out of eSIM technology across Defra Group. But the real value was in demonstrating how digital transformation can reduce environmental impacts whilst delivering better value for money."
        },
        {
            "text": "Digital technology touches every aspect of government operations, from frontline services to back-office systems, so it’s essential that our technological choices support our environmental goals."
        },
        {
            "text": "In 2022, Defra's mobile estate relied on over 34,000 physical SIM cards - a legacy approach that was both environmentally costly and technically limiting. The Mobile Voice and Data Services (MVDS) team, saw an opportunity to reimagine this entirely."
        },
        {
            "text": "Working with BT, we developed a groundbreaking telecoms contract that replaced physical SIMs with digital eSIM technology. The goal wasn’t just to upgrade our hardware, but to embed sustainability into every aspect of the procurement process."
        },
        {
            "text": "A model for government-wide transformation"
        },
        {
            "text": "The transition avoided 99% of carbon emissions associated with physical SIM cards and is expected to deliver £6.16 million in cost savings over five years. User satisfaction rates following the migration process were high at 82%, with 84% rating communications as excellent or good."
        },
        {
            "text": "The impact extends far beyond Defra's own operations, other government departments are using the initiative as a blueprint when developing their own digital strategies and the project supports key government strategies including the 25 Year Environment Plan and the Greening Government ICT Strategy, and contributes to UN Sustainable Development Goals."
        },
        {
            "text": "Setting the standard for sustainable procurement"
        },
        {
            "text": "What makes this project particularly significant is how sustainability was woven throughout, from project conception to the contract terms. We increased the sustainability and social value weighting to 15% and established 24 specific, measurable, and enforceable sustainability KPIs, embedding environmental commitments into operations."
        },
        {
            "text": "These commitments included partnering with BT to recycle legacy SIMs and ensuring mobile networks are powered by renewable energy. The team have been talking to senior leaders across government, showcasing how sustainability delivers cost and efficiency savings alongside carbon reduction."
        },
        {
            "text": "What we’ve learned"
        },
        {
            "text": "This work demonstrates something crucial about our approach to digital transformation. Environmental sustainability isn't a constraint on innovation, it's a driver of it. When we design digital services with sustainability at their heart, we often find solutions that are more efficient, more cost-effective, and better for users."
        },
        {
            "text": "As government continues to digitalise services and operations, the MVDS project shows how we can ensure this transformation supports our broader environmental commitments."
        },
        {
            "text": "Building on our success"
        },
        {
            "text": "Although it was great to have our efforts recognised in the Defra Awards 2025, our work isn’t done yet. We are pursuing other industry recognised awards to raise awareness of the cross-cutting benefits we have experienced with the hope of inspiring other public sector organisations. We are also developing a joint Net Zero action plan with BT that includes mandatory environmental training for all contract staff."
        }
    ]
}