{
    "url": "https://childrenssocialcare.blog.gov.uk/2025/09/08/beyond-literacy-why-reading-matters-to-strengthen-bonds-and-relationships/",
    "title": "Beyond literacy: why reading matters to strengthen bonds and relationships",
    "authors": [
        "Annie Crombie"
    ],
    "categories": [
        "Education",
        "Literacy"
    ],
    "pub_date": "2025-09-08T16:05:21+01:00",
    "content": [
        {
            "text": "To celebrate International Literacy Day on 8 September 2025, Annie Crombie from BookTrust talks about the importance of reading. The Department for Education is looking forward to National Year of Reading (2026) as the value of reading for pleasure can't be understated."
        },
        {
            "text": "As Co-CEO of BookTrust, the UK’s largest children’s reading charity working across early years, health, education, and children’s social care, I’ve seen how life-changing it is to share books and stories with children."
        },
        {
            "text": "For a child who has experienced instability or trauma, the simple act of sharing a book can provide a moment of trust, reassurance, and love. Books offer children a safe space to process emotions, make sense of the world, and see themselves reflected in a way that validates their experiences."
        },
        {
            "heading": 2,
            "text": "Fostering a lifelong love of reading"
        },
        {
            "text": "Reading together creates nurturing interactions that support attunement and attachment. The book we read to a child may be simple – but it provides the basis for consistent, emotionally rich, co-constructed experiences through a simple ritual accessible to all families. These reading experiences enhance bonding, which is not only important for children, but can also contribute to caregivers’ wellbeing."
        },
        {
            "text": "We wanted to harness this relational power of reading for children in the greatest need of this support. Over the past two years, we’ve worked with families and practitioners to co-create a new programme called Story Explorers. "
        },
        {
            "text": "This was designed to engage and motivate behaviour change for kinship, foster, and adoptive families. For example, we design an experience of reading that is interactive and playful, rather than a chore. We give the child a sense of their own agency through flexibility, choice and book ownership. "
        },
        {
            "text": "We’ve heard fantastic feedback from families: Story Explorers has prompted or enhanced reading routines that have nurtured connection and helped the child in their care build trust and a sense of belonging. The books have increased children’s confidence and emotional expression, and the kits have enabled their families to discover new ways of enjoying time together."
        },
        {
            "heading": 2,
            "text": "Making reading accessible"
        },
        {
            "text": "We’ve recently worked with the charity Kinship to design a range of kinship support to help families read together. Our Letterbox Club programme has been helping engage children aged 3-13 with reading and numeracy for many years."
        },
        {
            "text": "All books for our programmes are chosen by selection panels of people who understand children and families’ needs and circumstances, from early years practitioners to foster carers and support workers. "
        },
        {
            "heading": 2,
            "text": "Working together across social care, health, education, and more"
        },
        {
            "text": "BookTrust reaches over 10,000 care-experience children every year, but know we can’t do this on our own. That’s why we’ve launched the Reading Rights: Books Build a Brighter Future campaign with Waterstones Children’s Laureate Frank Cottrell-Boyce. "
        },
        {
            "text": "We want more people working with the most vulnerable children to understand how sharing stories can change lives, and have access to the support they need to make this a reality for families."
        },
        {
            "heading": 2,
            "text": "Find out more"
        }
    ]
}