{
    "url": "https://nationalscreening.blog.gov.uk/2025/09/08/exciting-opportunities-to-join-uk-nsc-expert-groups/",
    "title": "Exciting opportunities to join UK NSC expert groups",
    "authors": [
        "Mike Harris"
    ],
    "categories": [
        "UK National Screening Committee"
    ],
    "pub_date": "2025-09-08T09:25:04+01:00",
    "content": [
        {
            "text": "The UK National Screening Committee (UK NSC) is the independent scientific committee that advises ministers and the NHS in the 4 UK countries about all aspects of screening."
        },
        {
            "text": "The committee currently has 15 exciting vacancies to fill on 3 of its expert advisory groups: the fetal, maternal and child health (FMCH) group, adult reference group (ARG) and research and methodology group (RMG). These expert groups play crucial roles in scrutinising evidence and providing input from their relevant areas of expertise."
        },
        {
            "text": "They help make sure the UK NSC makes high quality recommendations that are based on the best evidence and thinking. All 3 groups are also increasingly involved in advising on innovation, research proposals, horizon scanning and stakeholder engagement. "
        },
        {
            "text": "The ARG has vacancies for the 4 roles of: "
        },
        {
            "text": "The FMCH has vacancies for the 6 roles of: "
        },
        {
            "text": "The RMG has vacancies for the 5 roles of:"
        },
        {
            "heading": 2,
            "text": "How to apply"
        },
        {
            "text": "To apply, submit an expression of interest and a biography (up to 500 words or one page) detailing your relevant experience and engagement with screening and how you can contribute to the work of the reference group. "
        },
        {
            "text": "Anyone interested in any of these roles should have relevant knowledge, skills and experience that would contribute to the provision of high quality and well considered advice to the UK NSC. "
        },
        {
            "text": "See our information on recruitment to expert and advisory groups for details of the qualities and criteria required for these roles."
        },
        {
            "heading": 2,
            "text": "Recruitment information"
        },
        {
            "text": "Applications will be reviewed by a panel of the relevant reference group, including the chair, and 2 members of the UK NSC secretariat team. "
        },
        {
            "text": "All applications will receive a successful or unsuccessful notification. The successful candidates will receive information about next steps."
        },
        {
            "text": "Members of the UK NSC and its expert groups are all appointed as independent members to behave with impartiality, integrity and objectivity. They are responsible for providing, from their specific perspective, advice, insight and constructive challenge. "
        },
        {
            "text": "The expert groups meet 3 to 4 times per year. There is no remuneration for the posts, but members can claim expenses in accordance with Department of Health and Social Care (DHSC) rules for travel, subsistence and overnight accommodation. "
        },
        {
            "text": "The UK NSC and its host organisation, the DHSC, value and promote diversity and encourage applications from all sections of the community. "
        },
        {
            "heading": 2,
            "text": "Keep up to date"
        },
        {
            "text": "The UK NSC blog provides up to date news from the UK NSC. You can register to receive updates direct to your inbox, so there is no need to keep checking for new articles. If you have any questions about this blog article, or about the work of the UK NSC, please email uknsc@dhsc.gov.uk."
        }
    ]
}