{
    "url": "https://cddo.blog.gov.uk/2025/09/08/new-courses-on-accessibility-and-user-research-now-live-on-futurelearn/",
    "title": "New courses on accessibility and user research – now live on FutureLearn!",
    "authors": [
        "Thomas Munley, Senior Learning Design Manager, GDS"
    ],
    "categories": [
        "Digital learning and development",
        "Digital strategy",
        "Digital transformation",
        "Government Digital and Data"
    ],
    "pub_date": "2025-09-08T10:05:42+01:00",
    "content": [
        {
            "text": "Want to learn more about user research in government? Interested in accessibility? Here are two courses that are perfect for you!"
        },
        {
            "text": "Government Digital Service (GDS) are thrilled to announce the launch of two new courses, in collaboration with FutureLearn: "
        },
        {
            "text": "As outlined in the blueprint for modern digital government, there is a need for investment in talent and opportunities for learning, development and upskilling. "
        },
        {
            "text": "GDS is at the forefront of providing these opportunities so that we can contribute to the government’s goal of doubling the size of the Government Digital and Data profession and equipping civil servants with the skills and knowledge they need to work effectively in a modern digital government. "
        },
        {
            "heading": 3,
            "text": "Who are the courses for? "
        },
        {
            "text": "These courses are free to access and open to anyone, including members of the public interested in knowing more about different roles in government. "
        },
        {
            "text": "Accessibility in Government: Getting Started is a two-week,  introductory, awareness level course. It has been developed by a team of cross-government accessibility specialists and is suitable for anyone who wants to learn the basics, including key concepts and vocabulary and how the government works towards setting the standard for accessibility. "
        },
        {
            "text": "User Research in Government: Developing Further is a follow-up to our introductory user research course that we launched in February 2025. A five-week, working/practitioner level course, it is aimed at people who are interested in studying key concepts more in-depth. It would also be ideal for new or junior user researchers to consolidate their knowledge when starting out in the role."
        },
        {
            "heading": 3,
            "text": "Why these courses?"
        },
        {
            "text": "Accessibility is central to good government service design, but accessibility also benefits everyone by making things easier to use. We created this course to show how the government sets the standard when it comes to accessibility. It is designed to give learners a basic understanding of key concepts and terminology so that they can be more aware of and confidently advocate for accessibility in their daily lives."
        },
        {
            "text": "In February 2025, GDS launched our introductory User Research in Government: Getting Started course as part of our wider suite of introductory courses to Government Digital and Data  roles. Our cross-gov team of expert user researchers has now developed a tailored, eight-week learning package across the two courses. It has been designed to give new and junior users researchers or those with a keen interest in the role an in-depth look into how it works in government.    "
        },
        {
            "heading": 3,
            "text": "What will you learn?"
        },
        {
            "text": "In our Accessibility in Government: Getting Started course, learners will cover topics such as:"
        },
        {
            "text": "This course is structured over two weeks with a recommended learning time of three hours per week. "
        },
        {
            "text": "In User Research in Government: Developing Further, you will cover:"
        },
        {
            "text": "This course is structured over five weeks with a recommended learning time of four hours per week. "
        },
        {
            "text": "You will learn through a mix of reading, completing tasks and watching educational videos produced by user researchers working in government. You can keep track of your progress by taking quizzes and end-of-week tests, and by completing the learner tasks throughout the course. "
        },
        {
            "text": "Both courses are free to access, but for an optional fee you can gain permanent access to the course material, get a chance to take the course assessments, and receive a signed certificate of completion at the end of the course as a record of your learning. "
        },
        {
            "text": "The courses are self-directed. That means you can join at any time and you can learn at your own pace within the duration of the course. "
        },
        {
            "heading": 3,
            "text": "Social learning"
        },
        {
            "text": "FutureLearn is a social learning platform and interaction between learners is fundamental to the experience. "
        },
        {
            "text": "On every step of our courses, you will have the opportunity to chat to other learners about the subjects and activities covered. You can comment as much or as little as you would like, but we encourage you to join in and learn collaboratively."
        },
        {
            "text": "Register on FutureLearn now – the courses are now live! You can join these courses at any time and learn at your own pace each week. "
        },
        {
            "heading": 3,
            "text": "What’s next?"
        },
        {
            "text": "Keep an eye out for our upcoming courses on more digital and data roles – our next course will be an introduction to the Business Analyst role, coming in December 2025."
        },
        {
            "text": "If you have any queries or would like to collaborate with the team on our next courses, you can contact the Learning Design team by emailing gddlearningteam@dsit.gov.uk. "
        }
    ]
}