{
    "url": "https://digitalpeople.blog.gov.uk/2025/09/08/outreach-in-action-career-conversations-to-inspire-young-minds-into-data-and-digital/",
    "title": "Outreach in Action: Career conversations to inspire young minds into data and digital",
    "authors": [
        "Marwa Ali, Outreach Manager, GDS, Workforce and Capability.",
        "Laura Clarke, Digital Capability Lead, Workforce and Capability, GDS."
    ],
    "categories": [
        "Capabilities",
        "Emerging talent",
        "Government Digital and Data",
        "Graduate schemes and Fast Stream",
        "People and Skills"
    ],
    "pub_date": "2025-09-08T10:04:05+01:00",
    "content": [
        {
            "heading": 3,
            "text": "Why outreach matters"
        },
        {
            "text": "The Civil Service is committed to building a more diverse and digitally skilled workforce. That starts with inspiring the next generation, especially those who may not see themselves represented in government roles within the digital and data profession. By engaging with pupils early, we can help them imagine futures they may not have considered and show them that careers in digital and data are not only accessible but also impactful and rewarding."
        },
        {
            "text": "Recently, the Prime Minister set out a bold new vision for a digital-first Civil Service, where one in ten civil servants will work in digital and data roles. This ambition underscores the urgency of inspiring the next generation to see themselves in these careers. Our outreach work is a vital part of that journey helping young people imagine futures where they can shape public services through technology and data."
        },
        {
            "heading": 3,
            "text": "Outreach at Wendell Park: careers and aspirations week "
        },
        {
            "text": "Before our visit to Wendell Park primary school in London, only 14% of year 4 and year 6 pupils had considered a career in digital or data. After just one interactive session led by Outreach Manager, Marwa Ali, and Project Manager, Anna Gaspirini. 86% said it now sounded interesting or something they'd love to do."
        },
        {
            "text": "This transformation shows the power of early outreach in building the diverse digital workforce that the government needs. As part of the UK government's blueprint for modern digital government, we're committed to 'elevating leadership and investing in talent' – and that starts with inspiring young people to see themselves in careers that shape public services for the better."
        },
        {
            "text": "As part of the UK government’s ambition to build a modern digital government, outreach plays a vital role in growing digital and data capability across the public sector. The blueprint for modern digital government sets out a vision for “smarter organisations” and “higher productivity and efficiency” by embedding the right skills and ways of working across government. One of its six priorities is to “elevate leadership and invest in talent” and that starts with inspiring the next generation. Our outreach work is a small but important step in helping young people see themselves in digital and data careers that shape public services for the better."
        },
        {
            "text": "As part of Wendell Park Primary School in London’s Careers and Aspirations Week (30 June – 5 July 2025), Marwa Ali and Anna Gaspirini from the capability team in Government Digital Service had the privilege of visiting year 6 and year 4 pupils to talk about careers in the digital and data profession. The week was designed to raise aspirations and broaden horizons, especially for children from disadvantaged backgrounds, by introducing them to a wide range of career paths. "
        },
        {
            "text": "Our session focused on demystifying what it means to work in digital and data roles within the Civil Service. We shared our own career journeys, explained how data powers public services, and highlighted the exciting opportunities available in the Civil Service, from designing digital tools that improve people’s lives to using data to make smarter decisions for the country."
        },
        {
            "heading": 3,
            "text": "What we’d delivered"
        },
        {
            "text": "Introducing Year 4 and Year 6 students to roles in the digital and data profession, sparking curiosity and thoughtful questions."
        },
        {
            "text": "We designed an interactive session that brought digital and data careers to life. Using real examples from the Government Digital and Data Capability Framework, we showed pupils how data analysts help make smarter decisions for the country, how user researchers improve online services, and how software developers create tools that make people's lives easier."
        },
        {
            "text": "The highlight of the session was our AI storytelling activity, where pupils got hands-on experience with technology while learning about its role in government. Using a simple prompt and their own names, they created imaginative stories powered by AI, sparking laughter, curiosity, and a sense of ownership over their creations."
        },
        {
            "text": "The classroom buzzed with excitement as pupils eagerly shared their stories with the class, proudly reading them aloud and asking how they could do more with computers. Some gave their characters superpowers or made themselves Prime Minister for the day. One pupil beamed, “It’s so fun using a computer to do things and now I want to work with digital things more!” Another reflected, “Now I know all the different things that we can use AI to do and how it can help with my job later.”"
        },
        {
            "text": "Pupils left the session not only with a better understanding of digital careers, but with a sense that those careers could belong to them. The activity helped demystify technology and government, showing that creativity, curiosity, and public service can go hand in hand."
        },
        {
            "text": "What the pupils told us"
        },
        {
            "text": "Pupils explore digital careers through interactive activities during Careers and Aspirations Week at Wendell Park Primary School."
        },
        {
            "text": "Before the session, only 14% of pupils had considered a career in digital or data. Afterward, 86% said it now sounded interesting or something they’d love to do."
        },
        {
            "text": "This shift shows how even a short, engaging session can spark curiosity and open minds."
        },
        {
            "text": "These numbers tell a story about untapped potential. Behind each statistic is a young person who might never have imagined themselves working in government, now picturing a future where they could make a real difference."
        },
        {
            "text": "The feedback we received from pupils was a powerful reminder of the impact early outreach can have. "
        },
        {
            "text": "One pupil shared, “I thought that if you work for the government then your job was boring, but I got to learn about the fun things that you could do.” "
        },
        {
            "text": "Another said, “Now I know that I can get a job doing digital things for the government and that’s really cool because I can help people that live in our country!”"
        },
        {
            "text": " A third reflected, “It’s so fun using a computer to do things and now I want to work with digital things more!” These reflections show how even a single session can shift perceptions and spark ambition."
        },
        {
            "heading": 3,
            "text": "Reflections"
        },
        {
            "text": "This session was co-led by Marwa and Anna, whose personal stories and energy helped bring digital careers to life for the pupils. Their passion and authenticity were key to making the session relatable and inspiring. By sharing their own journeys into the Civil Service, they helped pupils see that these careers are not only possible but personal."
        },
        {
            "text": "This session offered a meaningful opportunity to broaden young people’s understanding of digital and data careers. It also highlighted how early engagement, relatable role models, and storytelling can play a powerful role in shaping a more inclusive and future-ready Civil Service."
        },
        {
            "text": "As the Prime Minister sets out a bold new vision for a digital-first Civil Service, where one in ten civil servants will work in digital and data roles, our outreach efforts are not just timely, they’re essential. By connecting with young people early, we’re helping to build the talent pipeline that will power future public services. This is about more than filling roles; it’s about shaping a Civil Service that reflects the diversity, creativity, and potential of the communities it serves."
        },
        {
            "text": "We’re grateful to Wendell Park Primary School for inviting us and to the pupils for their energy and enthusiasm. We look forward to continuing this work, partnering with schools, communities, and colleagues across government to inspire the next generation of digital and data professionals."
        },
        {
            "text": "This outreach work is more than career guidance, it's about building tomorrow's public sector. When young people see themselves reflected in government roles, when they understand how digital and data skills can serve their communities, we're not just filling future job vacancies. We're ensuring the Civil Service draws talent from every corner of society to serve everyone effectively."
        },
        {
            "text": "Every school visit, every inspired question, every pupil who leaves thinking 'I could do that' brings us closer to a truly representative digital government."
        },
        {
            "heading": 3,
            "text": "Pathways into Digital Careers"
        },
        {
            "text": "For those inspired by this work, there are a range of entry-level pathways into digital and data roles in government. Programmes like TechTrack and the Digital Fast Stream offer structured routes into the profession, while departments across government are piloting their own outreach and early talent initiatives. These efforts collectively support a more inclusive and future-ready Civil Service."
        },
        {
            "heading": 3,
            "text": "Get in touch"
        },
        {
            "text": "The Prime Minister has set out a bold new vision for a digital-first Civil Service, where one in ten civil servants will work in digital and data roles. This ambition demands action now."
        },
        {
            "text": "Ready to inspire the next generation of digital leaders? Whether you're in London or Leeds, Edinburgh or Exeter, there are young people in your local schools who could be tomorrow's data scientists, user researchers, or digital policy experts. Let's work together to show them the way."
        },
        {
            "text": "Contact us at digitaldatacapability@dsit.gov.uk to start planning outreach in your area."
        }
    ]
}