{
    "url": "https://educationhub.blog.gov.uk/2023/06/alternatives-to-a-levels-and-university-what-you-need-to-know/",
    "title": "Alternatives to A Levels and university: What you need to know",
    "authors": [
        "media officer"
    ],
    "categories": [
        "Further education",
        "Higher Education"
    ],
    "pub_date": "2023-06-27T16:29:32+01:00",
    "content": [
        {
            "text": "Thinking about what’s next after you leave school? Gaining a university degree is just one option and there are many different paths you could take, from apprenticeships to higher technical qualifications."
        },
        {
            "text": "And while it’s compulsory for young people to be in education or training until the age of 18, it doesn’t mean you have to stay in school and take A Levels if it’s not the right fit for you."
        },
        {
            "text": "The best choice for you will depend on your situation and the career or job you have in mind. Here we look at some of the alternative options to A Levels and university route for those who are aged 16 and older."
        },
        {
            "heading": 3,
            "text": "Options for 16-year-olds considering alternative routes:"
        },
        {
            "heading": 3,
            "text": "Apprenticeships "
        },
        {
            "text": "Apprenticeships are paid jobs, which give thousands of people the opportunity to gain the skills and on-the-job experience needed to hit the ground running in their chosen profession."
        },
        {
            "text": "There has never been as many great apprenticeship options to choose from, available in a diverse range of industries, including digital, construction, nursing, fashion, teaching, film and TV, to name a few. There are options to train at every level right up to degree level, offering the chance to work in some of the country’s top companies."
        },
        {
            "text": "Alongside on-the-job training, apprentices spend at least 20% of their time in off-the-job training with a training provider, such as a college or university, learning skills and building confidence for the workplace."
        },
        {
            "text": "Although you must be over 16 to take an apprenticeship, you can start an apprenticeship at any age. This could be because you are starting your career, want a change or upskilling in your current job."
        },
        {
            "heading": 3,
            "text": "T Levels "
        },
        {
            "text": "T Levels are a high-quality alternative to A levels in a wide range of subjects."
        },
        {
            "text": "One T Level is a similar size to three A Levels and attracts the same UCAS points. They are two-year programmes with 80% of that time spent in the classroom, and 20% on an industry placement with an employer."
        },
        {
            "text": "Focussing on technical skills, T Levels have been designed with leading employers to give you the knowledge and skills you need to progress into work, further study (including university) or an apprenticeship."
        },
        {
            "text": "T Levels combine class-based learning with an industry placement, giving you the chance to get hands-on experience and learn what a real career is like while you continue your studies."
        },
        {
            "text": "You’ll also get a nationally recognised qualification when you pass, which will show the grade you achieve for your T Level overall as well as grades for the two key assessments that you’ll take as part of the course, helping you to take the first steps in your career."
        },
        {
            "text": "The first 16 T Levels been launched, and our aim is to have 24 T Levels available. They are available at schools and colleges across the country."
        },
        {
            "text": "Visit this link to find a school or college offering T Levels near you."
        },
        {
            "heading": 3,
            "text": "Vocational technical qualification (VTQs)"
        },
        {
            "text": "VTQs are practical qualifications for over 16s. They're designed to help students get the skills they need to start their career or go on to higher levels of education."
        },
        {
            "text": "VTQs focus on a specific job or a broad employment area, such as childcare, engineering or IT."
        },
        {
            "text": "They’re usually taken at a school or college. They might be an appropriate avenue for someone if they have a strong interest in working in a particular industry."
        },
        {
            "text": "Visit Vocational technical qualifications (VTQs) | National Careers Service for more information."
        },
        {
            "heading": 3,
            "text": "Options for 18-year-olds considering alternative routes:"
        },
        {
            "heading": 3,
            "text": "Degree Apprenticeships "
        },
        {
            "text": "If you want to get a degree, but you’re not sure that a traditional university course is right for you or you’re worried about finances, a degree apprenticeship could be a great option."
        },
        {
            "text": "Degree apprenticeships are jobs with training. On completion of the apprenticeship, you’ll achieve an undergraduate or master’s degree – just like someone who has got their degree through a traditional route."
        },
        {
            "text": "Your training is paid for by apprenticeship funding, so unlike with traditional university courses, you won’t have to pay for your tuition yourself. What’s more, you’ll earn a competitive salary while learning."
        },
        {
            "text": "Though you’ll study part-time at a university, around 80% of your time will be spent doing practical work. This allows you to get real-life work experience and still gain a recognised qualification. Degree apprenticeships are a Level 6 or 7 apprenticeship."
        },
        {
            "text": "You apply to degree apprenticeships direct with the employer. You can now search for degree apprenticeships via the Find an Apprenticeship website or via UCAS."
        },
        {
            "heading": 3,
            "text": "Higher technical qualifications (HTQs)"
        },
        {
            "text": "HTQs  are a high-quality alternative to a traditional 3-year degree and degree apprenticeship. They are new and existing level 4/5 qualifications that provide the skills needed by employers, as approved and quality marked by the Institute for Apprenticeships & Technical Education (IfATE). HTQs are a particularly suitable progression option for T Level graduates who can continue to develop knowledge and skills in the same technical route."
        },
        {
            "text": "The teaching of digital HTQs started in September 2022, and HTQs in Construction and Health and Science will be available later this year."
        },
        {
            "text": "HTQs in Business & Administration, Education & Early Years, Engineering & Manufacturing and Legal, Finance & Accounting will be available from September 2024. A full list of approved HTQs is available."
        },
        {
            "text": "To help students study HTQs flexibly around their other commitments, they will be eligible for both tuition fee and maintenance loans, from September 2023. They will be able to access this whether they are studying full or part-time, on the same basis as degree level courses."
        },
        {
            "text": "HTQs will be among the first courses eligible for modular funding when the Lifelong Loan Entitlement launches in AY2025/26, as announced on 7 March."
        },
        {
            "text": "Information on HTQs is available here: Higher technical qualifications (HTQs) | National Careers Service."
        },
        {
            "heading": 3,
            "text": "For those who want to go straight to work:"
        },
        {
            "heading": 3,
            "text": "School leavers scheme"
        },
        {
            "text": "Some companies offer school leaver schemes to young people who have completed A levels. The schemes allow young people to learn and train with a large company while earning a wage."
        },
        {
            "text": "School leaver schemes are usually like graduate schemes, except they’re aimed at school leavers. These can be applied for while students are still in school. Employers create their own schemes, so students need to check each company’s website to see if a school leaver scheme is available and to apply."
        }
    ]
}