{
    "url": "https://marinescience.blog.gov.uk/2023/06/27/food-for-the-future-understanding-the-challenges-and-options-for-sustainable-food-production-in-england-using-recirculating-aquaculture-systems/",
    "title": "Food For the Future: Understanding the Challenges and Options for Sustainable Food Production in England using Recirculating Aquaculture Systems",
    "authors": [
        "Keith Jeffery"
    ],
    "categories": [
        "Aquaculture",
        "Fisheries"
    ],
    "pub_date": "2023-06-27T16:00:35+01:00",
    "content": [
        {
            "text": "With increasing concerns around food security in the face of growing populations, climate change and recent global events, such as the Ukraine invasion, the UK government is turning their attention to new and innovative ways of meeting future food demands and tackling rising prices.  "
        },
        {
            "text": "One method of focus is the use of Recirculating Aquaculture Systems (RAS). Unlike traditional aquaculture where fish are grown outdoors, RAS is a modern and highly technical form of aquaculture, which uses indoor tank systems to grow fish in a more controlled environment. By using a closed-loop system that recirculates water, RAS minimises the risks associated with conventional fish farming practices such as escapees, pollution via effluents, predation, biosecurity, water usage, and habitat preservation.   While RAS development in England has been slow in the last three decades, it has gained international recognition due to the increasing scale and technological improvements of the systems.  "
        },
        {
            "text": "The role of RAS in the English Aquaculture Plan "
        },
        {
            "text": "The UK government was interested in the potential for RAS to help achieve the targets set out in the English Aquaculture Plan (34,608 tonnes of aquatic food production per year by 2040) whilst also achieving the sustainability objective within the Fisheries Act 2020. To understand the feasibility of RAS production in England, as well as the potential challenges, scientists at the Centre for Environment, Fisheries, and Aquaculture Science (Cefas) conducted an extensive literature review and stakeholder survey. This comprehensive study engaged various stakeholders, including RAS funders, operators, regulators, consultants, academia, Non-Governmental Organisations (NGOs), and trade organisations.  "
        },
        {
            "text": "Environmental, regulatory and economic challenges "
        },
        {
            "text": "The survey results revealed that despite increasing global interest, RAS in England are currently limited to  small-scale aquaculture farms, hatcheries and holding systems with a few larger scale systems in early developmental stages. However, global growth in RAS continues apace with systems being built capable of producing 5 to 120 thousand tonnes per year. "
        },
        {
            "text": "Within RAS literature a common finding  was a concern about energy costs and the carbon footprint of the systems. However, efforts are underway within the industry to reduce the energy cost per kilo of production through design and operational efficiencies, use of renewable energy sources, reuse of waste, and locating production closer to markets to improve fuel efficiency.  "
        },
        {
            "text": "Findings from the survey highlighted that despite the advantages of RAS, operators in England face challenges related to site selection for larger production units, as well as the time and costs associated with obtaining licenses and permissions. The growth of RAS systems is thought to be most likely on brownfield sites and terrestrial farms where infrastructure already exists, and simplified licensing and permitting systems are in place.  "
        },
        {
            "text": "Another challenge identified in the study is the need for specialised skills for a  RAS workforce. Traditional aquaculture skills do not easily transfer to RAS, highlighting the importance of universities and other educational institutions in developing new RAS designs whilst providing skilled graduates to support the sector's growth. "
        },
        {
            "text": "Operational/production costs are another barrier to the widespread adoption of RAS within England, with industry stakeholders highlighting the high initial costs and regulatory barriers as the main obstacles limiting the sector's growth. Given that initial costs are higher than for conventional aquaculture, RAS systems are economically vulnerable due to long break-even periods, which are further extended when unforeseen events such as power failures or disease outbreaks occur. To overcome these challenges, the industry has called for increased financial incentives for research and development stages and support through the early stages of start-up."
        },
        {
            "text": "The path to sustainable aquatic food production "
        },
        {
            "text": "RAS offer a promising solution to some of the challenges faced by the aquatic food system and the need for sustainable seafood production. While RAS development in England has been limited, international investments and growth, along with emerging technologies, demonstrate the potential for RAS to contribute significantly to global aquatic protein supply.  "
        },
        {
            "text": "Overcoming regulatory barriers, addressing the carbon footprint, reducing operating and capital costs and incentivising research and development are crucial steps towards realising the full potential of RAS. If England embraces RAS, the review and survey suggest that England could enhance its aquatic food production figures, and achieve the targets within the English Aquaculture plan whilst using a minimal spatial footprint in a way that removes many traditional impacts of aquaculture."
        }
    ]
}