{
    "url": "https://socialcare.blog.gov.uk/2023/06/27/supporting-delegated-healthcare-in-the-care-workforce/",
    "title": "Supporting delegated healthcare in the care workforce",
    "authors": [
        "Melanie Weatherley MBE"
    ],
    "categories": [
        "Care and support",
        "Social care reform",
        "Workforce"
    ],
    "pub_date": "2023-06-27T12:49:52+00:00",
    "content": [
        {
            "heading": 2,
            "text": "Making delegation business as usual"
        },
        {
            "text": "The delegation of healthcare activities is not new – parents are trained to undertake highly technical interventions to support children living with complex conditions. Meanwhile, diabetics have managed their own blood glucose and insulin successfully for many years."
        },
        {
            "text": "If we become unable to do these things for ourselves, this often becomes the responsibility of health professionals, even when the activity does not need the knowledge and expertise of a nurse. Is this the only way to support people? Or would delegation of some of the activities to others who care for an individual give better outcomes? I think it could if delegation is seen as an innovative choice rather than a way to manage scarce resources."
        },
        {
            "text": "During the COVID-19 pandemic, when we wanted to minimise the number of people each of us saw, nurses enabled and encouraged us, as care staff, to support our service users with wound dressings, insulin management, physiological readings etc."
        },
        {
            "text": "When the pandemic was over, many of us wanted to carry on doing this work, if done safely and the extra contribution and responsibility was recognised. If delegation is done properly it can give the person who draws on care and support more control as well as giving care staff opportunities to develop."
        },
        {
            "text": "Delegating some of the more routine aspects of healthcare can give our skilled health colleagues more time to devote to those who need their knowledge and expertise – perhaps they have a newly diagnosed issue which they need help to manage effectively."
        },
        {
            "text": "It also means individuals can manage their condition rather than the other way around. If a dressing comes off in the shower, it is much more dignified for the individual if the carer helping with the shower can replace it, if appropriate, rather than wait for the nurse and get undressed again."
        },
        {
            "text": "Here’s an example of the difference delegation can make and why it made me determined to explore making these activities a normal part of our health and care support."
        },
        {
            "heading": 2,
            "text": "Safety first and always"
        },
        {
            "text": "I recognise there are risks with delegation. It must always be done for the benefit of the person drawing on care and support and should have a clear governance structure around it to keep everyone safe."
        },
        {
            "text": "The publication of guiding principles for delegated healthcare activities is a major step in the right direction, helping to embed best practice, safety and expanded skill sets right across the care workforce. Additional resources, including a new toolkit, will further support this upskilling. Here's a sample toolkit created in association with Lincolnshire Care Association."
        },
        {
            "text": "When I started to work on a toolkit to help with delegation it was like dropping a pebble into a pond, each conversation led to another “what about…?” thought."
        },
        {
            "text": "Delegation is often seen as relating just to the delegator and the person the task is delegated to – with the individual's consent. However, it became clear to me this position is probably not sustainable and may not be safe."
        },
        {
            "text": "We need simple but comprehensive procedures to make sure everything is considered (including resources) and all involved are aware what is happening and not reliant on particular individuals, however well meaning."
        },
        {
            "text": "If you support people who have health and social care needs think about whether their lives could be made better by delegating some of the health interventions. Speak to your colleagues and develop a process to deliver safe, sustainable delegation."
        }
    ]
}