{
    "url": "https://environmentagency.blog.gov.uk/2023/06/27/using-herbicides-to-protect-our-flood-defences-from-invasive-plants/",
    "title": "Using Herbicides to protect our flood defences from invasive plants",
    "authors": [
        "Environment Agency"
    ],
    "categories": [
        "Environment Agency"
    ],
    "pub_date": "2023-06-27T13:57:37+00:00",
    "content": [
        {
            "text": "The Environment Agency is responsible for carrying out maintenance work on its assets to ensure they will perform as they should during a flood."
        },
        {
            "text": "Field team operatives and contractors use various tools and methods to carry out seasonal vegetation management on sections of watercourse that are within a flood alleviation scheme. This work is carried out to aid the conveyance of floodwater during periods of high flows. This allows the floodwater to pass through the scheme as freely as possible reducing the likelihood of a blockage and reducing the flood risk."
        },
        {
            "text": "Where we are unable to use the more traditional methods of vegetation management, trained staff with the appropriate certifications, licenses and permissions can use herbicides to control vegetation."
        },
        {
            "text": "Environment Agency staff and contractors use herbicides to control the growth of non-native invasive species, like Japanese Knotweed, Giant Hogweed and Floating Pennywort. These plants reduce the biodiversity of our native flora and fauna in places where we carry out maintenance to our structures or maintenance for conveyance.\nEnvironment Agency staff also apply herbicides in very specific locations where the growth of a particular plant could cause damage to parts of a flood alleviation scheme or affect how an asset operates to reduce flood risk to properties."
        },
        {
            "text": "Buddleja or “butterfly bush” is a very hardy and opportunistic plant. Although its flowers are an excellent source of nectar for butterflies and bees, its tough root system and ability to grow in the cracks of walls and masonry cause issues to the structural integrity of some of the flood alleviation schemes or other assets."
        },
        {
            "text": "Many of these flood alleviation schemes are engineered hard defences. When vegetation establishes itself in the masonry and expansion joints on these structures, sometimes cutting these plants back is not enough as many plants, like the Buddleja, will continue to grow back. Over time the root network will establish itself and could compromise parts of these assets - causing damage that may require a costly repair. To permanently control the plant and reduce the impact of the damage caused, Environment Agency staff may use an appropriate herbicide."
        },
        {
            "text": "The Environment Agency is also responsible for maintenance of the grass embankments that make up parts of many flood alleviation schemes across the country. The grass is a very important component of the scheme as its dense sward provides erosion protection to the embankment. When vegetation that could compromise the integrity of the asset establishes itself on the grass embankment, we may have to use a herbicide to ensure that the plant is controlled, reducing long-term damage to the asset."
        },
        {
            "text": "If you are planning to use herbicides to control weeds in water or on the banks next to a waterbody or watercourse, follow this link for more guidance and information.\nApplication to use herbicides in or near water - GOV.UK (www.gov.uk)"
        },
        {
            "text": "Follow the link below for more information on rights and responsibilities for riparian owners.\nOwning a watercourse - GOV.UK (www.gov.uk)"
        },
        {
            "text": " "
        }
    ]
}