{
    "url": "https://forestrycommission.blog.gov.uk/2024/02/19/biodiversity-net-gain-what-can-we-expect-for-trees-and-woodlands/",
    "title": "Biodiversity net gain – what can we expect for trees and woodlands?",
    "authors": [
        "Amanda Newsome"
    ],
    "categories": [
        "Woodland creation",
        "Woodland management"
    ],
    "pub_date": "2024-02-19T15:12:39+00:00",
    "content": [
        {
            "text": "From 12th February 2024 major Town and Country Planning Act developments in England must deliver a Biodiversity Net Gain (BNG)  This means for the very first time, new developments will need to make sure they have a positive impact on nature. All habitats will be recognised in the planning system for their value for wildlife and people, leading to positive outcomes for nature, better places for local communities and more consistent and transparent requirements for developers. "
        },
        {
            "text": "Here at the Forestry Commission, we are excited at the opportunities BNG brings, not just for planting more trees and woodlands, but protecting those we already have and encouraging their management for nature recovery.  "
        },
        {
            "heading": 2,
            "text": "Protecting trees and woodlands  "
        },
        {
            "text": "Developers must already comply with policies protecting the natural environment, such as avoiding impacts on irreplaceable habitats including ancient woodland and ancient and veteran trees, and compensating for their loss or deterioration. "
        },
        {
            "text": "None of these existing protections will change because of BNG, but safeguards built into the biodiversity metric will bring an extra layer of protection for our UK Biodiversity Action Plan priority habitat woodlands (Habitats of Principal Importance), because any loss of these will have to be compensated on a like-for-like basis. For example, if your development impacts an upland oak wood, you must compensate with biodiversity units of the same upland oak woodland type.  "
        },
        {
            "text": "From Forestry Commission KPI data we know that, since 2015, development has been responsible for approximately half of the total woodland loss recorded in England. Through these inbuilt safeguards, BNG could have a really positive effect in reversing the current rates of woodland loss due to development.  "
        },
        {
            "heading": 2,
            "text": "Increasing canopy cover "
        },
        {
            "text": "BNG also has the potential to help deliver the Environmental Improvement Plan target of increasing tree canopy cover to 16.5% by 2050 through both woodland creation and tree planting.  "
        },
        {
            "text": "Planting trees is an attractive option for any developer to consider because each tree planted adds to the proportion of their 10% net gain they can deliver ‘on-site’, within their development boundary.  "
        },
        {
            "text": "We will continue to work with Local Planning Authorities and industry specialists to signpost developers toward best-practice guidance around tree choice, siting and establishment when planting trees within new developments, to give them the best chance of growing to maturity, contributing to nature recovery and climate resilience in our towns and cities. "
        },
        {
            "text": "Creating new woodlands will also deliver net gains. As a rule, the higher the proportion and the wider the variety of native species you plant, the greater the number of biodiversity units you can generate. These new woodlands won’t always be within a development – many will be 'off-site', planted by land managers wanting to generate income by selling biodiversity units from their land to developers who can’t deliver their 10% net gain 'on-site'.  "
        },
        {
            "text": "If you are a land manager thinking of using BNG to fund your new woodland planting, make sure you read the woodland creation section of the Biodiversity Metric User Guide. This includes advice on which woodland types to use in your metric calculations and the importance of setting a realistic target condition for the woodland you are planting.  "
        },
        {
            "heading": 2,
            "text": "Bringing woods into management"
        },
        {
            "text": "Equally important is the potential for BNG to provide financial returns for bringing existing woods and trees into management to increase their biodiversity. The latest Forestry Commission KPI data for 2022-23 suggests that only 58% of our woods are being sustainably managed and less than 10% of our native woodlands are in good ecological condition. "
        },
        {
            "text": "BNG can provide an economic return for managing your woods for a 30-year period, giving a guaranteed income over that time. It can also fund the restoration of Plantations on Ancient Woodland Sites (PAWS), some of our most important woodland sites, replacing the non-native, planted trees with native species. "
        },
        {
            "heading": 2,
            "text": "Helping land managers benefit from BNG "
        },
        {
            "text": "We have been working on a couple of things to help land managers and woodland owners take advantage of the opportunities from BNG. We will provide guidance on how BNG can work alongside the England Woodland Creation Offer (EWCO) and we are developing an App to help assess woodland condition for BNG.  "
        },
        {
            "text": "In the meantime BNG guidance for land managers, Local Planning Authorities and developers is available."
        },
        {
            "text": "There are still uncertainties about the size of the market for Biodiversity Units and the prices they might fetch. But, given that there are tens of thousands of planning permissions granted in England each year, we’re confident that BNG will contribute towards delivering more and better managed trees and woodland in England in the future.  "
        }
    ]
}