{
    "url": "https://childrenssocialcare.blog.gov.uk/2024/02/19/cross-sector-action-to-improve-support-for-children-in-complex-situations/",
    "title": "Cross sector action to improve support for children in complex situations",
    "authors": [
        "Justin Russell",
        "John Pearce",
        "Professor Prathiba Chitsabesan"
    ],
    "categories": [
        "Leadership",
        "Social work: the profession",
        "Wellbeing"
    ],
    "pub_date": "2024-02-19T10:07:06+00:00",
    "content": [
        {
            "text": "Justin Russell is the Director General for Families Group and is responsible for children’s social care at the Department for Education; John Pearce is the president of the Association of Directors of Children's Services (ADCS); and Professor Prathiba Chitsabesan is National Clinical Director for Children and Young People’s Mental Health at NHS England.  "
        },
        {
            "text": "As joint authors of this blog, Justin, John and Professor Chitsabeasan share an update on action being taken from across the sector to improve support for children and young people in complex situations with multiple needs. "
        },
        {
            "text": "The task and finish Group  "
        },
        {
            "text": "The last resort High Court measure, which allows children to be placed under severe restrictions because of concerns about their welfare, has been used to deprive 1,249 children of their liberty in England and Wales in 12 months up to June 2023. Deprivation of Liberty (DoL) orders vary from case to case, but generally they restrict a child’s freedom and confine them to one location. These children are some of the most vulnerable in our society and we must do all that we can to keep them safe and help them fulfil their potential.  "
        },
        {
            "text": "Justin Russell said: “It is so important that we come together across our sectors to ensure we are doing everything we can to ensure our most vulnerable children receive the care they need - and we are committed to coming together as key members and leaders in the community to achieve this.“ "
        },
        {
            "text": "Following the conclusion of the Deprivation of Liberty Court pilot, the Government established a new task and finish group to improve the outcomes of children who are in complex situations with multiple needs and are currently, or at risk of, being deprived of their liberty.  "
        },
        {
            "text": "The task and finish group has agreed to several independent research reports aimed at increasing the government’s understanding of the issues local areas are facing when designing, commissioning, and delivering suitable provision for children with complex trauma. These reports will be a vital first step in supporting the development of evidence based, therapeutic, and integrated co-commissioned models of care and provision which meet the needs of these children.   "
        },
        {
            "text": "The Office of the Children’s Commissioner is also leading a project to hear directly from children who have been deprived of their liberty, their parents and the professionals that support them.  "
        },
        {
            "text": "The task and finish group will draw from the findings of these reports to develop and pilot evidence-based models of safe, therapeutic care that delivers integrated, consistent, and collaborative practices for these children and young people, alongside other guidance and resources that are informed by evidence, existing good practice, and most importantly, by what children, young people and parents/carers say they want and would find helpful.   "
        },
        {
            "text": "Principles of care for children with complex needs and circumstances  "
        },
        {
            "text": "One of the key aims of the task and finish group and our policy work is to support local areas to commission joint and shared care across sectors, that delivers integrated and consistent practices for these children and young people. It is vital that across the system, we can bring together safe, age-appropriate Ofsted-registered accommodation, with co-produced packages of care and plans to support young people back into their community.  "
        },
        {
            "text": "The Nuffield Family Justice Observatory has recently published its principles of care framework for children with complex needs and circumstances. The framework sets out 5 principles of care based around these needs which practitioners and professionals from across the sector may wish to practise in their work. Embedding these 5 principles will help us to improve outcomes and in turn reduce reliance on the inherent jurisdiction of the High Court to deprive these children and young people of their liberty.  "
        },
        {
            "text": "What can be done now?  "
        },
        {
            "text": "Across England there are local areas where the NHS and local authorities, with support from their Integrated Care Board, are working together to swiftly identify need and improve outcomes and accountability. For example, the Hope Service in Surrey provides a multiagency service for young people who are experiencing complex mental health, emotional, social and behavioural challenges.  "
        },
        {
            "text": "The Framework for Integrated Care supports the NHS Long Term Plan commitment to invest in additional support for the most vulnerable children who have complex needs. The emphasis of the Framework is on complex and often fractured systems, across multiple agencies, working together for the individual child and family/carers.    "
        },
        {
            "text": "Further reading and resources:  "
        },
        {
            "text": "Case studies and shared learning from the 12 vanguard sites that are implementing the Framework "
        },
        {
            "text": "NHS England  "
        },
        {
            "text": "Nuffield Family Justice Observatory  "
        },
        {
            "text": "Local Government Association "
        },
        {
            "text": "TRAINING RESOURCES  "
        }
    ]
}