{
    "url": "https://buyingforschools.blog.gov.uk/2024/02/19/cyber-security-for-schools-the-benefits-of-the-risk-protection-arrangement-rpa/",
    "title": "Cyber security for schools – the benefits of the risk protection arrangement (RPA)",
    "authors": [
        "Louise Green, Engagement and Information Manager"
    ],
    "categories": [
        "Advice and support"
    ],
    "pub_date": "2024-02-19T12:00:41+00:00",
    "content": [
        {
            "text": " "
        },
        {
            "text": "Cyber-crime can have a devastating impact on schools. In this blog post Louise Green from the Department for Education’s Schools Commercial Team, hears from three schools that have suffered cyber incidents and explains the benefits of joining the risk protection arrangement (RPA), the DfE’s alternative to commercial insurance."
        },
        {
            "text": "Cyber crime"
        },
        {
            "text": "Ensuring schools and trusts have robust measures in place to reduce the risk of cyber-crime is paramount."
        },
        {
            "text": "Hopefully, you will never encounter a problem or have to deal with the aftereffects a cyber incident can have on your school. We live in a time of increased reliance on IT and online systems, and consequently this increases the risk of a cyber-attack."
        },
        {
            "text": "We acknowledged this increased risk and the concerns raised by schools, when the department took the decision to add cyber to the wide range of cover within of the RPA."
        },
        {
            "text": "If your school is already an RPA member, here’s a quick reminder of the four conditions to ensure you are fully covered, you must:"
        },
        {
            "text": "A cyber incident can be time consuming and expensive to put right and potentially affect your schools’ ability to function. It is increasingly important to make sure you have sufficient, reliable cyber cover. Through the RPA cyber cover, help is just a phone call away, 24 hours a day should an incident occur."
        },
        {
            "text": "Through the RPA’s cyber incident cover, experts will be on-hand to guide and support you to rectify the situation as quickly as is possible."
        },
        {
            "text": "I’ve spoken to a number of schools who were unfortunately impacted by a cyber incident. Luckily, they were all RPA members who had made sure the four components for cover were completed, so they were able to tap into the support available and avoid what could have been a very costly bill for their schools."
        },
        {
            "text": "Settle College are RPA members who had met the required cyber cover conditions, so were able to avoid costs of around £128,000."
        },
        {
            "text": "And lastly, I spoke to Claire Curchin, Business Manager at Bishop Stopford School in Headlands, Kettering, she told me:"
        },
        {
            "text": "As RPA members, Bishop Stopford School avoided a £45,000 bill following a cyber incident at their school."
        },
        {
            "text": "Find out more"
        },
        {
            "text": "There’s more information about RPA cyber cover on our “RPA members – if an incident were to happen, is your school cyber secure and are you covered?” blog."
        },
        {
            "text": "In addition to cyber cover, joining the RPA offers a wider range of benefits to schools and is a valuable safety net that can help to protect your school's finances, here’s a quick summary of some additional benefits:"
        },
        {
            "text": "For more information about the RPA, please visit the GOV.UK RPA website or contact schools.commercial@education.gov.uk ."
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        }
    ]
}