{
    "url": "https://mhclgmedia.blog.gov.uk/2024/02/19/department-announces-changes-to-short-term-lets-rules/",
    "title": "Department announces changes to short-term lets rules",
    "authors": [
        "mhclgpress"
    ],
    "categories": [
        "Housing",
        "Planning"
    ],
    "pub_date": "2024-02-19T12:34:08+00:00",
    "content": [
        {
            "text": "There has been widespread coverage across national and regional media of new changes to short-term lets rules."
        },
        {
            "text": "Under the reforms councils will be given greater power to control short-term lets by making them subject to the planning process. Meanwhile, a new mandatory national register will give local authorities the information they need about short-term lets in their area."
        },
        {
            "text": "The Financial Times, Daily Mail, Telegraph, Independent, the Express, the Evening Standard and PA all cover the department’s new proposals,  while the plans are splashed on the Yorkshire Post’s front page, with the piece explaining that the Government announced a consultation on the policy last April, with further details expected in the coming weeks ahead of changes being brought in from this summer."
        },
        {
            "text": "All pieces focus on the details of the proposed changes and include a quote from the Secretary of State, as well as a supportive statement from Amanda Cupples, northern Europe general manager at Airbnb, who says the introduction of a short-term lets register is good news for everyone. This statement is also carried in a news piece on the company’s website welcoming the Government’s proposals."
        },
        {
            "text": "On the airwaves, the BBC’s Today programme reported on the announcement by interviewing Airbnb’s Amanda Cupples who said the company strongly supports the Government's plans. She stressed that they will give families who are letting on Airbnb “clear rules”, while giving local authorities “access to reliable information that they need to assess housing impacts”."
        },
        {
            "text": "As part of the announcement, the Secretary of State visited St Agnes in Cornwall and was interviewed by ITV West Country and BBC South West for pieces on their news bulletins."
        },
        {
            "text": "Alongside media, the Department has published a video of the Cornwall visit on its social channels outlining the details of the announcement and how the changes will help local people."
        },
        {
            "text": "Secretary of State for Levelling Up Housing and Communities, Michael Gove said:"
        },
        {
            "text": "Short-term lets can play an important role in the UK’s flourishing tourism economy, providing great, easily-accessible accommodation in some of the most beautiful parts of our country."
        },
        {
            "text": "But in some areas, too many local families and young people feel they are being shut out of the housing market and denied the opportunity to rent or buy in their own community."
        },
        {
            "text": "So the Government is taking action as part of its long-term plan for housing. That means delivering more of the right homes in the right places, and giving communities the power to decide."
        },
        {
            "text": "This will allow local communities to take back control and strike the right balance between protecting the visitor economy and ensuring local people get the homes they need.”"
        },
        {
            "text": "The proposed planning changes would see a new planning ‘use class’ created for short-term lets not used as a sole or main home. Existing dedicated short-term lets will automatically be reclassified into the new use class and will not require a planning application."
        },
        {
            "text": "Further details of these measures will be set out in the Government’s response to the consultations, including the timeline for implementation of the register, the use class and the individual permitted development rights - with the changes being introduced from this summer."
        }
    ]
}