{
    "url": "https://naturalengland.blog.gov.uk/2024/02/19/expert-insights-top-tips-for-biodiversity-net-gain-stewardship/",
    "title": "Expert insights: top tips for Biodiversity Net Gain stewardship",
    "authors": [
        "Natural England"
    ],
    "categories": [
        "Biodiversity",
        "Biodiversity Net Gain",
        "Biodiversity Net Gain – Hints and Tips",
        "Development",
        "Environment Act",
        "Environmental Improvement Plan",
        "Natural Capital",
        "Natural England",
        "Uncategorized"
    ],
    "pub_date": "2024-02-19T20:30:36+00:00",
    "content": [
        {
            "text": "Welcome to our second Natural England instructional Biodiversity Net Gain (BNG) guest blog. We are pleased to have distinguished experts share their 3 top tips on Biodiversity Net Gain stewardship. They are: "
        },
        {
            "text": "Claire Wansbury, FCIEEM FLS, Technical Director at AtkinsRéalis"
        },
        {
            "text": "My three top tips to manage and maintain habitats to deliver BNG are:"
        },
        {
            "text": "1. Targeting realistic habitats"
        },
        {
            "text": "When planning habitat creation or enhancement, it is vital to start with an achievable target for a site. If this first step is right, everything that follows is so much easier."
        },
        {
            "text": "Be realistic in the habitats you plan, taking the conditions of the site into account such as soil, hydrology, and future weather scenarios. For example, species-rich grassland needs nutrient-poor soil. Getting nutrient levels right for the target habitat will make creation and maintenance much easier."
        },
        {
            "text": "The Chartered Institute of Ecology and Environmental Management (CIEEM) has recently published Biodiversity Net Gain: Good Practice Principles for Development, A Practical Guide. It outlines ten principles for ecological restoration in the UK, focusing on habitat and ecosystem scales of restoration. It aims at practitioners in land and water management for development projects."
        },
        {
            "text": "2. Practical paperwork"
        },
        {
            "text": "Land used for BNG offsetting will require a Habitat Management and Monitoring Plan (HMMP). Guidance and a template are available to help with this."
        },
        {
            "text": "When completing the plan, it’s important to keep language simple and not to assume the end user has detailed ecological knowledge. Technical terms and scientific species names can be off-putting, which risks the plan being shelved and never referred to again. It’s vital to be specific and to consider species when managing the habitat. For example, if coppicing scrub is required to encourage new growth, the plan should state that this needs to be outside the bird nesting season."
        },
        {
            "text": "3. Adaptive management"
        },
        {
            "text": "BNG agreements commit to managing created or enhanced habitats for 30 years. Many things can change during that time, such as colonisation by an invasive plant, a pollution event on site or changes in weather because of a changing climate. A good management plan is a living document, which can be updated if monitoring shows it’s not having the desired results (adaptive management)."
        },
        {
            "text": "Sam Arthur, Director and Oliver Grice-Jackson, Associate Ecologist at FPCR Environment and Design Ltd"
        },
        {
            "text": "Our three top tips for successful BNG delivery include:"
        },
        {
            "text": "1. Setting appropriate targets"
        },
        {
            "text": "It's crucial to set feasible targets in the metric and HMMP. Targets should include enhancing land realistically for nature recovery. Consider factors like:"
        },
        {
            "text": "The key to successful BNG projects lies in setting appropriate, achievable targets. Setting realistic targets based on thorough assessment of land characteristics, especially soil properties, ensures the right habitat creation for effective nature recovery. It is also vital to have a good understanding of the local BNG market before you commit to investing in a project."
        },
        {
            "text": "2. Working with a great project team"
        },
        {
            "text": "A skilled team is essential, including ecologists, landscape architects, land managers, legal professionals, and BNG brokers. Each plays a critical role in assessing, monitoring, designing, managing, navigating legalities, and handling the commercial aspects of BNG projects."
        },
        {
            "text": "3. Planning for challenges"
        },
        {
            "text": "Anticipate and prepare for potential challenges over the 30-year management period. This involves planning for adaptability and resilience to address variables like climate change, invasive species, and new pests and diseases. Identifying risks, setting measurable trigger points for action, and including remediation plans in the cost plan are essential."
        },
        {
            "text": "Sue Charlton, Associate Ecologist at Environment Bank"
        },
        {
            "text": "My three top tips for managing and maintaining habitats for BNG are:"
        },
        {
            "text": "1. Know your land"
        },
        {
            "text": "Understanding your site is key, think about:"
        },
        {
            "text": "This will guide habitat design, conservation goals, and long-term management strategies. It also provides context for monitoring the results, showing what’s working, and identifying any necessary management tweaks."
        },
        {
            "text": "2. Consider your resources"
        },
        {
            "text": "Not just money, but any local resources available. Ask yourself..."
        },
        {
            "text": "Do you require grazing? If yes..."
        },
        {
            "text": "Do you require any machinery? If yes..."
        },
        {
            "text": "Remember, if you’re contracting machinery for things like meadow cutting, you may be last on the list if it’s harvest time!"
        },
        {
            "text": "3. Embrace the unexpected"
        },
        {
            "text": "Flexibility in your management is a must – at any stage!"
        },
        {
            "text": "We can set schedules for grassland cuts and livestock grazing, but management often depends on things outside our control, like the (increasingly unpredictable) weather."
        },
        {
            "text": "Your management strategy will also depend on what you’ve done in the past. It may change depending on your stage in the project."
        },
        {
            "text": "So, enjoy the journey! Nothing compares to seeing habitats reach their potential and watching wildlife flourish as a result."
        },
        {
            "text": "Further information"
        },
        {
            "text": "These experts collectively stress the importance of collaboration, adaptability, and expertise in achieving successful BNG stewardship, contributing to a better future for nature and people."
        },
        {
            "text": "Claire is an AtkinsRéalis Fellow and was the Society for the Environment’s Environmental Professional of the Year 2023, with over 30 years’ experience. For over a decade she has worked on novel ways of looking at how major infrastructure projects interact with the natural environment, particularly through BNG and Natural Capital approaches."
        },
        {
            "text": "Sam and Oli have over a decade of experience in BNG projects. They’ve collaborated with Natural England on creating a range of the published BNG tools. They have conducted 100s of on site BNG assessments and have a large portfolio of off site projects being designed and delivered. They have also worked alongside Local Authorities to:"
        },
        {
            "text": "Sue, an Associate Ecologist at Environment Bank, has dedicated her career to managing landscape-scale nature projects and providing valuable advice. More recently, she has spent the past two years working with Environment Bank, actively involved in co-creating Habitat Banks in partnership with landowners."
        }
    ]
}