{
    "url": "https://dluhcdigital.blog.gov.uk/2024/02/19/local-digital-update-adapting-our-approach-to-support-the-sector/",
    "title": "Local Digital update: Adapting our approach to support the sector",
    "authors": [
        "The Local Digital team"
    ],
    "categories": [
        "Local Digital"
    ],
    "pub_date": "2024-02-19T15:04:06+00:00",
    "content": [
        {
            "text": "The Local Digital team has two key ambitions: to improve the cyber resilience of the local government sector, and to use digital transformation to help councils deliver better services and increase their productivity."
        },
        {
            "text": "In 2022 we announced our next steps for Local Digital, and outlined a 3-year plan to address sector challenges and fix some of the structural issues holding us back. "
        },
        {
            "text": "Now, 18 months in, we want to reflect on our progress to date and share our plans to adapt our approach to take on a more strategic role as a ‘steward’. We’re excited about the role we aim to play moving forward, which has been informed by your feedback and input. "
        },
        {
            "heading": 2,
            "text": "Continuing our shared ambition for the sector"
        },
        {
            "text": "In the blog post from 2022, we said that “our approach has always been to support the Local Digital community to deliver more user-centred, cost-effective and secure local public services. This won’t change, and neither will the core principles of the Declaration.” "
        },
        {
            "text": "This is still true in 2024, and the principles of the Local Digital Declaration will continue to be a key part of our current and future offer. Since 2018, a community of 361 public sector organisations (including the majority of councils in England) have formed around the Declaration, committing to improve local public services in line with its principles."
        },
        {
            "text": "Recent user research has shown that the Declaration still has an important role to play in supporting cyber and digital transformation in the sector. As the Declaration nears its sixth anniversary, we’re working to make it a more useful tool for councils to use to bring about change and transformation."
        },
        {
            "heading": 2,
            "text": "Finding solutions to common problems: our digital approach to date"
        },
        {
            "text": "We know that one size doesn’t fit all, but by developing common building blocks, local authorities will be able to build services more quickly, flexibly and effectively.  "
        },
        {
            "text": "Over the last 5 years, we’ve been helping local government unlock the benefits of digital ways of working, to find solutions to common problems. There has been lots of great work, including seeing our funded projects inform a national Digital Planning Programme, the creation of LocalGov Drupal, and a growing movement in Open Referral Standard - among many others. "
        },
        {
            "text": "Through the Local Digital Declaration and the Local Digital Fund, we’ve championed a collaborative approach to improving local public services. The Local Digital team has provided support across project management, product ownership, agile delivery, user research and service design, and councils have fed back that the support and expert advice provided has been a valuable enabler for the sector. We’ve also provided training to over 3,000 council staff to develop their digital and cyber skills."
        },
        {
            "heading": 3,
            "text": "Testing an organisation-wide approach"
        },
        {
            "text": "While the Local Digital Fund has helped councils resolve specific service-level issues, the Future Councils programme took a ‘whole council’ approach, bringing together digital services and cyber security. The aim of the pilot, which ran between May and November 2023 with 8 diverse councils, was to understand the recurring barriers faced by councils when it came to innovation."
        },
        {
            "text": "As well as highlighting how many of our council colleagues are dedicated to digital transformation, the pilot enabled us to gain valuable insights into the challenges and opportunities for digital transformation in local government."
        },
        {
            "text": "We’re going to share our findings from the pilot very soon, but in the meantime we’ve developed a playbook of tools to help councils understand complex problems and their impact within organisations."
        },
        {
            "heading": 2,
            "text": "Taking a stewardship approach to supporting the sector"
        },
        {
            "text": "Our work to date has provided councils with support and funding to help them resolve specific issues, and explore wider systemic issues. But as a team we are committed to continuously improve what we do."
        },
        {
            "text": "Insights from our ongoing conversations with councils were the driver behind our current intensive period of review, which includes the ongoing evaluation study and analysis of our processes. So far, this has been critical in highlighting that, while we’ve delivered some real successes for the sector, our current structure isn’t able to deliver a big step-change when it comes to digital. We know our previous model also has limits when it comes to targeting key areas in the most effective way."
        },
        {
            "text": "That’s why we want to change our focus as a team. Reviewing our work to date and testing new approaches in Future Councils has shown we can be most effective where we lean into our position as a central government department. This means we’ll be working in a more strategic role as a ‘steward’, looking to bring the sector together to deliver modern digital services that enhance citizens’ lives. "
        },
        {
            "text": "We’re still working out what this might mean in practice—more to come shortly!—but broadly it means we’ll work more closely with key partners to draw together expertise, redefine our engagement with suppliers, and support the development of data standards and the scaling of digital solutions."
        },
        {
            "text": "We will continue to make grants to local government, as well as providing integral support and expertise, to support councils to build, accelerate and advance their digital maturity. However, in the short term, there are no plans for further funding through the current Local Digital Fund model. Our immediate focus for that workstream is supporting funded projects to deliver their outputs and share these across the sector to maximise impact."
        },
        {
            "heading": 2,
            "text": "Boosting cyber resilience: our cyber approach"
        },
        {
            "text": "We’ve always viewed cyber and digital as two sides of the same coin; securely designed user-centred services, that are not reliant on legacy technology, will ensure citizens can easily access the services they need, with the confidence that their data is safe. Since 2020, we have provided £19.9m of grant funding and technical support to 192 local authorities to improve their cyber maturity. Now, 90% of councils have fully implemented offline backups of their critical data, and the remaining 10% have work in progress to achieve this by May 2024."
        },
        {
            "text": "One of the challenges we know councils face is the lack of a clear baseline standard against which to assess their cyber security. To tackle this, we will be introducing the Cyber Assessment Framework (CAF) for the local government sector from 2024."
        },
        {
            "text": "We’ve undertaken a great deal of testing and piloting to ensure that we can introduce the CAF in an appropriate way, with helpful guidance that will support councils through the process. We’ll shortly be kicking off a final pilot to test our approach, before rolling the CAF out to the wider sector. We’ll share more about our plans in a blog post in the coming weeks."
        },
        {
            "heading": 3,
            "text": "What else we’re doing to build cyber resilience in the sector"
        },
        {
            "text": "The cyber threat to the local government sector is very real, present, and continuing to evolve. In response to this, we are excited to share that we are accelerating plans to support the sector to ‘Defend as One’ - harnessing the value of sharing cyber security data, expertise and capabilities across the sector."
        },
        {
            "heading": 2,
            "text": "More information coming shortly!"
        },
        {
            "text": "Thank you to everyone who has supported, engaged with, and helped to shape our work to date. We’re really excited for what’s to come."
        },
        {
            "text": " To stay up-to-date with Local Digital, including imminent Future Councils pilot findings and the latest on our cyber work, follow us on our usual channels:"
        }
    ]
}