{
    "url": "https://educationhub.blog.gov.uk/2024/02/19/mobile-phones-in-schools-are-they-being-banned/",
    "title": "Mobile phones in schools: are they being banned?",
    "authors": [
        "mediaofficer"
    ],
    "categories": [
        "Behaviour",
        "Schools"
    ],
    "pub_date": "2024-02-19T00:01:45+00:00",
    "content": [
        {
            "text": "By the age of 12, 97% of children own a mobile phone, but the use of mobile phones in school can lead to distractions, disruption and can increase the risk of online bullying. "
        },
        {
            "text": "Many schools have already introduced rules which prohibit the use of phones at school, to help children focus on their education, and the friends and staff around them.  "
        },
        {
            "text": "We’re introducing guidance which encourages all schools to follow this approach, so that more pupils can benefit from the advantages of a phone-free environment. Here’s everything you need to know. "
        },
        {
            "heading": 3,
            "text": "Are you banning mobile phones in schools? "
        },
        {
            "text": "The new guidance says that schools should prohibit the use of mobile phones, but they will have autonomy on how to do this. "
        },
        {
            "text": "Some may allow phones to be brought onto the premises but not to be used during school hours, including at breaktime. "
        },
        {
            "text": "This brings England in line with other countries who have put in place similar rules, including France, Italy and Portugal. "
        },
        {
            "heading": 3,
            "text": "Will this apply to all pupils?  "
        },
        {
            "text": "The guidance sets out that there will be some limited cases where pupils should be exempt from the rule. "
        },
        {
            "text": "While the majority of pupils won’t be allowed to use their mobile phones during the school day, we know that some children need their mobile phones for medical reasons, or because they have special educational needs and/or disabilities.  "
        },
        {
            "heading": 3,
            "text": "How will prohibiting mobile phones work in schools? "
        },
        {
            "text": "Schools will be able to choose an approach to prohibiting mobile phones which suits them. "
        },
        {
            "text": "This could include banning phones from the school premises, handing in phones on arrival at school, or keeping phones locked away.  "
        },
        {
            "heading": 3,
            "text": "What else are you doing to improve school behaviour? "
        },
        {
            "text": "We’re investing £10 million in Behaviour Hubs across the country, supporting up to 700 schools to improve behaviour over three years. "
        },
        {
            "text": "Behaviour Hubs help schools that have exemplary positive behaviour cultures to work closely with other schools that want to turn around their behaviour, alongside providing access to central support and a taskforce of advisers. "
        }
    ]
}