{
    "url": "https://defradigital.blog.gov.uk/2024/02/19/spotlight-on-talent-development-meet-fast-streamer-ophir-edelstein/",
    "title": "Spotlight on talent development: Meet Fast Streamer Ophir Edelstein",
    "authors": [
        "Ophir Edelstein"
    ],
    "categories": [
        "Defra digital",
        "Digital transformation"
    ],
    "pub_date": "2024-02-19T07:00:54+00:00",
    "content": [
        {
            "text": "In the latest from our series focusing on stories from colleagues who are employed on our talent development programmes, we hear from Ophir Edelstein as she reflects on her first placement as a Technology Innovation Consultant on the Civil Service Fast Stream."
        },
        {
            "text": "I joined the Civil Service Fast Stream in September last year, straight after finishing my master’s degree in public policy. It can be hard to know exactly what you want to ‘be’ after university. Sometimes it can be difficult to break into a particular career path if you don’t really have any relevant work experience."
        },
        {
            "heading": 2,
            "text": "Why the Fast Stream suits me"
        },
        {
            "text": "For me, the Fast Stream was perfect as it allows me to get a range of experience in an area I’m interested in, on an accelerated timescale. Having studied Politics and Public Policy at university, working for the government is of particular interest (although in many cases the scheme you choose doesn’t need to be directly related to your degree)."
        },
        {
            "text": "I’m currently in my first placement, working as a Technology Innovation Consultant in Digital, Data and Technology Services (DDTS) at Defra. The experience has been overwhelmingly positive so far."
        },
        {
            "text": "I have loved my first posting, and I feel I’m getting valuable hands-on experience of the role (which I think is the best way to learn what’s right for you; what you enjoy and what you’re good at), as well as benefitting from a lot of support and training. Particularly within my team, I’ve been given the opportunities to explore and do work that isn’t included in my job description. While this isn’t an option in all postings, it has been invaluable for my development and understanding of where I want my career to go."
        },
        {
            "heading": 2,
            "text": "Plenty of variety, lots of challenges"
        },
        {
            "text": "It’s sounds like a cliché, but no two days are the same. Any individual day could include team meetings, meetings with external stakeholders, emailing our various partners to coordinate projects, doing research, writing reports, making videos, or taking part in learning and development activities."
        },
        {
            "text": "Adapting to the different ways of working, and building up the technical knowledge required for the role, has been challenging at times, but I’m learning so much."
        },
        {
            "text": "One thing I’ve particularly enjoyed in the role so far is learning how to run a consultation project. From the beginning, I was given the opportunity to lead on a project the team was involved in (with assistance from an experienced team member of course)."
        },
        {
            "text": "Being trusted with this level of responsibility from the get-go has allowed me to learn how to effectively communicate with stakeholders, run meeting and presentations, and coordinate between several teams, among many other skills. I know that this knowledge will be relevant in almost any other job I might have, and so am very grateful for the opportunity."
        },
        {
            "heading": 2,
            "text": "Be determined – if at first you don’t succeed, try again"
        },
        {
            "text": "If you’re thinking of applying for the Fast Stream, my advice is simple - do it! The worst that can happen is that you don’t get onto the scheme on your first try."
        },
        {
            "text": "Several people I’ve met on the scheme were rejected the first time they applied, but they’ve all said that applying was a really useful learning experience in itself."
        },
        {
            "text": "If you’ve already applied, my advice for anyone joining the scheme next year is to utilise your team. The people I’ve worked with have been a real highlight of my experience."
        },
        {
            "text": "Everyone has been so friendly and supportive, and they have a lot of knowledge and experience, so make the most of any opportunity to learn from them."
        },
        {
            "text": "I don’t know yet what I’ll do when I finish the scheme, the magic of the Fast Stream is that it lets you try out several different roles, so you can learn what you enjoy doing. My perfect role might be something I’ve not even considered yet!"
        }
    ]
}