{
    "url": "https://space.blog.gov.uk/2024/02/19/starting-and-ending-my-career-with-the-ers-2-mission/",
    "title": "Starting and ending my career with the ERS-2 mission",
    "authors": [
        "Sue Horne"
    ],
    "categories": [
        "Careers",
        "Earth observation",
        "Satellites",
        "Space sustainability"
    ],
    "pub_date": "2024-02-19T17:15:56+00:00",
    "content": [
        {
            "text": "As the ERS-2 climate mission starts its burn-up in the Earth’s atmosphere, our Space Exploration Special Adviser Sue Horne talks about how the mission has spanned her career in space."
        },
        {
            "text": "Launched in 1995, the European Remote Sensing Satellite (ERS-2) was the European Space Agency’s second Earth Observation spacecraft – its mission to study the temperature and winds of our planet’s oceans, as well as ozone in the atmosphere."
        },
        {
            "text": "Four years before, in 1991, I had just started working in managing Earth Observation space projects, and remember how excited I was by the prospect of the developing ERS-2 mission."
        },
        {
            "text": "The UK had a key role in the mission, with scientists and engineers from a range of UK institutions, including Astrium (now known as Airbus), Science and Technology Facilities Council RAL Space, Mullard Space Science Lab (MSSL), and the University of Oxford helping design and build scientific instruments onboard, including the Along Track Scanning Radiometer (ATSR)."
        },
        {
            "text": "The ASTR was a cutting-edge bit of kit, and I was bitten by the excitement of the new data on our planet that it would be able to gather from space."
        },
        {
            "text": "My role in ERS-2 was around organising funding to support mission operations at RAL, MSSL and Oxford, as well as organising the peer review of scientists to use the data the satellite would gather from space."
        },
        {
            "text": "I could see at the time Earth Observation was an important, growing field and I worked to help grow the UK science community around it."
        },
        {
            "heading": 2,
            "text": "Saving ERS-2"
        },
        {
            "text": "Six years after it launched, busy gathering high-quality data about our oceans and atmosphere, ERS-2 ran into problems."
        },
        {
            "text": "Several of its onboard gyro systems – which helped keep the spacecraft in the right position – started failing. Similar issues had struck ERS-2’s predecessor, ERS-1, the year before, which sadly put an end to that mission."
        },
        {
            "text": "But a group of engineers in the European Space Agency and across industry came together to develop an innovative new technique for flying and controlling ERS-2 in orbit, without gyros."
        },
        {
            "text": "Two years later, in 2003, ERS-2 was struck again by an issue, this time with its onboard storage system, meaning it could not store the data it was collecting. Instead, it could only act as a “real-time” satellite, beaming its data down to Earth as soon as it collected it."
        },
        {
            "text": "With these innovations and adaptations, ERS-2 managed to continue operating all the way up to 2011, when it was finally switched off, with the aim to de-orbit it and reduce space debris."
        },
        {
            "text": "I had stopped working directly on the mission in 1994, but I had continued to follow the mission’s progress, and it was a poignant day when it finally came to an end."
        },
        {
            "heading": 2,
            "text": "Burn-up and tracking"
        },
        {
            "text": "And now we come to the second end for the mission, when the inexorable pull of gravity brings the spacecraft lower into the Earth’s atmosphere, where friction creates intense heat that burns it up in the sky."
        },
        {
            "text": "Just as it played a key role in the mission’s design and development, the UK is now a part of the end of the mission too, working with ESA to track its re-entry under the ERS-2 Inter-Agency Debris Coordination Committee task."
        },
        {
            "text": "The UK Space Agency’s Space Surveillance and Tracking team are using their world-class analysis capability to track the satellite and predict how and where it will re-enter – demonstrating a key part of the UK Space Agency’s purpose: to protect our planet and outer space. For more information about the UK Space Agency’s re-entry service, you can read our blog on Aeolus."
        },
        {
            "text": "The UK Space Agency is also working on a project with HEO Robotics, an Australian company with a presence in the UK, which has taken images of the re-entry from space."
        },
        {
            "heading": 2,
            "text": "The end"
        },
        {
            "text": "Witnessing ERS-2 re-enter Earth’s atmosphere fills me with mixed emotions."
        },
        {
            "text": "On one hand, it is sad to see something I worked on all those years ago come to an end – but I am also incredibly proud of what it has achieved and what it has taught us about our planet, from floods to the ozone layer."
        },
        {
            "text": "33 years on, and having worked on a number of missions in between – including Cassini/Huygens, Beagle 2 and JWST – I have seen the highs and lows of space."
        },
        {
            "text": "ERS-2 perfectly encapsulates to me that space missions are only possible through the endeavours of a huge team of people – not just scientists and engineers."
        },
        {
            "text": "I am proud to have been part of those teams, and I feel it is rather appropriate that, as I approach retirement, my career will have started and ended with ERS-2."
        }
    ]
}