{
    "url": "https://defrafarming.blog.gov.uk/2024/02/19/webinar-follow-up-the-offer-for-tenant-farmers/",
    "title": "Webinar follow up: the offer for tenant farmers",
    "authors": [
        "Becky Briggs"
    ],
    "categories": [
        "Sustainable Farming Incentive",
        "Webinars"
    ],
    "pub_date": "2024-02-19T16:51:05+00:00",
    "content": [
        {
            "text": "On Thursday 8 February, we held a webinar for tenant farmers. In the session, we gave an overview of the actions and payments available through our environmental land management schemes in 2024.   "
        },
        {
            "text": "Policy leads working on the Sustainable Farming Incentive (SFI), the government response to the Rock Review and colleagues from the Rural Payments Agency (RPA) were on hand to answer questions. "
        },
        {
            "text": "In this post, I’ll include the recording and summarise the themes that emerged in the questions. "
        },
        {
            "text": "I’ll set out the best ways for you to get answers as quickly as possible at the end of this post. "
        },
        {
            "heading": 2,
            "text": "Applying for SFI "
        },
        {
            "text": "We’ve designed SFI to be as accessible as possible for tenants. We have been working with the Farm Tenancy Forum to gather feedback from stakeholders about how our schemes are working for tenants and landlords. "
        },
        {
            "text": "If you’re a tenant farmer, you can apply for SFI. We ask that you must expect to have management control of the land entered into your SFI agreement for its 3-year duration.  "
        },
        {
            "text": "Only a tenant can enter land (including hedgerows, where relevant) occupied under a tenancy agreement into an SFI agreement. This is because they’re the person actively farming the land, not the landlord. "
        },
        {
            "text": "You can leave SFI without penalty if your circumstances change unexpectedly. "
        },
        {
            "text": "We encourage tenants to let their landlords know of their plans to apply for SFI. To apply for SFI, a tenant does not have to obtain or prove landlord consent. However, we strongly encourage tenants to discuss their plans to apply for the scheme with their landlord.   "
        },
        {
            "text": "If you’re the tenant, it’s a good idea to check your tenancy agreement first to avoid inadvertently breaching any terms.  "
        },
        {
            "text": "Even if your landlord has already entered some of your tenanted land into a CS or SFI agreement, you may also be eligible for another agreement provided the same action is not being funded twice and the options and items are compatible with each other (on the same parcel of land).  "
        },
        {
            "text": "Payments will be made to the agreement holder. "
        },
        {
            "text": "Read the full guidance on land management control. "
        },
        {
            "heading": 2,
            "text": "When to apply for an SFI agreement "
        },
        {
            "text": "Don’t delay, apply today! "
        },
        {
            "text": "Over 11,000 farmers have already applied for an SFI agreement. You can apply for an SFI agreement now and choose from the 23 actions currently on offer. "
        },
        {
            "text": "By waiting for the 2024 actions to become available, you could be losing out on money. If you apply now, you'll be able to add actions to your agreement annually - or have multiple agreements if you'd like to carry out further actions in the future.    "
        },
        {
            "text": "It’s possible to be in SFI and Countryside Stewardship at the same time if the actions are compatible and you are not being paid for the same action twice (see the section below on the combined offer). "
        },
        {
            "text": "Find out how SFI can work for you. "
        },
        {
            "heading": 2,
            "text": "Monitoring impact of SFI on tenants "
        },
        {
            "text": "Through regular engagement with industry, we are aware of concerns about landlords taking land out of tenancy agreements. We want landlords to maintain their tenancies and work with tenants to access our schemes.   "
        },
        {
            "text": "Our data currently shows the area of tenanted land rented for one year or more has remained very stable over the last 5 years at 2.9 million hectares. However, we know there is a lag between changes on the ground feeding into national data, so we are working with the Farm Tenancy Forum to gather more information on the scale and factors driving land resumption to monitor this issue and act as needed.  "
        },
        {
            "text": "There will be a question in the regular survey sent to SFI agreement holders about tenanted land."
        },
        {
            "heading": 2,
            "text": "The combined offer and tenants "
        },
        {
            "text": "We want to make our services simpler, clearer and faster.  "
        },
        {
            "text": "The Combined Offer (SFI actions and CS Mid Tier actions) will be more attractive, fair and workable. With updated payment rates, greater flexibility in scheme actions, more regular payments and a single application window. "
        },
        {
            "text": "We are introducing more 3-year actions, to match the average length of a Farming Business Tenancy. There are 29 existing SFI and CS actions that have a duration of up to 3 years. We will introduce 16 further new actions with a 3-year duration and are exploring whether we can offer a further 41 existing CS actions as 3-year actions, including to make them more accessible to tenant farmers.  "
        },
        {
            "text": "For the combined 2024 offer, we expect most options will not require your landlord’s consent. However, we expect this to be required for the more complex, permanent land use change actions, which tend to be longer in duration.  We encourage all tenants and landlords planning to enter an environmental land management scheme to consult each other in the first instance. "
        },
        {
            "text": "Learn more about the combined offer.  "
        },
        {
            "heading": 2,
            "text": "Opening up SFI to non-BPS farmers "
        },
        {
            "text": "We plan to remove the current rule saying that farmers must have been eligible for BPS to apply for SFI this summer."
        },
        {
            "text": " We’ll let you know when this happens, so make sure to subscribe to the Farming blog. "
        },
        {
            "heading": 2,
            "text": "Further support and guidance "
        },
        {
            "text": "With improved choice and payment rates, now is the time to apply for SFI. For more information visit our dedicated SFI site which sets out the full offer.  For more information on how to apply, can watch RPA’s how to apply for SFI video. "
        },
        {
            "text": "To help you manage the transition and plan, you can get free advice from an independent provider.  If you have a query about SFI, you can contact the RPA. "
        },
        {
            "text": "You can also access free advice through an independent provider if you receive BPS.  "
        },
        {
            "text": "For more information read our blog post supporting the tenanted sector in England.  The guidance for every scheme and grant on offer can be found on the Funding for farmers, growers and land managers page on GOV.UK.  "
        }
    ]
}