{
    "url": "https://ruralpayments.blog.gov.uk/2024/02/19/your-grants-introducing-you-to-3/",
    "title": "Your Grants 'Introducing you to...'",
    "authors": [
        "RPA Editor"
    ],
    "categories": [
        "Grants",
        "Introducing You To"
    ],
    "pub_date": "2024-02-19T16:09:52+00:00",
    "content": [
        {
            "text": "RPA offers a wide range of grants and rural payments to farmers, businesses and local authorities. In this series of blogs, we look at the grants available in more detail, using case studies to showcase those who have taken advantage of these opportunities, as well as highlighting the work of the RPA Grants Service Team in administering them. In this blog we meet Emma Topping who works on the Adding Value grant and Small Abattoir Fund."
        },
        {
            "text": "Hi, I’m Emma and I’m a theme lead manager in the Appraisals team, leading on the Adding Value grant and Small Abattoir Fund. I joined the team three months ago, based in Newcastle, although I’ve been with RPA for three years."
        },
        {
            "text": "I oversee the applications after they’ve been appraised and then sign them off. I’m also an escalation point for the appraisers if they’re not sure an item applied for is eligible."
        },
        {
            "text": "Although I’m fairly new to the role, I bring my experience from RPA’s External Affairs team. In that job I escalated MP complaints and correspondence, so I understand how our decisions affect farmers and their business and what impact that can have on their mental health. I see my role as being the last port of call looking at grants – what’s the impact if we don’t pay this grant, and how can we help the customer."
        },
        {
            "text": "I’m a city girl through and through and although I don’t know the farming side so well, I know customer service, so the aspect of my role I currently enjoy the most is when I understand the project and what will be the benefit to a farmer’s business. I’m getting a crash course on what we do and how it impacts a farm business in real time."
        },
        {
            "text": "One of the things I’m interested in is how we can support farmers and land managers further. I’m currently looking at our pre-complaints process, such as when there’s an expression of dissatisfaction that’s not actually escalated to a complaint. This piece of work will look to help RPA teams identify this and then see what we can do, such as help a customer understand why a decision has been made, or take the opportunity to have a second look at what we’ve done, and see if we can do it differently."
        },
        {
            "text": "I’ve been in the Civil Service now for 20 years. Before joining RPA, I was in the Department of Work and Pensions, working in serious and organised crime, providing quality assurance for DWP under counter fraud and compliance."
        },
        {
            "text": "I joined the Civil Service after my A Levels. I didn’t know what I wanted to do and kind of fell into the Civil Service by accident. I’d been homeless from the age of 15, and did my A Levels in a homeless unit. The Civil Service gave me the stability that I’d missed by having to support myself in that unit from 15 to 18 years of age. Everything I’ve been able to achieve and the support that I’ve had during my career has been wonderful, so I never felt I needed to do anything else."
        },
        {
            "text": "I also really enjoy mentoring and providing encouragement and support to help people develop their skills and then move on within RPA and get promoted."
        },
        {
            "text": "As I mentioned, I’m a city girl and I live in Newcastle and outside of work I go to a lot of music gigs and enjoy Roller Derby (wheeled skates.)  I’ve got two daughters aged 16 and eight and a Sprocker called Daisy, so we do a lot of dog walking. I’m also a gamer – particularly Assassins Creed Odyssey. The girls typically reject everything I like, except recently the oldest has decided to like all the music I like - heavy metal and rock - and has started to come to gigs with me."
        },
        {
            "text": "Please visit https://www.gov.uk/guidance/funding-for-farmers  regularly for more information as this page sets out every payment on offer, with links to learn more."
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        }
    ]
}