{
    "url": "https://forestrycommission.blog.gov.uk/2025/04/30/the-mercian-project-empowering-woodland-owners-to-improve-biodiversity/",
    "title": "The Mercian Project: empowering woodland owners to improve biodiversity ",
    "authors": [
        "Rachel Bates",
        "Russell Critchley"
    ],
    "categories": [
        "Nature",
        "Woodland management"
    ],
    "pub_date": "2025-04-30T08:00:00+01:00",
    "content": [
        {
            "text": "Nearly half of England’s woodland is under-managed or left untouched, leading to a decline in biodiversity and habitat quality. Many of you know all too well that without active stewardship, woods can lose their rich variety of plants and animals."
        },
        {
            "text": "That’s where the Mercian Woodland Biodiversity Project comes in. Funded by Severn Trent Water and led by the Small Woods Association, this five-year project is helping woodland managers to enhance their woodlands for wildlife."
        },
        {
            "heading": 2,
            "text": "Supporting woodland managers"
        },
        {
            "text": "Our project works across a diverse range of sites, with private woodland owners and local planning authorities to community-owned woodland, and those owned by conservation charities."
        },
        {
            "text": "Three Woodland Biodiversity Advisors work on the project covering the Severn and Trent catchments. We work with participants to produce biodiversity management plans for their sites, which focus on simple, achievable management interventions. We’ve found that even simple changes can greatly enhance a woodland's ecological value."
        },
        {
            "heading": 2,
            "text": "Understanding each woodland"
        },
        {
            "text": "When we first visit a site, we meet with owners and managers to learn about their woodland and their aspirations for it. We assess practical considerations like site access and terrain, while checking for any environmental hazards, tree diseases or pests that might affect future management."
        },
        {
            "text": "Participants are (quite rightly) proud of their woodlands and enjoy showing us around. They like sharing knowledge of their woods and the species which call them home. Many woodland owners already survey the plants and animals in their woods for their own interest. Knowing what species are present can influence future woodland management."
        },
        {
            "text": "Our biodiversity assessments look at the whole woodland ecosystem. We examine the overall age classes and vegetative structure of each woodland, and the species composition of the canopy, shrub layer and ground flora. We also estimate the rates of natural regeneration and note the amount of fallen and standing deadwood."
        },
        {
            "text": "With a bit of desk research, we determine if the woodland is ancient or supports the priority habitat of deciduous woodland, identify designations such as local nature reserves, and find out if woodland management plans are already in place."
        },
        {
            "text": "All of this helps us produce a biodiversity management plan with realistic recommendations."
        },
        {
            "heading": 2,
            "text": "Creating effective management plans"
        },
        {
            "text": "Each management plan starts by identifying potential constraints, such as access limitations, environment and weather considerations, and impacts from a changing climate."
        },
        {
            "text": "Then comes the fun part – working with participants to form a list of management objectives. We develop objectives which will enhance the biodiversity value of their wood and align with their own aims and visions for the future."
        },
        {
            "text": "Many effective interventions are straightforward enough for owners to carry out themselves, such as increasing fallen deadwood, introducing small-scale coppicing, or creating woodland glades. More complex work, like creating woodland ponds, thinning mature trees or installing deer fencing, often needs additional support and expertise."
        },
        {
            "heading": 2,
            "text": "Cheveral Wood: biodiversity in action"
        },
        {
            "text": "Cheveral Wood, a 30-hectare ancient and semi-natural woodland in Nottinghamshire, shows how our approach works in practice. The owner, Ros, signed up to the project in 2024 and has been a dedicated custodian of the woodland, striving to manage it sustainably. With a Forestry Commission woodland management plan in place for the commercial extraction of timber, Ros joined the project for support to enhance the woodland’s ecological value. "
        },
        {
            "text": "Russell developed a biodiversity management plan focused on diversifying habitats and allowing more light to reach the ground. These changes will support natural tree regeneration and encourage woodland flora to thrive. These aims will be achieved through the completion of interventions such as coppicing, widening woodland rides and creating standing deadwood. "
        },
        {
            "text": "A key achievement at Cheveral Wood was the restoration of a declining woodland pond. Working with East Midlands Environmental Consultants, we removed encroaching scrub and re-profiled the banks to establish marginal vegetation. This work, funded through the local council's district level licensing scheme for great crested newts, has created valuable new habitat."
        },
        {
            "heading": 2,
            "text": "Support and training"
        },
        {
            "text": "Beyond practical management plans, we offer several ways to help woodland owners develop their knowledge and skills. We’ve run practical workshops covering essential management techniques, and loaned out bat detectors so owners can discover which species are using their woodland; information that often influences future management decisions."
        },
        {
            "text": "To find out how you could better manage woodlands for biodiversity, read our advisory notes for guidance on enhancing woodland for birds, bats, invertebrates and more."
        },
        {
            "heading": 2,
            "text": "Vision for the future "
        },
        {
            "text": "The project aims to bring 600 hectares of woodland back into active management to benefit biodiversity. Every woodland involved in the Mercian Woodland Biodiversity Project is unique, and it takes the engagement, dedication and hard work of all of our project team members and participants to reach this goal."
        },
        {
            "text": "Going forward, we hope to secure new funding to continue supporting existing participants and to welcome new woods into the project."
        }
    ]
}