{
    "url": "https://competitionandmarkets.blog.gov.uk/2025/04/30/what-good-regulation-looks-like-and-why-it-matters/",
    "title": "What good regulation looks like and why it matters",
    "authors": [
        "Doug Gurr"
    ],
    "categories": [
        "Growth and investment",
        "Life at the CMA"
    ],
    "pub_date": "2025-04-30T10:30:38+01:00",
    "content": [
        {
            "text": "Today I’m speaking to my fellow chairs at a summit of the UK major regulators. It’s a privilege to be part of the deep collective experience and commitment of that group – especially when the UK really needs its regulatory landscape to be a key national asset."
        },
        {
            "text": "The topic – what does good regulation look like, especially in a challenging and dynamic economic environment?"
        },
        {
            "text": "Firstly, good regulation upholds the interests of UK consumers and businesses. We would be falling at the first hurdle if we didn’t get that right. That’s why I’ve been clear since joining the CMA that, though we must evolve, we’re sticking firmly to the fundamentals – protecting UK consumers and promoting competition. Recent work underscores that commitment – like our recommendations to government for improvements to the infant formula market, our Ticketmaster investigation, and the launch of our first two investigations under the new Digital Markets competition regime."
        },
        {
            "text": "Good regulation also supports critical, long-term policy goals, and the broader macro-economic environment in which they are formed. Most notably, the UK desperately needs economic growth. It’s the only way out of today’s world of high debt, record tax take and intense pressure on public expenditure. It’s our only route to prosperity for ordinary working families, with better public services, infrastructure and quality of life. That’s why it’s the government’s number one mission – and why all regulators must play their part in helping achieve it. "
        },
        {
            "text": "I have said it before and will keep saying it: investment is critical. We can’t build our future with the lowest level of business investment in the G7. So, for the CMA, good regulation also means really challenging ourselves on how we can encourage this to the greatest extent, while staying true to our fundamentals. "
        },
        {
            "text": "There’s a lot we can do for growth and investment through opening up markets to competition, as we did with Open Banking; levelling the playing-field for SMEs, like we did with online marketplaces; and strengthening consumer confidence as we start to implement the new consumer protection regime."
        },
        {
            "text": "But we can go further – by making meaningful changes to how we carry out our work. Changes that matter to businesses, investors, and startups thinking about whether to choose the UK, over anywhere else in the world, as their home. We’re now actively implementing improvements across ‘4Ps’: the Pace of our end-to end-processes; the Predictability and Proportionality of our actions and decisions (including a sharper focus on UK versus global impact); and our Process, meaning the direct engagement we have with businesses and wider stakeholders. We’re already making considerable headway with this 4Ps framework across core areas of our work, including mergers, consumer protection and digital markets – really listening and responding to feedback as we go."
        },
        {
            "text": "When it comes to good regulation, the UK’s new Digital Markets competition regime (opens in new tab) has the virtue of already exemplifying many aspects of these 4Ps. It’s designed to keep pace with fast-moving markets and technologies, while not trying to predict the future. It’s highly tailored, applying just to the largest firms and offering the opportunity for scalpel-like remedies, not an industry-wide sledgehammer. And it’s based on ongoing dialogue with firms and the wider ecosystem, collaborating on solutions which work in practice. It’s early days, but progress so far is already starting to show the benefits of a bespoke UK regime."
        },
        {
            "text": "By getting regulation right, all of us in the regulatory community can make a critical contribution to getting the UK economy growing and ultimately delivering a more prosperous future for everyone."
        }
    ]
}