{
    "url": "https://moderncivilservice.blog.gov.uk/2024/03/05/how-challenge-driven-innovation-is-helping-defence-identify-and-solve-problems/",
    "title": "How challenge-driven innovation is helping Defence identify and solve problems",
    "authors": [
        "Government Reform"
    ],
    "categories": [
        "A Modern Civil Service",
        "Data science",
        "Digital and data",
        "Government Reform",
        "Innovation",
        "Modernisation and Reform",
        "Proud Civil Servant"
    ],
    "pub_date": "2024-03-05T12:01:23+00:00",
    "content": [
        {
            "heading": 6,
            "text": "A guest blog by Stuart Laws, Portfolio and Outreach Assistant Head, Defence Innovation Unit."
        },
        {
            "text": "Innovation is the lifeblood of change, but how can it be harnessed effectively within government departments? In this blog post, we'll explore the concept of challenge-driven innovation and how it can revolutionise the way government departments tackle problems."
        },
        {
            "text": "Challenge-driven innovation is a framework that uses open innovation and crowdsourcing, along with defined methodology, process, and tools to help organisations develop and implement solutions to their problems at pace."
        },
        {
            "text": "By creating clear challenge statements defining the problem, civil servants can approach problem-solving in a more targeted way and encourage collaboration among stakeholders. Clear statements also allow you to reach previously unknown contributors outside of your current network."
        },
        {
            "text": "Within the Ministry of Defence, we use a software platform to enable teams to share their challenges, allowing innovators to capture, review, and progress ideas from our staff. To achieve this, the Defence Innovation Unit supports teams using the platform by following these steps:"
        },
        {
            "heading": 2,
            "text": "Identifying challenges"
        },
        {
            "text": "Clearly and succinctly explain the challenge; why does it matter and how would it align with other capability/functions? Understanding and sharing the expected outcome is essential to avoid unintended duplication. This allows problem owners to discover where someone else may already have the solution."
        },
        {
            "heading": 2,
            "text": "Defining challenges as innovation opportunities"
        },
        {
            "text": "Framing problems for creative solutions is key to maximise engagement. The narrative and supporting communications need to appeal to a wide and diverse group of potential stakeholders, as the solution is frequently generated from those closest to the problem."
        },
        {
            "heading": 3,
            "text": "Engaging Stakeholders"
        },
        {
            "text": "The importance of diverse perspectives when seeking ideas can’t be understated. The platform allows problem owners to coordinate competitions, hackathons and workshops through their idea space, ensuring that everyone with an interest has access, including those outside any existing stakeholder community."
        },
        {
            "heading": 3,
            "text": "Evaluating and implementing solutions"
        },
        {
            "text": "As the problem owner, the business unit is best placed to evaluate and implement selected ideas by:"
        },
        {
            "text": "With the problem owner involved in this way, more traditional approaches that must ‘find a home’ for the submitted idea no longer apply."
        },
        {
            "heading": 2,
            "text": "Case studies and success stories"
        },
        {
            "text": "The Defence Innovation Directorate applies the challenge-driven innovation approach widely, particularly when we’re looking to generate dual-use solutions. In partnership with UK Defence Solutions Centre and Innovate UK, our Cross Sector Innovation framework has resulted in the delivery of two campaigns:"
        },
        {
            "heading": 2,
            "text": "The complexities of challenge-driven innovation"
        },
        {
            "text": "Challenge-driven innovation isn’t simple. It requires understanding and preparation before you launch your challenge and engage your target audience. Once launched, you will require dedicated support to ensure everything remains on schedule, ensuring you provide direct support and guidance, capture any lessons and good practice as you go, and to give timely feedback."
        },
        {
            "text": "You’ll also need to ensure that the challenge is closed successfully, including final communication material to showcase what has been achieved and what’s going to happen next."
        },
        {
            "text": "You need to be committed and allocate resources, but rest assured the benefits of success will far outweigh the investment. Our experience so far indicates a reasonable expectation of 12:1 return on investment, as well as the discovery of new partners and solutions we’d considered not yet viable."
        },
        {
            "text": "Within the public sector we frequently view our challenges as unique, however, many of our issues are shared with industry and academia. Adoption of challenge-driven innovation, with clear preparation and time spent on a pre-launch discovery phase will show you that you are not alone, and that others share your problems and issues. Once you find that common ground and shared pain, the path towards positive and impactful change and improvement creates itself."
        }
    ]
}