{
    "url": "https://designnotes.blog.gov.uk/2024/03/05/how-were-designing-a-bilingual-service-for-wales-from-the-start/",
    "title": "How we’re designing a bilingual service for Wales, from the start",
    "authors": [
        "Abbie Foxton – Content Designer, Valuation Office Agency, HMRC"
    ],
    "categories": [
        "Content Design",
        "Tried & tested"
    ],
    "pub_date": "2024-03-05T09:00:57+00:00",
    "content": [
        {
            "text": "\n"
        },
        {
            "text": "Darllenwch y blog hwn yn Gymraeg / Read this blog post in Welsh."
        },
        {
            "text": "Following the Welsh Language Act 1993, all public services in Wales should be available in Welsh, and the language should be treated no less favourably than English. In practice, this often means services are designed in English then translated into Welsh - usually during the Beta phase. At this point, the design and journey is quite fixed, but what if it doesn’t work for Welsh users?  "
        },
        {
            "text": "The Welsh Government has an ambition to achieve a million people speaking Welsh by 2050, and we need to support that. "
        },
        {
            "text": " "
        },
        {
            "text": "During our discovery project to support the Welsh Government’s Council Tax reform programme, we wanted to bring Welsh language in from the beginning of the design process. This meant including Welsh at Discovery and Alpha phases rather than waiting until Beta and Live. Here are some reflections based on the things we’ve done so far. "
        },
        {
            "heading": 2,
            "text": "Include Welsh in Ways of Working "
        },
        {
            "text": "While we’re fortunate to have two Welsh speakers in our team, we also included Welsh in the foundations of how we work. This has included: "
        },
        {
            "text": "Getting the whole service team – not just the design team – on the same page and understanding why it’s important has been essential. One of our developers has also started to learn Welsh!  "
        },
        {
            "heading": 2,
            "text": "Meet the right people early "
        },
        {
            "text": "We met with the Welsh Language Unit (WLU) to introduce ourselves and understand how we can work with them. We got to know the translation process and captured this in our documentation. We invited the WLU to our show and tells demonstrating our progress and learnings, and continue to meet with them regularly. "
        },
        {
            "text": "We also learnt about the history of the Welsh language and how people were told not to speak Welsh. This was known as Welsh Not. This increased our empathy for how important it is to Welsh people and their identity to be able to use Welsh.  "
        },
        {
            "text": "We also met with people working on GOV.UK One Login to find out how we could help users carry their language choice across a whole service. "
        },
        {
            "heading": 2,
            "text": "Reach out and learn from wider communities "
        },
        {
            "text": "We recognise there are teams already doing great work on bilingual services already so we reached out to learn from their work.  "
        },
        {
            "text": "We met with Osian Jones and Adrián Ortega​​​​ at the Centre for Digital Public Services which partners with organisations to build public services across Wales. They talked about trio writing and how using this method, which includes a content designer, subject matter expert and a translator, had helped them write more natural sounding Welsh content and improved the clarity of the English content as a result.   "
        },
        {
            "text": "We’ve been working closely with the WLU to propose a trial of working this way together and finding a compromise that considers their team capacity and merging existing ways of working to make this an option for us all. We’re hoping to trial trio writing with the WLU in Cardiff in 2024. "
        },
        {
            "text": "We also spoke with Nia Campbell, a Welsh speaking content designer at the Ministry of Justice, who is working with an English speaking user researcher to conduct research in Welsh, and who stressed how important it is to make sure if a participant is taking part in research as a Welsh speaker, all of their communication should be available in Welsh, including consent forms.  "
        },
        {
            "text": "By reaching out to the wider design community we were introduced to new resources like Helo Blod, a free Welsh translation and advice service, invited to join the Designing Welsh language products and services online meetup (for an invite get in touch with Nia) and joined the Centre for Digital Public Services communities of practice. "
        },
        {
            "heading": 2,
            "text": "Leave your comfort zone to find theirs "
        },
        {
            "text": "A key part of this was being willing to meet people where they are. Our user researchers went to libraries in Wrexham and spoke to the public there, equipped with recruitment posters and conceptual mock ups in both Welsh and English."
        },
        {
            "text": "Another benefit of reaching out to the wider communities was learning about Welsh cultural events like the annual Eisteddfod festival which celebrates the Welsh language. We’re now considering the Eisteddfod and similar events as an avenue for recruiting Welsh speaking research participants, pushing us beyond the standard recruitment channels. "
        },
        {
            "heading": 2,
            "text": "Final reflections "
        },
        {
            "text": "Though our project focuses on the Welsh language, the principles listed here could be used to support the creation of other bilingual public services. For example, when the service is primarily for people who use English as a second language. "
        },
        {
            "text": "On our project, we’re fortunate to be given the space and directive to really focus on the language. Even if, as design teams, we’re not able to action all of these, showing positive intent and willingness to learn and adapt, even in small ways, has been essential for us.  "
        },
        {
            "heading": 1,
            "text": "--------"
        },
        {
            "heading": 1,
            "text": "Sut rydyn ni’n dylunio gwasanaeth dwyieithog i Gymru, o’r cychwyn cyntaf"
        },
        {
            "text": "Abbie Foxton, Dylunydd Cynnwys, Asiantaeth y Swyddfa Brisio"
        },
        {
            "text": "Darllenwch y blog hwn yn Saesneg / Read this blog post in English."
        },
        {
            "text": "Yn dilyn Deddf yr Iaith Gymraeg 1993, dylai pob gwasanaeth cyhoeddus yng Nghymru fod ar gael yn Gymraeg, ac ni ddylid trin yr iaith yn llai ffafriol na’r Saesneg. Yn ymarferol, mae hyn yn aml yn golygu bod gwasanaethau’n cael eu dylunio yn Saesneg ac yna eu cyfieithu i’r Gymraeg – fel arfer yn ystod y cyfnod Beta. Bryd hynny, mae’r dyluniad a’r daith yn eithaf sefydlog, ond beth os nad ydyn nhw’n gweithio i ddefnyddwyr Cymraeg?"
        },
        {
            "text": "Mae gan Lywodraeth Cymru uchelgais i gyrraedd targed o filiwn o siaradwyr Cymraeg erbyn 2050, ac mae angen i ni gefnogi hynny."
        },
        {
            "text": "Yn ystod ein prosiect darganfod i gefnogi rhaglen Llywodraeth Cymru er mwyn diwygio’r Dreth Gyngor, roedden ni am ystyried y Gymraeg o gychwyn cyntaf y broses ddylunio. Roedd hynny’n golygu cynnwys y Gymraeg yn ystod y cyfnodau Darganfod ac Alffa, yn hytrach nag aros tan y cyfnodau Beta a Byw. Dyma rai sylwadau yn seiliedig ar y pethau rydyn ni wedi’u gwneud hyd yn hyn."
        },
        {
            "heading": 2,
            "text": "Gwneud y Gymraeg yn rhan annatod o’n gwaith"
        },
        {
            "text": "Er ein bod ni’n ffodus o fod â dau siaradwr Cymraeg yn ein tîm, gwnaethon ni hefyd gynnwys y Gymraeg yn sylfeini’r ffordd rydyn ni’n gweithio. Mae hyn wedi cynnwys:"
        },
        {
            "text": "Mae sicrhau bod y tîm gwasanaeth cyfan – nid dim ond y tîm dylunio – ar yr un dudalen ac yn deall pam mae’r Gymraeg yn bwysig wedi bod yn hanfodol. Mae un o’n datblygwyr hefyd wedi dechrau dysgu Cymraeg!"
        },
        {
            "heading": 2,
            "text": "Cwrdd â’r bobl iawn yn gynnar"
        },
        {
            "text": "Cawson ni gyfarfod gyda’r Uned Iaith Gymraeg (WLU) i gyflwyno ein hunain ac i ddeall sut y gallwn ni weithio gyda nhw. Daethon ni yn gyfarwydd â’r broses gyfieithu, a chofnodi hyn yn ein dogfennaeth. Gwnaethon ni wahodd yr Uned i’n sesiynau ‘dangos a dysgu’, i ddangos y cynnydd rydyn ni wedi’i wneud a’r pethau rydyn ni wedi’u dysgu, ac rydyn ni’n parhau i gwrdd â’r Uned yn rheolaidd."
        },
        {
            "text": "Dysgon ni hefyd am hanes yr iaith Gymraeg a sut y dywedwyd wrth bobl am beidio â siarad Cymraeg. ‘Welsh Not’ oedd yr enw ar hyn. Gwnaeth hyn godi ein dealltwriaeth o ran pa mor bwysig yw hi i’r Cymry allu defnyddio’r Gymraeg, ac o ran ei phwysigrwydd i’w hunaniaeth."
        },
        {
            "text": "Gwnaethon ni hefyd gwrdd â phobl sy’n gweithio ar y prosiect OneLogin i ddysgu sut y gallen ni helpu defnyddwyr i gadw eu dewis iaith ar draws gwasanaeth cyfan."
        },
        {
            "heading": 2,
            "text": "Ymgysylltu â chymunedau ehangach a dysgu oddi wrthyn nhw"
        },
        {
            "text": "Rydyn ni’n cydnabod bod timau eisoes yn gwneud gwaith gwych ar wasanaethau dwyieithog, felly gwnaethon ni ymgysylltu â nhw i ddysgu o’u gwaith."
        },
        {
            "text": "Gwnaethon ni gwrdd ag Osian Jones ac Adrián Ortega yn y Ganolfan Gwasanaethau Cyhoeddus Digidol, sy’n partneru gyda sefydliadau i adeiladu gwasanaethau cyhoeddus ledled Cymru. Roedden nhw’n siarad am ysgrifennu ar ffurf triawd, sy’n golygu bod dylunydd cynnwys, arbenigwr pwnc a chyfieithydd yn ysgrifennu cynnwys ar y cyd. Gwnaethon nhw sôn am sut roedd defnyddio’r dull hwn wedi eu helpu i ysgrifennu cynnwys sy’n swnio’n fwy naturiol yn y Gymraeg ac i wella eglurder y cynnwys Saesneg o ganlyniad."
        },
        {
            "text": "Rydyn ni wedi bod yn gweithio’n agos gyda’r Uned Iaith Gymraeg i gynnig treial o weithio gyda’n gilydd fel hyn, ac i ddod o hyd i gyfaddawd sy’n ystyried capasiti’r Uned ac sy’n uno ffyrdd presennol o weithio i wneud hyn yn opsiwn i ni i gyd. Rydyn ni’n gobeithio treialu ysgrifennu ar ffurf triawd gyda’r Uned yng Nghaerdydd yn 2024."
        },
        {
            "text": "Siaradon ni hefyd â Nia Campbell, dylunydd cynnwys yn y Weinyddiaeth Gyfiawnder sy’n siarad Cymraeg. Mae hi’n gweithio gydag ymchwilydd defnyddwyr Saesneg ei iaith i gynnal ymchwil yn y Gymraeg, a phwysleisiodd hi pa mor bwysig yw sicrhau bod yr holl gyfathrebiadau, gan gynnwys ffurflenni caniatâd, ar gael yn Gymraeg i’r sawl sy’n cymryd rhan mewn ymchwil fel siaradwyr Cymraeg."
        },
        {
            "text": "Drwy ymgysylltu â’r gymuned ddylunio ehangach, daethon ni’n ymwybodol o adnoddau newydd fel Helo Blod, sef gwasanaeth cyfieithu a chyngor Cymraeg sy’n rhad ac am ddim, cawson ni wahoddiad i ymuno â’r cyfarfod ar-lein ynghylch dylunio cynnyrch a gwasanaethau Cymraeg (am wahoddiad, cysylltwch â Nia), a gwnaethon ni ymuno â chymunedau ymarfer y Ganolfan Gwasanaethau Cyhoeddus Digidol."
        },
        {
            "heading": 2,
            "text": "Rhoi’ch hun yn esgidiau pobl eraill"
        },
        {
            "text": "Rhan allweddol o hyn oedd bod yn barod i gwrdd â phobl lle maen nhw. Aeth ein hymchwilwyr defnyddwyr i lyfrgelloedd yn Wrecsam a siarad â’r cyhoedd yno, gyda phosteri recriwtio wrth law yn ogystal â chopïau yn Gymraeg ac yn Saesneg o gysyniadau drafft."
        },
        {
            "text": "Mantais arall o ymgysylltu â’r cymunedau ehangach oedd dysgu am ddigwyddiadau diwylliannol Cymru fel gŵyl flynyddol yr Eisteddfod sy’n dathlu’r Gymraeg. Rydyn ni bellach yn ystyried defnyddio’r Eisteddfod a digwyddiadau tebyg fel ffordd o recriwtio cyfranogwyr ymchwil Cymraeg eu hiaith, sy’n mynd â ni y tu hwnt i’r sianeli recriwtio safonol."
        },
        {
            "heading": 2,
            "text": "Myfyrdodau terfynol"
        },
        {
            "text": "Er bod ein prosiect yn canolbwyntio ar yr iaith Gymraeg, gellid defnyddio’r egwyddorion a restrir yma i gefnogi creu gwasanaethau cyhoeddus dwyieithog eraill – er enghraifft, pan fo’r gwasanaeth yn bennaf ar gyfer pobl sy’n defnyddio’r Saesneg fel ail iaith."
        },
        {
            "text": "Ar ein prosiect, rydyn ni’n ffodus o gael y cyfle a’r cyfarwyddyd i ganolbwyntio go iawn ar yr iaith. Hyd yn oed os nad ydyn ni, fel timau dylunio, yn gallu gweithredu ar bob un o’r rhain, mae dangos bwriad cadarnhaol a pharodrwydd i ddysgu ac i addasu, hyd yn oed mewn ffyrdd bach, wedi bod yn hanfodol i ni."
        }
    ]
}