{
    "url": "https://defradigital.blog.gov.uk/2024/03/05/life-in-defras-security-academy-hajra-zaman/",
    "title": "Life in Defra’s Security Academy: Hajra Zaman",
    "authors": [
        "Hajra Zaman"
    ],
    "categories": [
        "Defra digital",
        "Defra services"
    ],
    "pub_date": "2024-03-05T07:00:49+00:00",
    "content": [
        {
            "text": "As we continue our series of stories from colleagues who are employed on our talent programmes, we hear from Hajra Zaman who explains why she chose to join the Defra Security Academy."
        },
        {
            "text": "Hi, I’m Hajra and I’m currently enrolled in Defra’s Security Academy. Before joining Defra, I was working in an accountancy role in private sector corporate finance. And prior to that I was studying for a BSc in accountancy."
        },
        {
            "text": "Today, in Defra, I’m part of a diverse team, where all views are welcomed and respected. As a British Pakistani woman, I feel completely at home working in this environment."
        },
        {
            "heading": 2,
            "text": "Why I chose to join a talent programme"
        },
        {
            "text": "I joined the two-year Academy programme last year and it has been a success for me. It’s given me the opportunity to develop new skills and experience. During my time here, I’ve already gained several qualifications and certificates."
        },
        {
            "text": "I’ve also had the opportunity to work within several different teams in Defra group security and understand security from more than just one perspective. And I’ve had access to opportunities such as mentoring and coaching."
        },
        {
            "text": "So far, I have had placements with our Central Operations Team, the Risk and Compliance team, and the Portfolio Assurance team. My next placement will be with the Strategy team."
        },
        {
            "text": "I joined Defra and the Civil Service because it provides me with many opportunities to progress my career, and also to help others. I wanted a career change, and I wanted to go into something that would challenge me, but also a job in which I could help people."
        },
        {
            "heading": 2,
            "text": "A typical day for me"
        },
        {
            "text": "Every day is different in the Academy. When I initially joined, I had some weeks dedicated to independent study, and/or instructor-led teaching days, virtually, as well as well as some days where I worked on projects for my team."
        },
        {
            "text": "Typically, now, I spend the first 30 minutes in the morning going through my emails and planning the structure of my day."
        },
        {
            "text": "I aim to work through the checklist I make for myself, which is usually a combination of the work allocated to me by my team, and then some Academy work. This could typically include working on an upcoming presentation or prepare for some upcoming work. I also attend meetings, which vary from day to day."
        },
        {
            "text": "Towards the end of the day, I go through the list to see which work I have completed and what still needs completing."
        },
        {
            "text": "At times I’ve found working and studying for exams particularly difficult, as it felt like some days were jam packed. But it’s all been worth it so far."
        },
        {
            "text": "I now have a great work life balance, and this enables me to pursue my other passions in life, such as going for long walks, getting good coffee, going to the cinema, and fashion."
        },
        {
            "text": "I also feel like I’m well placed to explore other career paths within Defra in the future, including counter fraud, operational delivery, and project management."
        },
        {
            "heading": 2,
            "text": "An important lesson learned"
        },
        {
            "text": "The most important lesson that I have taken from my experience in the Defra Security Academy is that the more time and effort that you put into the programme, the more you will get out of it."
        },
        {
            "text": "If you’re looking for a career change, even though you might think you don’t have the relevant qualifications and experience, you’ll almost certainly have some of the skills we need, so why not just apply!"
        }
    ]
}