{
    "url": "https://defencedigital.blog.gov.uk/2024/03/05/secondments-a-great-way-to-enable-new-skills-into-defence/",
    "title": "Secondments - a great way to enable new skills into defence",
    "authors": [
        "jithinsajan"
    ],
    "categories": [
        "Digital skills",
        "RAF"
    ],
    "pub_date": "2024-03-05T10:04:34+00:00",
    "content": [
        {
            "text": "A modern, singular Digital Backbone is critical to secure our transition to a digital future and a key part of this is Our People. We need a unified workforce with the necessary digital skills and capabilities to effectively deliver and exploit the Digital Backbone and to achieve our strategic objectives."
        },
        {
            "text": "Through the Digital Skills for Defence programme, we have partnered with industry leaders to provide our people with several digital upskilling opportunities. One such opportunity is secondments."
        },
        {
            "text": "Let me introduce you to Joseph Lanzon, a member of the RAF, who recently completed a secondment with BAE Systems."
        },
        {
            "heading": 2,
            "text": "Firstly, why a secondment?"
        },
        {
            "text": "Working in a new organisation means you are surrounded by new people, exposed to a new culture and presented with new ways of working. All this provides significant benefits for secondees to take advantage of."
        },
        {
            "text": "We have identified two overarching benefits from completing a secondment:"
        },
        {
            "heading": 3,
            "text": "Development:"
        },
        {
            "text": "A secondment is a great way to learn new skills and competencies but also refine and strengthen existing skills."
        },
        {
            "text": "Whilst at BAE Systems, Joseph’s main focus was on software development, everything from testing new systems to the use of new technology. This exposed him to a whole new set of technical skills in the digital space that has helped him strengthen his software developing capabilities."
        },
        {
            "text": "Joseph was integrated into BAE teams from day one and this allowed him to pick up new technical skills and competencies from team members which he can use to develop."
        },
        {
            "text": "However, creating the digital leaders of the future isn’t just about building their digital skills; there is also the need to hone in on the soft skills. During the secondment, Joseph understood the importance of collaboration and teamwork. Through BAE’s collaborative ways of working, Joseph was able to develop his communication and leadership skills and he saw first-hand the importance of teamwork when unlocking real value from digital products and services."
        },
        {
            "heading": 3,
            "text": "New perspectives:"
        },
        {
            "text": "Development is only one aspect of a secondment. At the end of the day, you are part of another organisation and this exposes you to a new perspective in all things work related. All organisations are unique and so a secondment offers you the opportunity to witness new approaches to problems, new ways of working and new cultures."
        },
        {
            "text": "In Joseph’s case, a key takeaway was how people at BAE Systems worked using the AGILE framework and the several benefits this brought."
        },
        {
            "heading": 2,
            "text": "How can it benefit Defence?"
        },
        {
            "text": "By picking up new digital skills and understanding new ways of working, you are able to bring it back to us and share it with project teams. Through knowledge sharing, it can help develop skills in our workforce and identify areas in our existing processes where we can improve."
        },
        {
            "text": "Some key takeaways from Joseph’s experience which could benefit how we work include:"
        },
        {
            "text": "When asked about his secondment, Joseph’s manager had this to say:"
        },
        {
            "heading": 2,
            "text": "Future plans…"
        },
        {
            "text": "It is clear that Joseph’s secondment at BAE Systems was a huge success and we are in discussions to see how we can continue to collaborate and work on upskilling our staff with digital skills in the future."
        },
        {
            "text": "Together with our industry partners, we are committed to providing more opportunities for our people to experience what Joseph experienced on secondment, help to advance our digital transformation and create our digital leaders of the future."
        }
    ]
}