{
    "url": "https://deframedia.blog.gov.uk/2023/01/26/coverage-of-details-on-support-for-farmers-who-deliver-food-production-and-environmental-action/",
    "title": "- Coverage of details on support for farmers who deliver food production and environmental action",
    "authors": [
        "Defra Press Office"
    ],
    "categories": [
        "Farming"
    ],
    "pub_date": "2023-01-26T16:30:19+00:00",
    "content": [
        {
            "text": "Today, there has been widespread coverage on the front page of the Guardian, as well as in the Financial Times, BBC Online, the Independent, the Evening Standard, the Daily Telegraph the Daily Star, and trade coverage in Farmers Weekly, Horticulture Week and Farmers Guide, of our plans to support farmers to be profitable and resilient as they produce food sustainably while protecting nature and enhancing the environment."
        },
        {
            "text": "Our announcement on Thursday sets out detailed plans for the nation’s farming sector. We will accelerate the roll out of the Sustainable Farming Incentive and deliver Countryside Stewardship Plus, which will reward farmers for taking coordinated action, working with neighbouring farms and landowners to support climate and nature aims."
        },
        {
            "text": "The plans includes numerous incentives that will make food production more resilient and efficient over the longer term whilst contributing towards the UK’s environmental goals on carbon, biodiversity, water quality and net zero. Taken together, this will safeguard the long-term prosperity of the farming industry and protect the environment for future generations."
        },
        {
            "text": "Environment Secretary Thérèse Coffey said:   "
        },
        {
            "text": "“Farmers are at the heart of our economy - producing the food on our tables as well as being the custodians of the land it comes from."
        },
        {
            "text": "“These two roles go hand-in-hand and we are speeding up the roll out of our farming schemes so that everyone can be financially supported as they protect the planet while producing food more sustainably.”"
        },
        {
            "text": "These plans provide clarity and certainty to farmers, allowing them to make business decisions and cover costs as direct payments are phased out whilst getting involved in Environmental Land Management schemes. Earlier this month at the Oxford Farming Conference, the Farming Minister announced that farmers will receive increased payments which will provide more support to the industry and drive uptake at a time of rising costs for farmers as a result of global challenges."
        }
    ]
}