{
    "url": "https://dragonsden.blog.gov.uk/2023/01/26/dragons-den-episode-4-series-20/",
    "title": "Dragons’ Den, Episode 4, Series 20",
    "authors": [
        "Lauren Brobin"
    ],
    "categories": [
        "Business",
        "Designs",
        "IP",
        "Trade marks"
    ],
    "pub_date": "2023-01-26T21:05:27+00:00",
    "content": [
        {
            "text": "In this week’s episode we got to see a disco in the Den, business models of the future, partnerships popping up and firm rejections. The Dragons were out of their seats, picking at the fine details to see if the inspiring entrepreneurs had what it takes to launch their businesses to the next level.  "
        },
        {
            "heading": 2,
            "text": "The Sparklebutt effect "
        },
        {
            "text": "Funtrepreneur and starter of parties, Ashlee Ackland, was first to enter the Den. Ashlee is the Founder and Director of Sparklebutt, a disco inspired, gender neutral partywear brand. Looking to bring the party everywhere, Ashlee was asking for £50,000 in exchange for 20% of the company.  "
        },
        {
            "text": "Steven Bartlett was keen to know if the company was her idea. I hopped online at this point and completed a quick UK trade mark search. My search confirmed that Ashlee is the owner of the registered trade mark, ‘Sparklebutt’.  "
        },
        {
            "text": "A company’s name can influence a brand's perception and desire, which over time can become your company’s most valuable asset. So, it’s always good to consider Intellectual Property (IP) within your business planning."
        },
        {
            "text": "   "
        },
        {
            "text": "Ashlee was looking to own the partywear space and hoped that a Dragon would help take her brand global. It’s useful to know that registering a trade mark in the UK only protects your brand in the UK and the Isle of Man. There are different processes for registering trade marks abroad. You can find out more by reading our protect your IP abroad guidance page.  "
        },
        {
            "text": "Unfortunately, Ashlee’s idea failed to sparkle in the Den, after being told by Deborah Meaden that she would need to own her home market before taking over the world. However, Ashlee left with her head held high after Steven said he would happily purchase her products - I would take that as a win!  "
        },
        {
            "heading": 2,
            "text": "Big hitting benefits or compromised concept?  "
        },
        {
            "text": "Next into the Den was Wiltshire-based Amelia Gammon, CEO and Founder of Bide, a company doing good for people and the planet by empowering the untapped workforce to be a production powerhouse.  "
        },
        {
            "text": "Before we dive into the details, I discovered that Amelia owns a series of trade marks. A series consists of up to six trade marks in a single application. For a series to be acceptable, the marks should: "
        },
        {
            "text": "Amelia has protected the word ‘Bide’ and company logo under class 35 (retail services in relation to cleaning articles).  "
        },
        {
            "text": "If you are considering applying for a series of trade marks, it’s recommended that you read our trade mark series guidance and/or speak to an IP professional beforehand. "
        },
        {
            "text": "Back to the Den, Amelia’s home workforce manufactures eco-friendly cleaning products, soon to be accompanied with a ground-breaking body care range. "
        },
        {
            "text": "It all sounded promising until concerns were raised about her company’s valuation and contradictory carbon footprint. The Dragon’s grilling was soon dowsed however as Amelia unveiled her B2B business model, working with a championship football club looking to hit net zero by 2040.  "
        },
        {
            "text": "By congregating home manufacturers within a 3-mile radius of the stadium, Amelia’s cleaning products would be made and supplied locally, helping drastically reduce carbon emissions and invest in local communities.  "
        },
        {
            "text": "Although Peter Jones said he was ‘by far the best Dragon to deal with this vision’, interestingly, no offer was made by Peter. Instead, Amelia successfully secured a deal for 20% of the business with the Den’s sustainability champion, Deborah.  "
        },
        {
            "heading": 2,
            "text": "Master of his craft  "
        },
        {
            "text": "With years of paper engineering experience, David Hawcock was next in the Den, looking to craft a deal for his pop-up versions of classic games, including a chess set. Seeking £40,000 for 20% equity, it didn’t take long for the Dragons to pop up and pitch their percentage."
        },
        {
            "text": "  "
        },
        {
            "text": "As someone with a background in design, I wondered if David had considered protecting his creations with a registered design. Design registration helps protect the appearance of a product including the: "
        },
        {
            "text": "Registering your design makes it easier to prove that the design is legally yours and when you created it. This will help if anyone tries to copy or use your design without your permission. "
        },
        {
            "text": "Peter did pause to question a game that David was looking to call ‘four in a row’ or ‘row of four’, keen to find out if his twist on a classic game was allowed. David confirmed that although he was able to reproduce the well-known game, it couldn't be described as ‘CONNECT 4’, because it is a UK trade mark. If this registered term was used without the owner’s permission, the owner would be able to take legal action.   "
        },
        {
            "text": "As a clear master of his craft, David secured a deal with two of the titans of their industries, Peter Jones and Touker Suleyman.  "
        }
    ]
}