{
    "url": "https://defrafarming.blog.gov.uk/2023/01/26/environmental-land-management-schemes-details-of-actions-and-payments/",
    "title": "Environmental land management schemes: details of actions and payments",
    "authors": [
        "Janet Hughes"
    ],
    "categories": [
        "Countryside Stewardship",
        "environmental land management schemes",
        "Sustainable Farming Incentive"
    ],
    "pub_date": "2023-01-26T12:34:13+00:00",
    "content": [
        {
            "text": "Today we published further information on the growth and rollout of our environmental land management schemes.   "
        },
        {
            "text": "It includes the full range of actions, payment rates and when they’ll be available.  "
        },
        {
            "text": "There’s something for everyone in our schemes and grants. We’ve made them much more straightforward, flexible and workable, so if you haven’t yet looked, now is the time to."
        },
        {
            "text": "The document is available to read on GOV.UK. In this post, I’ll share a scheme-by-scheme summary."
        },
        {
            "heading": 2,
            "text": "Something for everyone"
        },
        {
            "text": "From the start of the agricultural transition, our approach has been to work with farmers to develop reforms to agricultural policy and to introduce those changes gradually."
        },
        {
            "text": "Last year, we started to roll out some of the core elements of the Sustainable Farming Incentive (SFI), explaining that we’d learn as we go, expanding and refining the offer until the full scheme is available in 2024."
        },
        {
            "text": "Working in this way means that we can make sure that we’re giving you the support you need to produce high-quality food and take care of the environment. "
        },
        {
            "text": "It also means that there is more time to adapt and prepare for the future."
        },
        {
            "text": "We’re making sure that there is an offer all farm types, regardless of size, location, ownership or the systems used. "
        },
        {
            "text": "The actions we will pay for cover:"
        },
        {
            "heading": 2,
            "text": "The Sustainable Farming Incentive (SFI) offer in 2023"
        },
        {
            "text": "The Sustainable Farming Incentive pays you to carry out farming activities in a more environmentally sustainable way so that you can produce food alongside environmental goods and services. "
        },
        {
            "text": "In June 2022, we launched the SFI with 3 standards:"
        },
        {
            "text": "The 6 new standards we’ll introduce in 2023 are:"
        },
        {
            "text": "This year, we’re introducing 3 more standards than planned. This is so that our offer is wide-ranging and helps us to achieve our ambitions for food production, the environment and climate. "
        },
        {
            "text": "If you already have an SFI agreement, you will be able to add these actions and more land."
        },
        {
            "text": "Many of the actions we will pay for will help you reduce your costs, improve your efficiency and improve the natural environment."
        },
        {
            "text": "For example, the nutrient and integrated pest management standards can help you optimise your use of inputs, helping you to reduce costs whilst also potentially maintaining or even improving yields."
        },
        {
            "text": "SFI agreements last for 3 years. If you’re a tenant farmer, you do not need landlord consent to take part. If you carry out the actions, payments will go to you."
        },
        {
            "text": "You can leave the scheme early, with no penalty, if you unexpectedly lose management control of the land you’ve entered into the scheme."
        },
        {
            "text": "In the coming weeks, we’ll publish a podcast and a blog post discussing the standards in more detail, including the rationale behind them. We’ll also cover the new SFI Management Payment which we talked about in a recent post."
        },
        {
            "text": "In short, the SFI Management payment recognises the cost of planning for and participating in the SFI."
        },
        {
            "text": "We’ll keep this payment under review over the next 2 years, along with all other elements of scheme design and delivery, to make sure the scheme works for farmers, delivers value for money and helps to achieve our ambitions."
        },
        {
            "heading": 2,
            "text": "Annual Health and Welfare Review"
        },
        {
            "text": "As part of the wider SFI offer, we started to roll out the funded vet-led annual health and welfare review with a small numbers of farmers. This is something we’ve blogged about and we will soon make this offer more widely available."
        },
        {
            "text": "We plan to add animal welfare grants to our package of support in the spring. "
        },
        {
            "heading": 2,
            "text": "Countryside Stewardship"
        },
        {
            "text": "Countryside Stewardship pays you for the environmental work you carry out alongside sustainable food production — from restoring wildlife habitats, to creating or managing woodlands, to mitigating flood risks."
        },
        {
            "text": "From January 2023, we updated payment rates for revenue and capital options in Countryside Stewardship (CS). Colleagues over at the RPA blogged about this recently."
        },
        {
            "text": "We encourage you to think about applying for CS Mid Tier, the Wildlife Offers and Higher Tier applications in 2023, for agreements starting for 1 January 2024."
        },
        {
            "text": "A range of capital grants are also available. The official Capital payments rate guidance can be found on GOV.UK."
        },
        {
            "text": "We’ve made a number of changes to improve the application process and broaden the scope of CS. These include:"
        },
        {
            "text": "The Higher Tier and Mid-Tier and Wildlife Offer windows will open again shortly for applications, so do consider applying."
        },
        {
            "text": "Building on the success of Countryside Stewardship, we’ve decided to evolve Countryside Stewardship to include what we’d originally planned for Local Nature Recovery, rather than introducing a new Local Nature Recovery scheme."
        },
        {
            "text": "Countryside Stewardship Plus will reward farmers for taking coordinated action, working with neighbouring farms and landowners to support climate and nature aims."
        },
        {
            "text": "This will enable us to achieve our original ambitions through a faster, smoother and familiar route. We’ll continue to evolve the scheme over the course of this year and into 2024."
        },
        {
            "text": "The evolution of the Countryside Stewardship scheme will see around 30 additional actions available to farmers by the end of 2024. As the schemes evolve over the next 2 years, we intend to offer SFI and CS in a single, integrated service. You’ll be able to select a combination of actions from both schemes that work for you. "
        },
        {
            "text": "We are working to make the transition as smooth as possible. Where there are similar actions in both SFI and CS we’ll maintain parity of payment rates across both schemes. So, if you're already carrying out actions in CS you are not at a disadvantage."
        },
        {
            "text": "People with a CS agreement can also have a SFI agreement, so long as we are not paying for the same actions twice on the same piece of land, and the actions for which we are paying are compatible."
        },
        {
            "text": "The scheme will include what’s currently available through the England Woodland Creation Offer, once that scheme has transitioned. We will also improve access for tenants and expand access to Higher Tier options and agreements."
        },
        {
            "heading": 2,
            "text": "Landscape Recovery"
        },
        {
            "text": "Landscape Recovery funds a smaller number of longer-term, larger-scale, bespoke projects to enhance the natural environment and deliver significant benefits."
        },
        {
            "text": "Last summer, we announced the 22 projects chosen for the first round of the scheme. These projects represent hundreds of farmers and landowners working together."
        },
        {
            "text": "The majority involve groups of land managers and farmers, including tenants, working together to deliver a range of environmental benefits across farmland and rural landscapes."
        },
        {
            "text": "The projects are boosting biodiversity, improving water quality, reducing flood risk and helping us reach net zero. For example, restoring and protecting 700km of rivers to provide habitats for 263 species including the water vole, otter, pine marten, lapwing, great crested newt, European eel and marsh fritillary. "
        },
        {
            "text": "We blogged with an update on the first round Landscape Recovery projects last month and will feature more projects on the blog in the coming months."
        },
        {
            "text": "We will open applications for further rounds of Landscape Recovery in spring this year and in 2024. "
        },
        {
            "text": "The second round will focus on net zero, protected sites and habitat creation."
        },
        {
            "text": "This could include landscape-scale projects creating and enhancing woodland, peatland, nature reserves and protected sites such as ancient woodlands, wetlands and salt marshes."
        },
        {
            "text": "We will take on up to 25 projects, depending on the quality of the applications. "
        },
        {
            "text": "We will share more information for potential applicants in the coming weeks through a series of webinars. We'll blog with the details and dates soon. "
        },
        {
            "heading": 2,
            "text": "Plan for the future"
        },
        {
            "text": "To help you manage the transition and plan, you can get free advice from an independent provider."
        },
        {
            "text": "In this post, I’ve just covered our environmental land management schemes. The guidance for every scheme and grant on offer can be found on the Funding for farmers and land managers page on GOV.UK. "
        },
        {
            "text": "Over the course of the year, we’ll continue to learn from our pilots, tests and trials, and engagement with farmers and other expert practitioners."
        },
        {
            "text": "We’ll also continue to improve farm regulation and support farm productivity, innovation, research and development. "
        },
        {
            "text": "Subscribe to the Future Farming blog for updates from the team along the way."
        },
        {
            "text": "Finally, I've set up a thread on The Farming Forum, for you to share your thoughts and to ask me questions about our environmental land management schemes. You're very welcome to leave a comment or question on this post too."
        }
    ]
}