{
    "url": "https://publicpolicydesign.blog.gov.uk/2023/01/26/joining-up-apprenticeship-policy-and-delivery/",
    "title": "Joining-up apprenticeship policy and delivery",
    "authors": [
        "Natasha Atkinson"
    ],
    "categories": [
        "Case study",
        "PublicPolicyDesign"
    ],
    "pub_date": "2023-01-26T12:00:36+00:00",
    "content": [
        {
            "text": "Over the past 5 years apprenticeships have been transformed into high quality skills programmes for learners and employers."
        },
        {
            "text": "We have changed the way we develop, manage, and deliver apprenticeships policy, by combining separate policy and delivery teams to create one apprenticeships directorate within the Department for Education. We now operate an integrated approach to end-to-end delivery, working together from project conception through to delivery."
        },
        {
            "text": "This approach, along with the support of our partners, has helped us to update apprenticeships, so they offer a high-quality route into professions as diverse as engineering, healthcare, and digital for young people starting their careers, or adults hoping to retrain and upskill."
        },
        {
            "heading": 2,
            "text": "Creating a whole sector focus on outcomes"
        },
        {
            "text": "Our attention remains on end-to-end delivery with a primary focus on quality, so apprenticeships offer individuals high-quality routes into employment. Apprenticeships are already known for their good employment prospects with 91% of apprentices going into work or further training with many apprentices remaining with their employer following their apprenticeship."
        },
        {
            "text": "We want to build on this success by making the apprenticeship programme available to more people. One way we plan to do this is by ensuring more potential apprentices and employers are aware of the opportunities apprenticeships bring. A great way to do that is by them hearing from their peers – people who have been in their shoes – and our Apprenticeships Ambassadors Network (AAN) of over 1,000 volunteer employers and apprentices do this to inspire through telling their own stories. Our challenge was how could we maximise the impact of these expert ambassadors."
        },
        {
            "heading": 2,
            "text": "Explaining the value of apprenticeships"
        },
        {
            "text": "We worked with the AAN leadership to refresh the strategy. We agreed an ambitious vision that “every individual and employer will understand the value of an apprenticeship as a route to opportunity and economic success.” We needed to think big on how we would take steps towards this."
        },
        {
            "text": "The AAN have set some precise objectives for what they want to achieve over the next 3 years, aligning these to government priorities for Apprenticeships. An ambassador will be engaged with the 3,500 secondary schools and colleges in England to inspire the next generation of apprentices, and ambassadors will buddy with new small business employers to ensure they get expert advice during the early days of their journey into the world of apprenticeships."
        },
        {
            "heading": 2,
            "text": "Using digital to improve our service and scale our operations"
        },
        {
            "text": "Digital solutions are part of how we work to deliver excellent public service. We recognised that the AAN were not fully exploiting the power of digital and thought this could provide an opportunity for achieving the ambitions laid out in the strategy."
        },
        {
            "text": "Delivering on these ambitions will mean growing the number of active volunteers in the AAN. We had to address the fact that Ambassadors struggle to onboard, connect with fellow members, find, and participate in relevant events and opportunities. We had to improve their experience and remove the need for manual work arounds, such as that used currently for events management."
        },
        {
            "text": "We realised this current way of working is significantly impacting the motivation of members and is limiting the value associated with the AAN itself. We recognised that user friendly digital tools and a great user experience are crucial to achieving this scale."
        },
        {
            "heading": 2,
            "text": "Digital makes our transactions better"
        },
        {
            "text": "We’ve benefited from colleagues joining the team who have experience of working on other digital projects. Chris Bradley joined the team from the Apprenticeship Service, the digital team in the Apprenticeships Programme. Chris noted “We know digital projects tend to occur where you’ve got transactions between two parties. This is happening across government as well as across other areas of our lives to provide a better user experience. The benefits of digital are that it can be scaled and drive better value for the taxpayer.”"
        },
        {
            "text": "But most important is working with our users to ensure we understand their needs – the service has to be designed, delivered, and operated so they have a great experience and are motivated to be active in the AAN and be enabled to tell their stories, share their expertise and inspire and support others."
        },
        {
            "heading": 2,
            "text": "Gaining user feedback to inform our approach"
        },
        {
            "text": "From the start we developed a great relationship with our users in the AAN. Throughout the Discovery phase they were great at explaining what they did, what they needed and what didn’t work for them right now. This gave us the evidence to move into Alpha phase."
        },
        {
            "text": "The Alpha phase has been about prototyping at low cost the potential solutions we could put in place. This can be as simple as sketching out what we’d do and developing some low-level tech ideas to show the future service at low cost and get feedback from users. “During the Alpha phase fast iterations of the product have been developed based on feedback from real users.” Chris noted.  “We’ve been looking at how we can get something out to users as quickly as possible that they find useful.”  We knew it was crucial to offer value to prospective ambassadors, so they engage with AAN opportunities, increase existing ambassador participation, and reduce the administrative burden when managing members and events."
        },
        {
            "text": "Digital colleagues in the Apprenticeship Service have now completed the Alpha (prototyping) phase and moved into Beta (build) phase in early November.  There will be regular project engagement and show and tells throughout the build phase."
        },
        {
            "heading": 2,
            "text": "Ready to maximise benefits"
        },
        {
            "text": "We expect fit-for-purpose digital tools to bring significant benefit to the AAN by reducing low-value administrative tasks, enabling more time for high-value advocacy, providing real-time management information for supporting and managing the network and providing a foundation for scaling. This will help us create a virtuous circle where we can educate and inspire others and then grow as these individuals join us as future ambassadors. We realise that simply introducing digital systems alone won’t achieve our goals. So, we are now also considering what other changes are needed to ensure these benefits are realised. This might be the skills to use the portal, or changes to how we use the more personal onboarding elements."
        },
        {
            "text": "Our focus over the next few years is to make apprenticeships work for more people. To achieve this, we will continue to join-up work between policy and delivery teams and to reach out to our audiences – employers, apprentices, and providers - as an integral part of our work."
        }
    ]
}