{
    "url": "https://socialcare.blog.gov.uk/2023/01/26/managing-infections-dont-forget-about-the-indoor-air-in-your-care-home/",
    "title": "Managing infections - don’t forget about the indoor air in your care home",
    "authors": [
        "Professor Cath Noakes",
        "Professor Carl Thompson",
        "Professor Karen Spilsbury",
        "Professor Tim Sharpe"
    ],
    "categories": [
        "Care and support",
        "coronavirus",
        "Information sharing",
        "Workforce"
    ],
    "pub_date": "2023-01-26T16:56:11+00:00",
    "content": [
        {
            "heading": 2,
            "text": "Why does ventilation matter?"
        },
        {
            "text": "The COVID-19 pandemic revealed just how important ventilation is as part of infection prevention and control, especially for respiratory infections."
        },
        {
            "text": "Good ventilation reduces infection risks and can improve the health and well-being of people living, visiting or working in care homes. Poorly ventilated buildings can suffer from damp and mould, which is hard and expensive to tackle, as well as being associated with an increase in the chances of respiratory infections."
        },
        {
            "text": "Older people are particularly vulnerable to the consequences of respiratory infections. Although vaccination significantly reduces risks of infection, premature death, and disease severity, COVID-19 and influenza outbreaks in care homes still happen."
        },
        {
            "heading": 2,
            "text": "Understanding and managing ventilation"
        },
        {
            "text": "Care homes vary significantly in design, from converted houses likely to have predominantly natural ventilation, to purpose built modern buildings with a mixture of natural and mechanical ventilation."
        },
        {
            "text": "Naturally ventilated buildings use windows, doors and vents to allow air to flow in and out of spaces. The amount of ventilation depends on the weather, with windy days more likely to create ventilation than still days. Mechanical ventilation uses fans to move air into and out of rooms."
        },
        {
            "text": "Many care homes use local air conditioning units. You may not know that most devices simply cool and recirculate air within a space, but they don’t provide any fresh air. This means that a room can feel more “comfortable” but not be better ventilated, and so infection risks remain."
        },
        {
            "text": "It is much easier to ensure good ventilation if you avoid cold and draughts. Some small things can make a big difference – for example opening high level windows, avoiding blocking radiators and making sure heating and ventilation systems are working properly can all help."
        },
        {
            "heading": 2,
            "text": "Prioritise spaces where people gather"
        },
        {
            "text": "Airborne infection risk is greatest in shared spaces where people gather for longer periods of time, such as in communal lounges or dining rooms. Short periods of time in a poorly ventilated space are unlikely to pose a significant risk but spending hours in a poorly ventilated room with a lot of people means particles build up in the air and are more likely to be breathed in by more people with an increasing risk."
        },
        {
            "heading": 2,
            "text": "Make the air quality “visible”"
        },
        {
            "text": "Carbon dioxide (CO2) meters are simple, relatively low-cost devices, able to help staff judge the effectiveness of ventilation efforts. The amount of CO2 in the air in an occupied room reflects the amount of fresh air – the lower the CO2 the better the ventilation. CO2 meters are not foolproof, as false or inaccurate readings can happen. However, the best monitors are those using non-dispersive infra-red (NDIR) sensors. They should be regularly checked and, if necessary, calibrated according to manufacturer guidance."
        },
        {
            "heading": 2,
            "text": "Support your staff to understand why ventilation matters"
        },
        {
            "text": "To provide effective ventilation for both comfort and infection prevention and control, it is important staff know why it matters and what they can do to improve it."
        },
        {
            "text": "Information on ventilation could be provided to staff as part of health and safety or infection prevention and control training to help staff understand how respiratory infections can spread in the air and why ventilation is part of the solution."
        },
        {
            "heading": 2,
            "text": "Take the next step"
        },
        {
            "text": "There is a lot of information available and it may help to check these resources for understanding and managing ventilation:"
        },
        {
            "text": " "
        }
    ]
}