{
    "url": "https://marinedevelopments.blog.gov.uk/2023/01/26/the-mmo-ramps-up-plans-to-further-protect-english-marine-sites/",
    "title": "The MMO ramps up plans to further protect English marine sites",
    "authors": [
        "Dan Cutler, Communications & Engagement Manager"
    ],
    "categories": [
        "marine conservation"
    ],
    "pub_date": "2023-01-26T09:29:43+00:00",
    "content": [
        {
            "text": "We’ve launched the next stage in our ambitious project to manage all fishing activities and protect valuable marine habitats in England’s Marine Protected Areas (MPAs) by 2024. "
        },
        {
            "text": "On 17 January 2023, we launched our Stage 2 formal consultation, to seek your views on a proposed byelaw to manage bottom towed fishing gear in 13 MPAs. "
        },
        {
            "text": "At the same time, we opened our Stage 3 call for evidence and will be asking you to submit additional evidence and share your views on the evidence and analysis of the impacts of fishing on seabed features in English MPAs. "
        },
        {
            "text": "Both our consultation on a proposed byelaw to ban bottom towed gear in 13 more MPAs and call for evidence will close on 28 March 2023. "
        },
        {
            "text": "What are MPAs? "
        },
        {
            "text": "There are currently 178 MPAs spanning 40% of England’s waters, these areas provide an important refuge for marine life, and are critical to protecting rare and threatened habitats and species from damage caused by human activities such as fishing. "
        },
        {
            "text": "What is being proposed? "
        },
        {
            "text": "Our previous work to assess the impact of bottom towed fishing gear on rock, reef and related features found that this type of activity poses considerable risks to the condition of these features in the 13 MPAs. We believe that management measures are required to address these risks, which is why we’re proceeding with the next stage for introducing the proposed byelaw to ban this type of fishing activity. "
        },
        {
            "text": "Which areas will the proposed changes affect? "
        },
        {
            "text": "Locations that would gain protection from the proposed byelaw include Cape Bank, home to ecologically important species such as pea urchins and a type of starfish called a cushion star; Haig Fras, a site that supports a variety of fauna ranging from jewel anemones and solitary corals; and Goodwin Sands, home to rocky habitats that support species such as pink sea fans, cup corals and commercially important shellfish and fish. "
        },
        {
            "text": "Our proposal to ban bottom towed gear would protect these vital marine ecosystems - in an area of over 4,000 km2. Combined with our existing byelaws, this will bring the total area protected from bottom towed gear by MMO byelaws to almost 18,000 km2. "
        },
        {
            "text": "What happens next? "
        },
        {
            "text": "Following the completion of the Stage 3 call for evidence and Stage 2 formal consultation, we will review all the information that is received.  "
        },
        {
            "text": "For the Stage 2 proposals, if we still believe they are necessary, we will progress with the implementation of the proposed byelaw to ensure these MPAs are protected for the future.  "
        },
        {
            "text": "For Stage 3, we will undertake site level assessments and develop suitable management measures, drawing on the evidence documents presented in the call for evidence. Any new management measures developed as part of Stage 3 will be subject to public consultation. We will keep you informed of these next stages as they progress. "
        },
        {
            "text": "Share and take part! "
        },
        {
            "text": "It’s important that we gather as many views and as much evidence as possible during this next stage. Please considering sharing the links below with your contacts. You can also use the hashtag #MPAHaveYourSay on social media and join others in helping to promote our vital work. "
        }
    ]
}