{
    "url": "https://digitaltrade.blog.gov.uk/2023/01/26/thinking-of-a-career-change-switch-to-be-a-digital-data-and-technology-ddat-professional-2/",
    "title": "Thinking of a career change? Switch to be a Digital, Data and Technology (DDaT) professional",
    "authors": [
        "Joanne Granton, Capability Lead",
        "Emma Baird, Research Operations Lead",
        "Rachael Robinson, Senior Developer",
        "Will Langdale, Junior Data Scientist"
    ],
    "categories": [
        "People"
    ],
    "pub_date": "2023-01-26T12:08:49+00:00",
    "content": [
        {
            "text": "Many may start to think about our next career move during the first few months of the new year. To inspire you, we spoke to colleagues in the Digital, Data and Technology (DDaT) team at the Department for International Trade (DIT). We asked them about their career journey into their current roles, what inspired them to join us and their advice for someone wanting to make a similar move.  "
        },
        {
            "heading": 2,
            "text": "Jo Granton, DDaT Capability Lead"
        },
        {
            "heading": 3,
            "text": "What did you do in your pre-DDaT role?"
        },
        {
            "text": "Before joining DIT, I worked for the Department for Environment, Food and Rural Affairs (DEFRA)’s large DDaT team for 6 years, leading on talent, workforce planning and wellbeing. Prior to joining the Civil Service, I was a teacher for 13 years. I led Business and Computer Science at a school in Devon and enjoyed leading Enterprise Days. These involved bringing together local and national businesses to inspire students to think about careers and apprenticeships. In fact, that is where I started my passion for promoting apprenticeships and I have been involved in National Apprenticeship Week since it began back in 2007."
        },
        {
            "text": "Before teaching, I worked for a large Aerospace company leading their European Exports and I started my working life working for the railway. I was the train announcer at Bath Spa station! Then, I moved to Eurostar when it was based at Waterloo and was a Customer Service Team Leader. I also worked on the Eurostar IT Helpdesk."
        },
        {
            "heading": 3,
            "text": "What inspired you to change career paths to become a DDaT professional?"
        },
        {
            "text": "I made my move to the Civil Service after I had my daughter in my late thirties. A career in the Civil Service is superb for families. It is flexible, interesting and there is the opportunity to work part-time in almost any role, so you don’t have to choose between career progression and bringing up a young family. The DDaT profession was a perfect next step with my experience working on an IT Helpdesk and teaching IT and Computer Science in schools. I am lucky to be able to work in the DDaT Profession and support all teams with their talent, wellbeing, and capability. I also represent DIT DDaT across government on areas such as apprenticeships and the DDaT Capability Framework."
        },
        {
            "text": "Alongside my day job, I love taking opportunities to continue my professional development. I have completed my Level 5 Diploma in Human Resource Management. I was recently awarded Chartership in the Chartered Institute of Professions Development (CIPD) at Level 7 (Masters) through my experience at Defra and DIT. I am so proud of these achievements!"
        },
        {
            "heading": 3,
            "text": "What advice would you give someone looking to make the move?"
        },
        {
            "text": "DIT DDaT is a friendly and supportive place to work. There are a huge range of roles in DDaT with superb progression opportunities, where you can work across different teams and support on projects where you can really make a difference. We have a wonderful, diverse team where we can bring our whole selves to work."
        },
        {
            "text": "In January, I introduced Career Conversations at work. We invited staff from across DDaT to come and talk about their career to help inspire others and learn about different ways to make our careers work for us.  I’m hoping to continue encouraging colleagues to inspire others at work in the future."
        },
        {
            "heading": 2,
            "text": "Will Langdale, Junior Data Scientist"
        },
        {
            "heading": 3,
            "text": "What did you do in your pre-DDaT role?"
        },
        {
            "text": "Fundraising! I led teams that wrote, designed and targeted materials that raised money for charities and political movements, whether it was sending emails to inboxes or mailings through letterboxes. I wrote to inspire, persuade and get hard-hitting asks in front of the people most likely to say yes to them. It was using customer data to target them that paved my path into the world of data and data science."
        },
        {
            "heading": 3,
            "text": "What inspired you to change career paths to become a DDaT professional?"
        },
        {
            "text": "Impact. In 2019, I ran a particularly tough campaign that needed a big team of creative and technical professionals, quickly. Over 6 weeks I saw that while we could get talented copywriters easily, good data scientists were much harder to find. Having even one data scientist could transform your campaign. For every £5 we raised, £1 was down to them."
        },
        {
            "text": "I also saw that data science was even more creatively liberating than copywriting. Where every written word was sent through a lot of policy and communications teams’ edits, our data scientists were free to tackle their projects however they wanted. They could be as novel and imaginative as they liked, as long as they got the job done."
        },
        {
            "text": "I knew then that that was how I wanted to spend my working week, and I wanted to do it for the public good."
        },
        {
            "heading": 3,
            "text": "What advice would you give someone looking to make the move?"
        },
        {
            "text": "Learn the basics of the role that interests you, then find a project that inspires you. It won’t be long before you’ve got enough to back yourself on an entry-level job application. For me, the basics meant learning in my own time on Udemy while being on the furlough scheme in 2020. By the end of the year, I’d started a data analysis apprenticeship at HM Revenue and Customs (HMRC). Then, I applied for my first data science role at DIT at the end of 2021. Achieving all this in 2 years isn’t bad!"
        },
        {
            "text": "Your first project is such an important rite of passage. Good data scientists have boundless passion and curiosity. They endlessly turn up questions in their data, and the answers to these bring even more questions. When you care about what you are trying to do, hours can melt away as you investigate data, learn problem-solving techniques and troubleshoot your implementation. You do it again and again as you begin to untangle exactly what secrets lurk down in the depths of the data. Great fun!"
        },
        {
            "heading": 2,
            "text": "Emma Baird, Research Operations Lead"
        },
        {
            "heading": 3,
            "text": "What did you do in your pre-DDaT role?"
        },
        {
            "text": "Pre-DDaT I worked in HM Revenue & Customs (HMRC) for over 10 years, most recently working for the Policy, Legislation and Guidance team reviewing and communicating legislation and guidance to National Minimum Wage (NMW) compliance officers. I also worked as an Assistant Investigator in the Fraud Investigation Service completing analysis of customer’s tax liabilities. Prior to this, I worked as a compliance officer in NMW conducting enquiries to ensure employers paid the correct amount of NMW to employees."
        },
        {
            "text": "I have always loved the flexible working terms and conditions on offer in the Civil Service encouraging me to explore further roles within the organisation."
        },
        {
            "heading": 3,
            "text": "What inspired you to change career paths to become a DDaT professional?"
        },
        {
            "text": "Whilst working in HMRC, I began to feel my options for progression were limited and that a change was required. I was introduced to the world of DDaT through my involvement with a project in HMRC's Digital Services team, focusing on developing a new system to house guidance. This experience helped me recognise my enjoyment for this type of work and learn more about the varied roles on offer in DDaT."
        },
        {
            "text": "I explored my options for moving into DDaT and successfully obtained a position on the Civil Service Fast Stream. Completing the Fast Stream helped me find my area of interest, which kickstarted my career with DDaT."
        },
        {
            "text": "Currently I work as a Research Operations Lead in the user research profession. My role has allowed me to combine my DDaT and user research experience with my project management and operational skills. I have found a role I enjoy with a focus on processes and measures that support researchers in planning, conducting and applying quality research at scale."
        },
        {
            "heading": 3,
            "text": "What advice would you give someone looking to make the move?"
        },
        {
            "text": "Don’t doubt yourself! My biggest pitfall pre-DDaT was my confidence. I was anxious about doing something completely different where I would have to ‘start again’. It’s never too late to learn! The opportunities and roles in DDaT are so vast and varied that you will always find something exciting to challenge yourself with."
        },
        {
            "text": "For anyone looking to learn more about DDaT roles, I would recommend they read about the DDaT Job Families on GOV.UK. This helped me identify the areas and roles I was interested in, as well as understanding where my skills would be best suited to develop the career I wanted."
        },
        {
            "heading": 2,
            "text": "Rachael Robinson, Software Engineer"
        },
        {
            "heading": 3,
            "text": "What did you do in your pre-DDaT role?"
        },
        {
            "text": "Pre-software engineering, I ran creative workshops for children creating everything from picture books to podcasts. I also taught English in secondary schools and language centres."
        },
        {
            "heading": 3,
            "text": "What inspired you to change career paths to become a DDaT professional?"
        },
        {
            "text": "Having spent my career promoting creativity, I realised I wanted a role where I could be a ‘maker’. I had always enjoyed experimenting with computers, creating some flashy websites when I was a teenager. As an adult, I started learning to code again and rediscovered the joy of using technology to fix problems and make new things."
        },
        {
            "heading": 3,
            "text": "What advice would you give someone looking to make the move?"
        },
        {
            "text": "Find out if you will enjoy the work before committing to specialist training. This might mean learning coding or user experience design with a short free online course, like the ones on Free Code Camp or Code Academy. You could also look for programs offering training in multiple roles, like the DDaT and Cyber Fast Stream."
        },
        {
            "text": "Once I’d decided to make the move, I took a full-time ‘coding bootcamp’ course and have worked as a software engineer ever since. Now, apprentices in DIT get paid while gaining those same skills, so do look for opportunities to earn while you learn."
        },
        {
            "text": "Don’t worry about coming from a very different career background. The communication skills I developed as a teacher have been incredibly useful in my new career. I’m now back in a role where I am training others, while also getting the time to create with code."
        },
        {
            "heading": 2,
            "text": " Feeling inspired?"
        },
        {
            "text": "It’s never too late to make a change! There is a role for everyone in the DDaT team, regardless of your skills, knowledge, and experience. If you are interested in hearing more about life in DIT DDaT, check out our other blogs on Digital Trade and take a look at our current vacancies to find one for you."
        }
    ]
}