{
    "url": "https://medregs.blog.gov.uk/2024/03/15/british-science-week-qa-with-mhras-deputy-director-of-innovative-medicines-shirley-hopper/",
    "title": "British Science Week: Q&A with MHRA’s Deputy Director of Innovative Medicines, Shirley Hopper",
    "authors": [
        "Shirley Hopper"
    ],
    "categories": [
        "Uncategorized"
    ],
    "pub_date": "2024-03-15T16:24:23+00:00",
    "content": [
        {
            "text": "To celebrate British Science Week, we spoke to the MHRA’s Deputy Director of Innovative Medicines, Shirley Hopper, to see how new medicines are approved."
        },
        {
            "text": "Q: What is your role at the MHRA?  "
        },
        {
            "text": "I’m Shirley Hopper, a medical doctor by training. At the MHRA I manage the teams that look after the licensing of innovative products. Within that there are two different types of medicines: chemical and biological, depending on the type of manufacturing process. My team and I look after both, so our work covers all new medicines."
        },
        {
            "text": "Q: How would you explain the purpose of your teams? "
        },
        {
            "text": "So the core purpose is to review applications for and grant a licence or marketing authorisation for new medicines where appropriate. That is specifically medicines that have not been used in the UK before – not generic copies of other medicines which are already available."
        },
        {
            "text": "We want patients to have access to new medicines that are going to be effective and safe and want to be able to do that in the shortest time possible, particularly for medicines and treatments for which there is an urgent need for these patients. That is why we get up in the morning."
        },
        {
            "text": "Q: What typically goes into the process of a new approval? What are the key considerations? "
        },
        {
            "text": "The developer who has made an application to us has to compile a dossier of data which includes the results of tests they have carried out and other pharmaceutical aspects of their medicine. Key to this is the quality of the medicine and how it will be controlled with each new batch that is produced, and we have scientists and pharmacists who assess this key safety aspect."
        },
        {
            "text": "In the beginning laboratory and non-clinical testing is carried out by the developer, and when the safety is judged to be at an adequate level, studies begin in humans usually through healthy volunteer studies, also known as early phase studies. Once a safe dose is established, further (and larger) studies are carried out in patients who have the condition the developer is trying to treat, to confirm safety and effectiveness."
        },
        {
            "text": "From our side, we have multi-disciplinary teams that look at the dossier provided by the developer in parallel. This includes medically qualified clinical assessors, pharmaceutical/quality assessors, non-clinical assessors, statisticians and clinical pharmacologists. We also review the information that will be provided to healthcare professionals and patients to ensure safe use of the medicine in practice.  We have a timetable with milestones to help us with the review process. This allows time for the applicant to address any questions that we may have."
        },
        {
            "text": "Q: Often the key question is the benefits vs the risks of the product in question. In approval terms, how hard can it be to balance the two sides? "
        },
        {
            "text": "The individual who leads on the benefit risk assessment is the medical assessor, and they will want to be assured that the quality of the medicine meets our stringent regulatory standards. No medicine is completely safe, so we will ensure that the benefits are clinically meaningful and outweigh the risks. We work with risk management plan assessors from our Safety & Surveillance team to ensure that the safety profile is carefully monitored after approval, and any risks can be managed in practice."
        },
        {
            "text": "Where appropriate, the MHRA aims to involve patients at every step of the regulatory process to ensure that the balance of risk and benefit is considered from all perspectives."
        },
        {
            "text": "Q: There is an assumption that the MHRA and the MHRA alone makes a decision on an approval, but the Committee on Human Medicines has a big role to play as well. Can you talk through how this process works? "
        },
        {
            "text": "Yes, we consult the independent Commission on Human Medicines (CHM) on innovative medicines applications that come in via our national route. The CHM includes a wide range of well-regarded experts who can advise us on the safety, quality and effectiveness of medicines."
        },
        {
            "text": "Q: To build on that point, patients and more generally the wider public are waiting on our approvals for innovative medicines, but that approval doesn’t necessarily mean the product is instantly available on the market. Can you talk about the work we do with other organisations such as the NHS and NICE? "
        },
        {
            "text": "Yes. Manufacturers will typically make early applications to Health Technology Assessment (HTA) bodies – for example the National Institute for Health and Care Excellence (NICE) in England – so they will be submitting information to the MHRA and these bodies in parallel. This is because NICE also need to make their own appraisals and subsequent recommendations, which are also based on a review of clinical and economic evidence (how well the medicine or treatment works in relation to how much it costs the NHS). The NHS is then legally obliged to fund and resource medicines and treatments recommended by NICE’s technology appraisals."
        },
        {
            "text": "A manufacturer making early applications to HTA bodies alongside the MHRA can help to speed the process up. Alongside that, with the consent of the manufacturer concerned we may share certain information with HTA and NHS bodies across the UK to help facilitate their parallel assessment of the medicine."
        },
        {
            "text": "Our Innovative Licensing and Access Pathway (ILAP), for which NICE is a partner,  provides a single integrated platform for sustained collaborative working, allowing for enhanced coordination and monitoring of important product development activities."
        },
        {
            "text": "Q: By definition your team facilitates innovation – what approvals have your team been a part of in recent years that stand out?"
        },
        {
            "text": "Casgevy, a new treatment for sickle-cell disease and transfusion-dependent β-thalassemia, which we approved in November 2023, is a really good example of the work we have done."
        },
        {
            "text": "Casgevy was the first medicine to be licensed that uses the gene-editing tool CRISPR (its inventors won the Nobel Prize in 2020). We were the first in the world to approve this as we recognised that it was a really transformative product for patients with very difficult to treat conditions."
        },
        {
            "text": "The product is designed to work by editing the faulty gene in a patient’s bone marrow stem cells so that the body produces functioning haemoglobin. To do this, stem cells are taken out of bone marrow, edited in a laboratory and then infused back into the patient after which the results have the potential to be life-long."
        },
        {
            "text": " "
        }
    ]
}