{
    "url": "https://educationhub.blog.gov.uk/2024/03/15/how-to-claim-15-hours-free-childcare-code/",
    "title": "How to claim 15 hours free childcare including how to get your code",
    "authors": [
        "mediaofficer"
    ],
    "categories": [
        "Childcare"
    ],
    "pub_date": "2024-03-15T04:30:53+00:00",
    "content": [
        {
            "text": "We’re making the biggest investment by a UK government into childcare in history, doubling the amount we expect to spend over the next few years from around £4 billion to around £8 billion each year. "
        },
        {
            "heading": 3,
            "text": "When can I apply? "
        },
        {
            "text": "Applications are open until 31 March for eligible working parents of 2-year-olds to receive 15 hours free childcare starting from April 2024. "
        },
        {
            "text": "From 1 April, eligible working parents whose children will be 2 or older by the 31 August, can apply to receive 15 hours childcare starting from September 2024.  "
        },
        {
            "text": "And from 12 May, eligible working parents whose children will be aged between 9- and 23-months old on 31st August, can apply to receive 15 hours childcare starting from September 2024. "
        },
        {
            "text": "It’s important to remember that codes need to be renewed every three months, so parents applying close to 12 May will need to renew their code prior to the offer starting in September. "
        },
        {
            "heading": 3,
            "text": "How do I apply?  "
        },
        {
            "text": "You apply online here on  Gov.uk once you have checked our eligibility criteria. "
        },
        {
            "text": "You’ll need to make sure you have the following information to hand before starting the application: "
        },
        {
            "text": "You may find out if you’re eligible straight away, but it can take up to 7 days. "
        },
        {
            "text": "Once your application has been approved, you’ll get a code to give to your childcare provider. "
        },
        {
            "text": "Eligible parents are also able to access Tax-Free Childcare through the same application system. You can apply for Tax-Free Childcare at any time. However, you don't need to apply for Tax-Free Childcare to be eligible to apply for the 15 hours childcare scheme.  "
        },
        {
            "heading": 3,
            "text": "What happens once I receive my code? "
        },
        {
            "text": "Once you receive your code, you’ll need to take it to your childcare provider, along with your National Insurance number and your child’s date of birth. "
        },
        {
            "text": "Your childcare provider will process the code to provide your place. "
        },
        {
            "text": "Places will be available for September in every area of the country, but a significant minority of settings hold waiting lists of over six months. If you have a preferred nursery for September, you should reach out now to secure a place for your child ahead of receiving your code. "
        },
        {
            "text": "Your local authority can provide support for finding a government-funded place in your area. "
        },
        {
            "heading": 3,
            "text": "What if I’m already registered for Tax Free Childcare? "
        },
        {
            "text": "Parents must reconfirm that they are still eligible for Tax-Free Childcare every 3 months. "
        },
        {
            "text": "Parents who are already claiming Tax-Free Childcare and need to reconfirm their eligibility between 1 April and 12 May will be automatically issued a code in the post from HMRC soon after the 12 May.  "
        },
        {
            "text": "This is to ensure every parent can give their code to their provider in good time. This code will be valid to apply for 15 hours of government-funded childcare from September.  "
        },
        {
            "heading": 3,
            "text": "If I receive a code in a letter from HMRC, does this make my code on my Childcare Account invalid? "
        },
        {
            "text": "No. Both codes will be valid.  "
        },
        {
            "heading": 3,
            "text": "Do I need to wait for my reconfirmation window to add another child to my account? "
        },
        {
            "text": "A parent who is already using the childcare service for another child can add a new child to their account at any time. "
        },
        {
            "text": "Your reconfirmation cycle for your current Tax-Free Childcare will not affect this. "
        },
        {
            "heading": 3,
            "text": "How are you making sure there will be enough childcare places for eligible parents? "
        },
        {
            "text": "Parents that have a preferred place for September should reach out now to their local provider to secure a physical place for their child ahead of time. "
        },
        {
            "text": "To make sure there are enough places available, we’re investing over £400 million in 2024-25 to increase the hourly rates paid to local authorities. "
        },
        {
            "text": "The Institute for Fiscal Studies has independently reported that the average funding rates for two-year-olds and under 2s paid by government from April 2024 are projected to be substantially higher than the market rate paid by parents last year, and we have committed to further increases to provider rates for the next two years. "
        },
        {
            "text": "We have also committed to increasing hourly funding rates over the next two years by an estimated £500 million, to make sure providers can increase places at each phase of the rollout.   "
        }
    ]
}