{
    "url": "https://valuationoffice.blog.gov.uk/2024/03/15/how-we-value-pubs-2/",
    "title": "How we value: pubs",
    "authors": [
        "Paul May - National Valuation Lead"
    ],
    "categories": [
        "How We Value",
        "Valuation"
    ],
    "pub_date": "2024-03-15T13:26:54+00:00",
    "content": [
        {
            "text": "The Valuation Office Agency (VOA) is responsible for valuing all non-domestic properties in England and Wales, including pubs. With over 46,000 registered in England and Wales alone, pubs generate billions in revenue for the economy while serving as one of the nation's most popular social venues."
        },
        {
            "text": "Our valuation method "
        },
        {
            "text": "We value pubs using the rental comparison basis. This valuation method calculates a property's rateable value based on the annual rent it could reasonably be expected to generate at a certain date (this is known as the Antecedent Value Date, or AVD)."
        },
        {
            "text": "The best evidence we look for is rents being agreed around the AVD."
        },
        {
            "text": "However, the rent paid on pubs is often not a true reflection of the overall value of the property. This is because rental contracts often include conditions, such as a requirement for the tenant to buy from a specific brewery. Contracts may also include extras, such as living accommodation for the tenant."
        },
        {
            "text": "There is a direct link between the trading potential of a pub and the rent being paid. This is because a prospective tenant would be aware of the trading potential before signing a lease, which would influence how much they would be willing to pay in rent."
        },
        {
            "text": "Fair Maintainable Trade (FMT) "
        },
        {
            "text": "We work out a pub’s trading potential by looking at what it could realistically generate if it was run by a reasonably efficient operator. Its potential turnover, also known as Fair Maintainable Trade (FMT), is generally determined by considering income streams from drinks (alcoholic and non-alcoholic), food and other areas of trade such as accommodation."
        },
        {
            "text": "In most cases, FMT reflects the actual trade of the pub. However, we will always take the individual facts about the property into account. For example, a pub could be turning over more money than a comparable pub in the same area. This may be because of its business model, or because it is run by a celebrity, rather than the property itself."
        },
        {
            "text": "Assessing a pub’s performance "
        },
        {
            "text": "Where a pub is generating more profit than reasonably expected, it would be classed as over-trading. We take over and under-trading into account when calculating FMT to make sure we value the property - not the business model. On the other hand, a tenant may choose to only open on certain days and may be under trading."
        },
        {
            "text": "The specifics of the pub, like its design and location, also factor in. A modern pub in a prime spot with more facilities will achieve better trade than one that is older and poorly located."
        },
        {
            "text": "So, pubs are valued by determining the annual rent it could realistically generate. As rental contracts often come with extra conditions, we also look at the turnover it could achieve if managed by an efficient operator. The greater a pub’s trading potential, the higher its potential for a greater rent, and consequently, the higher its rateable value will be."
        },
        {
            "text": "Agreeing our approach with industry experts "
        },
        {
            "text": "Our methodology for assessing pubs has been established in collaboration with industry experts from the British Beer & Pub Association, UK Hospitality, British Institute of Innkeeping and the Federation of Licensed Victuallers Associations."
        },
        {
            "text": "We outline the approach in our 2023 Approved Guide: Valuation of Public Houses. This serves as a recognised standard across the sector."
        }
    ]
}