{
    "url": "https://moderncivilservice.blog.gov.uk/2024/03/15/meet-the-modern-civil-service-sarah-munby/",
    "title": "Meet the Modern Civil Service: Sarah Munby",
    "authors": [
        "Government Reform"
    ],
    "categories": [
        "A Modern Civil Service",
        "Digital and data",
        "Government Reform",
        "Innovation",
        "Interview",
        "Modernisation and Reform",
        "Proud Civil Servant"
    ],
    "pub_date": "2024-03-15T16:18:32+00:00",
    "content": [
        {
            "text": "Hello! Welcome to another interview in the Meet the Modern Civil Service series. The aim of this series is to showcase the people in the civil service who are driving innovation, whether that be through being a learning champion, embracing digital and data into their daily working or helping develop new hubs across the UK."
        },
        {
            "text": "Deepa Thomas-Sutcliffe from the Modernisation and Reform Unit spoke with Sarah Munby, Permanent Secretary at the Department for Science, Innovation and Technology (DSIT), about what A Modern Civil Service means to her, as well as how she sees reform in action and how all civil servants and the public will benefit from change."
        },
        {
            "heading": 2,
            "text": "What does A Modern Civil Service mean to you? "
        },
        {
            "text": "I work in the Department for Science, Innovation and Technology (DSIT), so you would expect me to have a strong view on this. What “modern” means changes all the time; I remember when using email seemed like an incredibly modern system. To me, I think building a modern civil service is really about building a civil service that can adapt to what's going to be an ever-present and probably ever-increasing pace of change. We need the skills, the tools, the permission to adapt and grow and change to meet all of the challenges that the world continues to throw at us. "
        },
        {
            "text": "Changing and adapting, but also really respecting the things that are in our civil service heritage and our history that make us. I think our values are ever constant, and our mission is ever constant. So all of us need those constants to really grip onto. And I think one of the wonderful things about the civil service is it actually offers us that kind of foundation of the values that we live by and the mission that we hold to, regardless of the innovations we pursue."
        },
        {
            "heading": 2,
            "text": "The Role of Innovation in the Civil Service"
        },
        {
            "text": "I think it's really important to start by saying that I think we already have amazing innovation in the civil service and that's innovation of all different kinds. We've done incredible things at a really remarkable pace. In my time in the civil service, I've seen us introduce things like the furlough scheme during COVID, brand new energy price support schemes, and completely new legal frameworks after leaving the EU. Or, looking right across HMG, the work on a single login for gov.uk, or the work Natural England have done to restore peatlands by identifying drainage channels for maintenance. "
        },
        {
            "text": "I think there's a huge amount to build on, but it's definitely inconsistent. Sometimes, when we have a crisis to get innovation going, we don't always manage to make that way of working, or perhaps the calmer version of that way of working, part of our everyday life right across our operation."
        },
        {
            "text": "So there's something about taking some of that brilliance and making sure we can do it more consistently.  And then the other thing that for me would really show that we had become a truly innovative organisation is I don't think we're as good as we should be at scaling up new ideas."
        },
        {
            "text": "We're a really big organisation. We are jam-packed with talent and with brilliant thoughts about how things could be improved and made better; but we don't always capture those ideas and turn them into delivery. Even when we do that, perhaps in one department or in one team, we're not always good at spotting that it has happened and then scaling it up to the bigger organisation and then to the civil service as a whole. "
        },
        {
            "heading": 2,
            "text": "Skills needed for Innovation"
        },
        {
            "text": "I think when we talk about innovation skills, there's a great temptation to think that the skill we really need to help people with is the skill of having good ideas. And of course that's true, and there are some really practical tools you can use to help you have good ideas."
        },
        {
            "text": "But to my mind, when we think about the skills that we need to build across the civil service, I wouldn't put quite so much emphasis on helping with getting people to have ideas. For me, it's about building the skills that help us scale up those ideas and deliver them. So it's a set of skills about change management and implementation so that we can take a good idea and turn it into a real change in our overall system. And it's also about skills in how we monitor and evaluate."
        },
        {
            "text": "When you've got lots of good ideas, the real question is: which ideas made the biggest difference? Which ones should we really invest in and push forward because they've made a big change happen? We can only do that If we're able to understand and measure the change that we're seeing. So for me, it would be helping us with implementation and change management skills that we need to be brilliant at in the civil service."
        },
        {
            "heading": 2,
            "text": "Fostering Innovation in Teams"
        },
        {
            "text": "The things I've said about change management and monitoring and evaluation definitely apply to leaders as well. There's something particular for leaders about how you create permission and safety to innovate and build a culture around innovation. If there is one thing that I try to ask myself and my teams to do, it's to look at the environment you create around taking risks."
        },
        {
            "text": "If we can collectively do more to think about digging into things that go less well in order to learn from them and to really distil “why did it happen?”, then we can start seeing failures as a completely important and vital element of the innovation journey."
        },
        {
            "text": "Most really successful entrepreneurs have had at least one failed business in their past. I think our leaders have a huge role to play in creating a culture where we can be honest about failures and examine those failures, but with a spirit of learning and developing the idea and seeing what we can do next time, rather than with a spirit of blame or criticism."
        },
        {
            "text": "I think it is difficult sometimes in the civil service to create an environment that fosters risk taking because the truth is we do a lot of things that really matter. And of course, there are many aspects of our work where taking risk is absolutely not the right answer. Our tolerance for risk isn't that high because we're providing services that really matter to the general public. But we can (and arguable must) create environments where we can experiment, sometimes you need to create a sandbox so that you can do a bit of innovation and learn from it."
        },
        {
            "text": "Of course we should be risk averse where we need to be risk averse, but we should also be innovative and even risk seeking where we can be and where it can lead us to better outcomes. That's not an easy trick to pull off, but I think that's what the public is asking of us as public servants."
        },
        {
            "heading": 2,
            "text": "The Future of Innovation in Civil Service"
        },
        {
            "text": "We got together a Cross Government Innovation Working Group of people from different departments right across government who were really interested in innovation in the civil service. My takeaway was really simple: there is so much to celebrate. "
        },
        {
            "text": "The act of bringing the community together across government so that we can share some of the things we're doing and be inspired by each other feels really valuable even before you start making a plan off the back of that. "
        },
        {
            "text": "We've got Innovation 2024 coming up, which is the forum hosted by the Global Government Forum and the Cabinet Office. It runs on 19-20 March and we might use that as an opportunity to announce some of the next steps, with the focus of thinking about how to take some of the great things that are happening and support people to grow and evolve them and scale them up."
        },
        {
            "text": "It's okay that innovation sometimes feels quite hard — that's true in most organisations. It's definitely not unique to the Civil Service and it's especially true in complex organisations. We have to be able to handle many different kinds of issues and bring together solutions to really challenging problems. Trying to make big, complex systems change just isn't always very easy, and I don't think we should beat ourselves up about it. There's lots of potential for us to collectively do better."
        },
        {
            "text": "I don't think there's any magical switch that will suddenly make innovation feel really simple and straightforward. I think we'll have to keep working at it together to build the muscles, the techniques, the experience, and the leadership to make this easier over time."
        }
    ]
}