{
    "url": "https://deframedia.blog.gov.uk/2024/03/15/next-phase-of-tb-eradication-strategy/",
    "title": "Next phase of TB eradication strategy",
    "authors": [
        "Defra Press Office"
    ],
    "categories": [
        "Protect"
    ],
    "pub_date": "2024-03-15T12:25:38+00:00",
    "content": [
        {
            "text": "The Government has published a consultation on the next phase of its TB eradication strategy, which has been covered in the Guardian, iNews and on BBC R4 Farming Today."
        },
        {
            "text": "Bovine tuberculosis is one of the most difficult and intractable animal health challenges that England faces today, causing devastation for farming and rural communities and leading to tens of thousands of cattle being culled each year."
        },
        {
            "text": "Our strategy to eradicate bovine TB in England is turning the tide on this disease with the lowest number of new bTB breakdowns in nearly twenty years. The latest proposals will ensure this downward trend continues, and all culling decisions taken under the new targeted approach will continue to be led by the very best scientific and epidemiological evidence."
        },
        {
            "text": "We are proposing that culling should be available in the High Risk Area and Edge Area of England, in areas where there are high levels of infection in cattle, and where evidence suggests badgers are part of the problem in the spread of disease to these herds."
        },
        {
            "text": "We have always been clear that culling would remain an option where epidemiological assessment indicates that it is needed. This consultation sets out an evolution of our ongoing disease control. We will still cull badgers where there is evidence to do so, and we will move to protect those in areas where we’ve stopped their current role in spreading disease."
        },
        {
            "text": "We do not aim to remove all badgers in the culls and that is not the aim of this new policy, rather we want to lower the badger population to reduce infection. Measures will remain in place to prevent local extinction of the badger population."
        },
        {
            "text": "Culling would continue until the disease situation inside the cluster has been deemed to have improved sufficiently, such that it is no longer deemed a cluster, or the prevalence of infection in badgers has been reduced substantially. Badger vaccination would then take place to maintain disease control benefits."
        }
    ]
}