{
    "url": "https://defraenvironment.blog.gov.uk/2024/03/15/over-25-million-to-preserve-wildlife-rich-habitats-in-england/",
    "title": "Over £25 million to preserve wildlife-rich habitats in England",
    "authors": [
        "Zelda Baveystock"
    ],
    "categories": [
        "Environmental Improvement Plan",
        "Local Nature Recovery Strategies",
        "Protected Landscapes"
    ],
    "pub_date": "2024-03-15T10:14:07+00:00",
    "content": [
        {
            "text": "Today we announced the 20 successful projects that will receive funding through the £25 million Species Survival Fund. "
        },
        {
            "text": "The Species Survival Fund is a partnership between Defra and the National Lottery Heritage Fund. It was launched to help halt and reverse the decline in species abundance, by preserving vital habitats. "
        },
        {
            "text": "The successful projects will each receive grants ranging from £250,000 to £3 million. "
        },
        {
            "text": "The new funding will support projects that tackle habitat loss, safeguard our fragile ecosystems, and create and restore nature-rich landscapes full of wildlife-friendly habitats. This will support the delivery of our Environmental Improvement Plan commitments including achieving our target to protect 30% of land for nature by 2030. "
        },
        {
            "text": "Together, the 20 projects will help to create and restore over 7,000 hectares of critical habitat. That's an area the size of Leicester safeguarded for biodiversity, across a wide range of habitats on land and in rivers. Communities, charities, farmers and local authorities will come together to create jobs and to restore nature.   "
        },
        {
            "text": "Here are a few examples of successful projects: "
        },
        {
            "text": "Species Survival in Hertfordshire’s Chalk Rivers "
        },
        {
            "text": "Hertfordshire and Middlesex Wildlife Trust – awarded £1,723,840 "
        },
        {
            "text": "This project will restore chalk river habitats across 11.15km of the River Lea Catchment. Chalk rivers are a type of lowland river, with clear waters and diverse plant life. They can support a range of invertebrates and fish, from trout and salmon to white-clawed crayfish and mayflies. "
        },
        {
            "text": "The project will improve the area’s ability to adapt to climate change by providing natural flood management measures, and it will improve habitat for over 109 different species. "
        },
        {
            "text": "There will be lots of opportunities for volunteering, including undertaking wildlife surveying and work to directly restore habitats. "
        },
        {
            "text": "Newcastle’s Nature Networks "
        },
        {
            "text": "Urban Green Newcastle – awarded £701,417 "
        },
        {
            "text": "This project will improve pollinator pathways across Newcastle upon Tyne by delivering habitat improvements in 33 public parks, 4 nature reserves and other public green spaces. "
        },
        {
            "text": "Working in partnership with the Natural History Society of Northumbria, Newcastle City Council, Northumbria University, Ouseburn Farm, Ouseburn Trust and Scotswood Garden, the project progresses the vision for a greener city, working together to improve nature, reduce the impact of climate change and develop skills. By creating more species rich meadows, improving woodlands and lowland heathlands, key priority species including bees, dingy skipper, small heath and wall butterflies will be better able to thrive.  "
        },
        {
            "text": "Northwest and Southwest Rainforest Restoration "
        },
        {
            "text": "The Woodland Trust – awarded £2,696,680 "
        },
        {
            "text": "This partnership project will manage and restore around 580 hectares (across 27 sites) of ancient woodland and temperate rainforest habitats across the northwest and southwest.  "
        },
        {
            "text": "Temperate rainforests are incredibly rare. They support lichen and fungi, and animals like the wood warbler, pied flycatcher and stoat.  "
        },
        {
            "text": "The project partners include Plantlife, Cumbria Wildlife Trust, Cumbria Woodlands, Rusland Horizons and Cumbria Connect. There will opportunities for local landowners and communities to get involved through training, surveying and demonstration events, plus small grants to private landowners for undertaking restoration work. "
        },
        {
            "text": "See the National Lottery Heritage Fund’s website for information about all the projects. "
        },
        {
            "text": "The Species Survival Fund builds upon the success of similar initiatives like the Green Recovery Challenge Fund. It will also help successful projects to get in a good position to apply for long-term, large-scale habitat restoration through schemes such as Landscape Recovery. "
        },
        {
            "text": "To receive an email notification whenever we publish a new post, please subscribe to the blog. "
        }
    ]
}