{
    "url": "https://environmentagency.blog.gov.uk/2024/03/15/protecting-our-freshwater-fish-species-why-the-close-season-is-so-important/",
    "title": "Protecting our freshwater fish species – why the close season is so important",
    "authors": [
        "Environment Agency"
    ],
    "categories": [
        "Environment Agency",
        "Fisheries and biodiversity"
    ],
    "pub_date": "2024-03-15T10:40:19+00:00",
    "content": [
        {
            "text": "Between March and June every year, many coarse (freshwater) fish will be preparing to spawn (breed and lay eggs), spawning, or recovering from spawning. This can be both stressful and exhausting and if they are disturbed, they may well decide to stop altogether. This sadly means they’ve lost their chance, not only this time, but for the whole year.  "
        },
        {
            "text": "To help protect our precious fish populations, from 15 March to 15 June inclusive, the annual close season for coarse fishing (on rivers and steams) reduces disturbances to coarse fish and protects vulnerable stocks during their peak spawning period.    "
        },
        {
            "text": "During this time, anglers are not permitted to fish for coarse fish in rivers, streams and drains across England, and could face a substantial fine if caught. Anyone with information about illegal fishing activities can contact the Environment Agency incident hotline 24/7 on 0800 807060. For our fisheries enforcement officers, this is undoubtedly a really important time.   "
        },
        {
            "text": "Tristan Davis is a Fisheries Enforcement Officer in East Anglia for the Environment Agency. He entered the angling world at the ripe age of six years old, following inspiration from his Mum, who was a keen pike and carp angler in the 80s and 90s, holding records in the sport. Many years later, he now plays a vital role patrolling and protecting the very rivers and watercourses that he grew up fishing on.  "
        },
        {
            "text": "“Growing up in a fishing household, the dream of working in fisheries was always in the forefront of my mind. It took me some years, but now I can honestly say, I have my dream job with the Environment Agency. My journey into this career started in lockdown March 2020 when I needed something to occupy my time as I could not fish, and I could not work. I decided to take a Diploma Certificate course in fisheries management, with the Institute of Fisheries Management, and a view to push on with my desire to work in the field.  "
        },
        {
            "text": "“I was also, at this time, part of the Angling Trust Volunteer Baillif Service (VBS), a group of volunteers that give up their own time to help the EA protect our waterways, by being eyes and ears on the ground and spotting illegal activity. Through my work with the VBS, I got to know some of the EA’s Fisheries Enforcement Officers who invited me out on joint patrols. Fast forward to mid-2023 and I arrived at the Brampton office, for my first shift working towards being a fully-fledged officer. "
        },
        {
            "text": "“This will be my first close season as an officer, and I look forward to finally being one of the officers protecting our fish stocks and waterways. As many of you will know, the close season is still vitally important to the spawning and recovery of many of our river fish species, giving them the best chance to access the right habitat and breed successfully. As the temperatures slowly climb, the different species will start to look to reproduce, repopulating our waters for years to come. The pike tends to spawn in shallow, weedy water when the water temperature reaches around 9°C, being one of the first coarse fish species to spawn. Perch, dace, and grayling are also early spawners, with other species like barbel and bream spawning later in the close season, as the temperature continues to climb.”  "
        },
        {
            "text": "Areas where fish spawn can be susceptible to damage, with eggs nestling directly in weeds, gravel, tree roots or even in your keepnet. Young fish, known as fry, that emerge from the eggs can be sensitive to silt disturbance, low oxygen and trampling.  "
        },
        {
            "text": "Protecting spawning fish is so important there is even a separate legislation under section 2 of the Salmon and Freshwater fisheries act that makes it an offence to disturb spawning fish, or the areas they use. People are however still allowed to fish on most stillwaters and canals, depending on fishery owner agreement (the close season covers a few canals and stillwaters – see here for details). Anglers may also fish for salmon and trout in many rivers, subject to relevant byelaws and holding the necessary licence.  "
        },
        {
            "text": "Throughout the close season, Environment Agency officers and Angling Trust Volunteer Bailiffs patrol the rivers to ensure anglers respect the no fishing period and, with fewer eyes and ears on the riverbank, to detect any offences that may otherwise go undetected – all part of our work to protect fish populations and fishing.  "
        },
        {
            "text": "“Unfortunately, there are the few who either choose to ignore the close season, or genuinely do not know it is in place. To help tackle the issue of illegal fishing, we conduct many hours of patrols. This is not just 9 to 5. We are often out early mornings and late at night, in all weathers using cutting edge technology to help find offenders.  "
        },
        {
            "text": "“This year I plan to use the Environment Agency’s regional drone team, with their thermal imaging and night vision capability, to help cover the vast stretches of water. I also look forward to working closely with POLICE Rural Crime Action Team (RCAT), along with the Angling Trust in Operation CLAMPDOWN, which is celebrating its 12th year in 2024. CLAMPDOWN joint operations have proven to be invaluable in helping protect our fisheries, year after year. "
        },
        {
            "text": "“The fine for fishing in the close season is much the same as fishing with no licence. We have now started to put up signs, including in multiple languages, informing people of the closed season ahead. We’ve also been taking the time to talk to the anglers on the rivers to remind them they can still fish many of our still waters during the closed season so there really is no need to disturb our river fish during the closed season.” "
        },
        {
            "text": "You too can help us ensure that our fish populations are surviving and thriving at all life stages by spreading the message. We actively encourage anglers and the general public to help us, by calling our hotline 0800 807060 if they see something they do not think is right. Officers like Tristan will then receive the reports, to assess and attend. If you know anyone that’s just started fishing for the first time, we ask that you not only remind them of the close season dates, but also explain why we enforce it. "
        }
    ]
}