{
    "url": "https://governmentscienceandengineering.blog.gov.uk/2024/03/15/time-for-action-as-npl-outreach-does-british-science-week/",
    "title": "Time for Action as NPL Outreach does British Science Week",
    "authors": [
        "gseprofession"
    ],
    "categories": [
        "Blog Series",
        "Guest Blog",
        "Outreach"
    ],
    "pub_date": "2024-03-15T10:38:37+00:00",
    "content": [
        {
            "heading": 3,
            "text": "Andrew Hanson and Louise Gibbons, NPL"
        },
        {
            "text": "The National Physical Laboratory (NPL) is the UK's National Metrology Institute, developing and maintaining the national primary measurement standards, as well as collaborating with international partners to maintain a global system of measurement. As a public sector research establishment, NPL delivers extraordinary impact by providing the measurement capability that underpins the UK's prosperity and quality of life."
        },
        {
            "text": "The Outreach team at NPL punches well above its weight. Utilising the enthusiasm of many of its staff members, the NPL outreach team annually manages around 800 NPL volunteers to interact with different audiences through hundreds of activities."
        },
        {
            "text": "Since 2015, each year on average, an audience of over comprising students of all ages, from primary school to postdocs, their educators, and the general public, have met with people at NPL and learnt about science, technology, engineering and maths. British Science Week is a particularly busy time for engagement, with at least 40 activities linked to the 10-day nationwide campaign."
        },
        {
            "text": "The theme of British Science Week this year is ‘Time’, so NPL is exploding with excitement as we are the UK home of timekeeping. We know that many people still think that time comes from Greenwich, so we work closely with the Royal Museum Greenwich to help inform the public about the different links and roles both organisations play in relation to timekeeping in the UK. In one particular initiative, we put one of our clocks on a boat and sent it down the Thames to Greenwich!"
        },
        {
            "text": "Watch the journey here."
        },
        {
            "text": "In 1955, NPL created the first practical atomic clock to allow the calibration of existing timekeeping. Today, we are pioneering next generation ‘optical’ clocks with visible laser light to measure how gravity affects the passage of time, just as Einstein predicted."
        },
        {
            "text": "So, how can we use the theme of ‘Time’ to help deliver on our primary goal of inspiring the next generation to consider STEM as a career? During our workshops, we run experiments around time involving pendulums, and we have also used metal strips to find resonant frequencies. We experimentally test reaction times (utilising many hundreds of children) with the hypothesis that dominant hands have a faster reaction time than non-dominant hands."
        },
        {
            "text": "Although the outreach team is in Teddington, south-west London, we do many visits across the UK. For British Science Week, our in-person activity will take us all the way to Glasgow (where we plan to run activities at the Glasgow Science Centre) to London."
        },
        {
            "text": "Although we try and run most of our school activities in-person, we will also be running our reaction-time experiment as an online primary-school activity later in the year on World Metrology Day (20 May) to ensure as many people as possible can give it a try. Please find details here if you would like to encourage your local school to participate. Such primary-school online events have previously drawn in audiences of around 20,000 participants."
        },
        {
            "text": "Finally, why not come to see us in action at the NPL Open Day on 24 May 2024? More details will be provided on our website shortly."
        },
        {
            "text": "About the authors: "
        },
        {
            "text": "Andrew Hanson MBE and Louise Gibbons co-ordinate and deliver NPL’s Outreach work. They are delighted that NPL takes outreach so seriously and are thrilled that our diverse workforce can enable role models different to those most members of the public expect scientists/engineers to look like, helping us effectively work with the Social Mobility Forum, The Blackett Lab Family, Young Enterprise, STEM Ambassadors Programme, The STEM Hub and In2Science, to name a few of our many collaborators."
        }
    ]
}