{
    "url": "https://traderemedies.blog.gov.uk/2024/06/19/calling-all-trailblazers-join-the-tra-and-champion-fair-trade/",
    "title": "Calling all TRAilblazers : Join the TRA and Champion Fair Trade",
    "authors": [
        "TRA Communications"
    ],
    "categories": [
        "HR",
        "Investigations",
        "People",
        "Recruitment"
    ],
    "pub_date": "2024-06-19T16:32:42+01:00",
    "content": [
        {
            "text": "Are you passionate about ensuring fair trade and protecting UK industries? Do you want to work on issues that have a national and international significance? The UK Trade Remedies Authority is looking for dynamic individuals to join our diverse team of investigators. This is your chance to be part of an exciting journey that helps shape the future of international trade. "
        },
        {
            "heading": 3,
            "text": "The Role "
        },
        {
            "text": "As an investigator at the TRA, you’ll play a key role in ensuring fair trade practices by assessing claims of unfair trade activities. You will collaborate with a diverse team of fellow investigators, lawyers, policy advisors, accountants and analysts, and your work will result in clear recommendations to the Secretary of State on trade remedies, directly impacting the UK’s economic integrity.  "
        },
        {
            "text": "You will gain hands-on experience in TRA casework which can involve Dumping investigations, Subsidy investigations, Safeguard investigations, reviews of connected measures and much more. "
        },
        {
            "text": "This role offers a chance to have a meaningful impact on UK industries, professional growth across multiple disciplines and a supportive, inclusive environment that values diverse perspectives and skills. Join us to contribute to shaping fair trade practices and embark on a rewarding career.  "
        },
        {
            "text": "For further information on the investigations the TRA has conducted, and the externally facing reports we produce, check out our Public File.  "
        },
        {
            "heading": 3,
            "text": "Our training offer "
        },
        {
            "text": "During your time at the TRA, you will have opportunities advance your skills and knowledge through a structured training programme. The programme will be spread over the 2 years of the scheme and is designed to: "
        },
        {
            "text": "Alongside the formal training offer, you will shadow experienced investigators and contribute to the delivery of high-quality outputs and assisting major investigations. This could involve drafting reports for investigations, analysing data and documents, building stakeholder relationships, and assisting with project management. "
        },
        {
            "heading": 3,
            "text": "Case Studies"
        },
        {
            "text": "We asked some of our HEO and SEO Investigators to share their experiences of the learner journey and their time at the TRA so far:"
        },
        {
            "heading": 3,
            "text": "Thinking of applying? "
        },
        {
            "text": "Did you know that a Hewlett Packard internal report found that men apply for jobs when they meet an average of 60 per cent of the job requirements? Women and people from diverse backgrounds tend to only apply when they check every box.  "
        },
        {
            "text": "If you are interested in the role and think you meet some of the criteria, but do not necessarily meet every single point described, we would still love to hear from you. You can find out more about the role at Civil Service Jobs or come along to our virtual drop-in session to ask any questions you may have.  "
        },
        {
            "text": "As part of the application process we ask you to complete an online skills assessment, and a statement of suitability alongside your CV setting out your employment history and relevant experience. If successful, you will be invited to attend an interview which will include a technical assessment.  "
        },
        {
            "heading": 4,
            "text": "The deadline is the 14th of July 2024, with the intention of onboarding in autumn 2024.  "
        },
        {
            "text": "Applicants must be based and eligible to work in the UK, unfortunately we are not able to sponsor visas.  "
        },
        {
            "heading": 3,
            "text": "Have questions about the role?"
        },
        {
            "text": "One of our Lead Investigators, Jonathon Farrell will be delighted to answer any questions you may have on a 1-2-1 basis. We are hosting two virtual drop-in sessions which you can join on the dates listed below:"
        },
        {
            "text": "Click to join the Wednesday session here."
        },
        {
            "text": "Click to join the Monday session here."
        },
        {
            "heading": 3,
            "text": "To read the full job description and apply please head to Civil Service Jobs here."
        },
        {
            "text": " "
        }
    ]
}