{
    "url": "https://ruralpayments.blog.gov.uk/2024/06/19/get-funding-to-improve-animal-health-and-welfare/",
    "title": "Get funding to improve animal health and welfare",
    "authors": [
        "RPA Editor"
    ],
    "categories": [
        "Grants"
    ],
    "pub_date": "2024-06-19T14:28:07+01:00",
    "content": [
        {
            "text": "New support to tackle endemic diseases for keepers of beef cattle, pigs and sheep is now available as part of the Animal Health and Welfare Pathway. This support is not yet available to keepers of dairy cattle. The availability will be communicated to dairy keepers in due course. "
        },
        {
            "text": "This support will go towards more in-depth diagnostic testing for Porcine Reproductive and Respiratory Syndrome (PRRS) in pigs; identifying persistently infected cattle on farms with Bovine Viral Diarrhoea (BVD). In the case of sheep, the farmer will, in consultation with their vet, choose from a range of health improvement packages. These will target the syndrome that is most prevalent and provides most benefit to treat in each flock.  "
        },
        {
            "text": "The payment rates for this support vary by species: "
        },
        {
            "text": "As well as testing, keepers will also receive advice on the results of the tests.  This includes how to remove disease from their farm and improve their biosecurity. "
        },
        {
            "text": "In response to feedback from farmers and vets we have changed the testing requirements for the Animal Health and Welfare Review for pigs from blood testing to oral fluid testing. This is to benefit the welfare of the pigs being tested and to make the process easier for vets. This testing is less expensive and therefore we have reduced the payment rate accordingly. "
        },
        {
            "text": "Full details of what can be claimed and how to apply can be found on GOV.UK:"
        },
        {
            "text": "Funding to improve animal health and welfare: guidance for farmers and vets"
        },
        {
            "text": "Get funding to improve animal health and welfare"
        }
    ]
}