{
    "url": "https://deframedia.blog.gov.uk/2021/11/06/storm-overflows-evidence-report/",
    "title": "Storm overflows evidence report",
    "authors": [
        "Defra Press Office"
    ],
    "categories": [
        "Uncategorized"
    ],
    "pub_date": "2021-11-06T15:49:49+00:00",
    "content": [
        {
            "text": "This week we published a report commissioned by the Storm Overflows Taskforce - made up of the Consumer Council for Water (CCW), Blueprint for Water, Water UK, the Environment Agency, Ofwat, and Defra – which outlines the evidence, costs and benefits of reducing the occurrence of storm overflow spills. This is the first assessment of its kind ever conducted."
        },
        {
            "text": "The research was carried out by the engineering services company Stantec and presents a detailed overview of potential approaches that will act as an important evidence base for government action."
        },
        {
            "text": "It estimates that the complete elimination of sewage discharges through storm overflows in England is likely to cost between approximately £350 billion and £600 billion. This would mean the complete separation of wastewater and stormwater systems – which are currently combined into one system."
        },
        {
            "text": "Keeping storm overflows but limiting their operation so that on a year with average rainfall overflows do not discharge to inland waters is estimated to cost between £160 billion and £280 billion."
        },
        {
            "text": "The report covers a wide range of policies and scenarios – from £5 billion as the low estimate for limiting discharges to rivers to 40 per year, to £600 billion as the high estimate for completely replumbing England’s sewers."
        },
        {
            "text": "The Taskforce will use this research to develop the best mix of policy solutions, informing the government plan on storm overflows to be published in 2022."
        },
        {
            "text": "Environment Minister Rebecca Pow said:"
        },
        {
            "text": "This Government also announced that the Environment Bill will be further strengthened with an amendment to ensure water companies secure a progressive reduction in the adverse impacts of discharges from storm overflows. This enshrines our position in law, and follows the direction in the government draft Strategic Policy Statement for Ofwat, published earlier this year, which makes clear that water companies must reduce storm overflows as a priority."
        },
        {
            "text": "The amendment bolsters the raft of measures already being taken in the Bill, which as currently drafted will put more protections in place against water pollution than ever before."
        },
        {
            "text": " "
        }
    ]
}