{
    "url": "https://dfedigital.blog.gov.uk/2022/09/21/family-hubs/",
    "title": "Partnering with local authorities to design family hubs",
    "authors": [
        "Claire Folan, product manager for family hubs"
    ],
    "categories": [
        "multidisciplinary teams",
        "Service design",
        "User-centred design"
    ],
    "pub_date": "2022-09-21T13:26:50+01:00",
    "content": [
        {
            "text": "Family hubs allow local authorities to offer help to families, from ‘early years’ support to parenting classes, all of which can make a difference – particularly to those families going through a tough time."
        },
        {
            "text": "People can access vital services, from advice on pregnancy and infant feeding to help with benefits, domestic abuse and substance misuse."
        },
        {
            "text": "To make sure people can access and navigate the family hub services, our team needed to partner with local authorities (LAs) on the service design. This was a first for us."
        },
        {
            "text": "This post is about how it went and what we learned."
        },
        {
            "heading": 2,
            "text": "The importance of partnering with users"
        },
        {
            "text": "Researching the views, knowledge, and input from LA colleagues from the get-go was essential. They are one of our 2 main user groups."
        },
        {
            "text": "We wanted LAs to use family hubs to give out information about various groups, classes and activities that run in their local area. For example: playgroups, child development clinics, and mental health support."
        },
        {
            "text": "We wanted to share our ideas with LAs to get their feedback and to make sure the service we designed would work for them."
        },
        {
            "heading": 2,
            "text": "How the partnerships grew"
        },
        {
            "text": "LAs interested in working with us and being part of our discovery could apply to join."
        },
        {
            "text": "​​We teamed up with Salford and Tower Hamlets LAs. Early introductions to people working in strategy and planning helped us connect with lots more people working at a more operational level."
        },
        {
            "text": "We soon had a network of 40 experts working in LA ‘early help’ services involved in our discovery."
        },
        {
            "heading": 2,
            "text": "Different culture and ways of working"
        },
        {
            "text": "It took time to figure out who our main contacts would be and how we would work together."
        },
        {
            "text": "There were differences between how LAs worked and how we did."
        },
        {
            "text": "Each LA has its own way of working, its own level of formality. The way our team communicates is relaxed and collaborative. This was surprising for some of the LA staff who had not worked in digital delivery before."
        },
        {
            "text": "Because we were working with external organisations, we could not use fast messaging services like Slack or Teams. What did work though was setting up weekly meetings for 1 or 2 hours."
        },
        {
            "text": "We also had to make it clear early on, that digital teams have no say in policy decisions about bids or funding."
        },
        {
            "heading": 2,
            "text": "The value of partnerships"
        },
        {
            "text": "The input from our LA colleagues was as valuable as anyone else’s in our team, in fact they were very much a part of our multidisciplinary team."
        },
        {
            "text": "Our multidisciplinary team enjoyed co-designing with the LA experts, especially as we got to know people. There was a feeling that everyone was able to express themselves, and react honestly and informally as often as they needed to each other's ideas."
        },
        {
            "text": "LA colleagues helped us find people from their pool of service users to take part in our user research. They sensitively arranged interviews, which was extremely helpful."
        },
        {
            "text": "After 5 months of close working, we had a much better understanding of how LAs work, especially the ‘early help’ service teams. We had insight on how LAs would be able to use the family hubs."
        },
        {
            "heading": 2,
            "text": "The local authority’s perspective"
        },
        {
            "text": "Katie Kelleher, service manager for ‘Helping families’ at Salford Council, gave us this feedback."
        },
        {
            "heading": 2,
            "text": "What we would do differently next time"
        },
        {
            "text": "Relationships take time to build. We'd factor more time in for this in the future."
        },
        {
            "text": "Now it’s possible to meet in person, we’d like to have some face to face meetings, and visit the family hubs."
        },
        {
            "heading": 2,
            "text": "What’s next?"
        },
        {
            "text": "Partnering with LAs and working with them in a rich mixed multidisciplinary team has brought us closer."
        },
        {
            "text": "On a practical level we have invited representatives from LAs to our wider team's Slack channel. We share our work with them and invite them to join our meetings, as we would with any other team member."
        },
        {
            "text": "And crucially working with LAs gives us a chance to be closer to the ground, closer to our users–LAs and families alike. By joining up we will collectively continue to make sure the service is fit for purpose for everyone involved."
        }
    ]
}