{
    "url": "https://governmentscienceandengineering.blog.gov.uk/2022/09/21/inclusivity-in-the-ministry-of-defence-engineering-profession/",
    "title": "Inclusivity in the Ministry of Defence Engineering Profession",
    "authors": [
        "MOD Engineering"
    ],
    "categories": [
        "Diversity & Inclusion",
        "Guest Blog"
    ],
    "pub_date": "2022-09-21T19:43:00+01:00",
    "content": [
        {
            "text": "“Defence Engineers build bridges under enemy fire; Defence Engineers deliver some of the most complex projects there are from computer networks to warships. It requires diverse skills and diverse thinking, drawing talent from all walks of life” – Vice Admiral P Marshall CBE: Head of Profession (Engineering)"
        },
        {
            "text": "This National Inclusion Week, a new video campaign is showcasing Defence’s commitment to developing an agile, skilled and diverse engineering profession, placing diversity and inclusivity at the heart of the recruitment and retention agenda."
        },
        {
            "text": "Hear from some of our amazing MOD Engineers here."
        },
        {
            "text": "Pro-actively supporting the identification and removal of institutional / unconscious barriers to retention and advancement which disproportionately impacts across the diversity spectrum. As part of this commitment the team have worked with MOD Civilian HR to produce several products showcasing inclusivity within the MOD."
        },
        {
            "text": "With keen volunteers from engineering specialisms across the MOD, representing all aspects of inclusivity, the creative team has provided videos and imagery to support future events/social media.  Showcasing these products through National Inclusion Week will highlight the inclusive culture within the MOD Engineering Profession."
        },
        {
            "text": "For further Information on the Engineering Profession please contact: DefEngChamp-Multiuser@mod.gov.uk"
        }
    ]
}