{
    "url": "https://civilservice.blog.gov.uk/2022/09/21/national-highways-is-helping-veterans-build-a-new-future/",
    "title": "National Highways is helping veterans build a new future",
    "authors": [
        "Howard Rhoades"
    ],
    "categories": [
        "A great place to work",
        "A Modern Civil Service",
        "A Skilled Civil Service",
        "Uncategorized"
    ],
    "pub_date": "2022-09-21T12:57:32+00:00",
    "content": [
        {
            "heading": 3,
            "text": "A life-changing initiative is  giving armed forces veterans a foot on the ladder to a new career."
        },
        {
            "text": "“You’ve protected our country, now help us to keep it connected.” That’s the message from the dedicated team within National Highways to military veterans keen to start their civilian career with confidence. There are five people working in the team here in the South East, and I’m based in Guildford, Surrey, covering an area from Kings Lynn in the East to Bournemouth in the South East."
        },
        {
            "heading": 4,
            "text": "Supportive route"
        },
        {
            "text": "National Highways is the organisation which operates and maintains England’s motorways and major A-roads, and has established an ex-military recruitment programme offering a supportive route into a civilian career.           "
        },
        {
            "heading": 4,
            "text": "Civvy Street "
        },
        {
            "text": "Former service personnel can often find the transition to ‘civvy street’ challenging, with many employers failing to recognise the true value of their transferable skills and experience."
        },
        {
            "text": "Chris Ashworth, Chair of the armed forces Network, is proud to have signed the Armed Forces Covenant. He is equally passionate about their work with Buildforce, which acknowledges our responsibility to support the transition of serving, and former, members of the armed forces into new careers."
        },
        {
            "heading": 4,
            "text": "Immediate contribution"
        },
        {
            "text": "Chris said: “We believe National Highways is an excellent career for those leaving the armed forces as we recognise ex-service personnel are highly skilled, meaning they can make an immediate contribution and help us to deliver our Road Investment Strategy.”"
        },
        {
            "text": "“We’re also linked into the Civil Service Veterans Network, and can collaborate with our colleagues across government in the wider armed forces community.”"
        },
        {
            "text": "Since the programme started, on average, we support 200 armed forces personnel into the sector. In addition, we provide mentors, work placements, mental health support and 1-2-1 support to circa 500 candidates a year.  And then there’s our virtual career chats and insight days reaching even more service leavers and veterans – so it’s really so much more than jobs! "
        },
        {
            "text": "What’s next?"
        },
        {
            "text": "We’re looking to work even closer with armed forces recruitment bodies to further boost National Highways’ offering and approach and grow our links with the military to offer support and expertise.       "
        },
        {
            "text": "Veteran Amy Hargreaves was initially offered a work placement with the Kier communications team. She has since secured full-time work with the A585 team as their Safety Health & Environment and Learning & Development Coordinator."
        },
        {
            "heading": 4,
            "text": "Helping veterans"
        },
        {
            "text": "A former RAF Stewardess, Amy soon adapted her military skills. She is now, through the Kier Armed Forces Network, helping other service leavers and veterans to join the company or take up other opportunities in the construction sector through BuildForce."
        },
        {
            "text": "Amy said: “The skills you learn in the military stay with you for life, and I’d encourage anyone wondering whether a career in construction might be for them to go for it. When I left the RAF, I had a hard time finding where I fit into the civilian world and now, with the help of BuildForce, I’ve joined Kier. I feel like I have found where I fit; there really is a role for you and BuildForce will support you to find it.\""
        }
    ]
}