{
    "url": "https://socialcare.blog.gov.uk/2022/09/21/passion-perseverance-and-the-will-to-succeed/",
    "title": "Passion, perseverance and the will to succeed",
    "authors": [
        "Mark Bird",
        "Deborah Sturdy"
    ],
    "categories": [
        "Care and support",
        "Leadership",
        "Recognition",
        "Workforce"
    ],
    "pub_date": "2022-09-21T10:39:49+00:00",
    "content": [
        {
            "heading": 2,
            "text": "Not always easy but never dull"
        },
        {
            "text": "I am often asked by friends what it’s really like to work in social care. My reply can be very complicated. It’s hard work and frustrating at times, but it is also very rewarding. There are many challenges, yet they drive me to stay and make a difference."
        },
        {
            "text": "I come from a large working class family. My parents worked hard to provide things in life to survive with hand me downs, bread and butter and a big pan of stew for tea. This was family life as I knew it. Nowadays, this would be seen as not having much, but my childhood was happy and content."
        },
        {
            "text": "My parents were especially proud when a letter arrived on the doorstep saying I was going to nursing school. I was going to gain a qualification - the first one in the family to go onto further education."
        },
        {
            "text": "I walked into Royal Victoria Infirmary Newcastle Upon Tyne to begin my training like a cat who had got the cream. I felt so proud in my uniform but also a bit nervous. Was I up to it? The other students seemed so knowledgeable. Should I be here? Looking back now on a career spanning 33 years, I think “wow”, that lad from Newcastle, who barely had the qualifications to enter nursing, has been successful through sheer determination."
        },
        {
            "text": "My passion and perseverance led me to become a ward manager, matron, divisional manager and now a peer quality manager supporting others to achieve their goals, including a former policeman who patrolled one of London’s most challenging boroughs, Holloway, for eight years."
        },
        {
            "text": "Someone had obviously seen my potential, but I’ve always had imposter syndrome. Nonetheless, I have been able to achieve my goals without believing I am better or above others. I come from humble beginnings so this gives me an insight into the struggles of others I am more empathetic to provide care and support."
        },
        {
            "text": "I always tell the younger generation of career nurses if I can do it then anyone can. All you need is determination, faith in yourself, no matter what anyone says to you. If someone tries to block you or won’t support you then look for a new route, but don’t ever give up - you will be amazing in the end. Good leaders support anyone with ambition and potential. You may not consider yourself to be academic or a forward thinker, but we all have something to give."
        },
        {
            "heading": 2,
            "text": "A wonderful surprise"
        },
        {
            "text": "In August this year, I was presented with a Gold Award from Chief Nurse for Adult Social Care, Deborah Sturdy at the Brent Adult Social Care Awards. When Deborah called my name, I felt so humbled. Did she really say I'd received an award for outstanding services to social care?"
        },
        {
            "text": "The award means so much to me. I am in the latter stages of my career and to be recognised is amazing. I only wish my mum was here so I could say “Mam, look at your little lad’s achievement.”"
        },
        {
            "text": "I felt very emotional writing that sentence as it means so much to me. If it wasn’t for my mum’s encouragement, I wonder what I would be doing now. So Mum, thank you for being pushy, clever and so supportive in telling me I could do it. I’m now the cat who got the cream AND the Gold Award!"
        },
        {
            "text": "The COVID-19 pandemic has been incredibly hard on our social care colleagues and communities. In Brent, we have been supportive with the vaccination programme. The take up has been amazing to help protect those we care for."
        },
        {
            "text": "My present role in the London Borough Brent is Peer Quality Manager. I work with home managers to support, coach, educate, share ideas from Care Quality Commission’s Brent Commissioning team to address provider concerns."
        },
        {
            "text": "My role is to help improve the services they provide to Brent residents at grass roots level. The role is amazing. It makes me remember the times I needed help. I can now do the same for those who really want to make a difference in social care."
        }
    ]
}