{
    "url": "https://defradigital.blog.gov.uk/2022/09/21/recognising-the-power-of-literacy-when-designing-services/",
    "title": "Recognising the power of literacy when designing services",
    "authors": [
        "Lucy Hartley"
    ],
    "categories": [
        "Defra content design",
        "Defra digital",
        "User centred design"
    ],
    "pub_date": "2022-09-21T07:30:25+01:00",
    "content": [
        {
            "text": "In support of International Literacy Day Lucy Hartley explores why literacy is so vital to her team’s work – content design - in particular the need to follow best practice when producing content and using plain English."
        },
        {
            "text": "We recognise today that lots of factors can affect a person’s literacy - things like:"
        },
        {
            "text": "How people overcome these can determine how they develop their literacy skills and ability."
        },
        {
            "heading": 2,
            "text": "Understanding the numbers helps us understand the challenge"
        },
        {
            "text": "When you look at literacy rates around the world, they can be quite sobering. While in the UK the literacy rate is 99%, when you stop and think about that, you realise it means that one person in every hundred struggles to read and write."
        },
        {
            "text": "Even in the US, where the literacy rate is 99% too, 36 million adults can’t maintain employment because of their inability to read or write. In less-developed nations like Niger, only 19% of adults can read and write — that number drops to 11% for women."
        },
        {
            "text": "In many countries, women and girls are less likely to be taught to read and write. This in turn affects their opportunities and quality of life."
        },
        {
            "heading": 2,
            "text": "Content design and literacy – what we need to consider"
        },
        {
            "text": "Literacy is an important consideration for our content designers. Ensuring people can access and understand the information we provide is a critical part of the content designer role. If people can’t read and understand the information we’re stopping them from successfully interacting with government. We must design content for everyone."
        },
        {
            "text": "The way we provide information should be tailored to meet the user needs. This could take the form of written guidance, for example how to apply for a rod licence on GOV.UK, or a video explaining the rules on sending goods to the EU. It’s important we think about the best way to provide information. Part of this should be considering who our audience is and what needs they have."
        },
        {
            "text": "When creating, content designers will consider things like literacy rates within a particular community or audience. Where we identify an audience that may have low literacy, we may consider producing content in an easy read format."
        },
        {
            "text": "We also have standards and a style guide which we follow when creating government content. The principles we follow include using plain language and short sentences. This is to ensure content is easier to read."
        },
        {
            "text": "Content designers will also think about whether the audience for their content is likely to have English as a first language. Content designers designing content for users who have English as a second language will pay particular attention to the language they use. For example, we might avoid using phrasal verbs such as ‘break down’ when talking about something no longer working."
        },
        {
            "heading": 2,
            "text": "The content design skillset"
        },
        {
            "text": "We welcome people from all sorts of professions and career backgrounds to our content design community. The content design profession is part of the Digital, Data and Technology job family. Crucial skills in the job include being able to edit content to make it more user-centred and using evidence to make decisions about content."
        },
        {
            "text": "You don’t need to have been a content designer to join one of our content teams. As Jeni Street explained in a blog post last year, and which Emily Ch’ng reflected on more recently having made the move herself from social media to content design."
        },
        {
            "text": "Our content designers also collaborate, a lot, with others in the User Centred Design team, as Caroline Vickers and Joe Horton explained recently when they wrote about how content and interaction designers can work together to solve problems."
        },
        {
            "text": " "
        },
        {
            "heading": 2,
            "text": "What you can do to help others"
        },
        {
            "text": "Donating books is a great way to help others to improve their literacy. Believe it or not, in the UK nearly 400,000 children have never owned a book. Besides donating books to local libraries, you can have a more direct effect by donating books to:"
        },
        {
            "text": "Nowadays, even some book shops have free book racks where you can donate. You can also give directly to the Children’s Book project in the UK, which redistributes reading materials to promote book ownership for disadvantaged children."
        },
        {
            "text": "One of the best things about being a content designer is knowing that we really are helping others to access important services which can impact their lives in many positive ways. The more we understand the literacy levels of our users, the better those services will be."
        }
    ]
}