{
    "url": "https://forestrycommission.blog.gov.uk/2022/09/21/tackling-tree-pests-and-diseases-at-our-borders/",
    "title": "Tackling tree pests and diseases at our borders",
    "authors": [
        "Will Tomkins"
    ],
    "categories": [
        "Biosecurity",
        "Tree health"
    ],
    "pub_date": "2022-09-21T09:49:42+01:00",
    "content": [
        {
            "text": "Shortly after I joined the Forestry Commission in late 2020, I visited Southampton Port. It was my first experience of a busy shipping port and until then I hadn’t really imagined the scale of global trade and just how much stuff we import as a country (around 470 million tonnes of material pass through major UK ports each year)."
        },
        {
            "text": "The activity is never ending. Huge container ships are coming in constantly, offloading containers loaded with pallets carrying everything from biscuits to washing machines, and, of course, timber."
        },
        {
            "text": "Imports of wood, wood products and isolated bark are one of the main ways that tree pests and diseases can enter the UK, causing damage to our trees and natural environment, as well as losses in the timber trade. Our job is to prevent that."
        },
        {
            "text": "Some tree species are prohibited entirely from certain parts of the globe, others are allowed only if they meet certain conditions. Those conditions are checked at the borders by plant health inspectors."
        },
        {
            "heading": 3,
            "text": "What are our inspectors looking for?"
        },
        {
            "text": "Regulated timber only comes in at certain ports and needs to be declared to us by the importer. All consignments of regulated timber undergo a physical inspection."
        },
        {
            "text": "We check:"
        },
        {
            "text": "All being well the container continues its journey, but if we find a problem we have the option of ordering re-treatment, re-export, or destruction. This is done at the expense of the importer. When consignments don’t meet requirements and are sat at the docks for a couple of days for further inspection, that can incur costs for the importer too. Delays will disrupt supply chains and can add to reputational damage for importers. This helps to encourage traders to comply with the standards so that their goods progress more quickly through the ports and trade keeps moving. "
        },
        {
            "heading": 3,
            "text": "Pests and packaging"
        },
        {
            "text": "Wood packaging such as pallets and crates can provide a pathway for pests. Unlike timber, wood packaging can come in at any port and does not need to be notified to us. We undertake targeted risk-based and random checks and inspections on wood packaging carrying all types of products to ensure the wood meets the requirements. These requirements are laid down in an International Standard - the ISPM 15 standard."
        },
        {
            "text": "We had an outbreak of the non-native Asian longhorn beetle which arrived in England on wood packaging carrying imported stone from China. The outbreak has been successfully eradicated, but it was a very costly operation that required felling many hundreds of trees and years of subsequent surveillance. We also had a large consignment of fridges for a well-known supermarket chain arrive from Turkey on non-compliant wood packaging. The issues here were that there was no evidence that the wood had been treated, or even any evidence that it originated in Turkey. It could have come from anywhere in the world, exposing us to any number of different pests and diseases."
        },
        {
            "text": "As well as checks at the borders, we also do inland surveys to confirm the absence of pests in the country. Last year, Phytophthora pluvialis – a fungus-like pathogen known to affect a variety of trees - was discovered in the South West of England and has since been identified in a number of other sites. Previously it was limited to west coast America and New Zealand, so it's possible that may have arrived undetected on live plant material."
        },
        {
            "heading": 3,
            "text": "Current and emerging threats"
        },
        {
            "text": "Changes in the behaviour and range of pests mean we must adapt our regulations and our inspection regimes."
        },
        {
            "text": "The range and extent of imports of isolated bark, biomass, and items made from high-risk by-products of the wood industry such as sapwood, continues to grow and develop, and we must be vigilant to changes in trading patterns. We need to understand where these products originate, how they are treated, and whether the treatments have been successful to eliminate the risks."
        },
        {
            "text": "A few years ago, we introduced new measures in response to the huge increase in importation of firewood from European countries. These new measures required any importer to give us notice of bringing in any firewood, and this enabled us to gain an insight into the trade and develop an inspection regime based on risk. These inspections have demonstrated that most of this trade is very safe, as the wood is usually kiln dried before it is exported."
        },
        {
            "text": "Ash timber is now widely regulated because of the possibility it harbours Asian longhorn beetle and Emerald ash borer. Neither pest is currently found in this country, and we are keen to make sure it stays that way. So, we inspect all Ash that is imported, undertaking a document inspection to ensure it has had appropriate treatment, and a physical examination."
        },
        {
            "text": "Xylella is another disease we are tracking. This is a potentially major pest because it has such a wide range of hosts. It can persist on lots of different plant species, things from wheat to cherry trees to olive trees. It has been devasting to huge areas in Europe where it has established."
        },
        {
            "text": "More trade with more different countries, as well as the effects of climate change, increases our vulnerability in different ways. Pest behaviour is changing, and we now have a climate in the UK that is more conducive for some things that might previously have found it too cold. Extremes in weather also affect the health of trees, making them more vulnerable to disease.  Being alert to developing trends in pest behaviour and emerging threats overseas helps us to be prepared and stop them establishing here."
        }
    ]
}