{
    "url": "https://valuationoffice.blog.gov.uk/2022/09/21/what-does-revaluation-mean-for-businesses/",
    "title": "What does revaluation mean for businesses?",
    "authors": [
        "voadigitalpublishing"
    ],
    "categories": [
        "Uncategorized"
    ],
    "pub_date": "2022-09-21T09:58:51+01:00",
    "content": [
        {
            "text": "Alan Colston is our Chief Valuer and Head of Surveying Profession. In this blog he explains what a revaluation is and what it means for businesses. "
        },
        {
            "text": "The Valuation Office Agency (VOA) creates and maintains lists of the ‘rateable value’ of over two million non-domestic properties (properties that aren’t just private homes) in England and Wales. "
        },
        {
            "text": "Rateable values are essentially the amount of rent a property could have been let for on a set valuation date. Local councils can then use this information to calculate Business Rates bills. "
        },
        {
            "text": "We carry out a ‘revaluation’ of all non-domestic properties on a regular basis in order to reflect any changes in the property market.  "
        },
        {
            "text": " "
        },
        {
            "text": "Why we revalue "
        },
        {
            "text": "Business Rates bills are calculated using specific valuations, rather than a banded system like council tax. Revaluations ensure that rateable values reflect any upturns or downturns in the property market. "
        },
        {
            "text": "These valuations are used by local authorities to calculate and issue business rates bills. "
        },
        {
            "text": "Revaluations don’t generate any extra revenue; they help to redistribute the total amount of Business Rates paid to local councils.  "
        },
        {
            "text": " "
        },
        {
            "text": "How we deliver "
        },
        {
            "text": "During a revaluation, we use the data that we have gathered, which is mainly rental information, to assess how rental values have changed since the previous revaluation. All valuations are based on the open market annual rental value of that property at a set point in time set in law known as the Antecedent Valuation Date (AVD).  "
        },
        {
            "text": "To arrive at a valuation, we use three main methods:  "
        },
        {
            "text": "To collect the evidence we need, we use rental and trade data gathered from occupiers and landlords.  We analyse the information collected and undertake valuations. We agree the approach for certain classes with industry where possible.  "
        },
        {
            "text": "We then provide our valuations to central and local government bodies and publish the draft lists of our valuations. At this stage, ratepayers can use our digital service ‘Find my business rates valuation’ on GOV.UK to see their future valuation. "
        },
        {
            "text": " "
        },
        {
            "text": "Impact on Business Rates "
        },
        {
            "text": "Business Rates apply to a wide range of properties, even if they’re not actually used for business purposes. This is because we are required by law to value all non-domestic properties, with certain exceptions, like agricultural premises and places of worship.  "
        },
        {
            "text": "For example, Business Rates can apply to beach huts and village halls as well as shops, offices, and factories. Local councils calculate Business Rate bills by multiplying the rateable value provided by the VOA by what’s known as a multiplier. They can then apply any relevant rate reliefs. In England the multiplier is set by the Department for Levelling Up, Housing and Communities (DLUHC). In Wales the multiplier is set by the Welsh Government. "
        },
        {
            "text": "At revaluation, the multiplier is adjusted by DLUHC or the Welsh Government to ensure the same amount of tax is collected as at the previous revaluation, only allowing for inflation. This means a change in the rateable value does not necessarily result in a change to your Business Rates bill, particularly when any reliefs have been considered.   "
        },
        {
            "text": " "
        },
        {
            "text": "Staying Informed  "
        },
        {
            "text": "A breakdown of what the VOA and local councils can help you with is shown below. Broadly the Valuation Office is responsible for the valuation of your property and your local council is responsible for anything to do with your Business Rates Bill. "
        },
        {
            "text": "If you occupy a non-domestic property in England or Wales and want to find the rateable value, you can use our Find My Business Rates Valuation service. If your property is in Wales, you can also use this service to report any changes to your property that might affect its rateable value or challenge the rateable value. "
        },
        {
            "text": "If your property is in England, you can sign in or set up a business rates valuation account to report changes through our Check service or notify the VOA that you have appointed an agent. You can also submit a challenge to your rateable value once you have completed a Check. "
        },
        {
            "text": "For any questions about Business Rates bills, reliefs, or payments, you should contact your local council. "
        }
    ]
}