{
    "url": "https://vets.blog.gov.uk/2025/05/07/a-day-in-the-life-policy-colleagues-engage-with-key-rvn-stakeholders/",
    "title": "A day in the life:                   Policy colleagues engage with key RVN stakeholders",
    "authors": [
        "Government Vets Blog Team"
    ],
    "categories": [
        "Government Veterinary Services"
    ],
    "pub_date": "2025-05-07T14:07:44+01:00",
    "content": [
        {
            "text": "While discussing the role of Registered Veterinary Nurses (RVNs) within the veterinary team, 2 members of the veterinary policy team in Defra headed to Swindon to visit a large independent hospital. They spent the day shadowing the veterinary nursing team, chatting to the practice leadership, and hearing from the whole veterinary team about the wonderful work RVNs get involved in. "
        },
        {
            "text": "The team were struck by the wide range of roles that were available in the practice for RVNs. Some RVNs enjoyed the variety of being a generalist, and sharing their time between consult rooms, theatres, and wards. There were others who had a clear interest in one area and were encouraged to spent time in that area and specialise their skills. There were also lead nurses for surgery and wards, demonstrating the progression that can be available. "
        },
        {
            "text": "They spoke to colleagues about the challenges associated with the current system of Schedule 3, and how reforms to legislation might be able to further empower RVNs in the workplace to ensure that animals are getting the right care delivered by the most appropriate person. "
        },
        {
            "text": "They also spoke to experienced nurses who reflected on the varied career they had had, as well as a new graduate who was looking forward to a long and fulfilling career as an RVN. "
        },
        {
            "text": "This visit has been a crucial part in increasing Defra’s understanding of the role of RVNs within the veterinary team, and we are grateful for the team at Drove Vets for being so accommodating. "
        }
    ]
}