{
    "url": "https://defrafarming.blog.gov.uk/2025/05/07/farming-equipment-and-technology-fund-2025-guidance-now-available/",
    "title": "Farming Equipment and Technology Fund 2025: guidance now available",
    "authors": [
        "The Team"
    ],
    "categories": [
        "Payments for equipment, technology and infrastructure"
    ],
    "pub_date": "2025-05-07T11:23:14+01:00",
    "content": [
        {
            "text": "The Farming Equipment and Technology Fund (FETF) opens for applications on 29 May. "
        },
        {
            "text": "Today, we published the 2025 FETF guidance on GOV.UK to help you prepare. "
        },
        {
            "text": "In this post, we’ll give an overview."
        },
        {
            "heading": 2,
            "text": "Overview"
        },
        {
            "text": "FETF provides grants for machinery, equipment and technology items to help cut costs and boost efficiency on your farm. "
        },
        {
            "text": "Funding is available under 3 themes: "
        },
        {
            "text": "We’ve grouped items into themes to make it easier to find equipment, but we encourage you to look across all themes, as there may be useful items outside your main area of interest. "
        },
        {
            "text": "Grants will range from £1,000 to a maximum of £25,000 for each theme. We will pay a percentage of the cost of the item, which varies by item. "
        },
        {
            "text": "The fund is competitive. Each theme has rules for scoring, to make sure public money is used well.  "
        },
        {
            "text": "You will be able to apply on 29 May. The window to apply will be open for 6 weeks, closing midday, 10 July."
        },
        {
            "text": "Once the application window closes, all applications will be reviewed and scored. You may not receive all, or any, of the funding you apply for. "
        },
        {
            "text": "We’ll update this post with links to apply once live. "
        },
        {
            "text": "In total, £46.7 million will be available for farmers, growers, foresters and their contractors. "
        },
        {
            "heading": 2,
            "text": "Productivity "
        },
        {
            "text": "This grant helps boost your farm’s efficiency and profitability.  "
        },
        {
            "text": "There are 66 different items of productivity equipment. You can apply for a grant towards any of these. Popular items eligible include: "
        },
        {
            "text": "Other popular items include rainwater harvesting tanks, camera-guided inter-row sprayers and a robotic silage pusher.  "
        },
        {
            "text": "Applications for productivity items are scored based on how much they improve productivity, help the environment, and how widely they are used in the industry. "
        },
        {
            "text": "Your application is more likely to be successful if your Single Business Identifier (SBI) has not claimed more than a total of £10,000 of productivity and slurry management funding from previous FETF rounds – but this will only come into play if we’re oversubscribed.  "
        },
        {
            "text": "The productivity items and specifications are on GOV.UK. "
        },
        {
            "heading": 2,
            "text": "Slurry Management "
        },
        {
            "text": "This grant improves how you collect, store, test and spread slurry. "
        },
        {
            "text": "Better slurry management helps improve soil health and water and air quality, while making the most of valuable nutrients — supporting nature and your bottom line. "
        },
        {
            "text": "There are 17 different slurry equipment items, and popular items eligible include: "
        },
        {
            "text": "Applications for these items are scored on improving slurry management, environmental benefit and level of adoption by the industry. "
        },
        {
            "text": "Your application is more likely to be successful if your Single Business Identifier (SBI) has not claimed more than a total of £10,000 of productivity and slurry management funding from previous FETF rounds – but this will only come into play if we’re oversubscribed. "
        },
        {
            "text": "The slurry management items and specifications are on GOV.UK. "
        },
        {
            "heading": 2,
            "text": "Animal Health and Welfare "
        },
        {
            "text": "This grant can help you improve your livestock’s health and welfare, leading to higher productivity, better quality, and more reliable food production, all of which help increase your profits. "
        },
        {
            "text": "Animal health and welfare grants are available to commercial farmers who keep pigs, sheep, dairy cows, beef cattle, layer chickens or broilers.  "
        },
        {
            "text": "There are more than 100 eligible items. Popular items include: "
        },
        {
            "text": "We’ve worked closely with farmers, vets, academics and industry groups to set this list of items for livestock, including equipment that helps address issues such as heat stress or biosecurity risks. "
        },
        {
            "text": "You can increase your application score by 20% if you provide evidence that you've discussed your application with a vet. "
        },
        {
            "text": "We want to support these conversations as vets can help identify how best to improve health and welfare on your farm and suggest the most suitable equipment. You can take advantage of our funded vet visit for this, the Animal Health and Welfare Review. "
        },
        {
            "text": "The animal health and welfare items and specifications are on GOV.UK. "
        },
        {
            "heading": 2,
            "text": "Join our webinar"
        },
        {
            "text": "We’re hosting a webinar on Wednesday 21 May at 1pm for you to learn more about the offer."
        },
        {
            "text": "In this session, we’ll talk through:"
        },
        {
            "text": "You’ll be able to put your questions to the team."
        },
        {
            "text": "Register to attend the webinar."
        },
        {
            "text": "If you can't attend the session, don't worry. We'll post a link to a recording of the webinar here when it's over. "
        }
    ]
}