{
    "url": "https://naturalengland.blog.gov.uk/2025/05/07/guest-blog-benefits-of-engaging-local-communities-in-bng/",
    "title": "Guest blog: Benefits of engaging local communities in BNG",
    "authors": [
        "Natural England"
    ],
    "categories": [
        "Biodiversity",
        "Biodiversity Net Gain",
        "Biodiversity Net Gain – Hints and Tips",
        "Development",
        "Natural England",
        "Nature",
        "Nature Recovery"
    ],
    "pub_date": "2025-05-07T16:14:41+01:00",
    "content": [
        {
            "text": "Rosie Whicheloe, Senior Planning Ecologist for a local authority in London, explains how she’s looking at the benefits of public engagement in BNG for the communities in which they live."
        },
        {
            "text": "Delivering social value alongside BNG is incredibly important in urban areas. Exploring how BNG might be able to benefit local people is something I have been keen to delve into and research. Below are the beginnings of three ideas that have emerged over the last year, though work and discussions with other urban professionals."
        },
        {
            "text": "Local jobs"
        },
        {
            "text": "My colleagues and I are looking at how we can create community-based employment funded by BNG monitoring fees for management and monitoring of BNG on and offsite in densely populated areas. Where several developments may occur in an area, small amounts pulled together could provide long-term opportunities for young people close to home. A community-based monitoring officer would have eyes and ears on the street much of the time. Site checks and reporting back issues to the planning ecologist could be achieved with little delay. Fixed-point photo locations could be mapped to engage local people to monitor maturing habitats and note species seen. In London there has already been some progress in this with organisations such as Greenspace Information for Greater London, Green Talk and others looking at how online platforms could engage local people and provide training whilst helping Councils deliver on their strategic priorities."
        },
        {
            "text": "Gardeners"
        },
        {
            "text": "We are exploring how skilled gardening roles might be paid for by embedding these costs into Habitat Maintenance and Management Plans (HMMP). This would increase confidence that new developments would deliver on their BNG commitments. Creating successful green spaces requires skill and ongoing care, not just capital investment. The need for on-site enhancements provides an opportunity to improve the current status quo to avoid nature-rich greening being lost from urban areas. Organisations like Care-not-Capital and Future Gardeners are some of the organisations already making a difference with practical training and job opportunities."
        },
        {
            "text": "Strengthening community"
        },
        {
            "text": "Whilst mapping areas of ecological importance is a key requirement for developing the Local Nature Recovery Strategy, mapping human networks is also an important part of the process. I believe it will be very difficult to recover Nature without also a strong, resilient, supportive and engaged human network."
        },
        {
            "text": "An example of what this might look like initially is Newham’s Hidden Gems Map, where all the green and blue spaces managed by residents, communities and charity groups have been included on one map of the borough. It has become a useful resource for NHS social proscribing team that provide it to patients to find local volunteering opportunities. It has also brought together disparate groups to share resources instead of competing for funding."
        },
        {
            "text": "In another example, mapping organisational networks could help collaboration and accelerate action for Nature. This aligns with the strengthened Natural Environment and Rural Communities (NERC) Act which encourages organisations to consider nature-based solutions across all its services rather than traditionally just within Parks and Planning teams."
        },
        {
            "text": "Engaging people in Biodiversity Net Gain to benefit communities"
        },
        {
            "text": "A year on from the start of mandatory BNG, the Institute of Development Studies (IDS) has given a preview of a research report that it worked on with Natural England highlighting opportunities for people’s engagement in managing and monitoring BNG in the house-building sector. The report will help developers and planning authorities better engage people for BNG."
        },
        {
            "text": "The headline message from the report is: “The more the public are involved in designing, planning and implementing biodiverse habitats in the first place, the more likely they are to support long-term delivery.”"
        }
    ]
}