{
    "url": "https://extremismcommission.blog.gov.uk/2025/05/07/stacu-a-year-of-building-trust-and-accountability/",
    "title": "StaCU: A Year of Building Trust and Accountability",
    "authors": [
        "Commission for Countering Extremism"
    ],
    "categories": [
        "Blog"
    ],
    "pub_date": "2025-05-07T13:17:09+01:00",
    "content": [
        {
            "text": "By Robin Simcox, Commissioner for Countering Extremism"
        },
        {
            "text": "Today, we publish the first annual report of the Standards and Compliance Unit (StaCU), documenting a year of operations since its February 2024 launch."
        },
        {
            "text": "When I was tasked by the Home Secretary with overseeing StaCU's creation in September 2023, it was in response to the Independent Review of Prevent (IRP) recommendation that robust oversight for the Prevent programme was vital. The IRP had concerns over scrutiny and accountability. StaCU was conceived as the answer to these concerns."
        },
        {
            "text": "Building from the Ground Up"
        },
        {
            "text": "The journey to today's publication began with recruiting a dedicated team and establishing our terms of reference. By February 2024, we had operationalised the unit with a public-facing website and online complaints form. "
        },
        {
            "text": "Since then, we have worked diligently to create processes for handling complaints and sharing data across government departments, operational partners, and devolved administrations."
        },
        {
            "text": "In November 2024, we appointed our StaCU Investigator in November 2024. This enhanced our ability to not just process day-to-day complaints, but to actively investigate potentially more systemic and sustained breaches of the Prevent Duty."
        },
        {
            "text": "What We Found"
        },
        {
            "text": "Our first year of operations has revealed several recurring themes that merit attention. Of particular concern are instances where local practices diverge from national guidance. "
        },
        {
            "text": "We have seen cases where Local Authorities have partnerships with individuals and organisations that may create what the Prevent Duty Guidance describes as \"permissive environments\" for radicalisation."
        },
        {
            "text": "Another persistent issue is the reluctance among some Prevent staff to use certain terminology: in particular, \"Islamism\" due to its potential to cause offence. "
        },
        {
            "text": "This issue was covered in the IRP, which concluded that Islamism was “a neutral descriptor” that is “essential within Prevent” and not using the term \"would deny government the ability to name the problem and therefore deliver effective policy.”  "
        },
        {
            "text": "While updated and improved training has the potential to alleviate local concerns, the continued use of non-quality assured training from third-party providers remains problematic."
        },
        {
            "text": "Looking Ahead"
        },
        {
            "text": "StaCU's role is to ensure that Prevent maintains the highest standards of delivery and adheres to the objectives set by democratically elected ministers. Our first annual report demonstrates our commitment to this mission."
        },
        {
            "text": "As we move into our second year, we will deepen our collaboration with stakeholders across government, civil society organisations, and academic institutions to gain further insights into the effectiveness of Prevent delivery. All the while we will continue the pre-existing daily work of ensuring Prevent has oversight that is independent, robust and thorough."
        },
        {
            "text": "The effectiveness of our counter-terrorism strategy depends on it."
        },
        {
            "text": "Read the StaCU report: Standards and Compliance Unit Annual Report: 2024 to 2025 - GOV.UK"
        }
    ]
}