{
    "url": "https://environmentagency.blog.gov.uk/2025/05/07/working-together-to-stop-waste-criminals/",
    "title": "Working together to stop waste criminals",
    "authors": [
        "defrablogs"
    ],
    "categories": [
        "Regulated industry",
        "Waste"
    ],
    "pub_date": "2025-05-07T08:21:21+00:00",
    "content": [
        {
            "text": "Waste crime is a scourge impacting communities, the economy and the environment. "
        },
        {
            "text": "At the Environment Agency, we know only too well the impact criminals are having in the waste industry. Ranging from the ‘man with a van’ collecting rubbish for cash and then illegally dumping it - through to large scale and organised criminal networks, collecting rubbish on an industrial scale and illegally disposing of it – it’s a colossal problem. Waste crime is costing the economy in England an estimated £1 billion every year. The waste industry estimates 18% of all waste is estimated to be illegally handled – that’s 34 million tonnes, enough to fill 4 million skips."
        },
        {
            "text": "In 2023/24, local authorities in England dealt with 1.15 million fly-tipping incidents - 60% of which involved household waste.  "
        },
        {
            "text": "The effects of these criminals are far reaching and often long lasting. Legitimate waste management businesses lose out to criminals, who undercut their prices because they are not operating within the law. Taxpayers lose out as public money is used to stop and bring those responsible to justice and clear up the mess they leave behind. Private landowners face huge bills to clear illegally dumped waste from their land and premises. The environment suffers from the pollution dumped waste can cause, impacting people and wildlife."
        },
        {
            "text": "Across the country our council enforcement teams work hard to tackle fly-tipping, while we work hard to stop large scale waste crimes. We often work together, sharing intelligence and supporting each other on operations to target and stop offenders."
        },
        {
            "text": "Operation Flycatcher"
        },
        {
            "text": "Led by Cheshire West and Chester Council, Operation Flycatcher’s mission was to target potential waste crime and fly tipping hotspots and to carry out roadside vehicle checks.  We joined this intelligence led multiagency operation along with Cheshire Police Rural Crime Team, Cheshire Police Bike Cops, and the force vehicle examiner."
        },
        {
            "text": "The operation delivered results for all the partners, closing the net on criminals from all enforcement angles. In this case, we identified an illegal waste transfer station where the burning of waste was also taking place and a building site where waste was being burnt. In line with the Regulators’ Code, we gave advice and guidance and made further enquires to follow up with the landowners. We also carried out checks on waste carriers registrations and transfer notes."
        },
        {
            "text": "Operation Wolf"
        },
        {
            "text": "Elsewhere, in Hampshire Operation Wolf organised by Hampshire police brings together police, Environment Agency, local councils, HMRC and Commercial Vehicle Units to target waste vehicles and carry out waste tracking across Hampshire."
        },
        {
            "text": "In the latest day of action, a total of 67 vehicles were checked. For us, that enabled us to check waste carrying vehicles were operating legally and resulted in 11 waste carriers being instructed to register within 7 days and one vehicle was found to be carrying hazardous waste without the necessary consignment notes or waste carriers registration."
        },
        {
            "text": "Hampshire County Council said, \"The Environment Agency is an integral part of Hampshire’s Intelligence and Enforcement Working Group, partnering with our Local Authorities and other key stakeholders in the fight against the unacceptable social, economic and environmental harm that is caused by fly-tipping. Their participation has helped to facilitate the sharing of key intelligence and best practice, as well as practical action against rogue waste carriers through “Operation Wolf” – a series of targeted stop and check enforcement events.\"  "
        },
        {
            "text": "Operation Barley"
        },
        {
            "text": "This rolling roadside operation is organised by our Waste Crime Engagement Specialist for Solent and South Downs, through our partnership meetings. Dates are set throughout the year when our Southeast team works with local councils across West Sussex to identify emerging trends and waste crime hotspots. Each authority puts forward locations which we recce and then forward to the Sussex Rural Crime team for confirmation that the locations we have put forward are safe for vehicles to be pulled into. We invite DVLA along too."
        },
        {
            "text": "Waste carriers’ registrations are checked, waste types, scrap metal dealer licences and roadworthiness of vehicles, including Insurance and MOT. Information is recorded about where waste is collected from and where it is going to, checking details on Waste Transfer Notes. This allows for waste tracking of operators and businesses and gathers intelligence used to aid investigations and future carrier broker dealer audits."
        },
        {
            "text": "These are just some of the examples of joint working between us, local councils and other partner organisations. There are more happening all the time up and down the country designed to disrupt and stop waste crime."
        },
        {
            "text": "You can help stop waste criminals"
        },
        {
            "text": "As a nation, we must stand united against criminals, working together to stop them. Everyone can help by taking steps to keep waste away from criminals and reporting those suspected of wrongdoing."
        },
        {
            "text": "If you are you doing DIY or have a house renovation project in motion, you might need a skip or private waste collector to take your rubbish away."
        },
        {
            "text": "Follow our tips to make sure you hire a legitimate company:"
        },
        {
            "text": "If you think you have come across a person or company operating an illegal waste business, you can report them to Crimestoppers, 100% anonymous. Always. Report online or call: 0800 555 111."
        }
    ]
}