{
    "url": "https://designnotes.blog.gov.uk/2022/08/25/a-day-in-the-life-of-a-service-designer-at-gds/",
    "title": "A day in the life of a service designer at GDS",
    "authors": [
        "Kay Dale - Senior Service Designer, GDS",
        "Laurence Berry – Senior service designer, GDS",
        "Amina Omar - Service Designer, GDS",
        "Hannah Jump - Senior Service Designer, GDS",
        "Ella Dorfman – Senior service designer, UK Home Office",
        "Stephanie Maguire - Senior Service Designer, GDS"
    ],
    "categories": [
        "Service Design"
    ],
    "pub_date": "2022-08-25T09:00:57+01:00",
    "content": [
        {
            "text": "A service is anything that helps a user do the task they want to do, for example, start a business or prove their identity online. Service designers at the Government Digital Service (GDS) mainly design services for other government departments, to help them to deliver public services that work for everyone. "
        },
        {
            "text": "Service designers work with many other disciplines. We do a lot of problem solving, running workshops to help our teams, and strategic work to help make sure the needs of users are prioritised. We design end-to-end services, thinking about everything the user needs to do to complete a task, including the things that happen online, offline or in person."
        },
        {
            "text": "A typical day for a service designer can vary a lot, depending on the team and project we’re working on. In this blog post 7 service designers, all in different teams and stages of their career, show some of the work they do."
        },
        {
            "heading": 2,
            "text": "Identify what the real problem is "
        },
        {
            "heading": 3,
            "text": "Hannah Jump, Senior Service Designer, GOV.UK "
        },
        {
            "text": "I spend a lot of my time helping my team to understand the problem we’re trying to solve. It’s in our instinct to try and fix things quickly, but if we don’t know what we’re trying to fix, then we will not be able to make anything better. I’m the person asking the difficult questions."
        },
        {
            "text": "I work closely with user researchers to plan research sessions, which help us understand what users really think, feel and struggle with. I then make sure my team and our stakeholders in other departments understand these needs and prioritise meeting them. "
        },
        {
            "text": "I help the team think about what could go wrong for our users. I run workshops to discuss the assumptions we’re making, and the risks of our work. I also work with the product manager to make sure we prioritise working on things that benefits users the most. "
        },
        {
            "heading": 2,
            "text": "Map and visualise the journey of users "
        },
        {
            "heading": 3,
            "text": "Gazbia Sorour, former Service Designer, Digital Identity"
        },
        {
            "text": "As service designers, our aim is to build seamless and inclusive user journeys that really work for people. Visualising user journeys helps us see what we’re designing from the user’s perspective, and keep that as our focus. In the government, there are no rules for what a journey map should look like, it just needs to help you do the thing you need to do. "
        },
        {
            "text": "As a service designer, I run journey mapping workshops with the team. Sometimes I run sessions to spot the gaps and opportunities for improvement, mapping unhappy paths (the complicated and frustrating journeys) and designing inclusive journeys."
        },
        {
            "text": "I also take journey maps to team planning so I can define which parts of the user journey need work and who needs to work on them. Sometimes I use journey maps in meetings with departments, to help us reach a shared understanding and show people in other departments how the service works. "
        },
        {
            "heading": 2,
            "text": "Create a shared understanding within and outside of the team"
        },
        {
            "heading": 3,
            "text": "Hannah Jump, Senior Service Designer, GOV.UK "
        },
        {
            "text": "One of the things I enjoy most about service design is bringing the team together to solve the problem. I get involved in planning the long-term roadmap for our team and I work with the product manager to help prioritise our short-term work. I advocate for us to focus on the stuff that will help make things better for everyone. "
        },
        {
            "text": "I run kick-off workshops to make sure we have a shared understanding of the problem we’re solving. I’m always aware of everything going on in the team and I spot opportunities to help people in other roles to run workshops to make sure they are as effective as they can be. As we go, I help keep the team on track, linking our work back to our goals."
        },
        {
            "text": "Communicating what we’re doing is important. I help make things visible to the team through rough prototypes and diagrams. This makes it easier for them and others we work with to grasp what we are thinking. I tell the story of what we’ve done in presentations, to make sure it is clear where we’ve come from and where we’re going. "
        },
        {
            "heading": 2,
            "text": "Spot opportunities for reducing cost and complexity "
        },
        {
            "heading": 3,
            "text": "Kay Dale, Senior Service Designer, GDS Advisory"
        },
        {
            "text": "Often, as a service designer, you can be working on briefs which focus on improving how efficiently services operate. These can help platforms to grow, so more people can use them, or can help make the case for a piece of improvement work to happen. When I’ve done work like this before, I’ve worked closely with a variety of roles like product managers, economists and user support specialists.  \n\nAs a service designer in this setting, I’ve run workshops to map feedback from users to different parts in the journey they take through the service. This helped the team identify the root causes of the problems and to prioritise which area to focus on improving next. User support specialists can then forecast how this would impact support. Economists can then help model the cost saving benefit of solving that problem."
        },
        {
            "heading": 2,
            "text": "Help define the scope of the service "
        },
        {
            "heading": 3,
            "text": "Ella Dorfman, former Senior Service Designer, GDS Advisory"
        },
        {
            "text": "If I’m working on a transactional service, that is, a service where people need to give personal information, money or goods, or permissions, I help the team understand user needs. This is so that we can define what things the service needs to do. I do this by running workshops where we decide how to prioritise user problems and iterate the service based on this data."
        },
        {
            "text": "For more complex services, especially when we need to deliver something quickly, a single team isn’t able to own all decisions. In these situations, my responsibility is to help join up teams and organisations so that we have a view of all the user needs and journeys, and the steps people go through. I might help prioritise what needs to be worked on first. I also get involved in the organisation design to help determine what resources are needed and advise on what steps to take first. "
        },
        {
            "text": "For big and small services, I always refer back to what the service manual says about naming your service to help communicate the scope of the service to users."
        },
        {
            "heading": 2,
            "text": "Explore and prototype various solutions to the problem "
        },
        {
            "heading": 3,
            "text": "Amina Omar, Service Designer, GOV.UK"
        },
        {
            "text": "The fun part of designing is coming up with ideas to fix things! Finding solutions to a problem is a group effort and not just a designer waving their magic wand. "
        },
        {
            "text": "Initially, I help the team think big about potential ideas and not be too constrained by details or limitations. I run sessions to help everyone think of as many ideas as possible. The goal is to think broadly, as this helps explore many approaches to a problem and think about what might be possible beyond the current limitations of a service or process. "
        },
        {
            "text": "Next, I run hypothesis-making sessions to think critically about our assumptions and how we can validate them with data. I visualise and bring the team’s ideas to life through prototyping. I might do this using a journey map or by sketching simple wireframes. Getting feedback from our users is really important and helps make sure we’re still meeting user needs and the team’s goals."
        },
        {
            "heading": 2,
            "text": "Design the service end-to-end, from backstage to front, in all channels "
        },
        {
            "heading": 3,
            "text": "Stephanie Maguire and Laurence Berry, Senior Service Designers, Service Transformation"
        },
        {
            "text": "We design end-to-end services, which means we need to think about everything the user needs to do to complete a task. We look beyond the ends of the digital service, understanding all the points and interactions that led users to the service in the first place. This could be email reminders or advice from their council, and what they do after they’ve completed their first task. We might help the team visualise this through creating journey maps which show the details of the service. "
        },
        {
            "text": "We need to think about the offline bits of the service, like making telephone payments easier, as well as the bits that happen in the background. We think about how to provide a good experience for the people running and working on the service. We do user research with them and spot ways to make things better for them, for example by creating new ways to categorise and prioritise support requests."
        },
        {
            "text": "We test new ways of doing things, and keep changing them until they work. We also work with departments who manage different parts of the service. We share findings from user research to help them understand the importance of getting these parts of the services right."
        },
        {
            "heading": 2,
            "text": "Service designers do a lot! "
        },
        {
            "text": "From all these examples you can see that service designers do a lot of different things in their work. From facilitating workshops, to using maps to visualise what users experience, to influencing prioritisation and decision-making. "
        },
        {
            "text": " "
        }
    ]
}