{
    "url": "https://companieshouse.blog.gov.uk/2022/08/25/how-user-centered-design-shapes-our-services/",
    "title": "How user-centered design shapes our services",
    "authors": [
        "Nadine Hussien - User Experience Researcher"
    ],
    "categories": [
        "Digital transformation",
        "User research"
    ],
    "pub_date": "2022-08-25T10:00:44+01:00",
    "content": [
        {
            "text": "Do you work with overseas entities that own land or property in the UK? Are you a beneficial owner or managing officer of an overseas entity that owns land or property in the UK? Are you searching for information about overseas entities that own land or property in the UK?"
        },
        {
            "text": "If so, Companies House needs your help. In March 2022, the new Economic Crime (Transparency and Enforcement) Act 2022 came into force. As of 1 August 2022, all overseas entities that own land or property in the UK must register on the new Register of Overseas Entities."
        },
        {
            "heading": 2,
            "text": "What is the Register of Overseas Entities?"
        },
        {
            "text": "The new Register of Overseas Entities is held by Companies House and requires overseas entities that own land or property in the UK to declare their beneficial owners and/or managing officers. There will be severe sanctions for those who do not comply, including fines, prison sentences and restrictions on buying, selling, transferring, leasing or charging their land or property in the UK."
        },
        {
            "heading": 2,
            "text": "What is Companies House doing?"
        },
        {
            "text": "Since the Economic Crime (Transparency and Enforcement) Act 2022 became law in March, Companies House has been hard at work to provide a registration service to users impacted by the Act. Entities can now register the required information, including details about beneficial owners, to remain compliant with the law."
        },
        {
            "text": "Setting up a new service like this has come with many challenges. Aside from the short turnaround, the services need to be as simple as possible, while collecting complex information about the entity."
        },
        {
            "text": "First, we established the requirements so that customers would be compliant. We then needed to map user journeys, create screen designs, test the designs with users and iterate designs based on user feedback. This is where the user-centred design team came in."
        },
        {
            "heading": 2,
            "text": "What is user-centred design at Companies House?"
        },
        {
            "text": "As a team, our job is to make sure that the services that Companies House provides are simple to use, clear to understand and allow people to do what they need to do quickly and easily."
        },
        {
            "text": "One of the challenges we faced was finding users who would be likely to interact with the new Register of Overseas Entities service. This was crucial to understanding what users needed from this service and how we could meet those needs. Another challenge was that the legislation was still being written, which meant the service was constantly evolving based on new requirements from the legislation and insights from user research."
        },
        {
            "text": "We managed to speak to over 70 users within four months. These users were a broad mix of agents, beneficial owners, managing officers, people who work with trusts and users with accessibility needs. Speaking to these people helped us shape a successful service in a very short space of time. We are still improving based on what we’ve learned."
        },
        {
            "text": "The service for users to Register an Overseas Entity and tell us about its beneficial service is now live, but this is only the beginning for our overseas entities-related services."
        },
        {
            "text": "As we continue to develop our new services, we need your help. To do this, we have set up the Register of Overseas Entities user panel."
        },
        {
            "heading": 2,
            "text": "What is the Register of Overseas Entities user panel?"
        },
        {
            "text": "This is a group of volunteers who are sharing their time and knowledge to better inform us about who our users are, the work that they do and how we can help them."
        },
        {
            "text": "This means that, as we design and develop our services, we can speak to the people who use them. This helps us gain relevant and valuable insight so we can create successful services for those who need them."
        },
        {
            "text": "Having a user research panel also helps us talk to all sorts of people, whether they are likely to use our services or not. It enables us to speak to those who may be harder to reach - for example, people who are located outside of the UK, or have lower digital skills."
        },
        {
            "text": "The more we understand our users, the more we can build accessible, intuitive and inclusive services that work for everybody. Find out more information on how user research improves service design by reading the service manual."
        },
        {
            "heading": 2,
            "text": "What could I be asked to do if I join the user panel?"
        },
        {
            "text": "We interact with our users in different ways to get their feedback. As a panel member, you could be asked to:"
        },
        {
            "text": "You’ll be asked to fill in a short survey to join the panel, which allows us to learn a little bit more about you before we contact you for a research opportunity."
        },
        {
            "text": "The format of the research session will vary depending on what we are aiming to learn. If you’re invited to a research session, this will usually involve some brief background questions. We will then invite you to an interactive section and ask for your feedback on a service we are developing. Research sessions typically last up to an hour and a survey usually takes around 5 to 10 minutes to complete."
        },
        {
            "text": "If we are carrying out research at your home or place of work, we'll aim to find the most suitable date and time convenient to you, where possible."
        },
        {
            "text": "We'll ask you which types of research you'd like to be involved in, and we'll only invite you to take part in activities which you have specified."
        },
        {
            "text": "Participation is completely voluntary, and you can say no to any invitation that you receive. You can also leave the user panel at any time."
        },
        {
            "text": "We'll use the information you provide during the research sessions to learn about user needs. This will help us to:"
        },
        {
            "heading": 2,
            "text": "Everything is confidential"
        },
        {
            "text": "Any information that you share with us is handled in accordance with data protection legislation. When you take part in a research activity, the feedback you provide is confidential. Information will not be shared with third parties or used for marketing purposes."
        },
        {
            "text": "For further information on how we treat your personal information, please see our personal information charter."
        },
        {
            "heading": 2,
            "text": "Can you help us to help you?"
        },
        {
            "text": "We want users from a wide variety of demographics, roles, locations and backgrounds to get involved, as we want our services to work for everyone."
        },
        {
            "text": "We welcome people who have used our Register of Overseas Entities services in the past, those who intend to use these services in the future and people who just have an interest in these services and, for example, might search for information relating to the Register of Overseas Entities."
        },
        {
            "text": "Can you help us to grow our user panel by providing feedback that will ensure our services are user friendly, meet your needs and work for everyone? Joining the panel is a great way to help influence the way we build our services."
        }
    ]
}