{
    "url": "https://ruralpayments.blog.gov.uk/2022/08/25/introducing-you-to-10/",
    "title": "Introducing You To...",
    "authors": [
        "RPA Editor"
    ],
    "categories": [
        "Introducing You To"
    ],
    "pub_date": "2022-08-25T12:04:31+01:00",
    "content": [
        {
            "text": "Hi, my name’s Louisa and I’m part of the Sustainable Farming Incentive (SFI) Delivery Team. I’m based in Newcastle and I’ve worked for the RPA for six months."
        },
        {
            "text": "Since joining RPA, my temporary job for the first couple of months has been on the Rural Payments helpline, helping customers during the Basic Payment Scheme (BPS) 2022 claim window. This gave me a good grounding and background knowledge of my work area and also a chance to interact with customers before moving over to my permanent role as a SFI Operational Delivery Team Member."
        },
        {
            "text": "My main responsibility overall is to process the SFI 2022 applications we receive. However, throughout the SFI Private Beta (this is where we invited a select group of customers to apply early for SFI and provide feedback on the processes/systems to ensure there were no issues prior to the launch) I was given the opportunity to get involved further and have now moved to a new Early Adopters Team (EAT). The EAT is a team of processors set up to process SFI application and help with any queries customers have regarding the application process and provide assistance where needed. This involves testing processes and providing feedback to ensure systems, processes and guidance is all running smoothly for both advisors and customers."
        },
        {
            "text": "A typical day for me involves picking up SFI 2022 applications that have been submitted, and then checking all the information is correct before processing the application through an agreement offer being issued. As part of the Early Adopters team, I have additional responsibilities to carry out such as assurance checks and constantly providing feedback on guidance and processes to help develop the services we provide."
        },
        {
            "text": "We also deal with emails from customers and call them back when necessary to resolve any issues or questions they may have. A big part of my job is communicating with my team and sharing ideas, as well as constantly supporting each other through the work that we do – I’m really lucky to have such an amazing team!"
        },
        {
            "text": "I really enjoy helping our customers and contributing to making their lives easier, as we’re constantly looking for potential improvements and listening to feedback to help develop the service to be the best it can be."
        },
        {
            "text": "The aspect of my role which has the greatest impact on our customers is the assurance checking and progressing applications, as this ensures the customer is offered the correct amount of eligible land to claim on, their application is offered as quickly as possible and in turn we’re helping farmers make great environmental and sustainable choices."
        },
        {
            "text": "I thoroughly enjoy the problem solving and investigating aspect of my role as I find this really engaging, but the thing I love the most is the ability to communicate directly with our customers as people are at the heart of what we do! It’s great that we can communicate with farmers and build rapport.  If there was any way that we could provide further support, it would be by encouraging more communication, which will allow us to continuously improve and make our service the best it can be."
        },
        {
            "text": "Before working in RPA, I worked in the fashion industry for around six years whilst studying Fashion Business at university, and then decided this wasn’t for me and started working in the civil service at HMRC."
        },
        {
            "text": "I absolutely love living in the Northeast and feel super lucky to have so much going on around me. Newcastle City Centre is only a short drive away, and I have beautiful countryside and beaches on my doorstep to enjoy."
        },
        {
            "text": "Outside work I love spending time with family, usually outdoors, either going on walks or for a coffee at the beach, or going to the cinema to see a good horror! I think it’s really important to keep in touch with friends too, and although life gets busy, I always try to make plans for a catch-up. I’m also a massive food enthusiast and will never turn down an opportunity to try a new restaurant or cuisine."
        },
        {
            "text": "I thoroughly enjoy working here at the RPA and it feels amazing being part of a scheme which aims to help farmers manage land in a way that improves food production and is more environmentally sustainable. “Choose a job that you love and you’ll never work a day in your life” – Confucius."
        }
    ]
}