{
    "url": "https://environmentagency.blog.gov.uk/2022/08/25/towards-fusion-energy-regulation/",
    "title": "Towards fusion energy regulation",
    "authors": [
        "Environment Agency"
    ],
    "categories": [
        "Climate change",
        "Regulated industry"
    ],
    "pub_date": "2022-08-25T13:37:47+00:00",
    "content": [
        {
            "text": "As we prepare to regulate fusion energy facilities, Amber Bannon, our fusion lead, talks about visits to Culham, the home of fusion in the UK and the hottest site in the solar system."
        },
        {
            "text": "The impacts of climate change are well known, affecting everything and everybody, with record breaking temperatures, droughts, more frequent and severe flooding events, and rising sea levels. This climate crisis is linked to our carbon-fuelled economy. At the UN climate summit Conference of the Parties (COP26), global leaders agreed to limit global warming to 1.5°C. To do this we need to decarbonise our economy and halve global carbon dioxide emissions by the early 2030s and reach net zero by the mid-century. The term net zero means achieving a balance between the carbon emitted into the atmosphere and the carbon removed from it, so we’re not putting more into the atmosphere than we can remove."
        },
        {
            "text": "As part of its net zero targets, the UK Government is aiming for a fully decarbonised power system in the UK. The system needs to be reliable which means that intermittent renewables should be complemented by technologies which can consistently and continually provide power, for example when the sun isn’t shining for solar power to be used. Fusion could be the ultimate clean power solution, representing a low carbon, safe, continuous and sustainable source of energy."
        },
        {
            "text": "Fusion is the process powering our sun, emitting heat and light. It occurs when the nuclei of two light elements are fused together to create a heavier element, releasing energy."
        },
        {
            "text": "In June the government confirmed that future fusion energy facilities will be regulated by the Environment Agency (EA) and the Health & Safety Executive (HSE)."
        },
        {
            "text": "This announcement followed the government’s consultation in October 2021 which asked for views on the future regulatory framework for fusion."
        },
        {
            "text": "This is good news for the fusion industry which will continue to see proportionate and innovation friendly regulation – and we’ve already got experience of regulating the experimental facilities at the UK Atomic Energy Authority’s (UKAEA) Culham site."
        },
        {
            "text": "Although this news means no change to the current regulations, we plan to build our capability and capacity to meet the challenges of an expanding fusion industry in England."
        },
        {
            "text": "And we’ve started already - our new fusion team, and our colleagues from Natural Resources Wales, have been visiting three fascinating sites near Culham, the UK home of fusion, for a capability building fusion ‘road trip’."
        },
        {
            "text": "UK Atomic Energy Authority (UKAEA), Culham Centre for Fusion Energy "
        },
        {
            "text": "The first day started at the UK Atomic Energy Authority facility in Culham where the Joint European Torus (JET), which is a ring-shaped magnetic chamber, has been operational since the early 1980’s. JET is the world’s largest and advanced tokamak – an experimental machine that uses magnets to contain and compress a plasma of charged particles to achieve a fusion reaction. We were interested to understand how UKAEA handle and recover tritium, a radioactive isotope of hydrogen used in fusion reactions."
        },
        {
            "text": "We learnt about the work UKAEA is doing in its ‘RACE’ facility to develop robotic and remote handling technology. This will enable routine access and maintenance work to be carried out safely. Next stop was the ‘MAST facility’ where we looked at how a different design for fusion – a compact spherical tokamak – is being developed."
        },
        {
            "text": "Tokamak Energy"
        },
        {
            "text": "On the second day we visited Tokamak Energy, a commercial fusion energy company in Oxfordshire. Tokamak Energy’s current design, called the ‘ST40 compact spherical tokamak’ uses conventional copper magnets and it recently achieved a plasma temperature of 100 million degrees Celsius, the threshold required for commercial fusion energy."
        },
        {
            "text": "First Light Fusion"
        },
        {
            "text": "On the final day we visited First Light Fusion. Our team were told about research to prove fusion can be achieved using ‘inertial confinement technology’. Simply, this means firing a high-speed projectile at a target containing fuel. An increase in pressure from the impact squashes the fuel and fusion takes place. Their “big friendly gun” (BFG), the UK’s largest two-stage gas gun, is used to test new target designs."
        },
        {
            "text": "Back in the office"
        },
        {
            "text": "We’re now continuing our plans to get ready to regulate the next generation of fusion facilities in England. Getting involved now means we can ensure protection of people and the environment and sustainability are part of the design process."
        },
        {
            "text": "Read our first blog from December 21 here."
        },
        {
            "text": "Email us if you’ve got a question about the regulation of fusion: fusion@environment-agency.gov.uk"
        }
    ]
}