{
    "url": "https://ukhsa.blog.gov.uk/2025/12/30/changes-to-the-childhood-vaccination-schedule-from-january-2026/",
    "title": "Changes to the childhood vaccination schedule from January 2026",
    "authors": [
        "Blog Editor"
    ],
    "categories": [
        "immunisations"
    ],
    "pub_date": "2025-12-30T13:26:33+01:00",
    "content": [
        {
            "text": "Routine childhood vaccinations provide children with protection against a range of diseases that can be very serious."
        },
        {
            "heading": 2,
            "text": "Why is this change happening?"
        },
        {
            "text": "The NHS childhood vaccination schedule has recently been updated to help give children even better protection against diseases. Changes include protecting children against some diseases earlier and adding vaccines that protect against more diseases."
        },
        {
            "heading": 2,
            "text": "What action do I have to take as a parent/carer?"
        },
        {
            "text": "You’ll usually be contacted by your GP practice when your child is due for their next routine vaccination appointment. This could be via a letter, text, phone call, or email."
        },
        {
            "text": "If you know your child is due for a vaccination and you have not been contacted, you can speak to your GP practice to book the appointment."
        },
        {
            "heading": 2,
            "text": "What are the changes?"
        },
        {
            "heading": 3,
            "text": "MMRV vaccine replaces the MMR vaccine"
        },
        {
            "text": "From 1 January 2026, the MMRV vaccine will be introduced into the routine childhood immunisation schedule in the UK. The MMRV vaccine protects against 4 serious diseases: measles, mumps, rubella, and chickenpox (known as varicella). The MMRV vaccine has been safely used for over a decade and is already part of the routine childhood vaccination schedule in several countries, including Canada, Australia and Germany."
        },
        {
            "text": "When your child will be offered the MMRV vaccine will depend on their date of birth. Children born on or after 1 September 2022 will be offered 1 or 2 doses of the MMRV vaccine as part of their routine vaccinations. A single MMRV catch-up dose will be offered to children born between 1 January 2020 and 31 August 2022 if they haven't already had chickenpox or been vaccinated against it. This dose will be offered between November 2026 and March 2028. More detail on the eligibility can be found in our blog post: what is the MMRV vaccine and is my child eligible?"
        },
        {
            "heading": 3,
            "text": "Changes to the 1-year appointment"
        },
        {
            "text": "The Hib/MenC vaccine will no longer be offered at the routine 1-year vaccine appointment. This is because the adolescent MenACWY programme has resulted in a significant reduction in cases of meningococcal infections, so the Joint Committee on Vaccination and Immunisation (JCVI, a group of experts) no longer recommends a dose of a MenC-containing vaccine for infants."
        },
        {
            "text": "The JCVI now instead recommends an extra dose of the 6-in-1 vaccine, which gives protection against Haemophilus influenzae type b (Hib), which will be offered at the 1-year or 18-month appointment, depending on your child’s date of birth. This will help to prevent the spread of Hib in the community and maintain herd immunity. It offers protection against diphtheria, tetanus, whooping cough, polio, Hib and hepatitis B."
        },
        {
            "text": "For children born on or after 1 July 2024, a fourth dose of the 6-in-1 vaccine will be offered at 18 months. Children born before 1 July 2024 who have not yet had their 12 month vaccines may be offered a booster dose of either Hib/MenC, or the 6-in-1 vaccine."
        },
        {
            "heading": 3,
            "text": "Introduction of an 18-month appointment"
        },
        {
            "text": "For children born on or after 1 July 2024, a new 18-month appointment will be introduced. At this appointment, a fourth dose of the 6-in-1 vaccine will be offered at 18 months rather than 12 months."
        },
        {
            "text": "The new 18-month appointment also provides an opportunity for the second dose of the MMRV vaccine to be given earlier, moving forwards from the 3 years 4 months appointment to the 18-month appointment. This will help provide children with protection against measles, mumps, rubella, and chickenpox from a younger age, reducing the likelihood of outbreaks and helping to increase uptake of the vaccine. "
        },
        {
            "heading": 3,
            "text": "Second dose of the Meningococcal B (MenB) vaccine offered earlier"
        },
        {
            "text": "The second dose of the meningococcal B (MenB) vaccination, previously offered at 16 weeks of age, was moved to 12 weeks from 1 July 2025. (The first dose is offered at 8 weeks)."
        },
        {
            "text": "MenB can cause serious illnesses, including meningitis and sepsis. Moving the second dose to 12 weeks helps to provide greater protection, earlier. This is particularly important as, since the vaccine was introduced in 2015, there have been increasing number of cases of meningitis B in young babies who had not yet gained the protection from the second dose of the vaccine. JCVI advised that it would be beneficial to move the second dose of MenB vaccine to 12 weeks of age to provide earlier protection."
        },
        {
            "heading": 3,
            "text": "Pneumococcal vaccine offered later: the first dose of the pneumococcal vaccine moved from 12 weeks to 16 weeks of age"
        },
        {
            "text": "The first dose of the pneumococcal vaccine, previously offered at 12 weeks, will now be offered at 16 weeks, so that the MenB vaccine can be given earlier. This was introduced from 1 July 2025. Although your baby will get the pneumococcal vaccine 4 weeks later than previously, they will still be protected. This is because pneumococcal disease is now very rare in young babies, due to high vaccination rates in the wider community, which provides herd immunity."
        },
        {
            "heading": 2,
            "text": "Where can I find more information?"
        },
        {
            "text": "These updates to the childhood vaccination help to provide children with the best possible protection against serious diseases."
        }
    ]
}