{
    "url": "https://educationhub.blog.gov.uk/2022/03/7162_university_minimum_eligibility_requirements_consultation_maths_english_gcse_alevel_student_number_controls/",
    "title": "Minimum eligibility requirements and student number controls – your university reform questions answered",
    "authors": [
        "Media Officer"
    ],
    "categories": [
        "Higher Education",
        "Universities"
    ],
    "pub_date": "2022-03-21T11:06:21+00:00",
    "content": [
        {
            "text": "We want people to pursue the right path for them and receive a fair deal for their investment if they choose to go to university. Too often, students are taking on debt for courses that will not help them earn more in the future. That's why we have launched consultations on a range of reforms to higher education."
        },
        {
            "text": "As part of this we will test the possible introduction of minimum eligibility requirements, which  would restrict access to student finance so that only those who have the necessary prior attainment could access it, and introduce student number controls to prevent too many students going into courses where employment prospects are limited. We’re also consulting on exemptions for certain student groups like mature students."
        },
        {
            "text": "Here's what you need to know."
        },
        {
            "heading": 3,
            "text": "Will these plans limit access to higher education?"
        },
        {
            "text": "No. If implemented, student number controls will not control the overall number of students that enter higher education but aim to control growth of courses that offer poor outcomes for students."
        },
        {
            "text": "Our aim is to make sure that a student’s access to higher education is determined by their ability and not their background. That is why we have also announced measures to promote widening access."
        },
        {
            "text": "We want to make foundation years more affordable for students. A foundation year is an extra year before a degree course. It provides the basic knowledge and skills a student will need to progress onto the full course of study for a degree. They’re especially good for people who need a second chance to access high quality HE. We are therefore looking to cut the cost of Foundation Year study and will be consulting on reducing the tuition fee and loan limits for this form of study."
        },
        {
            "text": "On top of this, we will also be investing up to £75m to deliver a national state scholarship, which will support high achieving students from disadvantaged backgrounds across higher education, further education and apprenticeships and provide them greater access to opportunities to pursue their chosen path."
        },
        {
            "heading": 3,
            "text": "How will minimum eligibility requirements work? "
        },
        {
            "text": "We are consulting to ask what the public and the sector think about making access to student finance dependent on having either:"
        },
        {
            "text": "This is to ensure students aren’t being pushed into higher education before they are ready."
        },
        {
            "text": "Everyone over 16 without English or maths GCSE is supported and fully funded to continue studying these crucial subjects. We are also investing in improving English and maths teaching to support students who need to continue studying these crucial subjects. This includes the new £559m Multiply programme that will help transform the lives of hundreds of thousands of adults across the United Kingdom.  We will consider how we can continue to support students to retake exams to reach this level of attainment where needed at both GCSE and A-level (or equivalent) ."
        },
        {
            "text": "We are consulting on an exemption for people who do not meet a GCSE (or equivalent) minimum eligibility requirement but have got good A levels (or equivalent)."
        },
        {
            "text": "We’re also consulting on exemptions for certain student groups like mature students."
        },
        {
            "text": "The Government will make a final decision on minimum eligibility requirements after the consultation."
        },
        {
            "heading": 3,
            "text": "What do you mean by student number controls?"
        },
        {
            "text": "We are also consulting openly on possibly introducing targeted student number controls that could be used to constrain growth of courses that offer poorer outcomes. There wouldn’t be the same restrictions on courses with good outcomes for students. There would be no restrictions on the overall number of people going to university."
        },
        {
            "text": "This would effectively look to increase the number of graduates with degrees that lead to better outcomes for them, society, and economy – such as good employment prospects and better earnings."
        },
        {
            "heading": 3,
            "text": "Which courses would have controls? How would this be implemented?"
        },
        {
            "text": "We are consulting on how we should identify the highest quality courses that offer the best outcomes for students, society and the economy."
        }
    ]
}