{
    "url": "https://civilservicelocal.blog.gov.uk/2022/03/21/become-a-champion-driving-reform-and-modernisation-in-the-northwest/",
    "title": "Become a champion driving Reform and Modernisation in the Northwest",
    "authors": [
        "dianecoates"
    ],
    "categories": [
        "North West England"
    ],
    "pub_date": "2022-03-21T10:44:24+00:00",
    "content": [
        {
            "text": " "
        },
        {
            "text": "Looking for an exciting opportunity? So what's in it for me?"
        },
        {
            "text": "Supported by our Heads of Place Directors Paul Caldwell & Jo Bradshaw along with our Northwest SCS network as champions you will understand the future vision and help develop the Northwest civil service.  You will build a northwest community working across departments, drive communications and influence the priorities in the northwest.  You will be involved in key agenda's including initially Places for Growth (PfG) looking at how this will be supported in the Northwest, have input to talent & career options and how will focus in on diversity & inclusion."
        },
        {
            "text": "There will be a range of opportunities from volunteering to support one of our Modernisation and Reform projects, working with other civil servants to make things better or doing something as simple as ensuring that you’re thinking about Modernisation and Reform in your existing role."
        },
        {
            "text": "As a Champion, you will join a community that is made up of civil servants of all grades, locations and organisations.  You will be able to act as a sounding board for change initiatives and receive support for your own transformation projects. You will be exposed to the latest thinking across government and share best practice with other civil servants.  You will be able to make a genuine difference to the policies locally we develop and the services we provide our citizens."
        },
        {
            "text": "We really look forward to you getting involved! Please Sign-up here to be a reform champion and we will be in touch shortly!"
        },
        {
            "text": " A real opportunity to shape our future"
        }
    ]
}