{
    "url": "https://insidedio.blog.gov.uk/2022/03/21/breaking-the-bias-as-a-woman-in-defence/",
    "title": "Breaking the Bias as a woman in Defence",
    "authors": [
        "Kate Sharman"
    ],
    "categories": [
        "Inclusion",
        "Working at DIO"
    ],
    "pub_date": "2022-03-21T15:52:14+00:00",
    "content": [
        {
            "text": "Hi. I’m Kate Sharman, Assistant Head of the UK Defence Training Estate."
        },
        {
            "text": "The theme this year for International Women’s Day was Break the Bias and focused on how women experience working in a more male dominated area. My mother was the bread winner in the family, so I suspect that her influence shaped how I thought about the male: female role relationship and where my place in this was. I also went to an all-girls school, so again, only ever had females to learn from and with."
        },
        {
            "heading": 2,
            "text": "The value of being treated equally as a team member "
        },
        {
            "text": "I was fortunate that the first place that I worked in Defence had a sizeable number of women across all grades. So, I never thought about having to prove myself, just to be treated as equal. I just got on with the job, spent time getting to know the business, people and what they did and didn’t think that I should be treated any differently."
        },
        {
            "text": "This initial experience stood me in good stead. I moved posts every few years as my husband at the time was in the RAF so I continued to learn the job, treat others as equals and play my part in the team. I was also lucky (in my opinion) that when I did find myself as the only woman in the team, that I was treated as just that, one of the team with something to offer."
        },
        {
            "text": "This isn’t to say that I haven’t had comments like ‘you’re a woman, so you wouldn’t understand’. Those I treated as I found them, pushing back with humour, seeking to understand what apparently, I couldn’t. Equally there were times when I chose to ignore the comment, and the person, recognising a battle that couldn’t be won."
        },
        {
            "heading": 2,
            "text": "Encouragement and support enable women to flourish"
        },
        {
            "text": "We do need to encourage women to push themselves forward and I have always encouraged team members to achieve their best and helped them develop to be the best they can be, and that includes recognising the place of women-specific courses which help us recognise that there is a natural tendency to think we aren’t good enough and how to address that. I feel very proud of having played a part in the careers of at least one female 1* within MOD to date."
        },
        {
            "text": "The only area that I have ever found a problem with is the perception of flexible working. Once my older son started at primary school, I moved to a compressed 4 ½ day week so that I could have a link into the school at least one afternoon a week. My line managers are fine with this, but even now I still get the occasional comment about not being full time, or finishing early, which does make you feel as if you’re not pulling your weight. We need to recognise the value that flexible working gives us as a business, as the more comfortable women feel about being accepted for who they are, and what they produce, and not when, the more they will grow and deliver."
        },
        {
            "text": "Having been with DIO since its creation, I have not noticed any difference in how women are treated, and there has always been a strong focus on development. Perhaps I have continued to be fortunate, but I have only ever found support and acceptance from line managers and peers. Continue to engage, ask questions, do your job and be proud of who you are, and you will break the bias."
        }
    ]
}