{
    "url": "https://gfie.blog.gov.uk/2022/03/21/employers-need-to-focus-on-what-we-as-individuals-need-we-can-do-the-jobs-if-they-give-us-the-opportunities-and-the-right-support/",
    "title": "Employers need to focus on what we as individuals need - we can do the jobs if they give us the opportunities and the right support",
    "authors": [
        "Andrew Ashworth"
    ],
    "categories": [
        "Uncategorized"
    ],
    "pub_date": "2022-03-21T11:01:45+00:00",
    "content": [
        {
            "text": "Everyday brilliant work is being done across the Civil Service by colleagues who have joined us through a GFiE (Going Forward into Employment) life chance recruitment scheme. In today’s blog for World Down Syndrome Day we hear from two colleagues with a learning disability and the teams they work with in the Office for Health Improvement and Disparities and DEFRA."
        },
        {
            "text": "Rachael is working in the regional Health, Wellbeing and Workforce Team in Office for Health Improvement and Disparities, Yorkshire and the Humber as a People’s Champion.  "
        },
        {
            "text": "I have worked in many places as a volunteer and I often felt upset because I wasn’t given the chance in some of my jobs to learn any new skills.  I think it’s because people assume that people with learning difficulties cannot learn.  But we can learn if we are listened to and given the time to learn.  Employers need to focus on what we as Individuals need and realise that we can do the jobs if they give us the opportunities and the right support."
        },
        {
            "text": "I have been given the opportunity to have a paid job now and it has been amazing to start work as an advocate for people with learning difficulties.  It feels really good to have a paid job because I thought I’d never get one. I feel more positive about myself and am enjoying meeting new people and learning new skills I am happy that someone has believed in me and saw that I was a nice person and that I could do the job.  Having my own money means that I can pay my own bills and save for holidays and treats like everyone else. We should be given the same right to work as everyone else because we are capable and just need the right support and opportunities."
        },
        {
            "text": " "
        },
        {
            "text": "Chris Sharp is Workforce Development Lead (Yorkshire & Humber) in the Office for Health Improvement and Disparities (OHID)"
        },
        {
            "text": "We set up the scheme following an event which was organised by Public Health England in Yorkshire and the Humber which focused on the health inequalities of people with a learning disability.  The event highlighted employment disparities for people with a learning disability and a powerful presentation was made by the Down Syndrome Charity ‘Workfit’ on the amazing work they to support people with Down syndrome into employment.  As a team we decided to take action and set up a GFiE scheme to recruit via ‘Workfit’ someone that wouldn’t just do ‘a job’ within the team but would help us an organisation to advocate for the health improvement of people with learning disability.  I would strongly encourage all employers to seek an asset based approach to the employment of people with a learning disabilities and take direct action to look at where barriers to employment with you might exist."
        },
        {
            "text": "Victoria Musialek is Rachael’s mentor"
        },
        {
            "text": "We work with Rachael to maximise her abilities, taking opportunities for Rachael to learn and develop her skills and in turn we are enriched an organisation Rachael’s talent and passion for the role.  It’s been amazing to see Rachael’s confidence growing on our weekly catch up’s, they are the highlight of my week! "
        },
        {
            "text": "Emily Marlow works in the Sheffield Facilities Management team within DEFRA"
        },
        {
            "text": "I help the Facilities team with daily tasks such as, checking hand sanitiser stations to make sure it’s all stocked for staff to use in the office. I open post and deal with outgoing mail. I make sure all the little-used water outlets are flushed to prevent legionella. I input waste figures on the spreadsheet to keep track of how much the office is producing. I help in the monthly tasks which include checking the lift, panic alarms and emergency pullcords are working properly."
        },
        {
            "text": "I love working with the team in Sheffield and Rotherham. They are very helpful and answer any questions I may ask. Not necessarily all work related. LOL! I find everyone so easy to talk to if I have any problems or I’m feeling a little upset."
        },
        {
            "text": "I enjoy everything I do and try my best to make it fun! I love talking to people. Everyone I have met have all been really nice and friendly.   DEFRA have given me the opportunity to join the workplace and be a responsible adult earning my own money. I think that people need to be patient and explain things clearly, as understanding certain things may take some time to pick up. People with Down’s syndrome take longer to learn things in general. I think it’s really good to have been given the opportunity to work in a busy workplace and do the same work as everyone else in my team and to be treated normally!"
        },
        {
            "text": "Andy Mason is Emily’s Team Leader."
        },
        {
            "text": "The scheme brings together candidates from The WorkFit scheme with employers looking to fill vacancies.  WorkFit is one of the Life Chances schemes which DEFRA takes part in to help build a more diverse and inclusive workforce.  "
        },
        {
            "text": "When we first recruited our WorkFit colleagues, the staff from WorkFit helped us to assess our roles and their suitability for scheme. They also conducted training for our current staff to help us learn how to work best with candidates from the scheme."
        },
        {
            "text": "The inclusion of a WorkFit colleague has brought my team closer together, as well as improving the relationship between our team and our customers. The Down’s Syndrome Association were so supportive and made it really easy for us.  You can find out more about workfit at: https://www.dsworkfit.org.uk/"
        },
        {
            "text": " "
        },
        {
            "text": "For more information about GFiE life chance recruitment schemes across Government and to subscribe to our newsletter get in touch with us at GFIE@cabinetoffice.gov.uk subscribe to our blog and follow us on Twitter LINK "
        }
    ]
}