{
    "url": "https://healthcareleaders.blog.gov.uk/2022/03/21/how-the-nhs-is-supporting-nurses-to-return-to-practice/",
    "title": "How the NHS is supporting nurses to return to practice",
    "authors": [
        "Sajid Javid - Secretary of State for Health and Social Care, Department of Health and Social Care"
    ],
    "categories": [
        "Supporting NHS staff"
    ],
    "pub_date": "2022-03-21T13:59:00+00:00",
    "content": [
        {
            "text": "Nurses are the heart and soul of the NHS, and I’m so grateful for everything that you do in the most challenging times."
        },
        {
            "text": "I know we need to do more to help you continue to deliver this world-class care, and we have pledged to boost the NHS’s ranks with 50,000 more nurses by the end of this parliament."
        },
        {
            "text": "We are heading in the right direction, with over 27,000 more nurses now working across the NHS. My Department has been working with colleagues across the NHS to deliver on this commitment and make sure you are supported by the best and brightest talent. Because it’s only with the right staff in place that we can address the most pressing healthcare challenges that this country faces, including recovering from the Covid-19 pandemic and tackling the elective backlog."
        },
        {
            "text": "One way in which the NHS has been boosting its nursing workforce is through the Return to Practice (RTP) programme. Led by Health Education England, this programme provides a route for bringing valuable nursing and midwifery expertise back into the profession. Since its launch in 2014, nearly 8,000 nurses have returned to the NHS and 25 universities across England now offer RTP nursing and midwifery courses."
        },
        {
            "text": "I am hugely encouraged to see so many nurses choosing to dedicate their talents to a career in the NHS, including those who have rejoined the nursing workforce after time spent away from the profession."
        },
        {
            "text": "The RTP programme is just one example of the work that we are doing to meet the ambitious target of 50,000 nurses. Whether it’s a nursing colleague joining the NHS for the first time, or someone returning after a period away, I’m delighted that so many are dedicating their skill and commitment to caring for those who need it most."
        },
        {
            "text": "Case study"
        },
        {
            "text": "One trust that has done excellent work in this area is Oxleas NHS Foundation Trust, which has brought in more than 30 nurses through the RTP programme over the last 7 years."
        },
        {
            "text": "Lisa Newsum, Placement & Preceptorship Manager at Oxleas, says that one of the major benefits of the RTP programme is the range of experience and knowledge returning nurses bring with them."
        },
        {
            "text": "“RTP nurses who secure employment with the Trust tend to move into Band 6 roles quicker, which is testament to their previous experience. We find that our returning nurses bring with them a different skill set and perspective which really benefits our newly registered or younger staff”."
        },
        {
            "text": "“There are challenges, particularly for those who have rejoined after 10 or even 20 years off the register. New technology is obviously a factor in how quickly a returner gets back up to speed. But our preceptorship programme makes a huge difference in supporting RTP nurses transition back into the workplace”."
        },
        {
            "text": "Kodjo Sosuh is one such nurse who has returned to the nursing profession. After qualifying as a Mental Health Nurse in 1995, Kodjo stepped away from the NHS four years later to set up and manage a number of businesses in the care and nursing sector, before relocating to Ghana where he worked in national politics."
        },
        {
            "text": "In 2018, Kodjo returned to practice via the University of Greenwich’s RTP course and he is now a Ward Manager and Clinical Team Leader in Oxleas’ Forensic Directorate. He says:"
        },
        {
            "text": "“My interest in people’s wellbeing is one of the key factors in my successes both in and outside of nursing. Underpinning it all is my personal ethos - nursing was my first love when I completed my GCE A’ levels in 1990 and always will be. Once a nurse, always a nurse!”"
        },
        {
            "text": "Find out more about Return to Practice (nursing)"
        },
        {
            "text": "Returning healthcare professionals can attend RTP courses and undertake their clinical practice learning on a flexible or part-time basis. Some returners choose to undertake their courses either through an employer-led route which offers a salary (usually at Band 3) during their RTP journey and an offer of employment on completion. Others follow the non-employed route which is supported by HEE, with a stipend of £1,000 to the returner to help with costs related to undertaking the course."
        },
        {
            "text": "RTP clinical placements will offer flexible arrangements for the returner to complete their required clinical hours."
        },
        {
            "text": "For more information on how nurses can return to practice, visit Health Education England’s website here."
        }
    ]
}