{
    "url": "https://prisonjobs.blog.gov.uk/2022/03/21/i-love-working-as-a-community-payback-supervisor/",
    "title": "“I love working as a Community Payback supervisor.”",
    "authors": [
        "Ministry of Justice"
    ],
    "categories": [
        "Personal stories",
        "Probation",
        "Ways of working"
    ],
    "pub_date": "2022-03-21T10:14:35+00:00",
    "content": [
        {
            "text": "Community Payback (CP), previously known as Community Service, is an alternative to a prison sentence for people who have committed a crime. CP supervisors play a key part in supporting people on probation to do unpaid work to improve local communities and get their lives back on track. It’s varied, meaningful work with job security, a great pension and employee benefits. If you're a people person and looking for a rewarding career, find out more and take a look at our latest vacancies."
        },
        {
            "text": "Lisa, who’s been a Community Payback supervisor for 3 years, tells us what the job’s like and why she loves it."
        },
        {
            "text": " “I like a challenge and my job as a taxi driver wasn’t challenging enough. When I read the CP supervisor ad, I thought the work sounded interesting. I was used to dealing with people from all walks of life – including some exhibiting difficult behaviours – so I thought my experiences would give me a bit of a head start.”"
        },
        {
            "text": "“The thought of driving groups of people on probation to and from CP project sites and spending up to 7 hours a day supervising their unpaid work, didn’t faze me. But, at interview, I did ask what was in place to ensure my safety if anything should go wrong. And I was reassured that I’d get a GPS enabled device to call for help if needed.”"
        },
        {
            "text": "People skills are key"
        },
        {
            "text": "“In this job, you need to be able to read people – to assess situations and make quick decisions before they potentially escalate. We work with people who’ve committed offences, so know they’ve done bad things. But they’re not necessarily bad people. Many have troubled backgrounds, mental health issues, or struggle to express themselves and get easily frustrated. So, sometimes their conversations can get a bit ‘heated’. But, as supervisors, we get training to help us deal with a range of challenging behaviours. And 9 times out of 10, you can calm people down simply by taking them to one side and talking to them.”"
        },
        {
            "text": "“You need to be a people person, and how you get on as a CP supervisor has got a lot to do with how you come across to others. It’s important you don’t judge people. I treat everyone as a blank canvas, get to know them and gain their trust.”"
        },
        {
            "text": "“Respect works both ways. While they haven’t chosen to do Community Payback – and often resent being asked to do unpaid work – if people have done a good job, I think they deserve to hear it.”"
        },
        {
            "text": "A rewarding job"
        },
        {
            "text": "“Yes, CP is a punishment, but it’s also got a really powerful rehabilitation element. And it’s great to see individuals get something out of it. Often, people on my groups have never done a particular task or even worked before, and I love to see them learn new skills and grow in confidence. It could be as simple as learning how to use a hedge trimmer or wood working skills. It’s massively rewarding when people tell me how they’ve used what I’ve taught them in their private lives or gone on to find paid work as a result.”"
        },
        {
            "text": "“My job is so rewarding. I’ve finally found something I absolutely love doing. It’s so much more than just a job for me. I care about the people in my CP groups. I love to see the positive changes they’re making in their attitudes and behaviours. And I’m passionate about the impact CP can have on people turning their lives around, and the communities we work in.”"
        }
    ]
}