{
    "url": "https://competitionandmarkets.blog.gov.uk/2016/12/20/whats-it-like-to-run-a-care-home/",
    "title": "What’s it like to run a care home?",
    "authors": [
        "Douglas Cooper"
    ],
    "categories": [
        "Markets"
    ],
    "pub_date": "2016-12-20T12:32:57+00:00",
    "content": [
        {
            "text": "UK care and nursing homes have been in the news a lot recently, but amid all the conversation not much has been heard about what it’s like to provide such a complex service.\n\nGiven the much-debated pressures on the sector, and the extreme importance of caring for vulnerable elderly people, it's crucial that the market works as effectively as possible to deliver the best outcomes and serve those who need it."
        },
        {
            "text": "That’s why we’re examining it from all angles and across all of the United Kingdom. We want to check whether it’s working for all those who engage with it – be that residents and their families, the NHS or local councils or those, potentially like you, who work within it."
        },
        {
            "text": "We want to make sure we hear from as many people as possible to make the most informed judgement about how well the care homes market works. Please take a few minutes to read the criteria we're assessing below and if you have information to provide email carehomes@cma.gsi.gov.uk by 5pm on 16 January 2017."
        },
        {
            "heading": 2,
            "text": "Background"
        },
        {
            "text": "At the beginning of December, the CMA launched a market study into care and nursing homes for older people, looking into possible competition or consumer issues. The study aims to assess whether the market works well within the current funding and regulatory frameworks.  If not, we'll consider how it might be made to work better, and make recommendations to government, local authorities or regulators, as well as the industry, to achieve this. It's possible, if we find potential breaches of competition or consumer law, that we may launch further investigations into these."
        },
        {
            "text": "We'll be looking at a variety of issues including:"
        },
        {
            "heading": 2,
            "text": "Competition"
        },
        {
            "text": "One area of concern that we’re particularly interested in looking closely at is whether care home providers are incentivized to compete with each other to attract business and whether this helps improve value for money for customers. For example, do the ways self-funders choose care homes, or local authorities procure services, reward providers for trying to improve their services?  How well are potential residents able to assess different care homes given they're often making quick decisions under very difficult circumstances?"
        },
        {
            "text": "We'll also be considering whether any factors restrict care homes from competing and acting effectively. We'll look at whether anything makes it difficult for care homes to invest and grow and for a vibrant sector to flourish, and whether local authorities are helping the sector plan and develop. We've already heard from the sector about concerns around increasing costs and recruiting staff."
        },
        {
            "heading": 2,
            "text": "Using a care home"
        },
        {
            "text": "Following concerns raised by some charities, we've also asked residents and their representatives to tell us about their experiences of potentially unfair practices and contract terms, for example around:"
        },
        {
            "heading": 2,
            "text": "We want to hear your views and experiences"
        },
        {
            "text": "To allow us to consider these issues, we want to hear from all participants in the market to understand all these  issues, whether they occur and the reasons why participants act as they do and why the market works as it does."
        },
        {
            "text": "So we would particularly like to hear from care home providers.  Do you think the market for the provision of care home services is working well? What are the issues and how can these be addressed? Are any of the concerns that have already been raised well-founded, or not?"
        }
    ]
}