{
    "url": "https://digitaltrade.blog.gov.uk/2026/01/27/empowering-women-in-tech-dbts-focus-on-inclusion-and-innovation/",
    "title": "Empowering Women in Tech: DBT’s focus on inclusion and innovation ",
    "authors": [
        "Jen Hughes, Head of DDaT Resourcing",
        "Stephanie Chaytor, Head of Engagement and Strategic Adoption"
    ],
    "categories": [
        "People"
    ],
    "pub_date": "2026-01-27T11:15:09+00:00",
    "content": [
        {
            "text": "Leading the Way: How DBT is Winning for Women in Tech"
        },
        {
            "heading": 3,
            "text": "Jen Hughes"
        },
        {
            "text": "We were so happy and proud to be nominated and go on to win the award for best public sector employer at the recent Women in Tech Employer Awards. Winning is always great - but the work we’re doing behind the scenes is what really makes a difference to our organisation and everything we do."
        },
        {
            "text": "I lead the Digital, Data and Technology (DDaT) Recruitment here at the Department for Business and Trade (DBT), and we work with our experts to find the right people with the right skills. Balancing this with gaining a mix of perspectives and expertise is always a challenge. In the Digital and Data world, we face the added challenge that only 23% of people working in STEM roles in the UK are women, according to this PwC Women in Tech report. Whilst all forms of diversity are clearly important, the lack of women potentially in the recruitment ‘pool’ means we have to make a concerted effort on this specific area. Attracting more women into technology roles is a priority for DBT, not just because it’s the right thing to do, but because it makes us a stronger organisation."
        },
        {
            "text": "Diverse teams drive innovation, help us solve problems from different perspectives, and make DBT a more inclusive and supportive place to work. By increasing female representation in tech, we’re better able to understand and serve a wider range of users. We create an environment where everyone can thrive. This isn’t just about fairness, it’s a smart business move that supports creativity, improves our results, and helps us stay competitive in a fast-changing world."
        },
        {
            "text": "To get to this position, there are 3 key stages:"
        },
        {
            "heading": 2,
            "text": "Reaching women"
        },
        {
            "text": "We have worked to identify innovative ways to reach more women and raise awareness of our opportunities. This includes:"
        },
        {
            "text": "This lays the foundations for being in the right spaces where women can find us. They know we’re here and can recognise themselves working here."
        },
        {
            "heading": 2,
            "text": "Attracting women"
        },
        {
            "text": "Here in Digital and Data, we have built a recruitment process which best supports a diverse range of candidates, with the aim of increasing our female representation. This has included: "
        },
        {
            "heading": 2,
            "text": "Retaining women"
        },
        {
            "text": "However, it’s not about just hiring women, it’s about retaining them and supporting their career growth at all levels."
        },
        {
            "text": "A 2025 report on Diversity in UK Tech found that a lack of flexibility and cultural barriers are the leading factors pushing women out of technical professions."
        },
        {
            "text": "There are a range of benefits that address these structural and cultural barriers to make DBT a great place for women to work. We promote these on our job adverts and they include:"
        },
        {
            "heading": 2,
            "text": "Understanding what works"
        },
        {
            "heading": 3,
            "text": "Stephanie Chaytor"
        },
        {
            "text": "It will take time to evaluate these strategies to identify which are the most significant in attracting and retaining women in the workplace. Women’s experiences will vary greatly and for many there will be a range of benefits to our approach."
        },
        {
            "text": "For Anais Reding, Chief Digital Officer and Head of User Centred Design, there are 2 key factors. Firstly, the trend for more female leaders on the Executive Committee, with diverse skills, opinions and approaches. Secondly, a focus on holding meetings during core hours to support work-childcare balance:"
        },
        {
            "text": "“As a team, we start by understanding the constraints each of us has to work with, to find the best way to work as a team. When can we meet? When is it possible for us to do this in person?  This allows us to bring our best self to work and to build strong relationships for us as a team.” "
        },
        {
            "text": "Our Chief Data Officer, Sian Thomas, believes it is not one factor, but the sum of many small actions that remove barriers to women’s growth in the workplace."
        },
        {
            "text": "“The position we are in now is because of the hard work of many female leaders in Digital and Data DBT, and previously DIT. It's not one policy, but many small actions and decisions that have improved and embedded the culture that supports women in the workplace."
        },
        {
            "text": "“There is more work to be done but we know that by taking small actions we are removing barriers to make us a more inclusive group.  And yes, it benefits women, but also other often marginalised groups.”"
        },
        {
            "text": "By removing barriers to inclusion, we create an environment where skills, growth and development can be fully recognised and valued. When asked why she chose to join and stay in the Digital and Data team at DBT, Lead Developer Manager, Aishah Senin said:"
        },
        {
            "text": "“Joining this organisation mattered to me because merit truly comes first, allowing me to grow without having to prove anything beyond my capability. It’s a place where women can thrive knowing their skills and potential genuinely speak for themselves.”"
        },
        {
            "heading": 2,
            "text": "So, how are we doing?"
        },
        {
            "text": "Female representation in Digital and Data at DBT far surpasses the 23% quoted in the PwC Women in Tech Report. According to the Cabinet Office’s Civil Service Statistics, women make up 46% of the headcount in DBT’s Digital and Data team.   "
        },
        {
            "text": "Diversity is important with our Places for Growth Agenda and 2045 (31%) of DBT staff work outside of the main hub in London as of March 2025. This agenda has ensured we can target women across the UK.  "
        },
        {
            "text": "Our work continues, but our recent win at the Women in Tech employee awards was a huge boost for us and recognition of our hard work.  "
        },
        {
            "text": "Our people are everything and having more diversity leads to better outcomes. As we look forward to 2026, we’ll be building on our success in 2025 and ensuring DDaT at DBT remains a leader in this space. Inclusivity means everyone wins and we’re proud to be an award winning DDaT team paving the way for diversity and inclusion.  "
        },
        {
            "text": "If you’re looking to attract more diverse candidates, please do use the ideas I’ve shared above. Share your own ideas below or any resources we can use to do better. This is a journey we’re all on. "
        }
    ]
}