{
    "url": "https://mhclgmedia.blog.gov.uk/2026/01/27/housing-secretary-rallies-sector-at-housing-and-infrastructure-roundtables/",
    "title": "Housing Secretary rallies sector at housing and infrastructure roundtables",
    "authors": [
        "mhclgpress"
    ],
    "categories": [
        "Housing"
    ],
    "pub_date": "2026-01-27T17:01:47+00:00",
    "content": [
        {
            "text": "This week the Housing Secretary and Housing Minister, along with the Chancellor and the Chief Secretary to the Treasury, convened the country’s biggest housebuilders including Vistry, Permission, Taylor Wimpey, and Barratt Redrow to seek their views on proposed planning reforms and how the housing market is looking. Government ministers also met major infrastructure delivery providers, including Arup, East West Rail and Scottish Power."
        },
        {
            "text": "They pointed to early signs of recovery, with housing starts up 18% compared to the previous year, whilst government has taken 33 decisions on nationally significant economic projects so far – over 70% more than at the same point last Parliament and putting delivery firmly on track for 150 decisions this Parliament.But the Housing Sec stressed that while recovery is underway, government and industry alike cannot afford to let a generation down and must rise to the challenge together. Looking with optimism to what 2026 can bring for the sector, he urged everyone to meet the government’s level of urgency and ambition."
        },
        {
            "text": "He highlighted the government has acted with urgency – securing Royal Assent for the Planning and Infrastructure Act and revamping the National Planning Policy Framework. These latest reforms built on earlier actions to release grey belt land, restore and raise housing targets, allocate billions across social and affordable housing, and establish the National Housing Bank."
        },
        {
            "text": "It comes as the government enters the next phase of sweeping pro-growth and pro-supply reforms, building on the planning shake-up in December 2024, which drove the OBR to forecast the highest housebuilding levels in over 40 years and adding £6.8 billion to the UK economy by 2030."
        },
        {
            "text": "Press Association and the i Paper reported ahead of the roundtables earlier this week highlighting the Housing Sec will make clear neither the government nor industry can afford to be complacent about the housing crisis."
        },
        {
            "text": "Attendees:Housing roundtableOrganisationTaylor WimpeyVistryRoyal Town Planning InstituteMaceBarratt RedrowLandsecHome Builders FederationMount AnvilBritish LandGraingerNational Housing FederationPeabodyUrban & CivicFederation of Master BuildersPersimmonThakehamInfrastructure roundtableOrganisationSkansaMott MacdonaldEast West RailScottish PowerBalfour BeattyRenewable UKNational Infrastructure Planning AssociationEnergy UKNational GridMaceWater UKInstitution of Civil EngineersArupHSF Kramer"
        },
        {
            "text": "Dr Janet Young, Director General at the Institution of Civil Engineers said:  "
        },
        {
            "text": "\"The government made excellent progress last year with the establishment of NISTA and the publication of the 10 Year Infrastructure Strategy.  "
        },
        {
            "text": "\"Passing the Planning and Infrastructure Act is another step in the right direction, but legislation will only take us so far. Delivering the reforms will require sustained effort from government and industry. We must work together to recruit and retain talent, address skills gaps, and prioritise investment. "
        },
        {
            "text": "\"The Institution of Civil Engineers will continue to share its members insights and expertise to help shape policy and support delivery.\" "
        },
        {
            "text": "Darragh Hurley, Managing Director at Mount Anvil said: "
        },
        {
            "text": "“Mount Anvil loves the energy, determination and action that this government is bringing to building more homes. This is a welcome and much needed change in a very tough market. Their willingness to engage, listen and take decisive action, like the Planning and Infrastructure Act and London Emergency Measures will mean more families have a place to call home.” "
        },
        {
            "text": "Catherine Howard, Partner at Herbert Smith Freehills Kramer LLP said: "
        },
        {
            "text": "\"It's great to be part of the ongoing discussion about how to accelerate the consenting of UK infrastructure. Successive Governments have talked about cutting red tape. This Act really delivers on that promise. Developers and investors are already shrinking their project programmes thanks to this Act. Applications for nationally significant infrastructure will now be made earlier and consented faster. The removal of years of onerous pre-application admin and lengthy reports [in favour of meaningful engagement] is particularly welcome, as is the creation of easier access rights for vital surveys, and the power for developers to opt for the quickest consenting route for their project. Beyond these changes and the many others made by the Act, the pro-development attitude of this Government is in itself having a marked impact on investor sentiment towards greenfield development in the UK.\" "
        },
        {
            "text": "Tom Wilcock, Arup's Managing Director for UK, India, Middle East and Africa said:  "
        },
        {
            "text": "\"The Planning and Infrastructure Act marks a major milestone that will aid speeding up the building of the critical infrastructure our country needs. With measures like streamlining major project consenting, the reintroduction of strategic planning and an enhanced role for development corporations, the Act will support jobs and homes, and accelerate growth across the UK. "
        },
        {
            "text": "“This is just the beginning of how we can deliver infrastructure greener, faster and cheaper in this country. Having supported the Government in developing the reforms to date, we are looking forward to working with Ministers, clients and partners to implement the Act and build on its success with wider reforms to help the economy grow even quicker. Today’s roundtable is an exciting start to that next phase of the discussion.” "
        },
        {
            "text": "Kate Henderson, Chief Executive of the National Housing Federation, said: "
        },
        {
            "text": "“I am delighted to have been part of this important discussion with the Chancellor, the Housing Secretary, the Housing Minister, and other key partners about how the government's planning reforms and ambitious new £39 billion Social and Affordable Homes Programme will help housing associations to build the affordable homes families across the country need.  "
        },
        {
            "text": "\"It was clear from the discussion that the government understands the foundational difference a secure and affordable home makes to people’s lives.  "
        },
        {
            "text": "“Housing associations are committed to working in partnership with the government to deliver on our shared ambition of a decade of renewal for social housing.” "
        },
        {
            "text": "Tom Carpen, NIPA Board Chair said: "
        },
        {
            "text": "\"The Planning and Infrastructure Act is a crucial piece of legislation and, along with wider reforms, we believe it should unlock the pace and quality of infrastructure delivery. The next challenge is for practitioners to embrace the opportunities the Act creates, as well as all public bodies. The National Infrastructure Planning Association brings together expert practitioners passionate about planning and delivering infrastructure in the national interest. It was therefore a privilege to bring our collective expertise to the ministerial roundtable and reiterate our commitment to working with government to drive better national infrastructure planning and delivery, and to make the most of the new Act in its implementation.\" "
        },
        {
            "text": "Will Gallagher, Chief Strategy Officer at EWR Co who attended the meeting, said: “We had a really productive discussion about how we implement the new Planning and Infrastructure Act to maximise its benefits - both to speed up the opening of EWR by making the planning process simpler and quicker, and also to make sure local communities get high quality ongoing engagement rather than just a single statutory consultation. As EWR is one of the first projects to operate under the new legislation, ministers were keen to hear about our progress.”"
        }
    ]
}