{
    "url": "https://marinescience.blog.gov.uk/2026/01/27/irish-sea-nephrops-survey-marking-30-years-of-collaboration/",
    "title": "Irish Sea Nephrops Survey: Marking 30 years of Collaboration",
    "authors": [
        "fionavogt1"
    ],
    "categories": [
        "biodiversity",
        "Field Research",
        "Fisheries"
    ],
    "pub_date": "2026-01-27T14:32:23+00:00",
    "content": [
        {
            "text": "Nephrops (Nephrops norvegicus), more commonly called langoustines, Dublin Bay prawns or just prawns, are a commercially important shellfish species, with numerous fisheries around the Great Britain and Ireland.  Underwater Television, or UWTV surveys have formed the basis of assessing the status of Nephrops stocks since the 1990s.  Despite significant development of technology over the same period, the basic process for carrying out these surveys has remained largely unchanged to the present day."
        },
        {
            "text": "UWTV surveys were originally developed in the 1980s by the Department of Agriculture and Fisheries for Scotland (DAFS), with their first survey carried out by the then newly created Fisheries Research Services (FRS) in 1992, continuing ever since and now being carried out by Marine Scotland.  Cefas, then the Directorate of Fisheries Research, conducted its first UWTV survey in 1996. The Marine Institute (MI), Republic of Ireland, commenced in 2002, shortly following by Agri-Food and Biosciences Institute (AFBI), Northern Ireland, in 2003 and the approach continued to be adopted by other institutes.  Now, well over 20 discreet Nephrops fisheries areas off Iceland and Scandinavia down to the Bay of Biscay and Mediterranean are regularly surveyed by a range of organisations across Europe."
        },
        {
            "text": "The Research Vessel (RV) Corystes is a research vessel with a distinguished legacy in marine science. Over four decades, she has played an important role in supporting marine and fisheries research, contributing to our understanding of the marine environment around the British Isles.  She has been conducting UWTV surveys since 1996, firstly for Cefas, then, from 2006 for AFBI in Northern Ireland.  AFBI continue to lead and co-ordinate joint surveys, currently conducted together with scientists from Cefas and the Marine Institute.  The three organisations work together on the Corystes towards a common goal, to estimate the  number of Nephrops in the two main fishing areas of the Irish Sea.  The exchange of knowledge between organisations is key to successfully surveying these challenging fishing areas."
        },
        {
            "text": "This collaboration continues, even when the survey is finished.  AFBI, Cefas and MI join UK and other European scientists at the International Council for the Exploration of the Sea (ICES), where survey results and associated stock assessments are scrutinised, to ensure consistency of approach.  This allows the delivery of robust scientific advice to assist policy makers in the UK, EU and elsewhere in Europe in managing their Nephrops fisheries."
        },
        {
            "heading": 2,
            "text": "Underwater Television surveys"
        },
        {
            "text": "So, what goes into a Nephrops survey and the processing of data collected?"
        },
        {
            "text": "The first job is to identify where to survey.  Fortunately, this is relatively straight-forward for Nephrops.  Nephrops are burrowing decapod crustaceans, sharing the same family as larger European lobsters.  Much like many terrestrial animals, they excavate and spend much of their lives in burrows, emerging only to forage and find a mate.  Unlike European lobsters that prefer rockier habitat, Nephrops prefer softer sediment types to construct their burrows, typically in mud or muddy sand.  Based on a combination of survey work to identify the sediment type and using fishing activity data, we can estimate the areas where the Nephrops live and then survey those locations."
        },
        {
            "text": "Muddy habitat is ideal for UWTV survey work as we can deploy a sledge system to survey the seabed.  This allows us to obtain very consistent video footage, because we can keep the camera on the sledge at a fixed height above the seabed, even if the vessel above is moving around.  The camera sledge does need to have sufficient lighting to illuminate the seabed for us to see the burrows clearly.  It also has additional instrumentation to measure environmental variables such as temperature and clarity of the water.  Finally, there is long communication cable, to bring the live video footage to the computers and scientists aboard the ship.  All this gear makes the sledge relatively heavy, meaning we need a relatively large vessel to deploy and recover the sledge."
        },
        {
            "text": "This is where the RV Corystes comes in as one such vessel.  Measuring approximately 53 metres in length and weighing around 865 tonnes, the RV Corystes was constructed as a state-of-the-art research platform. She is equipped with advanced laboratories, winches, trawl gear, and hydrographic instruments. Her robust design allows for research activities in challenging sea conditions, making her suitable for a variety of scientific missions:  oceanography, environmental monitoring and, of course, fisheries surveys."
        },
        {
            "text": "The name \"Corystes\" is derived from Corystes cassivelaunus, a type of crab found in the North Sea, reflecting her scientific mission.  Corystes was built in 1988 by Ferguson Shipbuilders Ltd, located in Port Glasgow, Scotland. Commissioned by the British government for the Ministry of Agriculture, Fisheries and Food (MAFF), later Defra and Cefas, before being transferred to Northern Ireland to be operated by AFBI from 2006.  The vessel was designed specifically for research purposes and over the years, she has undergone several refits to update her equipment and to comply with evolving safety standards.  Despite her age, these upgrades have ensured she remains at the forefront of marine research."
        },
        {
            "text": "At start of each of the prescribed locations for a survey, the ship’s crew will position the vessel into the prevailing sea current.  This is done to ensure maximum manoeuvrability of the ship and clarity of the camera footage being obtained.  The sledge is then towed over the seabed at a fixed speed and footage of the seabed and features is recorded.  Footage in the Irish Sea can be of variable quality, due to prevailing sea and weather conditions or due to recent fishing activity.  For this reason, the footage is checked immediately, and a survey station may need to be repeated if conditions are not quite right."
        },
        {
            "text": "Next, it’s over to the counting teams.  Their job is to look through all the footage obtained and identify the Nephrops burrows.  This process isn’t as simple as it sounds.  Firstly, animals other than Nephrops burrow into the sediment.  Part of the skill needed for counting is being able to work out which burrows are those of a Nephrops and which belong to other burrowing species.  Secondly, a burrow system may have multiple entrances and exits.  We don’t want to count a burrow system twice so, distinguishing which entrances and exits form a single burrow system is very important.  Training is key to consistent counting.  Teams of counters typically have many years of experience, with each Nephrops area being subtly different.  All counters conduct training on an annual basis to make sure that they are counting in line with expectations for a particular area."
        },
        {
            "text": "This is where the Corystes survey is quite unique.  Here, scientists from the 3 organisations: AFBI, Cefas and MI, are counting as a single group, having the opportunity to train and work directly with their international colleagues.  As such, counters bring their experience of several other Nephrops surveys and areas to the Corystes and, equally, can take experience gained away to increase consistency of counting over the entire Nephrops survey programme."
        },
        {
            "text": "Footage is counted at least twice, each time with a different counter.  After two counts, we compare the counts obtained.  All going well, the counts are quite similar and show general agreement, allowing the station to be ‘passed.’  If not, the footage is examined again, often with a third counter and a process followed to determine which of the counts can be ‘passed.’  Extra effort may be required for several reasons, for instance where there are many other burrowing species present in the footage, or where visibility is more limited.  Where visibility is particularly limited, the counters may request a station to run again."
        },
        {
            "text": "Counting is usually all done and checked while at sea.  Processing then uses these counts, along with station details, to estimate a density of Nephrops burrows at each of the stations.  Further processing combines all the burrow density figures.  We can then produce an estimate of the total number of burrows for the entire area.   This then directly translates to a total number of adult Nephrops over the area."
        },
        {
            "heading": 2,
            "text": "Assessing the results"
        },
        {
            "text": "Survey results are scrutinised further onshore.  Natural variation in Nephrops populations is something that we generally expect, however large changes are quite unusual.  Where we see a large change, we may go back and look again at our findings to verify that result.  All results will be presented at two ICES working groups, firstly the Working Group for the Assessment of Nephrops Stocks (WGNEPH) and secondly at the Working Group for Nephrops Surveys (WGNEPS).  These groups are formed from members across Europe and both may make recommendations for additional work to be carried out before a survey result is accepted.  At WGNEPH, the total number of Nephrops is combined with an average size of each individual (obtained from port and at-sea sampling) to produce an estimate of stock size.  Stock assessors will use this estimate of stock size as a basis for setting catch advice, which will ultimately be used by policy makers in quota setting at annual EU and UK (quota setting at annual EU and UK ) meetings."
        },
        {
            "heading": 2,
            "text": "Next steps"
        },
        {
            "text": "Confidence in this method of conducting marine surveys is high, particularly given the level of scrutiny by ICES.  Despite technological advancements, some UWTV surveys remain unchanged for long periods and there is a value to consistency when explaining changes in Nephrops abundance between years.  Camera technology continues to evolve and has led to higher quality imagery being collected, making identification (or otherwise) of Nephrops burrow systems more reliable.  Focus at the moment is augmenting the work of counting teams using AI.  Machine learning tools can already be used to identify burrow entrances.  However, work is underway to identify burrow systems (linking together multiple entrances) as well as to measure burrow systems.  One aim of this work is to eventually train an ‘AI counter’ able to act as a common reference point for current and future counters,  In the longer term there, we aim to gain better insight into in-year effects on counting, factors affecting burrow excavation and fluctuations in physical factors and how they may affect the Nephrops themselves. "
        }
    ]
}