{
    "url": "https://ukhsa.blog.gov.uk/2026/01/27/nipah-virus-what-is-it-where-is-it-found-and-how-does-it-spread/",
    "title": "Nipah virus: what is it, where is it found and how does it spread?",
    "authors": [
        "Blog Editor"
    ],
    "categories": [
        "Travel"
    ],
    "pub_date": "2026-01-27T15:47:51+01:00",
    "content": [
        {
            "text": "Nipah virus (NiV) is a serious infectious disease that periodically causes outbreaks in parts of Asia. While the risk to most people remains very low, understanding this virus is important if you are planning to travel to one of the areas where it circulates. No cases have ever been found in the UK."
        },
        {
            "heading": 2,
            "text": "What is Nipah virus?"
        },
        {
            "text": "Nipah virus is a zoonotic virus, meaning it can be spread from animals to humans. It can also be transmitted through contaminated food or directly from human to human. It was first identified in 1999 during an outbreak among pig farmers in Malaysia and Singapore."
        },
        {
            "text": "The natural hosts of the virus are fruit bats, particularly those of the Pteropus genus.  There is evidence that Nipah virus can infect other animals, including pigs, dogs, cats, goats, horses and sheep."
        },
        {
            "heading": 2,
            "text": "What are the symptoms?"
        },
        {
            "text": "The incubation period (the time between becoming infected and symptoms appearing) is typically 4 to 21 days, though longer periods have occasionally been observed."
        },
        {
            "text": "Symptoms usually begin with the sudden – onset of non-specific flu-like illness or fever. Pneumonia and other respiratory problems may also develop."
        },
        {
            "text": "The most serious complication is encephalitis (inflammation of the brain) or meningitis, which typically develops 3 to 21 days after the initial illness begins. This is the hallmark of Nipah infection and is associated with a very high mortality rate."
        },
        {
            "text": "It is estimated that between 40 and 75% of people infected with Nipah virus will die. Some survivors may be left with lasting neurological difficulties, including persistent seizures and personality changes. In rare cases, the virus can reactivate months or even years after the initial infection."
        },
        {
            "heading": 2,
            "text": "Where is Nipah virus found?"
        },
        {
            "text": "Human outbreaks of Nipah virus have only been identified in South and South-East Asia, primarily in rural or semi-rural locations. Countries with previously reported outbreaks include:"
        },
        {
            "text": "While antibodies against Nipah virus have been detected in bat species across Asia, Ghana and Madagascar, human outbreaks have not occurred outside the South and South-East Asian region. Find details of the latest news on Nipah virus outbreaks on the TravelHealthPro website."
        },
        {
            "heading": 2,
            "text": "Has Nipah virus ever been found in the UK?"
        },
        {
            "text": "No cases of Nipah virus have ever been reported in the UK."
        },
        {
            "heading": 2,
            "text": "How is Nipah virus transmitted?"
        },
        {
            "text": "While human infections can arise through direct contact with an infected animal and their secretions, many infections result from the consumption of fruits or fruit products (such as raw or partially fermented date palm juice) contaminated with the poo, urine or saliva of infected fruit bats. Date palm juice is often known as Khejur Juice when raw and as Tari or Khajuri Tadi when fermented."
        },
        {
            "text": "Person-to-person spread is possible through close contact with an infected person or their body fluids. This has been documented in Bangladesh and India, most commonly among family members and close contacts caring for infected patients. Those with respiratory symptoms may pose a transmission risk."
        },
        {
            "heading": 2,
            "text": "How do you treat Nipah virus?"
        },
        {
            "text": "Currently, there is no proven specific treatment for Nipah virus infection, and no preventative vaccine is licensed for use."
        },
        {
            "text": "Treatment is limited to intensive supportive care for those with severe infections."
        },
        {
            "text": "Several experimental therapies are in development or in early clinical trials, including monoclonal antibodies, fusion inhibitors, and novel antivirals. UKHSA and The Pirbright Institute are supporting the development of vaccines against henipavirus – a genus (or group) of viruses including Nipah virus. The World Health Organization has listed Nipah virus as an epidemic threat requiring urgent research and development action, including vaccine development."
        },
        {
            "heading": 2,
            "text": "How can you prevent Nipah virus spreading?"
        },
        {
            "text": "For those travelling to endemic areas, prevention focuses on avoiding exposure:"
        },
        {
            "text": "In healthcare settings, strict infection prevention and control measures are essential, including contact, droplet and airborne precautions for both suspected and confirmed patients."
        },
        {
            "heading": 2,
            "text": "What should I do if I'm concerned?"
        },
        {
            "text": "The risk for tourists visiting endemic countries is very low if standard precautions are followed. The risk may be higher for those participating in local practices such as date palm sap collection and consumption."
        },
        {
            "text": "If you develop symptoms while overseas in an endemic area, seek advice from a health professional immediately. If you develop symptoms after returning to the UK, contact your healthcare provider and make sure to mention your recent travel history."
        },
        {
            "heading": 2,
            "text": "What is UKHSA’s role in addressing the risks of Nipah virus?"
        },
        {
            "text": "In March 2025, we designated Nipah virus as a high priority pathogen - one that urgently needs investment in developing tests, treatments and vaccines. This is because of its high fatality rate and the fact that there are currently no approved vaccines or specific treatments available."
        },
        {
            "text": "Our UK Public Health Rapid Support Team is a key international partner in infectious disease outbreak detection, prevention, preparedness and response. In Bangladesh, where Nipah virus outbreaks occur regularly, we’re working with local partners to research a model that has worked well in other contexts and deliver an education programme in local schools. By teaching children about Nipah virus and how to avoid infection, they can share this knowledge with their families - helping to protect entire communities."
        }
    ]
}