{
    "url": "https://mhclgmedia.blog.gov.uk/2026/01/27/own-a-flat-or-looking-to-buy-heres-what-the-new-leasehold-shake-up-means-for-you/",
    "title": "Own a flat or looking to buy? Here’s what the new leasehold shake-up means for you 💸",
    "authors": [
        "mhclgpress"
    ],
    "categories": [
        "Housing"
    ],
    "pub_date": "2026-01-27T07:40:35+00:00",
    "content": [
        {
            "text": "Millions of homeowners – mostly flat owners – will save significant cash thanks to a new major shake‑up of the leasehold system. If you own a flat or are looking to buy one, you probably know about the excessive charges you may have to pay on top of your mortgage and other bills. Ground rents are often inescapable because they have to be paid under the terms of your lease. Some landlords charge a substantial amount for no clear service in return. The Prime Minister has announced huge changes to put this to an end – a turning point for millions of homeowners whose lives are plagued by these charges. Here is what the government is doing to protect your pockets from unfair charges: 1. Ground rent will be CAPPED – no more spiralling bills Many flat owners pay ground rent that can shoot up a lot. You may not even realise that it is going to increase until you get the bill. Ground rent is a payment to the owner of the land your flat sits on. That’s being stopped. - If you have a ground rent it will be capped at £250 a year. - And after 40 years it will be cut to a peppercorn, so nothing is paid. - This will apply to most residential leasehold contracts that were entered into before July 2023, meaning big savings and no nasty financial surprises. 2. New leasehold flats will be banned This is huge. In future, developers will no longer be allowed to sell new flats as leasehold (except in limited cases). Instead, new flats will be built as commonhold – meaning you own the ground your flat is built on and the overall building with your neighbours. This is a fairer system used widely in other countries, giving flat ownership a whole new meaning (because it’s actually all yours!). The government is consulting on the details, including trickier cases where exemptions might be needed and timing arrangements to ensure the transition to commonhold is smooth. Moving to a commonhold system will mean: - You own your flat outright - You and your neighbours jointly own and run the building, you might hire a managing agent to look after the property, but they will be accountable to you - There’s no landlord above you charging more than needed - You get a proper say over spending, repairs and local rules 3. Existing leaseholders will get the right to switch to commonhold If you already own a leasehold flat, you won’t be left behind. The government will make it much easier for existing leaseholders to convert to commonhold, so they benefit too. 4. You can’t lose your home over tiny debts anymore At the moment, some people can lose their home for owing as little as £350 in fees. This extreme rule called forfeiture will be scrapped. A new, fairer system will be introduced and replaced with a new court-led process with strict safeguards for more extreme cases. 5. Service charges and building costs will be more transparent These leasehold reforms build on changes already coming that will: - make service charge bills clearer and easier to understand - help people challenge unfair costs - force landlords and their managing agents to be more accountable - and reduce mystery fees or unexplained hikes. 6. More power for freehold homeowners against excessive estate charges – a big crackdown on ‘fleecehold’ estates  If you own a freehold house on a privately managed estate (often new builds), you might still be paying extra fees for the upkeep of parks, roads and shared areas, even though you already pay council tax. This is often called ‘fleecehold’ and nearly two million households are affected. We want to reduce the use of this approach going forwards, putting an end to its unjustified use for the majority of new homes. The government is also consulting on recently announced major reforms, meaning: ❌ The harsh 100‑year‑old law used to punish homeowners will be banned Right now, missing a payment (even as low as £100) can mean losing access to your home or even having a lease slapped onto it. This draconian power will be scrapped. 📄 Standard, clearer bills so you can challenge unfair charges Homeowners will get simple, standardised information about estate charges to help them spot unreasonable fees and challenge them. No more mystery bills or surprise add‑ons. 👥 A new ‘substitute manager’ if the current one fails If a management company isn’t doing its job - for example, leaving roads unmaintained or green spaces neglected - a tribunal will be able to appoint a new manager to take over. This gives residents proper backing when things go wrong. 🏘️ Government will look at making resident‑controlled management the default The government is exploring whether residents should run their estates themselves, instead of being forced to rely on a private management company with no accountability. See the full press release here. "
        }
    ]
}