{
    "url": "https://competitionandmarkets.blog.gov.uk/2026/01/27/unshackling-leaseholders-from-problematic-ground-rents/",
    "title": "Unshackling leaseholders from problematic ground rents",
    "authors": [
        "Emma Cochrane"
    ],
    "categories": [
        "Consumer protection"
    ],
    "pub_date": "2026-01-27T15:01:24+00:00",
    "content": [
        {
            "text": "The government has set out plans to introduce a cap on existing ground rents to £250 a year, changing to a peppercorn after 40 years, in another major step towards making sure all leaseholders get the fair deal they deserve.These proposals should spell an end to rising ground rent fees and help people struggling with high ground rents – particularly when many are already grappling with costs elsewhere.Since 2019, we have been tackling the sale and use of doubling ground rent terms, which saw people trapped in homes they couldn’t sell or mortgage, and their property rights at risk if they fell behind on payments.Our investigation, involving leading housing developers and businesses who purchased freeholds from these firms, led to landmark changes which freed over 21,000 households from problematic leasehold issues."
        },
        {
            "text": "This included:"
        },
        {
            "text": "While we were successful in helping thousands of leaseholders get out of doubling ground rent terms, problematic ground rents continue to be a major issue for homeowners across the country. Government intervention in this area is likely to be the only way to achieve an effective, long-lasting solution.High ground rents can cause a wide range of problems, even where they don’t double. During our investigation, we saw no persuasive evidence that ground rent was either legally or commercially necessary, or that consumers received anything in return for paying these annual fees. But we also recognise that changes to ground rents have implications for freeholders."
        },
        {
            "text": "Ultimately, we believe it is right that the government has put forward proposals which seek to strike a balance between the interests of both leaseholders and freeholders."
        }
    ]
}