{
    "url": "https://naturalengland.blog.gov.uk/2026/01/27/why-nature-close-to-home-matters-evidence-from-the-people-and-nature-survey/",
    "title": "Why Nature Close to Home Matters: Evidence from the People and Nature Survey ",
    "authors": [
        "Lydia Dixon"
    ],
    "categories": [
        "Connecting People with Nature",
        "Development",
        "Green Infrastructure",
        "Mental health and wellbeing",
        "Natural England",
        "Nature",
        "Parks, trails and nature reserves"
    ],
    "pub_date": "2026-01-27T16:59:25+00:00",
    "content": [
        {
            "text": "By Lydia Dixon, People and Nature Deputy Director, Natural England "
        },
        {
            "text": "A daily dose of nature boosts physical and mental health, strengthens communities, and can save the NHS millions every year. These benefits are often greatest for people in nature-deprived communities, who gain disproportionately from access to safe, high-quality green spaces. When people feel connected to nature and understand its value, it becomes a vital and cared‑for part of a healthy society. "
        },
        {
            "text": "This principle sits at the heart of Natural England’s new strategy, Recovering Nature for Growth, Health and Security. Our ambition is to build nature into everyday life, so people can support, access and benefit from nature wherever they live. "
        },
        {
            "text": "That ambition aligns closely with the Environmental Improvement Plan’s commitment that everyone should live within a 15-minute walk of green or blue space. The “15-minute to nature” goal recognises that access to nature is not a luxury - it is essential public infrastructure, every bit as important as transport, housing or schools. "
        },
        {
            "heading": 4,
            "text": "Where we are now: what the evidence tells us"
        },
        {
            "text": "Our new report from the People and Nature Survey and the National Centre for Social Research, Local Greenspaces in Everyday Life, explores in detail at how people use their local green spaces and who benefits from them. It provides one of the clearest national pictures yet of how access to everyday nature is distributed, and where inequalities persist. "
        },
        {
            "text": "Most people in England (73%) live within a 15-minute walk of a green space. But more than a quarter (27%) do not. Crucially, this lack of access is not evenly shared. "
        },
        {
            "text": "Black and Black British adults are significantly less likely than White adults to live within five minutes of a green space. Only around a quarter (26%) of adults in the most socially deprived areas have a green space close to home, compared with well over a third (38%) in the least deprived areas. More than a third (36%) of adults whose health conditions limit daily life live more than 15 minutes away. "
        },
        {
            "text": "The research also shows that proximity alone is not enough. People who live more than 15 minutes away have around 60% lower odds of visiting green spaces frequently – but those who perceive their local green spaces as unsafe, poorly maintained or inaccessible are just as unlikely to use them, even when they are nearby. This suggests that quality matters as much as quantity. "
        },
        {
            "text": "The evidence also highlights the different roles that different places play. Local green spaces support everyday activities such as walking, relaxation and socialising, while larger “destination” landscapes, like national parks, offer opportunities for longer, memorable visits that deepen people’s relationship with nature. "
        },
        {
            "text": "Together, these findings highlight three priorities: tackling inequalities in access, investing in quality as well as quantity, and planning a joined-up network of nature that supports everyday use close to home while also improving access to larger destination landscapes further afield. "
        },
        {
            "heading": 4,
            "text": "How we will get there: turning ambition into action "
        },
        {
            "text": "Delivering the 15-minute commitment will require long-term, coordinated action across government, local authorities, communities, charities, developers and land managers. Natural England is already playing a central role in making this happen.  "
        },
        {
            "text": "In towns and cities, our Green Infrastructure Framework is helping planners and developers design places where nature is woven into everyday life, rather than added as an afterthought. Through the Nature Towns and Cities initiative, we are supporting urban areas to create greener streets, cooler neighbourhoods, better air quality and accessible nature-rich spaces where people live, learn and work. "
        },
        {
            "text": "Beyond our towns and cities, we are working with partners to improve access to some of England’s most iconic places. Through the Protected Landscape Partnership and the delivery of high-quality National Trails – including the King Charles III England Coast Path and the Coast to Coast route, both launching this spring - we are helping more people experience nature further afield, in ways that are inclusive and sustainable.  "
        },
        {
            "text": "We are also embedding nature across health and education – from leading the adoption of green social prescribing, to supporting organisations including schools and hospitals to manage the land they look after for both people and nature. "
        },
        {
            "heading": 4,
            "text": "A greener, fairer future "
        },
        {
            "text": "Nature close to home is essential infrastructure for healthy lives and thriving communities. This new evidence helps us target action where it is most needed, while our strategy provides a clear pathway for turning ambition into delivery. "
        },
        {
            "text": "Our commitment to action underpinned by evidence is highlighted in our new Science, Evidence and Analysis Framework, which sets out how we will invest in science, data and digital innovation over the next five years to ensure our work delivers measurable outcomes for both people and nature. "
        },
        {
            "text": "Achieving a future in which everyone can benefit from nature every day will require sustained ambition, partnership and persistence, but it is essential for a healthier, fairer England. "
        },
        {
            "text": "Read the full report here: Local greenspaces in everyday life: Visits, quality, and barriers across different groups - NECR656 "
        },
        {
            "text": "If you have any questions, please email our team at people_and_nature@naturalengland.org.uk. "
        }
    ]
}