{
    "url": "https://defradigital.blog.gov.uk/2023/05/18/accessibility-designing-an-inclusive-and-barrier-free-user-experience/",
    "title": "Accessibility: designing an inclusive and barrier-free user experience",
    "authors": [
        "Christopher J",
        "Chris Jenkins",
        "Zico Harris"
    ],
    "categories": [
        "User centred design"
    ],
    "pub_date": "2023-05-18T14:37:33+01:00",
    "content": [
        {
            "text": "Chris Jenkins, Zico Harris and Christopher J from the Defra Digital, Data and Technology Accessibility Team asked an artificially intelligent large language model a question around this topic. When it served up a generic blog, they decided to write their own instead."
        },
        {
            "text": "Every user deserves a first-rate digital experience on the web. Someone with access needs  must be able to experience web-based services, content, and other digital products with the same successful outcome as those without access barriers. This awareness and commitment to inclusion is a key focus of our Accessibility Team"
        },
        {
            "heading": 2,
            "text": "Meet the Accessibility Team"
        },
        {
            "text": "I’m Chris, the newest team member, everyday screen reader and magnification assistive tech user.  I work with Defra colleagues to ensure services are fit for diverse users. I identify and remove accessibility barriers. Much of my time is spent working with people to make sure they think about accessibility and how to do things differently. I do many everyday things, sometimes with adaptations or workarounds to not seeing well."
        },
        {
            "text": "I'm Zico (named after a Brazilian footballer, despite having no Brazilian heritage or skill in the sport). I've been with the team for a year. Before joining, I was a Test Engineer. I worked with a wide variety of delivery teams across different organisations. I have seen first-hand the difference accessible design makes to the quality of a product for everyone who uses it."
        },
        {
            "text": "I was diagnosed with autism spectrum disorder (ASD) as a teenager and struggled to ask for or accept assistance as it felt like I was somehow \"giving up on being normal\". This is a phenomenon which is quite widespread among those with non-visible disabilities. I hope that through our work, we can reach a point where accessible design is the norm rather than being seen as something above and beyond. I want everyone to benefit from an inclusive and barrier-free user experience."
        },
        {
            "text": "I’m Christopher, a different person with a different name to Chris. I joined Defra and the fledgling Accessibility team in January last year, since then I’ve recruited Zico and Chris and hopefully built a capable and caring team. I’ve always been around computers and technology so a career in that area surprised no one. What surprises me is how little attention organisations give to the people using their services. I was strongly impacted when a user said she couldn’t use the cool black interface I was developing for a shiny new tool."
        },
        {
            "text": "She was dyslexic and the very high contrast of pure white on black was impossible for her to read. Here was me trying to make the best interface I could, and I’d made something worse! Since then, I’ve tried my best to ensure that the user, with all their various combinations of needs, is the focus of my work as a developer, User Experience Designer, and now Accessibility Consultant. I was asked at an accessibility meeting why I work in accessibility and all I could say to explain it was “why wouldn’t I care?”"
        },
        {
            "heading": 2,
            "text": "Accessibility and neurodiversity"
        },
        {
            "text": "Tech workers can often utilise their neuro diversity using digital tools to become valued specialists. Sometimes people think it is harder to climb the corporate ladder if you are perceived to be a bit different. That’s why Bill Gates, who has dyslexia, founded Microsoft, to make the products work for people like him and many others."
        },
        {
            "text": "What percentage of the workforce are neuro diverse? Nobody really knows because many people don’t feel comfortable to disclose a diagnosis if they don’t have to. Or don’t have the means to acquire a diagnosis, even if they wanted one. People who identify as neuro diverse may have overlapping challenges like dyslexia or dyscalculia."
        },
        {
            "text": "Perhaps initiatives like this one from Microsoft “Narrowing the data gap: World Bank and Microsoft commit to unlocking better development outcomes for persons with disabilities” will use data to eventually unlock more insights."
        },
        {
            "heading": 2,
            "text": "How are you  marking Global Accessibility Awareness Day?"
        },
        {
            "text": "Chris: I am presenting a workshop demoing screen reader navigation and magnification on data dashboards."
        },
        {
            "text": "Christopher: I am checking my slides, ready to present my “Introduction to Accessibility” talk and practicing my British Sign Language (I’m still doing the introduction course!)."
        },
        {
            "heading": 2,
            "text": "What one simple thing can we all do to focus on digital accessibility? "
        },
        {
            "text": "Consider the email signature, we all should have one. Yet there is so much variation in how we choose to convey ourselves. If we all revisited this and decided to make small inclusive changes this could make a difference."
        },
        {
            "text": "For example, if you have an image, does it have alternative text? If there is a link, does it say “click here” or tell you where it will go? This action can start to form a ripple effect that can address other areas of work. It's through many small steps, shared responsibilities and co-ordinated activity that creates and maintains real and lasting change."
        },
        {
            "text": "So, why not check your own email signature and see how you can amend it to be more readable for a diverse audience."
        },
        {
            "text": " "
        }
    ]
}