{
    "url": "https://lifeathmrc.blog.gov.uk/2023/05/18/building-an-accessible-culture-at-hmrc/",
    "title": "Building an accessible culture at HMRC",
    "authors": [
        "Graeme"
    ],
    "categories": [
        "Accessibility",
        "Diversity",
        "Inclusion"
    ],
    "pub_date": "2023-05-18T08:35:15+00:00",
    "content": [
        {
            "text": "I’m Graeme, and I joined HMRC as Head of Accessibility in 2021."
        },
        {
            "text": "One of the reasons I joined the Civil Service in this role was because I passionately believe that government services should be easy for everyone to use. I have been responsible for digital services in a number of organisations in the private sector and it seemed like a great opportunity to focus on accessibility in a high profile government department."
        },
        {
            "text": "During the pandemic, I experienced elderly family members who suddenly became reliant on a mobile or tablet to carry out tasks they were used to doing in person, such as shopping or banking. Thrown into this digital world with little experience beyond basic texting, and with a variety of eyesight and other health issues, it left them feeling stressed and isolated. Appreciating that the things I took for granted felt intimidating to them, I helped them take a few steps into this new world."
        },
        {
            "text": "Some things were simple and intuitive. When we achieved something – like booking a supermarket delivery slot – it was a really satisfying feeling for all. This wasn’t difficult or frightening and it actually made life easier."
        },
        {
            "text": "With more confidence, we’d attempt something else – renewing a driving licence or booking a doctor’s appointment – and came crashing down to earth as we became entangled in jargon, complicated passwords and journeys that weren’t built for the mobile phone we were trying to use."
        },
        {
            "text": "It felt like we had gone back to square one, and it made me consider – with the technology and experience we have – why can’t we make simple, digital services that are considerate of everyone’s needs?"
        },
        {
            "heading": 2,
            "text": "What is accessibility?"
        },
        {
            "text": "More than 20% of the UK population has some form of disability and they can come in different forms and severities. When we think of digital accessibility, we may often have an idea of a person who can’t see a screen or type on a keyboard but that doesn’t really cover it."
        },
        {
            "text": "We need to consider a range of conditions that an individual may have. Some of these may be relatively well known, such as colour blindness or dyslexia but some are maybe not as familiar or understood, such as dyscalculia – a difficulty in understanding numbers."
        },
        {
            "text": "Sometimes it’s a temporary situation we need to consider – such as a broken hand or an eye infection which would hinder an individual using a digital service."
        },
        {
            "text": "As a government department, citizens often don’t have an alternative to using our digital services. So it’s really important that everyone can use them, regardless of the barriers they may face."
        },
        {
            "heading": 2,
            "text": "The challenges and the rewards"
        },
        {
            "text": "The challenge of the role is also the reward. I enjoy working with teams to solve tricky problems to benefit our users."
        },
        {
            "text": "I work in a team of experts who do this on a daily basis. We not only look at the detail of the coding and content on the services we publish for people to use, we also provide advice and training to help our delivery teams understand how to better support users with access needs."
        },
        {
            "text": "We get to talk to stakeholders at every level of the department, which is great because it shows the drive and enthusiasm to build accessibility into everything we do from the outset. That’s a refreshing change to other organisations where I’ve worked in the past."
        },
        {
            "text": "And one of the great things is that we never stop learning. I am fascinated by how people act and react when trying to use technology and working closely with our colleagues in user research throws up insights and challenges to the way we think."
        },
        {
            "heading": 2,
            "text": "Accessibility specialists "
        },
        {
            "text": "One of the big things that has changed over the last 2 years is that the role of Accessibility Specialist was added to the Government’s Digital, Data and Technology framework as a profession in its own right. This is a great step to recognise the unique mix of skills, knowledge and experience needed in this role. The role means that our accessibility professionals across government have a home and a proper professional development proposition of our own."
        },
        {
            "text": "That’s the other big positive about working in accessibility in government. There’s a strong community of practitioners and advocates, who all share common goals, tips and experiences. There’s a strong desire to get this right and it’s great to have the support of that network."
        },
        {
            "heading": 2,
            "text": "Global Accessibility Awareness Day"
        },
        {
            "text": "Every year in May, we run events to mark Global Accessibility Awareness Day – a worldwide event to raise awareness of accessibility. This year, we will be hosting events in partnership with our colleagues across HMRC and with suppliers too."
        },
        {
            "text": "Our suppliers are an important stakeholder for us – older technology just won’t be accessible but the in-built improvements in Android and Apple mobile phones mean we can be more inclusive in our designs."
        },
        {
            "text": "Technology is always changing. We have an ambitious transformation programme at HMRC and we’re working through upgrading a lot of our technology which will give us interesting challenges and opportunities in the future. Can we build more inclusive, accessible solutions using the latest cloud-based tech?"
        },
        {
            "text": "Of course, not everyone can access technology to use our services. While we need to ensure that everyone who can use our digital services can access them, we also need to support those who have no access to digital devices or an internet connection, and who are therefore, prevented from using these services."
        },
        {
            "text": "In these cases, we need to design support mechanisms to ensure that these people are given the same experience and access to services as everyone else. Part of the challenge in this is making sure that the tools and software we are using within HMRC meets the same standards as the services we design for citizens."
        },
        {
            "heading": 2,
            "text": "Help us build accessible services - our user panel"
        },
        {
            "text": "We recognise user needs may be hidden and through continuous user research, accessibility testing, and following user-centred design principles, we can build better services."
        },
        {
            "text": "If you are interested in helping out, you can sign up to be a member of our panel online, or call 03000 513 300."
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        }
    ]
}