{
    "url": "https://civilservice.blog.gov.uk/2023/05/18/digital-accessibility-working-together-to-break-down-barriers/",
    "title": "Digital accessibility - working together to break down barriers",
    "authors": [
        "Ben Merrick, Director, Joint Funds Unit, Cabinet Office"
    ],
    "categories": [
        "A Modern Civil Service",
        "A Skilled Civil Service",
        "An Ambitious Civil Service"
    ],
    "pub_date": "2023-05-18T07:37:16+00:00",
    "content": [
        {
            "heading": 3,
            "text": "On Global Accessibility Awareness Day, 18 May 2023, visually impaired civil servant Ben Merrick shares the importance of inclusion at work."
        },
        {
            "text": "Global Accessibility Awareness Day was established 12 years ago to get everyone talking about digital access and inclusion. As Deputy Civil Service Disability Champion and a disabled civil servant, accessibility is hugely important to me. "
        },
        {
            "text": "I’m legally blind and use magnification and voice synthesis software on my laptop. I use voiceover function on my phone – without this technology I simply couldn’t function effectively. "
        },
        {
            "text": "One in seven civil servants are disabled* and many use assistive technology. Accessibility also impacts how we deliver our services, the 2021 census reported 17.8% (10.4 million) of the England and Wales population were disabled."
        },
        {
            "text": "In the Civil Service Diversity and Inclusion Strategy, we committed to ensuring disabled people can flourish in public service. To achieve this, we must ensure disabled colleagues can access support and tools needed to carry out their roles. We also need to ensure everyone knows the importance of accessibility, in the delivery of public services. Like inclusion, accessibility isn’t just the moral and legal thing to do. It enables us to achieve better policy delivery, recruit and retain the talent, and truly represent the society we serve. "
        },
        {
            "text": "Below Ben Good and Paul Willgoss share more about how their networks are improving digital accessibility."
        },
        {
            "heading": 4,
            "text": "Usability testing and providing guidance"
        },
        {
            "text": "Ben Good is a Change Business Partner, Lead Customer Impactor for Design at HM Revenue & Customs in Croydon. "
        },
        {
            "text": "As chair of the Civil Service Visual Network I’ve been leading the committee to deliver our guide for managers of colleagues with a vision impairment."
        },
        {
            "text": "We’ve established a Usability Testing group for the Civil Service Disability Network to ensure all Civil Service facing products and services are both accessible and usable. We’ve been working closely with Government Recruitment Service to improve the accessibility of recruitment. We are also spreading the word on communicating accessibly, by providing advice such as:"
        },
        {
            "heading": 3,
            "text": "Driving awareness"
        },
        {
            "text": "Paul Willgoss, works in the Science Division of Health & Safety Executive in Bootle, is one of the Vice-Chairs of the Civil Service Disability Network (CSDN) "
        },
        {
            "text": "One of my roles is to drive awareness of and adoption of accessible communications and systems across the Civil Service. The opportunity cost of not providing things accessibly is often hidden. Your colleagues will have developed coping strategies, possibly asking others what a PDF document said over a mug of tea or working through a document knowing it would give them a headache. CSDN engages with colleagues across the Civil Service to try and make these points. For example, the People Survey is now accessible or much smaller elements – we make no apologies for “sending it back” if it's not accessible.   "
        },
        {
            "text": "Key tips about how to be more digitally accessible:"
        },
        {
            "heading": 4,
            "text": "National Security "
        },
        {
            "text": "Civil servants working in a secure, national security, environment, often face extra hurdles with accessibility. For a variety of security reasons it can be difficult to use assistive technology they rely on outside of work. This is something the national security community is working to change. I am also the National Security Disability Champion, and we are making progress in this space.      "
        },
        {
            "text": "I hope in a year’s time the national security environment is on par with the wider civil service policies. For more information, contact the National Security Community Culture, Diversity and Inclusion team at nscdandi@cabinetoffice.gov.uk."
        },
        {
            "heading": 4,
            "text": "Accessibility is vital"
        },
        {
            "text": "I hope this gives you some insights into how vital accessibility is for the working lives of disabled people. It’s an important day, not just for thinking about how to ensure accessibility. Fundamentally it’s about creating a workplace where everyone can thrive and give their best. I’m very grateful to everyone in the networks and more broadly for all their work on accessibility – but we all need to think about what we can do to enable our colleagues to operate effectively. How will you help?  "
        },
        {
            "text": "*Stats showing that 1 in 7 civil servants are disabled were taken from the Annual Civil Service Employment Statistics 2022    "
        }
    ]
}