{
    "url": "https://legalaid.blog.gov.uk/2023/05/18/help-us-to-shape-digital-services-that-work-for-all/",
    "title": "Help us to shape digital services that work for all",
    "authors": [
        "markworkman"
    ],
    "categories": [
        "Accessibility",
        "legal aid agency"
    ],
    "pub_date": "2023-05-18T09:54:43+01:00",
    "content": [
        {
            "heading": 2,
            "text": "Designing accessible services"
        },
        {
            "text": "We ran a successful recruitment campaign for our accessibility panel towards the end of 2022. The new recruits are now making a valuable contribution to our work designing and testing universally accessible digital services."
        },
        {
            "text": "But we are always on the look out for new volunteers and Global Accessibility Awareness Day on 18 May 2023 is a timely reminder of the importance of this work."
        },
        {
            "text": "Events will be occurring online and across the world to prompt conversations about digital access and inclusion. It is a conversation we are contributing to and we are always open to new voices."
        },
        {
            "heading": 2,
            "text": "What are we doing?"
        },
        {
            "text": "At the Legal Aid Agency we strive to make digital services accessible. We do this by making as many services available online as possible. We follow a standard government design pattern for new systems. We test designs with people who will be using them before they are fully launched."
        },
        {
            "heading": 2,
            "text": "Putting the user first"
        },
        {
            "text": "Everyone experiences the world in a different way. We 'stress-test' our services to help people with both temporary and permanent disabilities. We carry out accessibility audits and gather feedback through 'usability interviews' with staff and legal aid providers."
        },
        {
            "heading": 2,
            "text": "Tapping into expertise"
        },
        {
            "text": "We actively collaborate with digital experts from outside government for fresh perspectives. For example, we are currently piloting a new service called 'check if your client qualifies for legal aid'. While developing the tool we have tapped into the expertise of the Digital Accessibility Centre, a non-profit provider of web accessibility services."
        },
        {
            "text": "We also increased our team’s empathy for users by testing the new service using accessibility personas developed by the Government Digital Service. We ran research sessions with people who had specific access needs, including:"
        },
        {
            "text": "There is really no substitute for seeing someone with access needs use your service to work out where issues might be found."
        },
        {
            "heading": 2,
            "text": "Your chance to have a say"
        },
        {
            "text": "We are looking for more people to test our new services. If you are a legal services provider and you have any physical or visual needs, we want to hear from you. We are particularly interested in people who have an access need such as dyslexia, autism or dyscalculia, which is a difficulty understanding numbers."
        },
        {
            "heading": 2,
            "text": "What happens when I join?"
        },
        {
            "text": "We select a sample from registered panel volunteers to be contacted by our researchers. You will be told what the project is about and how you can help. This could range from online surveys to interviews or group work, either in person or by phone or video call."
        },
        {
            "heading": 2,
            "text": "How to register"
        },
        {
            "text": "Use the link below to volunteer to take part in user research on new digital services:"
        },
        {
            "text": "Accessibility panel registration"
        },
        {
            "heading": 2,
            "text": "Further information"
        },
        {
            "text": "Global Accessibility Awareness Day"
        },
        {
            "text": "Accessibility Personas – Government Digital Service"
        },
        {
            "text": "Digital Accessibility Centre"
        }
    ]
}