{
    "url": "https://defrafarming.blog.gov.uk/2023/05/18/landscape-recovery-apply-for-the-second-round/",
    "title": "Landscape Recovery: apply for the second round",
    "authors": [
        "Sam Burford"
    ],
    "categories": [
        "Payments to restore landscapes and ecosystems"
    ],
    "pub_date": "2023-05-18T12:03:51+01:00",
    "content": [
        {
            "text": "Landscape Recovery funds long-term, large-scale, bespoke projects designed to enhance the natural environment and deliver significant environmental benefits. "
        },
        {
            "text": "I’m pleased to say that you can now apply for the second round. The deadline is midday on Thursday 21 September. "
        },
        {
            "text": "In this post, I’ll share an overview of the second round and links for you to learn more."
        },
        {
            "heading": 2,
            "text": "The second round"
        },
        {
            "text": "The second round of Landscape Recovery will focus on projects in which farmers and landowners come together across at least 500 hectares to target net zero, protected sites and habitat creation. "
        },
        {
            "text": "This could include landscape-scale projects creating and enhancing woodland, peatland, nature reserves and protected sites such as ancient woodlands, wetlands and salt marshes, alongside the sustainable production of food. "
        },
        {
            "text": "Over the coming years, these projects will deliver a wide variety of environmental and social outcomes. These will, in turn, make an important contribution to national targets. "
        },
        {
            "heading": 2,
            "text": "Preparing your application "
        },
        {
            "text": "The guidance and link to apply for the second round of Landscape Recovery can be found on GOV.UK."
        },
        {
            "text": "It includes information about criteria and scoring plus feedback on the previous round, which might help you with ideas for your application."
        },
        {
            "text": "We’re asking people to submit their applications on a site called Atamis. You can ask questions there. We will publish both the questions and answers so that everyone has access to the same information. The link to Atamis is in the guidance. "
        },
        {
            "text": "We will provide more information on the second round of Landscape Recovery in 2 upcoming webinars."
        },
        {
            "text": "Register to attend by clicking on the links below. "
        },
        {
            "text": "Don't worry if you can't attend. We will record the webinars, so you can watch them back. I’ll add the videos to this post as soon as they’re available.  "
        },
        {
            "heading": 2,
            "text": "Assessing applications "
        },
        {
            "text": "As with the last round, we are running a competitive process to select the best projects. "
        },
        {
            "text": "We will assess and score all the bids using the assessment criteria set out in our scheme guidance. These include:"
        },
        {
            "text": "These criteria will ensure the projects meet our shared commitment to improve the environment while supporting environmentally sustainable domestic food production."
        },
        {
            "text": "We aim to get back to all applicants with a decision by the end of November. "
        },
        {
            "text": "We will take up to 25 of the highest scoring projects forward. We’ll give written feedback to unsuccessful projects and help them to identify other funding opportunities. "
        },
        {
            "text": "The chosen projects will be enrolled on the scheme by the Environment Agency and Natural England. They are the lead delivery partners for the scheme."
        },
        {
            "text": "These projects will be awarded development grants to support them through the project development phase, which we expect to last up to 2 years. "
        },
        {
            "text": "Projects that meet all our requirements will then proceed to the implementation phase with agreed funding from us and the private sector. "
        },
        {
            "text": "Implementation agreements will be specific to each project. Through them, we will set out the land management activity and/or outcomes that the project will deliver and how this will be funded. "
        },
        {
            "text": "When implemented, these agreements could last for 20 years or more.  "
        },
        {
            "heading": 2,
            "text": "Eligibility "
        },
        {
            "text": "As I mentioned, the second round of Landscape Recovery is open to any individuals or groups who want to come together to deliver large-scale, long-term projects across a broadly connected area of more than 500 hectares. "
        },
        {
            "text": "We recognise that habitats and land ownership in England can be fragmented, so it’s fine for project areas to have some gaps. Applicants should show how these gaps will not compromise their project’s environmental outcomes. "
        },
        {
            "text": "Any individuals or groups of farmers or land managers who think they can deliver the ambitious impact we seek will be able to submit bids for development funding. "
        },
        {
            "text": "All land types are eligible, including land inside or outside protected areas, as well as common land."
        },
        {
            "text": "The land could already be involved in existing agri-environment schemes, but we won't pay for activity that is already being undertaken through, or incompatible with, any existing scheme agreements. "
        },
        {
            "text": "The full details on eligibility are in the guidance."
        },
        {
            "heading": 2,
            "text": "Landscape Recovery so far "
        },
        {
            "text": "In December, I shared an update on the first round of Landscape Recovery  with a spotlight on just a few of the exciting projects. These include some brilliant examples of projects led by farmer clusters.  "
        },
        {
            "text": "The projects in the first round cover a range of habitats, from uplands to lowlands to temperate rainforests."
        },
        {
            "text": " In Yorkshire, the Three Dales Project is a consortium of 10 farmers, landowners and conservation organisations led by the Yorkshire Wildlife Trust.  It aims to restore a large area of the western Yorkshire Dales uplands, creating habitats for a range of species including black grouse, curlew and ring ouzels. "
        },
        {
            "text": "The Darent Valley Farmer Cluster in Kent is led by a group of farmers and Kent Wildlife Trust. Together with local organisations, the focus of the group is to carry out upper/middle catchment chalk river restoration in the Kent Downs Area of Natural Beauty.  "
        },
        {
            "text": "All the projects in the first round are progressing with their development work. We will support them to complete the development phase and move into implementation as soon as possible.   "
        },
        {
            "text": "Over the coming months, we will shine a light on more projects awarded funding in the first round, so make sure you subscribe to the Farming blog."
        },
        {
            "heading": 2,
            "text": "Developing the scheme"
        },
        {
            "text": "We've been gathering feedback from farmers and land managers on the first round of the scheme and from the webinars in the run up to the second round.  "
        },
        {
            "text": "We have used this feedback to make a number of changes to the scheme to improve the application process, including for groups of farmers. You can find out more about how we have improved the scheme in our policy paper on GOV.UK."
        },
        {
            "text": "If you have any questions or thoughts about our approach, feel free to comment below."
        }
    ]
}