{
    "url": "https://educationinspection.blog.gov.uk/2023/05/18/teachers-professional-development-remains-a-work-in-progress/",
    "title": "Teachers’ professional development remains a work in progress",
    "authors": [
        "Alex Jones, Director, Insights and Research"
    ],
    "categories": [
        "teacher training",
        "teachers"
    ],
    "pub_date": "2023-05-18T15:00:23+01:00",
    "content": [
        {
            "text": "The ongoing professional development of teachers is fundamentally important for education quality, and has been shown to improve teacher satisfaction and retention. Teaching practice based on an up-to-date, and deep understanding of relevant evidence is a hallmark of a high-quality education system, and crucial for pupils’ learning outcomes."
        },
        {
            "text": "We recently published our independent review of teachers’ professional development. This focused on teachers’ experiences of their training since April 2021. We asked them about:"
        },
        {
            "text": "The pandemic increased the pressure on teachers’ time, which reduced their ability to access development opportunities. And where they were able to access any, the training was very often delivered remotely, and many teachers thought it was lower in quality."
        },
        {
            "text": "A further consequence of the pandemic is that many schools are now focusing on mental health and well-being training. However, it is not clear yet whether and how this is benefitting pupils most in need."
        },
        {
            "text": "Responses to the question ‘What content areas do you feel you need more professional development in?’ (in percentages)"
        },
        {
            "text": "As we have reported over the past couple of years, the SEND (special educational needs and/or disabilities) system was put under great strain during the pandemic. Services such as speech and language therapy were not always available, and assessments for education, health and care plans were often delayed. With approximately 1.5 million children identified as having SEND, it is perhaps unsurprising that teachers want, and are seeking, more training in teaching pupils with SEND."
        },
        {
            "text": "Of course, the pandemic was not the sole cause of pressure on teacher workloads. We found that many teachers want more time dedicated to professional development, but that workload pressures prevent this. Often, school leaders have the best of intentions in supporting the development of their staff, but other school responsibilities get in the way, with the result that teachers use a significant amount of their own time for professional development. We did find, however, that this is less of an issue for early career teachers (ECTs), who felt that they could prioritise development opportunities enough in their working day."
        },
        {
            "text": "Responses to question ‘To what extent do you agree that the following are current barriers to your participation and engagement in professional development?’ (in percentages)"
        },
        {
            "text": "The ECF and NPQs in fact represent a significant improvement more generally, because they are informed by research, and include dedicated time for professional development, reflection and follow-up with mentors. The teachers who had been on these courses thought that they were relevant and high quality. However, they did report some inconsistency in how the courses were implemented, with some content less relevant or repetitive, and some highlighted poor online provision as an issue."
        },
        {
            "text": "Responses to the question ‘Please think about the professional development you have received through school since April 2021… Which of the following content areas did it cover?’ (in percentages)"
        },
        {
            "text": "We also found it encouraging that many schools are prioritising training around the curriculum. This is something that we at Ofsted have focused on through the quality of education – the substance of what pupils are taught – in our education inspection framework (EIF). However, in half the schools we visited, teachers’ understanding of how to plan and design a curriculum remained limited, despite training and development in this area. And, more concerningly, several teachers had done courses on how to prepare for inspection, such as practising deep dives or preparing curriculum intent statements, none of which is about the substance of education."
        },
        {
            "text": "We will continue this study into a second year, in which we will track changes from year 1 and collate insights."
        },
        {
            "text": "We have also commissioned the Institute for Employment Studies to track 40 teachers over 4 terms, to provide case studies of individual teachers’ development journeys."
        },
        {
            "text": "We hope that this second report will help:"
        }
    ]
}