{
    "url": "https://teaching.blog.gov.uk/2023/05/18/using-literacy-to-teach-children-about-sustainability-and-climate-change/",
    "title": "Using literacy to teach children about sustainability and climate change",
    "authors": [
        "Katherine Peck"
    ],
    "categories": [
        "Climate Change",
        "Curriculum best practice",
        "Primary schools",
        "Sustainability"
    ],
    "pub_date": "2023-05-18T11:56:19+01:00",
    "content": [
        {
            "text": "Katherine Peck, primary school teacher at Little Sutton in West Midlands, shares how literacy helped pupils learn more about sustainability and climate change in school."
        },
        {
            "text": "Environmental issues "
        },
        {
            "text": "There isn’t a day that goes by when environmental issues don’t appear in the media. Current statistics relating to climate change, air, water, and plastic pollution are alarming. Over the last ten years, classroom discussions about global warming, droughts, wildfires, and the work of environmental campaigners such as Greta Thunberg have become more and more prevalent. Children today are growing up learning they need to make changes in their lifetimes to contribute to saving the planet. In my experience, pupils are intrinsically interested in the natural world and animals, so it felt like the perfect topic for our new English unit."
        },
        {
            "text": "How the curriculum links to climate change"
        },
        {
            "text": "In year 4, children already cover elements of sustainability and climate change in their PSHE, geography and science lessons. One objective of the science national curriculum for year 4 is exploring the impact humans have on the environment. This includes both positive and negative impacts, such as nature reserves and ecological initiatives, as well as pollution and deforestation. Building on this cross-curricular learning, we planned an English unit of work, primarily focusing on plastic pollution."
        },
        {
            "text": "Pupils in year 4 researched the issue, using newspaper articles, videoclips, and nature documentaries, as well as reading relevant fiction and non-fiction texts. They investigated both sides of the debate - why plastic can be useful, but also how it can cause devastating damage to wildlife and the environment. Pupils also learnt new vocabulary relating to the issue - words such as biodegradable, durable, detrimental, and inexpensive."
        },
        {
            "text": "After a few weeks of research and planning, including learning about the features of a balanced argument or discussion text, the children wrote their own pieces about whether plastic should be banned. They completed the unit by writing a conclusion sharing their thoughts for the future, for example encouraging people to reduce, recycle and reuse plastic."
        },
        {
            "text": "Continuing to make a difference"
        },
        {
            "text": "In addition, the children performed a year group assembly to their parents, sharing the information they had learnt about sustainability and climate change. They particularly enjoyed learning the song ‘SOS from the Kids’ by SOS from the kids choir, which encourages grown ups to make changes to save the Earth. The assembly was a great success, and it was fantastic to see children’s enthusiasm when sharing the key messages they had learnt."
        },
        {
            "text": "Year 4 continue to make a difference by writing a weekly ‘eco- champions’ article for our school newsletter, promoting sustainable living to parents and pupils. Each week they set actions to take, for example encouraging others to remember a reusable bag when going shopping and turning lights off when leaving a room. Their enthusiasm for this unit of work and ongoing passion for sustainability has made it really worthwhile."
        },
        {
            "text": " "
        },
        {
            "text": "Outdoor Classroom Day is taking place on May 18. You can get involved by using Leaning Through Landscapes free resources, planting Coronation wildflower seeds and registering your interest for The National Education Nature Park and Climate Action Award scheme."
        },
        {
            "text": " "
        }
    ]
}