{
    "url": "https://socialcare.blog.gov.uk/2023/11/09/digitising-social-care-reflections-on-progress/",
    "title": "Digitising social care: reflections on progress",
    "authors": [
        "Alice Ainsworth"
    ],
    "categories": [
        "Care and support",
        "Digital skills and technologies",
        "Information sharing",
        "Innovation",
        "Leadership",
        "Technology and data",
        "Workforce"
    ],
    "pub_date": "2023-11-09T14:37:23+00:00",
    "content": [
        {
            "heading": 2,
            "text": "Building momentum"
        },
        {
            "text": "It’s been 18 months since the Digitising Social Care programme began, delivering the three year £150 million investment in digitally transforming adult social care, set out in the 2021 white paper, People at the Heart of Care."
        },
        {
            "text": "We’ve made huge progress in that time, and the sense of momentum building from the sector, technology suppliers and innovators is tangible. Many providers have jumped at the chance to access the funding and support available and are positive about the opportunities technology opens up to improve the ways they work, and how they support people."
        },
        {
            "text": "Providers have matched this enthusiasm with their own time and financial investment, in the knowledge that digital social care records (DSCRs) and care technologies can make their organisation more efficient and improve the quality and safety of care. It’s also been heartening to see the early adopters support others in the sector, sharing their experiences and best practice."
        },
        {
            "text": "Now we have reached the halfway point in our programme I’ve been reflecting on the progress made and the lessons learnt. Major programmes rarely go entirely to plan, but we’re listening and learning and always striving to find the best way to respond to the sector’s needs."
        },
        {
            "heading": 2,
            "text": "Update: digital social care records"
        },
        {
            "text": "Our flagship commitment within People at the Heart of Care was to scale the use of DSCRs to record and manage the delivery of care. Our original target was to ensure 80% of providers, and at least 80% of people in receipt of care, have a DSCR in place by March 2024."
        },
        {
            "text": "As it stands, more than 60% of providers now use DSCRs - from a starting point of just 40% - with many more in the process of implementing the technology. Unfortunately, we’re not on track to meet our target in the spring, but we’re actively working to make sure providers don’t miss out."
        },
        {
            "text": "Our analysis shows the very largest and smallest providers are least likely to have made the switch from paper to digital. There is also significant regional variation in uptake, with some parts of the country further ahead than others. While we expect some Integrated Care Boards (ICBs) to reach the 80% target on time, we know this won’t be the case everywhere."
        },
        {
            "text": "With this in mind, we have developed a scheme specifically for the largest providers to access funding directly, rather than go through multiple integrated care boards (ICBs). We’ll be doing more work to understand the needs of the smallest providers and to explore how we can improve our support for ICBs with the furthest to go."
        },
        {
            "heading": 2,
            "text": "Improving integration"
        },
        {
            "text": "Of providers that have digitised, 1,300 are able to access GP record information for people they care for. This integration of DSCRs with GP Connect will be a requirement of all assured suppliers next year and a major step forward in our work to join up systems between the NHS and social care."
        },
        {
            "text": "It’s essential for providers to demonstrate effective data and cyber security understanding to benefit from the join up of health and data. The Better Security Better Care programme has made great strides. 65% of providers have now achieved Data Security and Protection Toolkit (DSPT) compliance."
        },
        {
            "text": "We’ve also been looking at how digital innovation supports quality and safety of care, prevents avoidable hospital admissions and supports independence."
        },
        {
            "text": "We launched the Adult Social Care Technology Fund earlier this year to identify technology solutions which could be scaled within the sector. The first projects to receive support through this funding were announced last month and we’re currently evaluating the next wave of proposals."
        },
        {
            "heading": 2,
            "text": "More digital power to you"
        },
        {
            "text": "To support the adult social care workforce to have the skills and confidence to embrace technology, we have updated our digital skills framework and training database. We are also developing a digital leadership qualification."
        },
        {
            "text": "We published the what good looks like framework for social care and produced a wealth of advice and guidance, Find it all on our new website."
        },
        {
            "text": "The Care Quality Commission, has thrown its support behind the agenda: “it will become increasingly difficult for providers to maintain an outstanding or good rating without having an effective and safe digital social care record solution in place to enable better outcomes for people."
        },
        {
            "text": "You can find all the information you need on the funding and support available on our digitising social care website."
        }
    ]
}