{
    "url": "https://dwpdigital.blog.gov.uk/2023/11/09/gov-uk-is-part-of-our-service/",
    "title": "GOV.UK is part of our service",
    "authors": [
        "Jo Schofield, content designer, DWP Digital",
        "Angela Moore, content designer, Ministry of Justice"
    ],
    "categories": [
        "cross government collaboration",
        "Digital With Purpose",
        "Universal Credit"
    ],
    "pub_date": "2023-11-09T16:04:59+00:00",
    "content": [
        {
            "text": "Around 5.7 million people currently claim Universal Credit – a monthly payment for people who are out of work or on a low income. One of the Universal Credit team’s strategic goals is to give people an excellent end-to-end experience. "
        },
        {
            "text": "But we know that sometimes people struggle to understand aspects of Universal Credit, such as: "
        },
        {
            "text": "Our job as content designers is to help people understand Universal Credit so they have the information they need to make the right decisions about their claim.  "
        },
        {
            "text": "One of the most important ways we do this is with guidance on GOV.UK. The guidance includes information on how Universal Credit works, eligibility, and how to claim it. "
        },
        {
            "text": "GOV.UK is the main place people look for information about Universal Credit, and they trust the information is accurate. "
        },
        {
            "text": "If we get this information right – if it meets people’s needs and is easy to find and use – we will help people to better understand Universal Credit. We will also reduce pressure on colleagues in jobcentres and on the helpline. "
        },
        {
            "heading": 2,
            "text": "Making sure GOV.UK meets people’s needs  "
        },
        {
            "text": "All government teams working on GOV.UK are focused on meeting people’s needs. We need a deep understanding of what information people need and the words people use when they search for information. "
        },
        {
            "text": "To get this right, we need data and user research. We need expertise from designers, policy makers, and operational and legal teams.  "
        },
        {
            "text": "Universal Credit is well set up to get those things. There are multiple Universal Credit ‘theme teams’ who manage specific subject areas, such as housing, health or earnings.  "
        },
        {
            "text": "These teams: "
        },
        {
            "text": "With so much knowledge and expertise, it makes sense to involve these teams in creating and managing the guidance on GOV.UK. "
        },
        {
            "heading": 2,
            "text": "Empowering teams to transform GOV.UK content "
        },
        {
            "text": "Government services are large and complicated. By joining up across our internal structures, departments and processes we can design and develop joined-up user experiences from start to finish. This means people get the right information, at the right time, no matter where or when they interact with us. "
        },
        {
            "text": "There is a lot of expertise in our theme teams which can be applied when designing content for GOV.UK. Doing this provides a better, more consistent experience for our users. "
        },
        {
            "text": "For example, joined-up guidance can: "
        },
        {
            "heading": 2,
            "text": "Making things better for users "
        },
        {
            "text": "We’ve collaborated closely with colleagues across government, and published our first improvements to health-related guidance earlier this year. They include:  "
        },
        {
            "text": "We’ve also removed duplication and made the words we use consistent on GOV.UK, and within the service. All of this moves us towards our goal of improving the overall user experience. "
        },
        {
            "text": "Our work isn’t done and we’ll continue to iterate. We know we need to make Universal Credit processes and content clearer and more transparent, based on what people need. "
        },
        {
            "heading": 2,
            "text": "One team, one service "
        },
        {
            "text": "We’re learning how to help teams incorporate GOV.UK guidance into their processes and developing a strategy to do this. We’ll use this as a basis to work with other theme teams – by creating the strategy with them. "
        },
        {
            "text": "This piece of collaborative, cross-government work has allowed us to look at the user journey more strategically and holistically. We’ve been able to rethink health content in the context of the whole service, rather than making isolated tweaks. "
        },
        {
            "text": "As a result, the content is more consistent, timely and useful for claimants. "
        },
        {
            "text": "Collaborating with theme teams and giving them more ownership of their GOV.UK guidance is a huge step towards achieving our goal: giving people an excellent end-to end experience. "
        }
    ]
}