{
    "url": "https://educationinspection.blog.gov.uk/2023/11/09/how-we-inspect-safeguarding-in-schools/",
    "title": "How we inspect safeguarding in schools",
    "authors": [
        "Lee Owston, Deputy Director, Schools and Education"
    ],
    "categories": [
        "inspection",
        "leadership",
        "safeguarding",
        "schools"
    ],
    "pub_date": "2023-11-09T11:42:57+00:00",
    "content": [
        {
            "text": "In this blog, we’ll consider safeguarding through the course of an inspection. We’ll explain some of the main activities we undertake and why. You’ll find lots of references to keeping children safe in education (KCSIE) too. That’s because it sets out the Department for Education’s (DfE) expectations, as the regulator, of a school’s safeguarding responsibilities."
        },
        {
            "text": "Keeping children safe is an important part of all our work. As an organisation, we are always reviewing our approaches to inspection to make sure it’s as positive and effective as possible."
        },
        {
            "text": "Schools tell us that discussions about safeguarding can sometimes feel quite pressurised during inspections. Some of the concerns about getting decisions right in this space are natural. It’s important to stress that inspectors will be looking at whether schools have made the right decisions to keep children safe, not looking to catch schools out on technicalities. We want the very best for children and protecting them from harm is paramount."
        },
        {
            "text": "Before we consider the journey of inspection, it’s important to be clear what we mean by a ‘culture of safeguarding’. We’ve updated our definition to take account of what we know matters most. We expect all schools to have an open and positive culture around safeguarding that puts pupils’ interests first.  We have provided further clarification in our handbook at paragraph 367 on what this means. Inspectors will consider the safeguarding culture that has been established in the school when making a judgement. Judgements will rarely rest on single issues. Inspectors will take into account a range of evidence so that they are able to evaluate the effectiveness of safeguarding arrangements."
        },
        {
            "text": "Before the inspection"
        },
        {
            "text": "We contact schools the day before their inspection to set out the documents and information we’ll want to see when we are on site. We also have a longer conversation with the headteacher to talk about the school and plan the inspection."
        },
        {
            "text": "In terms of safeguarding, we ask schools to start by providing some specific information before the inspection – this is outlined in paragraph 107 of the handbook:"
        },
        {
            "text": "We specifically ask schools to provide us with ‘brief details’ about the resolution of any referrals to the local authority. To clarify, these ‘brief details’ can just be drawn from local records – for example, what support was provided and by whom, or whether the case is ongoing or the situation is now being monitored."
        },
        {
            "text": "The records that schools draw from should have enough detail for the inspector to be able to understand the overall concerns that have been identified and the support and help that is in place for children. The exact level of detail required is explained further in paragraph 68 of KCSIE, but they should:"
        },
        {
            "text": "During the inspection"
        },
        {
            "text": "Discussions about safeguarding are woven throughout the inspection and will be informed by the information and records provided. We explain more in our webinars and the handbook, but there are a few main activities:"
        },
        {
            "text": "The single central record "
        },
        {
            "text": "When we review the SCR, we’re checking against the minimum recording requirements as set out in paragraphs 268 to 272 of KCSIE. We might also ask questions about recruitment more widely, such as:"
        },
        {
            "text": "We typically carry out the check at the start of the inspection. We do it at the start so that if there are any minor safeguarding improvements that can be rectified during the inspection, schools have the opportunity to do so. We discuss further what we mean by minor safeguarding improvements below."
        },
        {
            "text": "All that said, we’ll want to know that this document is well managed and that staff are suitable to be working with children. Sadly, some predatory people do try to join the staff of schools. The SCR is an important safety mechanism."
        },
        {
            "text": "As our chief inspector has said before, there is no expectation that governors and trustees go through the SCR themselves. But governors and trustees are responsible for making sure that their school fulfils its statutory duties. It’s therefore important that governors and trustees have mechanisms in place to make sure that key safeguarding and safer recruitment duties are undertaken effectively."
        },
        {
            "text": "Meeting with the designated safeguarding lead"
        },
        {
            "text": "Inspectors will meet with the designated safeguarding lead (DSL) to explore the culture of safeguarding more fully. We’ll specifically ask the DSL whether there have been any safeguarding incidents or allegations since the last inspection. If there have been, leaders should be able to demonstrate how they have used the guidance in KCSIE to respond appropriately. This is likely to involve information-sharing with the right agencies and people (more about this below)."
        },
        {
            "text": "We’ll often sample case files and discuss referrals in this meeting. As part of these discussions, we are assuring ourselves that any concerns are dealt with in a timely way. By that, we mean without any unnecessary delay. Timings will depend on local thresholds and guidance. We’ll explore how any referrals are made, what actions are taken and how things are resolved."
        },
        {
            "text": "We’ll also ask about staff training and how leaders make sure that staff have the relevant knowledge and skills to safeguard children effectively. Above all, all staff should be aware of the indicators of abuse and know what to do if they have concerns about a child, no matter how minor those concerns might be. These expectations are set out fully in part 1 of KCSIE."
        },
        {
            "text": "Information-sharing is a big part of effective safeguarding. Expectations are set out fully in KCSIE and you can find a useful guide to information sharing in Working together to safeguard children. We may discuss information-sharing further on inspection. Examples of the kind of questions we might ask are:"
        },
        {
            "text": "Topics of discussion with the DSL will vary from school to school depending on context. We’ll want to know that they understand their pupils’ needs and that the school acts on any concerns in a timely and effective way."
        },
        {
            "text": "The meeting with the DSL is also an opportunity for us to be assured that this is a school that is reflective and receptive to challenge. By that, we mean that staff understand that keeping children safe is an ongoing endeavour and that there are always aspects of work that can be improved. If we spot something that perhaps does not quite look right, we’ll want to explore this and make sure the school’s systems keep children safe."
        },
        {
            "text": "Discussions with staff and pupils"
        },
        {
            "text": "Inspectors will take lots of opportunities to talk to a range of stakeholders during different activities. We’ll prioritise talking to staff and pupils. From a staff perspective, we’ll be keen to know about their training and the actions they should take if they have a concern. We might explore the particular context and how any local issues are factored into training. For example, this might be about support for looked after children or unaccompanied asylum-seeking and refugee children."
        },
        {
            "text": "When speaking to pupils, we’ll want to know that they feel that there are people at the school who they can talk to if they have a concern, and who will act on those concerns. We’ll do this in an age-appropriate way. And we will not automatically assume that anything worrying that might come up is representative of all pupils’ views. If pupils do raise any worries, we’ll make sure we share these with the relevant staff in school and test out views with wider groups. We’ll be very careful not to jump to any conclusions and will be mindful of confidentiality."
        },
        {
            "text": "That commitment to evaluating things proportionately extends to any concern that staff, parents or pupils might share in surveys too – we will weigh any matters carefully and speak with more people and explore wider evidence if we need to."
        },
        {
            "text": "Making a judgement about safeguarding"
        },
        {
            "text": "Inspectors will reflect carefully on all of the evidence they gather to arrive at a judgement. We will judge safeguarding as effective or ineffective. In 99% of inspections that we undertook in the last academic year, we judged that safeguarding is effective."
        },
        {
            "text": "Inspectors can also identify what we have described in the handbook as ‘minor safeguarding improvements.’ Examples might include administrative errors in paperwork or out-of-date policies."
        },
        {
            "text": "Minor improvements, by definition, are those that do not have an immediate impact on the safety of pupils. Where it is possible to do so, we’ll want to be satisfied that the school will address them before the end of the inspection, although we understand that some things might reasonably take a little longer."
        },
        {
            "text": "To reassure you, and as we explain in our webinars and training for inspectors, we know that schools cannot be everything to everyone. KCSIE is a vital tool for schools when it comes to safeguarding. Schools that are fulfilling their duties, by ensuring that they have systems in place to protect children from harm, will know they are doing all they can."
        },
        {
            "text": "If we do judge safeguarding to be effective but that some minor improvements are required, that will not stop the school being judged good or outstanding."
        },
        {
            "text": "In the rare circumstance that we judge a school to be inadequate due only to ineffective safeguarding arrangements, we will return for a monitoring inspection within 3 months from the publication of the report. This will broadly follow our other monitoring inspections but will focus on whether safeguarding is now effective. If the school has resolved the safeguarding concerns, its overall grade is likely to improve."
        },
        {
            "text": "We understand that schools can be worried about how their safeguarding practices will be judged. However, Ofsted does not expect anything from schools beyond what is set out in KCSIE and our handbooks. If schools have an open and positive culture around safeguarding that puts pupils’ interests first, and if they are following the requirements set out in KCSIE, they (like the vast majority of schools) will be judged to have effective safeguarding."
        },
        {
            "text": "Find out more"
        },
        {
            "text": "If you want to know more about our inspection of safeguarding you can find a dedicated recorded webinar on our YouTube channel. For more information about the SCR you can watch a KCSIE series from the DfE."
        },
        {
            "text": "This blog supports our wider series of webinars for schools. School leaders, staff and governors have asked to hear from us directly. Our webinars and blogs aim to do exactly that."
        },
        {
            "text": "We hope that our series of webinars and blogs will provide helpful clarifications."
        }
    ]
}