{
    "url": "https://kingsawards.blog.gov.uk/2023/11/09/podium-pet-products-celebrate-their-kings-award-for-enterprise/",
    "title": "Podium Pet Products celebrate their King's Award for Enterprise",
    "authors": [
        "The Queen's Awards for Enterprise"
    ],
    "categories": [
        "Advice",
        "Assessors",
        "International trade",
        "Lord-Lieutenants"
    ],
    "pub_date": "2023-11-09T14:55:06+00:00",
    "content": [
        {
            "text": "Podium Pet Products are dedicated to their customers and their customers' pet’s lifestyle together, they bring to you trusted, innovative and, wherever possible, natural products."
        },
        {
            "text": "Tell us a bit about Podium Pet Products?"
        },
        {
            "text": "THE WHY: We exist to fulfil the joy that pets give us as their parents by bringing to market trusted, innovative & natural solution based products."
        },
        {
            "text": "THE WHAT: Our ‘Hero’ brands are Dog Rocks – stop pet pee being a pain in the grass – and Be:Loved – Natural wellness & lifestyle products for pets & their parents."
        },
        {
            "text": "THE WHERE: We import from around the world and export to mostly the UK, EU and North American markets although are excited to branch out into other territories in 2024, with the help of the DB&T and on the back of winning a King’s Award in 2023."
        },
        {
            "text": "Which international markets do you already export to?  "
        },
        {
            "text": "Currently we export to the EU markets, mostly Germany and The Netherlands. We also do approx. 50% of our trade in the North American markets, both the USA and Canada."
        },
        {
            "text": "Could you tell us about your export story? When did you begin to export?  "
        },
        {
            "text": "We had a successful business model selling products for pets in the UK and as we attended trade shows, we were often meeting buyers from the EU, North America and the rest of the world.  We therefore decided to do quite a bit of market research whilst learning on the job!  We didn’t wait until everything was perfect, we went ahead and started to export knowing that we would learn an awful lot along the way, which we did.  This was before Brexit when exporting to the EU was a lot easier than it is now."
        },
        {
            "text": "At the same time, we took on the US market so we were juggling many balls at the same time.  Once we found a suitable warehouse in the US and once we spent a year being fleeced by a rogue agent, we were able to establish a foothold and sales really took off.  We then started to ship from the US into Canada, a natural progression."
        },
        {
            "text": "There was a need to spend a lot of time ‘in market’ which was exhausting and involved a lot of travel."
        },
        {
            "text": "What is the value of your exports and how has this grown your business?"
        },
        {
            "text": "I would say we export approx. £1m"
        },
        {
            "text": "What does it mean to receive a King's Award for Enterprise?"
        },
        {
            "text": "I think that there are 3 main effects of winning an award like this:"
        },
        {
            "text": "What do exports mean for your business? "
        },
        {
            "text": "As long as we don’t loose focus on the home market then exporting is key to our business but the challenge really is balancing exactly that, focus and exploration.  Of course with more business comes more need for admin and sales and marketing functions which means of course more bums on seats!"
        },
        {
            "text": "What advice would you give to other businesses exporting?  "
        },
        {
            "text": "Just do it!  Don’t wait until the time is right as it never is.  Just do it but know that you should learn at every turn. I also continually ask questions of people who are in market and who have gone before, doesn’t matter one bit if they are not from the same industry."
        },
        {
            "text": " "
        },
        {
            "text": "Find out more about The King's Awards."
        },
        {
            "text": "Find out more about Podium Pet Products:"
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        }
    ]
}