{
    "url": "https://environmentagency.blog.gov.uk/2023/11/09/reflections-from-an-environment-agency-science-engagement-intern/",
    "title": "Reflections from an Environment Agency science engagement intern",
    "authors": [
        "Environment Agency"
    ],
    "categories": [
        "Environment Agency"
    ],
    "pub_date": "2023-11-09T11:06:14+00:00",
    "content": [
        {
            "heading": 4,
            "text": "Finola Kirrane, science engagement intern, reflects on her summer in the Chief Scientist's Group and highlights the contributions of her science intern cohort."
        },
        {
            "text": "Starting an internship with England’s largest environmental regulator was daunting to say the least."
        },
        {
            "text": "Being a student midway through a science degree, my life for the past few years has involved a lot more ‘doing’ science than communicating it. Though I've always enjoyed breaking down complex scientific stories to share with others, I joined the Environment Agency having no idea what a full-time career in science communication and engagement would look like, let alone whether I could do it."
        },
        {
            "text": "This has also been my first ‘proper’ job, so learning the ropes of corporate life in a new city, while navigating all the other highs and lows of early adulthood, has been a valuable (albeit humbling) experience."
        },
        {
            "text": "Perhaps unsurprisingly, there aren’t many science engagement internships out there, and those offering formal contracts are like gold dust. Knowing this fueled my determination to make the most of my 12 weeks in the Chief Scientist’s Group, taking every opportunity possible to strengthen my skillset and broaden my knowledge."
        },
        {
            "text": "Speaking up for science"
        },
        {
            "text": "My role involved communicating a diverse range of Chief Scientist’s Group research areas including environmental antimicrobial resistance, environmental DNA and ‘forever’ chemicals such as per- and poly- fluoroalkyl substances (PFAS)."
        },
        {
            "text": "I’ve realised that being a lively, chatty extrovert is not a pre-requisite to being a good communicator. Instead, I’ve recognised the value in my tendency to sit back and let others talk, while still slipping into the chattier version of myself when the opportunity arises."
        },
        {
            "text": "This conversational confidence proved invaluable when I came to interview the other 7 Chief Scientist’s Group interns, who came in through the Group’s long-standing academic internship programme and the new, national Environment Agency Summer Diversity Internship Programme."
        },
        {
            "text": "From scientific research, to business priorities and future planning the interns have made an impact across a diverse range of work areas in their short time here. Find out more in the interview snippets below."
        },
        {
            "text": "Shruti Gupta is showing inclusion matters in science\n\n"
        },
        {
            "text": "I help with editing the Environment Agency’s Science Profession network’s Science Matters newsletter, and I am trialling some new approaches to making it more inclusive. I am also analysing the Chief Scientist’s Group’s monthly progress reports to show how the Group’s work helps deliver the Environment Agency’s strategic priorities."
        },
        {
            "text": "Anthony Njau is exploring a hydrogen-fuelled future"
        },
        {
            "text": "The UK government is planning to move towards a hydrogen-fuelled economy over the coming decades in a bid to meet our net zero targets. My project explores the public’s perceptions of a hydrogen economy. This involves searching through a lot of news articles, journal publications, interviews and other media sources to collate and translate data in a way which will help inform decisions later."
        },
        {
            "text": "Catrin Rathbone and Jessica Underwood are defining a future for farming"
        },
        {
            "text": "\nMy project focusses on ammonia emissions within farms. Specifically, I am exploring how we can use a new scenario modelling tool to determine the effectiveness of different catchment sensitive farming measures at reducing ammonia emissions. I’m also pulling together existing data about ammonia emissions to make a fact sheet which can be used by farming advisors when conducting farm assessments."
        },
        {
            "text": "My project explores how the catchment sensitive farming programme can help enhance the natural capital of farms. Natural capital refers to the assets in nature (such as soil, water and air) which can provide services to humans (for example, carbon storage, flood prevention and water filtration). These services are affected by the health of the natural capital asset. My role is to examine how catchment sensitive farming advice has affected the natural capital assets on a farm."
        },
        {
            "text": "Harriet Sleight is collating data for concerning chemicals"
        },
        {
            "text": "\nI am developing a strategy to identify research that is of high enough quality to enable the identification of chemicals that bioaccumulate or biomagnify. I began by gathering lots of relevant publications and looking closely at how the researchers collected and analysed their data. Now, I am making a database to store these datasets, and I am designing a set of criteria to help scientists and policy-makers filter through research papers, identifying the ones that contain reliable and robust data, much more quickly."
        },
        {
            "text": "Maitreyi Wavikar and Tabitha Wilkinson are understanding climate change in chalk streams "
        },
        {
            "text": "\nFor my project, I am exploring how factors such as land-use type, geology and other environmental factors have influenced, or are expected to influence, the water temperature of chalk streams between 1980 and 2080. I am also exploring whether there are any regional differences in these patterns, and how they differ depending on how we calculate the baseline."
        },
        {
            "text": "I am mainly looking at temperature duration curves, which are a relatively new approach to understanding minimum and maximum water temperatures. I have been exploring how we can use this approach to visualise trends in the highest and lowest temperatures recorded at rivers over time, and I am investigating whether these patterns can be related to factors such as altitude or land-use. Next, I am going to look at how these projected temperature changes might impact the breeding and migratory behaviours of two important fish species: the Atlantic salmon and the brown trout."
        },
        {
            "text": "Final reflections\n\nI have genuinely loved my time at the Environment Agency, and I am so grateful to have had the opportunity to learn so much about science communication in 12 short weeks.\nWhile I can’t yet visualise what life will look like beyond university, I will certainly keep the science communication doorway wide open when I come to the next big chapter in my life."
        }
    ]
}