{
    "url": "https://ipo.blog.gov.uk/2023/11/09/returning-to-a-stem-career/",
    "title": "Returning to a STEM Career",
    "authors": [
        "christinawatts"
    ],
    "categories": [
        "Inclusion and diversity",
        "Patents",
        "Recruitment",
        "Return to a STEM career",
        "STEM career"
    ],
    "pub_date": "2023-11-09T15:30:24+00:00",
    "content": [
        {
            "text": "As an organisation with flexible working and family-friendly policies, The Intellectual Property Office’s (IPO) ‘returners to STEM’ programme is the perfect opportunity for STEM professionals looking for a chance to return to work after a career break.   "
        },
        {
            "text": "IPO’s Director of People and Place, Penny Phillpotts is passionate about ensuring IPO provides a level playing ground for everyone. She spoke to us about the significant role the scheme plays in helping STEM professionals restart their STEM careers.   "
        },
        {
            "heading": 3,
            "text": "Return to STEM scheme now open"
        },
        {
            "text": "The IPO’s 2023 returners to STEM scheme is open for applications from now until the 26 November, starting with three eight-month placement opportunities as a Technical Officer in the IPO’s Patents Division. The team is keen to nurture and support the Technical Assistants, setting them up for future success. With this in mind, there may be the opportunity to apply for an Associate Patent Examiner role at the end of the posting, subject to availability. "
        },
        {
            "text": "The programme is for people from all backgrounds and work experiences, who have a qualification in STEM and want the chance to make a real impact on growing innovation across the UK.   "
        },
        {
            "heading": 3,
            "text": "Hear what our current returners to STEM have to say"
        },
        {
            "text": "We spoke to some of our people about how they have successfully restarted their own STEM careers after a break after applying.   "
        },
        {
            "text": "Associate Patent Examiner, Penny told us what attracted her to the scheme and how she felt it offered her the opportunity to re-ignite her STEM career.  "
        },
        {
            "text": "Penny’s advice for anybody who is considering applying for the scheme to restart their STEM career is to not be afraid to try something new.   "
        },
        {
            "text": "Associate Patent Examiner, Duane told us how he felt very encouraged by the fact that coaching and mentoring formed a big part of the programme.   "
        },
        {
            "text": "Duane took a 5 year career gap to travel after his service as an electrical engineer in the Royal Navy."
        },
        {
            "text": " "
        },
        {
            "text": "Margaret, an Associate Patent Examiner, was working as a Patent Analyst in a PharmChem team before taking a 14-year career gap to raise her children. The returners to STEM scheme gave her the opportunity to restart her career thanks to its flexible and hybrid working patterns. "
        },
        {
            "text": "Margaret felt the scheme would have a positive impact on her career journey, helping to give her the confidence and experience needed to return to work.  "
        },
        {
            "text": "We asked Margaret what advice she would give to anyone who was thinking about applying for the programme.   "
        },
        {
            "text": "Apply for our 2023 returner to STEM scheme (link) Returning to STEM as a Technical Assistant - Civil Service Jobs - GOV.UK"
        }
    ]
}