{
    "url": "https://environmentagency.blog.gov.uk/2026/02/11/evenlode-landscape-recovery-scheme-environment-agency-celebrates-partnership-working-success/",
    "title": "Evenlode Landscape Recovery Scheme: Environment Agency Celebrates Partnership Working Success ",
    "authors": [
        "Environment Agency"
    ],
    "categories": [
        "agriculture",
        "Flood",
        "Water"
    ],
    "pub_date": "2026-02-11T09:32:09+00:00",
    "content": [
        {
            "text": "by John Leyland, Executive Director of Environment and Business"
        },
        {
            "text": "At the Environment Agency, nature is key to what we do. It’s our job to protect and enhance the environment, enabling nature’s recovery whilst contributing to sustainable growth, with an ambition for climate resilience and healthy air, land and water. We can't do this alone - partnership is at the heart of how we work.  "
        },
        {
            "text": "What does that mean in reality? It means supporting initiatives like the Evenlode Landscape Recovery scheme – a project that is rooted in the creation of powerful partnerships and has brought together communities, farmers, government partners to deliver at scale on environmental ambitions. "
        },
        {
            "text": "Farmer-led environmental ambitions "
        },
        {
            "text": "What’s particularly special about the Evenlode project is that it is a true farmer-led enterprise, with over 50 pioneering land mangers across the North East Cotswold bringing together more than 3,000ha of land for environmental enhancement.  "
        },
        {
            "text": "The project also hopes to secure private income for ecosystem services from multiple sources, including utility companies, Biodiversity Net Gain and carbon sales to help land managers seek additional revenue while delivering cost-effective environmental improvements. "
        },
        {
            "text": "Embarking on their 20 year journey this February, landowners will restore and regenerate parts of their land, improving the functions of the three key rivers – the Evenlode, the Glyme and the Dorn. In doing so, they will create an agriculturally productive landscape that builds nature-based resilience for climate, flooding, biodiversity and water quality.  "
        },
        {
            "text": "By shifting farming practices at a catchment scale, including river flow management and soil health, farms can remain productive and profitable while delivering wide‑ranging benefits for land managers and surrounding communities.  "
        },
        {
            "text": "Making Landscape Recovery possible "
        },
        {
            "text": "The Evenlode project is to be awarded over £100m in implementation funding from Defra, going to over 50 land managers, the majority being farmers, over the next 20 years. That's not just good for nature – the project has ambitious aims, with a tailored approach to improving soil health and flood management on each landholding. "
        },
        {
            "text": "Measuring its impact is of paramount importance and the project has key markers of success it will be looking at – tracking soil quality, water quality and even the numbers of species, such as water vole."
        },
        {
            "text": "How the Environment Agency set out to do things differently "
        },
        {
            "text": "I first heard about the Evenlode project at a round table event with assorted stakeholders talking about how together we could fix water. One speaker in particular was an articulate farmer who was passionate about farming and protecting and enhancing land for nature and habitats. His appraisal of the Environment Agency however was not positive. He cited needing many permits from several organisations with quite a few of them being from the EA, which he felt would take years, and the idea of restoration would be over before it began. It was a story of great people, but terrible anti-growth and anti-nature processes. "
        },
        {
            "text": "I asked, how can I help? And from that chance meeting, we used the lived experience of someone going through the new Landscape Recovery scheme and took it into the way we operated in practice on the development of the project. In practice, this will mean new and innovative solutions from the Environment Agency, to help create rich wetland habitats and reducing flood risk to local communities. "
        },
        {
            "text": "Our role in Evenlode’s Landscape Recovery  "
        },
        {
            "text": "As the lead administrator of the project through its development phase, we wanted to support those pioneering land managers to make their ambitions a reality by challenging ourselves to create real change.  "
        },
        {
            "text": "As the project has developed their plans for investment and have used our expertise in river restoration as ecologists, regulators and reformers to best to unlock this ambitious nature restoration project at scale. It’s been a hugely collaborative effort and a learning curve for us – but the determination of the project, its partners and our own people have led us to overcome multiple obstacles. Retaining the vision for ambitious environmental recovery is always at the core of its success.  "
        },
        {
            "text": "We have managed grants, provided bespoke one-to-one project support and given specialist advice to a project that’s ambitious with measurable outcomes. Importantly, we’ve weighed cost against impact and ensured public money is used wisely. "
        },
        {
            "text": "This project is a great example of how, at the Environment Agency, we can use our resources and expertise to help facilitate nature-based solutions on large-scale programmes. It’s exciting to know that this project will go on to deliver a more resilient river habitat for farmers, local communities and nature by 2045.   "
        },
        {
            "text": "Now the project is within the implementation stage, it will be managed by our colleagues in Natural England, with the Environment Agency continuing to provide support on aspects like permitting – such as ensuring they have the right flood risk permits in place. "
        },
        {
            "text": "Innovating and improving into the future "
        },
        {
            "text": "Something we have trialled and developed and will continue to do so is our nature permitting and coordination service. It is tailor made to help speed up big, ambitious projects navigate of our permitting service - providing a dedicated team and structured approach to permitting for large-scale and complex nature recovery projects. "
        },
        {
            "text": "Over the next year, we will continue to support more projects as they move through their development. "
        },
        {
            "text": "The future of Landscape Recovery  "
        },
        {
            "text": "This isn’t the first scheme across the country to have an agreement ready for implementation and it won’t be the last.  "
        },
        {
            "text": "So far, more than 250,000ha of land (that’s equivalent to over 300,000 football pitches) and over 1,500 land managers have participated in the Landscape Recovery 2-year development phase. Projects are developing plans for more than 1,300km of river restoration, 35,000ha of peatland restoration, provide new or restore habitats for more than 260 species and benefit over 190 protected sites.  "
        },
        {
            "text": "Healthier landscapes and real nature recovery "
        },
        {
            "text": "Taking this scheme from concept to delivery has been an exciting challenge and a clear sign of the progress we’re making towards EA2030—greater climate resilience, healthier landscapes and real nature recovery.  "
        },
        {
            "text": "Our partnership with NE, Defra and our ALB colleagues has shown this team at its best: acting with clarity and conviction, focusing on effective delivery, solving problems together and always serving with care. This collaboration is what makes the scheme so powerful and its legacy will guide and encourage other landscape recovery schemes to make the environment better. "
        },
        {
            "text": "But for now, congratulations to the Evenlode team for a trailblazing project that will see a landscape’s recovery set in motion. We are proud to have played our part.  "
        }
    ]
}