{
    "url": "https://defrafarming.blog.gov.uk/2026/02/11/evenlode-landscape-recovery-project-begins-work-on-the-ground/",
    "title": "Evenlode Landscape Recovery Project begins work on the ground",
    "authors": [
        "The Team"
    ],
    "categories": [
        "Payments to restore landscapes and ecosystems"
    ],
    "pub_date": "2026-02-11T10:02:22+00:00",
    "content": [
        {
            "text": "We’re pleased to share that the Evenlode Landscape Recovery Project is ready to move from planning to delivery. "
        },
        {
            "text": "This project is the first to be led by a farmer cluster. "
        },
        {
            "text": "Managed by The North East Cotswold Farmer Cluster CIC (NECFC), the project comprises over 50 land managers and farmers, including tenant farmers. "
        },
        {
            "text": "Together, they will start work on the ground across the 3,000-hectare project area. "
        },
        {
            "text": "The wider catchment includes some of county’s finest landscapes. It spans parts of the Cotswolds National Landscape, the remnants of the ancient Royal Hunting Forest of Wychwood, and the Blenheim Palace World Heritage Site. It includes 16 river water bodies, including the River Evenlode and its major tributaries, the Glyme and the Dorn. "
        },
        {
            "text": "Like so many parts of the country, the landscape is under increasing pressure from flooding, water quality decline, biodiversity loss and the challenge of sustaining long-term, productive food systems. "
        },
        {
            "text": "For example, around 19% of the area lies within a flood zone and floods frequently during heavy rainfall due to the catchment’s rapid (“flashy”) response. This puts multiple communities, farmland, rail and local roads at risk. "
        },
        {
            "text": "One of the farmers taking part in the project reported one field flooding nine times in the winter of 2023–24. "
        },
        {
            "text": "The catchment supports a mosaic of habitats, including oak and ash woodland, limestone grasslands, lowland meadows and fen, creating conditions for a wide range of wildlife. "
        },
        {
            "text": "The priority species identified for targeted conservation action because they are rare, declining or threatened, include remnant populations of the endangered native crayfish and water voles, alongside rare plants such as fen violet and downy woundwort. "
        },
        {
            "heading": 2,
            "text": "Action grounded in careful planning "
        },
        {
            "text": "NECFC drew on expertise from the Evenlode Catchment Partnership and built new relationships."
        },
        {
            "text": "Rothamsted Research and the University of Oxford provided scientific input, while Oxbury Bank and Great Yellow offered financial advice. Together, this has helped shape how the project will track progress and how it will bring different funding sources together. "
        },
        {
            "text": "Now, the Evenlode Landscape Recovery project will start work to create a resilient, productive landscape that supports biodiversity, food production and local communities. "
        },
        {
            "text": "Natural England will administer the delivery of the project, with the support of the Environment Agency, Forestry Commission and Historic England. "
        },
        {
            "text": "Below, we’ll share some examples of where work will begin. "
        },
        {
            "heading": 2,
            "text": "Working with water: floodplains, wetlands and wildlife "
        },
        {
            "text": "The Evenlode Landscape Recovery Project will enhance how land and rivers work together across the Evenlode, Dorn and Glyme catchments, improving existing habitats and creating new woodland, wetland and riverside habitat. "
        },
        {
            "text": "Each participating farm is committing around 10-15% of its less productive land to the project, land that many farmers report they are losing to flooding. The project will bring this land back into use to restore and improve riverside habitats. "
        },
        {
            "text": "This will help keep land workable for longer (less waterlogging and/or compaction), reduces erosion, and improves yield reliability by keeping water where crops and grassland can use it. "
        },
        {
            "text": "Another objective is cutting pollution getting into rivers by keeping soil, nutrients and inputs on the farm instead of being lost to runoff, which protects productivity and can reduce costs. It also lowers the risk of pollution incidents, enforcement action and remedial work. For the environment, cleaner water supports wildlife, reduces algal blooms and improves river health for communities downstream.   "
        },
        {
            "text": "Work will also focus on reducing pollution through measures including offline wetlands (these are wetlands that treat water using natural processes, away from the main river channel).  "
        },
        {
            "text": "At Ridleys (pictured above), a field in the middle of the project, a range of interventions are planned. A poorly performing arable field is transitioning to a mosaic of scrub to connect existing woody habitats, floodplain grazing marsh, lowland hay meadow and natural processes driving river restoration. "
        },
        {
            "text": "This will create storage and take energy out of floodwater, allow fine sediments to settle and improve water quality, capture more carbon and allow wildlife to flourish. "
        },
        {
            "text": "By improving existing habitats and creating new ones, the project will build a connected habitat network that helps protected species such as water voles to recover and thrive. "
        },
        {
            "text": "These species are indicators of healthy rivers, wetlands and grasslands. If they’re doing well, it usually means cleaner water, better habitat condition and a more resilient catchment. "
        },
        {
            "text": "Focusing restoration on flood-prone land helps nature do what it is good at: slowing water, improving water quality and supporting wildlife. Delivered across more than 50 farms, this approach will reconnect habitats and restore more natural river processes at a landscape scale, bringing lasting benefits for nature and flood resilience. "
        },
        {
            "text": "The project seeks to store more carbon in the long term and capture more carbon in the short term. For farmers, practices that increase soil organic matter can improve soil structure, water-holding capacity and nutrient cycling, which can help stabilise yields and reduce losses in wet or dry years.  "
        },
        {
            "text": "For the environment, it helps cut net greenhouse gas emissions and supports wider nature recovery. In some cases, it can also open access to carbon-related payments or finance, where schemes and verification requirements are met.   "
        },
        {
            "heading": 2,
            "text": "Exploring funding approaches "
        },
        {
            "text": "The project is piloting some of the more complex funding approaches within Landscape Recovery. It is exploring how payments for ecosystem services could operate in practice, and how these could be combined with public funding to support long-term delivery. This includes assessing potential income from utility companies, Biodiversity Net Gain, and carbon markets. "
        },
        {
            "text": "Alongside public payments linked to results, these options could give participating farmers and land managers a more reliable mix of income, while helping deliver environmental improvements in a cost-effective way. "
        },
        {
            "text": "The project has already secured its first natural flood management off-take agreement with Oxfordshire County Council. In natural flood management, an offtake agreement is a contract where an organisation agrees to pay a farmer or land manager for actions that reduce flood risk. It provides a reliable income to put nature-based measures in place, such as leaky dams, ponds or wetlands, which slow down, store or hold back floodwater. "
        },
        {
            "text": "It is currently negotiating several more of these new finance arrangements with several infrastructure operators in the catchment. "
        },
        {
            "text": "By 2045, the project aims to show how public and private funding can work together to support a viable farm economy, deliver benefits for local communities, and restore the environment. "
        },
        {
            "heading": 2,
            "text": "Working together for people, nature, and resilience "
        },
        {
            "text": "The project has a shared governance setup and advisory boards to make sure landowners and tenant farmers are both included in decisions. "
        },
        {
            "text": "Over the development phase, the project used the funding to turn early ideas into a plan that is ready to deliver. The team checked what would work in practice, agreed actions and costs, and explored options for private investment. "
        },
        {
            "text": "It also built strong partnerships with the Evenlode Catchment Partnership, the Leverhulme Centre for Nature Recovery at the University of Oxford, Oxfordshire County Council, environmental NGOs, the local farmer cluster and the wider community, involving them in both the design and preparation for delivery, as well as working with infrastructure owners such as Network Rail and Thames Water. "
        },
        {
            "text": "As the project moves forward, it will work alongside local community groups, strengthening the important work they already do to learn about and take part in local activities. "
        },
        {
            "text": "The project is working with stakeholders and education in a range of ways. For example, hundreds of miles of footpaths threaded through the project area will feature QR codes, linking to stories, educational resources, pictures, and opportunities to engage further in the project.  "
        },
        {
            "text": "Over time, the project will bring in more people and organisations, including local communities, farmers outside the project area, local councils and parishes, and local groups, as partners and volunteers in nature recovery and education.   "
        },
        {
            "heading": 2,
            "text": "Learn more "
        },
        {
            "text": "More than £160 million has now been committed to support Landscape Recovery projects across the country during their Project Implementation Phases."
        },
        {
            "text": "Landscape Recovery differs from other environmental land management schemes because of its scale, ambition and long-term approach, and because it is designed to blend public and private funding. Alongside environmental outcomes, it can also deliver wider benefits for local communities. "
        },
        {
            "text": "Together, these projects demonstrate the flexibility of the Landscape Recovery programme and the different ways large-scale ambition can be achieved. "
        },
        {
            "text": "Visit GOV.UK to learn more about Landscape Recovery and subscribe to the Farming blog for a notification whenever we publish a new post.  "
        }
    ]
}