{
    "url": "https://cyberandspecialistoperationscommand.blog.gov.uk/2026/02/11/from-apprentice-to-social-media-manager-my-journey-through-government-communications/",
    "title": "From apprentice to social media manager: my journey through government communications",
    "authors": [
        "bobsendall"
    ],
    "categories": [
        "Careers"
    ],
    "pub_date": "2026-02-11T08:00:00+00:00",
    "content": [
        {
            "text": "At school I knew I did not want to take the university path but was unsure where else my future could take me. I spent a couple of years in primary schools training to be a teaching assistant after I finished sixth form, then I did a brief stint as an apprentice in journalism, having thought the move from teaching assistant may push me further and give me a challenge. Fundamentally though, it wasn’t for me, I didn’t feel like I was making a difference the way I did in schools. I looked for another opportunity, something that was still a ‘learn as you earn’ role, making an impact and progressing my career. "
        },
        {
            "text": "So, when I started as a Government Communications Apprentice at HMRC in 2019, I had no idea where this career would take me. Fresh-faced to Government and eager to learn, I threw myself into my first placement in social media, discovering a genuine passion for connecting with the public through digital channels, ensuring people were aware and involved.  "
        },
        {
            "text": "Then the pandemic hit. Suddenly, I found myself at the heart of HMRC’s crisis communications team during one of the most challenging global periods in recent history. Those months working on COVID messaging taught me more than any textbook ever could. Helping people understand vital schemes like furlough, when their livelihoods depended on clear, accurate information, showed me the real impact government communications can have on people's lives. I completed my Level 4 qualification in PR during this time, which gave me a strong professional foundation to build on. "
        },
        {
            "text": "A couple of years later, I made the move to the Home Office as a press officer in the Police and Crime team to develop my portfolio and experience in the Civil Service. This was an entirely different role within communications.  Writing press releases, coordinating campaigns with influencers, and yes, working those memorable night shifts. Working directly to the Home Secretary brought a level of pressure I hadn't experienced before, but it taught me to think on my feet and stay calm when the stakes were high. Every challenging moment was a learning opportunity. I was involved in many life changing campaigns – from drink spiking to knife crime and police recruitment, every word on every release mattered. "
        },
        {
            "text": "After returning from maternity leave, I was ready for a new chapter. I joined the Ministry of Defence, working in what is now Cyber & Specialist Operations Command as a social media manager. Running three successful social media channels here has been incredibly rewarding. I’ve grown these channels, secured contracts, met key stakeholders, attended insightful events and – most importantly – shared the incredible work across the Command, from overseas bases, to medics, educators, operators and intelligence. The work we do is fascinating, and I get to bring to life stories that matter about the people and capabilities protecting our nation in cyberspace and beyond.  "
        },
        {
            "text": "Looking back at my journey over the last seven years from apprentice to where I am now, I'm grateful for every step and learned so much along the way. Government communications offers such varied opportunities, and I'd encourage anyone considering this path to take the leap. You never quite know where it might lead you. "
        },
        {
            "text": "GCS Advance: Apprenticeship - GCS "
        }
    ]
}