{
    "url": "https://aphascience.blog.gov.uk/2026/02/11/i-am-not-a-medic-but-my-title-is-dr/",
    "title": "I am not a medic, but my title is \"Dr.\"",
    "authors": [
        "Bhudipa Choudhury"
    ],
    "categories": [
        "Women in science"
    ],
    "pub_date": "2026-02-11T09:00:00+00:00",
    "content": [
        {
            "text": "The stroke of the midnight hour ushering in the 15 August 1947 had a key impact on my life. Not my birth date, but the birth of independent India. My family made their way to a new life in India leaving behind all material possessions and our ancestral home, which had changed location overnight from British India to East Pakistan. Independence was expensive: British India was partitioned into three portions; there was carnage and chaos as families desperately traversed borders to reach their destinations. Millions were displaced or dead, so my family were amongst the lucky ones, alive and relatively unscathed. The turbulence continued for decades, particularly in the Eastern part of the country with East Pakistan becoming Bangladesh in 1971. There was limited opportunity or immediate hope for improvement as colonial rule had stripped countries of their assets. Ironically, this led my parents and many others to move to GB as post WWII and the fall of the empire, Britain was welcoming residents from her former colonies to participate in the nation rebuilding process."
        },
        {
            "text": "Cut to the only place I know as home, Birmingham, England. The trauma of partition lingers throughout generations and growing up I was repeatedly told that “I should study hard to get a good job”. There are multiple jokes and stereotypes around Indian families wanting their kids to be doctors or engineers or if they cannot manage either of those, perhaps a lawyer. That is with good reason: if you have lost everything you ever owned you can only rely on yourself: the skills and knowledge you hold and can carry weightlessly with you, wherever you may end up."
        },
        {
            "text": "Initially I was not so keen on science, my favourite subject was mathematics. It was during my GCSE years, and the teaching prowess of Mr. Gateley, that my interest in science grew. I thought I would study medicine, but from childhood I knew that I wanted to do research, no rhyme or reason, it was just what I wanted to do. I soon realised that there are more routes to research than medicine, so it was decided (with a bit of cajoling) that I would study microbiology and then follow up with a PhD - ultimately my title would be “Dr”."
        },
        {
            "text": "I decided to pursue a PhD in virology and studied the evolution of Human Immunodeficiency Virus – 1 (HIV-1), which belongs to the retrovirus family and is the virus which can cause Acquired Immunodeficiency Syndrome (AIDS)."
        },
        {
            "text": "Next, I undertook a post-doc focussed on producing attenuated viruses as a vaccination strategy against HIV/AIDS. The attenuation process weakens the virus so that it is unable to cause disease but can still be recognised by the immune system, hopefully protecting the individual. I rather naively thought I was working towards a cure, but quickly understood that live attenuated viruses are not the best choice for retroviral infections: vaccines protect against disease and not infection; retroviruses reproduce by inserting their genetic material inside the host’s genome, so once infected, it is lifelong. "
        },
        {
            "text": "After a hard slog but no scientific manuscripts to show for it, I had to move on. As there were not any virology specific posts, my next move was to cancer genetics. I admit it I only did it for the papers, and papers I got. However, the buzz of publications was short-lived and I was b-o-r-e-d… I wanted to return to virology…"
        },
        {
            "text": "APHA advertised for a scientist on the OFFLU programme*, and said scientist was me. I disliked the nomadic post-doc lifestyle so a permanent position in virology was even worth taking a pay cut for. I was the first OFFLU Scientist, and as well as bringing me back to virology, this role also allowed me to travel, for example the opportunity to work at APHA’s Australian equivalent, the Australian Centre for Disease Preparedness. I remember nervously boarding the flight to Sydney as it was the first time that I travelled that far alone. Whilst I was enjoying my stint in the ‘flu group, I also wanted to progress through the ranks. I joined the agency as HEO and a year later I was promoted to a team lead position within the Mammalian Virology workgroup at APHA. This role returned me to work with retroviruses; I took on leadership of the World Organisation for Animal Health Reference Laboratory for enzootic bovine leukosis and research into equine infectious anaemia virus."
        },
        {
            "text": "As the years rolled on, I began to feel “stuck”, that is the pyramidical nature of hierarchy. Change was on the horizon with a six-month secondment to the Government Office for Science during the SARS-CoV-2 (COVID-19) pandemic, a fantastic opportunity to understand the workings of another department."
        },
        {
            "text": "During my absence, APHA was expanding which allowed my next move to Deputy Work Group Leader (WGL) for Mammalian Virology. Shortly after, the WGL stepped into another role meaning that I could step up and take full control. After being in charge for 18 months, I did not want to be the deputy again and fortunately there was a temporary promotion opportunity for the Animal and Zoonotic Viral Disease Portfolio’s (AZVDP) Lead Scientist (LS) role, which oversees all of the research and surveillance projects within that portfolio. And now I am permanently in the LS AZVDP position, I am still not sure how that happened, but it did."
        },
        {
            "text": "The most enjoyable objective as Lead Scientist is to promote our work which is easy as we have much to celebrate. Despite being battered by continuous disease outbreaks, we have inputted rapidly to key government policies, for example, working collaboratively to confirm non-viability of influenza virus in milk. We work on everything from hedgehogs to elephants and support with diseases of welfare and economic impact which perhaps do not get the wider acknowledgement that they deserve (Striving for healthier pigs: tackling porcine reproductive and respiratory syndrome; Advancing the fight against Bovine Viral Diarrhoea)."
        },
        {
            "text": "We study over 30 viruses, fulfilling our responsibility to “protect animal and plant health for the benefit of people, the economy and the environment” via our international and national reference laboratories – an example is our work on rabies virus."
        },
        {
            "text": "We also undertake surveillance to understand which disease threats may be on the horizon, for example in this blog: APHA scientists find West Nile Virus sequences in UK mosquitoes: what it means for wildlife and public health. We are also reactive to novel threats and preparing for such incursions by investigating new technologies via projects such as Genomics for Animal and Plant Disease Consortium."
        },
        {
            "text": "My colleagues, some of the brightest, conscientious and dedicated individuals that I have had the pleasure of interacting with, are one of the key factors in keeping me working here at APHA. Working in the veterinary field, we are sometimes seen as public health’s poorer cousins, a notion that could not be further from the truth. Journal impact factors may not always reflect it, but our scientific thinking, concepts and technical innovations match, and often surpass, those in public health."
        },
        {
            "text": "Across portfolios we are attractive collaborative partners, for our skills and knowledge and equally for our resources, pathogen collections and facilities. We should not forget that and appreciate our own value."
        },
        {
            "text": "Every large organisation has its issues but there are also opportunities, particularly avenues to study, whether it is part-time post-graduate studies or apprenticeship schemes. Of late, we have had a continuous stream of high-profile visits and the wider media attention our work deserves, so let us keep our foot on the accelerator…trust me, my title is “Dr.”!"
        },
        {
            "heading": 2,
            "text": "Marking International Day of Women and Girls in Science"
        },
        {
            "text": "To mark International Day of Women and Girls in Science, we are delighted to share a new video featuring some of the talented female scientists working across APHA. Their dedication, expertise and passion drive our research and help protect animal and public health. Join us as we celebrate the vital role women and girls play in science."
        }
    ]
}