{
    "url": "https://buyingforschools.blog.gov.uk/2026/02/11/new-education-estates-strategy-a-decade-of-national-renewal/",
    "title": "New Education Estates Strategy: a decade of national renewal",
    "authors": [
        "Communications Team"
    ],
    "categories": [
        "Estates"
    ],
    "pub_date": "2026-02-11T16:53:46+00:00",
    "content": [
        {
            "text": "The Department for Education (DfE) today published its Education Estates Strategy backed by a 10-year plan of national renewal for schools and colleges in England."
        },
        {
            "text": "The strategy sets out the government’s clear long-term vision for the education estate that supports opportunity for all, from early years to post-16, with an estate that is safe, suitable, sustainable and sufficiently sized."
        },
        {
            "text": "It is focused around three strategic pillars: manage the estate, improve and renew the estate, and build and rebuild the estate."
        },
        {
            "text": "At the core is a shift to more proactive management, long-term strategic maintenance and more renewal of the existing estate. This is alongside building and rebuilding where renewal is not possible and ensuring there are high-quality places from early years to post-16."
        },
        {
            "text": "The 10-year plan will drive up standards across the education estate so more children and young people can achieve and thrive in every setting – giving schools better tools to spot problems early, investing in repairs and upgrades so buildings last for decades, and rebuilding where it’s needed most.  "
        },
        {
            "text": "Backed by £38 billion in overall capital investment from 2025-26 to 2029-30 – the highest since 2010 – it will help to create buildings that are fit for purpose, inclusive by design, resilient to climate change, and fit for the future.  "
        },
        {
            "text": "Education Secretary, Bridget Phillipson, said: “For too long, schools and colleges have been forced to patch and mend buildings that have already deteriorated – spending their time worrying about leaking roofs instead of focusing on what matters most: giving every child the best possible education."
        },
        {
            "text": "“This 10-year plan marks a turning point. We’re breaking that cycle with a decade of national renewal for schools and colleges. We’ve already committed to unprecedented long-term funding, but we will go further, including our £700 million Renewal and Retrofit Programme to tackle problems before they become costly crises."
        },
        {
            "text": "“This is about more than buildings – it’s about breaking down barriers to opportunity. Every child deserves to learn in a safe, accessible environment, with the right facilities to meet their needs and help them thrive.”"
        },
        {
            "text": "You can read the full press notice on GOV.UK."
        },
        {
            "text": "Make sure to click ‘sign up and manage updates’ at the top right of this page to subscribe to our blog and receive notifications as we’ll be focusing on estates throughout March with practical advice and case studies.  "
        }
    ]
}