{
    "url": "https://environmentagency.blog.gov.uk/2026/02/11/protecting-our-water-a-day-in-the-life-of-an-environmental-crime-officer/",
    "title": "Protecting our water: A day in the life of an Environmental Crime Officer",
    "authors": [
        "Environment Agency"
    ],
    "categories": [
        "Water"
    ],
    "pub_date": "2026-02-11T22:30:00+00:00",
    "content": [
        {
            "text": "My name is Jess Pykett, I'm an Environmental Crime Officer (ECO) working in the Water Industry Regulation (WIR) Enforcement team. The Environment Agency announced it has assembled its largest ever workforce for tackling water pollution - expanding it by almost fivefold from 41 roles in 2023 to 184 in 2026, with a further increase planned in 2027. I started in April 2025 as part of a new cohort of officers employed to regulate and investigate water company non-compliance.  "
        },
        {
            "text": "Our team members bring individual knowledge and strengths to our work, helping to protect our environment and hold water companies to account. When we open an official investigation, as the result of a pollution incident or non-compliance, we work tirelessly to identify the root cause and advise on prevention measures. No two days are the same and we oversee such a variety of cases.  "
        },
        {
            "text": "The work is varied "
        },
        {
            "text": "Cases can include everything from investigating pollution incidents on water treatment works to permit breaches or burst rising mains. Investigations can include requesting and reviewing legal data and information from water companies.  "
        },
        {
            "text": "We conduct interviews and we accompany Environment Officers to site inspections, working together to identify the root causes of environmental harm and non-compliance with the aim to prevent incidents from happening and ensuring others don’t happen again in the future.  "
        },
        {
            "text": "Our larger workforce is carrying out more inspections than ever before. We’re better at understanding the operation and condition of water company assets, such as sewage treatment works so to nail down those root causes which is essential for preventing problems happening in the first place. "
        },
        {
            "text": "Case in point "
        },
        {
            "text": "A recent case I worked on began when Environment Officers (EOs) identified pollution on a sewage treatment site.  "
        },
        {
            "text": "A piece of equipment was found to have failed. It was structurally damaged and caused partially treated sewage to collect on the ground underneath it. This needed further investigation and my team, and I were brought in to collate the evidence.  "
        },
        {
            "text": "During a site visit, we were able to observe and inspect the temporary measures the water company had installed whilst the damaged equipment was being repaired. Critically, we want to ensure sites are brought back into compliance as soon as possible and we work with the water company to ensure no further environmental damage can be caused.  "
        },
        {
            "text": "Since the partially treated sewage collected on the ground, our groundwater specialists requested soil samples to help prove what impact this pooled sewage had. We also sampled the nearby river to check for any environmental impacts. "
        },
        {
            "text": "The data and photos from our site visits, along with evidence from our findings will be used as an evidence base for our investigation.  "
        },
        {
            "text": "Many of our cases require collaborative working among multiple teams and specialists to collect evidence in the form of data and documentation.  This can help identify the issues, solutions and most importantly hold those responsible to account. "
        },
        {
            "text": "Our legal powers  "
        },
        {
            "text": "The Environment Agency’s legal powers will be further strengthened through the Water (Special Measures) Act 2025. The Act will bring significant changes in how we will regulate the water industry. It will help us take faster, firmer action against poor performance.   "
        },
        {
            "text": "There are other options also available for us which are an alternative to prosecution. These include a range of civil sanctions such as enforcement undertakings and Variable Monetary Penalties. Enforcement undertakings are an option we can use to secure compliance, restore and improve the affected environment, compensate impacted third parties and prevent further offending.  "
        },
        {
            "text": "I had experience working in the water industry before becoming an Environmental Crime Officer. This gave me the context and skills I need to work with water companies and their assets effectively. The Environmental Crime Officer role is one I am immensely passionate about. I’m proud of the work we do.  It leads to tangible outcomes that, ultimately, help to protect our environment for future generations to come.   "
        }
    ]
}