{
    "url": "https://naturalengland.blog.gov.uk/2026/02/11/rescue-takes-flight-survey-campaign-to-address-gaps-in-seabird-flight-height-data/",
    "title": "ReSCUE takes flight: Survey campaign to address gaps in seabird flight height data.",
    "authors": [
        "Rachel Mewes",
        "Eddie Cole",
        "Andrew Harwood"
    ],
    "categories": [
        "Evidence",
        "Marine environment",
        "Monitoring",
        "Natural England",
        "Science and evidence",
        "Seabirds",
        "Wildlife"
    ],
    "pub_date": "2026-02-11T14:57:10+00:00",
    "content": [
        {
            "text": "By Rachel Mewes – Marine Ornithology Specialist and ReSCUE Project Support, Eddie Cole – ReSCUE Project Lead and Andrew Harwood – Senior Marine Ornithology Specialist and ReSCUE Technical Lead"
        },
        {
            "text": "Offshore wind expansion is critical to the UK government’s ambitions to address the climate crisis and strengthen the country’s energy security. It is also important that we consider the need to halt and reverse the decline in marine biodiversity and enable nature’s recovery alongside the government’s priority to expand the UK’s renewable energy network."
        },
        {
            "text": "To achieve sustainable offshore wind development alongside a thriving marine environment, offshore planning decisions need to be informed by up-to-date, high-quality evidence that allows for robust assessments of potential impacts and the identification of effective mitigation measures. Seabird collision with offshore wind infrastructure remains one such major consenting issue, partly due to the lack of accurate, high-quality data on seabird flight height and uncertainty surrounding the interaction of seabirds with wind turbines."
        },
        {
            "text": "The Reducing Seabird Collisions Using Evidence (ReSCUE) project, led by Natural England, seeks to address this issue by improving the way we collect and use seabird flight-height data to inform mitigation and consenting, contributing to seabird conservation and the low impact expansion of offshore wind."
        },
        {
            "text": "ReSCUE is a multi-year, multi-partner project funded by The Crown Estate’s Offshore Wind Evidence and Change (OWEC) Programme. OWEC seeks to facilitate the sustainable and coordinated expansion of offshore wind to help meet the UK’s commitments to low-carbon energy transition whilst supporting clean, healthy, productive and biologically diverse seas."
        },
        {
            "text": "September 2025 marked the start of a major new phase for ReSCUE with the launch of a digital aerial survey campaign including Light Detection and Ranging (LiDAR) technology. Twenty surveys are planned to take place across key sites for seabirds in UK waters between September 2025 and August 2026. "
        },
        {
            "text": "These surveys will make use of imagery from digital aerial surveys to identify birds in flight which can then be matched to LiDAR data to provide high-quality flight-height measurements. As of January 2026, we have flown 9 surveys with the data outputs currently under quality assurance (QA) review by the ReSCUE project team."
        },
        {
            "text": "Following an initial review of methods for quantifying seabird flight heights at the start of the project a validation study was designed to investigate sources of uncertainty associated with three preferred methods: combined LiDAR-digital aerial survey, laser rangefinders, and telemetry (e.g. GPS tags). This study was carried out in August 2024 by the ReSCUE team, supported by members of the NE Birds team, Earth Observations team, and the BTO. "
        },
        {
            "text": "The results of this field study have now been published, and the outcomes provided further confidence in the accuracy and precision of LiDAR-digital aerial survey methods for measuring seabird flight heights. In combination with a gap analysis, and input from stakeholders, the results of this study were used to inform the final scope and design of the 12-month LiDAR-digital aerial survey campaign, to ensure it is fit for purpose and delivers value for money."
        },
        {
            "text": "The planned surveys will be flown by APEM and cover four areas of UK waters: the northern North Sea; Irish Sea; southern North Sea and Celtic Sea. Within these four regions, eight study sites have been defined, to be surveyed at different times of the year, to target priority species, areas, and seasons where there are gaps in our seabird flight height data. "
        },
        {
            "text": "Importantly, the surveys include coverage of several offshore wind farms and future development areas. The resulting data will help improve our understanding of potential seabird behavioural responses to wind farms and associated collision risk. Data produced during this survey campaign will ultimately be made publicly available, under Open Government Licence, for use by everyone."
        },
        {
            "text": "The data from the surveys will be used to investigate variations in seabird flight heights, develop improved flight height distributions for use in offshore wind farm impact assessments, and inform mitigation to reduce potential impacts. The project will deliver a user-friendly toolkit to facilitate access to, and use of, the outputs, which will also include clear recommendations for data collection, processing, analysis, and practical application of resulting evidence."
        },
        {
            "text": "By combining rigorous validation, cutting‑edge aerial technology, and robust analytical approaches, ReSCUE will strengthen the evidence base needed to balance seabird conservation with the UK’s low‑carbon ambitions, delivering practical tools and knowledge that help protect marine life while enabling sustainable offshore wind development."
        },
        {
            "text": "This project, and Natural England’s role in it, is a great example of working collaboratively to develop the evidence needed to implement better regulations for offshore windfarm development, helping to drive nature recovery alongside economic growth in line with Natural England’s new strategy."
        }
    ]
}