{
    "url": "https://rpc.blog.gov.uk/2026/02/11/the-business-case-for-independent-scrutiny/",
    "title": "The business case for independent scrutiny",
    "authors": [
        "Stephen Gibson, RPC Chair"
    ],
    "categories": [
        "Business engagement"
    ],
    "pub_date": "2026-02-11T08:43:03+00:00",
    "content": [
        {
            "text": "This is the second post in our series on \"Why the RPC matters\" explaining the importance of our independent scrutiny. The first post was on independent scrutiny as the foundation for growth."
        },
        {
            "text": "When the UK's leading business organisations speak with one voice, it's worth paying attention to."
        },
        {
            "text": "Across sectors – from manufacturing to hospitality, from small enterprises to major corporations – business leaders consistently make the same point: the RPC’s independent scrutiny of regulation matters."
        },
        {
            "text": "This isn't about opposing regulation. Businesses understand that well-designed rules protect workers, consumers, and fair competition. What they need is confidence that regulation is built on solid evidence – that someone independent has checked the analysis before policy proposals become law."
        },
        {
            "text": "For manufacturers navigating complex supply chains and international competition, poorly-evidenced regulation isn't just frustrating – it's a competitive disadvantage. Independent scrutiny helps ensure that when government acts, it acts on the basis of robust analysis."
        },
        {
            "text": "The hospitality sector, which employs over 3 million people across the UK, depends on regulatory decisions being proportionate and well-informed."
        },
        {
            "text": "And it's not just large sectors. Small businesses – the backbone of the UK economy – benefits perhaps most of all from independent scrutiny that considers whether regulations can be designed to avoid disproportionate burdens."
        },
        {
            "text": "The Institute of Directors captures the broader principle:"
        },
        {
            "text": "Independent scrutiny isn't red tape. It's the mechanism that helps ensure regulation achieves its intended purpose without imposing excessive costs or unintended consequences. When business leaders across every sector unite behind this principle, it reflects a shared understanding: good evidence makes better regulation, and better regulation supports sustainable growth."
        },
        {
            "text": "🔗 Read more about how independent scrutiny supports better regulation: https://www.gov.uk/government/organisations/regulatory-policy-committee"
        }
    ]
}