{
    "url": "https://defraenvironment.blog.gov.uk/2026/02/11/the-national-landscapes-association-your-natural-partner-championing-nature-people-and-place/",
    "title": "The National Landscapes Association: Your Natural Partner, championing nature, people and place",
    "authors": [
        "Hannah Wilcox-Brooke"
    ],
    "categories": [
        "Community",
        "Nature"
    ],
    "pub_date": "2026-02-11T09:36:18+00:00",
    "content": [
        {
            "text": "With some of the world’s rarest and most precious habitats from chalk streams to ancient rainforests, the UK’s National Landscapes are some of our most cherished places. Formerly known as Areas of Outstanding Natural Beauty, these landscapes are protected in the nation’s interest, and while they cover around 15% of England, the benefits they bring to wildlife and ecosystem radiate far beyond their boundaries.  "
        },
        {
            "text": "More than two-thirds of the population live within a 30-minute journey time of a National Landscape and they welcome millions of visitors annually. National Landscapes cover an even larger total area than our National Parks, and include some of our most iconic landscapes, including the Cotswolds, North Pennines and the Chilterns. "
        },
        {
            "text": "For 70 years, National Landscapes have delivered for nature and communities through collaboration and stewardship. They are spaces where people and nature thrive together, providing vital ecosystem services that sustain economies, tourism, wildlife, and recreation.  "
        },
        {
            "text": "I’m Hannah Wilcox-Brooke, Head of Nature based solutions at the National Landscapes Association, and in this post I’m excited to tell you about some of our work. "
        },
        {
            "text": "For the first time in National Landscape Association history, we are partnering with businesses to help meet ambitious nature recovery targets to protect our iconic landscapes. "
        },
        {
            "text": "Opening the door to private partnerships in protected landscapes "
        },
        {
            "text": "Launched in November 2024, Your Natural Partner is a Defra-funded initiative led by the National Landscapes Association.The platform connects businesses with local environmental projects that are part of established long-term plans, helping to deliver genuine benefits for both communities and nature. "
        },
        {
            "text": "Public funding has already unlocked extensive nature recovery and community benefits in protected areas, but the scale of the environmental challenges faced globally need wider participation.  "
        },
        {
            "text": "Your Natural Partner makes it easy for businesses to explore the portfolio of nature recovery and community projects across all 46 National Landscapes in one place, streamlining their journey to finding credible partners that deliver positive, measurable outcomes across climate, nature, economy, and communities. "
        },
        {
            "text": "Across the country, experienced National Landscape teams are already delivering agile and landscape-led nature restoration projects across government and private sectors. Let’s discuss a few examples below.  "
        },
        {
            "text": "Delivering catchment-scale river recovery, Blackdown Hills National Landscape "
        },
        {
            "text": "For decades, the River Culm has faced intensifying environmental problems including flooding, drought, decreased water quality, and biodiversity loss. These issues have intensified due to climate change, with flooding a recurring major issue. When this happens, a major railway line serving the south west is severely affected, inflicting millions of pounds of damage on businesses and communities alike. "
        },
        {
            "text": "The Connecting the Culm project is working with nature and local communities to help make the river and its catchment more biodiverse and resilient to flood and drought. Working with clusters of landowners, it takes a holistic approach to strengthening the river’s flood defences naturally, aiming to protect 200 properties and businesses from flooding while boosting biodiversity. "
        },
        {
            "text": "Through strategic nature-based interventions, the team has ambitious, science-backed targets to reach by 2030. Work is underway with initial partners on board, and the project is now seeking further funding, offering tailored packages that work for everyone. Every business is unique and we take the time to understand partners’ priorities and tailor a solution that makes sense for your teams and stakeholders. "
        },
        {
            "text": "Restoring globally-significant peatland, North Pennines "
        },
        {
            "text": "Covering around 12% of the UK, peatlands are one of the country’s most powerful natural climate assets, yet in their degraded state they emit more than three million tonnes of carbon every year. "
        },
        {
            "text": "Wetland ecosystems that store huge amounts of carbon, support a diverse range of species, improve water quality and help to regulate flow, reducing flood risk.  "
        },
        {
            "text": "Since 2006, the North Pennines National Landscape has delivered one of the UK’s most ambitious peatland restoration programmes, restoring over 50,000 hectares — an area four times the size of Newcastle. Backed by millions of pounds of private finance, the delivery team works collaboratively with landowners, communities and public bodies to halt emissions and lock carbon back into the soil, delivering measurable results on the ground. "
        },
        {
            "text": "This proven, landscape-scale programme is seeking forward-thinking partners to support its carbon-positive projects, with the potential to purchase high-integrity credits as part of their contribution.  "
        },
        {
            "text": "Community, culture and inclusion, Dorset National Landscape "
        },
        {
            "text": "Nature Buddies is designed to overcome the physical and interpersonal barriers that prevent many people from accessing nature. Through trained volunteers providing one-to-one support, the programme enables individuals — particularly disabled people and those facing additional challenges — to experience and enjoy the outdoors safely and confidently. "
        },
        {
            "text": "With additional funding, the team can recruit and upskill new volunteers, embed Nature Buddies as a long-term service, and expand its reach across the area. Alongside initiatives such as FLAVOURS, which brings underserved communities together through shared meals and locally grown food, Nature Buddies demonstrates how inclusive projects can deliver lasting social impact."
        },
        {
            "text": "A collaborative effort across protected landscapes "
        },
        {
            "text": "This new offer is the result of over two years of scoping and engagement led by the National Landscapes Association, supported by the National Parks Partnerships team, and endorsed and funded by Defra. It reflects a growing recognition that England’s protected landscapes are stronger together and is just the beginning.  "
        },
        {
            "text": "Last month, teams from National Landscapes and National Parks came together at the Protected Landscapes Forum to showcase their commercial offers to businesses. It is a clear signal of a new era: one where protected landscapes are not only places of beauty, but active partners in delivering nature recovery, climate resilience and social value. "
        },
        {
            "text": "By opening up partnership opportunities, and by working collaboratively across landscapes, England is demonstrating how protected areas can lead the way, retaining the UK’s reputation as a global innovator in nature recovery, while safeguarding the places people love, now and for generations to come. "
        },
        {
            "text": "Visit Your Natural Partner and start discovering projects in the UK’s National Landscapes. "
        }
    ]
}