{
    "url": "https://nda.blog.gov.uk/wisdom-from-women-in-nuclear-advice-for-women-and-girls-in-science/",
    "title": "Wisdom from women in nuclear: advice for women and girls in science",
    "authors": [
        "traceyscott"
    ],
    "categories": [
        "diversity",
        "Early careers",
        "Recruitment",
        "Skills"
    ],
    "pub_date": "2026-02-11T11:25:46+00:00",
    "content": [
        {
            "text": "To mark International Day of Women and Girls in Science, we asked some of our female leaders from across the Nuclear Decommissioning Authority (NDA) group to share their advice for a female apprentice starting out in the nuclear industry. Here’s what they told us."
        },
        {
            "heading": 2,
            "text": "Jenny James, Horizon Scanning Manager, NDA"
        },
        {
            "text": "\"I began my career in marine biology, spending years knee‑deep in seawater as a field assistant before diving into a PhD exploring how ocean acidification affects marine life. That curiosity about how environments change and how we can prepare for change led me into futures and foresight work at the Environment Agency, which ultimately led me to my role today as Horizon Scanning Manager at the NDA."
        },
        {
            "text": "\"My advice would be trust your instincts, always choose the most interesting path, refuse to sit still, and keep learning – because exploring the unknown has always been the most enjoyable part of my career.\""
        },
        {
            "heading": 2,
            "text": "Dawn Watson, Head of Strategy and Technical in Infrastructure, Sellafield"
        },
        {
            "text": "Deputy Chair of the Cumbria branch of Women in Nuclear UK and Co‑chair of the SL Gender Balance Network"
        },
        {
            "text": "\"The nuclear industry is varied, complex and exciting. Make sure you take any opportunity that is put your way, and don’t be afraid of asking questions and talking to people about their experiences."
        },
        {
            "text": "\"You can have a fulfilling career in the industry – right from being an apprentice or graduate through to retirement. The industry is so varied that there is always a different avenue to pursue if you want it.\""
        },
        {
            "heading": 2,
            "text": "Ellie Jones, Electrical, Control and Instrumentation Engineer (Degree Apprentice), NRS"
        },
        {
            "text": "\"My advice to any female apprentice starting out in the nuclear industry is to trust yourself and not be afraid to step outside your comfort zone."
        },
        {
            "text": "\"Back yourself, be curious, and take every opportunity that comes your way."
        },
        {
            "text": "\"There’s so much to get excited about in this sector, especially in decommissioning, your perspective is so valuable and you absolutely belong here.\""
        },
        {
            "heading": 2,
            "text": "Dr Naomi Mawby, Shaft and Silo Programme Director, NRS Dounreay"
        },
        {
            "text": "\"Be curious, spend as much time with your boots on the ground as you can, learn as much as you can about the sites and how facilities work. Say yes to opportunities – there is no wrong career pathway! I started my career in sciences as a geologist, then moved into nuclear in various roles at Sellafield, then Nuclear Waste Services and now two decades on I lead a major programme at the NRS Dounreay Site in north Scotland. "
        },
        {
            "text": "\"Our industry has so many interesting areas to work, don’t be afraid to try different areas, even if it feels a bit scary until you find the area you love to work in! Be open to new experiences, learn from colleagues around you and just as important make some new friends and connections along the way.\""
        },
        {
            "heading": 2,
            "text": "Becky Ruddy, FCA Programme Director, NRS Dounreay"
        },
        {
            "text": "\"Take every opportunity that comes your way—especially the ones that make you feel uncomfortable. Those are the moments that stretch you, help you grow, and build your confidence, even if they feel daunting at the time."
        },
        {
            "text": "\"Most of all, enjoy your apprenticeship. Soak up every experience. I look back on my own time as an apprentice with such fantastic memories: the outward bound challenges, the life skills gained, the friendships made, and the relationships that have stayed with me for more than 23 years. These early years shape you in ways you don’t see until much later, so embrace them fully.\""
        },
        {
            "heading": 2,
            "text": "Tracy Badham, Social Responsibility Manager, NWS"
        },
        {
            "text": "\"NWS is committed to inspiring women and girls to see STEM careers as exciting, achievable pathways for their future. Through our partnership programmes—such as the Dream Placement initiative with the Centre for Leadership Performance—we showcase the breadth of roles and opportunities available across NWS, helping young people connect with real careers and real role models."
        },
        {
            "text": "\"Inspiration begins early. Our primary school outreach delivers three engaging STEM workshops, each supported by a dedicated workbook, an animated film, and hands‑on experiments. These sessions are designed to spark curiosity, build confidence, and show students that STEM is creative, inclusive, and full of possibility.\""
        },
        {
            "heading": 2,
            "text": "Liz Holland, Principal Shielding Specialist, NTS"
        },
        {
            "text": "\"The most valuable guidance I would offer to an apprentice is to ask questions, learn as much as you can and speak up. Sharing your ideas contributes to a diversity of thought that can drive innovation within the team. While it may seem challenging to speak up amongst more experienced colleagues, insightful contributions often arise from those who bring a fresh perspective!\""
        }
    ]
}