{
    "url": "https://actuaries.blog.gov.uk/2023/02/17/climate-and-environment-review-of-2022/",
    "title": "Climate and Environment Review of 2022",
    "authors": [
        "Will Stobbs - Junior Trainee Actuary"
    ],
    "categories": [
        "Actuary",
        "Analysis",
        "Climate change"
    ],
    "pub_date": "2023-02-17T18:13:47+00:00",
    "content": [
        {
            "text": "Climate change was evident across the world in 2022. From devastating floods impacting an estimated 33 million people in Pakistan, to wildfires causing destruction across Europe, and temperatures in the UK reaching a record-breaking 40.3°C."
        },
        {
            "text": "In late 2021 the Glasgow Climate Pact formalised the Paris Agreement goal of limiting global warming to 1.5°C above pre-industrial levels by 2100. It also asked countries to put improved emission-cutting targets in place by COP27."
        },
        {
            "text": "However, a report from the UN Environment Programme released just days before the start of COP27 warned there is still ‘no credible pathway’ to 1.5°C. Even if nationally determined contributions are implemented in full, the paper warns that temperatures would still rise 2.4°C above pre-industrial levels by the year 2100."
        },
        {
            "text": "This matters because even relatively small temperature differences can significantly impact our future planet."
        },
        {
            "text": "The IPCC (Intergovernmental Panel on Climate Change) estimates that warming of 2°C, as opposed to the 1.5°C goal, will cause sea levels to rise by an extra 10cm by the year 2100. This could result in millions more people experiencing extreme heatwaves, droughts and exposure to climate risks and poverty."
        },
        {
            "heading": 2,
            "text": "Causes for optimism"
        },
        {
            "text": "However, in 2022 there was some progress made to tackle climate change. COP27, held in Egypt in November, resulted in a historic agreement to form a ‘loss and damage’ fund. This aims to compensate lower income countries, who did little to cause the climate crisis but are heavily exposed to its impacts, using funds from richer countries who were responsible for large historical emissions."
        },
        {
            "text": "In the UK the Climate Change Committee’s 2022 progress report to Parliament stated that the UK government has a solid net zero strategy, in line with the Paris Agreement, in place. However, it also identified challenges in achieving these ambitious targets which will need to be addressed in future years."
        },
        {
            "text": "Elsewhere in the world, US President Joe Biden passed the largest climate-related bill in US history. The bill pledged almost $370bn into renewables, electric vehicles, heating and greater efficiency. In Australia emission reduction targets were significantly increased from 26% to 43% of 2005 levels by 2030."
        },
        {
            "text": "Brazil elected a new president, Luiz Inácio Lula da Silva, who promises a better-protected Amazon. The world’s largest emitter, China, has also made progress - including plans to plant 70 billion trees by 2030 alongside a successful uptake of electric vehicles."
        },
        {
            "heading": 2,
            "text": "Climate change work at GAD"
        },
        {
            "text": "At the Government Actuary’s Department (GAD) we are busy working on an increasing number of climate-related projects."
        },
        {
            "text": "Over recent years, climate disclosure requirements, including the Taskforce on Climate Related Financial Disclosures (TCFD), have been widely adopted across the UK economy."
        },
        {
            "text": "At GAD we have been working closely with HM Treasury – supporting them in their plan to embed similar disclosure requirements in central government for the 2025-26 annual reports and accounts, and support adoption across the wider public sector."
        },
        {
            "text": "Risk management, including the use of climate scenario analysis, is a central aspect of these disclosure requirements, and one where GAD is ideally placed to support departments."
        },
        {
            "text": "This year we expect to be busier than ever - supporting HM Treasury in the drafting of risk management guidance for the public sector and working closely with central government departments that are early adopters of disclosure recommendations."
        },
        {
            "text": "Elsewhere, we are continuing to embed climate scenario analysis across a range of workstreams, including the actuarial valuations GAD undertakes for around 20 public service pension schemes that are due to be published in later this year."
        },
        {
            "text": "We are also supporting departments realise their net zero ambition. For example, we have been working closely with the Department for Education, including providing financial modelling to help them decarbonise. This has included converting school minibus fleets to electric vehicles and identifying schools most in need of heating system updates."
        },
        {
            "heading": 2,
            "text": "Looking forward"
        },
        {
            "text": "As we look forward to what the rest of 2023 has in store, we are excited to be attending the upcoming Civil Service Environment Network Conference on 21 February. We have a stall and session at the conference and look forward to seeing you there if you are attending."
        },
        {
            "text": "With our world’s climate challenge as urgent as ever, we will also continue working with other public sector organisations to help them better understand and communicate their climate-related risks."
        },
        {
            "heading": 3,
            "text": "Disclaimer"
        },
        {
            "text": "The opinions in this blog post are not intended to provide specific advice. For our full disclaimer, please see the About this blog page."
        }
    ]
}