{
    "url": "https://forestrycommission.blog.gov.uk/2023/02/17/forestry-apprenticeship-your-questions-answered/",
    "title": "Forestry Apprenticeship: Your questions answered",
    "authors": [
        "Gareth Hopkins"
    ],
    "categories": [
        "Careers",
        "Our Staff",
        "Woodland management"
    ],
    "pub_date": "2023-02-17T10:16:54+00:00",
    "content": [
        {
            "text": "During National Apprenticeship Week (6 to 12 February), we held a live #AskAnApprentice Twitter Q&A to give you the opportunity to ask myself and our panel of experts (below) about our Forestry Apprenticeship."
        },
        {
            "text": "We had 18 questions during the two-hour session and have captured many of them here, along with the answers, to help anyone who is considering applying, and those who are currently completing their applications."
        },
        {
            "text": "Remember, the submission deadline is 23.55 on Sunday 26 February.  Successful applicants will start in September 2023."
        },
        {
            "text": "I have a university degree, but applied because I wanted a complete career change. It's an amazing way to enter a career in Forestry. You don't need lots of prior knowledge, but will gain an excellent understanding of the sector through the 3 years of the apprenticeship - Charlie"
        },
        {
            "text": "I graduated from uni in 2004 and spent 15 years working in the railway industry before joining the programme. Having a range of transferable skills from both experiences has helped me settle into the programme - Gareth B"
        },
        {
            "text": "Yes, you can apply if you already have a degree as long as your current degree is not in Forestry or a related subject. If you would like further clarification then please email dwoenquiries@forestrycommission.gov.uk - Gareth H"
        },
        {
            "text": "The assessment centre was strangely enjoyable. Everyone from the Forestry Commission wanted to support you to do the best that you could and the range of tasks meant that there was an opportunity for everyone to demonstrate their strengths - Gareth B"
        },
        {
            "text": "I found myself at ease with the interview and assessment process, I ended up really enjoying the assessment day! I was encouraged to be myself and that is the advice I would give to future applicants, be yourself and show your genuine enthusiasm for the topic - Lara"
        },
        {
            "text": "I actually loved the assessment day! It had a really good mix of different tasks in addition to the interview - my top tip would be not to worry about having loads of knowledge about Forestry, but to show that you're interested, enthusiastic, and determined to learn - Charlie"
        },
        {
            "text": "It's an entry requirement for the degree-level apprenticeship that all applicants must have a level 2 in English and Maths. Functional skills level 2 courses are available and can be completed before the apprenticeship starts - Mark"
        },
        {
            "text": "The ESFA funding rules for apprenticeships require analysis of prior experience and skills and the programme has to deliver \"new learning\".  Someone with 2 years of undergraduate study would have too much prior knowledge to qualify for the apprenticeship - Mark"
        },
        {
            "text": "We are looking for two 250 word statements, one for each of the behaviour questions. Remember to use the STAR format. Situation Task Action and Result - Gareth H"
        },
        {
            "text": "Work days are very varied. Yesterday Lara and I went on our first independent site visit to look at a felling licence application in an urban woodland, last week I visited a woodland creation site on an estate in Norfolk and next week will be carrying out some tariffing (measuring woodlands) for Forestry England. Our manager also helps to make sure we have enough time to do our academic work - Gareth B"
        },
        {
            "text": "Vehicles will be made available for all work activities such day-to-day work, travelling to sites, travelling to the university and other training events. These vehicles will not be available for private use. Travelling to and from your host office location will be at the discretion of your local area team, depending on location within your normal working area - Gareth H"
        },
        {
            "text": "Every week is varied, but in general I'd say I'm out on sites 2-3 days per week, at the office/working from home 1-2 days per week, and studying 1 day each week - Charlie"
        },
        {
            "text": "The degree apprenticeship does not require a driving licence. However, most employers would require their employees to be able to travel independently to carry out their roles - Mark"
        },
        {
            "text": "Applications are open across five Forestry Commission area teams in England. You can see the list here: https://gov.uk/guidance/apply-for-a-forestry-apprenticeship… - Gareth H"
        },
        {
            "text": "We don't have examples of career progression yet as we're only in the 1st year of the 3-year programme. But there's a wide range of opportunities that would be open following successful completion, such as Woodland Officers, Beat Foresters, Estate Foresters, woodland manager, site managers...roles across the forestry sector, not just with the Forestry Commission - Gareth H"
        },
        {
            "text": "On completion of the apprenticeship, individuals have the opportunity to present for Professional Membership Entry (PME) with @TheICF. A degree-level qualification, a couple of years of practical experience and the title of Chartered Forester, the world's your oyster! - Stuart"
        },
        {
            "text": "We have a friendly otter in the river next to the office here in Santon Downham and it is always a highlight to see.  Dogs are also welcome in the office. Our resident office dog, Ash, always comes to check up on us. Bringing it back to trees though, some of the veteran trees that we encounter are truly spectacular and really do make the job special - Gareth B"
        },
        {
            "text": "I love the variety of birds I see while out and about at work. Last week I came across a curlew in some private woodland...It's great to encounter them more now that I work outside more frequently - Charlie"
        },
        {
            "text": "Minimum entry requirements are: Maths - GCSE pass at grade C or 4 and above. Minimum of 96 UCAS points - these can be made up in several ways. Applications can be made by individuals who do not hold the required UCAS points with applicants demonstrating associated skills at the same or a higher level obtained outside academic study, such as work experience. Applications made in this way will require individual evaluations by the University administration team before enrolment onto the programme - Gareth H"
        },
        {
            "text": "It’s up to 9 months of work experience to help embed learning. We are still working on those opportunities but they will be from across the forestry sector - Gareth H"
        },
        {
            "text": "I volunteered for 8 months with the National Trust, where I had the chance to understand land management from a practical point of view as well as some of the administrative procedures that are involved in land management such as woodland management plans - Lara"
        },
        {
            "text": "I volunteered with Conservation Volunteers, Yorkshire Wildlife Trust, and at tree-planting events on my city council's Woodland Creation Scheme before applying. While such experience is not essential for applying for the role, I think showing interest and engagement through volunteering in related areas is beneficial - Charlie"
        },
        {
            "text": "When I first decided to make a career change I had little experience in forestry or the environment sector, so began volunteering with my local Wildlife Trust. At first this was coppicing for half a day at weekends, but then I secured a 6 month volunteer role that helped me gain practical skills and woodland management experience - Gareth B"
        },
        {
            "text": "The apprenticeship contains the same modules as the non-apprenticeship undergraduate degree course but taught in a different format - 1 week of teaching roughly every 6 to 8 weeks either at Cumbria or Cannock Chase with online tutorials and self-directed study occurring in the weeks between teaching. There is no summer break! Our final modules of 1st and 2nd Year run in July & August - Mark"
        }
    ]
}