{
    "url": "https://educationhub.blog.gov.uk/2023/02/17/how-we-are-protecting-children-and-young-people-from-dangerous-ideologies-including-right-wing-extremism/",
    "title": "How we are protecting children and young people from dangerous ideologies including right-wing extremism",
    "authors": [
        "media officer"
    ],
    "categories": [
        "Child protection",
        "Schools"
    ],
    "pub_date": "2023-02-17T11:23:17+00:00",
    "content": [
        {
            "text": "Education plays a vital role in preparing our children and young people for life in a modern and diverse Britain."
        },
        {
            "text": "Protecting pupils from the risk of radicalisation forms part of schools’ wider safeguarding duties, alongside protecting children from other harms, such as drugs, criminal and sexual exploitation."
        },
        {
            "text": "Here’s what you need to know about how we are protecting children and young people from dangerous ideologies."
        },
        {
            "heading": 3,
            "text": "Why is there a need for this in schools? "
        },
        {
            "text": "There’s no single way of identifying whether a child, young person or adult learner is likely to be susceptible to an extremist ideology or vulnerable to radicalisation. The process of radicalisation is different for every individual and can take place over a long period, or it can be very quick."
        },
        {
            "text": "However, there are things that education settings can do to counter extreme ideologies and build their students’ resilience to radicalisation and extremism, such as teaching about extreme right-wing ideologies, Islamist extremism or discussing fundamental British values with students."
        },
        {
            "text": "Children and young people are vulnerable to radicalisation and schools have a crucial role in protecting them or if needed, referring them via the Government’s Prevent programme, which you can read more about below."
        },
        {
            "heading": 3,
            "text": "What support do you offer teachers? "
        },
        {
            "text": "In 2016, we launched the Educate Against Hate website, through which we have provided over 100 free resources for teachers and school leaders to support the promotion of these values."
        },
        {
            "text": "The website provides teachers, school leaders and parents with the information, guidance and support they need to challenge radical views and keep children safe, including from online extremist influences."
        },
        {
            "text": "We regularly create and add new resources to the site, such as the interactive learning platform ‘Going Too Far?’ which teaches young people about staying safe online from radicalisation and other forms of harm."
        },
        {
            "text": "We have also issued further practical guidance for schools, further education providers, higher education providers and childcare providers to help them understand how to implement the duty, as well as offering a range of online training, including the Home Office’s Prevent e-learning platform"
        },
        {
            "heading": 3,
            "text": "What about keeping children safe from these ideologies online?"
        },
        {
            "text": " Keeping children safe online is essential."
        },
        {
            "text": "Our statutory safeguarding guidance ‘Keeping children safe in education’ (KCSIE) provides schools and colleges with information on what they should be doing to protect pupils and students online."
        },
        {
            "text": "All schools and colleges must have regard to this when carrying out their duties to safeguard and promote the welfare of children. This includes insuring that filtering and monitoring systems are in place and regularly review their effectiveness to protect children when they are online on the school or college's IT systems."
        },
        {
            "text": "The following resources provide guidance for parents and carers to keep children safe online."
        },
        {
            "heading": 3,
            "text": "What exactly is Prevent?"
        },
        {
            "text": "Prevent is a government programme that provides early intervention to divert adults and children who may be susceptible to any form of extremism or radicalisation."
        },
        {
            "text": "The aim is to act early by spotting the warning signs of an individual at risk of being drawn or groomed into extremist and terrorism ideologies and provide early intervention and support."
        },
        {
            "text": "The Prevent duty requires schools (and many other bodies and institutions, including local authorities, universities and early years providers) to “have due regard to the need to prevent people from being drawn into terrorism.”"
        },
        {
            "text": " "
        },
        {
            "text": " "
        }
    ]
}