{
    "url": "https://food.blog.gov.uk/2023/02/17/join-our-science-advisory-committees-in-2023/",
    "title": "Join our Science Advisory Committees in 2023",
    "authors": [
        "Professor Robin May, Chief Scientific Adviser"
    ],
    "categories": [
        "Science"
    ],
    "pub_date": "2023-02-17T12:29:00+00:00",
    "content": [
        {
            "text": "Cymraeg"
        },
        {
            "text": "We're looking for new members to join our Scientific Advisory Committees (SACs). The work of these independent committees is critical in ensuring that our advice to consumers is based on the best and most recent scientific evidence."
        },
        {
            "text": "This year, for the first time, we are looking for both full members and associate members. The latter category is specifically aimed at early and mid-career researchers, who perhaps don’t have a long track record in their field but who nonetheless would be able to bring important insights to the work of the FSA."
        },
        {
            "text": "The FSA is responsible for food safety risk assessment and providing risk management advice to Ministers. The SACs are a crucial part of our risk analysis process, providing us with invaluable advice to ensure excellent safety standards and effective, proportionate regulation of food and feed in the UK."
        },
        {
            "text": "SAC members are appointed from a wide range of disciplines and include specialist academics, experienced practitioners and consumer representatives. You can find out more about the kind of people we are looking for here: Apply now to join our Scientific Advisory Committees."
        },
        {
            "text": "In the meantime, let's hear from some current members about their experiences of being on one of our Scientific Advisory Committees."
        },
        {
            "text": "Taking part are:"
        },
        {
            "heading": 2,
            "text": "What made you initially apply to be on one of the FSA’s Science Advisory Committees?"
        },
        {
            "text": "Dr Michael Routledge, COT: \"I believe that academics have a responsibility to contribute to public service. I saw this as an opportunity to apply my knowledge and to contribute to an important area of public health and safety.\""
        },
        {
            "text": "Dr Edward Fox, ACMSF: \"The opportunity to contribute my knowledge in ways that could help maintain the high food standards of the UK was an exciting and appealing one.”"
        },
        {
            "text": "\"Participating in the SACs allows you to use your expertise to help critically assess and evaluate key issues to food safety and quality facing modern food production. The broad experience and specialities of the Committee members also ensures the consideration of these issues from the viewpoint of all stakeholders, from Consumer to Industry to Government.\""
        },
        {
            "heading": 2,
            "text": "What has been a personal highlight of being on one of the Committees?"
        },
        {
            "text": "Dr Camilla Alexander-White, ACNFP: \"Interdisciplinarity is a vital aspect of the FSA committee on which I serve. As such I’ve continued learning about other specialisms than my own. Personally, I have developed more skills for bringing complex science into policymaking, and through rigorous work as a team, we have made sure only products that are shown to be safe for consumption are supported.\" "
        },
        {
            "heading": 2,
            "text": "How has being on one of the Committees positively influenced your career?"
        },
        {
            "text": "Professor Peter McClure, ACMSF: \"There is the acknowledgement that becoming a member of the committee is confirmation that my own skills and competencies are at a level that is valued and recognised outside my own organization."
        },
        {
            "text": "\"This has allowed me to progress my career further down the technical path where I can develop and share technical best practice and new knowledge with colleagues that I work with.\""
        },
        {
            "text": "Dr Camilla Alexander-White, ACNFP: \"Being on a scientific advisory committee has given me new connections, and I’ve been able to stay informed of the latest regulatory developments. The work I have done for the FSA builds on my reputation for being a credible independent scientific expert adviser in my field.\""
        },
        {
            "text": "Dr Edward Fox, ACMSF: \"The opportunity to engage with experts from so many different facets of the food system and discuss key issues and challenges facing the food industry. It has been hugely informative and widened my appreciation of these issues from different viewpoints. There is also an opportunity to meet leading food science experts from across the UK and beyond, and to build new relationships.\""
        },
        {
            "heading": 2,
            "text": "What would you say to someone interested in joining one of the committees?"
        },
        {
            "text": "Dr Edward Fox, ACMSF: \"To anyone with a passion for food science and safety, looking for an opportunity to use their expertise and knowledge to make a contribution to UK food standards, I would say pursuing an opportunity to participate in one of the SACs is definitely worth doing!\""
        },
        {
            "text": "Dr Camilla Alexander-White, ACNFP: \"I have had a very positive experience over eight years serving on an FSA Science Advisory Committee. The FSA really values the scientific advice it receives and you will feel like you are contributing to the national effort to keep our food safe and of high quality.\""
        },
        {
            "heading": 2,
            "text": "Applications are open"
        },
        {
            "text": "Apply now to join our Scientific Advisory Committees. To learn more about each SAC, see the work they do and read what's happened in previous meetings, please head to our Scientific Advisory Committees hub."
        },
        {
            "heading": 1,
            "text": "Ymunwch â’n Pwyllgorau Cynghori Gwyddonol"
        },
        {
            "text": "Rydym yn chwilio am bobl newydd i ymuno â’n Pwyllgorau Cynghori Gwyddonol (SACs). Mae gwaith y pwyllgorau annibynnol hyn yn hanfodol i sicrhau bod ein cyngor i ddefnyddwyr yn seiliedig ar y dystiolaeth wyddonol orau a mwyaf diweddar."
        },
        {
            "text": "Eleni, am y tro cyntaf, rydym yn chwilio am aelodau llawn ac aelodau cyswllt. Mae’r ail gategori wedi’i anelu’n benodol at ymchwilwyr ar ddechrau a chanol eu gyrfa, sydd efallai heb hanes hir yn eu maes ond a fyddai, serch hynny, yn gallu dod â mewnwelediadau pwysig i waith yr Asiantaeth Safonau Bwyd (ASB)."
        },
        {
            "text": "Mae’r ASB yn gyfrifol am asesu risg diogelwch bwyd a darparu cyngor rheoli risg i Weinidogion. Mae’r Pwyllgorau Cynghori Gwyddonol yn rhan hanfodol o’n proses dadansoddi risg, gan roi cyngor amhrisiadwy er mwyn i ni allu sicrhau safonau diogelwch rhagorol a rheoleiddio effeithiol a chymesur ar fwyd a bwyd anifeiliaid yn y DU."
        },
        {
            "text": "Penodir aelodau SAC o ystod eang o ddisgyblaethau gan gynnwys academyddion arbenigol, ymarferwyr profiadol a chynrychiolwyr defnyddwyr. Gallwch ddarganfod mwy am y math o bobl rydym yn chwilio amdanynt yma: Gwnewch gais nawr i ymuno â’n Pwyllgorau Cynghori Gwyddonol."
        },
        {
            "text": "Yn y cyfamser, dyma ambell air gan aelodau presennol am eu profiadau o fod yn rhan o’n Pwyllgorau Cynghori Gwyddonol."
        },
        {
            "text": "Byddwn yn clywed gan:"
        },
        {
            "heading": 2,
            "text": "Pam aethoch chi ati i wneud cais i fod ar un o Bwyllgorau Cynghori Gwyddonol yr ASB?"
        },
        {
            "text": "Dr Michael Routledge, COT: “Rwyf o’r farn fod cyfrifoldeb ar academyddion i gyfrannu at wasanaeth cyhoeddus. I mi, roedd hwn y gyfle i ddefnyddio fy ngwybodaeth ac i gyfrannu at faes pwysig o iechyd a diogelwch y cyhoedd.”"
        },
        {
            "text": "Dr Edward Fox, ACMSF: “Roedd yn gyfle cyffrous i gyfrannu fy ngwybodaeth mewn ffyrdd a allai helpu i gynnal safonau bwyd uchel y Deyrnas Unedig, ac roedd hynny’n apelio’n fawr ataf i.”"
        },
        {
            "text": "“Mae cymryd rhan yn y Pwyllgorau Gwyddoniaeth yn gyfle i ddefnyddio eich arbenigedd i asesu a gwerthuso materion diogelwch ac ansawdd bwyd allweddol sy’n wynebu’r maes cynhyrchu bwyd yn yr oes sydd ohoni. Mae profiad ac arbenigedd eang aelodau’r Pwyllgor hefyd yn sicrhau bod y materion hyn yn cael eu hystyried o safbwynt yr holl randdeiliaid, o’r defnyddiwr i'r diwydiant i'r Llywodraeth.”"
        },
        {
            "text": " "
        },
        {
            "heading": 2,
            "text": "Nodwch un uchafbwynt personol o fod yn rhan o un o’r Pwyllgorau"
        },
        {
            "text": "Dr Camilla Alexander-White, ACNFP: “Mae rhyngddisgyblaeth yn agwedd hanfodol y pwyllgor yr wyf yn rhan ohono. Yn hynny o beth, rwyf wedi parhau i ddysgu am arbenigeddau sy’n wahanol i fy rhai i. Yn bersonol, rydw i wedi gwella fy sgiliau wrth gyflwyno gwyddoniaeth gymhleth i waith llunio polisi a, thrwy weithio’n drylwyr fel tîm, rydym wedi sicrhau mai dim ond cynhyrchion diogel y gellir profi eu bod yn ddiogel i’w bwyta, sy'n cael eu cefnogi.”"
        },
        {
            "text": " "
        },
        {
            "heading": 2,
            "text": "Sut mae bod ar un o’r Pwyllgorau wedi dylanwadu’n gadarnhaol ar eich gyrfa?"
        },
        {
            "text": "Yr Athro Peter McClure, ACMSF: “Mae dod yn aelod o’r pwyllgor yn gadarnhad bod gennyf sgiliau a chymwyseddau sy’n cael eu gwerthfawrogi a’u cydnabod y tu allan i’m sefydliad fy hun."
        },
        {
            "text": "“Mae hyn wedi caniatáu i mi ddatblygu fy ngyrfa ymhellach i lawr y llwybr technegol, lle gallaf ddatblygu a rhannu arferion gorau technegol a gwybodaeth newydd gyda fy nghydweithwyr.”"
        },
        {
            "text": "Dr Camilla Alexander-White, ACNFP: “Mae bod ar bwyllgor cynghori gwyddonol wedi rhoi cysylltiadau newydd i mi, ac rydw i wedi gallu cael yr wybodaeth ddiweddaraf am y datblygiadau rheoleiddio diweddaraf. Mae’r gwaith rydw i wedi’i wneud i’r ASB yn adeiladu ar fy enw da am fod yn gynghorydd arbenigol gwyddonol annibynnol credadwy yn fy maes.”"
        },
        {
            "text": "Dr Edward Fox, ACMSF: “Y cyfle i ymgysylltu ag arbenigwyr o nifer o wahanol agweddau ar y system fwyd a thrafod materion a heriau allweddol sy’n wynebu’r diwydiant bwyd. Mae wedi bod yn addysgiadol iawn ac wedi ehangu fy ngwerthfawrogiad o’r materion hyn o wahanol safbwyntiau. “Mae cyfle hefyd i gwrdd ag arbenigwyr gwyddor bwyd blaenllaw o bob rhan o’r DU a thu hwnt, a meithrin perthnasoedd newydd.”"
        },
        {
            "text": " "
        },
        {
            "heading": 2,
            "text": "Beth fyddech chi’n ei ddweud wrth rywun sydd â diddordeb mewn ymuno ag un o’r pwyllgorau?"
        },
        {
            "text": "Dr Edward Fox, ACMSF: “I unrhyw un sydd ag angerdd am wyddoniaeth a diogelwch bwyd, sy’n chwilio am gyfle i ddefnyddio eu harbenigedd a’u gwybodaeth i gyfrannu at safonau bwyd y DU, byddwn i’n dweud ei bod hi’n werth cymryd rhan yn un o’r SACs yn bendant!”"
        },
        {
            "text": "Dr Camilla Alexander-White, ACNFP: “Rwyf wedi cael wyth mlynedd o brofiadau cadarnhaol iawn fel rhan o un o Bwyllgorau Cynghori Gwyddonol yr ASB. Mae’r ASB wir yn gwerthfawrogi’r cyngor gwyddonol gan y Pwyllgorau a byddwch chi’n teimlo eich bod chi’n cyfrannu at yr ymdrech genedlaethol i gynnal ansawdd uchel ein bwyd a’i gadw’n ddiogel.”"
        },
        {
            "text": "Gwnewch gais nawr i ymuno â’n Pwyllgorau Cynghori Gwyddonol. I ddysgu rhagor am bob Pwyllgor, gweld y gwaith maen nhw'n ei wneud a darllen yr hyn sydd wedi digwydd mewn cyfarfodydd blaenorol, ewch i’n tudalen Pwyllgorau Cynghori Gwyddonol."
        }
    ]
}