{
    "url": "https://socialcare.blog.gov.uk/2023/02/17/nursing-associate-stories-challenging-myself-to-deliver-better-care/",
    "title": "Nursing associate stories: challenging myself to deliver better care",
    "authors": [
        "Chelsea Batchelier"
    ],
    "categories": [
        "Care and support",
        "Workforce"
    ],
    "pub_date": "2023-02-17T17:31:41+00:00",
    "content": [
        {
            "heading": 2,
            "text": "From kitchens to caring"
        },
        {
            "text": "My first job in a care home was as a kitchen assistant when I was 16. Being on the floor and delivering food, I found a connection with residents and when I was 18, I became a HCA (Healthcare Assistant)."
        },
        {
            "text": "I wanted to challenge myself because I’ve always had a passion for caring for people and, even though I looked after my grandparents, I was worried I couldn’t do the personal care side of things."
        },
        {
            "text": "I then went to Egypt for four years and returned in January 2020. I started working at Royal Star & Garter in March. I met some of the residents and thought it was an incredible place. I began working there at the start of the pandemic, which proved really difficult as I didn’t know the residents that well, but I could tell how much it was affecting them not being able to see their families. It was heart-breaking."
        },
        {
            "text": "When I joined, I started a Health and Social Care NVQ Level 3, which I completed in just ten weeks! Through hard work and dedication, I became a Lead HCA about seven months later."
        },
        {
            "text": "I heard about the SNA programme soon after I started from Marco (now a qualified NA) and Mercy who had just started the course. My goal was to get into nursing in any way possible, so when the chance came to apply, I did so straight away."
        },
        {
            "heading": 2,
            "text": "Expanding my knowledge and skills"
        },
        {
            "text": "I want to give more to those I support and have a better understanding of the clinical side of care as well. I do so much in my job as a Lead HCA, but the nurses have the paperwork side of everything, the care plans, the medication and end of life care."
        },
        {
            "text": "Being put forward for the SNA course by the charity meant the world to me. I was so proud of myself, and I can’t thank everyone enough for the faith they have in me and their support."
        },
        {
            "text": "I’m looking forward to the course but sometimes I don’t know if I can do it. If I don’t understand something straight away, I instantly doubt myself. But then I go over it again and it becomes clear. This week, I understood everything at university and some of what I learnt I relayed back to my colleagues in the home, so the course isn’t just helping me, it’s helping them to provide better care too."
        },
        {
            "text": "I’m especially looking forward to the placements and working in different settings. Marco and Mercy have been telling me about theirs and I’m so excited. The students I’m with at university all have different backgrounds and I love hearing their stories and what they do. It’s nice to see and hear different aspects of the health and social care sector because every setting is different and I’m excited to sample the other working environments."
        },
        {
            "heading": 2,
            "text": "Caring with confidence"
        },
        {
            "text": "I’ve had so much support at Royal Star & Garter. Marco and Mercy are always asking how I’m getting on and if they can help me in any way. Seeing how they have grown in confidence over the past two years is so inspiring. The home manager and all the staff have been so supportive – if I have down days, they’re there to pick me up."
        },
        {
            "text": "Once I finish in two years’ time, I want to top-up and become a Registered Nurse. I want to progress in my career through Royal Star & Garter and go as far as I can. I’ve found a job that doesn’t feel like a job – it feels like a happy family and it’s so nice."
        }
    ]
}