{
    "url": "https://charitycommission.blog.gov.uk/2026/02/10/charities-and-campaigning-reflections-ahead-of-the-senedd-and-local-elections/",
    "title": "Charities and campaigning: reflections ahead of the Senedd and local elections",
    "authors": [
        "David Holdsworth, Chief Executive Officer"
    ],
    "categories": [
        "Campaigning",
        "election"
    ],
    "pub_date": "2026-02-10T09:46:21+00:00",
    "content": [
        {
            "text": "People across England and Wales will be going to the polls once again in May as the Senedd and local elections are on the horizon."
        },
        {
            "text": "Many charities will be preparing for a period of increased campaigning and political activity in the coming months, and so it’s an opportune moment to remind charity leaders and trustees of their responsibilities and of the guidance we publish to help guide your decision making."
        },
        {
            "text": "Charities play a vital role in our democracy, giving voice to their beneficiaries and highlighting the causes they serve. As has been widely noted, though, the tenor of public and political debate is particularly fraught at present, with many of those involved in charities facing growing hostility."
        },
        {
            "text": "It is in this context that I want to reassure you that the Commission will continue to stand by the right of charities to campaign in furtherance of their purposes and where this is in their best interests."
        },
        {
            "text": "However, in order to maintain public confidence in your campaigning, and trust in charities more broadly, it is crucial that you campaign in a way that is consistent with the legal framework."
        },
        {
            "text": "Your role as a charity leader"
        },
        {
            "text": "Charities hold a special place in our society, as trusted institutions making a difference in the communities they serve. Being a charity is a privilege, which brings with it the responsibility to show that everything you do, and every decision you make, helps deliver on the charity’s purpose and upholds the special status charities have."
        },
        {
            "text": "Part of the reason why charities are so trusted is because the public, as well as the law, expects them to be independent of party politics when engaging in the national debate."
        },
        {
            "text": "Therefore, while charities may give support to or raise concerns about specific policies advocated by political parties, they must never promote or criticise, or be seen to promote or criticise, an individual political party or candidate."
        },
        {
            "text": "This does not mean avoiding criticism of political parties’ policies, and it does not mean that you have to avoid passionate, emotive or direct messaging, but you should remain focused on the issues relevant to your charity and avoid character attacks."
        },
        {
            "text": "What you can expect from the Commission"
        },
        {
            "text": "Our promise to the public is that we assess every concern that comes to us. No complaint will be dismissed out of hand and no concern ignored."
        },
        {
            "text": "But we refuse to be dragged into complaints that seek to weaponise the legitimate work of charities. Our job is to uphold charity law, the laws a democratically elected Parliament has passed."
        },
        {
            "text": "The Regulatory and Risk Framework through which we will assess all complaints can be found within our guidance on how to raise a concern with the Commission."
        },
        {
            "text": "As we approach the Senedd and local elections the Commission will be continuing to issue materials that support charities to get it right when considering political activity and campaigning in this context. Keep an eye on our digital channels for the latest."
        },
        {
            "text": "Read our guidance"
        },
        {
            "text": "In the meantime, please take the opportunity to review our guidance, as it sets out the principles of charity law and the framework within which charities are expected to operate."
        },
        {
            "text": "For an introduction to charity campaigning and political activity you can read our 5-minute guide on the topic."
        },
        {
            "text": "For more detailed material to help you in your decision making, see our in depth guidance on campaigning and political activity for charities. We also have supplementary guidance on campaigning and political activity during an election period."
        },
        {
            "text": "Using social media is often an effective way to campaign, but there can be particular risks too. Read our social media guidance for more information."
        },
        {
            "text": "You may also find it helpful to read our casework summary of the 2024 General Election for some lessons learned applicable to your campaigning."
        }
    ]
}