{
    "url": "https://defrafmp.blog.gov.uk/2026/02/10/consultations-open-for-final-four-defra-led-fmps/",
    "title": "Consultations open for final four Defra-led FMPs",
    "authors": [
        "FMP policy team, Defra",
        "FMP comms team"
    ],
    "categories": [
        "- Defra led FMPs",
        "Public consultation"
    ],
    "pub_date": "2026-02-10T10:50:23+00:00",
    "content": [
        {
            "text": "Today, we are opening consultations on the final four fisheries management plans (FMPs) being delivered by Defra. "
        },
        {
            "text": "These plans build on the 11 FMPs published so far and are vital for securing the long-term sustainability of our fish stocks, and the fishing industry that relies on them.  We’re inviting you to help shape them. "
        },
        {
            "text": "The draft FMPs are: "
        },
        {
            "text": "The consultations are open until 11:59pm on 5 May 2026. "
        },
        {
            "text": "These plans have been developed with input from a wide range of stakeholders. Each one brings together the evidence we have on stock health and management, and sets out practical actions for the short, medium and long term to help restore or maintain stocks at sustainable levels."
        },
        {
            "text": "Find factsheets on the consultations here on the blog."
        },
        {
            "heading": 2,
            "text": "How to get involved"
        },
        {
            "text": "There are several ways you can take part in the consultation. You can respond online, by email, or by post - whichever works best for you."
        },
        {
            "text": "We’re also running a series of consultation events if you’d like to speak with the team, ask questions and explore the proposals in more detail."
        },
        {
            "heading": 2,
            "text": "Join an online session "
        },
        {
            "text": "At the start of the consultation period, we’re hosting online events to walk you through each plan. These sessions are designed to give you a clear overview so you can review the proposals and prepare your response."
        },
        {
            "text": "Visit our FMP events page to book your place."
        },
        {
            "heading": 2,
            "text": "In-person events coming soon"
        },
        {
            "text": "We’ll also be holding in‑person sessions in the South and South West. We’ll share dates and locations on the blog shortly. These events will give you the chance to discuss the proposals directly with the team and offer your feedback face‑to‑face."
        },
        {
            "heading": 2,
            "text": "Watch our consultation overview video here 📼"
        },
        {
            "text": "If you’d like to get a quick introduction, we’ve created a short video that explains the consultations and each of the draft FMPs. Watch it whenever it suits you. If you are interested in specific plans, use the chapters in the video description to go straight to the sections you need."
        },
        {
            "text": "Stay up to date by subscribing to the FMP blog - we’ll be posting event announcements, reminders and more throughout the consultation period."
        }
    ]
}