{
    "url": "https://mhclgmedia.blog.gov.uk/2026/02/10/coverage-of-the-final-local-government-finance-settlement/",
    "title": "Coverage of the Final Local Government Finance Settlement",
    "authors": [
        "mhclgpress"
    ],
    "categories": [
        "Council finance",
        "Local government"
    ],
    "pub_date": "2026-02-10T13:40:53+00:00",
    "content": [
        {
            "text": "This week we made available around £78 billion for English councils through the Final Local Government Finance Settlement."
        },
        {
            "text": "The Settlement brings the total new investment in local services to more than £5.6 billion over the next three years and also provides an additional £740 million since the Provisional Settlement in December."
        },
        {
            "text": "This includes £440 million for areas hit hardest by historic cuts, £272 million for the Homelessness, Rough Sleeping and Domestic Abuse Grant, and £39.6 million for mayors to build homes, improve transport and create more jobs. "
        },
        {
            "text": "Councils will also have 90% of their historic SEND-related deficits up to 2025-26 written off, protecting their ability to continue to support children and young people with SEND at their local school, alongside delivering wider services and tackling deprivation."
        },
        {
            "text": "We also published the final Local Outcomes Framework, setting out top priorities for councils and local partners. Instead of Whitehall micromanaging spending, the government will focus on outcomes that matter most – housing, jobs, care and public services."
        },
        {
            "text": "The Financial Times runs a detailed wite up of the whole Final Settlement, while the i paper noted that resolving SEND deficits could cut financing costs by an estimated £300 million by 2027-28."
        },
        {
            "text": "The Guardian reported that Minister McGovern said the government was delivering improvements that would make councils \"agents of renewal in building a new, better country\"."
        },
        {
            "text": "There is further coverage of the Settlement on BBC News Online, LBC, TES, Eastern Daily Press, Schools Week, Local Government Chronicle, Municipal Journal and Room 151."
        },
        {
            "text": "Secretary of State for Housing, Communities and Local Government, Steve Reed said:  "
        },
        {
            "text": "“We inherited a system where the communities that needed the most support were left behind. Today we’re turning the page. "
        },
        {
            "text": "“This £78 billion settlement is about real change – potholes filled, streets kept clean, older people looked after, and young people having somewhere to go in their area.  "
        },
        {
            "text": "“And with an extra £440 million for areas hardest hit by historic cuts, we’re making sure every community gets its fair share.”"
        },
        {
            "text": "Minister of State for Local Government and Homelessness, Alison McGovern MP said:  "
        },
        {
            "text": "“We promised to reconnect funding to deprivation — and this final Settlement delivers on that promise. With more new funding, we’re giving councils the certainty they need to plan ahead and transform services.  "
        },
        {
            "text": "“Our purpose is to support families, tackle homelessness before it happens, and finally giving communities worst affected by historic cuts their fair share.  That’s how we rebuild this country.” "
        },
        {
            "text": "Solace President Robin Tuddenham said:"
        },
        {
            "text": "“Solace welcomes MHCLG’s engagement with both Solace and the wider local government sector in developing the Local Outcomes Framework. The framework has evolved through those discussions to better reflect place and the wider local system - something clearly signalled through its new name."
        },
        {
            "text": "“It is vital that Government continues to work closely with the sector as the framework develops, taking full account of the range of performance and accountability mechanisms already in place for local authorities.” "
        },
        {
            "text": "Cllr Sir Stephen Houghton, Chair of the Special Interest Group of Municipal Authorities (SIGOMA) said:"
        },
        {
            "text": "“The government’s Fair Funding Review is a vital opportunity to correct historic imbalances in council funding, and we are pleased that many long-awaited reforms that SIGOMA has campaigned for over the last decade are finally being delivered."
        },
        {
            "text": "“We strongly welcome the additional money being targeted to places with significant deprivation and needs. Increasing the Recovery Grant is something we have been asking for and it is pleasing ministers have responded to the case SIGOMA has made so positively. It will ease the financial challenges our members face significantly. Recovery Grant recipients represent some of the most deprived areas of the country: communities that were hit hardest by austerity and are least able to raise income through Council Tax."
        },
        {
            "text": "“As the government has rightly said, ‘the recovery is not over’, and the boost to this vital funding means that the most deprived areas in the country can continue to rebuild."
        },
        {
            "text": "“Action on SEND deficits is extremely welcome. Spiralling SEND costs are a significant pressure for our members, and this is a very welcome step to addressing this significant burden.”"
        }
    ]
}