{
    "url": "https://food.blog.gov.uk/2026/02/10/fsa-supports-trade-in-recycled-plastics-for-food-packaging/",
    "title": "FSA supports trade in recycled plastics for food packaging",
    "authors": [
        "Katie Pettifer, Chief Executive"
    ],
    "categories": [
        "Our mission"
    ],
    "pub_date": "2026-02-10T10:51:59+00:00",
    "content": [
        {
            "text": "Cymraeg"
        },
        {
            "text": "The impact that food production has on the environment is well documented. Whether it’s concerns around carbon emissions, food waste, or bio-diversity loss, there are clear warning signs that the world needs to move to a more sustainable supply of food."
        },
        {
            "text": "At the FSA, we want to help make food more sustainable. One of the ways we can do this is by enabling the safe use of more sustainable packaging. Packaging is important to keep food safe and prevent spoilage, but that comes at a cost to the environment. The UK produces more than two million tonnes of plastic packaging every year. While that figure is coming down, most plastic food and beverage packaging is single-use and short-lived, so we know there’s more that can be done to improve recycling rates."
        },
        {
            "text": "The government recently confirmed that the FSA will act as the competent authority under EU regulations for recycled plastic materials intended for use in food packaging. This will enable UK-based plastic recyclers to continue supplying recycled plastic to the EU market."
        },
        {
            "text": "This is an example of how our work supports economic growth, as well as protecting public health and consumers. It was one of many areas I spoke about when I appeared in front of the House of Lords Industry and Regulators Committee, which is looking into the relationship between regulators and economic growth."
        },
        {
            "text": "The FSA is already the regulator for food contact materials, making sure those materials are safe for use in the food chain. We’ll now also be inspecting recycling facilities on behalf of the European Union. This is a crucial step in supporting the trade in recycled plastics for food packaging within the EU market and supporting growth in the UK recycling industry."
        },
        {
            "text": "As the competent authority, we’ve established an auditing programme to deliver consistent checks on plastic recyclers in Great Britain. We’ve completed the first audits, which represent a significant milestone, strengthening consumer protection while helping UK recyclers maintain access to valuable EU markets."
        },
        {
            "text": "We’re looking forward to working closely with industry partners to make this transition a success."
        },
        {
            "text": "Katie PettiferChief Executive of FSA"
        },
        {
            "heading": 1,
            "text": "Safonau Bwyd yn cefnogi masnach mewn plastigau wedi’u hailgylchu ar gyfer deunydd pecynnu bwydb "
        },
        {
            "text": "Mae dulliau cynhyrchu bwyd yn effeithio ar yr amgylchedd, ac mae llawer o dystiolaeth i gefnogi hyn. O bryderon ynghylch allyriadau carbon a gwastraff bwyd i golli bioamrywiaeth, mae rhybuddion, mae rhybuddion clir bod angen i’r byd symud at ffyrdd mwy cynaliadwy o gyflenwi bwyd."
        },
        {
            "text": "Yn yr Asiantaeth Safonau Bwyd (ASB), rydym am helpu i wneud bwyd yn fwy cynaliadwy. Un o’r ffyrdd y gallwn wneud hyn yw drwy hwyluso defnydd diogel o ddeunydd pecynnu mwy cynaliadwy. Mae deunydd pecynnu’n helpu i gadw bwyd yn ddiogel a’i atal rhag mynd yn ddrwg, ond mae hyn ar draul yr amgylchedd. Mae’r DU yn cynhyrchu mwy na dwy filiwn tunnell o ddeunydd pecynnu plastig bob blwyddyn. Er bod y ffigur hwnnw’n gostwng, mae’r rhan fwyaf o ddeunydd pecynnu plastig ar gyfer bwyd a diod yn ddeunydd pecynnu un-tro, byrhoedlog. Felly, rydyn ni’n gwybod bod mwy y gellir ei wneud i wella cyfraddau ailgylchu."
        },
        {
            "text": "Cadarnhaodd y llywodraeth yn ddiweddar y bydd yr ASB yn gweithredu fel yr awdurdod cymwys o dan reoliadau’r UE ar gyfer deunyddiau plastig wedi’u hailgylchu i’w defnyddio mewn deunydd pecynnu bwyd. Bydd hyn yn galluogi’r rheiny sy’n ailgylchu plastig yn y DU i barhau i gyflenwi plastig wedi’i ailgylchu i farchnad yr UE."
        },
        {
            "text": "Dyma enghraifft o sut mae ein gwaith yn cefnogi twf economaidd, yn ogystal â diogelu iechyd y cyhoedd a defnyddwyr. Dyma un o’r nifer o feysydd y siaradais amdanynt wrth ymddangos gerbron Pwyllgor Diwydiant a Rheoleiddwyr Tŷ’r Arglwyddi, sy’n edrych ar y berthynas rhwng rheoleiddwyr a thwf economaidd."
        },
        {
            "text": "Mae’r ASB eisoes yn rheoleiddio deunyddiau a ddaw i gysylltiad â bwyd, gan sicrhau bod y deunyddiau hynny’n ddiogel i’w defnyddio yn y gadwyn fwyd. Byddwn ni nawr yn archwilio cyfleusterau ailgylchu ar ran yr UE hefyd. Mae hwn yn gam hanfodol i gefnogi’r fasnach mewn plastigau wedi’u hailgylchu ar gyfer deunydd pecynnu bwyd o fewn marchnad yr UE. Mae hefyd yn cefnogi twf yn niwydiant ailgylchu’r DU."
        },
        {
            "text": "Fel yr awdurdod cymwys, rydym wedi sefydlu rhaglen archwilio i gynnal gwiriadau cyson ar y rheiny sy’n ailgylchu plastig ym Mhrydain Fawr. Rydym wedi cwblhau’r archwiliadau cyntaf, sy’n cynrychioli carreg filltir sylweddol, gan gryfhau diogelwch defnyddwyr wrth helpu’r rheiny sy’n ailgylchu yn y DU i gadw mynediad at farchnadoedd gwerthfawr yr UE."
        },
        {
            "text": "Rydym yn edrych ymlaen at gydweithio’n agos â phartneriaid yn y diwydiant i sicrhau bod y newid hwn yn llwyddiant."
        },
        {
            "text": "Katie PettiferPrif Weithredwr yr ASB"
        }
    ]
}