{
    "url": "https://nda.blog.gov.uk/hands-on-progress-jamie-fowlers-role-in-advancing-the-nda-mission-at-hunterston-a/",
    "title": "Hands-on progress: Jamie Fowler’s role in advancing the NDA mission at Hunterston A",
    "authors": [
        "Jamie Fowler"
    ],
    "categories": [
        "Early careers",
        "Skills"
    ],
    "pub_date": "2026-02-10T13:11:46+00:00",
    "content": [
        {
            "text": "I am in my third year of the Nuclear Restoration Services (NRS) apprenticeship scheme, in which I am training to be a qualified Electrical Maintenance Technician at the Hunterston A site, in Ayrshire, Scotland."
        },
        {
            "text": "During my time at Hunterston A, I have worked on a variety of projects in the maintenance department, which contribute to the safe decommissioning of the site. These projects vary in scale from minor electrical repairs to ensuring key machinery and equipment is operational, to complete refits of areas."
        },
        {
            "text": "A personal highlight has been completing the refit of the site laboratory, which had been out of service prior to this. Resuming operations in this location was vital to the continued success of the site’s decommissioning mission."
        },
        {
            "text": "I have enjoyed being part of a team which carries out such a wide scope of work, and I am always eager to offer my skills and support wherever required. Alongside my contribution to the Nuclear Decommissioning Authority’s (NDA) mission on site, I have been honoured to represent both NRS and the NDA across the UK."
        },
        {
            "text": "The NDA group has provided me with great opportunities to develop my knowledge of nuclear decommissioning, with a key focus on my personal development and high-quality training."
        },
        {
            "text": "Working alongside others who possess a wealth of knowledge and experience has been greatly beneficial to the beginning of my career and leaves me excited and eager to see what the future holds within the NDA."
        },
        {
            "text": "My apprenticeship has allowed me to strengthen my theoretical knowledge, whilst also being able to gain experience of hands-on working. I thoroughly enjoy working in an environment with a key purpose, knowing that every task completed is one step closer to completing the NDA mission."
        },
        {
            "text": "Alongside my ever-growing career development, I have also gained personal skills which will be crucial for my future career and personal life. I am now a far more confident individual than when I started, and now understand the importance of critical and strategic thinking, and can communicate my ideas freely in a welcoming environment."
        },
        {
            "text": "#NAW2026 #NationalApprenticeshipWeek #NDAgroup #Apprentices #Energus #EarlyCareers #NuclearRestorationServices"
        }
    ]
}