{
    "url": "https://mhrainspectorate.blog.gov.uk/2026/02/10/impact-of-the-amended-cir-520-2012-to-uk-authorised-products/",
    "title": "Impact of the amended CIR 520/2012 to UK authorised products",
    "authors": [
        "Claire Longman"
    ],
    "categories": [
        "Good pharmacovigilance practice",
        "GPvP",
        "Pharmacovigilance"
    ],
    "pub_date": "2026-02-10T16:00:51+00:00",
    "content": [
        {
            "text": "From 12 February 2026, amendments to the EU Commission Implementing Regulation (CIR) 520/2012 come into effect. While the UK operates an independent regulatory system, these changes have practical implications for some UK-authorised products, particularly in relation to pharmacovigilance (PV) requirements."
        },
        {
            "heading": 2,
            "text": "Background"
        },
        {
            "text": "All UK authorised products are granted authorisations by the MHRA and are subject to PV requirements set out in Part 11 of the Human Medicines Regulations (HMR) 2012. However, additional PV requirements apply depending on the Category of product."
        },
        {
            "text": "UK products authorised as Category 1 follow HMR Schedule 12A, whilst products authorised as Category 2 are subject to the further provisions within the CIR 520/2012. Historically, the HMR Schedule 12A has been aligned with the CIR; however, the recent CIR amendment means our domestic legislation will no longer be fully aligned.  "
        },
        {
            "heading": 2,
            "text": "Current situation"
        },
        {
            "text": "The MHRA is currently considering appropriate updates to the HMR Schedule 12A to reflect the updates made to the CIR 520/2012. In the meantime, to ensure clarity for industry, the MHRA has set out the following:"
        },
        {
            "text": "The MHRA has published a further communication to outline this information in more detail, along with a flow chart to support decision-making within PV systems."
        },
        {
            "text": "A link to this communication can be found here."
        }
    ]
}