{
    "url": "https://competitionandmarkets.blog.gov.uk/2026/02/10/improving-the-way-apple-and-google-deliver-app-store-services-and-enhancing-ios-interoperability-in-the-uk/",
    "title": "Improving the way Apple and Google deliver app store services and enhancing iOS interoperability in the UK",
    "authors": [
        "Will Hayter"
    ],
    "categories": [
        "Digital Markets Unit"
    ],
    "pub_date": "2026-02-10T11:01:16+00:00",
    "content": [
        {
            "text": "The UK’s digital markets competition regime is designed to promote competition to deliver improved outcomes for businesses and consumers. Since it came into force in January 2025, we’ve been working to put it into action in an effective, pragmatic way."
        },
        {
            "text": "We designated Apple and Google’s mobile platforms with strategic market status in October, and before that published a roadmap which set out clear, measurable proposals to promote competition and improve outcomes in this critical digital market. Since designation, both Apple and Google have engaged constructively with the CMA on a range of these areas and today we have announced immediate changes across many of the issues we identified as highest priority."
        },
        {
            "text": "The changes will give businesses greater transparency over how the apps they bring to market are reviewed and ranked, how their data is used and provide a new method for developers to request interoperable access to specific functionality within Apple’s iOS and iPadOS. As part of the commitments process, the CMA will closely monitor Apple and Google’s implementation of the changes and will report publicly on what it finds. "
        },
        {
            "text": "The changes are part of an ongoing programme of work and updates on further measures are expected in the coming months. These include ensuring businesses can get fairer terms for distributing their apps to customers, and making sure innovative businesses like fintechs can access the tools they need to compete fairly with Apple’s digital wallet. "
        },
        {
            "heading": 2,
            "text": "Why Apple and Google’s app store services matter "
        },
        {
            "text": "The UK has a vibrant app developer community, representing Europe’s largest app economy by revenue and app developer count. In total, the UK app economy generates an estimated 1.5% of the UK’s GDP and supports around 400,000 jobs here. App-led innovation has powered the success of strategically important sectors for the UK, like financial services and gaming. It is essential that this part of the digital economy works well."
        },
        {
            "text": "To reach users with Apple mobile devices, app developers have no choice but to distribute on Apple’s App Store. While other options are available, Google’s Play Store is by far the main distribution channel for app developers seeking to reach Android users. These app stores are therefore essential for app developers, and it is important they are treated fairly and have confidence and certainty they will be able to serve their customers and bring new innovations forward. This is especially important for key services like banking and payment apps and ensures UK consumers have access to a wide range of products and services on their mobile devices."
        },
        {
            "heading": 2,
            "text": "Our proposed measures"
        },
        {
            "text": "Apple and Google have worked with the CMA and offered commitments to immediately and effectively address our concerns relating to app store processes. The commitments are intended to provide app developers with confidence that they will be treated fairly by Apple and Google and are designed to boost the UK’s app economy. They include:​ "
        },
        {
            "text": "​To ensure compliance, the CMA will closely monitor Apple and Google’s implementation of the changes, reporting publicly on what we find. Metrics provided by Apple and Google will include those in relation to: "
        },
        {
            "text": "We will move quickly to bring forward conduct requirements, including considering whether more stringent measures are necessary, if these commitments are not adhered to or we find they are proving ineffective. For example, if we find Apple is routinely declining interoperability requests without good reason, this will inform our pipeline of wider work – and we could bring forward specific interoperability requirements. Non-compliance would also mean we would be unlikely to consider commitments as a similar approach in future for that SMS firm."
        },
        {
            "heading": 2,
            "text": "A swift, pragmatic and effective approach"
        },
        {
            "text": "It is a unique strength of the UK’s digital markets competition regime that we can achieve improvements in conduct and market outcomes in a range of ways, from voluntary conduct by firms through to negotiated commitments backed up by monitoring and reporting, legally binding conduct requirements, pro-competition interventions and enforcement. Our goal is to deliver meaningful outcomes to UK consumers and businesses as swiftly and effectively as possible, taking into account the particular circumstances of the issue we are looking to address and building on the participative approach where possible."
        },
        {
            "text": "Commitments can deliver swift and uncontested market improvements but will not be appropriate in all circumstances. For example, we are unlikely to pursue commitments where there is significant divergence between us and a firm on what we are looking to achieve, where firms have little incentive to change their conduct, where compliance is difficult to determine, observe or monitor, where measures can be easily circumvented, or where an SMS firm’s historical conduct does not give us confidence it will work constructively with us."
        },
        {
            "text": "We consider there are good reasons to consider commitments in relation to these specific issues. Apple and Google already have processes in place to ensure fair, transparent and objective app review, app ranking and use of data. However, some of these processes and procedural safeguards are not sufficiently transparent and many stakeholders do not trust that these processes are being followed. This lack of trust in itself has implications – with app developers (and their investors), less willing to develop new propositions, particularly those competing with Apple and Google’s own, for fear of how they could be treated. In these circumstances, the focus of these commitments is on increased transparency and robust monitoring to give app developers confidence they will be treated fairly."
        },
        {
            "text": "Similarly in relation to Apple’s interoperability process, we heard concerns that it was unclear how developers could raise requests for interoperability with Apple or how they would be considered, and a lack of confidence that such requests would be treated fairly and objectively. The focus in these commitments is in making this process transparent and accessible for developers and ensuring their requests are fairly considered."
        },
        {
            "heading": 2,
            "text": "Our wider work and next steps"
        },
        {
            "text": "We welcome views on the proposed commitments and our approach by 3 March. Subject to stakeholder views, the commitments will take effect from 1 April 2026. "
        },
        {
            "text": "Alongside this work on commitments, we are also pursuing a wide programme of work in relation to mobile platforms in 2026. In particular, we are expecting to continue engaging with Apple, Google and wider stakeholders and update on our work in relation to steering for both Apple and Google, and digital wallets for Apple in the first half of 2026. In 2026 we will also progress work in relation to Apple on browsers, and interoperable access to functionality for connected devices, as well as continuing to closely monitor developments in relation to mobile platforms, particularly the emergence and adoption of AI."
        }
    ]
}