{
    "url": "https://defraenvironment.blog.gov.uk/2026/02/10/ipbes12-reflections-on-bringing-the-world-together-for-nature-in-manchester/",
    "title": "IPBES12: reflections on bringing the world together for nature in Manchester",
    "authors": [
        "Ruth Davis OBE"
    ],
    "categories": [
        "Green finance",
        "Nature",
        "Research and data analysis",
        "Science"
    ],
    "pub_date": "2026-02-10T09:23:18+00:00",
    "content": [
        {
            "text": "Last week, the UK hosted IPBES12 in Manchester, bringing together the world's leading scientists and policymakers to tackle one of the defining challenges of our time – halting the loss of nature. It proved to be the largest IPBES meeting ever, with over 900 delegates attending in person. "
        },
        {
            "text": "I met policy officials, scientists, Indigenous peoples, businesses, and civil society to discuss IPBES and how we can all make our difference. "
        },
        {
            "text": "So, what is IPBES? "
        },
        {
            "text": "IPBES (Intergovernmental Science-Policy Platform on Biodiversity and Ecosystem Services) is an independent body that provides policymakers with objective scientific assessments on biodiversity, ecosystem services, and their connection to human well-being, acting as a crucial link between science and policy for better environmental decisions.  "
        },
        {
            "text": "Established in 2012, it's similar to the IPCC for climate change, assessing global knowledge and identifying policy options to protect nature, support sustainable development, and achieve global goals. "
        },
        {
            "text": "The theme for this year’s meeting was Business and Biodiversity and ended with the approval of the groundbreaking IPBES Business & Biodiversity Assessment report by all 152 Member Governments. "
        },
        {
            "text": "The Assessment will help businesses understand their relationship with nature and the actions they can take to protect it. "
        },
        {
            "text": "IPBES reviewed progress on its second Global Assessment, the successor to the landmark 2019 report that revealed the alarming reality that one million species face extinction.  "
        },
        {
            "text": "The Plenary also agreed on its priorities for the year ahead, including new work to strengthen national policymaking, stimulate cutting‑edge biodiversity research, and support the next generation of scientists who will carry this work forward. "
        },
        {
            "text": "A Week of Action in Manchester "
        },
        {
            "text": "As UK Special Representative for Nature, I had the privilege of participating in events throughout IPBES-12. The week began with Stakeholder Day, the largest ever for an IPBES conference, with over 400 policy officials, scientists, Indigenous peoples, businesses and civil society representatives coming together in person to discuss IPBES reports and engage with one another.  "
        },
        {
            "text": "This kind of cross-sectoral dialogue is exactly what we need to translate scientific assessments into meaningful action. "
        },
        {
            "text": "Mobilising Nature Finance "
        },
        {
            "text": "A key theme running through the week was the critical importance of scaling investment into nature. At an event co-hosted with the International Advisory Panel on Biodiversity Credits, the Institute of Finance and Sustainability, and China, we explored innovative financing tools for nature restoration and conservation, including biodiversity credits and other instruments that can help meet national and international biodiversity targets. The UK's Biodiversity Net Gain scheme is one example of how domestic policy can channel public and private finance towards nature recovery, and there is much we can learn from international partners pursuing similar goals. "
        },
        {
            "text": "Connecting Investors with Opportunities "
        },
        {
            "text": "Field visits in the Greater Manchester area gave investment fund managers and senior leaders a first-hand look at investable nature-based solutions projects that bring tangible benefits to local people and communities – including the half a million people in the Greater Manchester area who can visit and enjoy these special places. "
        },
        {
            "text": "These visits, co-ordinated by the Environment Bank, Nature North and Greater Manchester Combined Authority, showcased the potential for nature restoration across the North of England and helped shape conversations around investment-readiness and the opportunities for pan-northern collaboration. "
        },
        {
            "text": "Business and Finance Day "
        },
        {
            "text": "The Aviva Business and Finance Day brought together over 250 attendees to examine how the private sector can take ambitious action on nature. Panels explored everything from supply chain transformation and innovative financing to the enabling environment needed to help business and finance innovate with integrity. We heard from leading voices across retail, finance, technology and sustainability, including entrepreneurs and community leaders, all united by a recognition that healthy ecosystems underpin healthy businesses and vibrant places. "
        },
        {
            "text": "The day closed with a clear message: the Business and Biodiversity Assessment offers sectoral leaders a unique opportunity to take action and turn IPBES-12 momentum into lasting change.  "
        },
        {
            "text": "Collaboration between government, business, academia and community leaders will be essential to making this happen. "
        }
    ]
}