{
    "url": "https://gdsgeospatial.blog.gov.uk/2026/02/10/using-geospatial-technology-procured-through-the-space-technology-solutions-market/",
    "title": "Using geospatial technology procured through the Space Technology Solutions Market",
    "authors": [
        "Esther Oluwajana, Contract and Procurement Lead, Geospatial:GDS"
    ],
    "categories": [
        "Data",
        "Technology"
    ],
    "pub_date": "2026-02-10T14:53:35+00:00",
    "content": [
        {
            "heading": 2,
            "text": "Geospatial technology at the heart of public services"
        },
        {
            "text": "Geospatial data plays a critical role in how government understands and manages place. From monitoring environmental change and planning infrastructure, to responding to emergencies and managing public assets, location-based insight helps teams make better, faster and more informed decisions."
        },
        {
            "text": "In July, the Space Technology Solutions Dynamic Market (RM6370) went live, providing public sector organisations with a new way to access space-enabled technologies that support geospatial insight and analysis. The market has been developed to reflect the growing importance of geospatial applications across government and the need for commercial routes that are flexible, inclusive and responsive to innovation."
        },
        {
            "text": "As part of the Geospatial team at the Government Digital Service (GDS), our focus is on enabling the effective use of geospatial data to support better public services. RM6370 supports this ambition by providing a modern commercial framework that makes it easier to procure space-enabled geospatial solutions."
        },
        {
            "heading": 2,
            "text": "Why a Dynamic Market works for geospatial solutions"
        },
        {
            "text": "The geospatial technology landscape is evolving rapidly. Advances in satellite platforms, Earth observation, analytics and cloud-based tools mean new datasets and applications are continually emerging. The supplier ecosystem is equally diverse, ranging from established providers to highly specialised small and medium-sized enterprises (SMEs)."
        },
        {
            "text": "Traditional procurement approaches can struggle to keep pace with this rate of change. A Dynamic Market offers a more agile alternative. Suppliers can apply to join the market at any point during its lifetime, ensuring buyers have access to up-to-date solutions and emerging capabilities as they become available."
        },
        {
            "text": "For public sector organisations, this means greater choice and the ability to procure solutions that are proportionate to their needs. For suppliers, it lowers barriers to entry and creates a clearer route to working with government."
        },
        {
            "heading": 2,
            "text": "What geospatial applications the market supports"
        },
        {
            "text": "RM6370 enables the procurement of a wide range of space-enabled geospatial solutions and services, including:"
        },
        {
            "text": "The market focuses on outcomes rather than prescribing specific technologies. This allows buyers to procure solutions that address real-world challenges, such as understanding land use, managing infrastructure, monitoring environmental impacts or improving situational awareness during incidents."
        },
        {
            "text": "This outcome-led approach supports innovation while ensuring solutions are aligned with user needs and policy objectives."
        },
        {
            "heading": 2,
            "text": "Enabling better decision-making across government"
        },
        {
            "text": "Geospatial insight is increasingly embedded in how government operates. The Space Technology Solutions Dynamic Market supports organisations that are looking to move from experimentation and pilots to sustained operational use of geospatial technology."
        },
        {
            "text": "It provides a commercial structure that supports teams with varying levels of geospatial maturity, reducing complexity while maintaining appropriate governance, assurance and value for money. By simplifying access to specialist capability, RM6370 helps public sector organisations focus on using geospatial data effectively, rather than navigating procurement challenges."
        },
        {
            "heading": 2,
            "text": "Supporting suppliers to work with government"
        },
        {
            "text": "The Dynamic Market has been designed to be accessible to a wide range of suppliers, including SMEs and newer entrants to the public sector market. The ability to apply to join at any time allows suppliers to engage when they are ready, rather than aligning to fixed procurement timetables."
        },
        {
            "text": "Suppliers interested in working with the public sector can apply to join the Space Technology Solutions Dynamic Market (RM6370) on the Crown Commercial Service website."
        },
        {
            "heading": 2,
            "text": "What happens next"
        },
        {
            "text": "The launch of RM6370 marks an important step in improving access to space-enabled geospatial solutions, but it is not the end of the journey. Over the coming months, we will continue to work with buyers, suppliers and policy colleagues to support adoption of the market and share learning from early procurements."
        },
        {
            "text": "Geospatial technology will continue to underpin many of the complex decisions government must make. By providing a flexible and modern route to procure space-enabled solutions, the Space Technology Solutions Dynamic Market helps ensure geospatial insight can be translated into real-world impact."
        },
        {
            "text": "You can sign up to get an email notification every time we publish a new blog post. For more information on our work see the GDS gov.uk site, or follow us on  LinkedIn "
        }
    ]
}