{
    "url": "https://environmentagency.blog.gov.uk/2026/02/10/windermere-working-together-for-cleaner-water/",
    "title": "Windermere: working together for cleaner water ",
    "authors": [
        "Environment Agency"
    ],
    "categories": [
        "Community",
        "Nature",
        "Regulated industry",
        "Rivers",
        "Water"
    ],
    "pub_date": "2026-02-10T16:23:57+00:00",
    "content": [
        {
            "text": "Windermere: working together for cleaner water "
        },
        {
            "text": "When water companies were privatised in 1989, the government created a regulatory system to protect customers, as each company became the only water supplier in its region. Ofwat was created – to regulate what companies can charge and ensure fair investment. The Environment Agency and Natural England focus on people, communities and the environment, making sure these companies do not damage our land, rivers, lakes and coastlines, while the Drinking Water Inspectorate ensures our tap water is safe to drink. "
        },
        {
            "text": "Every five years, Ofwat sets out how much each water company can invest as their baseline expenditure, balancing what customers pay through bills against funding from investors. This creates the Asset Management Plan (AMP) – essentially a five-year blueprint for: "
        },
        {
            "text": "The environmental improvements are managed through the Water Industry National Environment Programme (WINEP). This ensures water companies fulfil their legal obligations to protect our natural environment. The strategic direction comes from WISER (Water Industry Strategic Environmental Requirements) – a framework developed by the Environment Agency and Natural England. To find out more, visit the WINEP actions ArcGIS map which displays the PR24 WINEP actions. ( Price Review 2024 Water Industry National Environment Programme (WINEP) App). "
        },
        {
            "text": "So, what does all this mean for Windermere, one of England's most iconic lakes? Here, Andy Brown, Northwest Water Regulation Manager, explains how this regulatory framework is driving real improvements to water quality. "
        },
        {
            "text": "The role of the EA  in regulating water companies "
        },
        {
            "text": "As the environmental regulator for England's water companies, we stand between industry and nature. "
        },
        {
            "text": "Our teams are out gathering data every day – monitoring water quality, inspecting treatment works, investigating pollution incidents, and building sophisticated models of how pollution moves through our waterways. This evidence becomes the foundation for holding companies to the environmental commitments in their plans. "
        },
        {
            "text": "The current investment period (Asset Management Period 8 - AMP8) runs from 2025 to 2030 and represents a turning point. Using the government's 25 Year Environment Plan and government’s legislative drivers, we've secured the largest environmental investment programme ever seen in England's water industry. "
        },
        {
            "text": "Through the Water Industry National Environment Programme (WINEP), we've significantly increased both the number and value of improvements water companies must deliver.  "
        },
        {
            "text": "For Windermere and all of our rivers, lakes and coastlines across Cumbria, this means real action on the ground. "
        },
        {
            "text": "What's happening now   "
        },
        {
            "text": " Between 2025 and 2030, United Utilities are upgrading nine of the ten wastewater treatment works in the Windermere catchment, including Ambleside, Hawkshead, Grasmere and Near Sawrey. These improvements will reduce phosphorus load from wastewater treatment from these sites. The 10th wastewater treatment works which is the Windermere Wastewater Works at Tower Wood, was improved in AMP7 and completed in March 2020.  In addition, the six storm overflows in the Windermere catchment will be improved to reduce the number of times they spill. When completed, Environment Agency permitting teams will update the permits to reflect these improvements so the new standards can be regulated.    "
        },
        {
            "text": "How we are monitoring progress     "
        },
        {
            "text": "Alongside our planning and auditing role in driving and shaping the investment water companies make, Environment Agency teams also regularly inspect treatment works and review monitoring data to ensure improvements are working as planned. We record this on compliance assessment forms and report progress annually (How you'll be regulated: environmental permits - GOV.UK). This forms part of how we assess water company performance. The data we capture includes:  "
        },
        {
            "text": "The Windermere catchment under previous investment periods  "
        },
        {
            "text": "Previous investments have included upgrades to Windermere Wastewater Treatment Works, reducing phosphorus to the technically achievable limit of 0.25mg/l and reductions in storm overflow spills. "
        },
        {
            "text": "To help us specifically understand the impact of water company discharges, we use a purpose-built computer model.  The program uses detailed catchment studies and lake modelling together with real data from water company discharges and other sources to understand exactly what's needed to improve water quality. This scientific approach ensures every improvement makes a real difference to the lake and that those improvements can be measured. "
        },
        {
            "text": "Other water quality regulation work  "
        },
        {
            "text": "In addition to our regulation of United Utilities, we also carry out regulation of private sewage permitted sites in the Windermere catchment. This includes holiday accommodation, restaurants and private homes. Since January 2025 we have undertaken compliance inspections on over 95% of the private permits in the catchment and by January 2026, we expect this figure to have risen to 100%.  "
        },
        {
            "text": "I am pleased to say that only a very small number of these sites had non-compliances and most of these were minor. We are currently using our regulatory tools to ensure that all actions needed to bring any failing sites back into compliance are completed as soon as reasonably practicable.   "
        },
        {
            "text": "This programme of inspections also enables us to maximise the number of compliant private permitted sites which may be able to benefit from United Utilities ‘Wonderful Windermere’ scheme or ‘First Time Rural Sewage’ to further reduce phosphate from private discharges.  "
        },
        {
            "text": "Our regulatory role also includes a programme of farm inspections in the Windermere catchment. We'll be discussing this work in more detail in a future blog post.  "
        },
        {
            "text": "Collaboration is key"
        },
        {
            "text": "Windermere is precious to all of us. That's why the Environment Agency  is working with a range of public and private sector organisations as part of the Love Windermere Partnership alongside our formal role described in this blog to make significant improvements to water quality in and around the lake.  "
        },
        {
            "text": "Working across organisational boundaries and with local communities, who care so passionately, means we can make a big difference and drive forward the environmental improvements we all want to see.   "
        },
        {
            "text": "  "
        },
        {
            "text": "  "
        }
    ]
}