{
    "url": "https://governmentscienceandengineering.blog.gov.uk/2022/02/07/delivering-climate-adaptation-and-resilience-the-role-of-measurement/",
    "title": "Delivering Climate Adaptation and Resilience: The Role of Measurement",
    "authors": [
        "Jamal Arabi"
    ],
    "categories": [
        "GSE Opportunities"
    ],
    "pub_date": "2022-02-07T09:45:15+00:00",
    "content": [
        {
            "text": "Hear from NPL experts and sector stakeholders about how metrology supports climate action."
        },
        {
            "text": "The climate is changing and will continue to change even as we reduce emissions, in some instances with devastating effects. To limit the most damaging impacts of climate change, we must ensure resilience by adapting to the current and future changes in the climate."
        },
        {
            "text": "Adapting to a changing climate requires coordinated action and confidence in the data underpinning the decision-making process. Metrology (the science of measurement) is essential to providing this confidence and NPL, as the UK’s National Metrology Institute, has a responsibility to tackle priority measurement needs in support of this national challenge."
        },
        {
            "text": "Recognising this urgent need, NPL is pleased to be hosting this two-day workshop bringing together policy makers and the wider climate science community, to identify and prioritise measurement needs and challenges for climate adaptation and resilience."
        },
        {
            "text": " "
        },
        {
            "heading": 3,
            "text": "Wednesday 23 February 2022 at 10:00–12:30"
        },
        {
            "text": "This session will have a policy focus, discussing:\n• Adaptation and resilience needs, and climate risks, facing the UK,\n• The role of measurement in supporting adaptation policy,\n• Identification of measurement challenges that need addressing."
        },
        {
            "text": " "
        },
        {
            "heading": 3,
            "text": "Thursday 24 February 2022 at 10:00–12:30"
        },
        {
            "text": "This session will have a solution focus, with consideration for the role of geospatial and space-based solutions in partnership with Space4Climate (S4C), discussing:\n• The role of remote sensing and space-based solutions,\nand how these can support adaptation and resilience action,\n• Prioritisation of the measurement needs that will underpin evidence-based decision making,\n• Recognition of knowledge gaps and how measurement can help to address them."
        },
        {
            "text": " "
        },
        {
            "text": "Keynote speakers will include representatives from the Climate Change Committee (CCC), the Department for Environment, Food and Rural Affairs (Defra), Ordnance Survey (OS) and the National Physical Laboratory (NPL)."
        },
        {
            "text": "To register for this free event please click here"
        },
        {
            "text": "For more information, please visit please visit the event website or contact events@npl.co.uk for any questions."
        }
    ]
}