{
    "url": "https://hodigital.blog.gov.uk/2022/02/07/do-you-want-to-be-a-tech-apprentice-were-hiring/",
    "title": "Do you want to be a tech apprentice? We’re hiring",
    "authors": [
        "The HODDaT blog team",
        "Cian Bates, Business Analyst apprentice",
        "Jason Pearson, Apprentice Placement Manager"
    ],
    "categories": [
        "apprenticeships",
        "Recruitment"
    ],
    "pub_date": "2022-02-07T14:09:17+00:00",
    "content": [
        {
            "text": "Applications are now open for the following apprenticeships at Home Office Digital, Data and Technology (DDaT):"
        },
        {
            "text": "DevOps Engineer"
        },
        {
            "text": "Associate Project Manager"
        },
        {
            "text": "Business Analyst"
        },
        {
            "text": "Business Administrator"
        },
        {
            "text": "In Home Office DDaT you could work on solutions to help people prove their identity or apply for visas or work on the critical IT systems that support policing and counter terrorism and help protect UK borders."
        },
        {
            "heading": 2,
            "text": "What attributes and attitudes are we looking for?"
        },
        {
            "text": "We’re recruiting people who really want to work with us. We look for potential candidates who are passionate and have the potential to do well."
        },
        {
            "text": "You do not need related qualifications or previous experience."
        },
        {
            "text": "As well as a passion for the role, you will need:"
        },
        {
            "heading": 2,
            "text": "Pay, reward and training benefits"
        },
        {
            "text": "These roles come with an attractive pay and reward package and excellent pension. You will also receive generous training and development throughout the scheme along with coaching and mentoring opportunities."
        },
        {
            "text": "What’s it like to be a tech apprentice at the Home Office? Read more to find out."
        },
        {
            "heading": 2,
            "text": "Cian Bates, Business Analyst apprentice"
        },
        {
            "text": "Hello! I’m Cian and I’m a Business Analyst apprentice in the Cyber Security Operations Centre (CSOC). I started my apprenticeship keen to improve my digital skills and to work in the rapidly changing world of technological innovation."
        },
        {
            "text": "Before joining the Home Office I worked as a civil servant in various roles, none of which were digital or technology focussed. Joining DDaT was therefore quite a daunting prospect! However, DDaT apprentices receive plenty of guidance and support - there is always someone to turn to if I have questions or concerns."
        },
        {
            "text": "There have certainly been challenges as I’ve adapted to my apprenticeship. In the first few weeks I felt overwhelmed by technological jargon and felt like I wasn’t picking things up fast enough. However, the well-established support network for apprentices helped me get over bouts of imposter syndrome while developing my professional and personal relationships. I was worried that every other apprentice would be fresh out of school and I’d look out of place as someone in their mid-20s but I now know this a misconception - I work with apprentices of all ages and backgrounds."
        },
        {
            "text": "I appreciate being in an environment where I’m encouraged to throw myself into something new. The development opportunities offered to me include being involved in high impact work from the very start, access to a huge array of online work content and networking with senior staff."
        },
        {
            "heading": 2,
            "text": "Jason Pearson, Apprentice Placement Manager"
        },
        {
            "text": "Apprentices bring innovative ideas and new ways of working to our teams and participate in developing new solutions unconstrained by preconceived ideas and previous practices."
        },
        {
            "text": "By sharing their experiences, apprentices encourage existing team members to think differently, not only about the job they do but about what they want to achieve in the future."
        },
        {
            "text": "Our apprentices are exposed to challenging and interesting projects. I'm currently managing two Data Analyst apprentices who are are responsible for a broad range of work including:"
        },
        {
            "text": "Our apprenticeships are open now. Apply here for DevOps Engineer, Associate Project Manager, Business Analyst, Business Administrator apprenticeships. Don’t miss out - applications close 21 February 2022."
        }
    ]
}