{
    "url": "https://environmentagency.blog.gov.uk/2022/02/07/enabling-nuclear-regulation-for-a-net-zero-future/",
    "title": "Enabling nuclear regulation for a net zero future",
    "authors": [
        "Alan McGoff"
    ],
    "categories": [
        "Uncategorized"
    ],
    "pub_date": "2022-02-07T09:15:17+00:00",
    "content": [
        {
            "text": "The Environment Agency’s New Reactors Assessment Team has been leading an assessment of a nuclear power station design since 2017. Here the team’s manager, Alan McGoff, reflects on the five year project and looks forward to regulating the nuclear industry in 2022."
        },
        {
            "text": "What does the GDA decision mean for nuclear energy in the UK?"
        },
        {
            "text": "We’ve all heard the aspiration about “getting it right first time”. Which prompts the question how do you know what is “right” in the first place, especially if you are expected to achieve it first time?  This is where Generic Design Assessment (GDA) can help for new nuclear power station designs."
        },
        {
            "text": "GDA is the first stage of our scrutiny of proposed new nuclear power station designs.  It begins before site specific proposals come forward and it means that we can assess environment protection and waste management matters early, when change is less difficult. This helps ensure that, if site specific proposals for a new nuclear power station do come forward, these should be better developed and meet our regulatory requirements and expectations so as to properly protect people and the environment."
        },
        {
            "text": "Getting a GDA ‘certificate’ doesn’t mean you can start to build the new power station straight away. The potential operator of a proposed new nuclear power station must still obtain all the necessary permissions required before it could be built and operated but successfully completing GDA provides a good starting point to getting it right."
        },
        {
            "text": "We’ve just completed the GDA of the UK HPR1000 alongside our regulatory partners the Office for Nuclear Regulation who regulate safety and security at nuclear sites. The UK HPR1000 is based on the Hualong One reactor that has been developed by China General Nuclear and that it is now commissioning at its Fangchenggang 3 site in China."
        },
        {
            "text": "This is the fourth GDA that we’ve completed following the UK EPR from France, the AP1000 from the USA and the UK ABWR from Japan. Two UK EPRs are now under construction at Hinkley Point C in Somerset and an almost identical station is proposed for Sizewell C in Suffolk. We’re determining the environmental permits to operate Sizewell C now and will be consulting on our proposed decisions this year."
        },
        {
            "text": "Nuclear power is clearly an international business but so is the climate emergency. Building new nuclear power stations is part of UK’s response to climate change so as to ensure we have reliable supplies of low carbon electricity. Our role in the Environment Agency is to ensure that any that are built meet our high standards of environment protection and waste management.  And on the climate emergency, let’s hope that the international response is right first time, not least because it may be our only opportunity to get it right."
        },
        {
            "text": "Five years in statistics"
        },
        {
            "text": "It takes five years to assess a nuclear power station design. This GDA programme ran from January 2017 to January 2022. We held over 300 meetings with the reactor designer on environmental and cross cutting topics and project governance. We received over 2600 submissions from the reactor designer, of which around 300 were relevant to environmental aspects of the design."
        },
        {
            "text": "Regulators raised 1774 Regulatory Queries (RQ). This is where we ask the reactor designer for clarification and additional information about the design. 93 of these were raised by the Environment Agency, but many more of the RQs contained aspects relevant to environment protection."
        },
        {
            "text": "We and the ONR also raised 60 Regulatory Observations (RO). We raise these when we have a potential concern about the design or its substantiation and we ask the reactor designer to resolve it. Four were raised by the Environment Agency, but at least 8 other ROs contained aspects relevant to environment protection."
        },
        {
            "text": "We’ve published 25 documents over 5 years – including our initial assessment in 2018, detailed assessment and consultation in 2021 and now our final decision."
        },
        {
            "text": "You can learn more about the new nuclear power station design on the company's website which we asked them to set this up as part of the GDA process."
        },
        {
            "text": "Involving communities and stakeholders"
        },
        {
            "text": "Listening to local communities and our national stakeholders is important to us, particularly when making decisions about nuclear power stations and the environment. We’ve been meeting regularly throughout the GDA."
        },
        {
            "text": "We held a public consultation for 12 weeks in 2021. Our engagement included 7 online events and attending 3 events hosted by others. We received 52 responses, 18 from groups and 34 from individuals, which contained over 200 points related to a wide range of topics. We also considered relevant information from the public comments process, which ran throughout the GDA on the UK HPR1000 website. This process generated 73 responses direct to the company. Thanks to all who responded to us."
        },
        {
            "text": "The next GDA?"
        },
        {
            "text": "So, what’s next? We’re always looking to the future and with the next generation of reactor designs on the horizon we updated our GDA process in 2019, introducing additional flexibility to make it more suitable for use with Small Modular Reactors (SMR) and Advanced Nuclear Technologies (ANT)."
        },
        {
            "text": "You may have seen the news that Rolls Royce has submitted an application to enter GDA – and we’re also aware of significant interest in GDAs for other SMR designs. BEIS is responsible for deciding which designs enter GDA and we’re ready to go if asked to begin an assessment of the Rolls Royce SMR design. This UK based design is capable of generating over 440 MW."
        },
        {
            "text": "Contact us to be added to our email list: nuclear@environment-agency.gov.uk"
        }
    ]
}