{
    "url": "https://rpc.blog.gov.uk/2022/02/07/government-responds-to-the-better-regulation-framework-consultation/",
    "title": "Government responds to the Better Regulation Framework consultation",
    "authors": [
        "Stephen Gibson"
    ],
    "categories": [
        "Better regulation",
        "Evaluation",
        "Independent scrutiny"
    ],
    "pub_date": "2022-02-07T13:16:59+00:00",
    "content": [
        {
            "text": "On 31 January, the Government published ‘The benefits of Brexit’, a document which includes the formal response to last year’s consultation on reforming the Better Regulation Framework. The Government also published a summary of the consultation responses."
        },
        {
            "text": "Also of note in relation to better regulation are the statements made to Parliament by Kwasi Kwarteng, Secretary of State for Business, Energy and Industrial Strategy, and Lord Callanan, Better Regulation Minister. These discuss some of the plans for the Better Regulation system."
        },
        {
            "text": "The document and statements set out in general terms an intention to reform the Better Regulation Framework so that it can play its part in the delivery of the Government’s plan to ensure that the UK regulates effectively, takes advantage of the freedoms enabled by leaving the EU, maximises the potential for growth and innovation, and minimises burdens on business."
        },
        {
            "text": "The section of the document most relevant to the Better Regulation system is the section on ‘The Best Regulated Economy in the World’ (pages 20 to 34). These set out proposals under five new regulatory principles:"
        },
        {
            "text": "The document signals an intention to remove the Business Impact Target (BIT) in its current form, which includes our current role as Independent Verification Body (IVB). After a further year of reporting against the BIT, it will be replaced by a revised metric (or metrics) that capture a broader range of impacts than the current net direct costs to business."
        },
        {
            "text": "There is also a target to cut £1 billion of business costs from retained EU red tape, although the Government will need to clarify the period over which this will be achieved and the metric that will be used to measure its delivery."
        },
        {
            "text": "There is a commitment to improved regulatory scrutiny, using a ‘more holistic and efficient approach’. This will include basing the assessments of regulations and scrutiny decisions on criteria and metrics that underpin the UK economy: the impacts of metrics on consumers, businesses, barriers to entry and international trade, innovation and delivering Net Zero ambitions."
        },
        {
            "text": "We recognise that the document signals a direction of travel and a number of detailed points are still to be worked out. At this stage, we are pleased that the proposals incorporate a number of the points that we argued for in our own response to the consultation, including:"
        },
        {
            "text": "The RPC looks forward to working with the Better Regulation Executive and others in government to further define the future framework and ensure that independent scrutiny can continue to play its part as effectively as possible."
        }
    ]
}