{
    "url": "https://educationhub.blog.gov.uk/2022/02/07/how-we-are-helping-students-prepare-for-exams-this-summer-advance-information/",
    "title": "How we are helping students prepare for exams this summer",
    "authors": [
        "media officer"
    ],
    "categories": [
        "Ofqual",
        "Schools"
    ],
    "pub_date": "2022-02-07T11:07:53+00:00",
    "content": [
        {
            "text": "Exams will go ahead this summer as the best and fairest form of assessment."
        },
        {
            "text": "However, we recognise students have faced disruption over the last two years and we have put in place measures to support them."
        },
        {
            "text": "We have introduced a range of adjustments to maximise fairness for those taking exams this year. Here’s what you need to know."
        },
        {
            "heading": 3,
            "text": "What has been published?  "
        },
        {
            "text": "From 7 Feb, students will be able to view information that will help them with their revision ahead of their exams in the summer"
        },
        {
            "heading": 3,
            "text": " What will be available?"
        },
        {
            "text": "For the majority of GCSE and all AS and A level subjects, students will be able to view information published by exam boards on some of the exam content, texts, topics and sub-topics, themes and skills due to be assessed."
        },
        {
            "heading": 3,
            "text": "So will students be getting the questions to their exams before they sit it? "
        },
        {
            "text": "No. The additional information aims to focus students’ revision without providing exact questions that will appear."
        },
        {
            "text": " A common set of principles have been developed for the advance information, for example avoiding providing so much detail that answers could be pre-prepared and memorised, but the information will look different for each subject and exam board, reflecting the nature of those subjects and their assessments."
        },
        {
            "heading": 3,
            "text": " What else is being done to ensure fairness in this year’s exams?"
        },
        {
            "text": "Students will also benefit from other adaptations to exams and the approach to grading this year to mitigate the impact of the pandemic on their education."
        },
        {
            "text": "There will be choices of topics or content in GCSE English literature, history, ancient history and geography, and a formulae or expanded equations sheet available in exams for GCSE maths, physics and combined science."
        },
        {
            "text": "There are also changes to the requirements for practical assessments in sciences and art and design, recognising how the pandemic will have affected students’ opportunities in these subjects."
        },
        {
            "heading": 3,
            "text": "What about the grading of exams this year, is it the same as before? "
        },
        {
            "text": "Ofqual’s plans for grading this summer mean that grading profiles will not return to pre-pandemic levels immediately, recognising the challenges these students have faced."
        },
        {
            "text": "This summer will be a transition year and exam boards will set grade boundaries to reflect a midway point between 2021 and pre-pandemic grading, in a way that is as fair as possible for all students, across all subjects and exam boards."
        },
        {
            "text": "This will mean that more students get higher grades in 2022 than before the pandemic and will provide a safety net for those students who might otherwise just might miss out on a higher grade."
        },
        {
            "heading": 3,
            "text": "How will I be able to access this information?"
        },
        {
            "text": "Advance information has been published on exam boards' websites."
        },
        {
            "text": "Ofqual has also published subject-by-subject guidance on the changes in each subject."
        }
    ]
}