{
    "url": "https://insideDIO.blog.gov.uk/2022/02/07/national-apprenticeship-week-2022-reflecting-on-my-experiences-as-a-dio-apprentice/",
    "title": "National Apprenticeship Week 2022: reflecting on my experiences as a DIO apprentice",
    "authors": [
        "Julian Boyce"
    ],
    "categories": [
        "Apprentices",
        "Communications",
        "Working at DIO"
    ],
    "pub_date": "2022-02-07T11:51:14+00:00",
    "content": [
        {
            "text": "A red flag flying to indicate that a Range Danger Area (RDA) is operational – one of several familiar sights on the Defence Training Estate [Crown Copyright / MOD 2021]As National Apprenticeship Week gets underway, I’d like to offer some reflections on my apprenticeship journey within the DIO corporate communications team, as well as picking out a few personal highlights from my time as an apprentice in DIO."
        },
        {
            "heading": 2,
            "text": "Why choose an apprenticeship?"
        },
        {
            "text": "Like many others, I discovered the Government Communication Service (GCS) apprenticeship while searching for apprenticeship opportunities online. It immediately caught my attention and I remember feeling that the more I read about the programme, the more I wanted to apply."
        },
        {
            "text": "The opportunity to gain real experience in the communications profession, through a full-time job in a government department, really stood out to me from the beginning. What was great about the apprenticeship opportunity was that, although I had no previous experience working in public relations or communications, this was no barrier to applying. In fact, through reading about the experiences of previous GCS apprentices, I was reassured that my natural curiosity towards a career in communications, coupled with my interests in politics, media and current affairs, would serve as a perfect springboard."
        },
        {
            "heading": 2,
            "text": "How can an apprenticeship with DIO help with career development?"
        },
        {
            "text": "Through my time as an apprentice in the DIO corporate communications team, I’ve had opportunities to develop my knowledge and experience across a range of communications disciplines. I’ve worked alongside colleagues in internal communications, external affairs, digital and social media, and have even gained experience in handling press queries and conducting media interviews for radio and television. It’s hard to think of many other courses or development schemes that can afford such a varied learning experience – all while having a full-time job and earning a salary!"
        },
        {
            "text": "Witnessing forestry in action at Beckingham Training Area, Lincolnshire [Crown Copyright / MOD 2021]Over the entirety of the apprenticeship, I’ve been treated as one of the team and have been encouraged to contribute my ideas and opinions to real, important campaigns and initiatives, such as the ‘Respect the Range’ Training Estate Public Safety Campaign (TEPS). Last March, I helped to deliver our communications strategy for the MOD-wide Sanctuary Awards, which inspired me to devise my own digital and social media campaign as part of the apprenticeship programme, aimed at raising awareness of DIO’s commitment to sustainability."
        },
        {
            "text": "The team also supported me fully in balancing my work requirements around studying for a level 4 PR and Communications qualification. The real benefit of the apprenticeship for my career development has been through this combination of varied, ‘real life’ experience in communications, as well as achieving a relevant qualification to help me embark on a career in the communications profession."
        },
        {
            "heading": 2,
            "text": "Highlights from my time as an apprentice"
        },
        {
            "text": "My apprenticeship experience has been in some respects an unconventional one, having joined DIO in October 2020 in the midst of the Covid-19 pandemic. However, I’ve been fortunate over the last four or five months to have had some great opportunities to venture well beyond my work-from-home desk and explore the vast and varied Defence estate."
        },
        {
            "text": "In September last year, I travelled to MOD Main Building in London, where I gained a week’s experience in the Insight, Data, Evaluation and Analysis team within the Directorate of Defence Communications. This was closely followed by the opening, in October 2021, of DIO’s new Head Office at DMS Whittington. I was lucky enough to attend the official opening ceremony, which featured a parachute display from the Royal Logistic Corps Silver Stars, as well as a speech from then-Chief of the Defence Staff, General Sir Nick Carter."
        },
        {
            "text": "Not just a typical day at the office: The Royal Logistic Corps Silver Stars parachute team put on a display for the official opening ceremony of DIO’s new Head Office [Crown Copyright / MOD 2021] [Crown Copyright / MOD 2021]More recently, I’ve visited military training areas in the north and south of England to conduct filming and interviews for media features on a wide range of topics and issues, from public access rights to archaeology, forestry, and other sustainable land management activities. Having learnt so much from these kinds of experiences, one piece of advice I’d definitely give to all new apprentices is this: never be afraid to ‘go for it’ if you spot something you’d like to do or get involved in, even if you think it might be beyond your comfort zone!"
        },
        {
            "text": "With the end of my apprenticeship approaching in April, I look forward to continuing to build on the knowledge, skills, and experiences I’ve gained over the last 16 months as I take the next steps in my career."
        }
    ]
}