{
    "url": "https://actuaries.blog.gov.uk/2022/02/07/the-importance-of-the-qas-accreditation-for-gad/",
    "title": "The importance of the QAS accreditation for GAD",
    "authors": [
        "Natasha Hill - Actuary"
    ],
    "categories": [
        "Actuary"
    ],
    "pub_date": "2022-02-07T12:00:59+00:00",
    "content": [
        {
            "text": "Quality marks and assurance standards are important indicators of the quality of services and products. They mark out organisations or products which have been assessed as being of a certain standard. The Quality Assurance Scheme (QAS), run by the Institute and Faculty of Actuaries (IFoA) is one such mark."
        },
        {
            "text": "At the Government Actuary’s Department (GAD), we’ve recently submitted our annual QAS return. This annual return shows the IFoA that we’ve been continuously improving; working to uphold the standards needed to complete high-quality actuarial work. It’s an important accreditation which we are proud to display."
        },
        {
            "heading": 2,
            "text": "Important accreditations"
        },
        {
            "text": "Accreditations are used by organisations to signify success and compliance. As an example, in GAD, we’ve recently been awarded the ISO/IEC 27001 accreditation. It has been awarded by Lloyd’s Register (LR) for GAD’s information security management system. The accreditation recognised that we’ve successfully demonstrated security in information and communication technology. GAD also holds the Workplace Wellbeing Charter accreditation, demonstrating our commitment to the health and wellbeing of employees."
        },
        {
            "text": "The QAS accreditation recognises our high-quality standards and provides a framework for our actuarial work. It helps to ensure suitable policies and procedures are in place, to support the delivery of high-quality actuarial work. The QAS recognises that the working environment is key in ensuring that actuaries fulfil their professional obligations. Its objectives are to:"
        },
        {
            "text": "GAD’s QAS accreditation shows we have good internal policies and procedures, which have been independently assessed. The scheme is open to any organisation that employs one or more IFoA members carrying out actuarial work. Organisations’ representatives share experience in IFoA-led QAS forums."
        },
        {
            "text": "This means we gain insight from best practice examples drawn from a wide range of organisations, operating across the UK and internationally. We are also able to offer more flexibility in the CPD (Continuing Professional Development) requirements that actuaries must meet to ensure that their knowledge remains up to date and they continue to learn new skills."
        },
        {
            "heading": 2,
            "text": "Assessment and accreditation"
        },
        {
            "text": "GAD achieved QAS accreditation in 2016, soon after the scheme was launched, and we’re really proud to have it. The team of colleagues I work with focus on identifying, and helping colleagues manage, professional and technical risk. We help to progress initiatives which support the aims of the accreditation."
        },
        {
            "text": "The IFoA has recently undertaken a review of the QAS, with a refreshed scheme due to go live in April 2022. The new streamlined outcomes will help us to improve our practices even further, ahead of our upcoming 6-year re-accreditation assessment."
        },
        {
            "text": "This will be an important milestone because the accreditation involves an assessment of GAD’s policies and procedures which are regularly reviewed to ensure they remain up to date and relevant. Assessors also establish whether these policies and procedures are embedded within an organisation’s culture and continue to be applied by the people who work there."
        },
        {
            "heading": 2,
            "text": "GAD’s submission"
        },
        {
            "text": "In the annual returns we have to show the IFoA that the QAS requirements continue to be met. We must demonstrate that suggested improvements have been acted on and there’s continuous improvement in the organisation under each of the 5 outcomes that the QAS currently focuses on."
        },
        {
            "text": "Examples from this year’s return relating to these 5 outcomes included:"
        },
        {
            "heading": 2,
            "text": "Benefits for clients and colleagues"
        },
        {
            "text": "Accreditation means clients can be reassured that the procedures in place ensure the advice, analysis and reports they receive are high quality and have been reviewed by suitably experienced staff."
        },
        {
            "text": "Our approach to producing actuarial work is informed by best practice across the industry from other QAS accredited organisations. The IFoA provides regular training and networking opportunities for staff involved with the accreditation often bringing in speakers from outside of the actuarial profession."
        },
        {
            "text": "Our Head of Research & Technical, Sophie Dignan, has recently been appointed to the IFoA’s QAS Committee. This committee reviews other organisations’ applications for accreditation and their annual returns. It also helps to oversee the ongoing administration and development of the scheme. GAD supports its employees to volunteer with the IFoA. Committee and working party roles bring development opportunities for the individual. They also benefit GAD, for example through closer liaison with the IFoA and access to cutting-edge thinking."
        },
        {
            "text": "As a relatively new joiner to GAD, I’ll be learning more about the initiatives GAD has in place to support the provision of high-quality actuarial work and how I can play my part. The process of continued improvement never stops, and that should stand us in good stead as we prepare to apply for re-accreditation later in 2022."
        },
        {
            "text": "Disclaimer"
        },
        {
            "text": "The opinions in this blog post are not intended to provide specific advice. For our full disclaimer, please see the About this blog page."
        }
    ]
}