{
    "url": "https://civilservice.blog.gov.uk/2022/02/07/tinnitus-from-banging-tunes-to-burglar-alarms/",
    "title": "Tinnitus: From banging tunes to burglar alarms",
    "authors": [
        "Alan Dillon"
    ],
    "categories": [
        "A Modern Civil Service",
        "An Innovative Civil Service",
        "Uncategorized"
    ],
    "pub_date": "2022-02-07T09:17:02+00:00",
    "content": [
        {
            "heading": 3,
            "text": "Alan Dillon, Head of Chancery from the British Embassy Muscat, on his experience of living with the hearing condition, tinnitus."
        },
        {
            "text": "‘Buzzing, whooshing, humming, ringing, throbbing, hissing, music, singing.’"
        },
        {
            "text": "Dr Seuss could have hardly described it better had he rewritten his famous book Horton Hears a Who! for a version in which the elephant had tinnitus rather than extraordinary hearing. But the words above are, in fact, from the NHS’s health guide on the auditory disorder which the British Tinnitus Association says affects approximately one third of the UK population at some point in their lives.  "
        },
        {
            "text": "7-13 February marks Tinnitus Awareness Week, an annual event which aims to increase understanding of the perception of sound in the absence of any being made externally.  "
        },
        {
            "text": "For some sufferers, it is a temporary disorder brought on by an underlying problem, but for 8% of the British population, it is permanent.  It’s not known what exactly causes tinnitus, although medical professionals agree that it’s neither an illness nor a disease. It is actually brought on by a ‘change’ which alters the flow of information to the brain."
        },
        {
            "text": "Always with me"
        },
        {
            "text": "I have had tinnitus for just over half my life. It appeared around the time I lost part of my hearing in my left ear following acoustic trauma (exposure to a sudden, extremely loud sound). It is always with me, and is the first thing I hear when I wake up and the last thing I hear before falling asleep.  "
        },
        {
            "text": "When things are going well, it is for the most part just slightly annoying and hardly noticeable, but it has the ability to ‘pump up the volume’ and be in full Dolby Stereo when I am dehydrated, highly-caffeinated or over-tired.  "
        },
        {
            "text": "If I wear my hearing aid for long periods, that too can bring my tinnitus to the forefront. Regardless of my physical or mental wellbeing, my worst scenario is being in a silent space with nothing to mask or drown out my tinnitus, although the alternative of the constant chatter of background noise does little to help my limited hearing. That said, I doubt I am alone in occasionally yearning for just a few minutes of absolute silence – I’ve heard it can be golden!"
        },
        {
            "text": "Everyone’s tinnitus is different.  My constant audio irritant is a high-pitched pulsing ringing, sometimes accompanied by waves of fast clicking. Occasionally, my internal DJ decides to throw in a sudden mid-range tone which fades in and out for a few minutes.  "
        },
        {
            "text": "There was a time when what I hear all day – every day - might have made the top 40 rave or alternative music charts. Sadly, I’ve long-stopped making cardboard box shapes on the dance floor and there’s no ‘off’ switch. "
        },
        {
            "text": "Barbie on repeat"
        },
        {
            "text": "I suffer from what is known as pulsatile tinnitus although some people suffer from a purer form of musical tinnitus, or musical hallucinations, which is the experience of hearing a few bars or fragments of music despite none being played (with apologies to any Aqua fans, there can’t be anything worse than having Barbie Girl on constant repeat).  "
        },
        {
            "text": "I find that when I am busy, my brain is distracted so is unable to work up an internal playlist. The second I stop, however, it will try its best to press the play button.  "
        },
        {
            "text": "Limited hearing range"
        },
        {
            "text": "I have learnt to live with tinnitus, although it’s rather ironic that despite having a very limited hearing range in my left ear, the sounds I think I am hearing are high frequency, something I haven’t actually heard for more than 27 years."
        },
        {
            "text": "Joking aside, some people suffer very badly from tinnitus, depriving them of sleep, affecting their mental wellbeing or as a particular source of stress.  Although there is currently no absolute cure, there is plenty of advice and professional support available such as the British Tinnitus Association and the Royal National Institute for Deaf People (RNID).  "
        },
        {
            "text": "Sound therapy"
        },
        {
            "text": "For some, tinnitus can be successfully treated by sound therapy which is the introduction of neutral sounds that distract the brain. Counselling, cognitive behavioural therapy and tinnitus retraining therapy can also help sufferers understand their disorder and try various coping methods. "
        },
        {
            "text": "If you think you might have tinnitus and haven’t already done so, I encourage you to see your GP in the first instance. If you’re a sufferer, I hope you will consider sharing your experience in the comments below, maybe describing the sounds that only you can hear and how you cope with tinnitus."
        },
        {
            "text": "The CSDHHN welcomes new members with all types of hearing impairments. Why not visit the network's webpage to find out more."
        }
    ]
}