{
    "url": "https://civilservice.blog.gov.uk/2022/02/07/were-levelling-up-careers-in-the-civil-service/",
    "title": "We’re Levelling Up Careers in the Civil Service",
    "authors": [
        "Alex Chisholm, Civil Service Chief Operating Officer and Cabinet Office Permanent Secretary"
    ],
    "categories": [
        "A Modern Civil Service",
        "A Skilled Civil Service",
        "An Ambitious Civil Service",
        "An Innovative Civil Service"
    ],
    "pub_date": "2022-02-07T11:42:43+00:00",
    "content": [
        {
            "heading": 3,
            "text": "Following the newly-launched Levelling Up White Paper, Alex Chisholm explores how moving thousands of Civil Service roles and creating more opportunity around the country will help us to build A Modern Civil Service. "
        },
        {
            "text": "Last week the Government launched the much anticipated Levelling Up White Paper. The paper sets out an exciting agenda that includes urban regeneration across the UK, improving education and training, investing in communities, tackling inequalities in health and wellbeing, and creating jobs."
        },
        {
            "text": "In the Civil Service, we have ambitious plans to level up career opportunities for people across the UK. Following the launch of our new vision for A Modern Civil Service, last summer we committed in the Declaration of Government Reform to move 22,000 roles outside of London, including 50% of Senior Civil Servant roles. "
        },
        {
            "text": "This will mean that there are better career opportunities for you across the UK, offering varied roles for diverse talents that reflect the people we serve, and in the process bringing decision-making to communities. "
        },
        {
            "text": "Jobs in the Civil Service are varied, whether that’s working in intelligence, supporting people to secure employment, protecting our borders, helping educate our children, writing policy that positively impacts citizens, or analysing data that helps us to make decisions that save lives - you can build a rewarding career while building up your skills."
        },
        {
            "text": "Early successes"
        },
        {
            "text": "More than 2,000 Civil Service jobs have already been moved out of London as part of our Places for Growth programme. Furthermore, over the last year we announced a number of second headquarters for departments, including in Glasgow (Cabinet Office), Darlington (HM Treasury) and Wolverhampton (Department for Levelling Up, Housing and Communities). We also renewed our commitment to East Kilbride with an expanded FCDO presence, a commitment from HMRC to remain at Queensway House, and plans for DWP’s second HQ in Leeds. "
        },
        {
            "text": "Working together to benefit local communities"
        },
        {
            "text": "The towns and cities where Civil Service roles will be located will have PfG local delivery plans to bring together the government departments in that area. These joined up delivery plans will help us to work together more dynamically, embedding long-term sustainability and developing strong links with local communities. "
        },
        {
            "text": "Success stories"
        },
        {
            "text": "Beth Russell, HM Treasury Director of Tax and Welfare:"
        },
        {
            "text": "Beth is one of our most senior civil servants and recently moved to Darlington - something that many would have felt inconceivable just a few years ago."
        },
        {
            "text": "Beth said “It’s been hugely exciting seeing the new Darlington Economic Campus take shape over the last few months. We’ve already recruited lots of brilliant people bringing new insights and experience to the Civil Service. We’ve been doing outreach locally and across the region which we hope will better inform policy-making and delivery of government services.”"
        },
        {
            "text": "David Foley, Director of Public Bodies in the Cabinet Office:"
        },
        {
            "text": "“I thought I'd given up the chance of working in the Cabinet Office when I moved out of London 20 years ago. Places for Growth and Levelling Up are changing that, and the fact I'm now working in the Cabinet Office in Glasgow has made it feel very real on a personal level.”"
        },
        {
            "text": " "
        },
        {
            "text": "Rebecca Harrap, Government Communication Service Apprentice:"
        },
        {
            "text": "“The GCS apprenticeship has enabled a host of opportunities for me in the city I live in, Nottingham. Civil Service apprenticeships are vital as it provides the opportunity to stimulate regional growth amongst young people across the UK and not just in London, promoting a more diverse Civil Service.”"
        },
        {
            "text": " "
        },
        {
            "text": "Attracting talent closer to home"
        },
        {
            "text": "Last year, we launched the Closer to Home campaign which promotes Civil Service roles in regions across the UK. We have worked with local authorities, devolved administrations, colleges and universities to build relationships and encourage a wider interest in joining the Civil Service. "
        },
        {
            "text": "This highly successful campaign has led to a rise in external applications for Civil Service jobs. A recent campaign launched in Scotland - for specialist casework roles saw a 357% increase in applications, which the vacancy holder commented were of the ‘highest quality’."
        },
        {
            "text": "The next phase of the campaign will cover UK Civil Service roles in Northern Ireland, the North West and Midlands. "
        },
        {
            "text": "Why not start your own Civil Service journey or find your next move to another role or department? Go to the Civil Service careers website to find jobs near you, or try our Career Matcher quiz."
        }
    ]
}