{
    "url": "https://defradigital.blog.gov.uk/2022/02/07/youre-hired-celebrating-national-apprenticeship-week-2022/",
    "title": "You’re hired – celebrating National Apprenticeship Week 2022",
    "authors": [
        "Claire Thomas Hwnt"
    ],
    "categories": [
        "Defra digital",
        "Defra services",
        "Software tools",
        "Strategy",
        "User centred design"
    ],
    "pub_date": "2022-02-07T08:00:46+00:00",
    "content": [
        {
            "text": "As Workforce Management Lead, I'm responsible for coordinating and promoting apprenticeships within our area of Defra – Digital, Data and Technology Services (DDTS).  When a DDTS colleague is considering taking their career forward by doing an apprenticeship, they contact me, and I'll help them take it forward with the Defra Apprenticeship team.  I also encourage hiring managers to consider whether roles they're recruiting for could be apprenticeships, to increase our take-up in this area."
        },
        {
            "text": "When I first started working in this area, I was blown away by the sheer breadth of opportunities available via apprenticeships - almost any qualification you can think of can be done via an apprenticeship route, from software developing to business analysis, from project management to HR. And all can be funded by the apprenticeship levy, a pot of money held centrally that can only be used to fund apprenticeships. Each year we get this funding and it’s important we use as much of this as we can. In DDTS we have a number of apprentices, working in a variety of roles."
        },
        {
            "text": "National Apprenticeship Week 2022 brings together businesses and apprentices across the country to shine a light on the positive impact that apprenticeships make to individuals, businesses, and the wider economy. Our apprentices have brought new thinking and a different outlook to the way we work, and it’s been refreshing to see."
        },
        {
            "text": "The theme this year is 'build the future’ and it reflects on how apprenticeships can help individuals to develop the skills and knowledge required for a rewarding career, and how organisations and businesses can develop a talented workforce that is equipped with future-ready skills."
        },
        {
            "heading": 2,
            "text": "The times they have a changed….."
        },
        {
            "text": "I still come across people who think of apprenticeships as opportunities for young people just starting out in their careers and who only join our organisation from elsewhere; this isn't the case.  You can undertake an apprenticeship at any age, at any level in the organisation, and from within."
        },
        {
            "text": "For colleagues already in Defra, or elsewhere in the civil service, you don't necessarily need to be a new starter - you just need to be in a role that will last at least two years and will support the learning you'll do while on an apprenticeship. Anyone, at any grade, can do an apprenticeship if the apprenticeship is relevant to their role and will provide substantive new skills and learning."
        },
        {
            "text": "Providing such development opportunities to existing employees is incredibly important for supporting staff retention as it helps us to build our own talent rather than relying solely on ‘buying in’ external talent. That is vital for us given how competitive the tech jobs market is."
        },
        {
            "text": "There are different levels of apprenticeships for all levels of academic ability (from GCSE to Post Graduate level) and an increasing number of degree level and postgraduate programmes. The recruitment process is the same as it is for non-apprentice vacancies that we try to fill."
        },
        {
            "heading": 2,
            "text": "Weighing up the positives"
        },
        {
            "text": "The benefits to an organisation like Defra are many. It works both ways though. Apprenticeships provide skills and development training for existing or new employees at no direct cost to the department, and they ensure we don’t miss out on the increasing number of talented individuals who are deliberately choosing not to go to university."
        },
        {
            "text": "They also enable us to provide employment opportunities to those who may not otherwise have the opportunity to work at Defra. For example, those in under-represented groups, and on government sponsored schemes such as the Care Leaver’s, Veteran’s, or social mobility schemes."
        },
        {
            "text": "If you want to know what our apprentices think about life in Defra DDTS then check out our LinkedIn page, where you will find some personal stories from our newest recruits."
        },
        {
            "text": "Find out more\nIf you're considering the next step in your career, why not think about whether an apprenticeship could get you there. We currently have science and data apprenticeships. Drop me a line to find out what options there are."
        }
    ]
}