{
    "url": "https://governmentscienceandengineering.blog.gov.uk/2023/10/11/applications-are-now-open-for-the-science-and-engineering-fast-stream/",
    "title": "Applications are now open for the Science and Engineering Fast Stream",
    "authors": [
        "gseprofession"
    ],
    "categories": [
        "Blog Series",
        "GSE Opportunities",
        "Talent & Leadership"
    ],
    "pub_date": "2023-10-11T12:01:11+01:00",
    "content": [
        {
            "text": "Society faces many challenges which science can help solve. The Covid-19 crisis in particular highlighted the essential role of scientists and engineers in improving the quality of government decisions, to ensure scientific evidence underpins policy and that it is effectively communicated."
        },
        {
            "text": "The government needs highly talented, versatile, and numerate scientists and engineers who are representative of our diverse population, to deliver on exciting and challenging work that will make a difference to the lives of people across the UK."
        },
        {
            "heading": 3,
            "text": "Is this you?"
        },
        {
            "text": "We are recruiting for the Science and Engineering scheme in the Civil Service Fast Stream’s award-winning leadership development programme. The Fast Stream is the Government's flagship graduate development programme; it equips the brightest candidates with the knowledge, skills and experience they need to become future leaders of the Civil Service."
        },
        {
            "text": "You may be a science or engineering graduate straight out of university, an experienced postgraduate academic, a seasoned industry professional or a current civil servant with relevant experience. Join us and you will become part of a modern, vibrant, and active community of science and engineering professionals, who have one goal in common: to give back to the communities they serve. Whatever your background, you will have a unique set of technical skills that make you stand out from the wider Fast Stream."
        },
        {
            "heading": 3,
            "text": "What will you experience?"
        },
        {
            "text": "On the Fast Stream, you will experience a wide range of exciting and rewarding postings while being supported to grow through a tailored personal development programme and mentoring."
        },
        {
            "text": "Over three years, you will experience a wide range of stretching but rewarding postings across the Civil Service such as assistant Private Secretary to MOD Chief Scientific Adviser, Earth Observations Policy Support in DEFRA and a Materials Advisor for the Department for Science, Innovation and Technology. These are the types of roles you may experience, and this means that you will likely work in areas outside of your scientific/engineering knowledge, and you will use your experience and expertise to grow through a tailored and accelerated leadership development programme."
        },
        {
            "text": "The Government Science Engineering Profession are keen to broaden experience, and the Science and Engineering Fast Stream scheme offers a unique interchange placement which may include working in local government, charity and private sector roles. Together, these postings will develop your ability to apply your scientific mindset and your leadership potential, to prepare you to become a future senior leader in the Civil Service."
        },
        {
            "heading": 3,
            "text": "How to apply"
        },
        {
            "text": "The Science and Engineering Fast Stream will develop you into a confident and inspiring future senior leader in the Civil Service – supporting our ambition to put science and engineering at the heart of government policy. So, if you are passionate about science and engineering, why not apply today?"
        },
        {
            "text": "For more information, please visit the Science and Engineering Fast Stream pages on the Civil Service Fast Stream website."
        },
        {
            "text": "Applications are open from noon, 12 October 2023, until noon, 9 November 2023."
        }
    ]
}