{
    "url": "https://environmentagency.blog.gov.uk/2023/10/11/how-the-environment-agency-uses-data-to-protect-our-water-resources-in-a-changing-climate/",
    "title": "How the Environment Agency uses data to protect our water resources in a changing climate",
    "authors": [
        "Environment Agency"
    ],
    "categories": [
        "Environment Agency"
    ],
    "pub_date": "2023-10-11T10:08:25+00:00",
    "content": [
        {
            "text": "By Rob Davies, Hydrometry and Telemetry Officer in the West Midlands"
        },
        {
            "text": "After spending almost 20 years collecting data in the West Midlands to respond to climate change challenges, like flooding and drought, I still love the job I do as much as when I first got called to interview for the Environment Agency."
        },
        {
            "text": "I’m based in Shrewsbury in Shropshire, but my job takes me throughout the Environment Agency’s West Midlands area, which covers Gloucestershire in the West to Staffordshire and parts of South Derbyshire in the East.  Our area also covers Herefordshire, Worcestershire, Warwickshire and the West Midlands."
        },
        {
            "text": "The environment, and most importantly our water resources, are precious so getting the chance to help protect them and inform people about our amazing environment every day is special to me."
        },
        {
            "text": "Basically, my role involves measuring water!  It’s simple, but essential and our actions underpin almost everything that happens at the Environment Agency."
        },
        {
            "text": "Our data is vital in our response to flooding and helps us to update the public through the issue of flood alerts and warnings and inform our decision to deploy flood barriers. It also helps the Environment Agency to manage many other activities, including planning, water resource management and incident management."
        },
        {
            "text": "Teams like the one I’m in travel the country maintaining, managing, and calibrating our monitoring stations. These stations take vital hydrological measurements, including river levels, river flows, rainfall, and groundwater levels."
        },
        {
            "text": "As well as the sensors that collect the data, we’re also responsible for the field telemetry systems (waterproof computers) that send this crucial data back to the office. We then validate the data and use this to respond to data requests from a wide range of customers."
        },
        {
            "text": "Our live data is available on our website for the public to access, so they can monitor their local river levels, flood risk and environment."
        },
        {
            "text": "‘A nation resilient to climate change’ is one of the long-term goals in the Environment Agency EA2025 plan and it’s great to see that our work contributes to that goal."
        },
        {
            "text": "Climate change is primarily a water crisis. It’s causing rising temperatures to disrupt precipitation patterns and the entire water cycle, and we experience its impacts through worsening and more regular floods and droughts."
        },
        {
            "text": "The hydrological data our team collects and manages is essential. It helps the Environment Agency and others to understand our changing climate and helps us to manage and come up with solutions where possible."
        },
        {
            "text": "Only by understanding a problem, can we begin to solve and respond to it."
        }
    ]
}