{
    "url": "https://defradigital.blog.gov.uk/2023/10/11/what-a-content-designer-does-in-discovery-part-one/",
    "title": "What a content designer does in discovery: Part One",
    "authors": [
        "Sandeep Dhaliwal",
        "Ruth Fryer"
    ],
    "categories": [
        "Defra content design",
        "User centred design",
        "User research"
    ],
    "pub_date": "2023-10-11T10:10:59+01:00",
    "content": [
        {
            "text": "In the first post of a two-part blog, content designers Ruth Fryer and Sandeep Dhaliwal explain what the discovery phase is for, and why some teams need to think about content design from the start."
        },
        {
            "heading": 2,
            "text": "What the discovery phase is"
        },
        {
            "text": "Discovery is a way of finding out more about what your users need from you. You do this at the start of a project. During this phase you’re:"
        },
        {
            "text": "This helps a team to move forward so they can base decisions on more than risky assumptions."
        },
        {
            "text": "Starting with a better understanding of the problem helps the whole team. What you learn in discovery helps you work out what to test to alpha, which can make the design process quicker."
        },
        {
            "heading": 2,
            "text": "What the focus is"
        },
        {
            "text": "Your aim is to find out what your users are trying to achieve and why. As a content designer, your focus is around understanding your audience’s language. This will help you understand the problem you’re trying to solve (the problem statement)."
        },
        {
            "text": "You’ll need to find out how users talk and think about things that are relevant to the problem statement. This includes knowing where they are already going for help and what their needs are."
        },
        {
            "heading": 2,
            "text": "Who you work with in discovery teams"
        },
        {
            "text": "You’ll explore the problem space as part of a multidisciplinary team. You’ll work particularly closely with a user researcher, service designer and an interaction designer."
        },
        {
            "text": "Ideally, it’s best to have the same team and disciplines in discovery as you’d have in alpha. But it doesn’t always work out that way. Sometimes your team could be a lot smaller. It might just be a business analyst, user researcher and content designer."
        },
        {
            "text": "It’s important to work closely with your user researcher to analyse research. This will help you understand what users are trying to do and how they go about doing it."
        },
        {
            "heading": 2,
            "text": "Why content designers need to be in a discovery team"
        },
        {
            "text": "Content designers are not always part of a discovery team.  However, when there is a strong need for a content audit and where there is going to be extensive user research you should consider including a content designer on the team."
        },
        {
            "text": "A content designer can:"
        },
        {
            "text": "Work out who needs what information, at the right points of the journey and the best ways to show it, and suggest the most relevant information based on user needs and their tasks."
        },
        {
            "heading": 2,
            "text": "Examples of content design tasks for a discovery"
        },
        {
            "text": "Content designers help in a range of ways, like:"
        },
        {
            "text": "There are also a range of analytics, insights, and other sources you can use to learn:"
        },
        {
            "text": "Wider desk research will show the user's natural vocabulary using:"
        }
    ]
}