{
    "url": "https://naturalengland.blog.gov.uk/2023/07/28/dartmoor-achieving-a-future-with-thriving-agriculture-and-thriving-nature/",
    "title": "Dartmoor: achieving a future with thriving agriculture and thriving nature",
    "authors": [
        "Dave Slater"
    ],
    "categories": [
        "Biodiversity",
        "Environment Act",
        "Farming",
        "Landscapes",
        "National Nature Reserve",
        "Natural England",
        "Protected sites and species",
        "Science and evidence",
        "Wildlife",
        "wildlife and farming"
    ],
    "pub_date": "2023-07-28T10:32:14+01:00",
    "content": [
        {
            "text": "By Dave Slater, NE Regional Director for the South West"
        },
        {
            "text": "Since our previous blog reflecting on the condition of Dartmoor’s special habitats there has been a lot of public discourse on what should happen on Dartmoor’s sites of special scientific interest (SSSIs). There are strong feelings on all sides; many have been expressed in the media. Some feel that radical action is needed now to halt the decline of these precious habitats, while others feel that we should preserve the status quo to protect local farming interests at a time of uncertainty and rising costs. The answer, as always, is somewhere in between."
        },
        {
            "text": "As the government’s statutory advisor on nature conservation, Natural England’s role is to provide advice on the management of SSSIs and we have a legal responsibility to ensure management of protected sites is done in a way that leads to ‘favourable condition’. In the case of the Dartmoor commons, favourable condition means a mosaic of habitats containing gorse, heather, bogs and other upland plant species, that support species such as curlew and golden plover which were once common across the South West uplands. This vegetation also protects the peat and helps prevent carbon being released into the atmosphere, contributing to climate change. Anyone who has walked across heather and gorse dominated areas in the summer when they are in flower will know what a breath-taking landscape this can be."
        },
        {
            "text": "These habitats rely on grazing to maintain the mixture of plant species needed, but too much grazing at the wrong time of year can lead to a domination of grasses and the loss of the structure that is needed for wildlife to flourish. During the winter when grass availability is reduced sheep will browse the new growth of heather and bilberry. This grazing pressure will, over time, lead to a sharp decline in heather cover. The impact of sheep on heathland vegetation is further compounded by the over dominance of purple moor-grass (Molinia) from a lack of summer grazing by cattle and historic drainage. As purple moor-grass is unpalatable during the winter this results in the sheep grazing being concentrated on the drier heathland habitats further compounding the damaging impact of winter sheep grazing. In some areas our monitoring data suggests that heather cover has reduced from 25% to 1% over recent years. This data does, however, show that small heather shoots are present across much of the site – albeit in a fragile state and restoration would be possible with the right grazing management in place."
        },
        {
            "text": "Grazing by ponies and cattle over the summer months is the key to restoring areas currently dominated by purple moor-grass if they can be kept from drifting off. We know from listening to commoners and land managers on Dartmoor that when you have stock on large open unfenced commons it is difficult to get them to do exactly what you want. Many sheep have learnt their boundaries over generations, so called hefted flocks (known as leering on Dartmoor). However, as habitats change and management varies from common to common this is difficult to maintain and stocking rates cannot be changed overnight."
        },
        {
            "text": "Over the last six months or so we have done a lot of listening – I have walked the moors with ecologists, farmers, conservation organisations and landowners and discussed pressure, problems and solutions. We have listened to local MPs concerned about their constituents and read with interest the different views in the media. I have been struck by just how much we all agree on the long-term vision for Dartmoor – thriving agriculture and thriving nature. Yet deep divisions remain on how we get there and what steps we need to take and when."
        },
        {
            "text": "Following the Westminster Hall debate in April on farming in Dartmoor, Ministers recognised the need for an independent evidence review to look at how these SSSIs should be managed into the future. This is now being taken forward by Defra who have appointed David Fursdon as its chair. NE has always supported the idea of an evidence review – it is vital that all parties have faith on the evidence which affects the decisions we take – some of which have consequences for people’s livelihoods. We will support the review and look forward to its findings."
        },
        {
            "text": "While this takes place, we have agreed to extend Higher Level Stewardship agreements on Dartmoor, asking for some moderate removal of sheep in the winter where this is needed to remove the risk of jeopardising the long-term recovery of the moorland habitats. The vast majority of SSSI commons will not be asked to reduce stock this year, although we have asked for some improved stock management such as shepherding and other positive management such as the cutting and maintenance of firebreaks."
        },
        {
            "text": "Once the evidence review is complete, we will look to work together with all the farmers and stakeholders on Dartmoor to agree a way forward. This  will look to ensure there is trust, collaboration and understanding between all the partners – so that commoners can have some certainty on how they can plan their business and they are properly rewarded for the contribution they are making to the recovery of the SSSI."
        },
        {
            "text": "There’s a lot going on in and around Dartmoor for nature, and there is an increased focus on our National Parks being exemplars for nature as part of the Government’s policy to ensure 30% of England is well managed for nature by 2030. We work in partnership with Devon Wildlife Trust in East Dartmoor on their inspiring Landscape Recovery Project, and with the Duchy of Cornwall who are looking to expand the precious temperate rainforest habitats on their land . We are also working in partnership with the South West Peatland partnership to restore peatland habitats across Dartmoor."
        },
        {
            "text": "In conclusion, while views are often polarised, if we are to see a future for Dartmoor’s beautiful and unique habitats and the return of some of our iconic bird species, we will have to find a way to provide certainty and support to Dartmoor’s farmers. We will need to listen to each other and find solutions that are practical and fair– it cannot be one or the other and it will take time."
        }
    ]
}