{
    "url": "https://earlyyears.blog.gov.uk/2023/07/28/expanding-our-pilot-to-streamline-early-years-registration/",
    "title": "Expanding our pilot to improve early years registration",
    "authors": [
        "Yvette Stanley, National Director Regulation and Social Care"
    ],
    "categories": [
        "Early years"
    ],
    "pub_date": "2023-07-28T11:00:16+01:00",
    "content": [
        {
            "text": "In November, we published a blog about our plans to streamline the early years registration process."
        },
        {
            "heading": 2,
            "text": "Pilot programme"
        },
        {
            "text": "Over the past few months, we have carried out a pilot, testing whether we could speed up the process by changing when we scheduled the registration visit. We wanted to reduce any time where providers were kept waiting for the next step."
        },
        {
            "text": "We piloted this in the South East and in the North East, Yorkshire and Humber regions. We now plan to roll this out to all early years providers from September 2023."
        },
        {
            "heading": 2,
            "text": "Our new registration process"
        },
        {
            "text": "The new process is quite simple. When we receive a completed application, we will contact applicants to discuss their application. At this time, we will also schedule a registration visit with them. This will usually be 8 weeks after the application has been received. However, if all suitability checks are not complete by week 6 of the application, we may need to reschedule the visit."
        },
        {
            "heading": 2,
            "text": "Results of the pilot"
        },
        {
            "text": "We wanted to find ways to speed up the early years application process without compromising our regulatory rigour. Caring for children is vital work. We want to make sure that only those who are suitable become registered to do so."
        },
        {
            "text": "We also found that our additional telephone calls helped catch mistakes and inaccuracies in application forms which may have led to later delays. Applicants said they found the additional calls helpful to understand the next steps."
        },
        {
            "heading": 2,
            "text": "Next steps"
        },
        {
            "text": "Our work does not stop here. We’re always looking for new ways to do things more efficiently and effectively. Part of our role is to continually review how we use public funds effectively, and to reduce the time and cost pressures for providers whenever possible."
        },
        {
            "text": "Ofsted’s recently published annual report and accounts shows that we carried out 2,500 registration visits and registered 5,880 settings last year. The average time for registration was considerably below the previous 25-week target."
        },
        {
            "text": "We try to register providers as quickly as possible, but there are sometimes unavoidable delays. We are frequently reliant on outside agencies for information, so we ask for your understanding and patience when we cannot meet these timescales."
        },
        {
            "text": "We’ll conduct a welcome call with you to make sure your application is complete before proceeding with the registration process. By reading our registration guidance, including all of the necessary information on the application forms, and by making sure that all those connected to an application complete their form too, you’ll be helping us to register you as swiftly as possible."
        }
    ]
}