{
    "url": "https://kingsawards.blog.gov.uk/2023/07/28/feritech-globals-export-success/",
    "title": "Feritech Global’s Export Success",
    "authors": [
        "sarahminney"
    ],
    "categories": [
        "Innovation",
        "International trade",
        "King's Awards",
        "marine engineering",
        "renewables",
        "South West",
        "Winners"
    ],
    "pub_date": "2023-07-28T16:45:20+01:00",
    "content": [
        {
            "text": "The team at Cornwall-based Feritech Global have been celebrating after receiving the 2023 King’s Award for Enterprise for International Trade, announced on 21st April."
        },
        {
            "text": "Managing Director Rob Ferris said: “From our Innovation Centre in Cornwall, we design and build advanced engineering equipment for clients all over the world. In fact, 95% are sales are in. We had been through a period of exceptional growth over recent years. Being well aware of how highly regarded the King’s Awards are, we felt that this would be the right time to apply.”"
        },
        {
            "text": "Feritech Global was founded in 2015 by Rob Ferris and Gemma Ferris. It is an advanced engineering company specialising in designing and building products that are used in extreme marine environments. The company built its reputation by carrying out marine geotechnical surveys. Although only a small team, Feritech challenged themselves to develop world-leading products that would set new standards.  Their current strategic focus is on the fast-growing offshore renewables industry and the company’s product range includes innovations that are helping to streamline and accelerate offshore projects around the world."
        },
        {
            "text": "Rob Ferris said: “Obviously the application and assessment process is rigorous, but the guidance on how to apply is very clear. Feritech received a King’s Award for International Trade for Outstanding Short Term Growth in overseas sales over three years. In the period under review, we demonstrated overseas earnings growth of 1,210%.”"
        },
        {
            "text": "Feritech now trades in more than 40 countries around the world, including the USA, France, Germany and Singapore."
        },
        {
            "text": "Rob continued: “We are delighted and honoured to have been selected for such a prestigious award. This recognition will help to raise our profile and reputation in our industry, which in turn will support our continued drive for new business. As a small but growing business, we also want to ensure that we attract the best engineering talent, and the King’s Award will give a great boost to our efforts in this area."
        },
        {
            "text": "“Most of all it is fantastic recognition to our team for all their hard work and dedication over recent years and has had a great effect on team morale and motivation.”"
        },
        {
            "text": "When asked about any tips he might have for other businesses who are thinking of applying, Rob said: “My most important tip is to start well ahead of the submission deadline! We started working on our application more than six months before the September deadline. It went through a number of drafts and definitely improved with each pass. So make sure you allow enough time to do your business justice.”"
        },
        {
            "text": "Feritech attended a special reception along with other successful awardees, hosted by His Majesty The King, at Buckingham Palace in June. The Award itself – a crystal trophy and official grant of appointment document – will be presented at a special ceremony conducted by His Majesty's Lord-Lieutenant in Cornwall."
        },
        {
            "text": "Rob says: “The King’s Award for Enterprise in International Trade is recognised and respected around the world. We expect that it will be a springboard for our continued growth, as it boosts our profile and provides our company with a compelling competitive edge. Indeed, since April, we have already seen an increase in customer enquiries.”"
        },
        {
            "text": " "
        }
    ]
}