{
    "url": "https://socialcare.blog.gov.uk/2023/07/28/get-ready-for-winter/",
    "title": "Get ready for winter",
    "authors": [
        "Deborah Sturdy"
    ],
    "categories": [
        "Care and support",
        "Guidance",
        "Social care reform",
        "Workforce"
    ],
    "pub_date": "2023-07-28T14:15:21+00:00",
    "content": [
        {
            "heading": 2,
            "text": "Never too early to plan"
        },
        {
            "text": "It’s not even autumn (although you’d be forgiven for thinking otherwise, given the changeable weather) but already, thoughts turn to winter and our readiness, as care and health professionals, to deliver the support our communities need as service pressures mount."
        },
        {
            "text": "I’m pleased to say winter is very much at the forefront of minds in the Department of Health & Care too. Helen Whately, Minister for Social Care, has written to care colleagues and local authorities, reinforcing the critical “steps needed so that adult social care systems are resilient and able to provide people and their carers with the support they need this winter.”"
        },
        {
            "text": "To be doing this in the summer months is, I hope, reassuring to all of us keen to be on the front foot this year. Many of you will already be drawing up winter capacity plans. For social care nurses in particular, it will be useful to understand how NHS organisations will work with care providers to deliver the healthiest outcomes. It’s also gratifying to see the emphasis on a holistic approach, which I and others in the sector have long espoused. As the Minister point out in her letter:"
        },
        {
            "heading": 2,
            "text": "Experience counts more than ever"
        },
        {
            "text": "In every ICB in England, social care nursing advisory councils are building their boards and developing strong links with nurse leaders. As winter planning gathers pace, we will have a crucial role to play in the exchange of ideas, insight and best practice with our NHS counterparts."
        },
        {
            "text": "The councils will also use their grounded experience to support colleagues and explain how to maximise the positive impact of adult social care capacity plans (supported by the Market Sustainability and Improvement Fund) and also capacity and demand plans for intermediate care."
        },
        {
            "text": "As ever, social care professionals, like anyone working in or commissioning care and health services, will be concentrating minds on contingency: worst case scenarios, unexpected crises and the needs of local populations."
        },
        {
            "text": "Our ability to assess risk and thereafter coordinate our preparedness across services, disciplines and specialisms will be vital in our efforts to build resilience in the system. In this context, the Government’s recent announcement of £600 million over the next two years to boost care workforce capacity is to be welcomed."
        },
        {
            "text": "It should come as no surprise how important the voice of unpaid carers and the cared for will be in our preparations to withstand winter pressures. Now, more than ever, we need to involve them in all decisions about their care, help them avoid hospitalisation for as long as possible, and be ready to support them before, during and after any health emergencies."
        },
        {
            "heading": 2,
            "text": "Reform and resilience"
        },
        {
            "text": "More broadly, the social care workforce is at the heart of Government plans for a reformed social care system, supported by previously announced funding from April’s Next Steps paper. Part of this involves building winter resilience and protecting the health and wellbeing of our amazing care colleagues, whilst also giving them the skills, training and career options to thrive in our wonderful profession."
        },
        {
            "text": "In this respect, winter planning is also playing the long game; making sure we have committed, supported and talented care colleagues who can deliver for our communities, even in the most difficult times. We will continue to look after each other so we can keep caring for those who need our help the most."
        }
    ]
}