{
    "url": "https://hmlandregistry.blog.gov.uk/2023/07/28/improving-today-building-for-tomorrow/",
    "title": "Improving today, building for tomorrow",
    "authors": [
        "HM Land Registry"
    ],
    "categories": [
        "Buying and selling property"
    ],
    "pub_date": "2023-07-28T12:50:25+01:00",
    "content": [
        {
            "text": "Earlier this month we published our latest Annual Report, noting the progress we’ve made in the last year since the publication of our Strategy 2022+."
        },
        {
            "text": "HM Land Registry’s absolute focus is on ensuring the property market continues to operate smoothly. We have supported millions of property transactions over the last few years. Last financial year alone we processed almost four and a half million updates to the register, and created almost half a million new titles. Some of our post-completion services are, though, falling below customers’ expectations. We are determined to improve our processing times as fast as we can."
        },
        {
            "text": "All of our teams’ efforts are focused on reducing the longest service times for ownership changes, as well as building a stronger, sustainable land registration process for the future."
        },
        {
            "heading": 2,
            "text": "What we are doing now"
        },
        {
            "text": "We are aiming to reach a position in spring 2024 of having no applications older than 12 months."
        },
        {
            "text": "To achieve this, we are recruiting more people than ever before. We have welcomed more than 2,000 new colleagues in the last three years (including 1,500 caseworkers and nearly 100 digital specialists), with over 33% of our current workforce having joined us during that time. This offers obvious opportunities, but it also places demands on the organisation in terms of training and building experience."
        },
        {
            "text": "We have developed a new Land Registration Academy to train our staff, and delivered courses to over 1,700 colleagues since 2021-22. This has ensured that our workforce is as robust and flexible as it can be."
        },
        {
            "text": "We are working relentlessly across our all systems, structures and processes to find new efficiencies and improve the service to customers. This includes having colleagues specifically focused on tackling some of the oldest and most complex cases that customers have been waiting for."
        },
        {
            "text": "We are already seeing an improvement. Last financial year saw a 12% increase in output in compared with 2021-22. We should continue to increase our output levels from there."
        },
        {
            "text": "We understand that customers may not be feeling the impact of that quite yet in all casework types. And for this we apologise. We believe you will, though, soon start noticing this improvement in all our service speeds."
        },
        {
            "heading": 2,
            "text": "Supporting our customers"
        },
        {
            "text": "We know our customers need additional support at the moment. Our customer support teams respond to more than 5,000 enquiries a day. We are exploring a number of improvements to our contact channels and to how we can keep our professional customers and members of the public up to date as their applications progress. This includes developing a new way for lenders to check digitally the status of their mortgage registration. This is expected to reduce the time spent by conveyancers updating on applications."
        },
        {
            "text": "We have also recently launched our Specialist Support Services hub, which brings together all our pre-submission services in one place. Customers who submit complex, large-scale applications can now access expert help and support before they submit their applications."
        },
        {
            "text": "We find we need to send out more requests for information (requisitions) on complex application types – with around 65% of complex cases needing further information, compared to 20% across all application – so resolving these issues before submission can save a significant amount of time."
        },
        {
            "text": "We’re doing a lot of work in this area, including the further evolution of our digital application services, which are seeing large reductions in requisitions by automatically checking application data before submission."
        },
        {
            "text": "We have also set up a training hub to make it easier to find guidance on GOV.UK and have launched a new ‘HM Land Registry Essentials’ hub for recent recruits to conveyancing and post-completion teams, or those needing a refresher."
        },
        {
            "heading": 2,
            "text": "Our developing digital services"
        },
        {
            "text": "On top of this, we crossed the first major milestone in our digital transformation last November, when we went ‘digital by default’ for all incoming applications. Over 90% of applications are now received ‘digitally’. To support this, we also launched a new look portal homepage, the first change in design it’s had since it was launched in 2009."
        },
        {
            "text": "We recently extended the fee calculator in our Digital Registration Service in the portal, covering leases and transfer of part. In May we further improved our View Applications feature, allowing customers to filter, and see flags against, applications with outstanding requisitions."
        },
        {
            "text": "And we're enhancing the ways in which legal software can connect to our services via our Business Gateway application programming interfaces (APIs). Having recently introduced the ability to include an Estimated Completion Date for applications we will soon increase validation on incoming applications – providing additional checks on fees, dates and other details."
        },
        {
            "text": "You can see all of our recent – and upcoming – changes to our digital services on our Digital Services Roadmap page on GOV.UK."
        },
        {
            "text": "While supporting the market through the delivery of our ‘core function’ remains our main priority, we are making great progress toward the digital future of land registration. Our application processing engine is already helping to process some of our simplest applications, and we’ve made huge leaps in converting our paper and electronic register to our digital register."
        },
        {
            "text": "More detail on all of our work this last year can be found in our annual report, and an upcoming blog will explore our vision of the future in more detail."
        }
    ]
}