{
    "url": "https://space.blog.gov.uk/2023/07/28/mission-possible-aeolus-re-entry-into-the-atmosphere-and-how-the-uk-is-tracking-it/",
    "title": "Mission Possible - Aeolus' re-entry into the atmosphere and how the UK is tracking it",
    "authors": [
        "UK Space Agency"
    ],
    "categories": [
        "Satellites",
        "Space surveillance and tracking",
        "Space sustainability"
    ],
    "pub_date": "2023-07-28T12:13:49+01:00",
    "content": [
        {
            "text": "Aeolus, a UK-built satellite mission launched by the European Space Agency (ESA) as part of its Earth Explorer programme, has reached the end of its active life in orbit and is now facing its final journey back to Earth. Constructed before any regulations were established for the 'end-of-life' disposal of spacecraft, this pioneering mission was originally designed to naturally re-enter the Earth's atmosphere. "
        },
        {
            "text": "As almost of its fuel reserves have been used up and its operational time has come to an end, ESA and its partners have embarked on a first of its kind endeavour to carefully control Aeolus' re-entry process. This complex and unprecedented series of manoeuvres have been meticulously planned and analysed over several months to ensure the spacecraft's controlled descent as much as possible. "
        },
        {
            "text": "At ESA’s Space Operations Centre in Germany, mission control will use the remaining fuel to steer Aeolus during its return to Earth, separating the re-entry into four main manoeuvre phases. You can read more about the re-entry mission here. "
        },
        {
            "heading": 2,
            "text": "What was Aeolus used for? "
        },
        {
            "text": "The Aeolus spacecraft, which was built by Airbus Defence and Space in Stevenage, played a pivotal role in advancing our understanding of Earth's global wind patterns which is crucial for improving weather forecasting, climate research, and atmospheric dynamics studies. "
        },
        {
            "text": "Launched in August 2018, Aeolus was equipped with a state-of-the-art Doppler wind lidar, a sophisticated instrument capable of measuring wind profiles from space with unprecedented accuracy and precision.   "
        },
        {
            "heading": 2,
            "text": "UK Space Agency's re-entry service and STFC tracking "
        },
        {
            "text": "The UK Space Agency runs the government space debris re-entry service. Our orbital analysts use UK developed state-of-the art modelling to monitor re-entering objects and produce re-entry warnings if it is a UK-licensed object re-entering, or if the UK or our overseas territories/crown dependencies might be affected. "
        },
        {
            "text": "These warnings are distributed to civil protection authorities in the UK as well as overseas government departments. Our re-entry service, alongside our in-orbit collision and fragmentation service (known as our Space Surveillance and Tracking service) runs 365 days a year. Our orbital analysts work in close partnership with our military counterparts in the UK Space Operations Centre (Ministry of Defence). "
        },
        {
            "text": "For the Aeolus event, the UK Space Agency orbital analysts investigated the Aeolus re-entry to determine any risk to the UK. Two days prior to the event the following information was produced for government airspace colleagues and the UK Civil Aviation Authority.  "
        },
        {
            "text": "In the first image, the red line depicts potential re-entry locations of Aeolus. The Shanwick airspace is depicted in green, showing a 2.8% chance of the object re-entering over this area, and very little risk to the UK mainland or overseas territories. The second image shows how the likelihood of re-entry changes over time, the line in green showing the approximate re-entry time over Shanwick airspace at approximately 19:15 UTC on 28 July. "
        },
        {
            "text": "Chilbolton Observatory, part of the Science and Technology Facilities Council, which provides data to the UK Space Agency’s Space Surveillance and Tracking team, has been tracking the re-entering Aeolus Mission using their Chilbolton Advanced Satellite Tracking Radar (CASTR). The UK Space Agency has provided these observations to ESA as well as the international Inter-Agency Debris Committee."
        },
        {
            "text": " It is unusual for sensors of this size to be able to track events like this due to the often low elevations, the speed the debris crosses the sky needed and changes to predicted paths caused by atmospheric effects upon the object as it descends towards the Earth’s atmosphere, so the data collected by CASTR provides valuable information to analyse the projected final re-entry. "
        },
        {
            "text": "Unlike Aeolus, which is a semi-controlled re-entry, uncontrolled re-entries occur on a regular basis and while most components burn up in the atmosphere, dense materials and larger objects will sometimes survive. The Space Surveillance and Tracking service that the UK provides is an important way to assess and warn of the risk posed by uncontrolled re-entries. "
        },
        {
            "heading": 2,
            "text": "The future"
        },
        {
            "text": "As Aeolus now embarks on its final journey back to Earth, its legacy lives on, not only in the vast repository of data it has provided, but also through showcasing the world’s first attempt at an assisted re-entry of an end-of-life satellite. "
        },
        {
            "text": "This sets a new precedent for missions that didn’t fall under such regulations when they were designed, but could be made to retroactively adhere to them. "
        },
        {
            "text": "Angus Stewart, Head of Space Surveillance and Tracking at the UK Space Agency, said: "
        },
        {
            "text": "Ian McCrea, the Head of Space Physics and Operations Division at STFC RAL Space, said:"
        },
        {
            "text": "The experience gained from this mission will undoubtedly shape future endeavours in guiding the development of sustainable practices for end-of-life spacecraft disposal. "
        }
    ]
}