{
    "url": "https://naturalengland.blog.gov.uk/2023/07/28/preparing-the-market-for-statutory-biodiversity-credits/",
    "title": "Preparing the market for statutory biodiversity credits",
    "authors": [
        "Mike Burke"
    ],
    "categories": [
        "Biodiversity",
        "Development",
        "Environment Act",
        "Landscapes",
        "Natural England",
        "Nature Recovery Network",
        "Wildlife"
    ],
    "pub_date": "2023-07-28T15:00:48+01:00",
    "content": [
        {
            "text": "Biodiversity net gain (BNG) is a government strategy to develop land and contribute to the recovery of nature. As set out in part six of the Environment Act 2021, it is a way of making sure the habitat for wildlife is in a better state than it was before development."
        },
        {
            "text": "In a significant step towards preparing the market for mandatory BNG in November, yesterday Defra published a number of BNG updates, including the indicative price developers will have to pay for statutory biodiversity credits."
        },
        {
            "text": "The purpose of statutory biodiversity credits"
        },
        {
            "text": "The statutory biodiversity credit scheme aims to ensure that the pace of development in England is not impacted by the introduction of mandatory BNG. It is a last resort alternative to on-site and off-site habitat. This means that a developer must first look to deliver the mandatory biodiversity net gain of ten per cent either on-site or off-site. If this is not possible – and the developer can provide evidence to the Local Planning Authority that they have been unable to achieve BNG through on-site and off-site options – then they may buy a statutory biodiversity credit."
        },
        {
            "text": "We’re aware that in many places ‘biodiversity units’ and ‘biodiversity credits’ are often used interchangeably, but to clarify, a statutory biodiversity credit refers to a specific credit which can only be bought from the Secretary of State."
        },
        {
            "text": "Other biodiversity credit markets allow everyone to buy credits that contribute to nature’s recovery. These credits allow for individuals and companies unrelated to development to invest in environmental projects."
        },
        {
            "text": "How does the statutory biodiversity credit scheme work?"
        },
        {
            "text": "As soon as BNG is mandatory, those who need to buy a statutory biodiversity credit will be able to do so. Natural England will sell statutory biodiversity credits on behalf of the Secretary of State at a price set by Defra. This is the indicative price a developer would pay, which does not equate to the amount a landowner would receive."
        },
        {
            "text": "The statutory biodiversity credit will be in the form of a Proof of Purchase."
        },
        {
            "text": "The service to buy a credit is currently being built and further guidance will be published before BNG becomes mandatory across the country."
        },
        {
            "text": "As set out in the Environment Act 2021, the Secretary of State will report annually on the outcomes of the statutory biodiversity credits scheme."
        },
        {
            "text": "Investing in habitat delivery"
        },
        {
            "text": "While the Secretary of State is responsible for statutory biodiversity credits, Natural England is working closely with and advising Defra on the design and development of the scheme."
        },
        {
            "text": "To support the development of this scheme and BNG more broadly, we’ve been working closely with a number of pilot projects since 2020 (including Wendling Beck). This collaboration has provided invaluable learning."
        },
        {
            "text": "Glenn Anderson, Wendling Beck Environment Project, welcomes the aspiration to invest the monies from statutory biodiversity credits, noting “landscape level investment offers a real opportunity to deliver exciting outcomes for wider nature recovery, guided by Lawton principles. ‘More, bigger, better, joined’, this is what we’re trying to achieve, and it feels like it is within our grasp.”"
        },
        {
            "text": "\"The pilot projects span a huge range of locations and habitats,” says Ben Taylor, Iford Biodiversity Project. “From Sussex, where I’m based, to Yorkshire and the Peak District, it has been incredible to work together knowing we offer so many more opportunities for biodiversity gain as a group. We’ve formed an umbrella organisation to coordinate learnings and share these more widely.”"
        },
        {
            "text": "We’re excited to see what BNG can deliver for people and nature. If you’d like to learn more about mandatory biodiversity net gain, please see the most recent information here and keep an eye out for future blogs, including Defra’s new Land Use blog, which will include case studies to help BNG stakeholders prepare."
        },
        {
            "text": " "
        },
        {
            "heading": 5,
            "text": "Written by Mike Burke,"
        },
        {
            "heading": 5,
            "text": "Programme Director – Sustainable Development"
        }
    ]
}