{
    "url": "https://lifeathmrc.blog.gov.uk/2023/07/28/south-asian-heritage-month-chintans-story/",
    "title": "South Asian Heritage Month: Chintan's story",
    "authors": [
        "Chintan"
    ],
    "categories": [
        "Diversity and inclusion",
        "General"
    ],
    "pub_date": "2023-07-28T12:24:42+00:00",
    "content": [
        {
            "text": "Chintan has been working at HMRC for just over 12 months. He explains how he came to start working at HMRC and about his role in the pensions process team. "
        },
        {
            "heading": 2,
            "text": "My story"
        },
        {
            "text": "I was born in Pokhara, Nepal, which is a lovely city surrounded by 7 lakes and the beautiful Himalayan range, and grew up and studied in Nepal and India.  While studying, I volunteered at an orphanage in Pokhara and also worked as a tourist guide. But it was my relocation to the UK in 2006 which was a massive culture change for me. I continued my studies in 2012 and completed my Master’s degree in 2016.  "
        },
        {
            "text": "After graduating, I worked in a variety of industries, including hospitality, retail, property, and financial services. Due to Covid, I lost my previous job and I was looking for a stable position with a long-term career. I always wanted to work for a government organisation, so when I saw a job advert for HMRC, I knew it was the perfect opportunity for me. I was excited to join an organisation that is committed to public service and provides a rewarding career, and I was impressed by the diversity of the workforce and the opportunities for career development. "
        },
        {
            "text": "I have been working at HMRC for just over a year now, and within that time I have gained a promotion. I work in the Pension Process team within Customer Strategy & Tax Design. My day-to-day role involves providing support to teams with development, guidance, IT design and tools to implement operational process. If you are looking for a rewarding career in public service, I encourage you to apply for a job at HMRC.  "
        },
        {
            "text": "Here are some of the things I love about working at HMRC:  "
        },
        {
            "text": "I work with people from all walks of life, which makes for a stimulating and enriching work environment "
        },
        {
            "text": "HMRC is a great place to learn and grow, and there are many opportunities to develop your skills and advance your career "
        },
        {
            "text": "HMRC is committed to providing a healthy work-life balance, and I can balance my work and personal commitments "
        },
        {
            "text": "I can work flexible hours, which gives me the flexibility to work around my personal commitments"
        },
        {
            "heading": 2,
            "text": " Tips for applying"
        },
        {
            "text": "If you are interested in working at HMRC, here are some tips:  "
        },
        {
            "text": "Before you apply for a job, make sure you understand what HMRC does and what kind of work they do."
        },
        {
            "text": "When you apply for a job, make sure you tailor your application to the specific role you are applying for. "
        },
        {
            "text": "HMRC is looking for people who are genuine and authentic, so be yourself in your application and interview."
        },
        {
            "heading": 2,
            "text": "Find out more"
        },
        {
            "text": "I hope this blog post has inspired you to consider a career at HMRC. It is a great place to work and is full of opportunities.  "
        },
        {
            "text": "Visit the HMRC Careers Site to find out more about working for HMRC."
        }
    ]
}