{
    "url": "https://governmentscienceandengineering.blog.gov.uk/2022/01/14/adaptation-sub-committee-of-the-committee-on-climate-change-defra/",
    "title": "Adaptation Sub-Committee of the Committee on Climate Change- DEFRA",
    "authors": [
        "Jamal Arabi"
    ],
    "categories": [
        "GSE Opportunities"
    ],
    "pub_date": "2022-01-14T13:16:40+00:00",
    "content": [
        {
            "text": "The Department for Environment, Food & Rural Affairs (DEFRA) are seeking three experienced, skilled and motivated people to serve on the Adaptation Committee (AC). The AC is a committee of the Climate Change Committee (CCC). It advises the Government on UK climate risks and opportunities, and reports to Parliament and each of the devolved legislatures with assessments of the UK Government’s progress in implementing its National Adaptation Programme (NAP). It also provides advice under devolved legislation, including under the Climate Change (Scotland) Act 2009. The AC is currently made up of six experts from a range of sectors and disciplines. The desired candidates would have expertise in one or more of the following areas:"
        },
        {
            "text": " "
        },
        {
            "heading": 2,
            "text": "Person Specification"
        },
        {
            "text": "Candidates should be able to demonstrate all the following essential criteria:"
        },
        {
            "text": " "
        },
        {
            "text": "For the three specific roles candidates should be able to demonstrate one or more of the following:"
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": "Your CV and statement should be returned to the following address by the closing date: 12.00 (midday) on 31 January 2022."
        },
        {
            "text": "Email to PublicAppts@defra.gov.uk quoting reference APPT01-22."
        },
        {
            "text": "Further information about the role and how to apply can be found in the job advert here."
        }
    ]
}