{
    "url": "https://deframedia.blog.gov.uk/2022/01/14/environment-secretary-george-eustice-joins-dame-joanna-lumley-ahead-of-trials-to-reduce-underwater-noise/",
    "title": "Environment Secretary George Eustice joins Dame Joanna Lumley ahead of trials to reduce underwater noise",
    "authors": [
        "Defra Press Office"
    ],
    "categories": [
        "Uncategorized"
    ],
    "pub_date": "2022-01-14T15:06:34+00:00",
    "content": [
        {
            "text": "Yesterday (13 January), Environment Secretary George Eustice joined Dame Joanna Lumley at Alford’s Technologies to observe a demonstration of high order detonation (explosion) and low order deflagration methods of removing unexploded ordnance (munitions). This received coverage in the Express, Sun, Daily Mail and on ITV News."
        },
        {
            "text": "Joanna Lumley is a supporter of the StopSeaBlasts campaign which advocates the use of alternative methods to remove unexploded ordnance in order to reduce the impact that any removal can have on marine life."
        },
        {
            "text": "It is estimated that there are between 300,000 and 500,000 pieces of unexploded ordnance left over from World War I and II in UK waters. Many of these unexploded bombs lie in areas which are heavily used by marine industries, including offshore wind, and the bombs must be removed to allow safe working conditions."
        },
        {
            "text": "On the 16 November 2021, the UK Government released a joint position statement which demonstrates, our preference for quieter alternative technologies in the removal of UXO from the marine environment."
        },
        {
            "text": "Ahead of the visit, the UK government confirmed that at-sea trials of low-noise alternatives are scheduled to begin next week. The trials will seek to characterise, for the first time, the resulting noise and chemical contaminant releases in the marine environment; and to determine whether the technology is safe and effective on historic ordnance that have been left in the marine environment for many years."
        },
        {
            "text": "The Government is committed to protecting the marine environment and ensuring that we are able to deliver healthy, resilient and diverse marine ecosystems."
        },
        {
            "text": "Follow Defra on Twitter, and sign up for email alerts here."
        }
    ]
}