{
    "url": "https://governmentscienceandengineering.blog.gov.uk/2022/01/14/g7-project-lead-department-for-environment-food-and-rural-affairs/",
    "title": "G7 Project Lead- Department for Environment, Food and Rural Affairs",
    "authors": [
        "Jamal Arabi"
    ],
    "categories": [
        "GSE Opportunities"
    ],
    "pub_date": "2022-01-14T13:35:51+00:00",
    "content": [
        {
            "text": "We are looking for an experienced Project Lead, with a track record of managing a team to deliver a portfolio of complex capital projects within the Science Facilities Critical Works Programme."
        },
        {
            "heading": 3,
            "text": "Summary"
        },
        {
            "text": "The Critical Works Programme is a major investment to maintain and extend the Animal and Plant Health Agency (APHA) science laboratories at Weybridge. This 10 year, £1bn+ Programme will oversee the re-development of this large site and is critical to the success of APHA’s science programme. The new build will take place on a live operational site which gives the added complication of a complex construction process alongside the need to keep the science capability fully operational. Critical Works will deliver a portfolio of capital investment to maintain scientific capability and extend the life of research facilities to allow APHA to undertake a statutory role for the Government for disease identification and management."
        },
        {
            "text": "This is an exciting opportunity to work in a growing capital projects team. You will be involved with the delivery of multiple projects, covering Weybridge and the various regional laboratories, to ensure each is successfully delivered, on budget and on time. As Project Lead you will hold overall accountability and ensure delivery of the agreed business benefits. These projects will vary in cost from £100k to several million and you will be responsible for a portfolio of activity, not just a single implementation."
        },
        {
            "heading": 3,
            "text": "Job Description"
        },
        {
            "text": "The Project Lead manages the strategic definition of a project through to concept design. They then work closely with the Project Manager continuing to provide leadership and strategic direction for the project through delivery and handover. You will be the link between the project, the users and governance groups, act as a mediator, make decisions and chair the project board. You will represent Defra and play a vital leadership role; in championing the project throughout the organisation and providing business expertise and guidance to the Project Manager. You may also lead on programme-wide issues alongside project delivery and take forward improvement priorities relating to areas such as procurement, processes or stakeholder management."
        },
        {
            "text": "If you share our vision, are excited by the prospect of the challenges and opportunities it will bring and want to make your mark in building the UK’s scientific capability, we want to hear from you. Join us, and together we will create a great place for living, and a green and healthy future for all"
        },
        {
            "text": "Further information about the job role can be found here."
        },
        {
            "text": "Closing date: 11:55 pm on Friday 4th February 2022"
        }
    ]
}