{
    "url": "https://educationhub.blog.gov.uk/2022/01/14/how-were-making-language-lessons-more-accessible-and-relevant/",
    "title": "How we’re making language lessons more accessible and relevant",
    "authors": [
        "mediaofficer"
    ],
    "categories": [
        "Curriculum",
        "GCSE",
        "Languages",
        "Schools",
        "Secondary schools"
    ],
    "pub_date": "2022-01-14T10:24:09+00:00",
    "content": [
        {
            "text": "Modern foreign languages like French, German and Spanish are really useful to know – not just for visiting counties that speak those languages, but employers increasingly see language skills as highly desirable."
        },
        {
            "text": "But our statistics show that not enough young people are taking languages at GCSE. This is down to the perception that they are too hard and because young people find it hard to see significant progress and relevance in their work."
        },
        {
            "text": "That’s why we announced measures to increase uptake by making French, German and Spanish GCSEs more engaging and relevant."
        },
        {
            "text": "Here we look at the changes we are making to French, German and Spanish GCSEs."
        },
        {
            "heading": 3,
            "text": "What have you announced? "
        },
        {
            "text": "We have confirmed changes to French, German and Spanish GCSEs, supported by a research review by Ofsted, to help students build confidence and excel in learning languages."
        },
        {
            "text": "Students will study reformed language GCSEs from September 2024, following government changes to make the subject more accessible for students and boost take up."
        },
        {
            "text": "The first exams under the new reforms will be held in summer 2026."
        },
        {
            "heading": 3,
            "text": "What’s changed?"
        },
        {
            "text": "In the updated GCSEs, students will be assessed on the most common vocabulary used in conversations and in written texts, as well as grammar and pronunciation. It means what they learn will be easier to apply to real life situations."
        },
        {
            "text": "Research shows that a focus on these ‘building blocks’ enables students to see progress in their ability to understand and use the language and grow in confidence and motivation."
        },
        {
            "heading": 3,
            "text": "Why have you made these changes?"
        },
        {
            "text": "The suggested reforms aim to encourage language uptake in schools."
        },
        {
            "text": "Studying languages opens up a world of new, exciting opportunities for people and is important for a modern global economy."
        },
        {
            "text": "That’s why we want more young people to take up modern language GCSEs, and these evidence-based changes aim to make them more well-rounded and accessible, helping more young people to enjoy learning languages and flourish."
        },
        {
            "heading": 3,
            "text": "What type of thing can pupils expect to learn?"
        },
        {
            "text": "By mastering the most commonly occurring vocabulary in French, German or Spanish, GCSE pupils will be able to communicate independently, in speech and writing, about a range of topics that interest them."
        },
        {
            "text": "Pupils will be expected to understand spoken extracts which contain the pre-defined vocabulary and grammar and undertake dictation of such extracts. They will become skilled in writing accurately in the target language and will be asked to translate texts into English and vice versa. Pupils will also refine their language deduction skills by inferring meaning from words outside of the vocabulary list and they will learn to speak confidently and clearly in the target language."
        },
        {
            "text": "As they progress through the course, they will become familiar with aspects of the contexts and cultures of the countries and communities in which the language is spoken."
        },
        {
            "text": "The revised GCSE will also provide a solid foundation from which pupils can transition to further study."
        }
    ]
}