{
    "url": "https://governmentscienceandengineering.blog.gov.uk/2022/01/14/intersectional-feminism-in-the-civil-service/",
    "title": "Intersectional feminism in the Civil Service",
    "authors": [
        "Jamal Arabi"
    ],
    "categories": [
        "Diversity & Inclusion",
        "Guest Blog"
    ],
    "pub_date": "2022-01-14T11:10:47+00:00",
    "content": [
        {
            "text": "Considering intersectionality in gender inclusion is vital, though often overlooked. It requires us to recognise the multiple aspects of a person which may advantage or disadvantage them- so taking into account class, gender, race, disability and so forth, recognising that people are not one-dimensional. Many of us, including myself, have faced sexism and racism inside and outside the workplace. But we may be more privileged in other ways, such as belonging to a higher social class or being able bodied. Intersectional feminism, therefore, requires you to listen to and advocate for all women - whose struggles are diverse and wide-ranging."
        },
        {
            "text": "Gender equity in the Civil Service is further ahead than race equity. In 2020, according to gov.uk’s Diversity and Inclusion dashboard, the Civil Service was made up of 53.8% women overall, and 46.7% of Senior Civil Servants (SCS) were women. In comparison, while 13.2% of the Civil Service were of an ethnic minority (mapping closely to 12.9% of the UK’s working population), only 6.9% of SCS are an ethnic minority."
        },
        {
            "text": "Myself and my three co-founders set up the Ethnic Minority Women’s Forum (EMWF) in August 2020 to address intersectional gender inclusion in the Civil Service. EMWF aims to create a safe space and development opportunities for ethnic minority women (EMW), while educating our allies to improve the outcomes and experiences of EMW in the Civil Service. We firmly believe that the Civil Service has a responsibility to be as diverse as it possibly can, to reflect the make-up of the general public we serve and develop better, more considered policy."
        },
        {
            "text": "EMWF has now grown to over 1300 members (showing just how needed this forum is); offered over 200 EMW mentoring opportunities with SCS; held several sold-out events including a full day International Women’s Day conference; and launched ‘How to be Active Ally workshops’, among many other achievements."
        },
        {
            "text": "If you would like to join EMWF as a member (you identify as an ethnic minority woman), or as an ally (you do not identify as an ethnic minority woman), please email emwomensforum@gmail.com with your grade and whether you would like to sign up as a member or ally."
        },
        {
            "text": "Signing up will mean you have access to all the events and programmes we offer, such as our upcoming EMWF x Government Science & Engineering Profession Mythbuster, which aims to encourage more EMW into the profession. Keep your eyes peeled for more details (to be announced soon)."
        },
        {
            "text": "Rohini is currently a senior policy advisor working on multilateral green trade for the Department for International Trade. She was previously a Private Secretary for the Minister for Communities where she met her EMWF co-founders, Aqsa, Nat and Ella. "
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        }
    ]
}