{
    "url": "https://educationhub.blog.gov.uk/2022/01/14/isolation-rules-have-changed-what-does-this-mean-for-families-and-schools/",
    "title": "Isolation rules have changed – what does this mean for families and schools?",
    "authors": [
        "Media Officer"
    ],
    "categories": [
        "Coronavirus",
        "Schools"
    ],
    "pub_date": "2022-01-14T14:45:01+00:00",
    "content": [
        {
            "text": "This article contains out of date information about Covid-19 in schools. We no longer recommend routine testing. Please visit this link for up-to-date information. "
        },
        {
            "text": "On Thursday 13 January the Health Secretary announced changes to isolation rules for people who have tested positive for COVID-19.   In order that people who have had and recovered from the virus can get back to their normal lives as soon as possible, isolation time has been cut to 5 full days (from the date of their first positive test) for anyone who has recorded two consecutive daily negative lateral flow tests. The change to the rules came into effect on Monday 17 January."
        },
        {
            "text": "This will help to reduce the disruption the virus causes in schools for both pupils and staff."
        },
        {
            "text": "But what will this mean in practice for children, families, schools and other education settings? Here we answer your questions."
        },
        {
            "heading": 3,
            "text": "My child has tested positive for COVID-19 – how long do they have to stay away from school/college for?"
        },
        {
            "text": "All people – including pupils parents and teachers - have to isolate for a minimum of five full days after the day of a positive test before then going back to school if they have tested negative twice."
        },
        {
            "text": "The first full day of isolation is considered to be the day following the positive test. Following the fifth full day of isolation – on the sixth day - it will be possible for people who have received two negative LFD tests on consecutive days to go back to school."
        },
        {
            "text": "People who have tested positive can now take two LFD tests on day 5 and day 6, and if both are negative and they do not have a temperature, they can end their self-isolation on day 6 and return to their education setting immediately."
        },
        {
            "text": "If either test is positive, they should continue to self-isolate until they get negative results from two LFD tests on consecutive days or until they have completed 10 full days of self-isolation, whichever is earliest"
        },
        {
            "text": "In practice it means that if a child or teacher tests positive on a Saturday, that would be considered day 0. They could then take tests on the morning of Thursday (day 5) and Friday (day 6). If they tested negative on both days and did not have a temperature they would be then able to return to school on the Friday."
        },
        {
            "text": "The new rules apply to people who are already isolating – so if someone was already isolating before Thursday, they could still follow the example above and as long as they have taken LFD tests on day 5 and 6 and they’re both negative and they have no temperature they can end their isolation."
        },
        {
            "heading": 3,
            "text": "What about if someone else in the house has tested positive? Can my child go to school/college? "
        },
        {
            "text": "Yes – and they should. They should continue going to school but test daily. If they test positive they should isolate."
        },
        {
            "heading": 3,
            "text": "What are the rules for teachers and school staff? "
        },
        {
            "text": "They’re exactly the same. If a teacher or member of school staff tests positive they should isolate for at least 5 full days. If they have 2 consecutive daily negative lateral flow tests at that point and no temperature they can and should return to work on day 6. If someone in a teacher’s household has tested positive the teacher should test daily and as long as they are negative they should continue to go to work. If they test positive they should isolate."
        },
        {
            "heading": 3,
            "text": "What are the rules for early years settings like nurseries and childminders? "
        },
        {
            "text": "They’re the same. If a child or a member of staff tests positive they should isolate for a minimum of 5 full days. If by that point they have recorded two consecutive daily negative lateral flow tests and no temperature they can return to their setting on day 6."
        },
        {
            "text": " "
        }
    ]
}