{
    "url": "https://governmentscienceandengineering.blog.gov.uk/2022/01/14/met-office-webinar-uk-climate-projections-how-can-they-be-used-to-inform-adaptation/",
    "title": "Met Office webinar: UK Climate Projections - how can they be used to inform adaptation?",
    "authors": [
        "Jamal Arabi"
    ],
    "categories": [
        "Capability & Skills",
        "GSE Opportunities"
    ],
    "pub_date": "2022-01-14T13:19:14+00:00",
    "content": [
        {
            "text": "Registration link: Register for UKCP webinar"
        },
        {
            "text": "Date: 26th January, 13:00-15:30"
        },
        {
            "text": "Want to learn about what climate change means foryou and your organisation? Want to get to grips with future climate change in the UK? Are you looking to develop your understanding of how to use climate projections to inform adaptation?"
        },
        {
            "text": "The Met Office invite you to join our webinar on how to use the UK Climate Projections to inform adaptation. The webinar is interactive and will be delivered by Met Office expert scientists and guest speakers from"
        },
        {
            "text": "Government. Content will include an introduction to the UKCP headline messages, an introduction to the different outputs from UKCP18, and use-cases of how UKCP18 can be applied for adaptation, including for awareness raising and risk assessments."
        },
        {
            "text": "By the end of the session, you will be able to summarise what information is available from UK Climate Projections, plan your fist steps in a climate change risk assessment, find additional climate information, and obtain further advice and guidance."
        },
        {
            "text": "Please note, this webinar is only available to people from Government and will not be recorded."
        },
        {
            "text": "We hope you can join us, and look forward to seeing you there."
        },
        {
            "text": "To ask any questions, learn more about the webinar, or to be involved, please email: ukcpproject@metoffice.gov.uk"
        },
        {
            "text": " "
        },
        {
            "text": "To register for the webinar, please follow this link: https://teams.microsoft.com/registration/YYHxF9cgRkeH_VD-PjtmGQ,myNQ4vnsnEGCm8I8xSEX7A,KvcY29dLl0ysyZ5TV398hg,eLuTUNtEx0yvbwznWpNEBQ,gjiOgFIhlkagBL3Ie_DFJA,qwZ0VlSaWEGhGBMiHzRnlg?mode=read&tenantId=17f18161-20d7-4746-87fd-50fe3e3b6619"
        },
        {
            "text": "-"
        },
        {
            "text": "Privacy Notice"
        },
        {
            "text": "To find out about how the Met Office uses any personal information we collect about you, please see our Privacy Policy."
        },
        {
            "text": " "
        }
    ]
}