{
    "url": "https://defrafarming.blog.gov.uk/2022/01/14/more-time-for-farmers-to-apply-for-free-business-advice/",
    "title": "More time for farmers to apply for free business advice",
    "authors": [
        "Andrew Powley"
    ],
    "categories": [
        "Transition support"
    ],
    "pub_date": "2022-01-14T11:40:43+00:00",
    "content": [
        {
            "text": "To support farmers through the agricultural transition, we’re offering free business advice to those who currently receive direct payments. "
        },
        {
            "text": "Through the Future Farming Resilience Fund, we’re paying independent advisers to explain how the changes happening to farming will affect farmers and help them to prepare.  "
        },
        {
            "text": "In total, 19 providers across England are offering the advice. "
        },
        {
            "text": "As I mentioned in a previous post, the fund is structured in 3 phases. We are currently in the second phase. It was due to end in March 2022, but we’re extending this phase until September 2022. "
        },
        {
            "text": "We appreciate that 2021’s late harvest made it difficult for farmers to apply in time and take up was slower than expected. "
        },
        {
            "text": "So, we’ve offered all our providers an extension of up to 6 months, which is when the next phase of support is expected to begin. "
        },
        {
            "text": "This will give providers more time to deliver the support. The new end dates for each of the projects are set out in the table below. "
        },
        {
            "text": "We hope this extension will encourage more people to get in touch with an adviser and work out the best plan for their farms.  The final phase of support will operate over a longer timescale; launching later in 2022 and running until March 2025.  "
        },
        {
            "heading": 2,
            "text": "Get free advice  "
        },
        {
            "text": "If you’d like to access free business advice, all you need to do is take a look at the list of advisers below and contact them directly.  "
        },
        {
            "text": "The advisers are offering support in different ways: it could be delivered in the form of workshops supported by experts or through one-to-one conversations.  "
        },
        {
            "heading": 3,
            "text": "Video: Farmers share their experience "
        }
    ]
}