{
    "url": "https://governmentscienceandengineering.blog.gov.uk/2022/01/14/science-communication-and-engagement-specialist-environment-agency/",
    "title": "Science Communication and Engagement Specialist- Environment Agency",
    "authors": [
        "Jamal Arabi"
    ],
    "categories": [
        "GSE Opportunities"
    ],
    "pub_date": "2022-01-14T13:47:56+00:00",
    "content": [
        {
            "text": "The Environment Agency are looking for a skilled science communication and engagement specialist to join their Research Hub, a friendly, fun and busy team at the heart of the Chief Scientist’s Group, to help increase the reach and impact of the work of the Chief Scientist’s Group. Led by Doug Wilson, Chief Scientist, the group leads on science, research, analysis and evaluation for the Environment Agency. Our teams identify the evidence needed to support the business of the Environment Agency. We identify gaps and emerging trends, source the evidence, and translate and communicate it in a compelling way to provide confidence in decisions the organisation takes. Effective science communication is crucial in our work."
        },
        {
            "text": "We require a science communications and engagement specialist to generate high quality, engaging content to translate our science and share it with internal and external audiences across a range of media, including social media. You will maintain a forward look of communication products, linking with others to maximise their impact and work closely with our research scientists to understand, translate and communicate their work in a way that brings it to life and effectively reaches and engages non-specialists. You will develop strategic relationships with communications and engagement specialists across the Environment Agency and beyond, bringing in learning and experience. You will innovate in the way we communicate our science to engage others, evaluate the effectiveness of our communication activities and develop materials to promote the identity of the Chief Scientist’s Group."
        },
        {
            "text": "Do you enjoy writing, editing and communicating scientific work in interesting and engaging ways? Do you want to engage others, increase the impact of the great science we do, and help place evidence at the heart of the Environment Agency? If so, this could be the job for you."
        },
        {
            "text": "Further information about this role can be found in the job advert here."
        },
        {
            "text": "Vacancy reference: 20786; closing date: 31/01/2022, 23:55."
        },
        {
            "text": " "
        }
    ]
}