{
    "url": "https://publicguardian.blog.gov.uk/2018/02/13/the-latest-on-our-deputy-online-reporting-service/",
    "title": "The latest on our deputy online reporting service",
    "authors": [
        "Elizabeth Feenan"
    ],
    "categories": [
        "Deputies",
        "deputy",
        "Digital",
        "Mental Capacity Act",
        "Public Authorities",
        "Supervision"
    ],
    "pub_date": "2018-02-13T09:30:22+00:00",
    "content": [
        {
            "text": "It’s been 18 months since we launched our online reporting service for lay deputies. Since then 6,000 reports have been submitted online, we’ve launched the service for public authorities and made changes to the design of the lay reporting service."
        },
        {
            "text": "Because we use customer feedback to make changes to our services we’re constantly improving, making it even simpler for deputies to submit their annual reports online."
        },
        {
            "text": "Since September 2017 the changes we’ve made to the lay deputy service include:"
        },
        {
            "text": "Following feedback from our deputies, in the coming months we intend to improve the way the ‘money in’ and ‘money out’ sections work. We’ll also introduce a facility to amend and resubmit previous years' annual reports, and improve the system to help deputies manage their expenses better if they use more than one bank account."
        },
        {
            "text": "By summer 2018, we’re hoping to make the reporting tool available to professionals in the legal sector. This will allow them to see the information of all their clients in one place, and help them to prioritise the reports based on submission dates."
        },
        {
            "text": "To register for an account to submit a lay deputy report online, go to complete-deputy-report.service.gov.uk. You’ll need your case number (the OPG reference number on letters you receive) and your email address."
        },
        {
            "text": "If you’re a public authority interested in using the service to manage your clients’ reports, please contact the public authority deputy team on opg.publicauthorityteam@publicguardian.gsi.gov.uk."
        }
    ]
}