{
    "url": "https://dragonsden.blog.gov.uk/2026/02/19/dragons-den-ip-blog-series-23-episode-4/",
    "title": "Dragons Den IP Blog - Series 23 Episode 4",
    "authors": [
        "Emma Richards"
    ],
    "categories": [
        "Business",
        "Designs",
        "Patents",
        "Trade marks"
    ],
    "pub_date": "2026-02-19T21:00:00+00:00",
    "content": [
        {
            "text": "What’s the connection between sea moss and aids for gripping better? Both were featured in pitches in Dragons’ Den this week in front of Dragons Peter Jones, Deborah Meaden, Steven Bartlett, Touker Suleyman and Tinie Tempah. Here to pick out the IP in the pitches is guest author, Emma, who tells us more. "
        },
        {
            "heading": 3,
            "text": "Active hands"
        },
        {
            "text": "Entrepreneurs from The Active Hands company have created gripping aids to support hand function. Their product certainly gripped my attention because they have created many functional products which could potentially be protectable through patents – patents protect the function of a product.   "
        },
        {
            "text": "The products that the Active Hands team are developing are clearly designed specifically to enhance the mobility of the users. What wasn’t featured in the pitch, however,  was whether the team have created a new product. It was alluded to, but there was no mention of any patent protection in Den discussions.    "
        },
        {
            "text": "If you are creating any products in your business and believe that they could be protected by a patent there are a number of things that need to be considered.   "
        },
        {
            "text": "For a product to be eligible for patent protection it must have a technical function that you can describe using diagrams and drawings, along with a detailed document, including the claims – this is the most important part of a patent application.  It is also important to note that for an item to be eligible for a patent it has to be completely new worldwide and never seen before. This is why we recommend that creators should be careful sharing innovation prior to applying for protection. "
        },
        {
            "text": "Learn more about applying for a patent in our guidance."
        },
        {
            "text": "If you do need to share the details of your patent for funding or collaboration you may wish to consider using a Non-Disclosure Agreement (NDA) as prior disclosure could invalidate your application.  "
        },
        {
            "heading": 3,
            "text": "Multi-Dragon deals and sea moss"
        },
        {
            "text": "Back to the Den and the final pitch of the evening - Health and Holistics, a natural product range containing sea moss - captured the imagination of the Dragons. "
        },
        {
            "text": "While entrepreneur Rome Haghighat secured a multi-Dragon deal, there was no mention of IP protection in this business , which may leave you wondering whether he owned any IP at all – but it’s a common misconception that service businesses do not own any IP. In fact, all businesses own IP, it is just a case of figuring out what IP right is most applicable to you.   "
        },
        {
            "text": "If you are at the start of your business journey and starting a service business similar to Health and Holistics you may want to think about your IP strategy.  I would suggest creating a brand that consumers relate to. You will be unable to protect the concept of your business so gaining the trust of consumers through a strong brand will be the key to your success and can be protected by a trade mark. "
        },
        {
            "text": "You may also want to consider the creative elements of your business, for example, do you have stylish packaging?  Are you a designer creating a suite of eye-catching products?  If the answer is yes, then you will certainly need to consider Design Registration and Copyright. "
        },
        {
            "text": "Learn more about applying for a registered design in our guidance. "
        },
        {
            "text": "Even though IP was not the main focus of tonight’s episode, there was still IP to consider. This just goes to show that even if you are not an inventor IP should always be part of your IP strategy... and there are plenty of resources to help with that.  Don’t be afraid, just ask and your business will thrive and grow.   "
        },
        {
            "text": "The IPO prides itself on helping SMEs realise their IP and how it can benefit their business - just take a look at our business tools and there will certainly be something that can help you get started. Business tools and training - GOV.UK "
        },
        {
            "text": "We would recommend, too, that you speak to a professional, for example a patent attorney or trade mark attorney - basic advice may be free. "
        },
        {
            "text": "Good luck everyone!"
        },
        {
            "text": "Disclaimer:  "
        },
        {
            "text": "The purpose of the IPO's Dragons' Den IP blog is to help identify the IP in entrepreneurs’ pitches and highlight how IP works, or could work, in the real-life examples featured. IPO’s authorship of this blog does not constitute its endorsement or sponsorship of any products, individuals or businesses referenced within it.  "
        }
    ]
}