{
    "url": "https://rpc.blog.gov.uk/2026/02/19/evidence-parliament-can-trust/",
    "title": "Evidence Parliament can trust",
    "authors": [
        "Stephen Gibson, RPC Chair"
    ],
    "categories": [
        "Parliamentary business"
    ],
    "pub_date": "2026-02-19T09:38:01+00:00",
    "content": [
        {
            "heading": 3,
            "text": "How the Regulatory Policy Committee’s independent scrutiny supports democratic accountability"
        },
        {
            "text": "When Parliament considers new legislation, MPs and peers rely on impact assessments to understand the expected impacts of that legislation. But who checks that these assessments are reliable?"
        },
        {
            "text": "The House of Lords Secondary Legislation Scrutiny Committee has been clear about the problem. Their report – pointedly titled \"Losing Impact: Why the government's impact assessment system is failing Parliament and the public\" – highlighted serious concerns about the quality and timeliness of evidence provided by government departments supporting regulatory proposals."
        },
        {
            "text": "Independent scrutiny from the Regulatory Policy Committee (RPC) exists precisely to highlight and help address this gap. For example Sir Christopher Chope MP commented that the Renters (Reform) Bill “was the subject of severe criticism by the Regulatory Policy Committee because no proper impact assessment was produced at the time the bill was introduced.” "
        },
        {
            "text": "Opinions from the RPC offer reassurance to MPs about the quality of analysis underpinning regulatory proposals. As Kevin Hollinrake MP (a former business minister) noted in a Parliamentary debate: “I am sure that he [Sir Philip Davies MP] is aware that whatever figures the government produce, they are then scrutinised by an independent body, the Regulatory Policy Committee, to make sure that those figures hold water. Is he not reassured by that?” He went on to say: “independent scrutiny by the Regulatory Policy Committee should offer some reassurance to ministers, parliamentarians and other stakeholders that the impacts have been considered rigorously”."
        },
        {
            "text": "The RPC can also identify where the evidence base for a proposal is weak and perhaps greater Parliamentary scrutiny of a bill is warranted. For example, Justin Madders MP commented: “If we are to rely on the RPC for approval of the way impact assessments are delivered, we ought to listen to its recommendations a little bit more. They are not always as glowing as we would like.”"
        },
        {
            "text": "And RPC scrutiny can also help improve the effectiveness of regulations by informing ministers about the quality of evidence and analysis. As Kevin Hollinrake MP noted in Parliament: \"the RPC's opinion can better inform ministers' decisions at an earlier stage on whether proceeding with regulation is the right approach, and whether the impacts are proportionate. All that should further improve the quality and value of the impact assessments that will reach Parliament and help to ensure that the government are regulating only where necessary, and designing regulation that is both proportionate and future-proof.”"
        },
        {
            "text": "In January 2024, I gave evidence to the Lords Secondary Legislation Scrutiny Committee, discussing how independent scrutiny of impact assessments supports parliamentary oversight. The exchange reflected a shared concern: Parliament needs reliable evidence to do its job effectively; the RPC provides reassurance over the reliability of the evidence Parliament receives."
        },
        {
            "text": "The RPC's role isn't to tell Parliament whether or not to pass legislation. It's to provide an independent assessment of the quality of the evidence supporting that legislation. When the RPC rates an impact assessment as \"not fit for purpose,\" it's a red flag to parliamentarians that the analysis may not support the claims being made."
        },
        {
            "text": "This matters because regulation has real consequences imposing huge costs (and hopefully benefits) on businesses and households. In one parliament alone, RPC scrutiny improved the accuracy of government estimates by around £585 million per year. Without that independent check, Parliament would be working with less reliable information."
        },
        {
            "text": "For Parliament, independent scrutiny means more reliable evidence supporting more informed debates. For government, it means policies built on solid analytical foundations and a sound evidence-base. For businesses and the public, it means greater confidence that the laws governing their activities have been properly thought through."
        },
        {
            "text": "Independent scrutiny provides greater transparency to support democratic accountability and improved evidence to support better decisions."
        },
        {
            "text": "🔗 Read more about the RPC: https://www.gov.uk/government/organisations/regulatory-policy-committee"
        }
    ]
}