{
    "url": "https://ipo.blog.gov.uk/2026/02/19/introducing-the-one-ipo-roadmap/",
    "title": "Introducing the One IPO roadmap",
    "authors": [
        "Simeon Bowen"
    ],
    "categories": [
        "Patents",
        "Transformation"
    ],
    "pub_date": "2026-02-19T09:30:00+00:00",
    "content": [
        {
            "text": "Since we’ve started rolling out the One IPO service, we’ve had lots of requests for a clear roadmap of the updates and improvements that can be expected. This blog will explore our roadmap."
        },
        {
            "text": "As we’re inching ever closer to the public launch of the service, now is the perfect time to share our first One IPO service roadmap with you. "
        },
        {
            "heading": 3,
            "text": "We’ve got work to do "
        },
        {
            "text": "Currently the service is in its private beta phase, which means it’s been opened up to a limited group of users while we test and refine it. Regardless, it’s clear we’ve got lots of work to do over the coming weeks, months and years to make this work as well as we want it to for our customers."
        },
        {
            "text": "There are some clear upgrades over the old services – like the ability to see updates on your patents almost in real-time – that give us a solid foundation to build on. However, there’s also a lot of room for improvement, and we’re not shying away from that. "
        },
        {
            "heading": 3,
            "text": "The roadmap explained "
        },
        {
            "text": "The roadmap is split into three sections – before launch, launch window and beyond launch. Let’s unpack that a bit. "
        },
        {
            "heading": 3,
            "text": "Before launch "
        },
        {
            "text": "Before launch is (unsurprisingly) the things we need to urgently fix or improve before launch. They are critical things that must be in place for us to be happy to launch the service. It includes things like increasing our publishing capacity, speeding up crucial processes like invoicing and applying the new fees.  "
        },
        {
            "text": "Most of the improvements before launch are focused around our internal processing and efficiency, given we’re rolling out new internal systems too. This will put us in a position to scale up our work in the new system when the One IPO service launches to the public. "
        },
        {
            "heading": 3,
            "text": "Launch window "
        },
        {
            "text": "Launch window is referring to the first six months immediately following the public launch of the service. It’s where the highest priority improvements customers have requested will be reviewed or implemented.  "
        },
        {
            "text": "Some of the things we refer to in this part of the roadmap will happen fairly quickly, while others will take longer. We’re going to do all of these things -it’s not a question of whether or not we fix the problem. It’s a question of how we fix it. What’s the best solution to the problem that will work for the most people? "
        },
        {
            "text": "In some cases this will be easy to identify. For example, it’s pretty clear to us that we need the representative to default to the organisation your account is linked to. However, when it comes to reviewing how correspondence works, that’s a far more complicated question, because the handling of correspondence varies so much between different organisations. "
        },
        {
            "heading": 3,
            "text": "Beyond launch "
        },
        {
            "text": "Beyond launch includes other important improvements, that are either a continuation of what we’ve been working on in the launch window or are just a bit less urgent than those earlier improvements. It’s referring to 6-12 months beyond the launch of the service. "
        },
        {
            "heading": 3,
            "text": "What’s next for the roadmap? "
        },
        {
            "text": "We’re referring to the roadmap we published today as ‘Roadmap 1.0’ – the first version. We will continue to review our priorities and update the roadmap on a regular basis to reflect our progress and anything that has changed. "
        },
        {
            "text": "That means three important things: "
        },
        {
            "text": "We want to keep the roadmap as a short-medium term view of our plans so we can provide as much certainty as possible. Speculating too far into the future leaves a lot of uncertainty and we don’t want to set expectations we may be unable to meet. Instead, each new version of the roadmap will gradually move us forward with clear and achievable goals. "
        },
        {
            "heading": 3,
            "text": "Give us your feedback "
        },
        {
            "text": "We know this is something our customers have wanted to see for some time. While it’s taken us longer than we would have liked to get here, we’re pleased to provide more certainty and clarity over the future development of the service now. "
        },
        {
            "text": "If there’s something that you feel strongly about that’s not currently on the roadmap, let us know by contacting oneiposupport@ipo.gov.uk. The more we hear something the more likely it is to change. "
        },
        {
            "heading": 3,
            "text": "Useful links:"
        }
    ]
}