{
    "url": "https://dwpdigital.blog.gov.uk/2026/02/19/kickstarting-a-career-with-our-university-leavers-graduate-programme/",
    "title": "Kickstarting a career with our University Leavers Graduate programme",
    "authors": [
        "DWP Digital"
    ],
    "categories": [
        "Digital With Purpose",
        "Engineering",
        "Infrastructure engineering",
        "Software Engineering"
    ],
    "pub_date": "2026-02-19T10:19:20+00:00",
    "content": [
        {
            "text": "In April 2025 we launched our University Leavers Engineering Programme providing an opportunity for recent IT or STEM subject graduates to join DWP Digital on a two-year placement. Applications for the 2026 cohort close on Thursday 26th February.  "
        },
        {
            "text": "The opportunity provides hands-on experience in software and infrastructure engineering alongside comprehensive leadership training and earning a master's qualification whilst working on projects that help and support the most vulnerable in society. The programme currently runs from our Blackpool and Manchester hubs.  "
        },
        {
            "heading": 2,
            "text": "Our graduates' experience "
        },
        {
            "text": "Will, based in our Manchester hub, is part of the first cohort undertaking the graduate programme.  "
        },
        {
            "text": "“I found the opportunity on LinkedIn, and it instantly appealed to me. It was flexible, allowed me to choose my own career path and was near to where I lived. It ticked all the boxes for me and thankfully, after a smooth application process, I got it! "
        },
        {
            "text": "“I really enjoy being part of a cohort of graduates, starting out together learning and supporting each other, especially through those first few weeks and months in a new role. The programme has created a great team dynamic amongst the new starters and makes it a unique and beneficial experience all round. "
        },
        {
            "text": "“The support we’ve received has been great, the team are receptive to feedback, all our comments are considered, and we are listened to in a non-judgemental way. We are encouraged to ask questions, no matter how big or small, helping us to grow in confidence and thrive in our new role.” "
        },
        {
            "text": "Safwa is also one of this year's cohort and has seen huge personal benefits to being part of a group of graduates learning and developing together.  "
        },
        {
            "text": "“I have enjoyed joining the programme with a cohort of other graduates - being able to learn from one another and have a community has been amazing. The rotations I have undertaken have been invaluable for meeting a wide range of engineers and building a strong network. Being exposed to the different technologies, tools, and ways of working has broadened my technical understanding and has been super rewarding and impactful. "
        },
        {
            "text": "“The opportunity to rotate through different areas of the department has been invaluable in knowing how their work supports the wider department, and ultimately how it benefits society. Seeing how different roles and teams fit into the broader scope of DWP Digital has given me a clearer picture of how large-scale services are delivered. I've also learnt how to work within multi-disciplinary, agile teams and adapt quickly to new environments through the rotations I have been on. The combination of technical growth, professional development, and understanding of the bigger picture has been one of the most valuable parts of the programme so far. "
        },
        {
            "text": "“The support has been excellent too. From the start, there's been a strong emphasis on making sure we feel supported technically and professionally. We have access to experienced engineers, line managers, mentors, and buddies who are all invested in our development and willing to offer guidance and advice. Being able to join different teams on rotations and forming a community within our cohort has allowed us to build a great network, create a supportive environment, and feel confident in our roles.” "
        },
        {
            "heading": 2,
            "text": "Our graduates' advice "
        },
        {
            "text": "\"To anyone thinking of applying for the programme I would say that you should apply,” says Will. “Even if like me your background is not directly related to IT. You never know what it may bring!” "
        },
        {
            "text": "Safwa believes that potential applicants shouldn’t be put off by their lack of real-world experience.  "
        },
        {
            "text": "“I would say to go for it, especially if you are looking for a role where you can learn quickly while doing work that matters. The programme is designed to support you from day one, so you're not expected to know everything already.  "
        },
        {
            "text": "“There is a lot of mentoring, training, learning, and development to help you grow technically and professionally. If you're motivated by using technology to make a positive impact and are keen to keep learning, this programme offers a combination of meaningful work, strong development opportunities, and a great inclusive culture.” "
        },
        {
            "text": "We are currently looking for the next cohort of graduates to join us. We want to hear from graduates with a first class or 2:1 degree in IT, technology-related or STEM subjects. A passion for software development, systems engineering, networks or IT security is also essential. "
        }
    ]
}