{
    "url": "https://civilservice.blog.gov.uk/2026/02/19/north-west-pioneers-place-based-cross-sector-leadership-programme/",
    "title": "North West pioneers place-based cross-sector leadership programme",
    "authors": [
        "Kathryn McCarter"
    ],
    "categories": [
        "Uncategorized"
    ],
    "pub_date": "2026-02-19T09:43:53+00:00",
    "content": [
        {
            "text": "An exciting new leadership initiative in the North West is bringing together senior leaders from across the Civil Service, local government, private sector, higher education and not-for-profit organisations to strengthen leadership capabilities and collaboration across Greater Manchester. This year-long programme aims to deliver results rooted in regional reality and spark a long-lasting legacy of local leadership."
        },
        {
            "text": "The Whitehall Industry Group (WIG) Place-Based Leadership Programme represents a unique opportunity to bridge the gap between national policy makers and regional stakeholders. Running for 12 months from late March 2026, the pilot programme will bring together 30 Directors and Deputy Directors to support the ‘leaders of tomorrow’. This  Place-Based initiative perfectly embodies the Places for Growth’s vision for creating a Civil Service that truly understands and responds to the needs of communities across the UK."
        },
        {
            "heading": 3,
            "text": "Building bridges and breaking down barriers "
        },
        {
            "text": "The programme will support 30 leaders from the Greater Manchester region, from the Civil Service, local authorities, private sector, not-for-profit organisations and higher education to develop stronger networks and help co-design a unified approach to the delivery of shared policy issues in Greater Manchester. The cohort will focus specifically on how leaders work in partnership to deliver better outcomes for issues around regional economic growth and prosperity. "
        },
        {
            "text": "The programme aims to increase trust and understanding between local and regional stakeholders, fostering meaningful place-based collaboration, to deliver more effectively and shape better outcomes. By bringing more senior leaders and decision-makers outside of London and into the communities, Places for Growth is stimulating this closer-working between central government and local partners. Transforming how the government operates within communities to ensure policy-makers truly understand and respond to local needs."
        },
        {
            "text": "Through a series of facilitated sessions, strategic dialogues, workshops and experiential visits, participants will develop a shared understanding of cross-sector opportunities for regional growth whilst identifying potential barriers and pitfalls. The programme will tackle live policy issues relevant at local, regional and national levels, aligning with the 10-year Greater Manchester Strategy and national objectives. Sessions will focus on systems thinking, cross-sector collaboration around growth, AI and technology for productivity, and developing new ways of working between place-based and central government leaders. Participants will also spend full days shadowing leaders from other sectors to gain practical insights into how different organisations operate."
        },
        {
            "text": "Jo Bradshaw - Places for Growth, Head of Place for the North-West said: "
        },
        {
            "text": "\"I’m delighted to be working with WIG to launch this exciting new place-based leadership programme in Manchester. The North-West has the biggest Civil Service presence outside London and this new programme will enable us to build on the relationships we already have with regional partners, to support growth, place based policy making and leadership development for both our SCS cadre and partners from other sectors.\""
        },
        {
            "text": "Janet Hughes - Director General, Reform and Efficiency, Cabinet Office said:"
        },
        {
            "text": "\"I’m really excited to be sponsoring this programme in Greater Manchester, where I’m based and where there is so much exciting work going on and such a huge opportunity to better join up our efforts across the public and private sectors. I can’t wait to see what our first cohort makes of the opportunity.\""
        },
        {
            "text": "This pilot programme represents a significant investment in developing Place-based leadership capabilities for navigating complex, multi-stakeholder environments, and demonstrates how through Places for Growth, civil servants across the UK are  working with local partners to unlock cross-sector collaboration. Successful participants will help shape future policy-making, creating a lasting legacy for leadership development across the region. "
        },
        {
            "text": "WIG has committed to exploring further interventions and support across other regions of the UK throughout 2026. To discuss the Greater Manchester Programme or potential support in your area, you can contact Tom Sapsted, Director of Strategy & Programmes at WIG on tom.sapsted@wig.co.uk."
        }
    ]
}