{
    "url": "https://insidehmcts.blog.gov.uk/2026/02/19/the-darts-challenge-modernising-our-most-complex-court-system/",
    "title": "The DARTS challenge: modernising our most complex court system",
    "authors": [
        "Pete Harrison – Programme Director, Decommissioning & Legacy Risk Mitigation, HMCTS"
    ],
    "categories": [
        "Digital services",
        "User experience and research",
        "Working at HMCTS"
    ],
    "pub_date": "2026-02-19T11:01:12+00:00",
    "content": [
        {
            "text": "\n[English] - [Cymraeg]"
        },
        {
            "text": "The modernisation of Digital Audio Recording Transcription (DARTS) marked the final major milestone in our journey to transform court technology. Used specifically in the Crown Court, the modernised platform delivers faster, more reliable access to recordings, helping legal professionals, court staff and transcription services work more efficiently and accurately.  "
        },
        {
            "text": "Users can now locate Crown Court cases more quickly thanks to improved search tools, with critical information like reporting restrictions clearly displayed to avoid costly delays. Requests for the audio recordings used to create the transcripts are processed in minutes rather than hours, and users can track their progress in real time. Court staff also benefit from centralised access to historic documents, meaning they have secure, seamless access without juggling multiple passwords.  "
        },
        {
            "text": "Natalie Robinson, Crime Service Manager at HMCTS, describes DARTS as “a core application within the Crown Court, enabling HMCTS to meet mandatory requirements to record and store audio from all Crown Court hearings”.   "
        },
        {
            "text": "By modernising DARTS and transitioning onto a cloud environment, we’ve created a more efficient, user-friendly and reliable service for the people who need to access recordings and transcripts.  "
        },
        {
            "text": "Susan Goss from transcription company Escribers adds: “DARTS is a platform we rely on heavily as part of the administration of justice. The improvements and time saved waiting for audio are proving very great indeed.”"
        },
        {
            "heading": 2,
            "text": "The challenge: A complex migration"
        },
        {
            "text": "DARTS records Crown Court proceedings across England and Wales, forming the official legal record. These recordings are vital for appeals and parole hearings, accurate transcription and ensuring transparency in the justice system. When someone appeals a conviction or sentence, these recordings provide the definitive account of what occurred in court.  "
        },
        {
            "text": "After completing the migration of 36 of the 37 applications from legacy data centres, the modernisation of DARTS was our most complex task. It involved moving nearly 600 terabytes of audio data – equivalent to nearly one million CDs and more than all other court applications combined.  "
        },
        {
            "text": "The previous system was not designed with data migration in mind. Transferring the recordings was straightforward in principle – copying files with quality checks to ensure none were lost or damaged – but the scale was immense. This process had to be repeated 98 million times, with the team monitoring and reporting on progress."
        },
        {
            "heading": 2,
            "text": "A complete rebuild"
        },
        {
            "text": "The real challenge lay in converting the database that tracks these recordings. It contains not just dates and locations, but all the information that users need to find specific recordings and request transcripts – such as court events, linked cases and sentencing details that determine how long recordings must be kept. The complex relationships between different pieces of information had to be perfectly preserved during conversion, as any errors could affect legal processes, appeals or the future ability to locate specific proceedings.  "
        },
        {
            "text": "The old version of DARTS was so tightly linked to specific software and hardware that it couldn’t simply be moved across. A full rebuild using standard cloud technology was the only solution that would ensure scalability and the potential for enhancements in the future.   "
        },
        {
            "heading": 2,
            "text": "Securing the record of justice"
        },
        {
            "text": "The DARTS migration was completed in May 2025, marking the final milestone in moving away from data centres. The modernised system is live in the Crown Court, with connectivity to existing criminal case management systems.  "
        },
        {
            "text": "With technical teams, court staff and external users working closely together, nearly 600TB of data was migrated with no loss of information. The transition has been seamless for users, with familiar features retained and performance significantly improved. The new system includes real-time user messaging, integrated data storage and comprehensive monitoring. Most importantly, it lays the foundation for continuous improvement and future innovation.  "
        },
        {
            "text": "This project has been more than just a technical success – it demonstrates a commitment to maintaining the integrity of our justice system. With modern, flexible infrastructure now in place, DARTS is ready to evolve towards future capabilities and to connect with new court systems. "
        },
        {
            "text": "\n[English] - [Cymraeg]"
        },
        {
            "heading": 1,
            "text": "Yr her DARTS: moderneiddio ein system llys mwyaf cymhleth"
        },
        {
            "text": "Roedd moderneiddio DARTS yn nodi’r brif garreg filltir derfynol yn ein siwrnai i drawsnewid technoleg yn y llys. Drwy ddefnyddio’n benodol yn Llys y Goron, mae’r platfform a foderneiddiwyd yn cynnig mynediad mwy dibynnol i recordiadau, helpu gweithwyr proffesiynol cyfreithiol, staff y llys a gwasanaethau trawsgrifio i weithio’n fwy effeithlon a chywir.  "
        },
        {
            "text": "Gall defnyddwyr nawr leoli achosion Llys y Goron yn gynt diolch i adnoddau chwilio gwell, gyda gwybodaeth hanfodol fel rhoi gwybod am gyfyngiadau yn cael ei harddangos yn glir i osgoi oedi drud. Mae ceisiadau ar gyfer y recordiadau sain hyn a ddefnyddir i greu’r trawsgrifiadau’n cael eu prosesu mewn munudau yn hytrach nag oriau a gall defnyddwyr olrhain eu cynnydd mewn amser real. Mae staff y llys hefyd yn cael budd o fynediad canolog i ddogfennau hanesyddol, gan olygu bod ganddynt fynediad diogel, di-dor heb orfod addasu amrywiol gyfrineiriau. "
        },
        {
            "text": "Mae Natalie Robinson, Rheolwr Gwasanaethau Troseddol, GLlTEF yn disgrifio DARTS fel “cymhwysiad greiddiol o fewn Llys y Goron, gan alluogi GLlTEF i gwrdd â gofynion gorfodol i gofnodi a storio sain o bob gwrandawiad yn Llys y Goron.”  "
        },
        {
            "text": "Drwy foderneiddio DARTS a phontio i amgylchedd cwmwl, rydym wedi creu gwasanaeth mwy effeithlon, haws i’w ddefnyddio a dibynadwy i bobl sydd angen mynediad i recordiadau a thrawsgrifiadau. "
        },
        {
            "text": "Ychwanegodd Susan Goss o’r cwmni trawsgrifio Escribers: “Mae DARTS yn blatfform yr ydym yn dibynnu arno’n fawr fel rhan o weinyddu cyfiawnder.  Mae’r gwelliannau a’r amser a arbedir ar gyfer aros am sain yn fawr iawn."
        },
        {
            "heading": 2,
            "text": "Yr her: Mudo cymhleth "
        },
        {
            "text": "Mae DARTS yn recordio achosion Llys y Goron ar draws Cymru a Lloegr, gan ffurfio’r cofnod cyfreithiol swyddogol.  Mae’r recordiadau hyn yn hanfodol ar gyfer apeliadau a gwrandawiadau parôl, trawsgrifiad cywir a sicrhau tryloywder yn y system gyfiawnder. Pan mae rhywun yn apelio yn erbyn euogfarn neu ddedfryd, mae’r recordiadau hyn yn darparu cyfrif pendant o’r hyn a ddigwyddodd yn y llys. "
        },
        {
            "text": "Ar ôl cwblhau mudo 36 o’r 37 cymhwysiad o’r canolfannau data etifeddiaeth, roedd moderneiddio DARTS y dasg fwyaf cymhleth. Roedd yn cynnwys symud bron i 600 terabeit o ddata sain - yn cyfateb i bron un miliwn o CDs a mwy na phob achos llys arall wedi eu cyfuno. "
        },
        {
            "text": "Ni chafodd y system flaenorol ei dylunio gyda mudo data mewn cof.  Roedd trosglwyddo’r recordiadau’n syml mewn egwyddor - copïo ffeiliau gyda gwiriadau ansawdd i sicrhau na chollwyd na difrodwyd unrhyw un - ond roedd y raddfa’n enfawr. Roedd yn rhaid ailadrodd y broses hon 98 miliwn o weithiau, gyda’r tîm yn monitro ac yn adrodd ar gynnydd.  "
        },
        {
            "heading": 2,
            "text": "Ailadeiladu’n llwyr"
        },
        {
            "text": "Yr her wirioneddol oedd trosi’r gronfa ddata sy’n olrhain y recordiadau hyn.  Mae’n cynnwys nid yn unig dyddiadau a lleoliadau, ond yr holl wybodaeth mae defnyddwyr angen i ddod o hyd i recordiadau penodol a cheisiadau trawsgrifiadau - fel digwyddiadau llys, achosion cyswllt a manylion dedfrydu sy’n pennu am ba hyd y dylid cadw recordiadau. Roedd yn rhaid cadw’r berthynas gymhleth rhwng darnau gwahanol o wybodaeth yn berffaith yn ystod trafodaeth, gan y gallai unrhyw wallau effeithio ar brosesau cyfreithiol, apeliadau neu’r gallu i leoli achosion penodol yn y dyfodol. "
        },
        {
            "text": "Roedd cysylltiad mor agos rhwng yr hen fersiwn o DARTS â meddalwedd a chaledwedd penodol na ellir yn syml ei symud drosodd.  Ailadeiladu drwy ddefnyddio technoleg cwmwl safonol oedd yr unig ateb a fyddai’n sicrhau gallu delio gyda chynnydd a’r posibilrwydd ar gyfer gwelliannau yn y dyfodol.  "
        },
        {
            "heading": 2,
            "text": "Sicrhau cofnod cyfiawnder  "
        },
        {
            "text": "Cafodd gwaith mudo DARTS ei gwblhau ym mis Mai 2025, gan nodi’r garreg filltir derfynol wrth symud i ffwrdd o ganolfannau data. Mae’r system a foderneiddiwyd yn fyw yn Llys y Goron, gyda chysylltedd i systemau rheoli achos troseddol presennol.  "
        },
        {
            "text": "Gyda thimau technegol, mae staff y llys a defnyddwyr allanol yn gweithio’n agos gyda’i gilydd, cafodd bron 600TB o ddata ei fudo heb golli gwybodaeth.   Mae’r pontio wedi bod yn ddi-dor ar gyfer defnyddwyr, gyda nodweddion cyfarwydd wedi eu cynnal a pherfformiad wedi gwella’n sylweddol.  Mae’r system newydd yn cynnwys negeseuon defnyddwyr amser real, storio data integredig a monitro cynhwysfawr.  Yn bwysicach na dim, mae’n gosod y sylfeini ar gyfer gwelliant parhaus ac arloesodd yn y dyfodol. "
        },
        {
            "text": "Mae’r prosiect wedi bod yn fwy na llwyddiant technegol - mae’n dangos ymrwymiad i gynnal gonestrwydd ein system gyfiawnder. Gyda seilwaith modern, hyblyg ar waith, mae DARTS yn barod i ddatblygu tuag at alluogrwydd yn y dyfodol a chysylltu â’r systemau llys newydd."
        }
    ]
}