{
    "url": "https://accessibility.blog.gov.uk/2023/05/04/accessibility-matters-at-the-intellectual-property-office-uk-ipo/",
    "title": "Accessibility matters at the Intellectual Property Office UK (IPO)",
    "authors": [
        "Amy Price, Senior Digital Strategy Manager, Intellectual Property Office UK"
    ],
    "categories": [
        "Accessibility",
        "Community"
    ],
    "pub_date": "2023-05-04T10:33:40+01:00",
    "content": [
        {
            "text": "As we approach Global Accessibility Awareness day, I’m reflecting on the accessibility progress we’ve made, here at the Intellectual Property Office UK (IPO)."
        },
        {
            "text": "While browsing through the archives, I came across a blog written in 2016 by an IPO colleague. In ‘Researching the realms of accessibility’, Sarah describes the brilliant work undertaken with the Digital Accessibility Centre (DAC) ‘to ensure our services are accessible to all our customers’."
        },
        {
            "text": "This was before my time here, so it was really interesting to read. I’m proud to say that we’ve continued in this good vein with our work on accessible and inclusive content."
        },
        {
            "text": "When I joined the GOV.UK web team in 2020 we were already award-winning in what we do. Ranked first for accessibility out of 50 worldwide IP office websites, for three consecutive years by IP magazine World Trademark Review. We were clearly already doing something right!"
        },
        {
            "heading": 2,
            "text": "Accessible, always"
        },
        {
            "text": "In 2018, the Public Sector Bodies (Websites and Mobile Applications) (No. 2) Accessibility Regulations 2018 were put in place to ensure that all public sector websites are accessible. Like other Government departments, we had a focus on moving away from inaccessible content formats. We offered alternative versions of documents and made use of our in-house user research team to test content and identify accessibility problems that we needed to fix. Once we were happy that we had met the legislation for our external customers, we began to turn our focus inward and review our internal content to ensure that was inclusive too."
        },
        {
            "text": "I joined the accessibility project team and began work on helping to make inclusive content part of our culture. As reflected in the IPO's Accessibility documents policy, we really do want as many people as possible to be able to access our services and information. The question we asked ourselves at this point was ‘how do we go about achieving this and becoming accessible by default in all that we do?’"
        },
        {
            "heading": 2,
            "text": "IPO Accessibility champions: changing our culture"
        },
        {
            "text": "In 2021, I set up an accessibility champions network. Attracting almost 50 representatives from various areas within our business, I’m proud to say that they now fly the flag for inclusive content and do a great job of initiating improvements in their areas."
        },
        {
            "text": "The Digital Accessibility Centre helped us once again, providing training to all of our champions. As a network, we then set out to support the rest of our people in their learning. Our in-house creative team have made a set of animated resources based on the Worcester Council SCULPT framework and we’ve brought in more training for IPO people to learn about creating accessible documents and other digital content. As we learn more and more about how to be inclusive in our information and services, we’re making small and frequent improvements to what we do and most importantly, how we do it."
        },
        {
            "text": "Some of the developments our network members have initiated include:"
        },
        {
            "text": "We’ve also commissioned third parties to audit our content for accessibility and have worked through a small list of recommendations, making improvements to our intranet pages and customer letters."
        },
        {
            "text": "We realise that digital accessibility isn’t all that matters though, so to ensure that we continue to improve our inclusive culture and environment, we’re about to conduct a gap analysis to find out what more we could be doing for our people and our customers. We always say ‘we don’t know, what we don’t know’…but we’ll certainly do our best to find out."
        },
        {
            "heading": 2,
            "text": "Creating an environment where we are all supported to do our best work"
        },
        {
            "text": "Andy Bartlett, our accessibility board sponsor says:"
        },
        {
            "text": "‘I’m really proud of the progress we’ve made in IPO on improving the accessibility of our content for all our users, including staff and customers. It’s fantastic that we have such an active network to champion the needs of those who would otherwise experience difficulties accessing our content.  Being recognised as a leader amongst IP offices shows just how far we’ve come in making accessibility part of our culture. It’s a great example of what IPO is all about.’"
        },
        {
            "text": "Accessibility can’t be an ‘add on’ for us and must form part of everything we do – both for our external and internal."
        },
        {
            "text": "To become more inclusive in the way that you work and make your content more accessible for everyone, here is my list of recommended reading:"
        },
        {
            "text": " "
        }
    ]
}