{
    "url": "https://food.blog.gov.uk/2023/05/04/benjis-bites-winning-awards-whilst-keeping-consumers-safe/",
    "title": "Benji’s Bites – Winning awards whilst keeping consumers safe",
    "authors": [
        "Here to Help"
    ],
    "categories": [
        "Case studies"
    ],
    "pub_date": "2023-05-04T09:32:16+01:00",
    "content": [
        {
            "text": "Cymraeg"
        },
        {
            "text": "We spoke to Hanna from Benji's Bites about her experience of running a food business and how she ensures her business is keeping consumers safe. "
        },
        {
            "text": "This blog is part of our Here to Help series, making it easier for businesses to do the right thing through business stories, resources and our improved hub of business guidance on our website."
        },
        {
            "heading": 3,
            "text": "Why did you start your business?"
        },
        {
            "text": "I’d had my second child, but I still had a toddler to look after, and I wanted him to eat healthily and eat nice meals. So, I started batch cooking, but in a Benji’s Bites way, doing the carbs separate from the sauces and things in small cubes. So, I could just mix and match what I wanted to feed him, just pop it in the microwave. I thought, well if I'm helping myself out, then maybe I could help other parents out. Then on the market, there was only really one size standard, almost like tray bakes for toddlers and babies."
        },
        {
            "text": "So, I thought, “Well this way then parents can pick and choose their meal combination and their portion size, and they can feed little babies, or they can feed older siblings and they can have a healthy meal ready in minutes”. So that was my motivation."
        },
        {
            "heading": 3,
            "text": "Did you approach anyone for advice?"
        },
        {
            "text": "Not particularly, no. What I was looking at [in my research] was: “Is it possible to do it from home?” And it was, thank God."
        },
        {
            "text": "I know that they're [Environmental Health Officer (EHO)] always there. I know that she's at the end of an e-mail. If I find I've got any questions, I can ask her."
        },
        {
            "text": "When I was at the Great Yorkshire Show, she visited the stand and said hello. We have that kind of open relationship; they're not pestering me for the sake of it."
        },
        {
            "text": "In fact, the EHO has said that when the time comes, they'll help me with what I need to do in terms of setting up in a commercial unit safely."
        },
        {
            "heading": 3,
            "text": "How did you feel before and during engaging with the Environmental Health team in your local authority?"
        },
        {
            "text": "I did have quite a lot of questions and doubts because I wasn't sure if I could do it from home or if I could sell meat products. So, then we talked about it, and they told me what I could and couldn't do. After that, I knew it was possible."
        },
        {
            "text": "Before meeting the EHO, I was not sure if the business could go ahead. I was in quite early stages of setting up the business. So, the meeting was reassuring, because I was worried about the things I was going to have to have. I’ve only got one sink in my kitchen. So, I thought I would have to get a temporary hand-washing sink. But because it's a double sink, it's fine. Things like that were really reassuring, they reiterated a lot of things I already knew but it was helpful to get any questions I had answered."
        },
        {
            "heading": 3,
            "text": "What advice would you give anyone who hasn’t registered?"
        },
        {
            "text": "Make sure they are doing it right from the start and not to panic because it may seem like there's loads of information, loads of thing to do, but it's straightforward. Get in contact with your Council and they'll be able to help you. Also, the FSA website, all the documentation is on there and most of it’s common sense, but it gives you a nice checklist to work through to make sure that you've not forgotten anything. It’s a lot harder down the line if you’ve got all your processes in place and you have to make changes retrospectively, so make sure you get things right at the start of your journey."
        },
        {
            "text": "Also, don’t worry as much. In terms of setting up my business, I used my council, and I used all the documentation on the FSA website, and Trading Standards. Have faith in the system. It’s not as daunting as it seems."
        },
        {
            "text": "For more information on how to keep your business on track whilst keeping consumers safe head to our business guidance hub. Alternatively, head to our easy-to-navigate guide for those starting up a new food business. "
        },
        {
            "heading": 1,
            "text": "Benji’s Bites – Ennill gwobrau tra’n cadw defnyddwyr yn ddiogel"
        },
        {
            "text": "Sgwrs gyda Hanna o Benji’s Bites am ei phrofiad o redeg busnes bwyd a sut mae’n sicrhau bod ei busnes yn cadw defnyddwyr yn ddiogel."
        },
        {
            "text": "Mae’r blog hwn yn rhan o’n cyfres Yma i Helpu, sy’n ei gwneud hi’n haws i fusnesau wneud y peth iawn trwy rannu straeon gan fusnesau, adnoddau, a’n hyb o ganllawiau i fusnesau ar ein gwefan: www.food.gov.uk/cy/yma-i-helpu"
        },
        {
            "heading": 3,
            "text": "Pam gwnaethoch chi ddechrau eich busnes?"
        },
        {
            "text": "Roeddwn wedi cael fy ail blentyn, ond roedd gen i blentyn bach i ofalu amdano hefyd, ac roeddwn eisiau iddo fwyta’n iach a chael prydau bwyd da. Felly, dechreuais goginio sypiau, ond yn null nodweddiadol Benji’s Bites, gan gadw’r carbohydradau ar wahân i’r sawsiau a chadw popeth mewn ciwbiau bach. Drwy wneud hynny, roedd modd i mi ddewis a dethol beth roeddwn i eisiau ei roi iddo i’w fwyta, a’i roi yn y microdon. Dechreuais feddwl, os yw hyn yn fy helpu i, efallai y gallai helpu rhieni eraill hefyd. Fe wnes i sylwi wedyn mai dim ond un maint safonol ar gyfer prydau oedd ar y farchnad, tebyg i hambyrddau bach i blant bach a babanod."
        },
        {
            "text": "Felly, meddyliais, “fel hyn, gall rhieni ddewis a dethol pa gyfuniad o brydau y maent am eu rhoi a maint y ddogn. Maent yn gallu bwydo babanod bach, neu frodyr a chwiorydd hŷn, a chael pryd iach yn barod mewn munudau”. Felly dyna oedd fy rheswm dros ddechrau’r busnes."
        },
        {
            "heading": 3,
            "text": "At bwy y gwnaethoch chi droi am gyngor?"
        },
        {
            "text": "Neb yn arbennig. Yr hyn roeddwn i’n ei ystyried [fel rhan o fy ymchwil] oedd: “Ydw i’n gallu rhedeg y busnes o gartref?” A dwi’n gallu, diolch byth."
        },
        {
            "text": "Rwy’n gwybod ei bod hi [Swyddog Iechyd yr Amgylchedd] ar gael bob amser. Dwi’n gallu anfon e-bost ati a chael ateb. Os bydd gen i unrhyw gwestiynau, mae modd ei holi hi."
        },
        {
            "text": "Pan oeddwn yn sioe Great Yorkshire, daeth i’r stondin i ddweud helo. Mae gennym berthynas agored; nid yw hi’n fy mhoeni yn ddiangen."
        },
        {
            "text": "Yn wir, mae’r Swyddog Iechyd yr Amgylchedd wedi dweud, pan ddaw’r amser, y bydd yn fy nghefnogi i sefydlu uned fasnachol yn ddiogel."
        },
        {
            "heading": 3,
            "text": "Sut roeddech chi’n teimlo cyn, ac wrth ymgysylltu â thîm Iechyd yr Amgylchedd eich awdurdod lleol?"
        },
        {
            "text": "Roedd gen i gryn dipyn o gwestiynau ac amheuon oherwydd doeddwn i ddim yn siŵr a allwn i redeg y busnes o gartref, ac a allwn i werthu cynhyrchion cig. Felly, gwnaethon ni drafod hyn, ac fe nododd beth oedd yn bosib, a'r hyn nad oeddwn yn gallu ei wneud. Ar ôl hynny, roeddwn i’n gwybod fy mod yn gallu dechrau’r busnes."
        },
        {
            "text": "Cyn cyfarfod â’r Swyddog Iechyd yr Amgylchedd, doeddwn i ddim yn siŵr a allwn i fwrw ymlaen â’r busnes. Dim ond newydd dechrau sefydlu’r busnes oeddwn i. Felly, roedd y cyfarfod yn galonogol, oherwydd roeddwn i’n poeni am ba offer y byddai eu hangen arnaf. Dim ond un sinc sydd gen i yn fy nghegin. Roeddwn i’n meddwl y byddai’n rhaid i mi gael sinc golchi dwylo dros dro. Ond gan ei bod yn sinc ddwbl, mae’n iawn. Roedd pethau fel hyn yn tawelu fy meddwl. Fe wnaeth hi gadarnhau llawer o bethau roeddwn yn gwybod amdanynt yn barod, ond roedd yn ddefnyddiol cael atebion i unrhyw gwestiynau penodol."
        },
        {
            "heading": 3,
            "text": "Pa gyngor fyddech chi’n ei roi i unrhyw un sydd heb gofrestru?"
        },
        {
            "text": "Mae’n bwysig gwneud pethau’n iawn o’r cychwyn cyntaf a pheidio â mynd i banig, oherwydd gall ymddangos fel bod llwyth o wybodaeth i’w deall a llawer o bethau i’w gwneud, ond mewn gwirionedd mae’n ddigon syml. Cysylltwch â’ch awdurdod lleol a byddant yn gallu eich helpu. Hefyd, mae’r holl ddogfennaeth angenrheidiol ar wefan yr ASB. Mae’r rhan fwyaf yn synnwyr cyffredin, ond mae’n rhoi rhestr wirio dda i chi weithio drwyddi i wneud yn siŵr nad ydych wedi anghofio unrhyw beth. Bydd yn llawer anoddach os byddwch wedi sefydlu eich holl brosesau, ac yna’n cael gwybod bod yn rhaid i chi gwneud newidiadau ôl-weithredol, felly gwnewch yn siŵr eich bod yn gwneud pethau’n iawn o’r cychwyn cyntaf."
        },
        {
            "text": "Hefyd, peidiwch â phoeni gormod. Wrth sefydlu fy musnes, manteisiais ar yr hyn roedd gan fy awdurdod lleol i’w gynnig i mi, a defnyddiais yr holl ddogfennaeth ar wefan yr ASB a Safonau Masnach. Gallwch ymddiried yn y system. Nid yw mor frawychus ag y mae’n ymddangos."
        },
        {
            "text": "I gael rhagor o wybodaeth am sut i gadw’ch busnes ar y trywydd iawn a chadw defnyddwyr yn ddiogel ar yr un pryd, ewch i’n hyb canllawiau busnes. Fel arall, ewch i’n canllaw hwylus i’r rhai sy’n dechrau busnes bwyd newydd.  "
        }
    ]
}