{
    "url": "https://educationhub.blog.gov.uk/2023/05/04/coronation-2023-6-green-apprenticeships-and-how-to-apply/",
    "title": "Coronation 2023: 6 green apprenticeships and how to apply",
    "authors": [
        "mediaofficer"
    ],
    "categories": [
        "Apprenticeships"
    ],
    "pub_date": "2023-05-04T13:12:20+01:00",
    "content": [
        {
            "text": "Six green apprenticeships have been hand-picked by industry experts and marked with the Coronation emblem to celebrate the Coronation of His Majesty King Charles III."
        },
        {
            "text": "These apprenticeships have been selected because they contribute to a low carbon economy and help to build a workforce that is equipped with the skills needed for a green future."
        },
        {
            "text": "They also reflect the King’s commitment to sustainability and environmental causes."
        },
        {
            "heading": 3,
            "text": "Which apprenticeships have been selected?"
        },
        {
            "text": "The Coronation emblem signals a gold-standard apprenticeship that will help you to develop green skills."
        },
        {
            "text": "The six apprenticeships which are now marked with the Coronation emblem are:"
        },
        {
            "text": "These apprenticeships are paving the way for hundreds more environmentally-friendly apprenticeships."
        },
        {
            "heading": 3,
            "text": "Why are green apprenticeships important?"
        },
        {
            "text": "Education is a key tool in the fight against climate change. As we work towards a sustainable future, it’s important that our workforce has the necessary skills."
        },
        {
            "text": "All apprenticeships are a brilliant training and employment option where you can earn while learning to gain recognised qualification and plenty of valuable work experience at the same time."
        },
        {
            "heading": 3,
            "text": "Who can do an apprenticeship?"
        },
        {
            "text": "You can do an apprenticeship if you’re 16 or older."
        },
        {
            "text": "Different apprenticeships require different qualifications. For some, you may need an English or maths GCSE, or extra training in these subjects so you’re at the right level."
        },
        {
            "text": "However, for many apprenticeships, all you need is a commitment to the area you’re working in and a willingness to learn."
        },
        {
            "heading": 3,
            "text": "How can I apply for a green apprenticeship? "
        },
        {
            "text": "As with most apprenticeships, you need to apply as you would for a regular job to secure an interview."
        },
        {
            "text": "You can browse apprenticeships and apply at this link."
        },
        {
            "text": "You can also browse green apprenticeships on the Institute for Apprenticeships and Technical Education website here."
        },
        {
            "text": "If you’d like personalised advice, contact The National Careers Service via webchat, phone or in person. Get in touch now to find out more."
        }
    ]
}