{
    "url": "https://dragonsden.blog.gov.uk/2023/05/04/dragons-den-the-entrepreneurs-view/",
    "title": "Dragons’ Den: the entrepreneur’s view",
    "authors": [
        "Paula Davy"
    ],
    "categories": [
        "Business",
        "IP"
    ],
    "pub_date": "2023-05-04T11:51:30+01:00",
    "content": [
        {
            "text": "Last week, Dragons' Den entrepreneur Hannah Saunders, creator of Toddle Born Wild, told us how IP has helped her protect her range of ethically-sourced, eco-friendly products for children. Hannah pitched her ideas to the Dragons’ Den investors in March 2022. Here she tells us more about her business and her experience since Dragons’ Den.    "
        },
        {
            "heading": 3,
            "text": "Hannah, you run a successful business. Is this the path you planned when you started your career in the military?  "
        },
        {
            "text": "I didn’t anticipate starting a business. I really wanted to get as far as I could in the military – I was in it for life. I think it was the reality of having children and realising that I didn't want to keep moving around, didn't want to be away from them, that changed my mind. I was an incredibly ambitious person in the military, but rank limits what you can do and what you can achieve. You've got to do your time and wait for the opportunities and salary that higher rank brings.  "
        },
        {
            "text": "I think in the end, my ambition sort of overtook the military. It just wasn't quite fitting my life any more."
        },
        {
            "heading": 3,
            "text": "Toddle goes wild  "
        },
        {
            "text": "We asked Hannah when she realised that the Toddle brand was really taking off.   "
        },
        {
            "text": "It was when Virgin Atlantic asked us to pitch to them. They took our products on all their aircraft, which was fantastic, as they brought such credibility to our brand. They only allow real quality on board. Shortly after that, Holland and Barrett started stocking us, and Amazon. That's when I thought, right, this is actually going to work out.  "
        },
        {
            "text": "We’ve started trading in America, too, and that’s been a really important market for us to expand into."
        },
        {
            "heading": 3,
            "text": "What impact has the Dragons’ Den experience had on your business?  "
        },
        {
            "text": "For anyone with an innovative business, I would really, really recommend applying for it. For us, the exposure of the brand alone was fantastic. The programme attracts around 56 million people, if you include people catching up on iPlayer.  "
        },
        {
            "text": "We're talking with a big UK retailer at the moment, who first saw us on the programme. We received interest from an Asian exporter who we're about to sign a contract with. They are a significant exporter in Vietnam and also export into Japan and South Korea. We've also had interest from US retailers because they watched Dragons’ Den on BBC America.   "
        },
        {
            "text": "The help I’ve had from Stephen Bartlett and Deborah Meaden has been absolutely fantastic. For example, I met with Stephen recently for a strategy meeting which was so unbelievably helpful in terms of getting his insight. He made a PR video for us which we’re about to share everywhere. "
        },
        {
            "text": "Deborah also did a PR video with us. She's phenomenally helpful. I mean, if I email her every day, she will still e-mail me back - she's in touch every day. The help of the Dragons has been a game changer."
        },
        {
            "heading": 3,
            "text": "Has your appearance in the Den made a difference to you personally?   "
        },
        {
            "text": "For a small business like mine, the brand awareness and the investment are fantastic, but on a personal note, I find that people take me so much more seriously.  You know, so many start-ups fail, so you introduce yourself as a start-up entrepreneur and you know people are wondering if you’re going to be any good.  "
        },
        {
            "text": "When you find your way to the Den, then survive the whole Den process, and manage to gain investment from these incredible people... it gives you credibility without you really needing to say much at all. "
        },
        {
            "text": "It has really helped me personally and professionally that I'm taken more seriously now. I'm not just somebody who has left the military and started a business. I'm somebody with a successful business that people – the Dragons – have wanted to invest in. That's fantastic.  "
        },
        {
            "heading": 3,
            "text": "“Thinking of yourself differently”  "
        },
        {
            "text": "I mentioned to Stephen Bartlett that since my Dragons’ Den pitch, people have been looking at me differently. And he said no, you're presenting yourself differently, you’re thinking of yourself differently now and they're interacting with that. I thought that was a really interesting point. Setting up my own business for the past four years is like having been through the trenches - I know what I’m doing now.  "
        },
        {
            "text": "I will pitch to anybody now. I will ask anybody for a sale. I understand the profit, understand the numbers... I know how to run a business now. I do feel so much more confident."
        },
        {
            "heading": 3,
            "text": "What are your plans for the future?"
        },
        {
            "text": "Apart from continuing to expand the business, I do want to sell the company one day and having any kind of intellectual property can really help with the valuation of a business - it's another one of those assets that we can include when we want to sell."
        }
    ]
}