{
    "url": "https://hmlandregistry.blog.gov.uk/2023/05/04/front-loaded-support-for-complex-applications/",
    "title": "‘Front-loaded’ support for complex applications",
    "authors": [
        "Julie Blunsom, Customer and Strategy Division"
    ],
    "categories": [
        "Law and practice"
    ],
    "pub_date": "2023-05-04T09:57:22+01:00",
    "content": [
        {
            "text": "HM Land Registry can provide supportive pre-submission guidance to help ensure complex applications can be processed more efficiently. We have now brought our five free specialist services together in one place."
        },
        {
            "text": "We have listened to customers and made it easier and more convenient for you to access any help and support you need before lodging large-scale and complex applications, or starting work on developing residential estates."
        },
        {
            "text": "The new specialist support services hub is available on the portal as well as GOV.UK and provides links to each of five teams: the Application Management Service, Ask for Guidance, the Developing Estate Service, Large-Scale Applications and Large-Scale Voluntary First Registrations. At a click, professional customers seeking help will be directed to the right person at the right time."
        },
        {
            "text": "While we cannot provide legal advice or comment on a point of law, using one of these pre-submission services can help you avoid requests for information (requisitions) and enjoy consistency of service, especially when multiple transactions are involved."
        },
        {
            "text": "Specialist technicians Helene Jude and Mike Wilcock said:"
        },
        {
            "heading": 2,
            "text": "Efficiency savings"
        },
        {
            "text": "Customers are already benefiting from specialist support, with participants in one service trial estimating it saved them between 30 minutes and two hours per application. They also said it prevented:"
        },
        {
            "text": "Other benefits cited included greater certainty that the application would progress smoothly, and minimising the impact on fees of dealing with requests for information (requisitions)."
        },
        {
            "text": "Customers are saying:"
        },
        {
            "text": "\"The ‘ask for guidance’ has been very useful in assisting with more complex issues that arise. The advice is very clear and always delivered in a timely manner. This has become an invaluable tool and believe that it has helped us to avoid requisitions upon subsequent applications for registration.\" – Kirsty Gibson, Simplify"
        },
        {
            "text": "\"Thank you so much for your quick response it is very much appreciated, you have been an absolute pleasure to deal with and your support in this matter has been second to none. In a world where we are so quick to moan or complain and slow to give positive comments, please accept this as my gratitude to you and the wider team, great work and thank you most sincerely.\" – Michael Burley, BNP Paribas"
        },
        {
            "text": "\"The Estate Plan Approval webform service has been a welcome addition to Land Registry’s offering – it is very easy and intuitive to use, with a quick turnaround of results. The checklist and the automation element ensure that any incorrect applications are much less likely to be submitted, so the overall quality is improved, helping to speed up the process.\" – Caroline Wofinden, Freeths"
        },
        {
            "heading": 2,
            "text": "The services"
        },
        {
            "heading": 3,
            "text": "Application Management Service"
        },
        {
            "text": "Also previously known as ‘Managed Services’, customers can access the Application Management Service (AMS) for new complex commercial transactions or infrastructure developments."
        },
        {
            "text": "As long as the application has not been lodged, the answers aren’t in practice guides and cannot be handled by our Customer Support Centre, you can apply using the Pre-submission enquiry service form PSS1 or Application Management Service form AMS1 for free expert help."
        },
        {
            "heading": 3,
            "text": "Ask for Guidance enquiry service"
        },
        {
            "text": "After a successful pilot, we are rolling out this service to all of our customers. As long as the enquiry meets the criteria, a member of our specialist team can help navigate registry processes and avoid unnecessary errors."
        },
        {
            "heading": 4,
            "text": "Criteria"
        },
        {
            "text": "The information gathered by this service also allows us to update our guidance where appropriate."
        },
        {
            "heading": 3,
            "text": "Developing Estate Service"
        },
        {
            "text": "This is a free service for residential estates of six or more plots. Our experts can help simplify the application process and give clarity in advance of plot sales. Using the dedicated form, you can lodge draft estate plans and transfers or leases, plus other documentation, such as consents or powers of attorney for approval, before starting a development, or in the early stages of the build. For more information, see practice guide 41."
        },
        {
            "heading": 3,
            "text": "Large-Scale Applications"
        },
        {
            "text": "Our Bulk Applications Team can assist with large-scale applications, subject to criteria. Qualifying customers can get help in avoiding the complications associated with submitting applications based on a common deed or deeds. This service is available when submitting applications for any combination of more than 50 registered and unregistered titles. For more information, see practice guide 33."
        },
        {
            "heading": 3,
            "text": "Large-Scale Voluntary First Registrations "
        },
        {
            "text": "Our dedicated team can help customers seeking the voluntary first registration of a portfolio of unregistered properties, land assets or a large, landed estate. This free service is available to anyone registering more than 20 individual parcels or units of land. For more information, see practice guide 33."
        },
        {
            "heading": 3,
            "text": "Accessing Specialist Support Services"
        },
        {
            "text": "Customers can access all five Specialist Support Services using dedicated contact forms that send enquiries directly to the relevant teams. For those connecting to HM Land Registry services directly or via third-party software (Business Gateway access), the forms are held on GOV.UK."
        },
        {
            "text": "Portal account holders can also access the hub via a link on the homepage."
        },
        {
            "text": "For details and how to apply, head to the specialist support services hub on GOV.UK."
        }
    ]
}