{
    "url": "https://ace.blog.gov.uk/2023/05/04/getting-an-industry-perspective-on-frontline-policing/",
    "title": "Getting an industry perspective on frontline policing",
    "authors": [
        "Simon Carroll"
    ],
    "categories": [
        "Law enforcement",
        "People and skills",
        "Ways of working"
    ],
    "pub_date": "2023-05-04T15:35:33+01:00",
    "content": [
        {
            "text": "Knowledge-sharing is a two-way process. So while the potential of innovation to help solve some of the most pressing challenges facing frontline policing is one of ACE’s guiding principles, we’re also helping one officer see law enforcement from a completely different angle. "
        },
        {
            "text": "Alex has been a constable on the beat in Hackney since late 2021 as part of a two-year POLICE: NOW training scheme designed to recruit graduates into policing and develop them into neighbourhood policing leaders. "
        },
        {
            "text": "As part of his probation programme, he has been seconded to ACE for four weeks to gain industry experience as well as develop new skills. While gaining a greater understanding of how industry and technology can help respond to issues which impact the frontline, he is also sharing valuable inside perspectives and ideas of how ACE can further support policing. "
        },
        {
            "text": "ACE is in its second year of supporting POLICE:NOW, which is a social enterprise. Through the scheme, Alex applied for a placement with the Home Office because he had always had an interest in the public sector and was interested to experience another organisation working with the same public safety goal as the police.  "
        },
        {
            "text": "He said: “I went into policing because I wanted a public facing role where there is an unpredictability in the day-to-day, and I’m enjoying neighbourhood policing because it’s so varied and so busy. "
        },
        {
            "heading": 2,
            "text": "Work that has a direct impact"
        },
        {
            "text": "“But as a frontline officer you don’t really have any idea about how long-term changes come about and the drivers behind them, but I can see from meetings I’ve had with ACE that things happening now will have a direct impact down the line and change lives, not just in policing but other areas such as the NHS as well.” "
        },
        {
            "text": "He added: “I’ve been talking to expert suppliers about how they could improve existing systems, which is really interesting, and I’ve been walked through other work looking at CCTV advancements, for example. It’s great to see how technology assistance will be able to help humans do what they do best. "
        },
        {
            "text": "“I’ve also helped on some major commissions and events – ACE is great at putting people in touch with each other and getting the right people in the right places and making progress quickly. "
        },
        {
            "heading": 2,
            "text": "An awareness of what is possible"
        },
        {
            "text": "“I’m definitely going to go back to the beat with more of an awareness of what is possible, and will be asking ‘why not’? And ‘why can’t we do this’?” "
        },
        {
            "text": "Clara Pettitt, ACE’s Quality Hub lead who leads some of our social value initiatives, said: “There's huge value to bringing those on the public service frontline into ACE. It means we stay constantly plugged in to real mission needs while those at the operational sharp end see the possibilities for impact when we bring the best of technology, academia and industry to bear on solving problems collaboratively."
        },
        {
            "text": "“Alex’s frontline knowledge has been really clear from day one and he has been a valued asset to ACE, adding remarkable value to our customers’ most pressing problems in a short space of time. This scheme directly demonstrates the possibilities and impact of cross-collaboration across law enforcement.” "
        }
    ]
}