{
    "url": "https://food.blog.gov.uk/2023/05/04/llaeth-llanfair-from-farm-to-vending-machine/",
    "title": "Llaeth Llanfair – From farm to vending machine",
    "authors": [
        "Here to Help"
    ],
    "categories": [
        "Case studies"
    ],
    "pub_date": "2023-05-04T08:46:05+01:00",
    "content": [
        {
            "text": "Cymraeg"
        },
        {
            "text": "We spoke to Laura from Llaeth Llanfair in West Wales. This blog is part of our Here to Help series, making it easier for businesses to do the right thing through business stories, resources and our improved hub of business guidance on our website."
        },
        {
            "text": "Laura runs the dairy farm Llanfair Fach near Lampeter, Ceredigion with her husband Dafydd and brother-in-law Guto. They were Ceredigion’s first dairy farm to serve milk from a vending machine in a repurposed horsebox."
        },
        {
            "text": "During the pandemic, they made the decision to start selling their milk directly to their local community. In November 2020 they launched the first milk vending machine in Ceredigion from the back of a modified horsebox. They now sell their milk and milkshakes from two static machines as well as their mobile unit and have sold their products at the National Eisteddfod."
        },
        {
            "text": "The third-generation farming trio went into this new venture with no previous experience and didn’t know what to expect. They did, however, know that they hoped to receive a 5 Food Hygiene Rating."
        },
        {
            "heading": 3,
            "text": "Really straightforward guidance and information"
        },
        {
            "text": "Laura described the process of taking their milk from a wholesale product to a consumer product. They needed to design and create a pasteurising room for their dairy to sell their milk to the public, so they sought advice and guidance from local support services, other businesses and their local authority. It was a first for the local authority and their Environmental Health Officers (EHO) as this was the first milk vending machine business to be set up in Ceredigion."
        },
        {
            "text": "Talking about their interaction with their EHO, Laura said:"
        },
        {
            "text": "“She was brilliant. She was really supportive, answered any questions I had, I was able to seek advice and support, and she offered really straightforward guidance and information.”"
        },
        {
            "text": "They have stayed in touch with their EHO since starting the business, especially when the Llaeth Llanfair horsebox was parked in the food village at the National Eisteddfod in 2022. They sought advice on how to keep their customers safe and ensure that the pre-bottled milk they were selling was safe to drink."
        },
        {
            "text": "About 4-6 weeks after launching, Laura faced a hygiene challenge with the milkshake syrup optics that were installed in the van. Describing that challenge, Laura said:"
        },
        {
            "text": "“We were contacted by our EHO to tell us that there had been an incident in another area where people had been dispensing syrups straight into their mouths. We had to take them down while we made a box to cover the optics, now there is space for just a milk bottle or cup underneath.”"
        },
        {
            "heading": 3,
            "text": "They can give you reassurance if you just ask"
        },
        {
            "text": "Laura’s advice to other entrepreneurs who want to sell their products directly to the public is to:"
        },
        {
            "text": "“Make sure you seek advice before you go for it. Never be scared of contacting your EHO. They’re there to help and make sure you’re doing it right and the product you produce is of the highest standard.” She said, “You’re probably worrying about something you don’t need to – they can give you reassurance and advice if you just ask.”"
        },
        {
            "text": "When we asked Laura if there was anything they might have done differently, she replied “A bigger pasteurising room!” The business has been a big hit with the local community and their customers really enjoy the activity of going to get their farm-fresh milk."
        },
        {
            "text": "For more information on how to keep your business on track whilst keeping consumers safe head to our business guidance hub. Alternatively, head to our easy-to-navigate guide for those starting up a new food business. "
        },
        {
            "heading": 1,
            "text": "Llaeth Llanfair – O’r fferm i’r peiriant gwerthu"
        },
        {
            "text": "Sgwrs gyda Laura o gwmni Llaeth Llanfair yng ngorllewin Cymru. Mae’r blog hwn yn rhan o’n cyfres Yma i Helpu, sy’n ei gwneud hi’n haws i fusnesau wneud y peth iawn trwy rannu straeon gan fusnesau, adnoddau a’n hyb gwell o ganllawiau i fusnesau ar ein gwefan: www.food.gov.uk/cy/yma-i-helpu"
        },
        {
            "text": "Mae Laura yn rhedeg fferm laeth Llanfair Fach ger Llanbedr Pont Steffan, Ceredigion gyda’i gŵr, Dafydd, a’i brawd yng nghyfraith, Guto. Nhw oedd y fferm laeth gyntaf yng Ngheredigion i weini llaeth o beiriant gwerthu mewn bocs ceffylau wedi’i ail-bwrpasu. Yn ystod y pandemig, gwnaethant benderfynu dechrau gwerthu eu llaeth yn uniongyrchol i’w cymuned leol. Ym mis Tachwedd 2020, lansiwyd y peiriant gwerthu llaeth cyntaf yng Ngheredigion o gefn bocs ceffyl wedi’i addasu. Maen nhw bellach yn gwerthu eu llaeth a’u hysgytlaeth o ddau beiriant parhaol yn ogystal â’u huned symudol, ac maent wedi gwerthu eu cynhyrchion yn yr Eisteddfod Genedlaethol."
        },
        {
            "text": "Dechreuodd y tri ffermwr trydedd genhedlaeth eu menter newydd heb unrhyw brofiad blaenorol, ac nid oeddent yn gwybod beth i’w ddisgwyl. Roeddent yn gwybod, fodd bynnag, eu bod yn gobeithio cael Sgôr Hylendid Bwyd o 5."
        },
        {
            "heading": 3,
            "text": "Canllawiau a gwybodaeth syml iawn"
        },
        {
            "text": "Disgrifiodd Laura y broses o fynd â’u llaeth o gynnyrch cyfanwerthu i gynnyrch defnyddiwr. Roedd angen iddynt ddylunio a chreu ystafell basteureiddio ar gyfer eu llaethdy i werthu eu llaeth i’r cyhoedd, felly gwnaethant ofyn am gyngor a chanllawiau gan wasanaethau cymorth lleol, busnesau eraill a’u hawdurdod lleol. Dyma’r tro cyntaf i’r awdurdod lleol a’u Swyddogion Iechyd yr Amgylchedd ymdrin â busnes o’r fath, gan mai hwn oedd y busnes peiriannau gwerthu llaeth cyntaf i gael ei sefydlu yng Ngheredigion."
        },
        {
            "text": "Wrth siarad am weithio â’u Swyddog Iechyd yr Amgylchedd, dywedodd Laura:"
        },
        {
            "text": "“Roedd hi’n wych. Roedd hi’n gefnogol iawn, ac yn ateb unrhyw gwestiynau a oedd gen i. Roeddwn i’n gallu ceisio cyngor a chefnogaeth, a chynigiodd ganllawiau a gwybodaeth syml iawn.”"
        },
        {
            "text": "Mae’r busnes wedi cadw mewn cysylltiad â’u Swyddog Iechyd yr Amgylchedd ers y dechrau’n deg, yn enwedig pan gafodd bocs ceffylau Llaeth Llanfair ei barcio ym mhentref bwyd yr Eisteddfod Genedlaethol yn 2022. Gwnaethant ofyn am gyngor ar sut i gadw eu cwsmeriaid yn ddiogel a sicrhau bod y llaeth yr oeddent yn ei botelu ymlaen llaw yn ddiogel i’w yfed."
        },
        {
            "text": "Tua 4-6 wythnos ar ôl lansio’r busnes, wynebodd Laura her hylendid gyda’r poteli opteg surop ysgytlaeth a osodwyd yn y fan. Wrth ddisgrifio’r her honno, dywedodd Laura:"
        },
        {
            "text": "“Cysylltodd ein Swyddog Iechyd yr Amgylchedd â ni i roi gwybod am ddigwyddiad (incident) mewn ardal arall, lle roedd pobl wedi bod yn rhoi’r suropau yn syth yn eu cegau. Roedd yn rhaid i ni greu bocs i orchuddio’r poteli opteg. Erbyn hyn, dim ond lle i botel laeth neu gwpan oddi tano sydd.”"
        },
        {
            "heading": 3,
            "text": "Gallant roi sicrwydd i chi os ydych yn gofyn amdano"
        },
        {
            "text": "Cyngor Laura i entrepreneuriaid eraill sydd am werthu eu cynhyrchion yn uniongyrchol i’r cyhoedd yw:"
        },
        {
            "text": "“Gwnewch yn siŵr eich bod yn ceisio cyngor cyn mynd amdani. Peidiwch byth â bod ofn cysylltu â’ch Swyddog Iechyd yr Amgylchedd. Maen nhw yno i helpu a gwneud yn siŵr eich bod chi’n gwneud pethau’n iawn a bod eich cynhyrchion o’r safon uchaf.” Meddai, “mae’n debygol eich bod chi’n poeni am rywbeth yn ddiangen – gofynnwch am sicrwydd a chyngor a gallant eu rhoi i chi.”"
        },
        {
            "text": "Pan ofynnon ni i Laura a oedd unrhyw beth y gallent fod wedi’i wneud yn wahanol, atebodd hi “ystafell basteureiddio fwy!”. Mae’r busnes wedi bod yn boblogaidd iawn ymhlith y gymuned leol ac mae eu cwsmeriaid wir yn mwynhau llaeth ffres o’u fferm."
        },
        {
            "text": "I gael rhagor o wybodaeth am sut i gadw’ch busnes ar y trywydd iawn a chadw defnyddwyr yn ddiogel ar yr un pryd, ewch i’n hyb canllawiau busnes. Fel arall, ewch i’n canllaw hwylus i’r rhai sy’n dechrau busnes bwyd newydd."
        }
    ]
}