{
    "url": "https://socialcare.blog.gov.uk/2023/05/04/mental-health-and-deaf-awareness-week/",
    "title": "Mental health and Deaf Awareness Week",
    "authors": [
        "Clare Shard",
        "Victoria Hamilton"
    ],
    "categories": [
        "Care and support",
        "Mental health"
    ],
    "pub_date": "2023-05-04T16:16:34+00:00",
    "content": [
        {
            "heading": 2,
            "text": "More information to avoid misdiagnosis"
        },
        {
            "text": "Victoria Hamilton: One of the biggest challenges to providing effective mental health treatment to the deaf community is misdiagnosis of deaf people by professionals unfamiliar with deaf mental health care."
        },
        {
            "text": "Deaf people’s access to information can be an issue as there aren’t always the necessary resources, such as British Sign Language (BSL) patient leaflets and interpreters aren’t always available to help withGP appointments."
        },
        {
            "text": "Very often some of the underlying causes of mental health difficulties can be more difficult to resolve for deaf people. For example, with loneliness and isolation, when they return to the community there is a risk they will relapse due to a return to similar circumstances as there is a lack of community provision for deaf mental health and social networks."
        },
        {
            "text": "Often patients get ‘stuck’ in services and experience delayed discharges due to lack of available community placements."
        },
        {
            "text": "In terms of how these challenges can be overcome, at a societal level we need better education for deaf people, better access to health information, more BSL interpreters and we need to encourage more people to become trained in deaf awareness and BSL within primary care settings. It would be helpful to have more published research about deaf mental healthcare, more validated assessment tools, and of course, more community services for deaf people."
        },
        {
            "heading": 2,
            "text": "Adapting to the needs of deaf people"
        },
        {
            "text": "Within Cygnet Hospital Bury we make sure our care planning and support is individualised and we attempt to meet each patient’s communication needs. For example, we make BSL DVDS, live action and filmed role plays and BSL signed picture visuals."
        },
        {
            "text": "In terms of whether treatment provided to deaf people is any different to that provided to the hearing community, treatment often needs adapting due to language barriers and this ideally would be delivered in first language rather than via interpreters."
        },
        {
            "text": "There are often assumptions that deaf people have a certain level of understanding. For example, understanding of the Law and Criminal Justice System and concepts like ‘symptoms’ can be limited, as these are never taught to deaf people. In hearing culture, these terms are often learned through watching TV or overhearing conversations between others."
        },
        {
            "text": "Due to high comorbidity of developmental disorders and other associated difficulties e.g. language deprivation syndrome, treatment phases can last much longer for deaf inpatients. They may require shorter sessions or more sessions and repetition to learn concepts."
        },
        {
            "heading": 2,
            "text": "Collaboration and empowerment"
        },
        {
            "text": "Clare Shard: Cygnet Deaf services is one of the longest serving departments at Bury. The Interpreting team are part of the original provision established in 2001 and we have adapted and grown as the hospital site has expanded."
        },
        {
            "text": "The Interpreting and Translation team are proud to be able to work closely with all our colleagues on site, in particular the multi-disciplinary teams of the wards who have deaf patients."
        },
        {
            "text": "We make sure we work collaboratively to make sure access to assessment, treatment and therapy for service users, plus information and training for deaf professionals, is delivered to a very high standard."
        },
        {
            "text": "Empowerment is important to everyone involved in care, including the service users, their families, loved ones and care workers. Empowering service users enables them to have greater understanding of how to navigate the health care system and with this knowledge they can confidently ask for the information they need."
        }
    ]
}