{
    "url": "https://food.blog.gov.uk/2023/05/04/swig-smoothies-healthy-drinks-van-gets-haccp-help-from-eho/",
    "title": "Swig Smoothies - Healthy drinks van gets HACCP help from EHO",
    "authors": [
        "Here to Help"
    ],
    "categories": [
        "Case studies"
    ],
    "pub_date": "2023-05-04T09:31:30+01:00",
    "content": [
        {
            "text": "Cymraeg"
        },
        {
            "text": "We spoke to Tom from Swig Smoothies in Caernarfon, Gwynedd. This blog is part of our Here to Help series, making it easier for businesses to do the right thing through business stories, resources and our improved hub of business guidance on our website."
        },
        {
            "text": "Tom sells smoothies from a van at festivals and markets 6-7 days a week between April and October, and in the winter months, he goes into schools, making smoothies and teaching about healthy eating. From humble beginnings, Tom now employs nine part-time staff in his mobile smoothie business, which he likens to an “ice cream van, but for smoothies”. Given the unique nature of Swig Smoothies’ business model, it was difficult to know what to do at the start. Tom says, “There wasn’t such a thing as a smoothie van in the whole of Wales… so getting information about legislation was difficult, there wasn’t a category for a smoothie van.”"
        },
        {
            "text": "Tom reached out to his “local authority straight away before starting anything” as he “wanted everything to be above board.” Once he’d spoken to them, he initially delivered smoothies to people’s houses to establish whether there was enough demand for smoothies in the area."
        },
        {
            "text": "When Tom made the decision to go ahead with the business, he informed the local authority, letting them know he would be moving the business to a van at the start of 2021. They advised on the requirements needed in the van. “Basic stuff about hygiene”, according to Tom, which included a separate sink for handwashing and allocating appropriate space for waste in the van. When designing the van layout Tom says, “We thought about all the legal side of it and the management of that first before thinking about anything with branding or how anything would look”."
        },
        {
            "heading": 3,
            "text": "“They were generally very happy with it”"
        },
        {
            "text": "Despite being clear on his priorities and the importance of compliance, Tom describes his fears during the first inspection of the van. “We were a bit nervous because obviously as a new business, we've done all our reading, we just don't know if we haven't picked up on something”. He told us “We got a couple of pointers, especially with cleaning equipment, but they were generally happy with it.” Tom received a food hygiene rating of 5 and things have been “plain sailing” ever since."
        },
        {
            "text": "Tom is a big advocate for seeking advice. “Don't do things yourself if you're not competent,” he says. Tom describes how developing his Hazard Analysis and Critical Control Point (HACCP), part of his food safety management system was a learning curve. He received help from his Local Authority around tracing where the ingredients for his smoothies were coming from. He says “They gave us a thorough breakdown of what they like to see, what the A grade HACCP analysis is. They gave me a template to work on as well”. He soon realised how much easier it would be to use frozen fruit, advice which he says has actually made his smoothies taste better."
        },
        {
            "text": "For more information on how to keep your business on track whilst keeping consumers safe head to our business guidance hub. Alternatively, head to our easy-to-navigate guide for those starting up a new food business. "
        },
        {
            "heading": 1,
            "text": "Swig Smoothies: Fan diodydd iach yn cael cymorth ar HACCP gan Swyddog Iechyd yr Amgylchedd"
        },
        {
            "text": "Sgwrs gyda Tom o Swig Smoothies yng Nghaernarfon, Gwynedd. Mae’r blog hwn yn rhan o’n cyfres Yma i Helpu, sy’n ei gwneud hi’n haws i fusnesau wneud y peth iawn trwy rannu straeon gan fusnesau, adnoddau, a’n hyb o ganllawiau i fusnesau ar ein gwefan: www.food.gov.uk/cy/yma-i-helpu"
        },
        {
            "text": "Mae Tom yn gwerthu smwddis o fan mewn gwyliau a marchnadoedd, a hynny 6-7 diwrnod yr wythnos rhwng mis Ebrill a mis Hydref. Yn ystod misoedd y gaeaf, mae’n ymweld ag ysgolion, yn paratoi smwddis ac yn addysgu plant am fwyta’n iach. Mae Tom wedi adeiladu ei fusnes o ddim, ac erbyn hyn mae’n cyflogi naw aelod o staff rhan-amser yn ei fusnes smwddi symudol. Mae’n disgrifio ei fusnes fel “fan hufen iâ, ond ar gyfer smwddis”. Oherwydd natur unigryw model busnes Swig Smoothies, roedd yn anodd iddo wybod beth i'w wneud ar y dechrau. Meddai Tom, “Doedd dim y fath beth â fan smwddis yng Nghymru o gwbl… felly roedd hi’n anodd cael gwybodaeth am ddeddfwriaeth. Doedd dim categori ar gyfer fan smwddis.”"
        },
        {
            "text": "Trodd Tom at ei “awdurdod lleol yn y lle cyntaf, cyn dechrau ar unrhyw beth” gan ei fod “eisiau i bob dim fod yn ei le”. Ar ôl siarad â’r awdurdod lleol, dechreuodd ddosbarthu smwddis i gartrefi i weld a oedd digon o alw am smwddis yn yr ardal."
        },
        {
            "text": "Pan benderfynodd Tom fwrw ymlaen â’r busnes, cysylltodd â’r awdurdod lleol, gan roi gwybod y byddai’n symud y busnes i fan ddechrau 2021. Cafodd gyngor gan yr awdurdod lleol ar y gofynion y byddai angen eu bodloni o ran y fan, gan gynnwys cyngor ar “bethau sylfaenol yn ymwneud â hylendid”. Yn ôl Tom, roedd hyn yn cynnwys sinc ar wahân ar gyfer golchi dwylo a neilltuo lle priodol ar gyfer gwastraff yn y fan. O ran cynllunio’r fan, meddai Tom, “ein hystyriaeth gyntaf oedd rheoli’r ochr gyfreithiol, cyn dechrau meddwl am unrhyw beth yn ymwneud â brandio neu sut fyddai unrhyw beth yn edrych”."
        },
        {
            "heading": 3,
            "text": "“Ar y cyfan, roedden nhw’n hapus iawn ag ef”."
        },
        {
            "text": "Er ei fod yn glir ynghylch ei flaenoriaethau a phwysigrwydd cydymffurfio â’r ddeddfwriaeth, mae Tom yn disgrifio’i bryder yn ystod yr arolygiad cyntaf o’r fan. “Roedden ni braidd yn nerfus oherwydd, yn amlwg, fel busnes newydd, rydyn ni wedi darllen yr holl wybodaeth angenrheidiol, ond dydyn ni ddim yn gwybod a ydyn ni wedi camddeall rhywbeth”. Dywedodd “gwnaethon nhw ambell awgrym, yn enwedig o ran offer glanhau, ond ar y cyfan roeddent yn hapus.” Cafodd Tom sgôr hylendid bwyd o 5 ac mae pethau wedi mynd o nerth i nerth ers hynny."
        },
        {
            "text": "Mae Tom yn credu’n gryf mewn gofyn am gyngor. “Peidiwch â gwneud pethau eich hun os nad ydych chi'n gymwys” meddai. Mae Tom yn disgrifio sut aeth ati i ddatblygu system Dadansoddi Peryglon a Phwyntiau Rheoli Critigol (HACCP) fel rhan o’i system rheoli diogelwch bwyd, gan ddweud y bu’n rhaid iddo ddysgu llawer o bethau newydd wrth wneud. Cafodd gymorth gan ei awdurdod lleol yn ymwneud ag olrhain o ble roedd y cynhwysion ar gyfer ei smwddis yn dod. Meddai: “Cawsom ddadansoddiad trylwyr ganddynt o’r hyn maen nhw’n hoffi ei weld, a beth yw’r dadansoddiad gradd A o ran HACCP. Gwnaethon nhw roi templed i mi weithio arno hefyd”. Sylweddolodd yn fuan gymaint yn haws fyddai defnyddio ffrwythau wedi’u rhewi. Mae Tom yn dweud bod y cyngor hwn wedi gwella blas ei smwddis."
        },
        {
            "text": "I gael rhagor o wybodaeth am sut i gadw’ch busnes ar y trywydd iawn a chadw defnyddwyr yn ddiogel ar yr un pryd, ewch i’n hyb canllawiau busnes. Fel arall, ewch i’n canllaw hwylus i’r rhai sy’n dechrau busnes bwyd newydd."
        }
    ]
}