{
    "url": "https://food.blog.gov.uk/2023/05/04/the-little-korean-the-northeasts-korean-food-stall-that-went-from-pastime-to-full-time/",
    "title": "The Little Korean – The Northeast’s Korean food stall that went from pastime to full time",
    "authors": [
        "Here to Help"
    ],
    "categories": [
        "Case studies"
    ],
    "pub_date": "2023-05-04T09:33:33+01:00",
    "content": [
        {
            "text": "Cymraeg"
        },
        {
            "text": "We spoke to Matthew who runs a Korean food business, The Little Korean, selling hot food, meals to cook at home, and ready-to-eat cold food in the north-east of England. "
        },
        {
            "text": "This blog is part of our Here to Help series, making it easier for businesses to do the right thing through business stories, resources and our improved hub of business guidance on our website."
        },
        {
            "text": "Matthew tells us how despite beginning with no catering experience, he was able to draw from the experience of his wife, who was born in Korea. Her parents had passed recipes down through the generations. When his wife arrived in the Northeast of England, they struggled to find great Korean food options and nowhere was “up to scratch”. Seizing the gap in the market, they thought, “Why don’t we start it up and introduce people in the area to Korean food?”."
        },
        {
            "heading": 3,
            "text": "“There’s a lot of information on this”"
        },
        {
            "text": "When starting to take the business more seriously and transitioning from a hobby, Matthew “spent the weekends looking into everything”. He “took all the hygiene qualifications as well, level 2 and 3”, however, he says that “the main thing we realised when we started to read into the things we didn’t know, was that there’s a lot of information on this. We’re not from a catering background ourselves, so we didn’t have any experience or knowledge of how to do things safely or what the laws are surrounding it or what processes we have to follow.”"
        },
        {
            "text": "Matthew sought advice from his local council right from the outset and had an Environmental Health Officer (EHO) visit before he had even had the kitchen fitted. The EHO advised on the equipment and what specifications they would need to maintain food standards and hygiene. A self-described “worrier”, Matthew says that having had the EHO come out to advise on what the kitchen needed made the first inspection once the kitchen was built feel “less daunting”.  Matthew’s business needed a 5 rating to be able to trade at a local farmers’ market, so it was important he got things right first time. Matthew says there was “nothing specific” that he was worried about, just that “maybe he’d misunderstood something”."
        },
        {
            "heading": 3,
            "text": "“Felt much more relaxed almost instantly”"
        },
        {
            "text": "Speaking about his first inspection, Matthew shared that the inspector was “very friendly, very approachable, and sort of took me through everything. Gave me advice on where we can improve, and stuff that you can think about changing.” For example, “Where you do this, it’s not a problem, but if you do it this way it might be easier.” Matthew “felt much more relaxed almost instantly”. He puts the initial anxiety down to not knowing the process and fearing the worst. When in reality, “the EHO looked at our documents and looked around the kitchen. Then he asked us a couple of questions about how we do things. That was it really. Afterwards, they just wrote down a few suggestions for how we could improve. It was fairly straightforward, fairly pain-free.”"
        },
        {
            "text": "Matthew continued his relationship with his EHO, reaching out for support when required. For example, when unsure around labelling laws following the introduction of Natasha’s law, the EHO reassured Matthew and put him in contact with someone at Trading Standards who was able to offer yet more support."
        },
        {
            "text": "The Little Korean continues to serve Farmers markets in the Northeast, and in the words of Matthew “People are enjoying it; it seems to be popular”. When prompted to give some advice to businesses taking their first steps, Matthew says “I would definitely suggest getting them to do what we did. Get the EHO out for a preliminary visit, if their EHOs would be happy to… it puts you at ease about what you’re doing, they can point out anywhere that you need to rethink or where your knowledge is lacking, so I’m really glad that we did that, it was really helpful.”"
        },
        {
            "text": "For more information on how to keep your business on track whilst keeping consumers safe head to our business guidance hub. Alternatively, head to our easy-to-navigate guide for those starting up a new food business. "
        },
        {
            "heading": 1,
            "text": "The Little Korean – Stondin yn gwerthu bwyd nodweddiadol o Ogledd-ddwyrain Corea: hobi yn troi’n fusnes"
        },
        {
            "text": "Sgwrs â Matthew, sy’n rhedeg busnes bwyd “The Little Korean” yng Ngogledd-ddwyrain Lloegr, sy’n gwerthu bwyd poeth, prydau i’w coginio gartref, a bwyd oer parod i’w fwyta. "
        },
        {
            "text": "Mae’r blog hwn yn rhan o’n cyfres Yma i Helpu, sy’n ei gwneud hi’n haws i fusnesau wneud y peth iawn trwy rannu straeon ac adnoddau busnes yn ogystal â chanllawiau busnes ar ein gwefan: www.food.gov.uk/cy/yma-i-helpu"
        },
        {
            "text": "Mae Matthew yn esbonio nad oedd ganddo unrhyw brofiad o’r maes arlwyo i ddechrau, ond ei fod wedi manteisio ar brofiad ei wraig, a aned yng Nghorea. Roedd hi wedi etifeddu ryseitiau teulu a drosglwyddwyd i lawr drwy’r cenedlaethau. Pan ddaeth ei wraig i Ogledd-ddwyrain Lloegr, doedden nhw ddim yn gallu dod o hyd i fwyd da o Gorea. Doedd unman yn gwerthu bwyd digon da. Gwelson nhw fwlch yn y farchnad, a gwnaethon nhw fanteisio arno gan feddwl, “Pam na wnawn ni gychwyn busnes a chyflwyno bwyd Corea i bobl yr ardal?”."
        },
        {
            "heading": 3,
            "text": "“Mae llawer o wybodaeth am hyn”"
        },
        {
            "text": "Wrth ddechrau mynd ati o ddifri gyda’r busnes, treuliodd Matthew ei benwythnosau yn meddwl am bopeth. Cymerodd yr holl gymwysterau hylendid hefyd, ar lefel 2 a 3, ond mae’n dweud mai’r “prif beth wnaethon ni sylweddoli pan ddechreuon ni ddarllen i mewn i’r pethau doedden ni ddim yn eu gwybod, oedd bod yna lawer o wybodaeth ar gael. Dydyn ni ddim yn dod o gefndir arlwyo, felly doedd gennym ni ddim profiad na gwybodaeth am sut i wneud pethau’n ddiogel na’r ddeddfwriaeth berthnasol na’r prosesau y mae’n rhaid i ni eu dilyn.”"
        },
        {
            "text": "Gofynnodd Matthew am gyngor ei awdurdod lleol o’r cychwyn cyntaf a chafodd ymweliad gan Swyddog Iechyd yr Amgylchedd, a hynny cyn iddo osod y gegin hyd yn oed. Cafodd gyngor gan y Swyddog ar yr offer y byddai eu hangen a pha fanylebau y byddai angen eu bodloni er mwyn cynnal safonau a hylendid bwyd. Mae Matthew yn disgrifio’i hun fel rhywun sy’n poeni, ond dywedodd fod y ffaith bod Swyddog Iechyd yr Amgylchedd wedi ymweld ag ef i’w gynghori ar yr anghenion o ran y gegin yn y cychwyn cyntaf, wedi gwneud i’r arolygiad cyntaf ar ôl adeiladu’r gegin deimlo’n “llai brawychus”. Roedd angen i fusnes Matthew gael sgôr o 5 er mwyn gallu masnachu mewn marchnad ffermwyr leol, felly roedd yn bwysig ei fod yn cael pethau’n iawn o’r dechrau. Nid oedd Matthew’n poeni am unrhyw beth yn benodol, heblaw’r posibilrwydd y gallai fod “wedi camddeall rhywbeth”."
        },
        {
            "heading": 3,
            "text": "“Roeddwn i’n teimlo’n well o lawer bron yn syth”"
        },
        {
            "text": "Wrth siarad am ei arolygiad cyntaf, dywedodd Matthew fod yr arolygydd yn “gyfeillgar iawn, yn hawdd iawn mynd ato. Gwnaeth e egluro popeth. Ces i gyngor o ran sut i wella, a phethau gallwn i ystyried eu newid”. Er enghraifft, “does dim problem gyda hyn, ond efallai byddai’n haws i chi ei wneud e fel hyn.” Roedd Matthew “yn teimlo’n well o lawer bron yn syth”. Y rheswm dros ei bryder cychwynnol oedd peidio â bod yn gyfarwydd â’r broses ac ofni’r gwaethaf. Ond mewn gwirionedd, “edrychodd y swyddog ar ein dogfennaeth ni ac edrychodd o gwmpas y gegin. Yna, gofynnodd ambell gwestiwn i ni am sut rydyn ni’n mynd ati i wneud gwahanol bethau. Dyna’r cyfan oedd hi mewn gwirionedd. Ar ôl hynny, nododd ychydig o awgrymiadau ar gyfer gwella ar bapur. Roedd yn weddol syml, ac yn gymharol ddi-boen.”"
        },
        {
            "text": "Mae’r berthynas rhwng Matthew a’i Swyddog Iechyd yr Amgylchedd wedi parhau, ac mae’n gofyn iddo am gymorth pan fydd angen. Er enghraifft, pan oedd yn ansicr am ddeddfau labelu ar ôl i gyfraith Natasha gael ei chyflwyno, cafodd Matthew dawelwch meddwl wrth siarad â’r Swyddog Iechyd yr Amgylchedd, a wnaeth ei roi mewn cysylltiad â rhywun o’r adran safonau masnach, a oedd yn gallu cynnig mwy fyth o gymorth iddo."
        },
        {
            "text": "Mae Little Korean yn parhau i wasanaethu marchnadoedd ffermwyr yng Ngogledd-ddwyrain Lloegr ac, yng ngeiriau Matthew, “mae pobl yn mwynhau’r bwyd; mae i’w weld yn boblogaidd”. Pan ofynnwyd iddo gynnig gair o gyngor i fusnesau sy’n cymryd eu camau cyntaf, dywedodd Matthew “byddwn yn bendant yn awgrymu y dylen nhw wneud beth wnaethom ni. Gofynnwch i’r Swyddog Iechyd yr Amgylchedd fyddai’n fodlon dod am ymweliad rhagarweiniol... mae’n tawelu eich meddwl ynglŷn â’r hyn chi’n ei wneud. Mae’r swyddog yn gallu tynnu sylw at unrhyw beth sydd angen i chi ei ailystyried neu nodi bylchau yn eich gwybodaeth. Rwy’n falch iawn ein bod ni wedi gwneud hynny, roedd yn hynod ddefnyddiol.”"
        },
        {
            "text": "I gael rhagor o wybodaeth am sut i gadw’ch busnes ar y trywydd iawn a chadw defnyddwyr yn ddiogel ar yr un pryd, ewch i’n hyb canllawiau busnes. Fel arall, ewch i’n canllaw hwylus i’r rhai sy’n dechrau busnes bwyd newydd."
        }
    ]
}