{
    "url": "https://educationhub.blog.gov.uk/2023/05/04/when-are-year-6-sats-2023-key-dates-for-parents-and-pupils/",
    "title": "When are year 6 SATs 2023? Key dates for parents and pupils",
    "authors": [
        "mediaofficer"
    ],
    "categories": [
        "Schools"
    ],
    "pub_date": "2023-05-04T16:50:04+01:00",
    "content": [
        {
            "text": "Year 6 pupils in England will soon be taking the key stage 2 (KS2) national curriculum tests, which are often referred to as SATs.  "
        },
        {
            "text": "The assessments are used to measure school performance and to make sure individual pupils are being supported in the best way possible as they move into secondary school.  "
        },
        {
            "heading": 3,
            "text": "When are SATs? "
        },
        {
            "text": "This year, SATs will take place over four days from 9 May to 12 May 2023. The timetable is as follows:  "
        },
        {
            "heading": 3,
            "text": "What are the tests on?  "
        },
        {
            "text": "While pupils won’t be able to see what’s on the test beforehand, the assessments only include questions on things that children should already have been taught as part of the national curriculum.  "
        },
        {
            "text": "You can find past papers on GOV.UK. "
        },
        {
            "text": "As usual, there won’t be a test for English writing or science. Instead, this will be reported as a teacher assessment judgement.  "
        },
        {
            "text": "This is a judgement teachers will make based on your child’s work at the end of KS2.  "
        },
        {
            "heading": 3,
            "text": "Does my child need to revise for SATs?  "
        },
        {
            "text": "Children shouldn’t be made to feel any unnecessary pressure when it comes to the KS2 assessments and teachers will make sure that all pupils in their class are prepared.  "
        },
        {
            "text": "You should follow their general advice about supporting your child’s education throughout the year and ahead of the tests. "
        },
        {
            "text": "While it is statutory for schools to hold the assessments, headteachers make the final decision about whether a pupil participates in them.  "
        },
        {
            "text": "Some pupils – for example those with special education needs or disabilities – may be assessed under different arrangements if these are more appropriate.  "
        },
        {
            "text": "If you have concerns about your child participating in the KS2 tests, you should speak to your school in the first instance. "
        },
        {
            "heading": 3,
            "text": "When will we find out the results of SATs? "
        },
        {
            "text": "Schools will receive test results on Tuesday 11 July 2023.  "
        },
        {
            "text": "Before the end of the summer term, your child’s school will send you a report which will include test results and teacher assessment judgements. "
        },
        {
            "text": "This should provide you with a good sense of the standard at which your child is working in each subject. "
        },
        {
            "text": "The school will report your child’s test results as a scaled score for each subject. This is created from the number of marks your child scores in a particular test. A scaled score: "
        },
        {
            "text": "If your child is working below the overall standard of the key stage, or they have special educational needs, reporting will be different, and you should speak to your child’s teacher for more information. "
        },
        {
            "text": "You can also find more information about results at the end of key stage 2 on GOV.UK. "
        }
    ]
}