{
    "url": "https://ipa.blog.gov.uk/2023/06/21/a-week-in-the-life-project-delivery-advisor/",
    "title": "A week in the life of a project delivery advisor",
    "authors": [
        "Lydia Randall"
    ],
    "categories": [
        "Construction",
        "Infrastructure",
        "Major Projects",
        "Project Delivery",
        "Uncategorized"
    ],
    "pub_date": "2023-06-21T12:40:09+01:00",
    "content": [
        {
            "text": "Lydia Randall tells us about a typical week as an IPA Project Delivery Advisor for major defence programmes, and why she chose to work in government project delivery. "
        },
        {
            "text": "What is a project delivery advisor?"
        },
        {
            "text": "I joined the IPA in April 2021, bringing a wealth of experience in project delivery from both New Zealand and the UK. My role as a Project Delivery Advisor allows me to support the British Army's largest and most complex major programmes. I work hand in glove with the Senior Responsible Owners (SROs) and their project teams to provide advice and support, focusing on driving better and more informed decision making, to improve the likelihood of project success."
        },
        {
            "text": "What does a typical week look like?"
        },
        {
            "text": "A typical week as a Project Delivery Advisor in defence is anything but typical. The IPA is an organisation that embraces empowerment, collaboration and recognition of the unique skill set that each individual brings to the role. Therefore, I am blessed with significant self-governance, balancing my personal workload, support from colleagues and ensuring personal health and wellbeing. This is all while finding a way to best support Defence project delivery. "
        },
        {
            "text": "I began my week by attending the British Army Expo hosted on Salisbury Plain Training Area (Copehill Down). I received first-hand insight into the modern British Army and viewed some of the cutting-edge capabilities and upgrades planned for its equipment programmes. I was also fortunate enough to travel from London to Salisbury in style - on the renowned Chinook Helicopter. During the flight, I spoke with the RAF Aircrew and Army personnel to hear how the Government Major Projects Portfolio’s (GMPP) Chinook Capability Sustainment Programme, which seeks to deliver the British Army a 14 new-build Chinook H-47 aircraft, will provide innovative technology that enables the RAF, Army and Ministry of Defence to meet its strategic outcomes. "
        },
        {
            "text": "Following the day out in Salisbury, I was back at the IPA London office on Tuesday to meet with my Treasury (HMT) and Cabinet Office (CO) colleagues in preparation for my fortnightly visit to Army Headquarters in Andover. I worked with HMT and CO to understand key concerns across the portfolio and to share project updates in relation to IPA assurance activities. The day concluded with a session with my mentor where I talked through progress against my career objectives and my plan of action to achieve these. "
        },
        {
            "text": "On Wednesday, I took the Great Western Railway from London down to Army Headquarters in Andover. With a number of face-to-face meetings in the diary, I worked alongside a number of project teams to drill down on specific programme challenges, risks and issues. Ensuring the IPA provides the right support, at the right time, to drive performance improvements is critical to the work we do. The support I provide programmes may include the provision of embedded IPA expertise to resolve gritty programme issues or IPA associate support to provide expertise on governance, organisational design or even the recruitment of project delivery professionals to support key activities."
        },
        {
            "text": "The final two days of my work week were spent organising IPA assurance reviews for two critical programmes and the completion of my pre-reading for a forthcoming project management training as part of IPA’s plethora of learning and development opportunities. The IPA assurance reviews are an essential element of successful project delivery. The aim of these reviews is to provide insights to the SRO, CO and HMT on the delivery confidence and readiness of a programme as it progresses through a major decision point. Depending on the type of review and stage of the programme, the review might have a focus on governance, commercial, finance, or resources. This is agreed upon between myself and the SRO prior to the review. "
        },
        {
            "text": "What’s the best thing about working for the IPA?"
        },
        {
            "text": "I discovered early on that this was an organisation that nurtured individuality and encouraged project delivery advisors to make the role their own. It is an organisation that magnifies an individual’s strengths, and actively promotes a breadth of learning and development opportunities to excel capabilities to support major project delivery. In this role, I am truly at the heart of government's biggest and most complex projects and programmes, providing advice and support that is making a tangible and positive contribution to major project delivery in the UK."
        },
        {
            "text": "More about IPA"
        },
        {
            "text": "The IPA is the government’s centre of expertise for infrastructure and major projects. The IPA primarily focuses on the GMPP which comprises the UK Government’s largest and most complex projects. With a tag-line of ‘nothing less than world-class delivery’, the organisation sits at the heart of the UK Government, reporting to the CO and HMT. The IPA is cross-functional, with a team of experts in project delivery, finance and commercial who work across departments and industry to help improve project delivery.  "
        },
        {
            "text": "Does a role in project delivery appeal to you? The IPA Project Delivery Team leading challenge and support to DLUHC. team is recruiting a Project Delivery Advisor. Click here to find out more."
        },
        {
            "text": "To learn more about the IPA, click here. "
        }
    ]
}