{
    "url": "https://dwpdigital.blog.gov.uk/2023/06/21/designing-our-delivery-standards-1-0/",
    "title": "Designing our delivery standards 1.0",
    "authors": [
        "Barry Traish"
    ],
    "categories": [
        "Agile development",
        "Digital Delivery",
        "Digital With Purpose"
    ],
    "pub_date": "2023-06-21T11:11:27+01:00",
    "content": [
        {
            "text": "Service and project delivery is about solving problems and helping teams work together to get things done. Delivery can be done in lots of different ways, and needs to be tailored to the product, the team delivering it, and the organisation they work in. Some teams work better using agile methodology, some prefer waterfall, and others can use a blended approach. "
        },
        {
            "text": "Our delivery colleagues have created a set of standards that give us a shared understanding of delivery across the organisation. Head of agile delivery, Barry Traish, outlines the standards and suggests ways you can apply them to your own projects. "
        },
        {
            "heading": 2,
            "text": "Use the most appropriate delivery method "
        },
        {
            "text": "Agile is the go-to methodology for many people involved in delivery, but is it always the right way to approach a problem? You need a deep understanding of whether a problem is ‘complicated’ or ‘complex’, and whether you need to learn and adapt as you go. "
        },
        {
            "text": "In the Cynefin framework, a problem is ‘complicated’ when you know the solution up front, its requirements are unlikely to change, and you’ve done similar things before. A problem is ‘complex’ when the solution is unknown, requirements are unclear, or they’re subject to change. "
        },
        {
            "text": "It’s important to choose the right approach to ensure you understand the problem and that the right thing is delivered, at the right time, cost and quality. Different types of problems need different approaches. "
        },
        {
            "text": "Most problems we face in DWP Digital are complex, because the world we live in is inherently Volatile, Uncertain, Complex and Ambiguous (VUCA). But if we have high confidence in what we will deliver then agile is an unnecessary overhead. "
        },
        {
            "heading": 2,
            "text": "Continuously improve your ways of working and delivery outcomes "
        },
        {
            "text": "Your team should take regular opportunities to reflect on and adapt their ways of working throughout the life of the delivery. Team health checks, sprint retrospectives and lessons learned help you do this. "
        },
        {
            "text": "Team health checks give you empirical data that help you understand and improve how the team is feeling and working. They also give you a balanced assessment on the effectiveness of a team and how they can deliver. "
        },
        {
            "text": "There is no single way to run a retrospective, and there are many resources with ideas and advice, but there are some common principles. They should always generate a small number of actions, which are completed and visibly tracked. "
        },
        {
            "text": "Retrospectives should be done regularly – no less than once every four weeks. Not doing regular retros is a serious indicator of poor team health. "
        },
        {
            "heading": 2,
            "text": "Deliver value early "
        },
        {
            "text": "Everyone in the team should understand the value of what they are working on, including how we measure value. They should have a clear purpose and direction, with an understanding of how their work connects to the aims of the delivery.  "
        },
        {
            "text": "Put a working product in front of your customers as early as possible, as part of a phased delivery approach. This significantly lowers delivery risk and increases confidence. In agile, this may be through prototyping, Minimum Viable Products and iteration. In waterfall, it’s done through sharing designs and phasing deliverables. "
        },
        {
            "heading": 2,
            "text": "Work in the open "
        },
        {
            "text": "Transparency builds trust. Collaborate by being open, honest and transparent, constantly collaborating with your stakeholders, and regularly demonstrate progress towards your shared outcomes. "
        },
        {
            "text": "Consider embedding a stakeholder representative in your team. Be realistic about both forecasts and progress – agreeing to arbitrary deadlines, reporting optimistically and then having to reset baselines helps nobody. "
        },
        {
            "text": "Within the team, draw up a team charter to create a shared understanding of your team’s working principles, and your commitment to each other. "
        },
        {
            "text": "Values are a core part of a culture. When people understand and live within shared values, they gain psychological safety, and the culture is conducive to teamwork and collaboration.  "
        },
        {
            "heading": 2,
            "text": "Understand your pace of delivery so you can deliver predictably "
        },
        {
            "text": "You should plan and forecast regularly, so you can set realistic expectations which you review, adjust and communicate, reflecting the pace and reality of delivery. "
        },
        {
            "text": "To do this, you need to set measures, and have access to your measurement data. Measuring progress and performance can: "
        },
        {
            "text": "Taking a data-driven approach to delivery removes subjectivity from planning and improves the quality of decision making. Data can be persuasive, help inform priorities and provide assurance. "
        },
        {
            "heading": 2,
            "text": "Manage your risks and dependencies "
        },
        {
            "text": "First, understand your risk appetite, then recognise that risk management is big. It takes time and skill to understand risk types and develop a risk strategy. "
        },
        {
            "text": "Aim to have a continuous cycle of identifying, reviewing and acting on risks and dependencies. This helps you to mitigate, remove, reduce, and accept risks and dependencies. "
        },
        {
            "text": "A risk could derail your delivery, so you need to recognise, monitor, and mitigate against it. If it isn’t managed, it’s likely to become an ‘Issue’ which will impact the delivery of your project. Remember, early delivery and transparency reduce risk. "
        },
        {
            "heading": 2,
            "text": "Apply appropriate governance "
        },
        {
            "text": "Governance is like the brakes on a car – without them you’d drive very slowly. Apply governance proportionately, recognising its need outside the team, building relationships to ensure efficient compliance.  "
        },
        {
            "text": "Governance will help you: "
        },
        {
            "text": "You may not get excited by it, but you should understand the context of governance, and challenge or adapt where appropriate. "
        },
        {
            "heading": 2,
            "text": "Champion the technical fundamentals "
        },
        {
            "text": "Attention to technical excellence and good design enhances and enables fast, high quality, user-centric, valuable, predictable delivery. Not everyone needs to be an expert in all these things, but make sure you’re considering them and using them to deliver better. "
        },
        {
            "text": "Use technical practices such as test automation, CICD pipelines, test driven design, cloud engineering, microservice architecture, DevOps, alerting, YAGNI and minimise tech debt.  "
        },
        {
            "text": "Use product and design practices such as accessible design, design thinking, prototyping, roadmaps, value stream mapping and user centred design. "
        },
        {
            "text": "Whatever your methodology, sticking to these principles will help you deliver effectively and develop your own understanding and expertise in delivering complex projects. "
        },
        {
            "text": "To summarise: "
        }
    ]
}