{
    "url": "https://openpolicy.blog.gov.uk/2023/06/21/manifest-what-we-have-learnt-so-far-from-artists-working-in-policy/",
    "title": "MANIFEST: What we have learnt so far from artists working in policy",
    "authors": [
        "Stephen Bennett",
        "amyramdehal"
    ],
    "categories": [
        "News",
        "Policy Lab"
    ],
    "pub_date": "2023-06-21T09:31:09+01:00",
    "content": [
        {
            "text": "Policy Lab has a history of bringing experimental and innovative approaches into policymaking. In January, we wrote about the launch of MANIFEST, our new experimental initiative to evaluate the role of art in policy. As part of MANIFEST, the Arts and Humanities Research Council (AHRC) has funded artists to spend time in departments. This allows us to test one of our experimental policy design methods launched last year - in particular to evaluate artistic approaches and effects relevant for policy, and how artists can work with policymakers to develop the policymaking process. "
        },
        {
            "text": "In our previous blog, we introduced the three artists participating in the programme. They have now spent time in three host policy teams, working closely with teams on topics including community ownership, the use of science and evidence in policy, and multiple disadvantage. We recently brought together the artists, policy professionals and other stakeholders in a discursive event to consider works-in-progress. This blog shows some of these artworks and begins to articulate lessons and benefits for the policymaking process."
        },
        {
            "text": "As part of MANIFEST, Christopher Samuel spent time with the Community Ownership Fund team at the Department for Levelling Up, Housing and Communities (DLUHC). This team develops policy for, administrates and evaluates a £150m scheme aimed at enabling people and groups in communities across the UK to purchase and save key local assets which are at risk of loss. "
        },
        {
            "text": "Christopher’s practice is rooted in identity and disability politics, often echoing the many facets of his own lived experience. He channelled this approach into an artwork which responded to a totemic part of the policymaking process: Christopher wrote his own Green Paper. Policy Green Papers are typically written in a collective manner, forged by many hands spanning multiple departments. By spinning this around, and taking a single, personal perspective - from an individual who has a unique set of life experiences - Christopher surfaced a number of questions. This included a playful yet powerful manifestation of the policy team’s concerns relating to equality of access to the Community Ownership Fund. But it also included broader questions, for example the role of subjectivity and lived experience in policymaking and even the appropriateness of long written mediums for communicating and engaging people on complex policy issues. Charis Long from the Community Ownership Fund policy team said of working with Chris: "
        },
        {
            "text": "Some of these themes were developed in Dryden Goodwin’s work. Dryden spent time with Changing Futures, a multiyear cross-government programme aiming to improve outcomes for adults experiencing multiple disadvantage – including combinations of homelessness, substance misuse, mental health issues, domestic abuse and contact with the criminal justice system. The programme is being delivered by DLUHC in partnership with other government departments, and Policy Lab has led a project as part of it to consider lived experience and systems change around multiple disadvantage. "
        },
        {
            "text": "Dryden combined drawings, filming and sound recordings to create two works. For A Day With Mark Dryden visited Mark in his temporary home, talking with him whilst simultaneously drawing him. Mark has experienced multiple disadvantage and spoke about his childhood experiences in and out of care, his many years spent in prison and his navigation of the support system whilst striving to sustain a new chapter in his life. With the drawings of different aspects of Mark’s face, eyes, ears, mouth and hands, Dryden created to-scale prints as a pack of cards, with quotes of Mark’s words on the reverse. "
        },
        {
            "text": "At the private show, video documentation of the encounter was viewable by scanning a QR code, allowing the viewer to return directly to moments in the day as the drawings were being made, in the flow of conversation. For Sphere(s) of Influence, Dryden drew pencil portraits whilst attending discussions at Changing Futures workshops. The 60 hand held studies of people involved in different areas of policy included those with lived experience of multiple disadvantage now or in the past. Displayed in a large circle they were accompanied by an animation of the drawings in different orders, shifting the attention from person to person, mirroring the dynamics of the conversations. "
        },
        {
            "text": "Policymakers reflected that these works had numerous impacts. The drawings provided a delicate reminder of the shared humanity of everyone involved in this policy challenge, sometimes lost in the complex organisation and distribution of resources and support. Portraits, by their very nature, often raise the prominence of individuals. Dryden’s, unusually, raised the prominence of individuals involved in different stages of a policy challenge, from those who are going through tough times, to the care and support workers who are so valued, to those looking to develop a better system of provision. One policy professional saw that Dryden’s multiple portraits of Mark captured the ambition of a \"whole person\" approach to support which considers people as individuals with a wide range of personal needs and ambitions. The depiction of Mark’s material environment, social infrastructure and even his dog was integral to this. Policymaker Jean Comrie said of the work:"
        },
        {
            "text": "Semiconductor (Ruth Jarman and Joe Gerhardt) were placed with the Foresight, Futures, and Emerging Technology team at the Government Office for Science, a team which focuses on the policy implications of medium-long term trends and scenarios for technology development and wider societal change. The duo developed a number of artworks which reflected upon how thinking about the long-term is incorporated into policy decisions today. This included thought-provoking maps of how humans have historically conceived of time, from a pre-industrial society who did not necessarily conceive of the ‘progress’ of time to our modern day knowledge of how neuro/cognitive processes enable future thinking. How might such constructions of time affect our approach to making policy? "
        },
        {
            "text": "Semiconductor also produced works which explored more specific policy topics which have significant future dimensions. One work asked AI to develop a policy for how AI should be regulated, whilst their Net/Not Zero drawing infused the decarbonisation policy challenge with the actual carbon emitted from a diesel exhaust to produce a heady and emotional visual motif. Tom Wells, Deputy Director in the Government Office for Science, said of his experience working with Semiconductor:"
        },
        {
            "text": "We are now working with our evaluation partners, the University of the Arts London, to learn lessons about the pilot year of this programme and dig into the question: can art play a role in policy? Whilst the initial results are promising, we will continue to explore and evaluate the impact of MANIFEST. In the meantime, we hope you will be able to see the artworks in real life, as we are planning to bring MANIFEST to a public audience in Sheffield later in the year. If you are interested in testing new methods for improving policy - from collective intelligence to prototyping, from digital twins to artistic approaches - please get in touch."
        }
    ]
}