{
    "url": "https://defrafarming.blog.gov.uk/2023/06/21/sfi-more-ways-to-enhance-your-income-productivity-and-the-environment/",
    "title": "SFI: more ways to enhance your income, productivity and the environment",
    "authors": [
        "The Team"
    ],
    "categories": [
        "environmental land management schemes",
        "Sustainable Farming Incentive"
    ],
    "pub_date": "2023-06-21T12:02:56+01:00",
    "content": [
        {
            "text": "This year, the Sustainable Farming Incentive (SFI) offer will be bigger and more flexible. "
        },
        {
            "text": "Today, we published the SFI Handbook on GOV.UK. It sets out all the actions we will pay for and the scheme's rules. "
        },
        {
            "text": "We’ve temporarily closed applications for SFI from today so we can get the new offer in place. We will start accepting applications for the new, expanded offer in a controlled rollout from August. "
        },
        {
            "text": "Now is a good time to learn how SFI can provide a steady income, help make your farm more productive and resilient and support you to produce food in a sustainable way. "
        },
        {
            "text": "In this post, we’ll summarise the information in the SFI Handbook."
        },
        {
            "heading": 2,
            "text": "Pick and mix actions  "
        },
        {
            "text": "SFI pays farmers for actions that support food production and can help improve farm productivity and resilience, while also protecting and improving the environment. "
        },
        {
            "text": "We previously grouped actions into standards. They were, in turn, grouped into levels. You had to complete all the actions in a level to get paid.  "
        },
        {
            "text": "When we open this year’s SFI offer for applications, things will be different. "
        },
        {
            "text": "You’ll be able to choose the actions you want to do and the area of land you wish to do them on. "
        },
        {
            "text": " There will be 23 actions for you to choose from. They cover: "
        },
        {
            "text": "You can combine as many actions to your agreement as you like. No minimum area of land is required. "
        },
        {
            "text": "You’ll also be able to add more actions and eligible land to your agreement each year. "
        },
        {
            "text": "For example, you can get £129 per hectare for your winter multi-species cover crop. If you have an integrated pest management plan on your farm, you can get £989 a year. You can also get paid for a range of other actions including field margins, corners and blocks, companion crops, legumes in grassland and managing hedgerows. "
        },
        {
            "text": "If you complete the actions, you’ll receive payment every 3 months. "
        },
        {
            "text": "You don’t need the permission of your landlord to apply for an agreement if you're a tenant farmer, and tenants can have an SFI agreement even if they are on a shorter, rolling tenancy contract. "
        },
        {
            "text": "Farmers across the country worked with us to devise and develop the actions so we can make sure they’re what people want and that there is something for every type of farm.  "
        },
        {
            "text": "How you carry out actions is up to you. We want to see the outcomes delivered and give you the flexibility to do that in the best way on your farm. We want to work with you to fix things if they go wrong. "
        },
        {
            "text": "We’re offering an annual management payment to cover the cost of signing up and taking part. The management payment is £20 per hectare, for up to 50 hectares of land entered into the scheme to a total of £1,000. "
        },
        {
            "heading": 2,
            "text": "Improving the scheme "
        },
        {
            "text": "By signing up for the SFI, you’ll see the benefits of our improvements to the scheme since it launched. "
        },
        {
            "text": "We’ve also: "
        },
        {
            "heading": 2,
            "text": "Countryside and Environmental Stewardship "
        },
        {
            "text": "You can have a Countryside Stewardship (CS) or Environmental Stewardship (ES) agreement and an SFI agreement at the same time. This means you can combine SFI actions with other scheme options. We just won’t pay you twice if you carry out the same action on the same piece of land. "
        },
        {
            "text": "The handbook we published today sets out the rules on how SFI actions can be combined with other actions on your land. "
        },
        {
            "text": "30 additional actions will be available in schemes in 2024. We published a full prospectus in January 2023 explaining what these will be and how much we will pay. "
        },
        {
            "text": "We will publish further details of all new and updated actions later this year. "
        },
        {
            "heading": 2,
            "text": "If you’re already an SFI agreement holder "
        },
        {
            "text": "If you already have an SFI agreement, the Rural Payments Agency (RPA) will write to you explaining the next steps. Letters will be sent today. "
        },
        {
            "text": "In short, if you’re already in SFI, you will be able to access the full 2023 offer. "
        },
        {
            "text": "You won’t be at any disadvantage because you entered the earlier version of the scheme and we will make the transition as seamless as possible for you. "
        },
        {
            "heading": 2,
            "text": "If you’re signing up for the first time "
        },
        {
            "text": "We’ve been working with farmers to make sure that the application process is clear and straightforward.  "
        },
        {
            "text": "If your land is eligible and the actions you pick are compatible, you’ll get an agreement. It's as simple as that. There’s no competition. The agreement will start the month after you accept it. "
        },
        {
            "heading": 2,
            "text": "A controlled rollout "
        },
        {
            "text": "We expect to begin a controlled rollout from August. This means we will ask people who want to apply to get in touch. The RPA will advise on your next steps and arrange for you to apply. "
        },
        {
            "text": "Initially, we will manage applications in a controlled way so that we can make sure everyone gets the service and support they need.  "
        },
        {
            "heading": 2,
            "text": "Get ready for SFI "
        }
    ]
}