{
    "url": "https://teaching.blog.gov.uk/2023/06/21/thank-you-teachers-for-all-of-your-hard-work-and-determination/",
    "title": "Thank you, teachers, for all of your hard work and determination!",
    "authors": [
        "Seana Henry",
        "Matthew Shanks"
    ],
    "categories": [
        "Inspiring teachers",
        "Primary schools",
        "Pupil wellbeing and behaviour",
        "Secondary schools",
        "Teacher wellbeing",
        "Uncategorized"
    ],
    "pub_date": "2023-06-21T10:30:15+01:00",
    "content": [
        {
            "text": "Seana Henry, headteacher at Belleville Wix Academy talks about how she grew up admiring teachers, and then became one herself. "
        },
        {
            "text": "Generations of amazing teachers  "
        },
        {
            "text": "My mum was a teacher at the primary school I went to as a child, I remember going to her classroom after the school day whilst she marked work, attended meetings or put up a display. I was always mesmerised by her stories about what happened in her and her colleagues’ classrooms, but what really stood out was how much they cared for their pupils, especially those facing the most challenges.  "
        },
        {
            "text": "Inspiration "
        },
        {
            "text": "Teachers continuously go above and beyond to meet the needs of the pupils in their care. We are very aware of the fact that the relationships we form with the children we teach impacts each pupil’s individual outcome. My team and I are fans of a Ted Talk by the late Rita Pearson. Every time I watch it, I hear something new, but this is truly memorable:  "
        },
        {
            "text": "“Every child deserves a champion—an adult who will never give up on them, who understands the power of connection, and insists that they become the best that they can possibly be.”  "
        },
        {
            "text": "Hearing parents and carers talk about how much they value their child’s teacher is a very special part of my job. I know how happy teachers are when they hear how much the families value them.  I also know that families genuinely value a great teacher who does all they can to ensure their child is happy and does whatever it takes to make sure the child is supported to develop a deep love of learning.  "
        },
        {
            "text": "Thank you "
        },
        {
            "text": "Recently, we have been reflecting on Dylan Wiliam’s words during a Spectator talk:  "
        },
        {
            "text": "“Teaching is such a complex craft that one lifetime is not enough to master it, but by rigorously focusing on practice, teachers can continue to improve throughout their career.” "
        },
        {
            "text": "Personally, I think teaching is the best job in the world and would like to thank not only the staff at my school, Belleville Wix Academy, but all teachers, for making such a difference to the children they teach. "
        },
        {
            "text": " "
        },
        {
            "text": "A teachers invaluable support with exam preparation  "
        },
        {
            "text": "Matthew Shanks, Executive Principal and Chief Executive Officer at Education South West Multi-academy Trust talks about teachers’ hard-work in the lead up to exams, ensuring pupils feel as prepared as possible.  "
        },
        {
            "text": "A teachers’ role "
        },
        {
            "text": "Teachers are all things to all people at all times – middle leadership, senior leadership, your colleagues, parents and carers and of course, children. As a Trust leader, I am in awe every day of the work done by teachers in our schools. Their compassion, their dedication, the way they deal with the often negatively expressed emotions of young people as they learn and grow and develop into adults. Nowhere is this more evident than in the lead up to examinations.  "
        },
        {
            "text": "Preparation support "
        },
        {
            "text": "I remember the dread of facing examinations. The time I was meant to spend studying when there were so many distractions calling me. I wish that I had had the teachers we have in schools today providing question answering through Microsoft Teams, drop-in sessions for pupils, extra study provision, additional classes after and before school as well as during half-term and Easter breaks, pre-exam sessions and, of course, normal timetabled lessons. Teachers do this because they care about their pupils.  "
        },
        {
            "text": "On the back of the events of the last few years, this pastoral and academic care has been more vital than ever.  "
        },
        {
            "text": "I am so proud of the ways in which our staff have been calm and caring, supportive and challenging, holding children to account for their behaviours whilst ensuring wherever possible they stay within the school environment in order to ensure they have the very best chance of success. Day in, day out, our staff have continued to find ways to inspire the children in their care to aspire to greater things. That is why I support Thank a Teacher Day, and why we should all, as a society, recognise the vital work teachers do every day. "
        },
        {
            "text": "Join us in celebrating Thank a Teacher Day and recognising all of our brilliant teachers and school staff by sending a free, personalised card to a memorable school figure: Thank a Teacher Form - Thank a Teacher "
        }
    ]
}