{
    "url": "https://space.blog.gov.uk/2018/03/16/remembering-professor-stephen-hawking/",
    "title": "Remembering Professor Stephen Hawking",
    "authors": [
        "robynhaigh"
    ],
    "categories": [
        "People"
    ],
    "pub_date": "2018-03-16T11:59:50+00:00",
    "content": [
        {
            "heading": 4,
            "text": "Our thoughts regarding the late Professor Stephen Hawking."
        },
        {
            "text": "It is perhaps poignant that Professor Stephen Hawking has died only a few days after the world's international space community, including the UK, gathered in Tokyo on March 3rd to declare their resolve for pursuing the next steps in Space Exploration beyond the current focus on the International Space Station."
        },
        {
            "text": "Professor Hawking is rightly celebrated as an exemplary cosmologist but he was also a firm advocate that the destiny of the human race lay with the stars and he didn’t hesitate to assert that we need “to pursue rigorously a space-exploration programme, [with] a view to eventually colonizing suitable planets for human habitation”. He may therefore have been heartened that over 40 nations gathered in Tokyo to keep a bold space exploration agenda on the tables of the world's space leaders."
        },
        {
            "text": "Indeed his commitment for such an enterprise ran deeply. Despite his own disability, when he was offered a seat on Richard Branson's Virgin Galactic SpaceShipTwo vehicle, Prof Hawking immediately said yes. Sadly while he never achieved his ambition to fly in space, he was nevertheless memorably able to experience zero-g."
        },
        {
            "text": "Professor Hawking’s commitment to space exploration was not simply philosophical -it extended into actual technology developments. These centred on his support of the Breakthrough Starshot project to develop a 100 million mile per hour mission to the stars within a generation. At its heart the Starshot vision - self funded by entrepreneurs - seeks a proof of concept for using a light beam to propel gram-scale ‘nanocraft’ to 20 percent of light speed. A possible fly-by mission could therefore reach Alpha Centauri 20 years after its launch."
        },
        {
            "text": "Time will tell if Starshot can ever leave the world of the drawing board but while we mourn the loss of a great British scientist and communicator, let us also celebrate the life of a British Space Exploration visionary - one who always reminded us “to look upwards at the stars and not down at our feet”."
        },
        {
            "text": "Ad astra Professor Stephen Hawking."
        }
    ]
}