{
    "url": "https://teaching.blog.gov.uk/2022/03/17/advice-for-implementing-the-new-early-careers-framework-following-a-successful-first-term/",
    "title": "Advice for implementing the new Early Careers Framework following a successful first term",
    "authors": [
        "Jane Cruickshank"
    ],
    "categories": [
        "Support for ECTs"
    ],
    "pub_date": "2022-03-17T11:23:24+00:00",
    "content": [
        {
            "text": "Jane Cruickshank, deputy headteacher and ECF coordinator at the Learning in Harmony Trust, explains how her trust is delivering the Early Careers Framework and the lessons they’ve learned so far. "
        },
        {
            "text": "I’m both a visiting fellow with ECF programme provider Ambition Institute and the ECF coordinator for my trust, delivering training to each new cohort of teachers. My position allows me to provide our early career teachers (ECTs) with personalised guidance, focusing on areas that they are particularly interested in or struggling with.  "
        },
        {
            "heading": 3,
            "text": "Early, consistent support is crucial"
        },
        {
            "text": "We’ve offered our ECTs an early start in June/July so they can become familiar with their school, meet other ECTs, begin training and receive payment to be financially secure over the summer. We’re committed to ensuring our ECTs feel valued in a way that allows them to flourish in their new roles. Our making sure they have that support from the beginning helps them make a successful start to their careers. We also offer them trust-specific training sessions that focus on processes such as planning assemblies or organising school trips.  "
        },
        {
            "heading": 3,
            "text": "Help ECTs support each other "
        },
        {
            "text": "We’ve created opportunities for our ECT cohort to build a network and support each other. We encouraged them to visit one another’s schools and organise team bonding experiences such as an end of year residential weekend where they can develop their relationships as a cohort.  "
        },
        {
            "text": "The network helps them build unique relationships across the trust – learning from each other and experiencing different school environments. This will continue into their second year of teaching together. "
        },
        {
            "heading": 3,
            "text": "Support your mentors  "
        },
        {
            "text": "Each of our ECTs is paired with a mentor who provides them with specific advice on navigating the programme. While guiding ECTs through the difficulties of their new role, mentors also need to be supported.  "
        },
        {
            "text": "We have always placed the utmost importance on providing our mentors with specific guidance throughout their roles, beginning with helping them to understand their responsibilities. This is crucial to the success of those they are mentoring and helps them provide support in the most constructive way.  "
        },
        {
            "heading": 3,
            "text": "Moving beyond the ECF programme "
        },
        {
            "text": "After the first two years of the ECF programme, we will continue supporting each cohort into their third year of teaching, offering CPD beyond the statutory requirements. We strive to always demonstrate our investment in our ECTs’ career progression and will be paying them a retention allowance for their first five years. Going the extra mile for our ECTs and focusing on their continuing development throughout their careers has been, and will continue to be, crucial to their success and the success of our trust."
        },
        {
            "text": " "
        }
    ]
}