{
    "url": "https://dragonsden.blog.gov.uk/2022/03/17/dragons-den-episode-11-series-19/",
    "title": "Dragons' Den Episode 11 Series 19",
    "authors": [
        "Caitlyn Arthur"
    ],
    "categories": [
        "Designs",
        "Trade marks"
    ],
    "pub_date": "2022-03-17T21:05:45+00:00",
    "content": [
        {
            "text": "In tonight’s episode of Dragons’ Den the entrepreneurs presented a number of new takes on classic products. Hand sanitiser, snack bars, walking sticks and coffee all featured in the show, as well as an app that will bring to life my dreams of having a wardrobe like Cher from Clueless!"
        },
        {
            "text": "In this blog, I want to focus on two of the pitches - Caribe Coffee Company and Neo Walk - and the IP challenges the entrepreneurs faced when they presented their ideas to the Dragons."
        },
        {
            "heading": 2,
            "text": "Wake up, Dragons!"
        },
        {
            "text": "Wilmer and Elle Carcamo were the first entrepreneurs to take the floor with their ethically sourced business, Caribe Coffee Company asking for £30k in exchange for a 10% stake in their company."
        },
        {
            "text": "The couple’s focus was on delivering high quality coffee, produced using sustainable practices and paying farmers a fair price. Wilmer, who was born and raised in Honduras with a family background in coffee farming, understood the hardships that coffee farmers face when trading with other organisations."
        },
        {
            "text": "While the Dragons were captivated by Wilmer and Elle’s mission, they had some tough questions about the couple's brand. The Dragons wondered if the brand truly encompassed Caribe Coffee Company’s unique selling point and mission. Steven Bartlett and Peter Jones suggested changing the name to 'Wilmer's' or 'The Honduras Farmer'."
        },
        {
            "text": "Four of the Dragons quickly declared themselves out, one comment being that it’s a popular market. Peter Jones was the only Dragon to make an offer, but he wanted a 25% stake of the business for all of the money. This came with a condition of rebranding the name to ‘Wilmer’s’."
        },
        {
            "text": "The couple unfortunately left the Den empty handed after Peter Jones declined the couple’s counter-offer of 20%."
        },
        {
            "heading": 4,
            "text": "Let's get into the granular detail here: how are trade marks classified and are there rules around using your name, or the name of a country, in your trade mark? "
        },
        {
            "text": "Trade mark applications are judged on a case by case basis. The IPO uses a worldwide trade mark classification system that groups together similar goods or services into 45 different classes. When applying to register a trade mark, you must use the classification system to specify the goods and/or services you'll be using it on."
        },
        {
            "text": "This system helps our trade mark examiners process your application. For example, you can’t trade mark words that directly describe what you sell or the service you offer. If you try to trade mark the name 'Apple' for a shop that sells apples, your application would be rejected. But it turned out to be a great name for a certain Californian tech company."
        },
        {
            "text": "This classification system also allows businesses to check whether there are registered trade marks that conflict with trade marks they are using in respect of particular goods or services. This is important in determining if another business is infringing on your rights."
        },
        {
            "heading": 2,
            "text": "More than just a stick"
        },
        {
            "text": "Lyndsay Watterson ventured into the Dragons’ Den this week with her walking stick company, Neo Walk asking for £80k for a 15% share of her business. Lyndsay has created a range of funky walking sticks that encourage people to look beyond the user’s disability. These acrylic sticks come in a range of beautiful designs that allow users to show off their personality."
        },
        {
            "text": " Manufacturing maestro Touker Suleyman suggested Lyndsay went back to China to secure a cheaper wholesale cost which would give her a larger profit."
        },
        {
            "text": "One of the attractions of Lyndsay’s walking sticks is that acrylic (unlike metal) is safe to take into hospital MRI scans. Many walking stick users that have these scans currently have to be carried into the MRI room by hospital staff. The NHS is therefore a potential valuable customer for Lyndsay's business."
        },
        {
            "text": "Peter Jones wanted to know how Lyndsay was going to stop others copying her design, creating cheaper versions to sell to a big customer like the NHS. Lyndsay understood that she couldn't patent her creation because she didn’t invent the walking stick. However, she was in the process of registering the design itself."
        },
        {
            "text": "After four of the Dragons declined to take up Lyndsay’s proposal, Deborah Meaden was the last one to declare that she was out."
        },
        {
            "heading": 4,
            "text": "We talked about registering designs in last week’s blog, but what are your rights if you decide not to register your design? "
        },
        {
            "text": "The UK Unregistered Design Right protects all designs in the UK without the creator doing anything at all. This is similar to copyright, in that that the design is protected at soon as it is created and belongs to the creator. However, it’s much harder to take legal action if someone copies your unregistered design."
        },
        {
            "text": "Registering your design gives you the legal right to stop others using your design without your permission. This is what Lyndsay has chosen to do to protect her business from copycats. You can watch our video on how to protect your designs here:"
        },
        {
            "text": "We hope you enjoyed this Dragons’ Den IP check-in.  Tune in to our blog next week for another look at the IP behind the pitches."
        }
    ]
}