{
    "url": "https://deframedia.blog.gov.uk/2022/03/17/environment-act-2021-environmental-targets/",
    "title": "Environment Act 2021: environmental targets",
    "authors": [
        "Defra Press Office"
    ],
    "categories": [
        "Weekly stories"
    ],
    "pub_date": "2022-03-17T15:48:36+00:00",
    "content": [
        {
            "text": "There has been extensive coverage today of our announcement on new long-term environmental targets & green paper proposals that will protect and enhance our natural world in The Times, Sky News, BBC Online, The I. and the Guardian. The coverage contains some criticisms and you can read our response in the blog below."
        },
        {
            "text": "Water "
        },
        {
            "text": "The new proposed targets under the Environment Act will tackle the major sources of pollution in our rivers and improve water quality."
        },
        {
            "text": "There have been some suggestions reported that we are ‘dropping’ national targets for all rivers. That is not correct - the Water Framework Directive is enshrined in UK law. For England, this means achieving Good Ecological Status for 75% of water bodies by 2027.  The targets published yesterday work with existing targets to support them and fill any gaps, and are designed to be mutually reinforcing."
        },
        {
            "text": "We will continue to keep our targets framework under review, including EU legacy targets such as WFD. At least every five years, we will assess whether to modify existing targets to make them more ambitious or set additional long-term targets."
        },
        {
            "text": "Air Quality "
        },
        {
            "text": "On air quality we have proposed a new ambitious target to reduce exposure to the most harmful air pollutant to human health – PM2.5 – by over a third compared to 2018 levels. This will reduce exposure to the most harmful air quality across the country and in locations where levels are highest."
        },
        {
            "text": "There has been some criticism reported that does not align with WHO targets. Our evidence strongly sets out that the new World Health Organization guideline level (published in autumn 2021 of 5 µg/m3) is not possible to achieve in many locations in England, due to the level of natural PM2.5 and pollution blown in from outside the country."
        },
        {
            "text": "These proposed targets goes well above and beyond previous EU targets and will drive reductions in concentrations of PM2.5 across the country; in locations where levels are highest, as well as reducing exposure for all."
        },
        {
            "text": "Nature Recovery "
        },
        {
            "text": "Our Nature Recovery Green Paper proposes a rationalised legal framework, supported by local expertise and scientific judgement, to enable our regulators to be confident in making conservation decisions most appropriate for each of our nature sites."
        },
        {
            "text": "There have been comments that this could give the Environment Secretary a veto on designating nature sites or lead to a weakening of protections. We are seeking views on a system of designations that allows for more direct accountability. The existing designation process already involves a level of ministerial involvement.  We have set out very clearly throughout the green paper our desire to maintain or enhance vital protections, which would support progress to halt nature’s decline."
        },
        {
            "text": "There have also been some reporting that our 2030 species abundance target is not ambitious enough to halt the decline in nature. We are the first country in the world to set such a target for species abundance and are leading the way internationally. Tackling the decline in nature will be a huge challenge and require significant action to tackle impacts on biodiversity, including air and water pollution, invasive species and physical impacts on habitats, as well as proactively enabling recovery by creating more, better and joined up space for nature."
        },
        {
            "text": "There has also been some reporting that tree planting could impact on the ability of the UK to grow its own food. Any planting on farmland will be small comparison to the amount of land available and is likely to be on land of low agricultural value, with minimal impacts on our agricultural output. Through the food security review, we will be able to monitor the targets impact on agricultural output and take action if necessary."
        },
        {
            "text": "Plastic"
        },
        {
            "text": "Defra already has a plastics target in the 25 Year Environment Plan of ending all avoidable plastic waste by 2042. The long-term, legally binding target on waste reduction will take a holistic approach to reducing consumption of all materials, not just plastics or plastic packaging. This will reduce the overall volume of waste we generate, including plastic waste."
        },
        {
            "text": "The proposed targets and green paper proposals will ensure the right framework is in place to meet the UK’s international commitments to protect 30% of land and sea by 2030. They are both subject to an eight week consultation process."
        },
        {
            "text": " "
        }
    ]
}