{
    "url": "https://environmentagency.blog.gov.uk/2022/03/17/fisheries-enforcement-officer-greg-dytkowski-discusses-the-close-season/",
    "title": "Fisheries Enforcement Officer Greg Dytkowski discusses the close season",
    "authors": [
        "pressoffice"
    ],
    "categories": [
        "Fisheries and biodiversity"
    ],
    "pub_date": "2022-03-17T14:01:46+00:00",
    "content": [
        {
            "text": "Greg Dytkowski, Fisheries Enforcement Officer in East Midlands, discusses his role at the Environment Agency and why the coarse fishing close season is vital for our fish stocks."
        },
        {
            "text": "Every year, between March and June, our rivers start to reawaken, meaning the coarse fish close season is upon us."
        },
        {
            "text": "The close season runs from March 15th to June 15th inclusive and is a really important time for fish. Many will be preparing to spawn, spawning, or recovering from spawning, which can be both stressful and exhausting."
        },
        {
            "text": "For some anglers, the close season offers a chance to hang up their rods for a short time and for others, it provides an opportunity to mix up their routine and switch to canal and lake fisheries.  It’s something that’s not always well understood with confusion sometimes arising around the dates and where the close season applies.  In this blog, I hope to give you some background as to why it’s there and how we enforce it."
        },
        {
            "text": "My name is Greg, and I am a Fisheries Enforcement Officer for the Environment Agency in the East Midlands. I have worked in the fisheries enforcement team for over three years now. It’s my dream job as my passion is protecting fisheries and angling."
        },
        {
            "text": "I have also worked as part of the Building Bridges team with the Angling Trust, helping educate and welcome foreign nationals to the sport and informing them of fishing rules and etiquette in England. This is something I am still passionate about as we want to encourage everyone to give fishing a go and help make fishing a sport that is inclusive and diverse."
        },
        {
            "text": "I’m an angler myself and it’s easy to ask, ‘will I really impact spawning fish by going fishing’? Yes, is the answer. If they are disturbed, they may well decide to stop. This is not only stressful for the fish but also means they’ve lost their chance, not only this time, but for the whole year! Areas where fish spawn can also be open to damage, with eggs nestling directly in weeds, gravel, tree roots or even in your keepnet. Young fish, known as fry, that emerge from the eggs can be sensitive to silt disturbance, low oxygen and trampling."
        },
        {
            "text": "In fact, protecting spawning fish is so important there is separate legislation under section 2 of the Salmon and Freshwater fisheries act that makes it an offence to disturb spawning fish, or the areas they use."
        },
        {
            "text": "Day-to-day, I spend much of my time ensuring anglers have valid fishing licences and that they are following fisheries law. The service I and the rest of my colleagues provide is primarily funded by fishing licence income. Our work not only protects the sport of but enhances the wider work we deliver to enhance fisheries and promote fishing."
        },
        {
            "text": "Throughout the close season, myself and other Environment Agency officers conduct patrols to enforce it. As part of Operation CLAMPDOWN, which is celebrating its 10th year in 2022, Angling Trust volunteers support our officers by being our eyes and ears on riverbanks and reporting incidents to our 24-hour incident hotline 0800 80 70 60."
        },
        {
            "text": "Ensuring rivers are not fished during the close season is a big priority for our teams. It helps protect our beloved coarse fish stocks and ensures spawning fish have the best chance to sustain their populations for the future. Coarse fishing in rivers, streams and drains as well as some canals and stillwaters within specified ‘sites of special scientific interest’ from 15th March to 15th June is an offence under Environment Agency National Bylaws and may land you with enforcement action and a fine upon conviction by the courts. The maximum fine is £50,000"
        },
        {
            "text": "The close season is chosen in this period to cover as many spawning species as possible to offer the most protection. If you do still want to get out, there are loads of places you can visit while this closure is in place such as many stillwaters and canals, depending on landowner agreement. You could even try your hand at trout fishing, though a valid fishing licence is still required."
        },
        {
            "text": "If you know anyone that’s just started fishing for the first time, we ask that you not only remind them of the close season dates, but also explain why we enforce it. If you see fish spawning why not stop to watch them – it’s an amazing sight! But please keep your distance and avoid disturbance of any kind. By staying back, you’ll be able to watch their offspring spawning one day too."
        },
        {
            "text": "I look forward to meeting you on the river bank at the start of the fishing season on June 16th."
        }
    ]
}