{
    "url": "https://educationhub.blog.gov.uk/2022/03/how-were-helping-to-make-sure-people-from-all-backgrounds-are-supported-in-the-education-system/",
    "title": "How we're helping to make sure people from all backgrounds are supported in the education system",
    "authors": [
        "mediaofficer"
    ],
    "categories": [
        "Equalities"
    ],
    "pub_date": "2022-03-17T13:18:46+00:00",
    "content": [
        {
            "text": "We want every child to have access to a great education system, no matter their background. This includes a system free from discrimination with trust and fairness at its heart."
        },
        {
            "text": "We also want to promote equality and encourage all children to achieve their full potential and remove unfair boundaries by ensuring we are inclusive."
        },
        {
            "text": "To help achieve this, today (Thursday 17 March), the government published its response to the Commission on Race and Ethnic Disparities report which includes actions from the Department and our partners that focus on improving education outcomes for all."
        },
        {
            "text": "Education Secretary Nadhim Zahawi said"
        },
        {
            "text": "Here’s what this means for education."
        },
        {
            "heading": 3,
            "text": "We're looking at how the best schools support pupils from different backgrounds"
        },
        {
            "text": "By working with the Race Disparity Unit, we will look at the strategies used by the multi-academy trusts who are most successful at bridging achievement gaps for different ethnic groups. With these lessons learnt, we will publish them as examples to help drive up standards for all pupils."
        },
        {
            "heading": 3,
            "text": "We will further support history teaching"
        },
        {
            "text": "To support high-quality history teaching, building on the National Curriculum, we will work with history curriculum experts, historians, and school leaders to develop a Model History curriculum by 2024 that will stand as an exemplar for a knowledge-rich, coherent approach to the teaching of history."
        },
        {
            "text": "The Model History Curriculum will reflect the richness of world history – teaching pupils about societies and civilisations both within and beyond Europe. It will include how Britain has influenced and been influenced by different societies and communities"
        },
        {
            "text": "The development of model knowledge-rich curriculums continues the path of reform the government started in 2010."
        },
        {
            "text": "We will also actively seek out and signpost to schools suggested high-quality resources to support teaching all-year round on black history in readiness for Black History Month October 2022."
        },
        {
            "heading": 3,
            "text": "We're working with the Children's Commissioner to improve the support offered to families "
        },
        {
            "text": "The Children’s Commissioner for England will commence an independent review in April 2022 to improve the way public services understand the needs of children and families, so every child has the best start in life and the opportunity to reach their full potential."
        },
        {
            "heading": 3,
            "text": "We're helping schools understand how to make sure their uniform and appearance policies aren't discriminatory even inadvertently"
        },
        {
            "text": "Uniform policies should not discriminate, and pupils should feel comfortable while being at school."
        },
        {
            "text": "We have already cleared guidance to support schools for when they are developing their uniform and appearance policy, including ensuring their policy is inclusive of their school community."
        },
        {
            "text": "In addition, we will work with leading schools to help them create a resource on considering pupil hairstyles within uniform policy."
        },
        {
            "text": "This will showcase best practice in uniform policy specific to the diversity of acceptable hairstyles in school to avoid indirect discrimination against children of an ethnic minority background."
        },
        {
            "heading": 3,
            "text": "We want everyone to achieve their full potential beyond the classroom"
        },
        {
            "text": "For some careers and skillsets, higher education opens up a wealth of opportunities. So, to empower pupils to make better choices about their studies, we are ensuring higher education institutions support students before they apply for university places."
        },
        {
            "text": "To improve careers guidance for all pupils in state-funded secondary education, we will extend the current statutory duty on schools to secure independent careers guidance for pupils throughout their secondary education."
        },
        {
            "text": "We are also making the application process more accessible by working with UCAS and other partners to make available both advertised and actual entry requirements for courses, including historic entry grades so that disadvantaged students have the information they need to apply to university on a fair playing field."
        },
        {
            "text": "Higher education providers will also rewrite their Access and Participation plans with a new focus on delivering real social mobility, ensuring students are able to make the right choices, accessing and succeeding on high quality courses that are valued by employers and lead to good graduate employment."
        },
        {
            "text": "To clamp down on low quality courses, which hurt people from disadvantaged backgrounds the most, the Office for Students (OfS) will set minimum acceptable standards for student outcomes. We are also consulting openly on the introduction of student number controls to improve outcomes for higher education students, society and the economy. Student number controls could be introduced to restrict the entry of students into provision which has offered poorer outcomes, and instead tilt growth towards provision with the best outcomes."
        },
        {
            "heading": 3,
            "text": "We are opening up apprenticeship opportunities to those who face discrimination or disadvantage "
        },
        {
            "text": "Since November 2021, we have been working with the Department for Work and Pensions, partner organisations and employers to engage directly with young people up and down the country and promote apprenticeship opportunities."
        },
        {
            "text": "In January, we also launched the ‘Get the Jump: Skills for Life’ campaign that targets young people aged 14-19 about the full range of options available to them post 16 and post 18."
        }
    ]
}