{
    "url": "https://civilservice.blog.gov.uk/2022/03/17/sleep-struggles-and-how-to-beat-them/",
    "title": "Sleep struggles - and how to beat them ",
    "authors": [
        "Andy Clarke, Performance Insight, Department for Work and Pensions"
    ],
    "categories": [
        "A Skilled Civil Service",
        "An Ambitious Civil Service",
        "An Innovative Civil Service"
    ],
    "pub_date": "2022-03-17T09:23:27+00:00",
    "content": [
        {
            "heading": 3,
            "text": "Sleep Awareness Day highlights the importance of quality sleep and how insomnia can have a devastating impact on our wellbeing. Andy Clarke tells us how signing up to Sleepstation through the Charity for Civil Servants helped improve his quality of life. "
        },
        {
            "text": "Insomnia means you regularly have problems sleeping, but the good news is, it usually gets better by making some simple changes to your sleeping routine. If you’ve experienced insomnia recently (for less than three months), it’s known as short-term insomnia. If it lasts three months or longer, it’s called long-term insomnia. It’s a common problem, and around a third of people will experience problems with sleep at some point - so you’re not alone. "
        },
        {
            "text": "Struggle to sleep"
        },
        {
            "text": "Before signing up to Sleepstation, I couldn't honestly remember a time when I slept well. I would struggle to fall asleep, wake up several times throughout the night and be exhausted by the morning before I even started my day.  "
        },
        {
            "text": "I signed up to Sleepstation through the Charity for Civil Servants and worked with them to create a sleep diary. They provided tailored advice based on my diary entries and I’m sleeping better now than I’ve done in years.  "
        },
        {
            "text": "Effective tips"
        },
        {
            "text": "Sleepstation gave me so many effective tips which have helped me switch off mentally and physically. For example, I never felt I had the time to read before now but switching off the TV and reading a book in bed has made a huge difference.  "
        },
        {
            "text": "More energy"
        },
        {
            "text": "Sleepstation has helped me find the balance and combination of things that work for me and I feel like I can focus again. I feel like I have more energy and can concentrate the whole day, and knowing that I will likely sleep well each night means that I approach bedtime without a high level of anxiety."
        },
        {
            "text": "As A Modern Civil Service, we take pride in this innovative approach to support our community. This clinically validated sleep improvement programme is designed by experts and can be accessed through the Charity for Civil Servants.  "
        },
        {
            "text": "Verdict from the Charity for Civil Servants "
        },
        {
            "text": "Jill White, Head of Service Insights at Sleepstation, and Linda Eades, Head of Caring Health and Wellbeing Services at the Charity for Civil Servants, emphasise the importance of supporting our Civil Service colleagues to boost their wellbeing.  "
        },
        {
            "text": "“Through our partnership with the Charity for Civil Servants, we’re delighted that we’re able to provide life-changing sleep support across the Civil Service community. "
        },
        {
            "text": "“Poor sleep has a detrimental impact on both physical and mental health and by improving your sleep through Sleepstation, you can also make changes to your overall wellbeing,” said Jill. "
        },
        {
            "text": "“We are delighted to have been able to support almost 1,500 people throughout 2021 to access support from Sleepstation,” said Linda. "
        },
        {
            "text": "“In addition, we have undertaken many workplace sessions to raise awareness of the devastating effects poor sleep can have on the wellbeing of our lifelong community.”  "
        }
    ]
}