{
    "url": "https://socialcare.blog.gov.uk/2022/03/17/social-care-day-of-remembrance-and-reflection-a-message-from-deborah-sturdy/",
    "title": "Social Care Day of Remembrance and Reflection: a message from Deborah Sturdy",
    "authors": [
        "Deborah Sturdy"
    ],
    "categories": [
        "Care and support",
        "Carers",
        "Events",
        "Viewpoint",
        "Workforce"
    ],
    "pub_date": "2022-03-17T15:20:32+00:00",
    "content": [
        {
            "heading": 2,
            "text": "Social care colleagues are an inspiration"
        },
        {
            "text": "One of the reasons, if not the main inspiration, for accepting the post of Chief Nurse for Adult Social Care has been my desire to honour, support and encourage our amazing care profession through some very challenging times."
        },
        {
            "text": "I think it’s fair to say though, not even the most experienced of us could have anticipated just how disruptive, damaging and persistent COVID-19 would be in our personal as well as professional lives."
        },
        {
            "text": "The pandemic has affected us all in different ways. Sadly, in many tragic cases, we have lost some wonderfully dedicated colleagues, as indeed have our equally committed counterparts in the NHS."
        },
        {
            "text": "On this day of remembrance and reflection for social care, we take this opportunity to remember the sacrifice of colleagues, friends and family who put themselves in harms way to protect those who needed care the most. I am truly humbled by their bravery, compassion and selflessness."
        },
        {
            "text": "Even in those early days of uncertainty and anxiety, when the first vaccines were yet to be formulated, care colleagues showed their flexibility and adaptability in a crisis. In care homes, domiciliary care and other settings, they did what they could to keep the most vulnerable in our communities safe."
        },
        {
            "heading": 2,
            "text": "Making a lasting difference"
        },
        {
            "text": "Having worked on the frontline of the care sector for decades, it became clear to me how social care colleagues consider caring to be more than a job. Much of our satisfaction comes from knowing we are making a positive difference in people’s lives. We are the bridge between clinical and community support, a bridge which became a literal lifeline for many in the darkest days of the pandemic."
        },
        {
            "text": "Today is a day to share deeply emotional stories of those we lost, but also celebrate the amazing support our profession provides, seven days a week, 52 weeks a year."
        },
        {
            "text": "If some long lasting benefit can come out of the worst public health crisis for generations, it will be even greater professional and public recognition of social care’s intrinsic value in our communities. We are not an optional extra – we are an essential component in the pursuit of a healthier, happier nation."
        },
        {
            "text": "That’s why I will continue to bang the drum for varied and rewarding careers in social care and take inspiration from the many fine colleagues we lost over the last two years. They were the best of us, but they also made us better too."
        },
        {
            "text": "We won’t stop remembering what they did for our friends, families and loved ones and we won’t stop doing those things that motivate us to go to work every morning: giving the best care to the people who need us the most."
        }
    ]
}