{
    "url": "https://governmentscienceandengineering.blog.gov.uk/2022/03/17/stem-challenge-2022/",
    "title": "STEM CHALLENGE: 2022",
    "authors": [
        "Selina Khan"
    ],
    "categories": [
        "Outreach"
    ],
    "pub_date": "2022-03-17T20:51:51+00:00",
    "content": [
        {
            "text": "The GSE Profession, in collaboration with Science and Engineering Fast Streamers and STEM ambassadors, are proud to announce the launch of the 2022 STEM Challenge for secondary school students."
        },
        {
            "text": "STEM informs almost every part of our lives – it helps us to function day to day, but it will also be critical for answering the big questions that society will face in the future. It’s these big and challenging questions that we want to encourage young minds to engage with – and, in doing so, to demonstrate that STEM is about much more than working in a lab."
        },
        {
            "text": "The challenge is focused on sustainability, and within that theme students will explore their vision of a day in 2050. They will work in teams to choose a real issue facing the country today – ‘Sustainable Food Production’, ‘Humans in Space’ or ‘Sustainable Transport’ and consider creative scientific solutions. These are all critical issues for policymakers in STEM. You can find both the student pack of activities and the teacher pack below."
        },
        {
            "text": "We have worked with STEM Ambassadors to select schools to promote social mobility and inclusivity in STEM. As this is our first STEM challenge, we are initially launching in a select number of schools across the country. We hope these will be the first of many, and we will keep you updated here on our progress."
        },
        {
            "text": "If you are a civil servant or a teacher and have any questions about the STEM challenge, please get in touch with stemchallenge@faststream.civilservice.gov.uk, using the subject line STEM Challenge Enquiries."
        },
        {
            "text": " "
        },
        {
            "text": "Resource Pack Downloads"
        },
        {
            "text": "Student Pack"
        },
        {
            "text": "TEACHER PACK"
        },
        {
            "text": "Read blog by Sir Jeremy Heywood - previous head of the Civil Service - on why STEM graduates should consider the Civil Service"
        },
        {
            "text": "Sign up to the GSE blog to receive an email when a new blog is published and keep up to date with the work of the GSE profession."
        },
        {
            "text": " "
        }
    ]
}