{
    "url": "https://ukhsa.blog.gov.uk/2022/03/17/taking-the-sting-out-of-new-and-emerging-health-threats/",
    "title": "Taking the sting out of new and emerging health threats",
    "authors": [
        "Blog Editor"
    ],
    "categories": [
        "UKHSA science"
    ],
    "pub_date": "2022-03-17T13:32:35+01:00",
    "content": [
        {
            "text": "During British Science Week we’ve been looking at the diversity of work going on across UKHSA which serves to keep the public safe from established and emerging threats to human health."
        },
        {
            "text": "In this blog we focus on the activities of our Medical Entomology and Zoonoses Ecology (MEZE) team. That’s our scientists responsible for assessing the emerging risk posed by arthropods (in the UK’s case, primarily ticks and mosquitoes) that can carry and transmit the bacteria, viruses and parasites that cause disease."
        },
        {
            "text": "For Dr Jolyon Medlock, who leads the MEZE team, inspiration for a career in medical entomology was seeded in a diary he inherited from his great-grandfather who contracted malaria while stationed in East Africa during World War 1. After retracing his footsteps on the continent many years later, he became passionate about ecology, tropical diseases and the natural environment."
        },
        {
            "text": "The team’s role is to provide advice within UKHSA and to the Department of Health and Social Care and other government advisory groups, on the risk to public health from vector-borne disease in the UK. Using knowledge gained in the field, our entomologists work with local authorities to monitor and manage risks and put in place strategies to minimise the opportunity for invasive species to become established in our towns and countryside."
        },
        {
            "text": "The working pattern of an entomologist in the UK is seasonal, mirroring the life cycles and prevalence of the arthropods they study."
        },
        {
            "text": "Typically, winter is used to analyse the data collected during the warmer months when field work is carried out to monitor for trends and any new introductions to the UK. As an entomologist at UKHSA, half of the time is dedicated to monitoring ticks which can transmit Lyme disease, now endemic in the UK, and the rest  is concerned with mosquitoes and the pathogens they can carry."
        },
        {
            "heading": 2,
            "text": "What is Vector-borne disease?"
        },
        {
            "text": "“Vectors” are living organisms such as ticks and mosquitoes that can transmit infectious pathogens between humans, or from animals to humans."
        },
        {
            "text": "Globally, vector-borne diseases account for more than 17% of all infectious diseases and cause more than 700,000 deaths annually. They can be caused by either parasites, bacteria or viruses and diseases transmitted include malaria, dengue and yellow fever."
        },
        {
            "text": "While the majority of illness and deaths caused by vector-borne disease occur in the tropics, there is an increasing risk posed by mosquitoes and ticks both established and invasive to the UK and it’s the job of the entomologists at UKHSA to monitor their prevalence and test for which diseases they may be capable of carrying and passing to humans."
        },
        {
            "text": "Factors behind the increased risk include globalisation of travel and trade, changes in land use and climate change."
        },
        {
            "text": "Our team works closely with local authorities and other government agencies including the Animal and Plant Health Agency to coordinate national vector surveillance programmes and conduct field-based research on the impact of climate and environmental change on vectors and their pathogens."
        },
        {
            "text": "The team also provides expertise and practical support to the UK Oversees Territories where knowledge gained is applied to mitigate future threats to the UK."
        },
        {
            "heading": 2,
            "text": "Mosquitoes"
        },
        {
            "text": "In recent years we’ve seen small outbreaks of tropical diseases like dengue fever as close as southern France. Aggressive mosquito control measures are important to minimise the risk of these happening in the UK – and vector surveillance and fieldwork is a vital part of this."
        },
        {
            "text": "Where mosquitoes of concern are identified, we work with local authorities to implement control programmes to prevent them establishing. Our research findings are also being used to reduce the suitability of wetlands for mosquitoes."
        },
        {
            "text": "In late summer 2016 we first detected eggs of the Asian Tiger Mosquito, Aedes albopictus, in the South East with subsequent detections in each of the subsequent three years. We have also detected populations of the Culex modestus mosquito, which can transmit West Nile virus, and is now established in parts of Kent and Essex."
        },
        {
            "text": "While we are yet to see any human cases of this virus transmitted in the UK, knowledge that the mosquitoes may be found in certain areas means we can alert local health settings to the signs of the illness."
        },
        {
            "heading": 2,
            "text": "Ticks"
        },
        {
            "text": "An important aspect of our surveillance work is monitoring the diseases spread by ticks. In the UK, Lyme disease is the most commonly known infection associated with ticks, but across the world they also carry other infections."
        },
        {
            "text": "Hyalomma marginatum ticks are known to carry Crimean-Congo haemorrhagic fever virus, and while traditionally the virus is found in Eastern Europe and Africa, recent cases of this disease have been reported in Spain, with ticks likely to have been moved around on migratory birds."
        },
        {
            "text": "Given that the UK also sees large numbers of these bird migrations, we endeavour to closely monitor the tick species found in the UK, with research into the climates and habitats that sustain them, as well as routes of importation."
        },
        {
            "text": "It’s through our fieldwork and the research we undertake that we found ticks that tested positive for Tick-borne encephalitis virus, an infection spread by tick bites."
        },
        {
            "text": "Most people who become infected with TBE will not have any symptoms; though it can cause flu-like symptoms and in a small number of cases can progress to more serious disease involving the central nervous system."
        },
        {
            "text": "The virus was detected in a small number of ticks in Thetford Forest and an area on the border between Hampshire and Dorset. While risk to the general population remains very low detecting the virus has allowed us to take precautionary measures to alert local areas and health protection teams."
        },
        {
            "text": "We also provide advice for local areas on how they can help more people become tick-aware as well as managing local habitats in the right way to maintain control of tick populations and reduce people’s exposure to ticks."
        },
        {
            "heading": 2,
            "text": "Climate change"
        },
        {
            "text": "Like all insects, mosquitoes are able to complete their life cycle and digest their blood meal at a much faster rate at higher temperatures, and if our climate warms this means that both our native mosquitoes could become more abundant and non-native species could establish."
        },
        {
            "text": "Milder winters and warmer temperatures can increase the survival of tropical species and can also favour the development of the pathogen in a mosquito. However, climate does not act alone. The movement of mosquitoes is helped by globalisation and the movement of goods or traffic harbouring mosquito eggs or adults."
        },
        {
            "text": "The movement of the virus is facilitated by the global travel of infected humans. Combine these factors with a warmer climate and they provide an increasingly suitable environment for disease transmission."
        },
        {
            "heading": 2,
            "text": "The future of vector-borne disease in the UK"
        },
        {
            "text": "It’s only a matter of time until we see a greater variety of diseases being transmitted by mosquitoes and ticks to humans in the UK. In 2020, Usutu virus was found in dead blackbirds in Greater London, with domestic mosquitoes also found infected, and it’s likely that warmer weather will lead to the emergence of other mosquito-borne viruses."
        },
        {
            "text": "Rather than waiting for more human cases to occur and investigating from a standing start, the work of the MEZE team will ensure that we continue to build our expertise to put the right interventions in place, at the right time to protect public health."
        }
    ]
}