{
    "url": "https://healthmedia.blog.gov.uk/2022/03/17/training-places-for-doctors/",
    "title": "Training places for doctors",
    "authors": [
        "DH Media Centre"
    ],
    "categories": [
        "Uncategorized"
    ],
    "pub_date": "2022-03-17T11:22:39+00:00",
    "content": [
        {
            "text": "The Foundation Programme is a two-year programme which doctors undertake after graduating to enable them to practise as a doctor in the UK."
        },
        {
            "text": "It precedes specialist or general practice training. A Foundation Programme (FP) post is a job – and foundation doctors work in the NHS, treating patients."
        },
        {
            "text": "These doctors will go on to be a valued part of the NHS workforce, with over 4,300 more doctors working in the NHS compared to last year, according to the latest statistics up to December 2021."
        },
        {
            "text": " "
        },
        {
            "text": "How does it work?"
        },
        {
            "text": "Once a medical student has graduated, they must apply for a Foundation Programme to continue their path towards becoming a more experienced doctor. Most applicants are UK students who have graduated from a government-funded place within a UK medical school."
        },
        {
            "text": " "
        },
        {
            "text": "What has happened this year?"
        },
        {
            "text": "This year, there have been record numbers of applicants for the 2022 Foundation Programme. 8,209 foundation training places were filled and 791 applicants were placed on a reserve list."
        },
        {
            "text": "This is a higher number than in previous years and, like in most recent years, the Foundation Programme is oversubscribed. We are aware this can be unsettling for people."
        },
        {
            "text": "That is why our plans ensure all those who want a place and graduate from medical school will be allocated one."
        },
        {
            "text": "The government, working with Health Education England and the UK Foundation Programme Office have already created an extra 402 Foundation Programme places to ensure the maximum number of students can start."
        },
        {
            "text": "We have also brought forward the allocation process for students on the reserve list to April (it normally happens in June) to reduce the period of uncertainty."
        },
        {
            "text": "This means everyone on the reserve list will be allocated their foundation school in April, moving into their Foundation Year 1 posts from August 2022."
        },
        {
            "text": " "
        },
        {
            "text": "Why is it oversubscribed?"
        },
        {
            "text": "The UK Foundation Programme works closely with UK medical schools to predict the number of graduates each year. However, there are additional students who are also able to apply, including students graduating from independent medical schools or those with an overseas campus, as well as those who have studied abroad."
        },
        {
            "text": "We cannot always predict with certainty how many of these additional students will apply each year, and there is also some fluctuation in the number of government-funded students who apply – for example due to students resitting exams or taking a year out."
        },
        {
            "text": " "
        },
        {
            "text": "What will happen to people on the reserve list?"
        },
        {
            "text": "To ensure everyone that wants a place and graduates from medical school will be allocated one, we have brought forward the allocation process so that everyone on the reserve list will be allocated their foundation school in April and will move in to their Foundation Year 1 posts from August 2022."
        },
        {
            "text": " "
        },
        {
            "text": " "
        }
    ]
}