{
    "url": "https://forestrycommission.blog.gov.uk/2022/03/17/tree-protection-thinking-about-risks-and-opportunities/",
    "title": "Tree protection – thinking about risks and opportunities",
    "authors": [
        "Forestry Commission"
    ],
    "categories": [
        "Woodland creation"
    ],
    "pub_date": "2022-03-17T09:30:19+00:00",
    "content": [
        {
            "heading": 2,
            "text": "Common damage by wild mammals"
        },
        {
            "heading": 3,
            "text": "Voles"
        },
        {
            "text": "Voles are typically found in rough grass swards that provide cover from predators. Levels of damage vary, but mostly occur in cyclical years of population abundance driven by plentiful food. They can attack trees at any time but particularly late winter to spring, typically gnawing bark at the base of the stem. Trees may recover from minor damage but will die if ring-barked."
        },
        {
            "heading": 3,
            "text": "Rabbits"
        },
        {
            "text": "Because of diseases rabbit numbers are much lower than in earlier decades, but they can still be found in hedgerows, on woodland margins or in areas with lighter soils. Unprotected young trees, particularly on the edges of plantations, can have buds and stems browsed. Bark can be stripped in the winter, particularly after snowfall."
        },
        {
            "heading": 3,
            "text": "Hares"
        },
        {
            "text": "Hard winters can drive hares into woodlands resulting in localised damage to young, unprotected trees. This can take the form of cleanly bitten-off leading shoots. Hares will sometimes attack a line of newly planted trees in a plantation."
        },
        {
            "heading": 3,
            "text": "Deer"
        },
        {
            "text": "Deer are our largest wild mammals and can damage young trees by browsing, fraying and occasionally bark stripping. The larger herding species (red, fallow and sika) are more damaging because of their higher reach and greater feeding demand. Deer impacts are proportional to population size. Although trees may recover from minor browsing, more severe damage can stunt growth. Bark fraying and stripping can lead to wind-snap, secondary fungal infections and tree mortality."
        },
        {
            "heading": 2,
            "text": "How can I reduce risk?"
        },
        {
            "text": "We can manage the level of risk from wildlife with:"
        },
        {
            "heading": 3,
            "text": "Assessments"
        },
        {
            "text": "This should start with a boundary walk of the planting site, looking out for signs of active mammal presence such as rabbit burrows, crop browsing, fresh droppings or tracks. A chat with neighbours can give a broader view about deer that might travel from adjacent properties to your new wood."
        },
        {
            "text": "This information can be used to support the choice of tree protection and a plan for on-going management to balance deer populations against likely impacts. These are key items for discussion with your Forestry Commission Woodland Creation Officer."
        },
        {
            "heading": 3,
            "text": "Woodland factors"
        },
        {
            "text": "Small planting projects such as field corners or clumps of trees can be vulnerable to livestock and are best protected by stock fencing, which can also deter deer."
        },
        {
            "text": "Larger projects can incorporate well-managed rides and open space as design features. In conjunction with shrubby margins that can provide alternative feeding, they will help in balancing deer impacts.\nThe risk of deer damage can be higher when planting next to an existing woodland on what might be a feeding area, which if fenced will divert impacts elsewhere."
        },
        {
            "heading": 3,
            "text": "Tree protection choices"
        },
        {
            "text": "Fortunately we have a wide range of options available. Used individually or as a mix, they can significantly reduce the risk of damage to young trees."
        },
        {
            "heading": 2,
            "text": "What are my protection options?"
        },
        {
            "heading": 3,
            "text": "Assist predatory species"
        },
        {
            "text": "Natural control of voles and rabbits can be supported by having a level of tolerance towards foxes, stoats and weasels; also by encouraging the presence of birds of prey. The erection of raptor perches and specialist nest boxes for kestrels and barn owls will foster local populations."
        },
        {
            "heading": 3,
            "text": "Weed control"
        },
        {
            "text": "The removal of tussocky grasses from around trees before planting will discourage vole activity as well as removing a significant plant competition factor for broadleaves and conifers. Spiral guards can be fitted to young broadleaf trees to deter the smaller mammals but are more effective in combination with a herbicide."
        },
        {
            "text": "A traditional method of dealing with unwanted grass growth is to screef or scrape away vegetation with a spade or mattock before planting. However grasses and weeds will soon grow back, and trees can be choked by competing vegetation inside shelters."
        },
        {
            "text": "A one-metre diameter spot-spray around trees, or a metre-wide line-spray with a herbicide can be a cost-effective method to control grass and deter voles. In turn the well-timed and correct use of a herbicide assists the speed of growth and resilient establishment of trees."
        },
        {
            "text": "However as concerns have been raised about impacts of herbicides on the environment and human health, it is worth examining alternatives that may work for your site or personal preferences."
        },
        {
            "text": "A half-metre radius of a deep woodchip mulch around each tree will help to suppress competing vegetation, repeat applications will be needed. Mulch mats are another alternative although voles can burrow underneath."
        },
        {
            "heading": 3,
            "text": "Tree shelters & guards"
        },
        {
            "text": "The micro-climate benefits of shelters that promote tree growth have made them a popular but relatively expensive method of protecting broadleaf trees. Appropriately used, they can deter the smaller mammals and protect young trees from low densities of deer. However, the larger deer species can push shelters over and browse the trees inside. Shrub shelters are shorter and will not prevent deer browsing, but localised use of temporary netting can help until shrubs are established."
        },
        {
            "text": "The litter of plastics often seen in older tree planting projects and the volume of tree shelters that have ended up in landfill, has made us all more aware of our responsibilities and the need to make informed purchases."
        },
        {
            "text": "A study by University College London in 2021 suggested that tree shelters made of recyclable polypropylene are preferable to the bio-based alternatives, such as bio-propylene and polylactic acid-starch blends. Research into sustainable alternatives continues."
        },
        {
            "text": "If you want to plant trees at lower densities to create parkland or wood pasture, but the larger deer species or grazing livestock are present, protection options can include a loop of mesh fencing supported by a fencing stake, or the use of timber tree guards."
        },
        {
            "heading": 3,
            "text": "Mesh fencing"
        },
        {
            "text": "Mesh stock fencing will usually suffice to protect small in-field plantings. Deer fencing should be considered for larger broadleaf and conifer plantations where deer pressure is high, especially when the larger species are present or visit from other land holdings. Small-mesh fencing at the base will deter rabbits and hares, as well as helping to prevent ingress by muntjac deer."
        },
        {
            "text": "Routine checks and maintenance of fences and gates are essential because deer will seek out weaknesses to enter fenced areas: through the mesh, under the fence line or beneath gates. Deer can be encouraged to leave by installing outward-facing deer leaps."
        },
        {
            "heading": 3,
            "text": "Electric fencing"
        },
        {
            "text": "Reusable multi-strand electric fencing can be an effective barrier for deer, particularly on smaller areas of coppice and to help ride-side shrubs get established, but deer must be able to see it. Regular checks are needed to ensure it does not short-out on vegetation and that the power supply is maintained."
        },
        {
            "heading": 3,
            "text": "Deer deterrents"
        },
        {
            "text": "If your situation makes fencing problematic and you do not favour tree shelters, the repeated application of lanolin-based spray-on deer deterrents such as Trico® might be considered if deer numbers are low. It is particularly effective on conifers that have year-round foliage."
        },
        {
            "heading": 2,
            "text": "Grant Funding"
        },
        {
            "text": "Tree planting objectives will vary and in recognition of this there are a variety of sources of grant funding and advice. The Forestry Commission’s England Woodland Creation Offer is countrywide and supports a range of woodland types. For smaller projects the Woodland Trust’s MOREwoods scheme may be appropriate, or if you live within the boundary of a Community Forest or the National Forest local support may be available. Schemes offer flexibility to fund a mix of measures to protect young trees, while expert advice can help to ensure that you have a resilient woodland project."
        },
        {
            "text": "Trees are a multi-generational investment so thinking about woodland design, and early-years protection will pay dividends in the long-term. After planting, trees need periodic inspection, a quick response to signs of mammal damage and tending to ensure successful establishment."
        }
    ]
}