{
    "url": "https://governmentscienceandengineering.blog.gov.uk/2022/03/17/ukhsa-international-health-regulations-ihr-strengthening-project/",
    "title": "UKHSA: International Health Regulations (IHR) Strengthening Project",
    "authors": [
        "Nadia Nisar"
    ],
    "categories": [
        "Guest Blog",
        "Our People & Deep Dives",
        "Outreach"
    ],
    "pub_date": "2022-03-17T16:30:03+00:00",
    "content": [
        {
            "text": "The UKHSA International Health Regulations (IHR) Strengthening Project is a UKAid funded project, to improve global health security through increased compliance with the WHO IHR (2005). The project works across Africa and Asia, to build technical capability of National Public Health Institutes, strengthen leadership and develop sustainable public health systems."
        },
        {
            "text": "In Pakistan, the IHR Project centers on Integrated Disease Surveillance Response (IDSR) and supports initiatives from strengthening multisector coordination and public health lab networks, to building workforce capacity through workshops and training programmes."
        },
        {
            "text": " "
        },
        {
            "heading": 3,
            "text": "Nadia Nisar – Health Management Information Analyst"
        },
        {
            "text": "I first joined the IHR Strengthening Project in Pakistan in early 2017. I am a specialist in information and data analysis, and I have used this expertise to support public health research studies, including the evaluation of multiple health and other social sector related indicators and services. I am also an experienced teacher, and have led trainings and workshops for public health professionals on bio-statistics, statistical software and research processes."
        },
        {
            "text": "When I first joined the UKHSA team, they were planning for their first Training of Trainers (TOT) for IDSR implementation, which was held in Islamabad. The event trained over 100 federal and provincial technical experts from across the country. These trainings were then cascaded to nine pilot districts across Pakistan, covering eight diseases. Since then, the training programme has expanded to cover 41 districts, covering 33 diseases. It’s been exciting to be a part of this extensive growth journey over the past few years!"
        },
        {
            "text": "I feel privileged as my working experience with UKHSA has benefitted both my professional and personal development. On a professional level, I have been able to adopt innovative and creative approaches to tackle challenges around health data. Over the last three years, I have put a lot of energy into building strong relationships with government stakeholders and partners to facilitate the smooth running of the core functions of IDSR and sustainable data flow. It’s been especially rewarding to support the roll-out of the District Health Information System 2 (DHIS2). This web-based data analytics platform allows public health actors to collect, analyse and present real-time health data on infectious diseases."
        },
        {
            "text": "My job is not without its challenges, the biggest of which is managing people and maintaining trustful relationships with our data partners. Over the years, our programme has grown, and we now have over 100 provincial IDSR data focal points across Pakistan. Initially, it was difficult to ensure the focal points regularly collected and submitted their data, which we rely on for accurate mapping and reporting. It was also challenging to engage the focal points in regular coordination calls. Over time, I’ve developed a relationship with stakeholders based on trust and mutual understanding. Focal points now see the value of the data they are collecting firsthand, and they know they can rely on UKHSA for troubleshooting support."
        },
        {
            "text": "Working with the IHR Project has also been rewarding on a personal level, as I believe UKHSA is really invested in staff wellbeing. Two years ago, I was in a tough personal situation which was adversely affecting my mental health. At the time, my supervisor prioritised my wellbeing, and sought to make my working environment as supportive as possible. I have lot of respect for UKHSA as an organisation, because it supported me when I needed it the most."
        },
        {
            "text": "Working with the IHR Project and UKHSA has been one of the most substantial experiences of my life and played a pivotal role in building my career and personal development."
        },
        {
            "text": " "
        },
        {
            "text": "Find out more about our project: "
        },
        {
            "text": "W: www.gph-ihrstrengthening.org"
        },
        {
            "text": "T: #IHR_Strengthening "
        }
    ]
}