{
    "url": "https://publicpolicydesign.blog.gov.uk/2022/03/17/using-doughnuts-to-deliver-shared-prosperity/",
    "title": "Using doughnuts to deliver shared prosperity",
    "authors": [
        "Claire Spencer"
    ],
    "categories": [
        "Case study"
    ],
    "pub_date": "2022-03-17T12:00:00+00:00",
    "content": [
        {
            "text": "Like many other local and combined authorities in the UK, the West Midlands Combined Authority (WMCA) has had cause to re-examine what good looks like when it comes to economic strength: or in the language of the here and now, levelling up. My role – a Senior Policy Advisor focused on inclusive growth – was created in recognition of the fact that the leadership of the WMCA wanted a different growth model, one which understood diversity, disparity and how that plays out in place, but didn’t yet know how that should be designed or delivered. This blog post reflects on how Kate Raworth’s ‘doughnut’ model has helped us to do both, what we have learned about it putting it into practice over the last three years, and what the road ahead of us might look like."
        },
        {
            "heading": 2,
            "text": "Understanding what people value"
        },
        {
            "text": "In the early days of considering what to do with the concept of inclusive growth, WMCA reached out to local civil society groups, notably those concerned with economic justice, and those who worked directly with the sort of citizens who most needed to participate in and benefit from a strong economy. In one of these sessions, a woman who did interfaith work in Sandwell turned to me and said “It’s the deathbed test, isn’t it? Valuing those things that people most reflect on when their life is coming to an end”."
        },
        {
            "text": "This was a sharp observation, and it had hit on something I had been trying to articulate. There are things that matter to human beings and to the world we inhabit, that do not feature in how we do economics. Whether it is the joy we experience from nature, the way that time spent with friends restores us, or the relief when our families are in good health – none of this value really counts, unless it can be monetised, or traded."
        },
        {
            "text": "It followed that if we were to do inclusive growth properly, then how we defined and articulated ‘what good looks like’ would have to overcome this flaw. This was not about sidelining growth, jobs, and trade – it was making space for other things that matter, valuable things, and thereby holding the economic activity we are trying to nurture to higher standards than before. Importantly, this revealed a key possibility – seeing the investment into public services, and the investments into economy and infrastructure, as working towards shared missions. The WMCA definition of inclusive growth alludes to this shared endeavour – but it needed to be made explicit, a lens which could be applied to what we do, and how we do it."
        },
        {
            "heading": 2,
            "text": "What good looks like: the Inclusive Growth Framework"
        },
        {
            "text": "This lens is what we now know as the Inclusive Growth Framework, structured using the logic from Kate Raworth’s Doughnut Economics. It has the climate change challenge and the restoration of the environment as the outer limit on growth, and the meeting of human needs and aspirations as the inner one. To achieve the eight missions of the framework is to achieve economic strength. The interconnectedness of each is recognised, and the opportunities and challenges inherent in that brought to the fore."
        },
        {
            "text": "Part of the challenge we had from the outset was ensuring that the framework did not become a data dashboard, filled with every indicator anyone could think of – this is a compass, not a map. To keep it focused, we tried to distil the essence of each section (or ‘fundamental’) into a bellwether mission – one which would tell us more than about itself alone:"
        },
        {
            "text": "Each of these missions has a headline indicator to underpin it, and three further indicators which capture greater breadth. So, for example, the Climate Resilience fundamental takes alignment to the WMCA carbon budget as its headline indicator and is backed by further indicators relating to access to green space, recycling rates and levels of fuel poverty. These indicators have – in most cases – a desired target, a present-day reality, and a view of previous returns to gauge whether things are moving in the right direction. In this way, a view of the ‘shortfall’ and ‘overshoot’ can be formed."
        },
        {
            "text": "Another important dimension to this is how we reflect disparities between population groups and places. The doughnut model is flexible enough to be recreated at multiple spatial levels, and the indicators that underpin it have been chosen so that"
        },
        {
            "heading": 2,
            "text": "How we have used it (so far)"
        },
        {
            "text": "In implementing the intentions of the Inclusive Growth Framework and the body of wider thinking it draws from, we borrow the terms ‘dark matter’ and ‘in the light’ – or if you like, embedding inclusive growth, and inclusive growth in action. A few examples of what it has enabled us to do are as follows:"
        },
        {
            "heading": 2,
            "text": "What’s next?"
        },
        {
            "text": "To date, the framework has been used, substantially, to shape vision and to tend live work to the good – it shows what we want to achieve and is a useful lens for working out what is missing. WMCA has not yet used it to hold itself accountable, as an institution or as a region. Indeed, it is not entirely straightforward to do so. After all, the WMCA and its local authorities are not the only institutions that change – for example – healthy life expectancy. And it is not in the spirit of systems thinking and leadership to claim an outcome (positive or negative) as belonging to one partner above all others. Nonetheless, there is a clear opportunity to use this to drive our understanding of what is working, what isn’t, and the relationship between those things – and this is something we are hoping to explore in the coming months. There seems to be a particular opportunity around internal audit, which we are keen to develop further."
        },
        {
            "text": "The WMCA’s Applied Inclusive Growth team is also keen on making the Inclusive Growth Framework more inclusive by introducing a community research component – a regular heartbeat of conversation with those people who most need this to work, to check against the quantitative data. This is not about taking the experience of (e.g.) 100 people and trying to extrapolate it – rather, the objective is to compel us to find those 100 experiences when drawing insight from the data and asking ourselves harder questions if we cannot."
        },
        {
            "text": "Crucially, we know this is work that needs to span generations – and we are planting the seeds and building the networks of fellow travellers who will make it possible to act this way in the long run."
        },
        {
            "text": " "
        },
        {
            "text": " "
        }
    ]
}