{
    "url": "https://governmentscienceandengineering.blog.gov.uk/2022/03/17/using-data-to-measure-progress-in-climate-adaptation/",
    "title": "Using data to measure progress in climate adaptation: Workshops",
    "authors": [
        "Jamal Arabi"
    ],
    "categories": [
        "Collaborating & Networking",
        "GSE Opportunities"
    ],
    "pub_date": "2022-03-17T17:11:37+00:00",
    "content": [
        {
            "text": "In order to effectively monitor and evaluate progress in adaptation to climate change, it is recognised that a suite of indicators will be required to support this process. In order to develop suitable, robust and consistent metrics (data) are required. These data may be collected for a variety of reasons, but could have the potential to be utilised within an adaptation context."
        },
        {
            "text": "Defra are aware there is much ongoing work in government that may support this need, including the collection of data (metrics) that could be used as proxies for measuring adaptation, and the development of indicators to help monitor progress in adaptation (e.g. Outcome indicator framework for the 25 Year Environment Plan (defra.gov.uk))."
        },
        {
            "text": "To support in the development of the UK’s third National Adaption Programme (NAP3), which will systematically address the 61 risks and opportunities highlighted in the UK’s third climate change risk assessment (CCRA3), the Defra Adaptation Evidence team is holding several sector-specific workshops to consider metrics and indicators that can be used for measuring progress in adaptation through a monitoring and evaluation framework."
        },
        {
            "text": "The workshops seek to bring together data owners, holders and users to expand Defra’s current understanding of what is going on in this space and augment a collaborative environment for enhancing data access. Furthermore, we seek to understand the challenges and opportunities experienced by organisations that have developed indicators (particularly within a resilience or adaptation context), as well as understand the lessons learnt and complexities of collecting, sharing and aggregating relevant data."
        },
        {
            "text": "We have four thematic workshops planned, focussed on specific sectors:"
        },
        {
            "text": "The workshops are primarily aimed towards data analysts from across government, arm’s length bodies, academia and other organisations, although policy leads are also welcome to join."
        },
        {
            "text": " "
        },
        {
            "text": "If you would like to join one of these workshops or have questions, please email megan.bickle@defra.gov.uk."
        }
    ]
}