{
    "url": "https://hmlandregistry.blog.gov.uk/2022/03/17/what-do-we-do-with-customer-feedback/",
    "title": "What do we do with customer feedback?",
    "authors": [
        "Richard Turner, Customer Insight and Experience Manager"
    ],
    "categories": [
        "Law and practice"
    ],
    "pub_date": "2022-03-17T09:04:02+00:00",
    "content": [
        {
            "text": "Our customers’ voices are heard clearly across HM Land Registry. They are central to the planning of services and products as well as measuring our performance. We put a tremendous amount of effort into learning from our customers, through open and candid discussions of the Industry Forum and other key stakeholder groups, by attending events where customers can feed back to us directly and conducting rolling surveys to gather views on a variety of topics. All of these engagements ensure customer voices are heard when key decisions are being made."
        },
        {
            "heading": 2,
            "text": "How we obtain feedback"
        },
        {
            "text": "On a regular basis, the Customer Insight team, which I head up, asks thousands of customers for feedback on the products and services we offer. Many hundreds of you take the time to respond by filling in our surveys or taking part in discussions, forums or focus groups to let us know how you feel, your opinions and the experience you have had. The feedback we look at comes from a variety of sources, and also includes complaints from customers."
        },
        {
            "heading": 2,
            "text": "Who’s responsible for collecting feedback?"
        },
        {
            "text": "The Customer Insight team is comprised of researchers and analysts, all with a wealth of experience. We work to Market Research Society standards to ensure that results are presented in a non-biased, representative way and personal data is protected. Most importantly, the team ensures the customer’s voice is heard and represented throughout every aspect of what HM Land Registry does."
        },
        {
            "heading": 2,
            "text": "What do we do with what we learn?"
        },
        {
            "text": "So, what happens to this valuable insight? Does it end up in a forgotten report in someone’s inbox?"
        },
        {
            "text": "In short, no – the insight we gather from feedback is immensely valuable. As such, we don't just look at summary charts and percentages. A member of the team reads and categorises every single comment our customers make. The percentages give us the rough outline, but it's the words our customers write that provide the colour, painting a picture of how they view our services."
        },
        {
            "text": "It’s not always easy reading; we can feel their frustration when things are not how they’d like them to be – but we also see so many positive comments."
        },
        {
            "text": "Whether positive or negative, your feedback has and is helping us identify and deliver improvements to our services."
        },
        {
            "heading": 2,
            "text": "You said, we did"
        },
        {
            "text": "These are just a few examples of what we’ve done or are working on following customer feedback. We will continue to seek and act on feedback as a key part of our decision-making process. If you have shared your views with us in any of these ways – thank you. Your perspective is invaluable as we strive to provide the best service possible to our customers."
        },
        {
            "text": "If you have any feedback on any of our services, please contact customerinsighteam@mail.landregistry.gov.uk."
        }
    ]
}