{
    "url": "https://teaching.blog.gov.uk/2021/06/30/connection-creativity-and-fun-lets-get-ready-for-our-summer-school/",
    "title": "Connection, creativity and fun: let’s get ready for our summer school!",
    "authors": [
        "Andria Zafirakou"
    ],
    "categories": [
        "COVID-19 support",
        "Pupil premium & PE premium",
        "Pupil wellbeing and behaviour",
        "Secondary schools"
    ],
    "pub_date": "2021-06-30T10:12:56+01:00",
    "content": [
        {
            "text": "Andria Zafirakou is the 2018 Global Teacher Prize winner and arts and textiles teacher at Alperton Community School in North West London. She tells us why summer school matters and what she’s looking forward to. "
        },
        {
            "text": "Could you tell us a little about Alperton’s summer school and how it will work?"
        },
        {
            "text": "Yes! There are two things that concern young people transitioning from primary to secondary school, which are ‘will I make friends?’ and ‘will I get lost?’. Alperton’s summer school is about encouraging our new pupils to bond as a year group, connect to our school community and to feel comfortable and confident in their new school environment through fun, engaging activities."
        },
        {
            "text": "To do this, we’re inviting our incoming Year 7 cohort into their new school for the first two weeks of the summer holidays. Days will be shorter, lasting from 10am-2pm, to allow pupils to enjoy time outside of the classroom, and the year group will be split in two, each attending summer school for one week so the transition feels more manageable."
        },
        {
            "text": "What were the practicalities of setting up your summer school?"
        },
        {
            "text": "We were mindful that teachers have been under a lot of pressure this year and that they need a break so it’s been important for us to be able to offer them flexibility and support, so that they deliver an incredible experience of a high-quality summer school."
        },
        {
            "text": "We also want to balance the academic outcomes of summer school, such as maths, literacy and science provision, alongside the wellbeing of our young people. We’ve encouraged our staff to be creative in their sessions, to think outside the box and create new experiences for pupils while still developing their social skills. And, of course, we want them to enjoy themselves and have fun too!"
        },
        {
            "text": "How is summer school different from term time? "
        },
        {
            "text": "Summer school is all about welcoming and supporting pupils in their next huge life step. It’s about creating opportunities for young people to have fun and get to know each other! We want to take this time for them to feel comfortable, settled, make friends and get familiar with their new school without the pressures that come with the start of a new school year."
        },
        {
            "text": "Why do you think summer school is needed this year?"
        },
        {
            "text": "I was really excited when I heard about the idea of summer schools, as I knew how much it would support pupils with the transition to secondary school. This can be challenging at any time, let alone after such a disruptive and unusual year. One thing that we were mindful of was that many of our new Year 7s would not have stepped foot in a secondary school before, so we hope that summer school will build their confidence and give them something to look forward to. The pandemic has been especially difficult for these children and I hope this opportunity gives us a chance to give them a bit of optimism and excitement for the future!"
        },
        {
            "text": "What role will creativity play in your summer school and why is this important?"
        },
        {
            "text": "We will are basing our summer school on some of Bill Lucas’ model of creativity, encouraging pupils to develop creative thinking skills such as being inquisitive, imaginative, and collaborative."
        },
        {
            "text": "Our lesson programme in summer school is infused with creativity – from food technology to art to science, dance, music, literacy and geography – because we know the positive impact this can have on students’ academic work, alongside their social and emotional wellbeing. This is our time to really be imaginative with our teaching and to have fun with what we deliver."
        },
        {
            "text": "Do you have any top tips for students over the summer?"
        },
        {
            "text": "Get outside and explore, spend time with your friends and family and get excited for what’s next. Be curious about getting back to school, whether that’s starting a new school in Year 7 or going into your GCSE year. We’ve also spent a lot of time this year teaching digitally, so make sure you have some screen-free time by getting active, playing outside, curling up with a good book or getting creative in the kitchen. Do your thing and have fun! We look forward to meeting you all soon!"
        },
        {
            "text": " "
        },
        {
            "text": "Find out more about the summer schools programme"
        },
        {
            "text": "Face-to-face summer schools can offer your pupils a blend of academic support and enrichment activities. You can read the summer schools guidance and find out your school’s funding allocation. To secure funding, schools should confirm arrangements for their summer school by completing the confirmation form by 30 June."
        },
        {
            "text": "Want to receive blog posts in your inbox?"
        },
        {
            "text": "Sign up to receive blog updates."
        }
    ]
}