{
    "url": "https://teaching.blog.gov.uk/2021/06/30/getting-the-most-out-of-summer-schools/",
    "title": "Getting the most out of summer schools",
    "authors": [
        "Vicky Pinkney"
    ],
    "categories": [
        "COVID-19 support",
        "Pupil premium & PE premium",
        "Pupil wellbeing and behaviour",
        "Secondary schools"
    ],
    "pub_date": "2021-06-30T10:12:58+01:00",
    "content": [
        {
            "text": "Vicky Pinkney is Associate Principal of Dyke House Academy in Hartlepool and lead for summer schools at Northern Education Trust. She shares how they will make the most of their school’s exciting summer school plans to support pupils’ transition into secondary school."
        },
        {
            "text": "Our academies at Northern Education Trust strive to help young people overcome any barrier to learning. That’s why this year, all our secondary academies are running summer schools focusing on year 6 students who will be our new year 7 in September."
        },
        {
            "text": "This is a great opportunity for our new year 7 students to make friends, meet staff and find their way around the building. For the majority of our academies, the summer school will take place in the first 2 weeks of the summer holidays and involve a wide variety of activities including sports, drama, games and literacy."
        },
        {
            "text": "Supporting over 1,000 students"
        },
        {
            "text": "The funding allocated by the DfE will allow us to support 1,066 students who will be joining our academies in September."
        },
        {
            "text": "The aim of our summer school programme is to offer a blend of academic education and enrichment activities. Our objectives are:"
        },
        {
            "text": "Robust risk assessments have been developed in order to ensure the summer schools are COVID secure."
        },
        {
            "text": "Our summer school theme "
        },
        {
            "text": "Our theme is based around the book ‘The Miraculous Journey of Freddie Yates’ by author Jenny Pearson, and this theme runs throughout the literacy sessions. We are delighted that the author of the book will be leading the morning sessions on the first Wednesday. This will happen virtually so all students can take part and it will also be recorded for those academies running their summer schools on different dates. The children will also receive a copy of the book as part of their Student Resource Pack free of charge."
        },
        {
            "text": "What each day will look like "
        },
        {
            "text": "Each morning has been planned to have a clear focus on developing students‘ literacy skills in an interactive and engaging manner and the afternoon is about developing student confidence, building positive relationships and having a positive impact on student mental health and wellbeing."
        },
        {
            "text": "Staff interest in running sessions has been very positive. The morning session will be planned and resourced in advance and all teachers are teachers of literacy. Staff decide whether they want to lead an afternoon session or support an external coach."
        },
        {
            "text": "How we’re engaging with parents and pupils "
        },
        {
            "text": "We are very excited about our summer schools and cannot wait to welcome our new students!"
        },
        {
            "text": " "
        },
        {
            "text": "Find out more about the summer schools programme"
        },
        {
            "text": "Face-to-face summer schools can offer your pupils a blend of academic support and enrichment activities. You can read the summer schools guidance and find out your school’s funding allocation. To secure funding, schools should confirm arrangements for their summer school by completing the confirmation form by 30 June."
        },
        {
            "text": "Want to receive blog posts in your inbox?"
        },
        {
            "text": "Sign up to receive blog updates."
        }
    ]
}