{
    "url": "https://ipo.blog.gov.uk/2021/06/30/ip-protected-gender-inclusive-underwear-thats-wilde/",
    "title": "IP-protected, gender-inclusive underwear? That’s Wilde!",
    "authors": [
        "Imogen Percival"
    ],
    "categories": [
        "Business",
        "Copyright",
        "Design",
        "Inclusion and diversity",
        "Innovation",
        "Trade marks"
    ],
    "pub_date": "2021-06-30T10:10:59+01:00",
    "content": [
        {
            "text": "There can be very few clothes designers who can create bespoke pants for every shape and size, from your youngest cousin to your grandad. But Dundee-based designer, Deborah, does exactly that as she sells clothes from sizes XXS to 6XL."
        },
        {
            "text": "Her business, Wilde Mode, creates underwear and accessories for everyone, by ensuring her products are sustainable, sensory-friendly, vegan and cruelty-free as well as gender and size inclusive. She protects her designs from copycat products using intellectual property rights."
        },
        {
            "text": "Deborah Breen of Wilde Mode"
        },
        {
            "text": "We asked Deborah about how she’s championing inclusivity, why it’s so important to her as a business owner, and how it all began."
        },
        {
            "heading": 3,
            "text": "Sew it begins"
        },
        {
            "text": "“Wilde Mode grew out of sewing as therapy. I started by making children’s clothing and sold the items through an online shop, but I wanted something bigger than that. So, I went to college and opened my own space at a business incubator. I had one little sewing machine and a desk!”"
        },
        {
            "heading": 3,
            "text": "Taking a turn"
        },
        {
            "text": "Deborah then began a business course which caused her to change path: “I realised the market for children’s clothing was very difficult as I handmake each item, and children can quickly outgrow clothes. But at that time, I was sewing my own pants, so I quickly pivoted my business idea to make underwear and loungewear.”"
        },
        {
            "text": "From here Deborah used funding to expand her business and create Wilde Mode. “I never thought that 3 years later I’d be sitting in an office of my own with staff and my own workshop, it’s quite phenomenal!” she exclaims. Wilde Mode’s success has led to the need to expand - Deborah is hiring at the time of writing."
        },
        {
            "heading": 3,
            "text": "Empowering you from the bottom up "
        },
        {
            "text": "Wilde Mode makes clothes for everyone, catering for all sizes and even customising patterns for special requests. Deborah has a simple message “If you’ve got a body then you can wear the clothes. Wear good quality items that will last well and won’t irritate you.” That will “empower you from the bottom up.”"
        },
        {
            "text": "Wilde Mode is all about making everyone feel comfortable and confident. “As a brand, we support all people, all ethnicities, all cultures, all sexes, all genders and all races. People are people...and I love people!”"
        },
        {
            "text": "Deborah sets out to empowers potential customers with her branding, including encouraging all shapes and sizes of people to model in her product images. She told us that she doesn’t go looking for models. “I just ask people. If you’re a person and you want to show your stuff off, send me a photo!”"
        },
        {
            "heading": 3,
            "text": "Rainbows - not just for Pride Month "
        },
        {
            "text": "One noticeable feature on many of the Wilde Mode designs is the rainbow band. But they’re not just for Pride Month."
        },
        {
            "text": "As a champion of all genders and sexualities, Wilde Mode  created “Love is a Rainbow” briefs for Pride Month 2021, made from a design of hand-drawn multicoloured hearts. The business is also working with ‘Somewhere For Us’, a Scottish LGBTQ+ magazine, to raise awareness of inclusivity in clothing."
        },
        {
            "heading": 3,
            "text": "Not a piece wasted "
        },
        {
            "text": "A self-confessed hoarder, Deborah explained that she doesn’t like to waste anything and will save even the smallest scrap to reuse. Wilde Mode also works closely with a local Dundee charity, ‘Uppertunity’, by donating fabric pieces that they don’t use in their clothing."
        },
        {
            "text": "By making each item to order, there’s no mass producing at Wilde Mode, showing how slow fashion is the sustainable future of the fashion industry. This method not only helps the environment but ensures each item fits, is comfortable and is loved."
        },
        {
            "heading": 3,
            "text": "The tale of David and Goliath "
        },
        {
            "text": "Deborah protected her business’ intellectual property (IP) through trade marks, registered designs and copyright."
        },
        {
            "text": "She worked with a trade mark attorney, telling them about her brand and what it meant. They discussed if she had any IP and she did, leading her to register her special designs and file trade marks for Wilde Mode’s creations."
        },
        {
            "text": "This paid off, as in 2020, Wilde Mode won a lawsuit against a large fast fashion brand, who had copied one of their designs. The fact that Deborah had taken the steps to secure her intellectual property meant she had the backing to protect her designs."
        },
        {
            "text": "“My IP has meant that I may be small but it made me mighty. It’s a bit like David and Goliath. Because I won, it tells other people that I’m deadly serious and that intellectual property is important. There’s no point in starting a business if you’ve not got any.”"
        },
        {
            "heading": 3,
            "text": "“IP: worth its weight in gold”"
        },
        {
            "text": "After her experience, Deborah advised other small businesses to secure their IP by speaking to an IP attorney and exploring funding options."
        },
        {
            "text": "And what’s Deborah’s best advice for anyone starting out with a business of their own?"
        },
        {
            "text": "“I would say to people don’t be scared, there’s places out there where you can get grants to help with your IP.”"
        },
        {
            "text": "“I was given a grant from my local council who paid half of the IP application fees, an angel investor paid the other half for me and when my business was able to grow, I was able to pay them back.”"
        },
        {
            "text": "Wilde Mode promotional posters"
        },
        {
            "text": "So, if you’re starting a new business like Deborah did, we would recommend that you take time to consider what intellectual property you may have, so you can protect it."
        }
    ]
}