{
    "url": "https://dluhcdigital.blog.gov.uk/2021/06/30/mhclg-launch-two-beta-planning-products/",
    "title": "MHCLG launch two beta products in a first step towards digital planning reform",
    "authors": [
        "The Local Digital team"
    ],
    "categories": [
        "Digital Planning",
        "Local Digital"
    ],
    "pub_date": "2021-06-30T11:51:30+01:00",
    "content": [
        {
            "text": "We’re pleased to announce the launch of a private beta of two new council-led digital planning products, funded by MHCLG’s Local Digital Fund. This is an exciting step towards 21st Century digital planning systems that use data and human-centred design to make applying for planning permission significantly simpler, faster and easier to understand."
        },
        {
            "text": "During this test phase, the Reducing Invalid Planning Applications (RIPA) and Back-office Planning Systems (BoPS) projects are launching beta products to process lawful development certificate (LDC) applications. The participating councils are inviting residents that need an LDC to use the new service, so that the teams can collect user feedback as they continue to improve the products to process other types of planning application. This is one of the important first steps towards digital planning reform."
        },
        {
            "text": "The projects are being led by three pioneer councils: Southwark, Lambeth and Buckinghamshire. With cross-council collaboration at the core, these projects have been developed in partnership with a range of local authority partners, including Northumberland and Camden Councils."
        },
        {
            "heading": 2,
            "text": "Transforming digital planning"
        },
        {
            "text": "The current planning system has not effectively adopted internet era innovations, resulting in a service that’s difficult to navigate and that only 1-3% of residents engage with."
        },
        {
            "text": "In the Planning for the Future whitepaper, published in August 2020, MHCLG outlined its intention to move the planning system towards a modernised, data-driven approach. To achieve this, MHCLG is adopting a collaborative and co-creation approach with local government on the reforms."
        },
        {
            "text": "The funding and co-creation of the RIPA and BoPS projects is at the forefront of this approach. The two projects are focussing on householder application types, which are one of the most common applications submitted into the planning system."
        },
        {
            "text": "Designed with significant inputs from planning officers, and after extensive iteration based on user feedback, the resulting service will make applying for planning permission simpler for both applicants and local authority planners."
        },
        {
            "heading": 2,
            "text": "RIPA: Improving the complex planning application process"
        },
        {
            "text": "In the three partner councils, up to 50% of all planning applications are 'invalid' or missing key information on receipt and need to be resubmitted, causing significant delays. The RIPA project, led by the London Borough of Lambeth in partnership with Buckinghamshire Council, is simplifying and streamlining the complex planning application process."
        },
        {
            "text": "The project was first awarded funding by MHCLG in October 2019 for an alpha to develop a user-centred system that reduces the number of invalid or incomplete digital planning applications. It has subsequently been awarded funding for a beta, the private version of which is now ready for testing with real applications. Delivery partner Open Systems Lab has supported the team throughout."
        },
        {
            "text": "The RIPA tool makes planning processes, policies and requirements as clear as possible. It does not ask applicants to research information that is already known by the planning authority. Applicants are shown the reasons behind any rule or decision, referenced all the way back to policy, legislation or case law."
        },
        {
            "text": "For the end user, the tool provides a number of new features. These include the ability to:"
        },
        {
            "heading": 2,
            "text": "BoPS: Unlocking the potential for transformation in town planning"
        },
        {
            "text": "Local Planning Authorities rely on digital technologies to receive and process applications, allowing planning officers to perform the day-to-day tasks that keep the planning system ticking over."
        },
        {
            "text": "Partner councils have highlighted some of the main opportunities to improve existing software products, which could be better designed around the needs of the planning officers who use the system on a regular basis."
        },
        {
            "text": "In December 2018, the London Borough of Southwark and 3 partners were awarded funding for a discovery phase to understand the software ecosystem needed to unlock the potential for digital transformation in planning."
        },
        {
            "text": "With further funding from the Local Digital Fund, they subsequently developed the beta version of the BoPS tool with further support from delivery partner Unboxed. The tool delivers a number of benefits for users, including:"
        },
        {
            "text": "By translating planning laws into usable data, applications can be submitted and processed more swiftly by local authorities. By streamlining the process, the tool will enable planners to focus on decision-making."
        },
        {
            "text": "As well as benefitting planners, the products that BoPS and RIPA are developing will also benefit the general public. Applying for planning permission will be simpler and faster, and by making planning policies and requirements easier to understand, homeowners will not have to be expert planners to put forward simple planning applications."
        },
        {
            "heading": 2,
            "text": "What happens now"
        },
        {
            "text": "As this is a private beta launch, the councils will be testing the tool with a small group of users initially. We also know there are still some things to fix, including making the tool fully accessible."
        },
        {
            "text": "However, this is the first of many things to come and we’re excited to be co-creating with councils to find out what works and to iterate accordingly."
        },
        {
            "text": "The outputs will be openly shared in such a way that they can be easily adapted and adopted by any local authority or private sector company wishing to provide a digital planning submissions service."
        },
        {
            "text": "If you would like to find out more about the projects, please email support@localdigital.gov.uk."
        },
        {
            "text": "In addition to the tools being launched today, MHCLG has taken another significant step towards reform through the pathfinder programme. We are testing how best to digitally transform local plans, and are working with 10 councils to test the use of digital tools in the planning process. Read more about the Pathfinder programme."
        },
        {
            "heading": 2,
            "text": "Follow the projects"
        },
        {
            "text": "Get up to speed on the BoPS and RIPA projects and follow their progress through private beta."
        },
        {
            "heading": 3,
            "text": "BoPS:"
        },
        {
            "heading": 3,
            "text": "RIPA:"
        },
        {
            "text": "You can also read fortnightly updates in our Local Digital sprint notes or subscribe to our newsletter."
        }
    ]
}