{
    "url": "https://ofsi.blog.gov.uk/2021/06/30/reasonableness-in-licensing/",
    "title": "Reasonableness in licensing",
    "authors": [
        "OFSI"
    ],
    "categories": [
        "Financial sanctions",
        "Implementation",
        "Licensing",
        "UK"
    ],
    "pub_date": "2021-06-30T12:23:32+01:00",
    "content": [
        {
            "text": "If you are applying for a licence from OFSI to release otherwise frozen funds for legal fees or the maintenance of frozen funds or economic resources, you will likely come across the term “reasonableness”."
        },
        {
            "text": "When issuing a licence to enable the payment of professional fees and expenses for the provision of legal services, OFSI is legally obliged to ensure that those fees and expenses are \"reasonable\"."
        },
        {
            "text": "OFSI’s Introduction to licensing blog, which was published in April 2021, set out the key changes to licensing under the Sanctions and Anti Money Laundering Act (the Sanctions Act) that came into effect from 23.00 on 31 December 2020. The following changes to reasonableness now apply:"
        },
        {
            "text": "OFSI receives many applications where applicants have not provided sufficient evidence of reasonableness or with no evidence at all. This could be because the applicant may not understand the full policy intention behind the regulations that need to be considered in parallel, or the justification submitted may be one-sided in the applicant’s favour. However, OFSI requires a significant level of evidence when scrutinising the reasonableness threshold. This is because the Sanctions Act which gives us the power to issue these licences, also stipulates that legal fees and maintenance of frozen funds should be ‘reasonable’. When we don’t receive the level of detail that we need, we will need to engage with the applicant for these further details. This can invariably cause delays in processing such licence applications and, in some cases, may result in the refusal of the licence application if further information is never provided. OFSI does not want to cause delays to the consideration and issuance of any of our licences, so this blog is aimed at setting out what information we need to consider when identifying if an application is “reasonable”."
        },
        {
            "text": "Financial sanctions are a foreign policy tool. In the UK they are implemented through UK legislation (which sometimes applies restrictions imposed through the UN) in order to achieve a specific foreign policy or national security objective. Financial sanctions are generally imposed to:"
        },
        {
            "text": "As the competent authority for the implementation of financial sanctions in the UK, OFSI has to ensure that any permitted release or use of frozen funds maintains the integrity of the financial sanctions regime, supports the foreign policy ambition and that the  decision to release remains in line with its legal duty under UK law. The term ‘reasonable’ is written in to the Sanctions Act which means there is a legal requirement both for OFSI to assess this and for applicants to provide evidence of why a payment is reasonable."
        },
        {
            "text": "If you are in possession of an OFSI licence that permitted the use of frozen funds for the payment of legal fees/maintenance under the previous EU regulations,  you may need to provide a new explanation for reasonableness, if that licence requires an amendment. In addition, if you were granted a licence that has now expired after only being partially used, or not used at all, any new application will need to meet the new requirements as set out under the Sanctions Act for the regime. This should include explaining and/or evidencing the reasonableness of the payments. Licence extensions under derogations that have reasonableness written into them will need to undergo ‘reasonableness’ assessments again. This can be done by providing evidence such as previous invoices against the licence to assist OFSI in its determination that the costs remain reasonable and whether all of the licence is being used in the same way  that it was when the licence was initially granted."
        },
        {
            "text": "The two licensing derogations under the Sanctions Act that include a ‘reasonableness’ test are ‘legal services’ and ‘maintenance of funds or frozen resources’. We have broken them down below and have outlined the types of questions that applicants may wish to consider when applying under these specific licensing grounds."
        },
        {
            "heading": 3,
            "text": "Legal Services"
        },
        {
            "text": "It is for the applicant to demonstrate to OFSI that the legal fees and expenses they are requesting payment for are reasonable. OFSI considers that the Supreme Court Cost Guidelines (SCCG) or the sums that could be expected to be recouped if legal costs were awarded following civil court proceedings, provide a useful starting point for assessing the reasonableness of legal fees and expenses. If you seek fees of a level above those set out in the SCCG, you need to demonstrate why those increased fees are reasonable in the given case. Whilst we will consider rates that vary from the SCCG, it is a useful benchmark in the assessment of reasonableness."
        },
        {
            "text": "When applying to for a legal fees and expenses licence, you should consider addressing the following in your application form:"
        },
        {
            "text": "If you are requesting a licence amendment to permit an increase in the hourly rate of fee earner(s) you should provide a detailed explanation. For example, this may be a breakdown and evidence of the firm's running costs to explain the proposed increase. When OFSI reviews such amendments, it is not enough to cite for example, “an engagement letter between the DP and the law firm” which provides for an annual increase, nor that it is a “common practice amongst law firms”. As set out in OFSI’s guidance, legal services may be provided without a licence, but any payments for legal services provided, do require a licence."
        },
        {
            "text": "In terms of legal professional privilege (LPP), OFSI expects legal professionals to carefully ascertain whether LPP applies and which information it applies to. It is not generally considered that fees notes and narratives of work (in generic terms) are privileged as they do not constitute the giving or obtaining of legal advice. OFSI may challenge a blanket assertion of LPP where it is not satisfied that such careful consideration has been made. For example, simply providing the cost of a workstream without providing a breakdown due to LPP is not satisfactory. This is because OFSI is unable to undertake a reasonableness assessment without having a breakdown of the individual legal cost for each area of work."
        },
        {
            "text": "Maintenance of funds and frozen resources"
        },
        {
            "text": "Under the derogation of ‘Maintenance of funds and frozen resources’, licences may be issued for a number of purposes. These can range from the supply of Covid-related personal protective equipment, to property maintenance. When a licence application or amendment request is submitted under this derogation, sufficient evidence will need to be included for OFSI to make a decision. When applying, you should consider the following in your application form:"
        },
        {
            "text": " "
        },
        {
            "text": "For any applicant that is submitting a licence application under a derogation that has ‘reasonableness’ written in to the regulations, you should use your own best judgement and not assume OFSI understands the process and practice of the profession when providing your response. We understand that reasonableness may have different meanings in different contexts and applicants should note that just because a payment has been licensed on a previous case, does not automatically mean that it will necessarily be licensed again. This is why OFSI considers each application on a case by case basis and the above pointers serve as a guideline of best practice when engaging with us."
        },
        {
            "text": "For further information on licensing and financial sanctions implementation, please refer to OFSI’s general guidance."
        },
        {
            "text": "To keep up to date with OFSI news and updates, do subscribe to our e-mail alert service, or contact us directly at OFSI@hmtreasury.gov.uk"
        }
    ]
}