{
    "url": "https://socialcareinspection.blog.gov.uk/2021/06/30/the-early-years-sector-a-changing-picture/",
    "title": "The early years sector – a changing picture",
    "authors": [
        "Yvette Stanley",
        "Jason Bradbury"
    ],
    "categories": [
        "childminder agencies",
        "childminders",
        "early years"
    ],
    "pub_date": "2021-06-30T11:05:29+01:00",
    "content": [
        {
            "text": "Yvette Stanley, our National Director for Regulation and Social Care, and Jason Bradbury, Deputy Director, Data and Insight, discuss our latest early years and childcare statistics."
        },
        {
            "text": "The first few years of a child’s life are incredibly important, laying the building blocks for their future learning and development. From childminders to nursery workers, all early years practitioners play a crucial role in supporting young children and their parents. Many have continued this remarkable work throughout the pandemic, in the face of great challenges."
        },
        {
            "text": "As the early years regulator, it’s important for us to reflect on any changes in the sector and what this might mean for children and families. Today, we published our latest early years and childcare statistics. We’ve seen a downward trend in the number of providers, childminders specifically, over many years, and this continued through the COVID-19 pandemic. In this post, we discuss what our figures mean in the context of long-term trends in the sector."
        },
        {
            "heading": 3,
            "text": "Fewer providers in the sector"
        },
        {
            "text": "We’ve been reporting on the number of childcare providers since we started regulating and inspecting early years and childcare in 2001. Back in 2003, when we published the first ‘national picture’ of the early years and childcare landscape, there were around 99,000 childcare providers. As of the end of March this year, the overall number of childcare providers stands at around 72,000."
        },
        {
            "text": "While on the face of it this is a big drop, the overall picture is more complex. The number of places available for children in early years settings has remained relatively steady since 2015, despite the reduction in the number of providers. According to our latest figures, there are currently 1.3 million places available for children in nurseries and with childminders."
        },
        {
            "text": "In part, this may be down to the types of childcare providers that are leaving and joining the register. For example, childminders, who can only provide 6 childcare places unless they have an assistant, are leaving the register at a higher rate compared with nurseries, which can care for a much larger group of children, whose numbers remain fairly stable. We also know the number of places that providers offer has been increasing over time. It is important to look at the total number of childcare places as well as the total number of providers to really understand the bigger picture. We know less about whether this changing pattern of childcare is meeting parents’ needs. This is something we want to explore in the coming months."
        },
        {
            "text": "The pandemic has been a challenging time for everyone, and childcare professionals are no exception. It’s difficult to say how much of the change in the number of childcare providers is because of the effects of the pandemic, but we’re still hearing about how providers are being negatively impacted by closures due to self-isolation rules and rising costs. In the year before the pandemic, we saw a 5% reduction in childminders, and there was a further 6% reduction in this past year."
        },
        {
            "heading": 3,
            "text": "Childminder agencies"
        },
        {
            "text": "Although the number of childminders registered with Ofsted has been falling for some time, childminders can also choose to register with childminder agencies (CMAs) rather than registering directly with us. CMAs are organisations that register childminders and provide them with training, advice and other types of support. If you want to find out more about what they do and who they are, there is information available on the Foundation Years website."
        },
        {
            "text": "Agencies vary in size, from quite small to having hundreds of childminders registered with them. Their numbers have been growing steadily since CMAs were introduced in 2014. At this moment, according to the information that agencies have shared with us, there are over 800 childminders registered with CMAs."
        },
        {
            "text": "The inspection of childminder agencies has been paused since March 2020 due to the pandemic. We plan to restart these inspections shortly, but before we do, we have taken the opportunity to review our guidance. Through regular meetings with the Organisation for Childminder Agencies (OFCMA) and representatives of the 11 agencies currently registered with us, we looked at where we could improve how we work. These discussions focused on some changes to the way we register and inspect agencies and in June this year, we republished some of our guidance documents and application forms with some updates."
        },
        {
            "heading": 3,
            "text": "Future statistics"
        },
        {
            "text": "We recently published a response to a consultation about early years and childcare statistics and how they’re published. Following the consultation, we decided to reduce publishing our official statistics to twice, rather than 3 times, a year. This is so that we can publish more detailed data about the childcare sector throughout the year. We’ll also be including additional data in our official statistics as well as supplementary management information, allowing more timely updates. We will continue to report on joiners and leavers in the childcare sector. We will focus on enhancing information on, for example, joiners and leavers in the childcare sector, deprivation and regulatory visits."
        }
    ]
}