{
    "url": "https://dwpdigital.blog.gov.uk/2021/06/30/why-were-looking-forward-to-hack2work/",
    "title": "Why we’re looking forward to Hack2Work",
    "authors": [
        "Shakeel Sharif, provision advisor, DWP",
        "Stephen Buckley, performance manager, DWP"
    ],
    "categories": [
        "Hacks"
    ],
    "pub_date": "2021-06-30T12:08:19+01:00",
    "content": [
        {
            "text": "DWP Digital’s fifth hack is taking place from 6 – 8 July. Here, 2 DWP colleagues share why they’re looking forward to taking part in Hack2Work."
        },
        {
            "text": "Tickets are now all sold out, but you can follow the hack on social media using the hashtag #Hack2Work"
        },
        {
            "heading": 2,
            "text": "Shakeel: “It’s vital that DWP front line colleagues are involved with the hack.”"
        },
        {
            "text": "I work on the Third Party Provision team at Blackburn Jobcentre Plus, managing DWP contracts and grants awarded to suppliers such as employers and training providers. I’ve previously been a work coach, directly helping individuals into work and enabling them to claim the support they need as they progress."
        },
        {
            "text": "When I heard about the opportunity to get involved with Hack2Work, I jumped at the chance. I’ve never been to a hack before and I’m excited to see what it’s all about."
        },
        {
            "text": "The aim of this year’s hack is to use technology and innovation to help jobseekers find employment following the pandemic. It’s been a really challenging year in the jobcentres, so it’ll be really great to be able to collaborate with members of the tech community and see what solutions we can come up with."
        },
        {
            "text": "I’m looking forward to being part of a virtual team and giving a front-line perspective of the problem."
        },
        {
            "heading": 2,
            "text": "Reflecting on the challenge of COVID-19"
        },
        {
            "text": "In the first few weeks of the pandemic when lockdown was announced, DWP experienced a 40% increase in claims to Universal Credit. In one fortnight alone there were 950,000 applications."
        },
        {
            "text": "Almost all vocational training was immediately stopped, as many training providers paused their operations. The number of people going into work following completion of training also slumped. Pre-pandemic, around 60% of training completers went directly into work. This reduced to 40% during lockdown."
        },
        {
            "text": "Due to the huge increase in applications to Universal Credit, the government announced additional funding to help these claimants back into work. This resulted in a big increase in the number of training provision requests and my team endured one of its busiest times in recent memory."
        },
        {
            "text": "All across Jobcentre Plus, colleagues were busy juggling the logistical challenges of working from home and following social distancing with a huge increase in workload."
        },
        {
            "heading": 2,
            "text": "Finding solutions"
        },
        {
            "text": "There’s no doubt that one of the major impacts of the pandemic has been on the UK jobs market, so it’s great that the hack is focusing on helping jobseekers identify and access employment provision."
        },
        {
            "text": "As DWP front line colleagues are the ones directly communicating with claimants and using the digital systems, it’s vital that they’re involved with the hack. It also gives the digital hackers the chance to gain operational insights and DWP colleagues the chance to gain digital insights.  Everyone wins."
        },
        {
            "text": "I have a strong background in customer service and a big interest in technology, so I see the hack as a way to combine these and help solve a real world problem with like-minded individuals."
        },
        {
            "text": "The hack is also a chance to network and learn from experts.  I’m expecting it to be a challenge, fun and a great learning experience!"
        },
        {
            "heading": 2,
            "text": "Stephen: “I hope it will be a great experience!”"
        },
        {
            "text": "I work as a performance manager in the South Yorkshire region and prior to this I worked as a DWP work coach."
        },
        {
            "text": "My time as a work coach was great. I worked on some digital interaction projects with customers that produced real positive successes. This included people starting work either through jobs posted in the sessions, taking one of the sector-based work academies that lead to full time employment or even just making a positive step towards work by taking additional training."
        },
        {
            "heading": 2,
            "text": "The impact of the pandemic"
        },
        {
            "text": "COVID-19 had a massive impact on me and my wife as we were both made redundant in early 2020. I was working in the local Chamber of Commerce at the time and my wife worked in travel."
        },
        {
            "text": "In the weeks before I was made redundant I spoke to business owners that were extremely worried about how their business would be able to continue with no income coming in, potentially meaning they would have to lay off staff. And it wasn’t just the staff that they were concerned about. They were just as concerned about their own circumstances and how they would pay their mortgage. The stresses they were under were enormous."
        },
        {
            "heading": 2,
            "text": "Both sides of the story"
        },
        {
            "text": "It’s really important that digital systems are designed with the end user in mind, whether that’s a colleague or a customer. My experience gives me insight into both sides of the story. And the hack is a perfect platform to bring DWP operations colleagues together with tech specialists to develop ideas to make things easier for both them and our customers."
        },
        {
            "text": "I love digital and my interest took off about 6 years ago when I was manually typing information into a tracker at work. I thought there had to be a quicker way to do this, so I started to look into Excel formulas and I managed to automate certain things that meant I saved time. Following this, I learned a lot of skills and continued to learn various types of coding, and I have recently learned how to code in HTML, CSS, PHP, Javascript, JQuery and SQL although this is mainly self-taught."
        },
        {
            "heading": 2,
            "text": "An opportunity to get close to the problem"
        },
        {
            "text": "I’ve never been to a digital hack before so I’m not entirely sure what to expect, but I think it will be great to be able to get involved and see if positive changes can be made."
        },
        {
            "text": "Enabling people like me and my DWP colleagues to share our insight into the particular challenges that end users have will give teams a deeper insight into the problem statement. And it provides the opportunity for those issues to really be discussed and listened to. There could be some really quick fixes, you just have to know about them, which is why it’s important that we’re there!"
        },
        {
            "text": " "
        }
    ]
}