{
    "url": "https://lifeathmrc.blog.gov.uk/2022/07/27/climbing-the-career-ladder-from-zoology-student-to-tax-auditor/",
    "title": "Climbing the career ladder: from zoology student to tax auditor",
    "authors": [
        "fayemines"
    ],
    "categories": [
        "Culture & Values",
        "Diversity",
        "General",
        "Inclusion",
        "Recruitment"
    ],
    "pub_date": "2022-07-27T09:42:41+00:00",
    "content": [
        {
            "text": "In our latest blog, discover how Gemma Atkins went from zoology student to tax auditor, and learn how her role as Welsh Lead for the Gender Network inspired her to progress her career at HMRC."
        },
        {
            "heading": 2,
            "text": "Where it all began..."
        },
        {
            "text": "When I was in school, I changed my mind like the weather with what career I wanted. Each week I would visit the careers advisor with a new idea:"
        },
        {
            "text": "You name it, I thought about doing it!  "
        },
        {
            "text": "Eventually, I drove the career advisor to the point where they sat me down and gave me an aptitude test. I was so excited to find out what exotic career I would be perfectly suited to: an auditor. I was devastated and rebelled to the point of doing Zoology in University - as far from a boring auditor as I could get. I would travel the world and look after big cats and go on safaris. "
        },
        {
            "heading": 2,
            "text": "The role of a Tax Auditor at HMRC"
        },
        {
            "text": "Eight years later in 2016, I started my career at HMRC, fully appreciating the irony. I was now a Tax Auditor.  "
        },
        {
            "text": "I remember getting the email confirming my role at HMRC and my first experience of its love of acronyms. My role was labelled as HO EXCISE ISBC C&E*… what on earth did this mean?!? What had I let myself in for? "
        },
        {
            "text": "Since those first nerve wracking baby steps into the life of a Civil Servant, my career has been an absolute whirlwind. I started off as an alcohol caseworker which meant checking producers and retailers had the right licenses or that excise duty had been paid. I then moved across to oils, which is a pretty niche area in HMRC. I was out and about visiting oil refineries with full PPE hard hat and boots, or down long country lanes to a customer selling red diesel to farmers in the middle of nowhere! Each visit and customer were completely different to the last and each experience taught me new areas of tax.  "
        },
        {
            "text": "Now, tax is not exactly the most energetic subject you could talk about, however becoming a caseworker at HMRC is kind of like being a knock-off detective in those US cop shows - you are given some puzzle pieces but are missing the picture that you are trying to follow. So, you must go out and find all those missing pieces until you have an idea of what is really going on. Sometimes, there is a genuine error that just needs a little nudge and other times there is something a bit more serious going on. The best part of the job though is the people. Meeting customers out and about, listening to their stories, watching them take pride in their businesses and helping them get it right gives you a great sense of job satisfaction.  "
        },
        {
            "heading": 2,
            "text": "Discovering the Gender Network"
        },
        {
            "text": "The other side of the job is the people you work with and the opportunities that HMRC offers. In 2019, I attended the Women into Leadership event in London which opened a whole new world beyond HMRC that I did not even know existed. I met with women across the Civil Service – did you know the UK has a Space Agency?! Because I had no idea until I got chatting with the woman sat next to me! After the event, I got thinking about women in taxes and decided to get involved in my local Gender Network. In HMRC, they have staff networks for each of the protected characteristics which allow you to get involved in different areas. They group these into the Equality, Diversity and Inclusion space (or ED&I for short – told you they love acronyms!).  "
        },
        {
            "text": "Shortly after getting involved, I applied to be the Gender Network Lead for Wales which has been a real eye-opener into the different types of work HMRC does. I have worked with our LGBT+ network on International Non-Binary Day and parenting within the community, I have co-facilitated sessions with our Disability Network on neurodiversity, I have run sessions with our Mental Health & Wellbeing Group on imposter syndrome, and much more. The ED&I space is full of colleagues across the board who are passionate about making HMRC inclusive and a great place to work.  "
        },
        {
            "text": "One of my passion projects has been getting a Working Families Group set-up whilst we were still working from home. This is a space where we can support other families with links to specific guidance around parental leave or flexible working arrangements, or where we have put on events to support families with neurodiverse children or raise aware of youth mental health. We are currently working on a cheesy named podcast – ‘ParentPod’ with a key theme each month, such as balancing work commitments with school holidays!  "
        },
        {
            "text": "Being a part of the wider ED&I space has allowed me to meet so many brilliant people and create a network across teams, regions and grades. My confidence has grown to the point I now casually message senior civil servants to ask them for a favour! Six years ago, leaving a call centre position, I would never have dreamed of messaging my bosses, bosses, boss… Even 3 years ago I would have struggled with imposter syndrome and questioned my ability and worth.  "
        },
        {
            "text": "The work I have done in the network can easily be attributed to my success of joining HMRC’s graduate Tax Specialist Programme, which as a university drop out (changed my mind about Zoology), feels like a huge achievement. I still have days where I question my capability and that imposter syndrome sneaks back in, but then I sit back and look at what I have achieved in such a small amount of time and think about where else the civil service may take me. I think about the lifelong friends I have made along the way and the positive impact I have had on others through my ED&I work.  "
        },
        {
            "heading": 2,
            "text": "Final thoughts"
        },
        {
            "text": "Joining HMRC was one of the best decisions of my life (husband and child should probably come first) and I really hope the careers advisor is out there somewhere feeling very smug right now!!  "
        },
        {
            "text": "(*Higher Officer, Excise, Individual & Small Business Compliance, Complex & Evasion) "
        }
    ]
}