{
    "url": "https://deframedia.blog.gov.uk/2022/07/27/environment-agency-acts-on-recent-dry-weather/",
    "title": "Environment Agency acts on recent dry weather",
    "authors": [
        "Defra Press Office"
    ],
    "categories": [
        "Environment Agency",
        "water"
    ],
    "pub_date": "2022-07-27T16:55:44+01:00",
    "content": [
        {
            "text": "There has been widespread coverage across broadcast and The Daily Telegraph, The Times, The Guardian, I News and the Daily Mail of the impacts of recent dry weather, following a meeting of the National Drought Group yesterday (Tuesday 26 July)."
        },
        {
            "text": "The Environment Agency convened the Group, made up of senior decision makers from the EA, government, water companies, Water UK, the NFU and environmental protection groups, to discuss the recent period of hot and dry weather and agree actions to protect water resources and the environment in the weeks ahead."
        },
        {
            "text": "The meeting follows most of England moving into ‘Prolonged Dry Weather’ status – meaning the EA is now taking precautionary actions to mitigate impacts as hydrological conditions deteriorate and enhance its monitoring and protection of water resources, along with the water companies."
        },
        {
            "text": "Nowhere in England is currently considered to be ‘in drought’. However, recent abnormally high temperatures have exacerbated conditions meaning we have seen lower-than-normal rainfall so far this year in many parts of England. With the Met Office forecasting potentially several more dry weeks ahead, the EA and water companies are now enacting the early stages of their well-rehearsed and publicly available drought plans and calling on everyone to do their bit in managing water use."
        },
        {
            "text": "The National Drought Group’s members agreed yesterday to continue to work closely together to monitor and manage the current situation, including convening the National Drought Group’s water supply and communications sub-groups."
        },
        {
            "text": "In addition, the EA announced a package of measures to assist farmers. This includes water trading between farmers in catchments, the ability to abstract additional water if it doesn’t harm the environment and the use of alternative supplies such as treated effluent."
        },
        {
            "text": "This builds upon the broad range of measures the EA already has to manage drought risk across England, many of which are already in action. These include:"
        },
        {
            "text": "If further measures are required, temporary use bans (more commonly known as hosepipe bans) will be determined by individual water companies and drought permits and drought orders by the Environment Agency and Defra respectively. Defra Ministers are also keeping the situation under close review."
        },
        {
            "text": "After yesterday’s meeting, Harvey Bradshaw, Environment Agency executive director for the environment and chair of the NDG, said:"
        },
        {
            "text": "People are being urged to use water wisely to protect water supplies and the environment during the current period of prolonged dry weather. Find out more on the Water’s Worth Saving campaign."
        },
        {
            "text": "The National Drought Group will continue to work together very closely over the coming weeks and will next meet in August."
        },
        {
            "text": "Follow Defra on Twitter, and sign up for email alerts here."
        }
    ]
}