{
    "url": "https://mojdigital.blog.gov.uk/2022/07/27/robotic-process-automation-does-the-pig-need-lipstick/",
    "title": "Robotic Process Automation: Does the pig need lipstick?",
    "authors": [
        "Gina Gill"
    ],
    "categories": [
        "Robotic Process Automation"
    ],
    "pub_date": "2022-07-27T13:03:41+01:00",
    "content": [
        {
            "text": "When I first joined the Civil Service, 5 years ago, Robotic Process Automation or RPA was the buzzword of the moment. (The buzzwords have morphed over the years, but my sense of dread of them has not!)."
        },
        {
            "text": "RPA, a specific way of automating tasks that a user might otherwise do either within a system or between different systems (e.g. rekeying information), was seen as the answer to many problems. Suppliers were selling it, commercial teams were making it easier to buy, and it was being talked about across many teams and many departments."
        },
        {
            "text": "The digital community seemed to be split. On the one hand there were those who thought that it could help them to “modernise” their systems without having to replace them quickly. On the other, there were those who thought it was “lipstick on a pig” - that it would basically mask underlying technology and user experience issues and result in a reduced urgency to properly address user needs."
        },
        {
            "text": "I was definitely more in the “lipstick on a pig” camp. "
        },
        {
            "text": "At the time, we were trying to persuade our senior leaders that we needed to invest more in our teams and that we needed to address the level of technology debt and risk that we were carrying. It felt prudent to not add to that technology debt or divert the conversation of wider service transformation to another shiny and new(-ish) thing."
        },
        {
            "text": "It also felt right that we properly re-designed and transformed our services, addressing both technical debt and user need, rather than creating tactical solutions."
        },
        {
            "text": "Since then we have invested material sums of money in addressing technology debt, we have collectively developed a strategy that improves or replaces our legacy technology and transforms our service offering, and we have started that work. But for some of our most business critical and complex systems such as our offender management systems, it will be years before we are free of their current constraints. And in the meantime those systems can stifle both productivity and job satisfaction for our colleagues."
        },
        {
            "text": "We know this because our colleagues tell us so. Take our probation management colleagues for example, some of whom have recently spoken to us about the good, bad and ugly in terms of the services we provide. They are frustrated - because they can spend up to 80% of their time on any given day keying and rekeying information into our not very user friendly and disparate systems. That means on those days they are only spending 20% of her time with offenders. To say that’s less than ideal is a huge understatement. Not only is that bad for outcomes, it’s also bad in a very competitive post Covid job market where we need to be doing all we can to retain good people."
        },
        {
            "text": "So, I am rethinking my lipstick on a pig stance. At least enough to better understand the potential benefits, the downsides and the costs of taking the plunge on RPA and other automation technologies. I know that these technologies won’t address the root cause of our problems, but it might just make the user experience that bit better and make mundane processes faster to complete so that our colleagues can spend time on the important work that really matters."
        },
        {
            "text": "And I can’t in good conscience look my probation management colleagues in the eye and say it’ll all be fine in 5 years if you could just hang on until then."
        },
        {
            "text": "I’m still not sure if the pig needs lipstick, but I will keep you posted on where we end up through discovery work we plan to do over the summer. In the meantime, let me know what you think in the comments below."
        }
    ]
}