{
    "url": "https://defradigital.blog.gov.uk/2022/07/27/user-research-techniques-for-content-designers/",
    "title": "User research techniques for content designers",
    "authors": [
        "Linda Butterfield",
        "Anna Scott"
    ],
    "categories": [
        "Defra content design",
        "Defra digital",
        "User centred design",
        "User research"
    ],
    "pub_date": "2022-07-27T07:30:59+01:00",
    "content": [
        {
            "text": "Senior User Researcher Linda Butterfield shares her experience of working in a large, fast-paced content team at Defra, along with three user research techniques that content designers can use. With contributions from Content Designer Anna Scott. "
        },
        {
            "text": "This is the first in our content design skills series, edited by Anna Scott. Up next, we’ll have a post from Defra content designer Steph Duits on ‘How mountain bike guiding makes me a better content designer’."
        },
        {
            "text": "I’m Linda and I’ve been working as a Senior User Researcher at Defra since January. I came from the Department for Levelling Up, Housing and Communities (DLUHC), where I’d been working on cyber security."
        },
        {
            "text": "Before becoming a user researcher, I’d had a varied background, teaching abroad for nine years, training in the charity sector, and then becoming a social science researcher after doing a masters in Scotland."
        },
        {
            "text": "Moving away from DLUHC, where I’d been for over four years, was tough but I was ready for something new and I’ve not regretted it."
        },
        {
            "text": "Defra was taking on senior user researchers who were being assigned to different things. I was expecting to be assigned to a transactional service, so I was surprised and nervous about being assigned to ‘business as usual’ content - something I knew little about. I hurriedly reached out on the government-wide Slack, a messaging platform, to talk to other user researchers who’d done this before to understand where I could most add value."
        },
        {
            "heading": 2,
            "text": "My work as a user researcher on a large content team"
        },
        {
            "text": "Defra has a large content community who work on content about lots of different things, from the food we eat and the air we breathe to the water we drink."
        },
        {
            "text": "I’m part of the content team that writes and publishes Defra guidance on GOV.UK.  It’s fascinating to see the breadth of their work. These are the topics from just one day:"
        },
        {
            "text": "The content team works at an incredible pace to get good content out quickly while ensuring it meets the needs of users. I’ve been astounded at how efficient and supportive they are. There are seemingly constant shout outs for help with urgent requests and I’ve never seen them go unanswered."
        },
        {
            "text": "While user researchers are an integral part of service teams, they seem to be less common on teams working on GOV.UK guidance. Defra's GOV.UK pages are viewed a lot so it's important that they work for the people who need it."
        },
        {
            "heading": 2,
            "text": "Helping content designers do user research"
        },
        {
            "text": "A large part of my role, which I developed alongside senior content designers, is to train and support content designers to carry out small pieces of user research themselves. I’ve organised training, created shared resources and worked alongside them on short-term projects."
        },
        {
            "text": "I’ve been struck by how keen content designers are to do user research. They’d be doing it on all content if they could. They are endlessly enthusiastic, and I’ve really enjoyed working with them."
        },
        {
            "heading": 2,
            "text": "User research techniques for content designers"
        },
        {
            "text": "In an ideal world, we’d have experienced user researchers working on all information that government provides. In reality, this simply isn’t feasible."
        },
        {
            "text": "Experience from just a few users can provide so much insight into content and how it's understood. It might not lead to a perfect understanding of user needs but it can help identify gaps and show areas of misunderstanding."
        },
        {
            "text": "Here are three simple techniques that content designers can use."
        },
        {
            "text": "Card sorting and tree testing \nDo you want to evaluate or design your site’s information architecture?"
        },
        {
            "text": "In a card sorting session, participants put topics into categories that they think make sense. They may also help you label these groups. This is great for finding out how users might navigate through a website. A good time to use a card sort is in the early stages, when you have an idea of the main content areas and want to see how users might group them."
        },
        {
            "text": "Tree testing often comes hand in hand. This helps you show users a basic text-only site structure without worrying about the design or layout. Tree testing has two main elements: a tree and tasks. You set users tasks to complete by looking for tasks using the site structure, clicking through your tree and nominating the information they think is correct."
        },
        {
            "text": "As this article from experienceux explains, tree testing sessions usually last about 20 minutes, with 15 to 20 tasks per session. This is because users tend to lose concentration if the tasks go on for too long. By using this method to evaluate your site structure, you can measure how easy it is for users to find items."
        },
        {
            "text": "Try a demo card sort or a tree test using Optimal."
        },
        {
            "text": "Highlighter testing\nDo you want to see if users can make sense of your content?"
        },
        {
            "text": "Highlighter testing is useful to do once content has been drafted. In person, it involves printing out some content and giving users each a green and red pen. They use these to highlight parts of the content that do and don’t make sense to them. This is slightly more complicated to do virtually but can be done by screenshare or by sending users a doc ahead of time to highlight."
        },
        {
            "text": "Learn more about highlighter testing in the blogposts:"
        },
        {
            "text": "Usability testing\nDo you want to identify problems with your content?"
        },
        {
            "text": "Once content is drafted, usability testing helps you find out about any issues. It involves watching users try to complete relevant tasks on your product or service. You can design tasks to see if users can find what they need and understand what to do as a result. It shows you how well your product or service works and helps to identify specific usability issues and insights."
        },
        {
            "text": "Learn more about usability testing in these blogposts by Lead User Researcher Tingting Zhao:"
        },
        {
            "heading": 2,
            "text": "Working in a content team: its challenges and rewards"
        },
        {
            "text": "Working as a user researcher in a content team is not without its challenges. It took some getting used to for me, as it felt so different from working on a transactional service with long term goals and specific roles. It’s also challenging to stop doing research when there’s always so much more you could do but time constraints don’t allow."
        },
        {
            "text": "The benefits have definitely outweighed the challenges, though. I’ve learned so much about GOV.UK guidance content, and the process from content being drafted to published, and how it’s regularly improved after that. I love working at pace on short-term projects that help users find what they need. I also really enjoy trying to bridge the gap between user research and content design, sharing skills and learning between the two."
        }
    ]
}