{
    "url": "https://apprenticeships.blog.gov.uk/2022/07/27/what-are-your-views-on-plans-to-transform-technical-qualifications/",
    "title": "What are your views on plans to transform technical qualifications?",
    "authors": [
        "Communications Team"
    ],
    "categories": [
        "Technical education"
    ],
    "pub_date": "2022-07-27T11:45:23+01:00",
    "content": [
        {
            "text": "Last month we launched a consultation on the approach we intend to take to approving technical qualifications in future. This is the final step in preparing a new approach for qualifications at level 3, following the Department for Education’s (DfE) review of post-16 level 3 qualifications in England."
        },
        {
            "text": "We fully support the ambitions that DfE set out in their recent qualifications review. These were to make sure that both young people and adults have clearer qualification choices, confidence that those choices will be high quality, and that the choice will help them to develop their careers."
        },
        {
            "text": "DfE have asked the Institute for Apprenticeships and Technical Education (IfATE) to lead on the approval of technical qualifications, and this will be required before the DfE make any funding decisions. This is because it is vital that technical qualifications are delivering the skills and knowledge that employers say they need, and as an employer-led organisation we can make suthose employer needs are front and central. In our consultation we explain how employers will inform both the design and the approval of technical qualifications."
        },
        {
            "text": "The consultation is an important step towards creating a fully integrated skills system, that is clearly designed to meet employer needs and where all technical education products are grounded in our employer designed occupational standards. This will provide a much greater level of consistency by making sure that all technical education products provide the knowledge, skills and behaviours employers say are used in any particular occupation. It is government’s ambition that post-16 technical education and training will be aligned to employer-led occupational standards by 2030 and that is something we are committed to achieving."
        },
        {
            "text": "Our consultation runs until 10 August 2022 and we want to urge as many people as possible to feed back on our plans."
        },
        {
            "text": "To help you to do this we are running a webinar on Thursday 4 August, which is open to all. This webinar will talk through the options in the consultation in more detail, and give you a chance to ask any questions you might have for us."
        }
    ]
}