{
    "url": "https://traderemedies.blog.gov.uk/2022/07/27/working-together-to-create-the-culture-we-need-the-tras-people-strategy/",
    "title": "Working together to create the culture we need – the TRA’s People Strategy",
    "authors": [
        "Hayley Kelly, Head of People"
    ],
    "categories": [
        "HR"
    ],
    "pub_date": "2022-07-27T13:06:55+01:00",
    "content": [
        {
            "text": "We are fortunate that as a small and maturing organisation, colleagues across our new UK Trade Remedies Authority (TRA) can work collaboratively to shape the foundations of a culture that we all want to be a part of. This is a key part of working together in our mission to defend UK economic interests against unfair international trade practices.  "
        },
        {
            "text": "We all know that work plays a significant part in our lives, and it is important to me that everyone in the TRA feels a sense of enjoyment and belonging when they are at work; only then can we truly bring out the best in ourselves and those around us.  "
        },
        {
            "heading": 2,
            "text": "People-led "
        },
        {
            "text": "We have amazing colleagues who offer their support through a mix of staff engagement forums, and here are just some of the ways that we have made a difference together: "
        },
        {
            "text": "We have delivered some great initiatives, but for me the most benefit comes when we work together to tackle the biggest challenges that are facing organisations today. Our approach to future Ways of Working is a great example of this. We’ve worked with our Staff Voice Forum on an approach that balances business, team, and individual needs, setting us apart from other organisations that have attendance quotas or fixed office days.  Our “Purpose Based, Charter Driven” approach empowers teams and individuals to make decisions about when and how they work, giving us the leading edge in a competitive employment market.  "
        },
        {
            "heading": 2,
            "text": "The TRA’s People Strategy "
        },
        {
            "text": "In June we celebrated the first anniversary as the UK Trade Remedies Authority, and I am so proud to have marked the occasion by launching our first People Strategy that sets out the steps we’ll be taking to meet our strategic goal of being an expert and innovative organisation where people enjoy working.  "
        },
        {
            "text": "Our People Strategy is framed around two workstreams – our capability and our culture.  "
        },
        {
            "text": "As the UK has not carried out trade remedies work for half a century, building expertise is a major focus. We have launched our 2022-23 Learning and Development Framework and continue to invest in our people’s professional development.  "
        },
        {
            "text": "But what I hope makes us unique is our culture workstream. We are working to create a culture that enables us to attract and retain the vital skills that we need, reflecting the diversity in the society that we serve. "
        },
        {
            "text": "If you want to be part of a small, innovative organisation, where people support each other, then I’d encourage you to look out for our job opportunities that are advertised through Civil Service Jobs: we are currently hiring, including a People Capability Manager and Culture Strategy Manager. "
        }
    ]
}