{
    "url": "https://naturalengland.blog.gov.uk/2025/03/04/countryside-stewardship-higher-tier-supporting-farmers-and-land-managers-to-deliver-nature-friendly-farming/",
    "title": "Countryside Stewardship Higher Tier: Supporting farmers and land managers to deliver nature friendly farming",
    "authors": [
        "Natural England"
    ],
    "categories": [
        "Farming",
        "Natural England"
    ],
    "pub_date": "2025-03-04T14:11:21+00:00",
    "content": [
        {
            "text": "By Peter Craven, Head of Agriculture "
        },
        {
            "text": "At Natural England, we know that farming and nature can thrive together, and Countryside Stewardship Higher Tier (CSHT) is here to help make that happen. Whether you're already working towards a more sustainable farm or just beginning to explore your options, this scheme offers tailored support to help you balance food production with environmental benefits. Read on to find out how farmers like Dave and Annabel are making it work for their land and business – and how you can too. "
        },
        {
            "text": "CSHT is expected to open for applications later this year following a phased approach where a number of farms are being invited to apply for CSHT and prepare for application. CSHT designed to help farmers, foresters, and land managers protect and enhance the environment. With agreements lasting for five, 10 and 20 years, this scheme supports unique environmental and local landscape needs. See Q&A below for more details. "
        },
        {
            "text": "Natural England works with farmers and land managers across England to help enable sustainable food production and nature, to create a resilient future for farming and the environment. One way we do this is through providing advice and working with farmers on the Countryside Stewardship Higher Tier (CSHT) scheme - this scheme is a key incentive and tool for farming and nature."
        },
        {
            "text": "We have recently been working with Dave and Annabel Stanners, who have an upland beef and sheep farm at Low Chesterhope in Redesdale, Northumberland. They are first generation tenant farmers with a young family. They have been working with Marjorie Davy from Natural England’s Northumbria Land Management team to help them to apply for a CSHT agreement. "
        },
        {
            "text": "Dave and Annabel moved to Low Chesterhope Farm in 2016. A 600-acre upland land farm with 650 ewes and a herd of 70 Luing cows. The farm had no existing agri-environment scheme. They entered a Mid-Tier uplands offer first and encouraged by what they had achieved in the Mid-Tier agreement, they decided to join the Sustainable Farming Incentive pilot. This also helped to offset the reduction in Basic Payment receipts. "
        },
        {
            "text": "Dave said: \"We wanted to help shape the schemes of the future and play an active role in the pilot. It felt like a natural progression to transition into Higher Tier as we were keen to encourage more nature on the farm as well as producing food in a sustainable way.  "
        },
        {
            "text": "\"It was great to meet with Marjorie, our Natural England adviser, and show her what we were doing, her enthusiasm for improving nature on the farm really energised us to do more and we are pleased and proud to be in the first round of the new CSHT. We can now get on with ours and Marjorie’s plans as well as helping to secure the financial viability of the farm.\""
        },
        {
            "text": "Dave and Annabel have been working together with Marjorie from Natural England since 2023. They have built a good working relationship which resulted in benefits for the farm business and nature. In the last 12 months a wealth of information has been recorded through wildlife surveys, which has enabled Majorie to provide Natural England’s pre-application advice, including where more ambitious CSHT actions could apply."
        },
        {
            "text": "Majorie said: \"This has allowed Dave and Annabel to apply now for SFI options on some areas of the farm including the new GRH6 species rich grassland action. The next step is to draft prescriptions for the fields where we are going to use more ambitious CSHT actions for curlew, lapwing, wetlands, grassland, and wood pasture and to protect the burn from sediments, especially important for the conservation of the critically endangered freshwater pearl mussels that live in the River Rede and its tributaries.\" "
        },
        {
            "text": "At Natural England, we are proud to support farmers like Dave and Annabel who are balancing productive farming with environmental restoration.  "
        },
        {
            "text": "Dave and Annabel’s decision to enter an upland CSHT scheme is not just about conservation, it is about helping to secure the future of their farm, in this case an upland farm, by tailoring the agreement to the land’s potential, their business, and the landscape they are stewards of. "
        },
        {
            "text": "Whatever the size of farm, the principles of sustainable upland management apply. This holding provides a real-world example of how the CSHT scheme can work, offering clear benefits for both the farmer and nature. By tailoring the agreement to the land’s potential, Dave and Annabel are proving that no two farms are the same, and no two schemes should be either. "
        },
        {
            "text": "This scheme does not mean reducing stock numbers to unviable levels, it is about finding the right balance between grazing as a tool to enhance the environment, and productivity. A shift towards cattle alongside sheep will help diversify income, improve pasture management, and enhance biodiversity, making the land work harder in a more natural, low-input way. "
        },
        {
            "text": "The scheme will help: "
        },
        {
            "text": "These outcomes align directly with Government targets for nature recovery, carbon storage, and sustainable food production, ensuring that farming is part of the solution, not the problem. "
        },
        {
            "text": "Why is CSHT important to farmers and land managers?  "
        },
        {
            "text": "CSHT helps manage land in ways that:  "
        },
        {
            "text": "• Protects and restores habitats and species. "
        },
        {
            "text": "• Improves water quality, reduces flooding risks, and enhances carbon capture. "
        },
        {
            "text": "• Conserves historical and archaeological features. "
        },
        {
            "text": "These efforts not only meet sustainability goals but also boost farm resilience and future-proof rural businesses against environmental challenges. "
        },
        {
            "text": "What does Natural England, Rural Payments Agency, and Defra do?  "
        },
        {
            "text": "Together, we work to streamline the application process and support farmers and land managers throughout their CSHT journey. "
        },
        {
            "text": "How does the CSHT invite-only process work? "
        },
        {
            "text": "What should farmers and land managers do now?  "
        },
        {
            "text": "1. Look out for your invitation letter from the Rural Payment Agency for Countryside Stewardship pre-application advice and reply within the 10 working day deadline.  "
        },
        {
            "text": "2. Check the available information and familiarise yourself with the CSHT actions and the eligibility requirements. Visit GOV.UK to find out more including: Countryside Stewardship Higher Tier: get ready to apply - GOV.UK "
        },
        {
            "text": "3. Look out for further Defra updates on Countryside Stewardship Higher Tier, as well as Defra’s latest blog: An update on Higher Level Stewardship and Countryside Stewardship Higher Tier  – Farming. You can subscribe to future Defra blogs here."
        },
        {
            "text": "4. Think about what you might wish to get out of your existing ELM agreement.  "
        },
        {
            "text": "5. Consider Sustainable Farming Incentive (SFI), if the SFI offer provides you with the management you are looking for you may not need a CSHT agreement.  "
        },
        {
            "text": "We look forward to working with you in the coming months to find win/win solutions that meet the needs of you, your business and nature recovery. "
        }
    ]
}