{
    "url": "https://moderncivilservice.blog.gov.uk/2025/03/04/innovation-2025-two-days-of-public-sector-transformation/",
    "title": "Innovation 2025: Two days of public sector transformation",
    "authors": [
        "Government Reform"
    ],
    "categories": [
        "A Modern Civil Service",
        "Ambitious",
        "Capability",
        "Government Reform",
        "Innovation",
        "One Big Thing",
        "Policy",
        "Proud Civil Servants"
    ],
    "pub_date": "2025-03-04T09:26:13+00:00",
    "content": [
        {
            "text": "Innovation 2025 is an annual international conference that brings together public sector leaders who are driving transformation initiatives. Taking place on 25 and 26 March at ExCeL London, this unique gathering offers a platform for global change-makers to share insights on accelerating public service delivery and organisational reform. Visit the Innovation 2025 website to secure your place."
        },
        {
            "heading": 2,
            "text": "Speaker line-up"
        },
        {
            "text": "The event will welcome government leaders and digital specialists including Cat Little, Civil Service Chief Operating Officer and Cabinet Office Permanent Secretary; Sarah Munby, Permanent Secretary at the Department for Science, Innovation and Technology and Susan Acland-Hood, Permanent Secretary at the Department for Education. You can view the full speaker list on the Innovation 2025 website."
        },
        {
            "text": "This year’s host, Cat Little, commented on the event: “Building on the success of the last two years, I’m excited to be hosting Innovation 2025. This event will bring together public servants from across the UK Civil Service and beyond, to share examples of innovation, meet their peers, and learn from each other. We are all committed to improving government services and embracing new ways of working, and this year’s conference will focus on shaping the future of public sector innovation.’’"
        },
        {
            "heading": 2,
            "text": "Event highlights"
        },
        {
            "text": "Innovation 2025 has a jam-packed agenda, with sessions including: "
        },
        {
            "heading": 2,
            "text": "Get involved"
        },
        {
            "text": "Innovation 2025 takes place on 25 and 26 March at ExCeL London (ExCeL London, Royal Victoria Dock, 1 Western Gateway, London E16 1XL.) The event is free to attend for civil servants, public sector employees, and those working in the wider public sector. Register on the Innovation 2025 website."
        }
    ]
}