{
    "url": "https://gott.blog.gov.uk/2025/03/04/meet-the-trailblazer-nadia-shivji-brown/",
    "title": "Meet the Trailblazer: Nadia Shivji-Brown",
    "authors": [
        "avneetkaur"
    ],
    "categories": [
        "Uncategorized"
    ],
    "pub_date": "2025-03-04T08:00:00+00:00",
    "content": [
        {
            "text": "by Nadia Shivji-Brown "
        },
        {
            "heading": 2,
            "text": "Tell us about a Knowledge Asset innovative project you’re proud of and why?"
        },
        {
            "text": "I am working on a Tuberculosis (TB) Biomarker project at UKHSA. Although I joined the project two years ago and was not involved from the beginning, it represents the culmination of many years of scientific research and business development efforts. "
        },
        {
            "text": "Over the past two years, it’s been great to see it move from strength to strength, to the point where it’s ready for pitching to investors."
        },
        {
            "heading": 2,
            "text": "At what point and why did you realise you wanted to take this project forward?"
        },
        {
            "text": "I inherited the project from a colleague two years ago. At UKHSA, we maintain a mature patent portfolio with many assets that we work to commercialise."
        },
        {
            "heading": 2,
            "text": "How has the support from GOTT made a difference to your project?"
        },
        {
            "text": "GOTT has been instrumental in moving the TB Biomarker project forward. The PRIMA Accelerator programme really focused the project and gave us a clear pathway to commercialisation."
        },
        {
            "text": "PRIMA has helped the scientist involved in the project to significantly improve their pitch skills, which they’ve put to good use recently when they presented to a room full of investors at the BioSeed pitch event."
        },
        {
            "text": "TB has always been a hard disease to fund, so receiving Knowledge Asset Grant funding has been crucial for the project’s progress, enabling us to develop a prototype Lateral Flow Device. The GOTT team is also always there to support us with any queries we have and has been a great sounding board for all our projects."
        },
        {
            "heading": 2,
            "text": "What’s been the biggest challenge to date?"
        },
        {
            "text": "Securing funding to move the project forward. With the grant funding, we aim to develop a prototype LFD for TB and attract commercial companies to licence the patents and the diagnostic."
        },
        {
            "heading": 2,
            "text": "What one piece of advice would you give to budding trailblazers in the public sector?"
        },
        {
            "text": "Build your network. Your network is essential for getting advice, bouncing ideas off each other, and building connections. "
        },
        {
            "text": "For me, having a strong network in the Life Science sector has been crucial in progressing the projects I am working on. It’s important to surround yourself with trustworthy people who you don’t work with on a daily basis."
        },
        {
            "heading": 2,
            "text": "What’s the best part of your job?"
        },
        {
            "text": "There is great science happening at UKHSA, and it's great to be part of it, helping to commercialise it and making a real impact on public health.  Each day brings new challenges and opportunities."
        }
    ]
}