{
    "url": "https://mhclgmedia.blog.gov.uk/2025/03/04/protections-boosted-for-the-lowest-paid-workers/",
    "title": "Protections boosted for the lowest paid workers",
    "authors": [
        "mhclgpress"
    ],
    "categories": [
        "Workers' rights"
    ],
    "pub_date": "2025-03-04T16:56:22+00:00",
    "content": [
        {
            "text": "Millions of the very lowest paid workers will get better employment protections thanks to new changes to the Employment Rights Bill."
        },
        {
            "text": "The changes confirmed today follow extensive consultation with business groups and unions to ensure the plan to Make Work Pay is firmly pro-business and pro-worker."
        },
        {
            "text": "They range from extending eligibility to Statutory Sick Pay for 1.3 million workers earning less than £123 a week, to giving around 900,000 agency workers the right to a guaranteed contract and other protections so they don’t become a loophole in plans to ban exploitative zero hours contracts."
        },
        {
            "text": "The news that all workers will qualify for Statutory Sick Pay for the first time was first reported in The Guardian, sparking wide follow-up interest from national news outlets including The Mirror, I Paper, BBC online, The Financial Times and The Express. Reports led that a new 80% rate of earnings will now be guaranteed for the lowest paid when they need time off to recover from an illness, which was welcomed by stakeholders including the Trades Union Congress (TUC)."
        },
        {
            "text": "The BBC online also reported widely today (also on BBC Radio 4's Today Programme and BBC News) that agency workers will be included in the ban on exploitative zero hours contracts. This similarly generated widespread interest, with stories featuring on ITV News, The Mirror, The Independent, The Telegraph and The Guardian."
        },
        {
            "text": "Speaking on BBC Radio 4’s Today Programme this morning, the Deputy Prime Minister paid tribute to the all the businesses, trade unions and workers that have worked alongside the government to get the Employment Rights Bill to where it is."
        },
        {
            "text": "As quoted in today’s press release, the Deputy Prime Minister Angela Rayner said:"
        },
        {
            "text": "“For too long millions of workers have been forced to face insecure, low paid and irregular work, while our economy is blighted by low growth and low productivity.   "
        },
        {
            "text": "“We are turning the tide – with the biggest upgrade to workers’ rights in a generation, boosting living standards and bringing with it an upgrade to our growth prospects and the reforms our economy so desperately needs.   "
        },
        {
            "text": "“We have been working closely with businesses and workers to progress this landmark bill and deliver our Plan for Change - unleashing growth and making work pay for everyone.”"
        }
    ]
}