{
    "url": "https://educationhub.blog.gov.uk/2025/03/teaching-latin-and-the-classics-support-available-for-schools/",
    "title": "Teaching Latin and the classics: support available for schools ",
    "authors": [
        "mediaofficer"
    ],
    "categories": [
        "GCSE",
        "Languages",
        "Teacher Training"
    ],
    "pub_date": "2025-03-04T14:02:51+00:00",
    "content": [
        {
            "text": "The study of classics and ancient languages can teach us valuable lessons in history, politics and art that are still relevant today.  "
        },
        {
            "text": "It helps students understand the evolution of language and gives them the chance to study and analyse ancient texts that provide valuable insights into important questions for the twenty first century. "
        },
        {
            "text": "All schools are free to include Latin and classics as part of their curriculum, and there is a range of free support available to help them.  "
        },
        {
            "heading": 3,
            "text": "How can schools access support to teach Latin and classics? "
        },
        {
            "text": "Any school can introduce classics, but some may need additional support. The Department for Education is working with two charities to provide specialist support to schools that need it. "
        },
        {
            "text": "Classics for All is a charity which has been working since 2010 to support classics teaching in state primary and secondary schools. In the last 14 years, it has worked with over 180,000 pupils aged 7-18 in over 1,250 schools at all key stages helping them to introduce Latin, Greek, Classical Civilisation and Ancient History both on and off the curriculum. "
        },
        {
            "text": "The Classical Association is the national subject association for Classics. That means its members are teachers who are experts in their subjects. The educational charity offers a wide range of support for teachers of all classical subjects, at all stages of their career. "
        },
        {
            "heading": 3,
            "text": "What type of support is available? "
        },
        {
            "text": "There is a range of support available to help teachers and schools build Latin and classics into the curriculum.  "
        },
        {
            "text": "Teacher training "
        },
        {
            "text": "Classics for All works flexibly with primary and secondary schools to find the most appropriate course and training for them. It often works with teachers who specialise in different subjects to support them to introduce classics to the classroom.  "
        },
        {
            "text": "The Classical Association hosts in-person and online training days for Latin, Greek, Classical Civilisation and Ancient History. "
        },
        {
            "text": "Teacher bursaries  "
        },
        {
            "text": "Classics for All supports a number of teacher bursaries at established summer schools, and through the Institute of Continuing Education at Cambridge University. "
        },
        {
            "text": "The Classical Association also supports a number of summer school bursary schemes so teachers can attend courses in classical subjects. It also supports state-school teachers to undertake an A Level in Classical Civilisation. "
        },
        {
            "text": "Grants "
        },
        {
            "text": "The Classical Association provides major grants and can offer financial support for the study of classics in UK schools and colleges. Teachers in state-maintained schools can apply for funding to support their professional development. It can also help with costs for student competitions and day trips for pupils to museums and archaeological sites. "
        },
        {
            "text": "Resources "
        },
        {
            "text": "The Classical Association produces the UK's leading classics teaching journal, the Journal of Classics Teaching. It also publishes Omnibus magazine for students and teachers who are discovering the wonders of Classics for the first time. "
        },
        {
            "heading": 3,
            "text": "What about the Latin Excellence Programme? "
        },
        {
            "text": "The Latin Excellence Programme was set up to help improve the number of pupils taking Latin GCSE, as well as improve their attainment. "
        },
        {
            "text": "The programme has been discontinued, but the 39 schools in the programme can still access the curriculum materials provided through the scheme to support high-quality teaching.  "
        },
        {
            "text": "These materials and the wider support available will ensure that pupils on the programme taking their Latin GCSE this summer will continue to be provided for.  "
        },
        {
            "text": "The Department for Education values a varied curriculum and schools can continue to teach Latin outside the programme.  "
        },
        {
            "heading": 3,
            "text": "Where can I find out more?"
        },
        {
            "text": "You can find out more about Classics for All, including its Impact report and school case studies from the Classics for All website: Classics for All.  You can find out more about the Classical Association at its website: Home - The Classical Association. "
        }
    ]
}