{
    "url": "https://cdei.blog.gov.uk/2023/09/26/championing-responsible-innovation-reflections-from-the-cdei-advisory-board/",
    "title": "Championing responsible innovation: reflections from the CDEI Advisory Board",
    "authors": [
        "CDEI",
        "Martin Hosken",
        "Marion Oswald",
        "Neil Lawrence",
        "Mimi Zou"
    ],
    "categories": [
        "Artificial intelligence",
        "Data",
        "Responsible innovation",
        "Trustworthy innovation"
    ],
    "pub_date": "2023-09-26T13:37:38+01:00",
    "content": [
        {
            "text": "The Centre for Data Ethics and Innovation leads the Government’s work to enable trustworthy innovation using data and artificial intelligence."
        },
        {
            "text": "At the CDEI, we help organisations across the public and private sectors to innovate, by developing tools to give organisations the confidence that AI and data-driven technology work the way they expect. We also develop governance frameworks, guidance, and standards that enable organisations to use AI and data in a way that builds public trust."
        },
        {
            "text": "The CDEI Advisory Board has played an important role in helping us to deliver this crucial agenda. Their expertise and insight have been invaluable in helping to set the direction of and deliver on our programmes of work around responsible data access, AI assurance and algorithmic transparency."
        },
        {
            "text": "As the Board’s terms have now ended, we’d like to take this opportunity to thank the Board for supporting some of our key projects during their time. These include the rollout of our world-leading Algorithmic Transparency Recording Standard which facilitates trusted and trustworthy uses of algorithmic tools in the public sector and then beyond, the delivery of the UK-US Privacy-Enhancing Technologies (PETs) prize challenge that encouraged adoption and innovation in PETs to help solve global challenges, and the design of the upcoming Fairness Innovation Challenge focused on tackling bias in real-world applications of AI systems."
        },
        {
            "text": "Read some of our Board members highlights from their time below:"
        },
        {
            "text": "Professor Neil Lawrence - Interim Chair and CDEI Advisory Board member, 2021-23\n“It has been a great pleasure to support the work of the CDEI as an advisory board member and interim chair. New machine learning technologies are bringing societal change at a scale and speed for which there is no prior precedent. The problem is made more complex because of its fundamentally socio-technical nature. This means that diverse expertise from academia, industry, government and third sector needs to be convened to ensure that the challenges are understood from all perspectives. Policy makers are then faced with the difficult challenge of operationalising this spectrum of advice by integrating it with pragmatism and nuanced understanding of the wider political and economic landscape. It has been an immense privilege to work so closely with the CDEI as they perform this difficult translation. I have been constantly impressed with their synthesis of these ideas into pragmatic policy interventions that have placed the UK at the forefront of the international regulatory landscape.”"
        },
        {
            "text": "Martin Hosken - CDEI Advisory Board member, 2021-23\n“Serving as an Advisory Board Member for the CDEI has been a huge privilege. As you will have heard before, the rate of technological change is accelerating at an unprecedented rate, to the point where it is becoming unpredictable. Developments in previously disjointed fields, such as artificial intelligence, robotics, nanotechnology, 3D printing, genetics and biotechnology, are all building on and amplifying one another. With one innovation snowballing into another in this way, the last two years of work with the CDEI have been an evolving and exciting opportunity. I have particularly enjoyed the work I have supported on the Research Cloud options and the PETs Prize Challenge."
        },
        {
            "text": "Embracing these forward-thinking approaches and setting a gold standard for responsible innovation, particularly regarding data and AI, will be critical for the UK if it is to continue its long history of global impact in the technology sector. This is an area where there is a genuine opportunity for the UK to lead internationally, and the CDEI will be at the centre of this going forward. I look forward to seeing the CDEI’s ongoing impact within the UK and internationally.”"
        },
        {
            "text": "Professor Marion Oswald, MBE - CDEI Advisory Board member, 2021-23\n“Now more than ever, governments, policymakers and industry need expert, constructive, critical friends to guide the technical and governance aspects of data-driven technology and AI. This is because the public expect responsible use of data, and scandals around data losses or reputationally damaging analytics mean that trust cannot be taken for granted."
        },
        {
            "text": "The CDEI serves that expert role – perhaps uniquely within a government structure – and has forged its own respected identity through the efforts of dedicated and talented staff, and their willingness to engage with external advice and expertise. It has provided operationally and context-focused initiatives to tackle challenging issues – I would highlight in particular the innovative Algorithmic Transparency Recording Standard - which deserves to be more widely known and adopted throughout the public sector – the report on accessing demographic data for bias detection, the ongoing Assurance work and the upcoming Fairness Challenge. It has not been afraid to get into the ‘nitty-gritty’. Despite the disbanding of the Advisory Board, I look forward to the CDEI retaining its distinct identity and continuing its expert role to provide constructive and informed input, thus underpinning key aspects of the National AI Strategy.”"
        },
        {
            "text": "Professor Mimi Zou - CDEI Advisory Board member, 2021-23\n\"It has been an honour to serve on the Advisory Board of CDEI over the past two years. CDEI has played a pivotal role in promoting responsible innovation across both the public and private sectors since its establishment in 2018. During my time on the Advisory Board, CDEI has initiated world-leading, cutting-edge projects including AI Assurance, UK-US PETs prize challenges, Algorithmic Transparency Recording Standard, the Fairness Innovation Challenge, among many others. Moving forward, I have no doubt that CDEI will continue to be a leading actor in delivering the UK's strategic priorities in the trustworthy use of data and AI and responsible innovation. I look forward to supporting this important mission for many years to come.\""
        },
        {
            "text": "We’d like to extend our thanks to the Advisory Board for their time and commitment over the past few years. It has been a pleasure and honour to work with these world-leading experts."
        },
        {
            "text": "Engaging with external experts, like the members of the Advisory Board, and stakeholders across industry, academia and civil society is essential in ensuring we demonstrate how data and AI can be used positively to benefit citizens across the UK. So we will continue to seek expert views and advice in an agile way that allows us to respond to the opportunities and challenges of the ever-changing AI landscape."
        }
    ]
}