{
    "url": "https://socialworkwithadults.blog.gov.uk/2023/09/26/my-social-work-journey-from-experience-to-practice/",
    "title": "My social work journey: from experience to practice",
    "authors": [
        "Lyn Romeo",
        "Angie Beaumont"
    ],
    "categories": [
        "Care and support",
        "Knowledge and skills",
        "Our profession"
    ],
    "pub_date": "2023-09-26T15:44:44+00:00",
    "content": [
        {
            "heading": 2,
            "text": "Life prepares you sometimes"
        },
        {
            "text": "Being a latchkey kid, raised by a single mum on a council estate in the 80s, the odds of achieving success were often stacked against me. I experienced social care before, during and after the Children Act 1989 came into play, so I had the absolute belief this was the path I wanted to be on."
        },
        {
            "text": "And so, at the tender age of ten, my social work career began with helping out in my local community. I went on to become a peer educator and link counsellor at school and college. Now, years later, I have completed my Social Work Apprenticeship Degree and am ready and waiting to register as a qualified social worker. Let us just pause there to consider the reality and emotions of achieving a lifelong dream…"
        },
        {
            "text": "Over the years, I have sadly watched dozens of second year students and newly qualified staff leave when they realised the full weight and reality of working in this field."
        },
        {
            "text": "The academic learning environment had not prepared them for social work itself and this led to me having countless discussions with learning and development teams around offering apprenticeships when we are qualifying social care staff. Although the seed had been planted, it never seemed to have the right conditions to come to fruition."
        },
        {
            "heading": 2,
            "text": "Opportunity"
        },
        {
            "text": "At the height of the COVID-19 pandemic, I jumped at the chance to qualify in a way that supported my needs as a learner. The Social Work Apprenticeship Degree was finally here!"
        },
        {
            "text": "I studied at Kingston University and the team there were incredible; they spent time getting to know their cohort of trailblazers and created a positive learning environment that flexed and adapted to meet our emerging needs."
        },
        {
            "text": "I was one of four course reps who shared apprentices’ views and suggestions, which were listened to and respected. We were acknowledged as leaders in our field, who would help to shape the degree course not only for us, but for the those who followed."
        },
        {
            "text": "Yes, we stumbled at times, mainly due to the lack of consistency from employers. Some apprentices had amazing support leading to positive outcomes. Others did not have this experience, enduring numerous changes in manager and mentor, heavy workloads and no additional time to reflect or study, all of which took their toll."
        },
        {
            "heading": 2,
            "text": "Adaptive support"
        },
        {
            "text": "Kingston University continues to use apprentices’ feedback to make us feel safe and supported as human beings. They are working with employers to create a consistent approach for Contrasted Learning Experiences and Final Practice Experience Learning placements."
        },
        {
            "text": "They have adapted the course to meet the learning needs of future apprentices by practicing what social care has preached since the Munro Review; where a team around the person approach is utilised alongside sufficient and effective early help interventions so that “social work students are prepared for the challenges of (child protection) work” (Munro, 2011)."
        },
        {
            "text": "I would recommend all who want to enter the world of social work to consider an apprenticeship using another great tool (signs of safety) to identify what works well, what they are worried about and what grey areas need further clarity. If this is how we work with people, we need to start applying this approach with ourselves first."
        }
    ]
}