{
    "url": "https://marinedevelopments.blog.gov.uk/2023/09/26/scientific-dispensation-request-granted-for-king-scallop-fishing-trial/",
    "title": "Scientific dispensation request granted for King Scallop fishing trial",
    "authors": [
        "Dan Cutler, Communications & Engagement Manager"
    ],
    "categories": [
        "fisheries",
        "marine licensing",
        "Marine Science",
        "Science"
    ],
    "pub_date": "2023-09-26T13:05:43+01:00",
    "content": [
        {
            "text": "MMO has granted a scientific dispensation to MacDuff Shellfish Ltd to carry out a two day scallop fishing trial off the South East coast of England. The trial will take place in October 2023 and test the feasibility and potential benefits of shucking scallops at sea. "
        },
        {
            "text": "What is shucking? "
        },
        {
            "text": "Shucking is the process of removing the scallop meat from the scallop shell. Shucking on board a vessel immediately after catching is not currently permitted under UK law. "
        },
        {
            "text": "Regulations require fishers to land whole scallops to enable effective enforcement of scallop minimum conservation reference sizes (MCRS).  "
        },
        {
            "text": "These measures are in place to protect scallop stocks, ensure their long term viability and sustainability for the future. "
        },
        {
            "text": "What is a scientific dispensation? "
        },
        {
            "text": "Any fishing or research vessel may submit a scientific research dispensation request to the MMO. "
        },
        {
            "text": "As England’s marine manager, MMO assess these requests against government’s growth priorities and its priorities for enhancing the marine environment, supporting economic growth and enabling sustainable marine development.  "
        },
        {
            "text": "If approved by MMO, a dispensation may be granted for fishing activity that would otherwise be unlawful, for the purposes of scientific research. "
        },
        {
            "text": "Why is this trial permitted? "
        },
        {
            "text": "During its assessment of the request, MMO has worked with MacDuff Shellfish Ltd to limit the length of the trial to just two days and make sure it takes place outside the scallop spawning season.  "
        },
        {
            "text": "The trial is purely scientific. It will test the business and environmental benefits of shucking scallops at sea with no financial return for the applicant. MacDuff Shellfish Ltd will also be required to retain all scallop shells obtained during the trial for size verification on its return. "
        },
        {
            "text": "Prior to approval, MMO has also consulted partners, including Cefas, Food Standards Agency, Marine Scotland, Environment Agency and DEFRA to ensure all relevant standards will be met.  "
        },
        {
            "text": "Find out more about applying for a scientific research dispensation. "
        }
    ]
}