{
    "url": "https://companieshouse.blog.gov.uk/2023/09/26/the-register-of-overseas-entities-a-step-forward-for-corporate-transparency/",
    "title": "The Register of Overseas Entities: a step forward for corporate transparency",
    "authors": [
        "Sara Williams - Implementation Lead, Register of Overseas Entities"
    ],
    "categories": [
        "Register of Overseas Entities"
    ],
    "pub_date": "2023-09-26T11:05:36+01:00",
    "content": [
        {
            "text": "It’s been 6 weeks since we launched the update statement service for the Register of Overseas Entities – another important milestone for this brand new register."
        },
        {
            "text": "The register forms an important part of the government’s strategy to tackle global economic crime and strengthen the UK’s reputation as a place where legitimate businesses can thrive."
        },
        {
            "text": "It requires overseas entities that own UK property or land to declare their beneficial owners or managing officers. Overseas entities cannot buy, sell, transfer, lease, or raise a charge against land in the UK unless they’ve registered with Companies House."
        },
        {
            "heading": 2,
            "text": "An update on progress"
        },
        {
            "text": "The register has had a significant impact since it was launched at pace in August 2022."
        },
        {
            "text": "Here are some of the highlights so far:"
        },
        {
            "text": "The aim of the Register of Overseas Entities is to increase transparency and reveal the beneficial owners of overseas entities that own property or land in the UK, and it’s clear from these figures that the register is meeting that aim and adding value."
        },
        {
            "text": "Our enforcement action to encourage an even higher compliance rate is well underway. We’re issuing warning notices and penalties to entities that have failed to register or failed to file an update statement."
        },
        {
            "text": "Overseas entities that have not registered with Companies House already face restrictions on selling, transferring, leasing or raising charges against their property or land. Overseas entities also cannot buy any new UK property or land without an Overseas Entity ID. This means the register is already having a real impact on stopping the flow of illegal activity through this property or land."
        },
        {
            "text": "We’ve published guidance on GOV.UK to explain our approach to financial penalties and other enforcement measures."
        },
        {
            "heading": 2,
            "text": "Information that's not publicly available"
        },
        {
            "text": "The data on the register can be accessed free of charge on the Find and update company information service, using our advanced search function."
        },
        {
            "text": "We know there’s been some media coverage about the register in recent weeks, and it’s great to see that the data on the new register is being widely used, shared and investigated."
        },
        {
            "text": "We understand there are concerns about data on the register that's not publicly available, specifically information about trustees of trusts who are registrable beneficial owners. The government has committed to publishing a consultation by the end of this year to invite people to share and discuss these concerns."
        },
        {
            "text": "Along with our colleagues at the Department for Business and Trade, we’re also working closely with stakeholders on new secondary legislation. This secondary legislation will set out which third parties can apply for information about trusts and under what circumstances. This will be the first step in making trust information more transparent."
        },
        {
            "text": "In the meantime, we’re continuing to capture information about trustees and trusts and we’re sharing this data with HMRC. We're fully committed to sharing this information with the appropriate organisations, and it’s being acted on quickly where appropriate."
        },
        {
            "heading": 2,
            "text": "A reminder about the annual update statement"
        },
        {
            "text": "All entities on the register need to file an update statement every year to confirm that the information we hold is correct and up to date, unless they’ve successfully applied to be removed from the register. They must file an update statement even if nothing has changed."
        },
        {
            "text": "It’s a criminal offence not to file the update statement, and entities may face prosecution or a financial penalty if they do not file. Overseas Entity IDs will become invalid if an entity does not file the update statement on time. They will not become valid again until they bring their record up to date and file their update statement."
        },
        {
            "text": "Entities will not be able to buy, sell, transfer, lease or raise charges against property or land in the UK if they miss their filing deadline and their Overseas Entity ID is invalid."
        },
        {
            "text": "The update statement is an important step in making sure the data on the register is as accurate and transparent as possible, and to make sure overseas entities continue to comply with their responsibilities."
        },
        {
            "heading": 2,
            "text": "Next steps"
        },
        {
            "text": "Entities that must supply information about a related trust will soon be able to file their update statement online. This includes trusts that the entity has already told us about, and trusts that it needs to tell us about as part of this update statement."
        },
        {
            "text": "We’re also working on an online service for those who wish to apply to be removed from the Register of Overseas Entities. An overseas entity will be able to apply to be removed from the register if it's no longer registered as the proprietor (owner) of land or property in the UK. We’ll reject the application if the overseas entity is still listed on any of the UK’s three land registers as being the registered owner of land or property in the UK. The fee will not be refunded if we reject the application."
        },
        {
            "text": "We’ll be supporting the government consultation on transparency later in the year, and we’ll be working closely with our colleagues at the Department for Business and Trade to implement any agreed outcomes."
        }
    ]
}