{
    "url": "https://space.blog.gov.uk/2023/09/26/uk-space-agency-to-bring-its-space-for-everyone-steam-tour-to-plymouth/",
    "title": "UK Space Agency to bring its 'Space for Everyone' STEAM tour to Plymouth",
    "authors": [
        "UK Space Agency"
    ],
    "categories": [
        "Championing Space",
        "Events"
    ],
    "pub_date": "2023-09-26T11:24:54+01:00",
    "content": [
        {
            "text": "The UK Space Agency is delighted to announce that it will be docking its 72 ft model rocket in The Piazza, Plymouth, from 28 September to 2 October, bringing the awe-inspiring 'Space for Everyone’ tour to the region."
        },
        {
            "text": "This exciting initiative aims to captivate and educate the next generation, showcasing the UK's flourishing space industry and the diverse array of career opportunities available. Organisations including Spaceport Cornwall, Foot Anstey and World Wide Fund for Nature will be in attendance to share more about the industry in the area. "
        },
        {
            "text": "The ‘Space for Everyone’ tour will serve as a beacon of inspiration, shedding light on the pivotal role that space plays in enhancing life on Earth. "
        },
        {
            "text": "Visitors, including children, families and teachers will have the unique opportunity to witness first-hand how space technologies benefit our daily lives and gain insights into the continuous efforts to explore the great unknown."
        },
        {
            "text": "Matt Archer, Director of Launch at the UK Space Agency:"
        },
        {
            "text": "Ross Hulbert, Head of Engagement, Spaceport Cornwall:"
        },
        {
            "text": "Councillor Sally Cresswell, Cabinet Member for Education, Skills and Apprenticeships at Plymouth City Council, said:"
        },
        {
            "text": "Space for Everyone promises an immersive experience, incorporating state-of-the-art virtual reality headsets to provide unparalleled insights into what a launch from the UK looks like, and the job roles involved in making it happen. "
        },
        {
            "text": "Visitors will also have the opportunity to explore various interactive areas, learning about the crucial role of satellites and discovering the diverse career paths available within the UK space industry."
        },
        {
            "text": "Admission to the tour is free, no booking required, and while the event is primarily targeted towards children aged 9 to 18, it is guaranteed to ignite a passion for science, technology, engineering, arts and mathematics (STEAM) in individuals of all ages. Mums, dads, grandparents and next-door neighbours are all invited to participate and experience the excitement of the Space for Everyone tour. "
        },
        {
            "text": "For further information about the Space for Everyone tour, please visit https://spaceperson.co.uk/rocket-tour/ or follow @spacegovuk on social media."
        }
    ]
}