{
    "url": "https://marinescience.blog.gov.uk/2023/09/26/what-do-a-communications-officer-a-shellfish-scientist-and-a-fish-health-inspector-have-in-common/",
    "title": "What do a Communications Officer, a Shellfish Scientist and a Fish Health Inspector have in common?",
    "authors": [
        "Bek Trehern",
        "Molly Meadows",
        "Sam Westcott"
    ],
    "categories": [
        "Animal Health",
        "biodiversity",
        "Careers",
        "Education",
        "Field Research",
        "Fisheries",
        "Science"
    ],
    "pub_date": "2023-09-26T14:40:41+01:00",
    "content": [
        {
            "text": "Answer: They all graduated from a Zoology degree at the University of Exeter in 2016! "
        },
        {
            "text": "With the start of a new academic year, this time often comes with big decisions and a lot of uncertainty. Perhaps you’re making decisions on which university to attend, or maybe you’ve just started university and are beginning to wonder what the next 3 years might look like. Often people will start university doing a degree with a good idea of what they want to do, but others maybe aren’t quite so clear, but that’s what makes this time so exciting! We hope that this blog shows that even though you’ve picked your degree, the path you take is unwritten and there are so many opportunities ahead of you."
        },
        {
            "text": "In this latest blog, we hear from three 2016 University of Exeter graduates, Bek Trehern (BT), Molly Meadows (MM) and Sam Westcott (SW), who all started in the same place, a Zoology course in Cornwall in 2013, and are now all in very different careers all at the Centre for the Environment, Fisheries and Aquaculture Science (CEFAS). Although starting out in the same place, with the same degree, they’ve each taken very different routes within marine science. Hear about their experience at Exeter, their path since graduating, their current role and top advice to any new Zoology students."
        },
        {
            "text": "BT I’m Bek and I am an Engagement and Communications Officer at Cefas. My role involves finding different ways to communicate the science we do and the impact it has to a wide range of audiences including government, non-governmental organisations, local communities and the general public."
        },
        {
            "text": "MM I’m Molly and I am a Shellfish Scientist at Cefas. I specialise in crab, lobster and cephalopod fisheries. This entails carrying out research and supporting development projects and surveys to ensure that these fisheries have the data they need, including the regular monitoring and analysis involved with stock assessment. I am lucky to be able to attend fishing surveys aboard research vessels to collect data and samples directly."
        },
        {
            "text": "SW I’m Sam and I am a Fish Health Inspector at Cefas. The Fish Health Inspectorate aims to protect the health of fish and shellfish in the UK ensuring our ability to trade internationally. We do this through a programme of inspections, disease investigations, enforcement, export/import control and collaboration between the other relevant bodies such as the Environment Agency, Marine Management Organisation, Inshore Fisheries and Conservation Authority, Natural England and Department for Environment, Food and Rural Affairs. As a member of the field team, I spend most of my time out travelling the country visiting sites and taking samples. I’ve also been involved in the Clean Seas Environment Monitoring Programme on board the RV Cefas Endeavour taking samples from fish in our coastal waters."
        },
        {
            "text": "Why did you choose to study Zoology at Exeter?  "
        },
        {
            "text": "BT I knew I wanted to do something that combined my love of the ocean, nature, animals and the environment. As a child, I always wanted to be a marine biologist, but coming from Yorkshire, it didn’t seem very achievable! During careers meetings at school, I was often told that no one becomes a marine biologist, so I started looking for something similar. It was actually my A-level biology teacher who encouraged me to do Zoology. I chose Exeter specifically as I liked that I was able to select my modules and design the degree to suit me, plus it was (and is) renowned for the expertise of the lecturers. I think I really liked that I was going to get good exposure to a range of disciplines. Plus the chance to live in Cornwall was a massive bonus!"
        },
        {
            "text": "MM I chose to do zoology because I was always fascinated by the natural world, spending much of my childhood looking for critters. I loved learning, and the draw of learning everything to do with the animal kingdom was too difficult to resist. I chose Exeter because of the setting; I grew up with family in Falmouth and loved Cornwall. Learning about animals whilst having tangible access to the coast and its creatures was incredible."
        },
        {
            "text": "SW Course wise, I knew that I was always going to end up on a zoology degree. Growing up on a trout farm in the Yorkshire Dales I was immersed in nature from day one. When I wasn’t running around on the moors chasing things, I was crawling through streams – studying zoology didn’t really feel like a decision, more just a natural progression from what I'd always done as a kid. Why Exeter specifically? I was pretty set on Sheffield until the open day which was partly spent on the beach in the sun while it was snowing back home in Yorkshire. I never looked back!"
        },
        {
            "text": " "
        },
        {
            "text": "What was your biggest highlight from your degree?"
        },
        {
            "text": "BT I think it was my third-year field trip to the Bahamas. It was the most incredible experience waking up every day and just heading out into the tropical waters and being able to truly immerse myself in marine biology studying everything about sharks, rays, coral and tropical fish. It was at this point that I thought my dream of being a marine biologist maybe wasn’t that out of reach."
        },
        {
            "text": "MM One of the strongest memories from my time at Exeter was the variety of modules and the experts leading them. On any given day you could be learning incredible facts about the sensory ecology of a beetle, before going to a seminar to workshop social experiments demonstrating the evolution of human culture, to then rounding off the day by heading to the lab to observe the dissection of a bottlenose dolphin."
        },
        {
            "text": "SW The lecturers teaching us. Personable and genuine, yet clearly excellent in their respective fields. Another is the location of the course itself, with easy access to the unique Cornish coastline and wild spaces. I also appreciated how this was folded into many modules on the course."
        },
        {
            "text": " "
        },
        {
            "text": "What have you been doing since you left Exeter and what are you doing now? "
        },
        {
            "text": "BT After graduating from my BSc, I continued at Exeter to do a Masters by Research studying lionfish in the Bahamas. After my six-month research period, instead of returning home, I decided to undertake an internship at the University of Western Australia investigating the impact of ocean acidification on various corals and coralline algae. After 2 years, I had to come back to the UK and was hired as an Entertainments and Education Supervisor at the Cornish Seal Sanctuary. In this role, I realised what I enjoyed most was communicating and sharing my love and knowledge of nature and the ocean. I then worked as an Engagement Officer at the Field Studies Council. However, as much as I enjoyed these roles, I knew that I missed being connected to science. In July 2022, I started as an Engagement and Communications Officer at Cefas."
        },
        {
            "text": "MM After finishing my undergraduate degree, I went on to do a Master by Research studying stingrays in the Bahamas, this was such an incredible experience and I still dream of stingrays almost every night. I then took a career break to walk from Mexico to Canada on the Pacific Crest Trail. Following this intensive lesson in resilience, I joined the civil service faststream where I learnt how science was actually implemented and used in central government. From here I transferred within the civil service to Cefas. I am now a scientist within the shellfish team."
        },
        {
            "text": "SW After graduating I did some travelling through the US, Mexico, down to Costa Rica and everything in between. I washed up back in the UK for brief a stint as a lumberjack, returned to fish farming and then Stannary bar back in Penryn. I started my masters in Aberdeen studying Fisheries and Marine ecology and focused my dissertation on salmonid aquaculture and genetics. My first role at Cefas was in the Lowestoft lab, in the radiochemistry team testing radionuclide levels in our environment before moving to Weymouth for my current role as a Fish Health Inspector."
        },
        {
            "text": "What’s your favourite part of your role at Cefas? "
        },
        {
            "text": "BT My current role at Cefas is the perfect combination of science, communication and engagement. I really enjoy taking cutting edge science and turning it into something easily digestible for a non-science audience. I also get to work with such a range of people both internally and externally which makes my role incredibly varied."
        },
        {
            "text": "MM At the end of last year, I was privileged to go on the RSS Discovery expedition across the Atlantic, as part of the Blue Belt Programme. My role as crustacean and cephalopod Identification Specialist was to identify alien creatures from the deep which very few people had ever heard of, let alone seen in the flesh."
        },
        {
            "text": "SW The independence. For the most part, I decide when I go where. I have my programme of visits to fish farms to complete within a certain timeframe and it’s my responsibility to see them done, but I get to choose how I accomplish this. I don’t spend much time in an office, and I really appreciate the variety of work we get to do."
        },
        {
            "text": " "
        },
        {
            "text": "What skills and experiences from your degree have been most useful for your career/current role? "
        },
        {
            "text": "BT I think the exposure to different research areas and expert researchers that I had during my degree were invaluable as I’m now able to understand complex terminology and find a way to make it accessible. I also work with a range of people on a day-to-day basis, and I think my time at university set me up to do this well."
        },
        {
            "text": "MM Well, you could say that as I am essentially a professional rock pooler now, so the regular rock pooling field courses at Exeter were fundamental to my professional trajectory! I also do a lot of statistical analysis in my role, so the modules that introduced the foundations of the programme R and biological statistics at Exeter, I use almost every day."
        },
        {
            "text": "SW I think the introduction to academia gave me a foundation in this space to go into a scientific organisation. There are methods of collaboration, ways of speaking and certainly ways of working that are consistent throughout the scientific landscape and Exeter introduced me to that."
        },
        {
            "text": "What advice would you give to a current student who wishes to pursue your career? "
        },
        {
            "text": "BT Try things and take full advantage of every opportunity you are given. I feel like I’ve moved around a lot between research, academia, education and communications to try and get a real feel for what I enjoy doing. It’s so important to enjoy what you do (we spend a lot of time at work), so don’t be afraid to try new things."
        },
        {
            "text": "MM The best opportunities will arise from curiosity and enthusiasm, so try to keep this at the heart of every decision you make!"
        },
        {
            "text": "SW I think as a student the most useful thing you can do is find what your skills are, what sets you apart or interests you and then try to maximise this. For me, it was utilising my upbringing on fish farms and making the most of this practical experience with highly regarded degrees like the one at Exeter to give me the academic skills I needed to enter a more scientific world."
        }
    ]
}