{
    "url": "https://nda.blog.gov.uk/being-a-part-of-our-long-term-mission-opens-up-so-many-career-possibilities/",
    "title": "'Being a part of our long-term mission opens up so many career possibilities'",
    "authors": [
        "Jacqueline Longrigg"
    ],
    "categories": [
        "Recruitment",
        "Skills",
        "Uncategorized"
    ],
    "pub_date": "2025-02-06T13:41:45+00:00",
    "content": [
        {
            "text": "Jacqueline Longrigg, our Group People Development Director, on how we are investing in early careers - and how you can be part of our mission:"
        },
        {
            "text": "This year marks 20 years since the Nuclear Decommissioning Authority was established and tasked with decommissioning the UK’s oldest nuclear sites. It’s one of the most important environmental programmes in the world - protecting people and the planet."
        },
        {
            "text": "It’s an opportunity to reflect on important milestones we’ve achieved so far as a group of organisations, and also to look to the future and think about the challenges we’re yet to face in our decades long mission and how we’ll overcome them."
        },
        {
            "text": "The nature of our work means there will always be things we are not able to anticipate, but one thing we do know for sure is that having the right people, with the right skills, at the right time will be critical to our success."
        },
        {
            "text": "From January 26 to 29, we took part in the Nuclear Industry Association’s (NIA) Nuclear Week in Parliament. It was an opportunity to bring to life the progress we have made in our mission and the wider value the NDA group provides for the nation."
        },
        {
            "text": "I gave the keynote speech at the skills and apprenticeships fair and welcomed the chance to engage MPs, Parliamentarians and industry on the talent we are developing across our group and the early careers pathways we invest millions in each year."
        },
        {
            "text": "We are developing the skills and the future experts that the nuclear sector needs to thrive and which the NDA group need to continue to keep the nation safe."
        },
        {
            "text": "I took 12 of our graduates and apprentices to Parliament so they could give a first-hand account of the work they’re doing on the ground."
        },
        {
            "text": "What was most striking was the passion with which they spoke about their work and their experience in the NDA group, but also their diversity. Diversity of role, skills, background, gender, and thinking."
        },
        {
            "text": "They travelled to Westminster from all over the UK where they’re doing apprenticeships or graduate schemes in all sorts of disciplines from HR, Communications and Sustainability to Design Engineering, Electrical and Maintenance.  "
        },
        {
            "text": "It speaks to the strength of our group but also the unique opportunities we provide. We’re made up of five businesses, we have 17 sites across the UK, and we employ around 17,000 people in over 900 different roles."
        },
        {
            "text": "Whether you have a scientific background and want to go into engineering or radiological protection, or you’re interested in a career in project management, cyber or finance there’s something for pretty much everyone."
        },
        {
            "text": "Though we’ve been operating for 20 years, we’re still in the infancy of our mission, decommissioning our sites will take hundreds of years, which is why we’re focused on investing in the next generations of pioneers."
        },
        {
            "text": "There are currently than 1,500 apprentices and graduates in our early careers schemes across the group, with a record number recruited in 2024, and we’ve also sponsored hundreds of PhD students and post-doctoral researchers."
        },
        {
            "text": "Our apprenticeship schemes across our group are hugely successful and in 2024 every single one of our apprentices successfully completed their programmes and became qualified. With National Apprenticeship Week upon us (February 10 to 16) we are encouraging people to apply or register their interest in our schemes now."
        },
        {
            "text": "We’ve achieved a huge amount in the last 20 years we’ve demolished or reused 274 buildings and released or redesignated 9% of land for reuse. Invested £277m of socio-economic funding to support significant projects that enable permanent and sustainable change in site communities. Transported over 2000 casks of nuclear material transported by sea, and over 5 million miles of nuclear rail transports, with a 100% nuclear safety record."
        },
        {
            "text": "But there’s much more to do and we never stand still."
        },
        {
            "text": "We are always looking to the future. As well developing our workforce that means investing around £100 million per year in cutting edge research developing pioneering solutions to tackle our unique engineering challenges."
        },
        {
            "text": "My message to anyone considering a career in the NDA group is simple. Do it."
        },
        {
            "text": "You could be part of the team that hands a site back to a community for its next use, that helps us deliver our net zero goals, or that helps develop new technologies so we can clean up hazardous areas that have been sealed shut for decades. Being a part of our long-term mission, opens up so many possibilities and we need a diverse workforce helping us drive change. If you’re interested in a career with us you can visit our website to find out more "
        }
    ]
}