{
    "url": "https://mhclgmedia.blog.gov.uk/2025/02/06/explainer-devolution-and-local-elections/",
    "title": "Explainer: devolution and local elections",
    "authors": [
        "mhclgpress"
    ],
    "categories": [
        "Devolution",
        "Elections"
    ],
    "pub_date": "2025-02-06T12:22:03+00:00",
    "content": [
        {
            "text": "What is devolution and what will it mean? "
        },
        {
            "text": "Devolution is about giving power back to communities – shifting away from Westminster to the local leaders that know their areas best and giving them the tools to make a difference to peoples’ lives – through better, quicker transport, affordable housing projects, skills programmes and employment support. "
        },
        {
            "text": "In December 2024 the government published the English Devolution White Paper, setting out the plan to spread devolution to more areas across the country – unlocking growth in our regions and putting money back into the pockets of working people, as set out in the government’s Plan for Change. "
        },
        {
            "text": "It set out a plan to see full devolution in England and an ambitious programme of Local Government Reorganisation – replacing the current two-tier system with strong unitary councils that can form the building blocks to support effective mayoral strategic authorities. To move forward and make sure people could access these benefits as soon as possible, we asked councils to come forward and express their interest in being part of our Devolution Priority Programme – a fast-tracked programme to mayoral devolution with a view to new Mayoral authorities being in place in May 2026.  This week, the government announced the six new areas that will join the Devolution Priority Programme – with Mayors to be elected in May 2026 – the largest single package of mayoral devolution in England. "
        },
        {
            "text": "Given the ambitious timescales for this change, areas were only asked to come forward if they felt they had the local consensus from leaders to come together, a sensible geography for the proposed new areas (as set out in the White Paper) and readiness to achieve mayoral devolution to the May 2026 timetable.  "
        },
        {
            "text": "May 2025 elections "
        },
        {
            "text": "In a Ministerial letter to areas following the publication of the White Paper, it was acknowledged that for some areas the timing of May 2025 local elections would affect their planning – particularly for those keen to deliver both reorganisation and devolution to the most ambitious timeframe. Ministers have been very clear that the bar for postponing any 2025 elections was set very high – and would only be permitted if it would clearly help deliver both reorganisation and devolution to the most ambitious timeframe – unlocking the opportunities these will bring for local people. "
        },
        {
            "text": "In response to the government’s letter of December 2024, 18 councils made requests to postpone their elections. Of these, 9 have been agreed and will see their May 2025 elections postponed to May 2026. This means that of the 33 council elections scheduled for May 2025, 24 will still take place. The remaining 9 will be delayed until May 2026. In addition, in May 2025, 6 Mayoral elections will be held (4 for Mayoral Combined (County) Authorities and 2 for individual Local Authorities).   "
        },
        {
            "text": "This follows a long standing precedent. Between 2019 and 2022, the then government legislated to postpone 17 local council elections for one year during preparatory local government reorganisation work. Most recently, this included the postponement of elections to three county councils (Cumbria, North Yorkshire, and Somerset) from 2021 to 2022.  "
        },
        {
            "text": "Postponing this small number of elections will mean reorganisation and devolution can move at pace in these areas – with Mayoral devolution being delivered in parallel with local government reorganisation – reducing timescales so that working people and communities can feel the benefit and freedoms far quicker. Previously, it has taken years to achieve both reorganisation and devolution with a number of areas not having yet achieved both - for example in both Somerset and Cumbria it took nearly three years (31 months) for the formation of new unitary authorities, with neither area yet gaining full devolution. We want to see areas on the priority programme move to full mayoral devolution to a much more ambitious timetable – with 15 months between now and these areas achieving Mayoral devolution. "
        },
        {
            "text": "The decision to permit requests to postpone elections was taken following consideration against strict criteria, which set out that elections would only be postponed for two scenarios: "
        },
        {
            "text": "What happens next? "
        },
        {
            "text": "Government will invite all two tier areas to develop proposals for reorganisation, launch consultations in DPP areas to allow local residents and stakeholders to provide views on the proposals to create new Mayoral Combined Authorities or Combined County Authorities.   "
        },
        {
            "text": "The consultations will run for 8 weeks approximately and will inform Ministers’ decisions on whether statutory tests have been met when making the relevant legislation.   "
        },
        {
            "text": "For areas where elections have been postponed, we will work with them to move to new ‘shadow’ unitary councils as soon as possible. For those submitting reorganisation proposals by May 2025 (Surrey), we would aim to hold shadow unitary elections in May 2026.  "
        },
        {
            "text": "For Devolution Priority Programme areas we will ask for their proposals by September 2025, with mayoral elections in 2026 and shadow unitary elections in 2027. This will put DPP areas on a faster timeline for implementing both new unitaries and devolution than the majority of other areas."
        }
    ]
}