{
    "url": "https://marinedevelopments.blog.gov.uk/2025/02/06/seven-estuary-implementation-session-advancing-cross-border-marine-planning/",
    "title": "Severn Estuary Implementation Session: Advancing Cross-Border Marine Planning",
    "authors": [
        "Poppy Phillipps, Marine Planner (Implementation)"
    ],
    "categories": [
        "marine planning"
    ],
    "pub_date": "2025-02-06T12:29:21+00:00",
    "content": [
        {
            "text": "In November 2024, the Marine Management Organisation (MMO) and Welsh Government co-hosted an event in Cardiff to support cross-border marine planning in the Severn Estuary. This stakeholder engagement session, following the publication of our Severn Estuary Cross Border Marine Planning Guide, aimed to bring together a diverse group of stakeholders relevant to the area and provide guidance and clarity for marine users on the management and governance processes in the Severn Estuary. By providing the space for conversation, the event exposed the similarities, and differences of the Welsh National Marine Plan and the South West Marine Plan, focusing on their implementation in marine decision-making."
        },
        {
            "text": "The event opened with a presentation from the MMO and Welsh Government Marine Planning teams, on shared marine planning functions. This included highlighting cross-border policies that are consistent across both plans and emphasising the importance for coordination. Throughout the morning, interactive sessions encouraged attendees to explore the key social, economic, and environmental considerations of the Severn Estuary, identifying links and emerging themes."
        },
        {
            "text": "In true planning fashion, the second half of the day continued with participation in the Marine Spatial Planning Game, as seen in the photos below. This cross-border scenario challenged players to think collaboratively about marine spatial planning across administrative borders."
        },
        {
            "text": "As the first collaborative event with another devolved administration focusing on cross-border marine planning, the event received positive feedback. Attendees gained a deeper understanding of how marine plans interact within the Severn Estuary. The event served as a strong foundation for fostering further awareness and conversations on cross-border marine planning. For example, following the event, the Severn Estuary Coastal Group introduced a dedicated section on marine planning in the Severn Estuary to their website. This section references the marine plans, the cross-border guidance, and the connections between shoreline management plans and marine plans."
        },
        {
            "text": "Looking ahead"
        },
        {
            "text": "Building on the success of this event, we aim to host similar sessions focused on the Dee Estuary, exploring cross-border marine planning between the Welsh National Marine Plan and the North West Marine Plan."
        },
        {
            "text": "If you would be interested in joining the conversation on cross-border marine planning or would like to be invited to future events, please contact us at planning@marinemanagement.org.uk. We look forward to hearing from you and continuing this important work together."
        }
    ]
}