{
    "url": "https://marinedevelopments.blog.gov.uk/2025/05/28/find-out-more-about-marine-licensing/",
    "title": "Find out more about Marine Licensing",
    "authors": [
        "David Patrick, Digital Communications Manager"
    ],
    "categories": [
        "marine licensing"
    ],
    "pub_date": "2025-05-28T14:11:59+01:00",
    "content": [
        {
            "text": "The Marine Management Organisation (MMO) Marine Licensing team answer some of the frequently asked questions they receive about the marine licensing process."
        },
        {
            "heading": 2,
            "text": "What is a marine licence?"
        },
        {
            "text": "A marine licence is a consent granted under the Marine and Coastal Access Act 2009 to enable marine licensable activities to be carried out. The MMO is responsible for marine licensing in English inshore and offshore waters and for Northern Ireland offshore waters."
        },
        {
            "text": "What type of activities are likely to require a marine licence?"
        },
        {
            "text": "There are 13 marine licensable activities defined in section 66 of the Marine and Coastal Access Act. Examples include:"
        },
        {
            "text": "To determine if you need a marine licence use the marine licence interactive assistance tool "
        },
        {
            "text": "Is a marine licence the same as planning permission?"
        },
        {
            "text": "No. Planning permission and marine licences are separate consents. Your project may require both consents. You can contact your local planning authority to determine if you also need planning permission."
        },
        {
            "heading": 2,
            "text": "The MMO Public register?"
        },
        {
            "text": "How can I find out about marine licences in my area?"
        },
        {
            "text": "You can use the Marine Management Organisations public register to identify marine licences and marine licence applications in your area. In addition, you can use Explore Marine Plans."
        },
        {
            "text": "How do I navigate the public register?"
        },
        {
            "text": "You can search for a case using its case reference. Or you can use the advanced search tool function which allows you to search by marine area, applicant name or project title (not an exhaustive list). The MMO recommends you use Explore Marine Plans to identify works in a more precise area if you do not have any further details about the project."
        },
        {
            "text": "What information is available to view on the public register?"
        },
        {
            "text": "Marine licence applications and decisions, including marine minerals extraction and renewable energy documents. This includes the location of the works and information to support the application, including a description of the project."
        },
        {
            "text": "Environmental impact assessment documents, including screening and scoping opinions and environmental impact assessment consent decisions where published."
        },
        {
            "heading": 2,
            "text": "Consultations"
        },
        {
            "text": "How are the public made aware of proposed marine licences?"
        },
        {
            "text": "Applicants are required to advertise their proposed works. Advertisements include a notice in a prominent location near the works site and notices in a local newspaper. When the notices are published a public consultation starts."
        },
        {
            "text": "Who does MMO consult?"
        },
        {
            "text": "The MMO undertakes a stakeholder consultation and public consultation for all standard marine licence applications (excluding self service applications). The primary advisors that MMO consults includes Natural England, Environment Agency, Historic England and Maritime and Coastguard Agency (not an exhaustive list)."
        },
        {
            "text": "Public consultation enables all interested parties not identified as a primary advisor to submit comments. This includes members of the public and local groups/organisations."
        },
        {
            "text": "Note: Marine licence applications are only available on the public register once consultation has been opened by the MMO."
        },
        {
            "text": "How to submit a public representation?"
        },
        {
            "text": "To submit a public representation, you should visit the MMO public register and search for the case, using the case code."
        },
        {
            "text": "MMO also accepts representations via the following formats:"
        },
        {
            "text": "In all cases, correspondence must:"
        }
    ]
}