{
    "url": "https://defrafarming.blog.gov.uk/2025/05/28/higher-level-stewardship-increased-payment-rates-now-available/",
    "title": "Higher Level Stewardship: increased payment rates now available",
    "authors": [
        "The Team"
    ],
    "categories": [
        "Countryside Stewardship"
    ],
    "pub_date": "2025-05-28T11:01:56+01:00",
    "content": [
        {
            "text": "Higher Level Stewardship (HLS) payment rates have stayed the same for more than 10 years. In that time, they’ve fallen behind the rates offered through other schemes including Countryside Stewardship Higher Tier (CSHT) and the Sustainable Farming Incentive (SFI).  "
        },
        {
            "text": "We are investing £30 million to increase payment rates so farmers in HLS agreements can continue to restore habitats, support rare species, preserve historic features and maintain traditional landscape features in our iconic countryside.  "
        },
        {
            "text": "We are raising 157 options by 34.4% of the difference between the HLS rate set out in an agreement holder's document and the equivalent CSHT or SFI action, to bring them more in line with those schemes. "
        },
        {
            "text": "We blogged about this in February and said we’d let agreement holders know when the new rates are released. "
        },
        {
            "text": "The updated rates are now on GOV.UK."
        },
        {
            "text": "In this post, we’ll share some of the background and explain what the uplift means for those currently in HLS agreements.  "
        },
        {
            "heading": 2,
            "text": "Why we’re increasing HLS payment rates"
        },
        {
            "text": "HLS agreement holders – often upland farmers and early adopters – play an essential role in managing land in ways that support food production, farm productivity and environmental outcomes. "
        },
        {
            "text": "The increases we’re announcing today reflect the long-term value these farmers bring. It also helps us to maximise the impact of the farming budget by supporting food production and the environment at the same time. "
        },
        {
            "text": "The table of updated payment rates shows how much each eligible option is now worth, so agreement holders can get an idea of how their total payments may change. "
        },
        {
            "text": "The new payment rates apply from 1 January 2025. Agreement holders will receive the updated payment against their 2025 claim, which will be paid from December 2025. "
        },
        {
            "text": "We will pay outstanding claims from previous years at the original rates."
        },
        {
            "text": "These uplifts will benefit smaller, family-run farms, including in those in upland areas where we have agreements with individuals and groups of commoners.  "
        },
        {
            "text": "Whether an individual's payments increase will depend on the options in their agreement. "
        },
        {
            "heading": 2,
            "text": "Non-standard rates "
        },
        {
            "text": "If an agreement includes an option that’s eligible for an increase, the rate will go up – even if the rate in that agreement is different to the standard one in the published table. "
        },
        {
            "text": "Each agreement is different, and payment rates for the same options can vary depending on the agreement start date."
        },
        {
            "text": "Some agreements include non-standard or ‘negotiated’ payment rates to reflect the specific circumstances of the holding. For example, the accessibility of the land.  "
        },
        {
            "text": "Details of any non-standard rates are set out in the agreement document. "
        },
        {
            "text": "It doesn’t matter if you have a standard or ‘negotiated’ payment rate. We will increase an individual’s payment rate by 34.4% of the difference between the HLS option rate shown in their agreement document and the equivalent CSHT option or SFI action.  "
        },
        {
            "heading": 2,
            "text": "How the increased rates were calculated  "
        },
        {
            "text": "HLS rates will increase where there is an equivalent CSHT or SFI action which is paid at a higher rate. "
        },
        {
            "text": "This means that the payment rates for 157 options will increase.  "
        },
        {
            "text": "We’re updating the system to generate the new payment calculations for each agreement holder. Therefore, we aren’t able to confirm how much an agreement holder’s payment will increase by until later in the year when we begin to make payments. "
        },
        {
            "text": "Agreement holders with standard rates in their agreements will be able to use the tables published on GOV.UK to calculate how much each option in their agreement will increase by. "
        },
        {
            "text": "To calculate the increase to an agreement that contains non-standard rates, agreement holders need to calculate the difference between the non-standard rate set out in that agreement and the CS/SFI equivalent."
        },
        {
            "text": "There are 23 HLS options that are already paid at a higher rate than their CS and SFI equivalent, so we are not changing these. "
        },
        {
            "text": "There are a further 22 options that do not have a comparable option or action in CS or SFI. These will not change from their existing value.   "
        },
        {
            "text": "The Entry Level Stewardship (ELS) element of all agreements will stay the same.  "
        },
        {
            "text": "The increases will be effective from 1 January 2025 and will be paid from December 2025. "
        },
        {
            "heading": 2,
            "text": "Subscribe to the Farming blog "
        },
        {
            "text": "Subscribe to the Farming blog to stay up to date with the latest developments from the Farming and Countryside Programme."
        },
        {
            "text": "By subscribing, you'll receive an email notification whenever we publish a new post."
        }
    ]
}