{
    "url": "https://mhclgdigital.blog.gov.uk/2025/05/28/putting-innovation-at-the-heart-of-unlocking-small-sites/",
    "title": "Putting innovation at the heart of unlocking small sites",
    "authors": [
        "The Digital Planning team"
    ],
    "categories": [
        "Digital Planning",
        "PropTech"
    ],
    "pub_date": "2025-05-28T10:58:52+01:00",
    "content": [
        {
            "text": "In a significant move to accelerate housing delivery across England, the Deputy Prime Minister has today announced key changes to the planning system, alongside a comprehensive package of measures designed to empower small and medium enterprise (SME) housebuilders to build out smaller sites faster. "
        },
        {
            "text": "Part of the Deputy Prime Minister's announcement is our £1.2 million PropTech Innovation Challenge, now open for applications from tech innovators. This initiative encourages partnerships between innovative tech companies, local authorities and developers to explore cutting-edge solutions – including leveraging improved data systems to help SMEs secure financing more efficiently for small-site developments. "
        },
        {
            "text": "This announcement is part of the government's Plan for Change, reinforcing the commitment to building 1.5 million new homes and driving economic growth across every region of England. "
        },
        {
            "heading": 2,
            "text": "Harnessing digital innovation to meet housing targets "
        },
        {
            "text": "Delivering 1.5 million homes across England is a fundamental mission of this government. To achieve this ambitious target, the Digital Planning Programme is tapping into the transformative potential of innovation and technology within the housing sector.  "
        },
        {
            "text": "Our £1.2m PropTech Innovation Challenge, launched in partnership with Geovation, directly supports MCHLG’s efforts to accelerate delivery of new homes by seeking scalable digital solutions that can unlock the often-untapped potential of small sites. "
        },
        {
            "text": "This ‘Challenge’ model is designed to bring fresh perspectives and cutting-edge ideas into government’s policy processes, highlighting novel and efficient ways for the sector to deliver the homes our communities need. We’re  inviting the UK’s brightest tech minds to develop solutions in collaboration with those on the ground – local planning authorities, industry partners, and housing developers. Up to 12 successful innovators will share £1.2 million in funding to bring these vital digital tools to life and take them to market, potentially transforming how we approach small-site development across the country. "
        },
        {
            "heading": 2,
            "text": "The Challenge "
        },
        {
            "text": "Our Digital Planning Programme is actively working hand-in-hand with the market, engaging directly with developers and innovators to understand the specific hurdles that SME housebuilders face. We firmly believe that targeted technological interventions can overcome many of these barriers and are committed to funding creative solutions in 3 key areas identified through in-depth research based on interviews and workshops with cross-industry experts and an extensive literature review: "
        },
        {
            "heading": 3,
            "text": "Challenge area 1: Enhanced accessibility, transparency, and usability of land ownership and availability data:  "
        },
        {
            "text": "Making it easier and more efficient for SME developers and local communities to identify available land and quickly understand its development potential. "
        },
        {
            "text": "Housing developers often struggle with accessing accurate, current and complete land ownership data, leading to delays and abandoned schemes. The costly and time-intensive process of assessing land suitability presents a significant barrier.  "
        },
        {
            "heading": 3,
            "text": "Challenge area 2: Unlocking small sites and SME potential through de-risking investment and viability:  "
        },
        {
            "text": "Developing tools that reduce the perceived risk and improve the financial viability and attractiveness of small-scale development projects. "
        },
        {
            "text": "According to research from Litchfields Planning Consultancy, \"Only sites below 100 dwellings on average begin to deliver within a 5-year period (or a parliamentary term) from validation of an outline application\" but face challenges, including inconsistent planning decision-making, a lack of specific local policy guidance, difficulties in connecting to local infrastructure, and the disproportionate cost of navigating the planning process. This has led in part to a significant drop in homes completed by SME developers, from 39% of all homes in 1990 to 12% in 2017, as reported by the Federation of Master Builders."
        },
        {
            "heading": 3,
            "text": "Challenge area 3: Offering greater certainty to developers on existing and future infrastructure capacity:  "
        },
        {
            "text": "Providing clearer, more accessible and reliable insights into essential infrastructure to facilitate more sustainable and de-risked development. "
        },
        {
            "text": "The cost, complexity and time associated with connecting to essential infrastructure is a significant barrier to housing completions. A lack of clear, open and trustworthy infrastructure insights at the feasibility stage creates uncertainty and impacts investment decisions. "
        },
        {
            "heading": 2,
            "text": "What next?  "
        },
        {
            "text": "This challenge will be a direct catalyst for innovation, working with the market to create a de-risked space for new approaches to small sites and housing delivery. This allows us to leverage an ever-growing cohort of UK PropTech innovators to inject innovative, imaginative and scalable ideas into the housing sector. By unlocking and de-risking new agile approaches to delivering homes, we aim to cultivate a more diverse, competitive, and ultimately, more resilient housing ecosystem. Our aim is that the digital solutions developed through this Challenge will equip local government and developers with the tools they need to reduce the cost, time, risk and complexity that can often hinder the housing delivery process. "
        },
        {
            "text": "We recognise the significant and often understated value that small sites bring to the housing landscape. Small sites can be quicker to deliver, are uniquely positioned to address hyper-local housing needs, allow for imaginative and contextually appropriate design responses on sites that might otherwise be overlooked, and are instrumental in increasing the number of active SME developers in the market. "
        },
        {
            "text": "We urge all forward-thinking tech innovators and their potential industry partners to seize this exciting opportunity and submit their applications by 15 June.  "
        },
        {
            "text": "As a Digital Planning Programme, we are excited to test and validate how innovation in these spaces can unlock the potential of small sites, empower SME developers, and ultimately accelerate progress towards our goal of 1.5 million homes. "
        }
    ]
}