{
    "url": "https://mhclgmedia.blog.gov.uk/2025/05/28/sme-builders-backed-to-get-britain-building/",
    "title": "SME builders backed to get Britain building",
    "authors": [
        "mhclgpress"
    ],
    "categories": [
        "Housing",
        "Planning"
    ],
    "pub_date": "2025-05-28T14:19:07+01:00",
    "content": [
        {
            "text": "Today we announced new measures to streamline complex planning rules, ease onerous regulatory burdens, and provide financial firepower to smaller housebuilders. These new reforms across land, regulation and finance will support them to play a vital role in delivering 1.5 million homes and creating new jobs across the country."
        },
        {
            "text": "The proposals received widespread national coverage, including from BBC News, the Financial Times, and The Telegraph, all of which highlighted how the new rules will make it easier for small developers to navigate the planning system. They all report the simplified processes for Biodiversity Net Gain rules and the Building Safety Levy will make it easier for small and medium-sized builders to get spades in the ground faster, as well as investing £100m in government-backed loans to help them grow and invest."
        },
        {
            "text": "InThe Daily Mirror, it also reports on how the reforms will allow councils to focus their resources on major developments and the most significant planning proposals – rather than getting bogged down in small-scale projects or niche technical details."
        },
        {
            "text": "Deputy Prime Minister and Housing Secretary Angela Rayner said:  "
        },
        {
            "text": "“Smaller housebuilders must be the bedrock of our Plan for Change to build 1.5 million homes and fix the housing crisis we’ve inherited – and get working people on the housing ladder.  "
        },
        {
            "text": "“For decades the status quo has failed them and it’s time to level the playing field."
        },
        {
            "text": "“Today we’re taking urgent action to make the system simpler, fairer and more cost effective, so smaller housebuilders can play a crucial role in our journey to get Britain building.” "
        },
        {
            "text": "The Housing Minister also appeared on the morning round including Times Radio, Sky News, LBC, BBC Radio 4’s Today Programme, and ITV’s Good Morning Britain. Speaking to Sky News he said:"
        },
        {
            "text": "“The package we’re announcing today is allocating land specifically to SME housebuilders, providing them with more financial support and easing the burden of regulation in a number of areas, so that we can level the playing field between smaller housebuilders and their larger counterparts. They build sites faster and help local areas with new homes in their local economies.”"
        }
    ]
}