{
    "url": "https://nationalscreening.blog.gov.uk/2025/05/28/uk-nsc-is-reviewing-the-latest-evidence-for-additional-screening-based-on-breast-density/",
    "title": "UK NSC is reviewing the latest evidence for additional screening based on breast density  ",
    "authors": [
        "Cristina Visintin"
    ],
    "categories": [
        "Breast Screening"
    ],
    "pub_date": "2025-05-28T10:23:03+01:00",
    "content": [
        {
            "text": "This summer, the UK National Screening Committee (UK NSC) plans to share its evidence review work on whether women with dense breasts should be offered additional breast screening imaging tests."
        },
        {
            "text": "The UK NSC will be sharing its latest review of the evidence along with its plans for next steps. This work will in due course help the committee consider if changes to the screening pathway might be beneficial and will inform a future formal consultation on a recommendation."
        },
        {
            "heading": 2,
            "text": "Background"
        },
        {
            "text": "In the UK, the breast screening programme invites women every 3 years from the age of 50 to their 71st birthday. The digital mammography screening test takes pictures of each breast from 2 angles. Screening helps catch breast cancer, reducing the chance of death from the condition by 20%. However, screening can miss some cancers, particularly in women who have dense breast tissue. About 10% of women have very dense breasts and up to 50% have some mixed dense and fatty tissue. Very dense breast tissue shows up on mammograms as white or opaque, making tumours harder to detect."
        },
        {
            "text": "In 2019, the UK NSC looked at the evidence for whether offering extra ultrasound screenings after a standard mammogram test could help women with dense breasts. The goal was to evaluate the benefits and harms of measuring breast density during mammograms and of providing additional ultrasound screening tests for those with dense breasts."
        },
        {
            "text": "This review found a strong link between higher breast density and an increased risk of breast cancer, as well as a reduction in the effectiveness of mammograms when breast density is high."
        },
        {
            "text": "It also investigated how accurately ultrasounds after mammography could detect cancer in women with dense breasts compared to mammography alone. The review concluded that the use of ultrasound could not yet be recommended. This was for 2 reasons. Firstly, there was no standard test for dense breasts, so the same woman might get different results from different tests. Secondly, ultrasound can lead to many false positive test results that incorrectly indicate the presence of cancer. It can find some cancers that mammograms miss, but there was no clear evidence that it lowered the chances of dying from breast cancer."
        },
        {
            "text": "The review concluded there was not enough evidence to support a change to the screening programme. Based on these findings, the Committee decided not to recommend extra ultrasound screenings after negative mammograms for women with dense breasts."
        },
        {
            "heading": 2,
            "text": "Evolving evidence base"
        },
        {
            "text": "Breast imaging has evolved quickly since 2019. In 2022, the European Society of Breast Imaging (EUSOBI) suggested that people should be made aware of their breast density and that those with very dense breasts should be offered additional MRI screening tests."
        },
        {
            "text": "In the USA, starting in September 2024, the Food and Drug Administration (FDA) has mandated that mammogram reports should include information about breast density and advice that further screening might help detect cancer in those with dense breasts."
        },
        {
            "text": "In the UK, a recent study, BRAID, investigated whether short MRI scans, contrast-enhanced mammography (CEM), or automated breast ultrasound (ABUS) could improve cancer detection in women with dense breasts."
        },
        {
            "text": "The UK NSC’s latest review is using evidence from these recent studies, including data from the UK, to assess whether more imaging options could be added to the breast screening pathway for those with dense breasts. We will this summer publish the report on the UK NSC’s breast screening recommendation page and will be interested in any views on the work. Watch this space."
        },
        {
            "text": "Any individuals or organisations that would like to be kept informed of the UK NSC’s consultations and recommendations on breast screening should email uknsc@dhsc.gov.uk  to be added to our list of stakeholders."
        },
        {
            "heading": 2,
            "text": "Sign up for online seminar on breast screening"
        },
        {
            "text": "Breast screening and breast density is also the topic for the upcoming UK NSC web-based seminar."
        },
        {
            "text": "This event is free for anyone to attend and will be held online via MS Teams on Monday, 9 June, 2.00pm to 3.30pm (BST). "
        },
        {
            "heading": 2,
            "text": "Keep up to date "
        },
        {
            "text": "The UK NSC blog provides up to date news from the UK NSC. You can register to receive updates direct to your inbox, so there is no need to keep checking for new articles. If you have any questions about this blog article, or about the work of the UK NSC, please email uknsc@dhsc.gov.uk. "
        }
    ]
}