{
    "url": "https://grantscommunity.blog.gov.uk/2024/03/11/celebrating-the-power-of-grant-making/",
    "title": "Celebrating the power of grant making",
    "authors": [
        "pennyhornerlong1"
    ],
    "categories": [
        "Civil Service",
        "Efficiencies",
        "Government Grants Management Function",
        "Learning and development"
    ],
    "pub_date": "2024-03-11T09:30:05+00:00",
    "content": [
        {
            "text": "The first ever Government Grants conference and awards was a significant milestone for the Function and a huge success!"
        },
        {
            "text": "We invited grants and commercial practitioners working across government and local authorities to collectively celebrate the positive impact of grant funding on communities and citizens and the role of innovation to improve grants administration. "
        },
        {
            "text": "The last few years have proven how vital grants are delivering government priorities - from emergency funding during the pandemic, to stimulating economic growth and rebuilding thriving communities, transforming support for farmers, housing refugees from Ukraine and Afghanistan and investing in innovative new energy sources such as floating offshore wind turbines."
        },
        {
            "text": "And, the last few years have also proven how amazing the grant-making community is! They have delivered funding efficiently, effectively and safely to those in most need, with expertise, dedication and professionalism. "
        },
        {
            "text": " "
        },
        {
            "heading": 2,
            "text": "Be inspired"
        },
        {
            "text": "It was inspiring to have over 450 government grant makers in one room sharing best practice, hearing from experts on hot topics such as Artificial Intelligence and making new connections. "
        },
        {
            "text": "It shows how far grant making has come as a recognised career path, blending financial, commercial and policy-making skills. We will continue to build this community and invest in training to attract and retain talented people who want to develop their careers."
        },
        {
            "text": "Speaking to the grants community at the conference, Parliamentary Secretary for the Cabinet Office, Alex Burghart said:"
        },
        {
            "text": " "
        },
        {
            "heading": 2,
            "text": "Celebrating outstanding achievements!"
        },
        {
            "text": "The awards honoured the dedication and hard work of individuals and teams that have made significant contributions to communities through impactful and innovative projects."
        },
        {
            "text": "We were delighted with the standard of nominations. It was a difficult decision for the judges to select the best in class, but nevertheless, the 2024 government grants award winners are:"
        },
        {
            "text": "Citizen impact - DLUHC - Local Authority Housing Fund Team in recognition of their exceptional contribution to alleviating UK homelessness pressures including for people arriving in the UK after fleeing conflicts in Ukraine and Afghan."
        },
        {
            "text": "The team said:"
        },
        {
            "text": "Innovation and effective risk management - DfT – The UK Shipping Office for Reducing Emissions (UK SHORE) team in recognition of their risk-based strategies to rapidly design and deliver research and development ­funding competitions that were firsts of their kind for the department and the maritime sector. "
        },
        {
            "text": "The team said:"
        },
        {
            "text": "Best Team - Home Office - Commercial Grants Function in recognition of their collective contribution to deliver a successful large-scale transformation programme with outstanding collaboration and engagement."
        },
        {
            "text": "The team said:"
        },
        {
            "text": "Rising Star - DCMS - Rachel Wilkey-Pinfield in recognition of exceptional talent, dedication and ability to build a strong team culture."
        },
        {
            "text": "Rachel said:"
        },
        {
            "text": "Inspirational Leader - DWP - Clare Bonson in recognition of her exemplary leadership and visionary contribution to inspire others through the grants life cycle."
        },
        {
            "text": "Clare said:"
        },
        {
            "text": "Conference videos, slides and photos available on the Grants Centre of Excellence (only accessible to those with gov.uk email address)."
        },
        {
            "text": " "
        },
        {
            "heading": 2,
            "text": "Grants will continue to deliver for communities and the economy"
        },
        {
            "text": "If you haven’t done so I’d recommend dipping into the 2023-2025 Government Strategy for Grants Management setting out how more grant making efficiencies will be found to ensure value to the taxpayer. "
        },
        {
            "text": " "
        },
        {
            "text": "Penny Horner-Long\nDirector and Head of Government Grants Management Function"
        }
    ]
}