{
    "url": "https://deframedia.blog.gov.uk/2024/03/11/coverage-of-180m-of-investment-fast-tracked-to-prevent-sewage-spills/",
    "title": "Coverage of £180m of investment fast-tracked to prevent sewage spills",
    "authors": [
        "defrablogs"
    ],
    "categories": [
        "water"
    ],
    "pub_date": "2024-03-11T12:29:47+00:00",
    "content": [
        {
            "text": "There has been widespread coverage, including in the Independent, ITV News, the Evening Standard and others, of today’s announcement on accelerated investment to prevent sewage spills. Following the Secretary of State directing water and sewage companies last December to measurably reduce sewage spills over the next year, water companies have fast-tracked £180 million in investment."
        },
        {
            "text": "Examples of measures include investment in AI systems to help manage storm loads, the installation of thousands of new in-sewer monitors to check flows and spot blockages early, the recruitment and training of specialist staff, and accelerated wetland construction programmes."
        },
        {
            "text": "These new funding commitments – which are expected prevent more than 8000 sewage spills – are in addition to water companies’ existing £3.1 billion investment into storm overflow improvements for this price review period (2020-2025), as well as their ongoing annual investment to maintain the performance of the existing network."
        },
        {
            "text": "The accelerated improvements, which will be delivered by April 2025, support the targets under the government’s Storm Overflows Discharge Reduction Plan. This is driving the largest infrastructure investment in water company history, estimated at £60 billion over the next 25 years."
        },
        {
            "text": "Environment Secretary Steve Barclay said:"
        },
        {
            "text": "“The amount of sewage being spilled into our rivers is completely unacceptable and the public rightly expects action. This £180 million of accelerated investment, which will stop more than 8,000 sewage spills over the next year, is a welcome step forward as we continue to push for better performance from water companies and hold them to account."
        },
        {
            "text": "“This money will mean more cutting-edge technology, including artificial intelligence, and more specialist staff to detect and reduce spills."
        },
        {
            "text": "“Today’s announcement builds on significant work by this government to protect and strengthen our waters with increased investment, stronger regulation and tougher enforcement action.”"
        },
        {
            "text": "Follow Defra on Twitter and sign up for email alerts here."
        }
    ]
}