{
    "url": "https://movingon.blog.gov.uk/2024/03/11/dvsa-vision-2030-and-what-it-means-for-enforcement/",
    "title": "DVSA Vision 2030 and what it means for enforcement",
    "authors": [
        "Caroline Hicks"
    ],
    "categories": [
        "Enforcement",
        "Features"
    ],
    "pub_date": "2024-03-11T14:58:08+00:00",
    "content": [
        {
            "text": "Our vision to 2030 sets out how we will be keeping Britain moving safely and sustainably. I want to take an opportunity to explain a little bit about what this means for enforcement work in the future, through 3 key areas.  "
        },
        {
            "heading": 2,
            "text": "Set standards, assess and test "
        },
        {
            "text": "Standards work when they are current, relevant and clear. This allows them to be understood and trusted which, in turn, makes them effective.  "
        },
        {
            "text": "Our enforcement teams across Great Britain work tirelessly to monitor commercial vehicle operators and drivers through roadside checks and operator investigations. So, what will change and why? "
        },
        {
            "text": "As vehicle technology changes, the required standards and how we assess and test those standards, need to change to reflect this. We also need to be able to influence standards for vehicle and equipment approval in the future.  "
        },
        {
            "text": "Many of us can recall being told that when digital tachographs were introduced it would be the end of falsifying records – but operators and drivers soon found a way round this.  "
        },
        {
            "text": "So how do we stop that happening again? How can we be more involved in the early stages of standard setting? "
        },
        {
            "text": "DVSA’s Connected and Automated Vehicle Project is leading the work in this area. The project group are engaging with teams across Department for Transport (DfT) and industry. We are already talking to them about the implications for enforcement work and are looking into Post Collision Examination work. "
        },
        {
            "text": "We are working on our systems to make it easier for members of the public to report issues they come across, so we can investigate when standards are not being followed.  "
        },
        {
            "heading": 2,
            "text": "Inform, educate, and advise our customers "
        },
        {
            "text": "One of our key aims is to get things right first time. Doing this will result in better services, safer practice, and less burdensome regulation and enforcement for everyone. "
        },
        {
            "text": "We are working with the industry to provide tailored and accessible guidance, supporting the industry to improve their compliance levels. "
        },
        {
            "text": "In September we published some new content to support drivers carrying out HGV daily walkaround checks. The guidance has been translated into the 22 most common languages of drivers we encounter at the roadside.  Helping non-English speaking drivers understand what they need to check inside and outside of the vehicle when they do a lorry or other HGV walkaround check to drive safely in the UK. "
        },
        {
            "heading": 2,
            "text": "License and accredit, regulate, and enforce  "
        },
        {
            "text": "Finally, I wanted to share a bit more detail on the areas most of you will most closely associate with enforcement activity. "
        },
        {
            "text": "We know the industry wants us to recognise the work it does to comply, freeing up its resources to support business growth. We will use our resources to target our activity where its most needed to identify and stop those competing in the industry unfairly and dangerously.  "
        },
        {
            "text": "The general public has an expectation that regulations can and will protect them, while businesses expect any enforcement of regulations to not prevent them from operating an efficient, flexible and competitive business. We are determined to deliver proper analysis of risk, so we direct appropriate enforcement resource at the areas it is most needed.  "
        },
        {
            "text": "Identifying the ‘best in class’ businesses, through our Earned Recognition and Road to Earned Recognition schemes, will enable us to reduce the administrative burden of regulation on the exemplars in our industry, while maintaining and improving regulatory outcomes.  "
        },
        {
            "text": "We will continue to build on the success of the Earned Recognition scheme and look to identify opportunities to make it a contracting standard. The team are already engaging with local authorities and have some local councils and major civil engineering projects signed up, as well as it being recognised as an alternative to FORS.  "
        },
        {
            "text": "We want to deliver the Road to Earned Recognition, currently in a trial phase, for all new operators, setting them off on their operator journey with clear expectations and monitoring, to get it right first time. "
        },
        {
            "text": "We will detect more non-compliance remotely through better data and our investment in mobile checking kit. This will enable us to work away from fixed road check sites and use our examiners in a more flexible way while still delivering a robust level of inspection. "
        },
        {
            "text": "We are already using the National ANPR Service (NAS) to identify vehicles that have made ‘impossible journeys’ – reaching locations too far away, too fast or both! We are directing roadside resource to intercept specific vehicles – not waiting and hoping they come by our check sites. "
        },
        {
            "text": "Using NAS we have also trialled the ‘out of test HGV’ work, looking to identify how we can detect offences on a large-scale remote basis allowing us to give advice on what needs to be done to correct any issues found.  "
        },
        {
            "text": "However, to regulate ever more efficiently and effectively, we need to get to the root cause of non-compliance. We are restructuring our Intelligence Unit to better reflect our delivery and strategic aims, using our intelligence resources and NAS to help us identify harmful operators at the earliest opportunity, before they have opportunity to put dangerous vehicles or drivers on our roads. "
        },
        {
            "heading": 2,
            "text": "Join the conversation "
        },
        {
            "text": "As technology improves and we learn more about the changes we make, we will continue to make our roads as safe as we can. We want to carry on working with all our customers, to deliver the most effective and efficient service we can, to improve road safety, while making sure the burden of enforcement falls most heavily on the most seriously and serially non complaint. Our message is that non-compliance is not the cost-effective option. "
        },
        {
            "text": "Join the conversation on how we can improve our enforcement work by posting your comments and ideas – and let’s work together to make the roads safer for everyone! "
        }
    ]
}