{
    "url": "https://companieshouse.blog.gov.uk/2024/03/11/from-retail-to-rising-star-how-i-built-a-fulfilling-career-in-the-civil-service/",
    "title": "From retail to Rising Star: how I built a fulfilling career in the Civil Service",
    "authors": [
        "Patrick Gilligan - Head of Operations, Northern Ireland"
    ],
    "categories": [
        "Working at Companies House"
    ],
    "pub_date": "2024-03-11T12:24:04+00:00",
    "content": [
        {
            "text": "After leaving school in 2011, I decided to take a gap year before university. I am currently on my 13th gap year."
        },
        {
            "text": "My Civil Service career began in September 2018 when I joined HMRC as a Compliance Officer. I came from a background in retail and hospitality. At that point, I couldn’t imagine that the Civil Service would provide me with such incredible opportunities and career progression."
        },
        {
            "text": "Once I got comfortable in my first office-based role, I looked for learning opportunities to progress my career. I wanted to build my skills and experience outside of my compliance role. After only a few months, I began to gain the skills that I needed. I earned an Operational Delivery Professional qualification, was more confident in my abilities, and I was ready for the next step in my career. This is where Companies House came in."
        },
        {
            "text": "I joined Companies House as Operations Manager in January 2020. With my combination of management skills and compliance casework experience, I felt I was the ideal fit for this varied and fast-paced role. In March 2020 I was asked to work from home due to the COVID-19 pandemic. I still had a lot of training to complete, but the support from my manager and colleagues helped me progress in my role. The people here at Companies House are its biggest asset."
        },
        {
            "text": "As with any challenge, opportunity arises. I was working on various projects, including updating and improving our services for customers in the wake of the pandemic. Two years later I gained promotion to Intelligence, Integrity, Compliance and Enforcement Senior Manager. This was a very challenging but incredibly rewarding role where I gained experience in new areas of work."
        },
        {
            "text": "So, where am I now? In May 2023, another opportunity arose to become the temporary Head of Operations at Companies House, Northern Ireland. I love the varied nature of the work and the responsibility of leading the Northern Ireland team through significant changes to UK company law. Managing such a strong, friendly, multi-skilled team is a privilege and one that I’ll appreciate throughout my career."
        },
        {
            "heading": 2,
            "text": "The Civil Service Awards 2023"
        },
        {
            "text": "My career so far has been a reward in itself. However, I was very fortunate and humbled to be nominated for a Civil Service Award in the Rising Star Category last year. Being nominated was a great acknowledgement of my work during the year. This year the Civil Service Awards received an unprecedented 1,962 nominations across 12 categories. This is the highest number of nominations received in the Awards’ 18-year history. You can imagine my surprise when I was shortlisted in the top 3 and invited to the awards ceremony at Lancaster House in London!"
        },
        {
            "text": "My category was one of the last to be announced. This gave me just enough time to practise my “I’m disappointed not to have won, but the award could not have gone to a nicer person” face. I modelled mine off Joey from Friends (season 7, episode 18 for reference)."
        },
        {
            "text": "Surprisingly, I didn’t get to use that face because I was announced as the winner. I really had not thought about winning as it seemed too far-fetched. I was delighted to get to the final 3 and winning the award was unexpected. As I stood on stage, blinded by the light, I remembered the most important piece of information given to us – “don't fall off the back of the stage”. Fortunately for me I have a dog-like obedience and listen to instructions intently, so I avoided being the night’s embarrassment."
        },
        {
            "text": "It was a great night for me, both personally and professionally. It was also a great night for Companies House. In recent years, Companies House has produced a culture of challenging set ways of working and promoting innovative thinking. This is all while maintaining our brilliant culture as we transform from a passive recipient of information to an active gatekeeper of the data on our register."
        },
        {
            "text": "My time at Companies House has been a journey of constant growth and learning. There have been lots of opportunities to build my career and skills. I'm grateful for the experience, and the continuous support that’s allowed me to build a meaningful career here."
        }
    ]
}