{
    "url": "https://kingsawards.blog.gov.uk/2024/03/11/hrh-the-princess-royal-presents-kings-awards-trophy-to-winner-focus-sb/",
    "title": "HRH The Princess Royal presents King’s Awards trophy to winner Focus SB®",
    "authors": [
        "The Queen's Awards for Enterprise"
    ],
    "categories": [
        "Advice",
        "King's Awards",
        "Lord-Lieutenants"
    ],
    "pub_date": "2024-03-11T18:18:56+00:00",
    "content": [
        {
            "text": "Her Royal Highness The Princess Royal presented Mr Gary Stevens, Focus SB managing director, The King’s Award for Enterprise winner trophy in recognition of the company’s achievement in the international trade category on Wednesday 22nd November 2023."
        },
        {
            "text": "Employing 65 people, Focus SB Ltd was set up in 2000 and is a manufacturer of wiring devices. In 2017 the company made history in its industry when it became the first and only European manufacturer to gain CQC factory accreditation to supply and sell wiring accessories directly from Europe to mainland China, also gaining full CCC license for all of its products for the Chinese marketplace."
        },
        {
            "text": "After greeting invited local dignitaries and guests on arrival, The Princess Royal toured the Focus SB main factory during which she was given electrical accessories product manufacturing process demonstrations including both traditional and robot technology, hand finishing including spray painting and component hand assembly."
        },
        {
            "text": "Her Royal Highness greeted employees from each department, including apprentices and trainees from local charity Little Gate Supported Employment after which she formally presented The King’s Awards for Enterprise trophy to Mr Gary Stevens introduced by Mr Andrew Blackman, Lord-Lieutenant of East Sussex."
        },
        {
            "text": "The Princess Royal gave a short speech of congratulations and presented The King’s Awards for Enterprise engraved crystal winner trophy to Mr Gary Stevens, MD, who accepted the award on behalf of Focus SB with a short speech of thanks. Mrs Terri Hoey, sales office manager then presented Her Royal Highness with gifts comprising a Sussex Trug containing a floral arrangement of locally grown flowers from Sussex Cutting Garden presented with honey from a beehive sponsored by Focus SB at SW Honey Farms and a wreath of flowers grown and handmade by the trainees at Little Gate Farm. Sussex Cutting Garden also provided an attractive floral arrangement to decorate the company’s reception area for the occasion."
        },
        {
            "text": "The Princess Royal then unveiled a commemorative plaque manufactured in-house by the company to mark her visit."
        },
        {
            "text": "Mr Stevens commented: “It was an absolute honour to host HRH The Princess Royal at our factory in Hastings and to receive our King’s Award from her. I think she spoke to virtually every member of staff and was very knowledgeable. What a year for Focus SB and me personally, getting to meet The King, a Princess and a Duchess! This visit rounds off one of the most exciting years in the company’s history.”"
        },
        {
            "text": "“It’s a huge honour for an SME based in Hastings to have the recognition of The King’s Awards, one of the most prestigious awards a company can be bestowed, but in addition to that, meeting The King at Buckingham Palace and then to have a visit from The Princess Royal is a huge boost and reward for every single employee at Focus SB, without whom, none of this would have been possible. I have been in manufacturing of electrical products all of my career and I started off as a 16-year-old technical apprentice and have worked my way through various businesses from technical to marketing, sales and general management and I have been an MD of two manufacturing companies, including currently with Focus SB.\""
        },
        {
            "text": "A Department for Business and Trade (DBT) Southern Export Champion, Mr Stevens concluded: \"I am passionate about manufacturing and introducing more young people into manufacturing and encouraging them to take up apprenticeships, I would like to think that we are doing our bit here at Focus SB by working with local educational establishments, employment agencies and local charities to fulfil that goal, and that my own journey can act as a beacon for those young people who may be thinking about a career in manufacturing and what can be achieved. After all, manufacturing accounts for 2.6 million jobs in the UK and we are the 8th largest manufacturing country in the world!”"
        },
        {
            "text": "You can view HRH The Princess Royal visit their factory here: https://vimeo.com/892294157"
        },
        {
            "text": "View their full press release on their website here: https://www.focus-sb.co.uk/company/awards/kings-awards-for-enterprise-2023"
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        }
    ]
}