{
    "url": "https://defrafarming.blog.gov.uk/2024/03/11/the-evidence-we-use-to-develop-our-environmental-land-management-schemes/",
    "title": "The evidence we use to develop our environmental land management schemes ",
    "authors": [
        "Dr Anchen Kehler"
    ],
    "categories": [
        "environmental land management schemes"
    ],
    "pub_date": "2024-03-11T13:11:32+00:00",
    "content": [
        {
            "text": "We’re committed to ensuring that the policies underpinning our environmental land management schemes are based on the very latest and best possible evidence. "
        },
        {
            "text": "By using quality evidence, we can deliver value for money, meet our environmental targets & climate commitments, maintain food production and support resilient rural communities.   "
        },
        {
            "text": "Bringing together the latest scientific literature and practitioner data is vital.  "
        },
        {
            "text": "One evidence source is the recently published qualitative environmental impact assessment (QEIA). In this post I’ll give an overview.  "
        },
        {
            "text": "The purpose of the QEIA was to understand the impact of environmental land management actions on agricultural land in England.  "
        },
        {
            "text": "This project assessed the impacts of 741 potential land management actions on land-based environmental targets and climate commitments. "
        },
        {
            "text": "We used 53 relevant environmental and cultural service indicators, such as reduced emissions of ammonia. "
        },
        {
            "text": "The project, led by the UK Centre for Ecology & Hydrology (UKCEH) drew on the expertise of a consortium of around 45 people. "
        },
        {
            "text": "Together, they produced 10 evidence reviews containing over 1,000 pages of evidence and over 2,400 studies were referenced. "
        },
        {
            "text": "These reviews covered important environmental themes such as soil health and air quality and looked at a range of topics, including whether an action should be spatially targeted to deliver benefits to the objectives. "
        },
        {
            "text": "The evidence reviews then informed an integrated assessment. This comprised expert-derived qualitative impact scores for each land management action. "
        },
        {
            "text": "This assessment was important to:  "
        },
        {
            "text": "The QEIA sits within a wider evidence base from which we’ve drawn scheme content. "
        },
        {
            "text": "This includes (but is not limited to): agri-environment schemes, monitoring and evaluation projects; Countryside Stewardship (CS) and Environmental Stewardship (ES) impact assessments and feasibility studies. "
        },
        {
            "text": "Together, this evidence helps to build a picture of which actions should be considered for our environmental land management schemes.  "
        },
        {
            "text": "The QEIA also sits within the context of some of the longer-term work underway to inform our schemes. "
        },
        {
            "text": "The Environmental Valuation Assessment Scenario Tool (EVAST) is one such project. EVAST is a Defra-funded integrated modelling tool that is under development (with the first stage still due for completion) by a UKCEH-led consortium including Forest Research, eftec, ADAS, Cranfield University and the British Trust for Ornithology. "
        },
        {
            "text": "It is an ambitious undertaking that uses a specialised chain of coupled models driven by field-level data and covering a national scale.  "
        },
        {
            "text": "EVAST estimates the biodiversity, carbon, water quality and air quality benefits, and their associated monetary values that could be achieved through environmental land management schemes.  "
        },
        {
            "text": "Designed to support our decision making, the EVAST approach is deliberately cross-sectoral and scenario-driven. It highlights interactions, trade-offs and unintended consequences of land management decisions.  "
        },
        {
            "text": "Each EVAST scenario is co-developed with Defra and helps to build a picture of the different ways environmental land management can contribute to England’s land-based environmental targets and climate commitments. "
        },
        {
            "text": "While we have an active programme of research to make predictions to inform scheme content, we are also building a programme by which to monitor and evaluate them. "
        },
        {
            "text": "In early-stage development, and as part of a multi-year programme, the Environmental Research Collaboration for England (ERCE) is an important project in this space.  "
        },
        {
            "text": "It will develop innovative, proof-of-concept solutions to challenges in monitoring our environment, with a focus on accelerating integration of new technologies into Defra business processes.  "
        },
        {
            "text": "ERCE will also help us explore and assess which tools are best placed to support our land managers in delivering environmental outcomes. The monitoring and evaluation programme will provide real-world data to complement and validate our early assessments. "
        },
        {
            "text": "If you have any questions about this work, please leave a comment below."
        }
    ]
}