{
    "url": "https://food.blog.gov.uk/2024/03/11/the-fsa-takes-time-for-british-science-week/",
    "title": "The FSA takes time for British Science Week",
    "authors": [
        "Professor Robin May, Chief Scientific Adviser"
    ],
    "categories": [
        "Science"
    ],
    "pub_date": "2024-03-11T09:09:59+00:00",
    "content": [
        {
            "text": "Cymraeg"
        },
        {
            "text": "British Science Week runs this year from 8th to 17th March. This is a celebration of science, technology, engineering and maths run by the British Science Association. Each year has a different theme, with this year's theme being ‘time’."
        },
        {
            "text": "There is no question that what and how we eat has evolved dramatically over time - I’m sure I’m not alone in eating a diet that is radically different to the one my parents or grandparents ate. This is partly about cultural and societal changes, but also owes a lot to science and the technological changes that have transformed the food system over recent decades."
        },
        {
            "text": "The classic example of a ‘technological food process’ that all we learned about in school is pasteurisation. This food processing technique (in which liquids are rapidly heated and then cooled to eliminate pathogens) is fundamental to the safety of dairy products, but it was not initially a process used for milk. Instead, the process was developed by French microbiologist Louis Pasteur, back in the1860’s when he found that unwanted bacteria were spoiling wine."
        },
        {
            "text": "Nowadays the process of pasteurisation is used worldwide across many food products. It ensures that the end product is safe to eat and drink, extends its shelf life, and reduces food waste. In addition, we are increasingly seeing filtration of milk to extend the shelf lives of these products even further, which has led to the removal of use-by dates from some milk products altogether. Who knows what the future holds for this industry? Perhaps, as we are seeing in the meat industry, there will be the development of smart labels used to detect milk freshness or spoilage."
        },
        {
            "heading": 2,
            "text": "The FSA over time"
        },
        {
            "text": "Our strategy is to ensure food is safe and is what it says it is, and this role is underpinned by science and evidence. One of the fundamental principles of science is that it is responsive to new data. Keeping up to date with the latest science and technology helps ensure our responses are always underpinned by the best available evidence."
        },
        {
            "text": "The FSA has existed for nearly a quarter of a century, and, in that time, we have evolved to respond to changes in the food system. We have taken on many new responsibilities including enforcing wine regulations, merging with the Meat Hygiene Service and taking on responsibility for official controls. More recently the introduction of the Precision Breeding Bill has brought with it new responsibilities, whilst emerging innovations such as cell-cultivated products or methane-reducing feed supplements produce fascinating, but complex, scientific challenges."
        },
        {
            "text": "We use our Areas of Research Interest (ARIs) as a snapshot in time of our key research themes, and the questions we want to address. These are reviewed regularly to ensure they are reflective of wider organisational strategic priorities.  In addition, we undertake horizon scanning (the identification of emerging trends and risks) to look into the future and identify potential risks, but also potential opportunities. This allows us to be proactive in our approach, rather than reactive."
        },
        {
            "text": "We also ensure we are at the cutting edge of science and lead on research to ensure the future of food safety. A great example of this is our Pathogen Surveillance in Agriculture, Food and Environment (PATH-SAFE) programme, a cross-government programme which uses the latest DNA-sequencing technology and environmental sampling to improve the detection and tracking of foodborne disease (FBD) and antimicrobial resistance (AMR)."
        },
        {
            "heading": 2,
            "text": "Time Travel..."
        },
        {
            "text": "The pace of change in the food system sometimes feels overwhelming - not only as regulators but as consumers. Indeed, someone recently remarked to me that shopping was much easier in the days when your shopping list only needed to say things like “flour”, rather than “gluten-free, wholegrain, superfine artisanal flour (but not the one with added linseed, or the one in the brown packaging which has a higher carbon footprint).” But perhaps it’s worth spending a moment during this ‘time-themed’ British Science Week to look back, as well as forwards, and reflect that change isn’t always as rapid as it seems. Here is Winston Churchill, writing in 1931 and predicting that in fifty years' time (1981):"
        },
        {
            "text": "“We shall escape the absurdity of growing a whole chicken in order to eat the breast or wing, by growing these parts separately under a suitable medium.”"
        },
        {
            "text": "Does that kind of novel food sound familiar to anyone...?"
        },
        {
            "heading": 2,
            "text": "British Science Week and the FSA"
        },
        {
            "text": "Finally, we will be celebrating British Science Week by looking back at the careers of some of our FSA scientists, as well as looking forward to encouraging the next generation of scientists by posting some food science experiments that you can do at home. Keep an eye on our Facebook page for those."
        },
        {
            "text": "If any of this has piqued your interest, I would encourage you to sign up to the FSA Science Newsletter for regular updates about FSA science and opportunities. You could also join our Food for Thought seminar series, monthly webinars on topics which align with FSA research priorities – sign up to the mailing list to receive seminar invites or visit our YouTube channel to catch up on any you may have missed."
        },
        {
            "heading": 1,
            "text": "Yr Asiantaeth Safonau Bwyd yn rhoi o’i hamser ar gyfer Wythnos Wyddoniaeth Prydain"
        },
        {
            "text": "Eleni, cynhelir Wythnos Wyddoniaeth Prydain o 8 Mawrth i 17 Mawrth. Mae’r wythnos, a gynhelir gan Gymdeithas Wyddoniaeth Prydain, yn dathlu gwyddoniaeth, technoleg, peirianneg a mathemateg. Mae thema wahanol bob blwyddyn, a’r thema eleni yw ‘amser’. "
        },
        {
            "text": "Does dim amheuaeth bod pethau wedi newid yn syfrdanol dros amser o ran beth rydyn ni’n ei fwyta, a sut rydyn ni’n ei fwyta – rwy’n siŵr nad fi yw’r unig un sy’n bwyta deiet andros o wahanol i’w rieni ef a’u rhieni nhw. Mae newidiadau diwylliannol a chymdeithasol yn rhannol gyfrifol am hyn, ond mae gwyddoniaeth, yn ogystal â’r newidiadau technolegol sydd wedi trawsnewid y system fwyd dros y degawdau diwethaf, hefyd wedi chwarae rhan fawr yn y newid hwn."
        },
        {
            "text": "Yr enghraifft glasurol o ‘broses fwyd dechnolegol’ y gwnaeth pob un ohonom ddysgu amdani yn yr ysgol yw pasteureiddio. Mae’r dechneg prosesu bwyd hon (lle mae hylifau’n cael eu gwresogi’n gyflym ac yna’n cael eu hoeri i gael gwared ar bathogenau) yn hanfodol i ddiogelwch cynhyrchion llaeth, ond doedd y broses hon ddim yn cael ei defnyddio i ddechrau ar gyfer llaeth. Yn hytrach, datblygwyd y broses gan y microbiolegydd o Ffrainc, Louis Pasteur, yn ôl yn y 1860au pan ganfu fod bacteria dieisiau yn difetha gwin."
        },
        {
            "text": "Heddiw, mae’r broses basteureiddio’n cael ei defnyddio ledled y byd ar gyfer llawer o gynhyrchion bwyd. Mae’n sicrhau bod y cynnyrch terfynol yn ddiogel i’w fwyta a’i yfed, yn ymestyn ei oes silff, ac yn lleihau gwastraff bwyd. Yn ogystal, mae hidlo llaeth yn digwydd fwyfwy er mwyn ymestyn oes silff y cynhyrchion hyn hyd yn oed ymhellach, sydd wedi arwain at dynnu dyddiadau ‘defnyddio erbyn’ oddi ar rai cynhyrchion llaeth yn gyfan gwbl. Pwy a ŵyr beth fydd dyfodol y diwydiant hwn? Efallai, fel sy’n digwydd yn y diwydiant cig, y bydd labeli clyfar yn cael eu datblygu i fonitro ffresni llaeth neu i ganfod llaeth sydd wedi difetha."
        },
        {
            "heading": 2,
            "text": "Yr Asiantaeth Safonau Bwyd (ASB) dros amser"
        },
        {
            "text": "Ein strategaeth yw sicrhau bod bwyd yn ddiogel a’i fod yn cyd-fynd â’r hyn sydd ar y label, ac mae gwyddoniaeth a thystiolaeth yn hanfodol i’r rôl hon. Un o egwyddorion sylfaenol gwyddoniaeth yw ei bod yn ymatebol i ddata newydd. Mae dilyn y diweddaraf ym maes gwyddoniaeth a thechnoleg yn helpu i sicrhau bod ein hymatebion bob amser yn seiliedig ar y dystiolaeth orau sydd ar gael."
        },
        {
            "text": "Mae’r ASB wedi bodoli ers bron i chwarter canrif, ac, yn ystod y cyfnod hwnnw, rydym wedi datblygu i ymateb i newidiadau yn y system fwyd. Rydym wedi ymgymryd â llawer o gyfrifoldebau newydd, gan gynnwys gorfodi rheoliadau gwin, uno â’r Gwasanaeth Hylendid Cig, a chymryd cyfrifoldeb am reolaethau swyddogol. Yn fwy diweddar, mae cyflwyno’r Bil Bridio Manwl wedi arwain at gyfrifoldebau newydd, ac mae arloesiadau sy’n dod i’r amlwg, fel cynhyrchion a wneir drwy feithrin celloedd neu atchwanegiadau bwyd anifeiliaid sy’n lleihau methan, yn creu heriau gwyddonol hynod ddiddorol, ond cymhleth."
        },
        {
            "text": "Rydym yn defnyddio ein Meysydd o Ddiddordeb Ymchwil fel ciplun mewn amser o’n themâu ymchwil allweddol, a’r cwestiynau rydym am fynd i’r afael â nhw. Caiff y rhain eu hadolygu’n rheolaidd i sicrhau eu bod yn adlewyrchu blaenoriaethau strategol ehangach y sefydliad. Yn ogystal, rydym yn cynnal gwaith sganio’r gorwel (hynny yw, yn nodi tueddiadau a risgiau sy’n dod i’r amlwg) er mwyn edrych tuag at y dyfodol a nodi risgiau posib, ond hefyd cyfleoedd posib. Mae hyn yn caniatáu i ni fynd at ein gwaith gan arfer dull rhagweithiol yn hytrach nag ymatebol."
        },
        {
            "text": "Rydym hefyd yn sicrhau ein bod ar flaen y gad o ran gwyddoniaeth ac yn arwain ar ymchwil i sicrhau dyfodol diogelwch bwyd. Enghraifft wych o hyn yw ein rhaglen Cadw Gwyliadwriaeth ar Bathogenau mewn Amaethyddiaeth, Bwyd a’r Amgylchedd (PATH-SAFE), sef rhaglen drawslywodraethol sy’n defnyddio’r dechnoleg dilyniannu DNA ddiweddaraf a samplu amgylcheddol i wella’r gwaith o ganfod ac olrhain clefydau a gludir gan fwyd ac ymwrthedd gwrthficrobaidd."
        },
        {
            "heading": 2,
            "text": "Teithio drwy amser..."
        },
        {
            "text": "Mae cyflymder y newid yn y system fwyd weithiau’n teimlo’n llethol – nid yn unig fel rheoleiddwyr ond fel defnyddwyr hefyd. Yn wir, dywedodd rhywun wrthyf i’n ddiweddar fod siopa yn llawer haws yn yr hen ddyddiau pan oedd eich rhestr siopa ond yn dweud “blawd”, yn hytrach na “blawd artisanal, mân iawn, grawn cyflawn, heb glwten, ond nid yr un gyda hadau llin ychwanegol na’r un yn y pecyn brown sydd ag ôl troed carbon uwch”. Ond efallai ei bod hi’n werth treulio eiliad yn ystod yr Wythnos Wyddoniaeth Prydain hon â’r thema amser i edrych yn ôl, yn ogystal ag ymlaen, a chofio nad yw newid bob amser mor gyflym ag y mae’n ymddangos. Dyma Winston Churchill yn ysgrifennu ym 1931 ac yn darogan beth fyddai’n digwydd ymhen hanner can mlynedd (1981):"
        },
        {
            "text": "“Byddwn ni’n dianc rhag y gwiriondeb o fagu cyw iâr cyfan er mwyn bwyta’r frest neu’r adain yn unig trwy dyfu’r darnau hyn ar wahân o dan gyfrwng addas.”"
        },
        {
            "text": "Ydy’r math hwnnw o fwyd newydd yn swnio’n gyfarwydd i unrhyw un..?"
        },
        {
            "heading": 2,
            "text": "Wythnos Wyddoniaeth Prydain a’r ASB"
        },
        {
            "text": "Yn olaf, byddwn yn dathlu Wythnos Wyddoniaeth Prydain drwy edrych yn ôl ar yrfaoedd rhai o’n gwyddonwyr yn yr ASB, yn ogystal ag edrych ymlaen at annog y genhedlaeth nesaf o wyddonwyr drwy bostio rhai arbrofion gwyddor bwyd y gallwch eu gwneud gartref. Cadwch lygad ar ein tudalen Facebook am y rheiny."
        },
        {
            "text": "Os yw unrhyw ran o hyn wedi ennyn eich diddordeb, byddwn i’n eich annog i gofrestru ar gyfer Cylchlythyr Gwyddoniaeth yr ASB i gael diweddariadau rheolaidd am wyddoniaeth a chyfleoedd yn yr ASB. Gallech hefyd ymuno â’n cyfres seminarau Cnoi Cil, sef gweminarau misol ar bynciau sy’n cyd-fynd â blaenoriaethau ymchwil yr ASB – cofrestrwch i gael gwahoddiadau i’r seminarau neu ewch i’n sianel YouTube i wylio unrhyw gweminarau y gallech fod wedi’u methu."
        }
    ]
}