{
    "url": "https://stratcommand.blog.gov.uk/2024/03/11/we-are-strategic-command-with-sarah-wallace/",
    "title": "We Are Strategic Command with Sarah Wallace",
    "authors": [
        "bobsendall"
    ],
    "categories": [
        "Uncategorized"
    ],
    "pub_date": "2024-03-11T09:58:26+00:00",
    "content": [
        {
            "text": "Sarah Wallace, Climate and Sustainability Lead, discusses the role of climate-conscious practices in Defence operations."
        },
        {
            "text": "Interviewer: Can you introduce yourself and your role at Strategic Command?"
        },
        {
            "text": "Sarah Wallace: I'm Sarah Wallace, and I lead the climate change and sustainability team at Strategic Command. My role helps the Command understand the implications of climate change while fostering sustainable practices within our operations."
        },
        {
            "text": " "
        },
        {
            "text": "Interviewer: How does sustainability align with the mission of a defence organisation like Strategic Command?"
        },
        {
            "text": "Sarah Wallace: Defence is fundamentally about safeguarding civilians and populations. If we contribute to environmental degradation by overconsuming, then we’re creating future challenges for ourselves. My role is to ensure that Strategic Command incorporates sustainable practices into its operations and recognises the importance of addressing climate change."
        },
        {
            "text": " "
        },
        {
            "text": "Interviewer: What sustainable practices are being used within Strategic Command?"
        },
        {
            "text": "Sarah Wallace: There are pockets of excellence across our operations, from self-sustaining on-site activities to initiatives like growing food on our estates. We strive for innovation, such as developing sustainability in the Falkland Islands, where impressive ideas are emerging."
        },
        {
            "text": " "
        },
        {
            "text": "Interviewer: How are we sharing these initiatives with other parts of Defence?"
        },
        {
            "text": "Sarah Wallace: Across various Commands, we take a holistic and integrated approach to sustainability. For instance, the Falkland Islands Command is actively involved in sustainable development. Working with different Commands allows us to share innovative ideas and collectively work towards a more sustainable future."
        },
        {
            "text": " "
        },
        {
            "text": "Interviewer: How does sustainability impact international relations and collaboration with allies?"
        },
        {
            "text": "Sarah Wallace: Our ability to collaborate with allies is closely tied to our environmental practices. If we're perceived as highly polluting, it hampers our partnerships. For instance, interoperability issues may arise if our equipment uses incompatible batteries. NATO has established a centre of excellence for Climate Security and we have a UK representative within there. Working together is crucial, and we maintain a collaborative approach across all frontline Commands."
        },
        {
            "text": " "
        },
        {
            "text": "Interviewer: What is the most rewarding aspect of your role?"
        },
        {
            "text": "Sarah Wallace: The most rewarding part of my job is connecting with individuals who have innovative ideas for sustainability. I don't create the ideas; I facilitate and enable them. Whether it's advising on initiatives or offering support, being the bridge between ideas and implementation is, in my opinion, the best part of what I do."
        },
        {
            "text": " "
        },
        {
            "text": "Interviewer: How does your work contribute to the overall mission of Strategic Command?"
        },
        {
            "text": "Sarah Wallace: My work contributes by ensuring that sustainability is integrated into every aspect of our operations. From fostering self-sufficiency on-site to addressing interoperability challenges, our commitment to sustainability enhances our ability to defend and protect."
        }
    ]
}