{
    "url": "https://ukhsa.blog.gov.uk/2024/03/11/what-are-mrna-vaccines-and-how-do-they-work/",
    "title": "What are mRNA vaccines and how do they work?",
    "authors": [
        "Blog Editor"
    ],
    "categories": [
        "immunisations"
    ],
    "pub_date": "2024-03-11T18:13:11+01:00",
    "content": [
        {
            "text": "The COVID-19 pandemic highlighted the urgent need for swift and safe vaccine development during public health emergencies. As detailed in the 100 Days Mission report, proactive vaccine research and development during non-crisis periods is important to help ensure we can quickly mobilise vaccines when new pathogens emerge."
        },
        {
            "text": "Our Vaccine Development and Evaluation Centre (VDEC) at Porton Down is at the forefront of the UK’s effort in collaborating with global partners to develop life-saving vaccines, including vaccines for use outside of pandemics. mRNA technology is an exciting technology that allowed an agile pandemic response, and continued investment and leadership in this area will help ensure preparedness against future health threats."
        },
        {
            "text": "Building on the success of mRNA vaccines developed in response to the COVID-19 outbreak, the government partnered with Moderna in December 2022 to ensure the UK is at the forefront of this potentially transformational technology. Under the 10-year partnership, which is led by the COVID Vaccine Unit in UKHSA, Moderna will invest in further mRNA research and development and manufacturing in the UK. The partnership could provide part of the UK’s routine vaccine supply as well as enabling us to scale up production in the event of a future health emergency. This will complement both the work of VDEC and wider government investment in mRNA development."
        },
        {
            "heading": 2,
            "text": "What are mRNA vaccines and how do they work?"
        },
        {
            "text": "mRNA vaccines largely came to public awareness during the pandemic with the success of both the Pfizer/BioNTech and Moderna vaccines. These are the main vaccines used in the UK’s COVID-19 vaccination campaigns. However, researchers have been studying this method of creating vaccines for decades."
        },
        {
            "text": "mRNA, or messenger ribonucleic acid, is a component of all life on earth and has been in cells for billions of years. Its job in the human body is to provide a mechanism by which the instructions in our genes (DNA) can be used to make specific proteins in our cells. When used in vaccines, mRNA delivers the instructions for making a harmless piece of protein identical to one found in a particular virus or bacterium, to the ‘protein factories’ of our cells."
        },
        {
            "text": "Once the instructions have been decoded and the protein assembled, our immune system recognises it as a foreign body and starts to produce antibodies that can attack the protein if it encounters it again in the form of the ‘real’ virus."
        },
        {
            "text": "After the process is complete, the body’s own natural immune cells take over and the mRNA instructions from the vaccine break down. The immune system has a memory for producing antibodies, but this can taper off over time meaning a booster is necessary."
        },
        {
            "heading": 2,
            "text": "How is an mRNA vaccine different from a traditional vaccine?"
        },
        {
            "text": "All vaccines provide protection by helping our bodies to develop immunity against certain diseases. Some of the more traditional ways vaccines do this is by introducing a weakened or inactivated form of a virus or bacterium into the cell. This triggers our immune system to mount a response if it encounters the pathogen again."
        },
        {
            "text": "One of the main differences between mRNA vaccines and other types of vaccine is the method by which our immune systems are presented with an antigen (the target against which we want our immune systems to mount a response). Some vaccines contain the whole virus or bacterium (providing lots of different antigens), and some contain selected parts of the virus or bacterium (a more specific antigen). mRNA vaccines are different as they provide the instructions for our bodies to produce the parts of the virus within our own cells."
        },
        {
            "heading": 2,
            "text": "What are the benefits of an mRNA vaccine?"
        },
        {
            "text": "Developing the mRNA platform is a bit like developing a wanted poster. Once the design has been proven, then a different face (or a different set of genetic instructions for the protein in mRNA’s case) can be slotted in easily. The leading advantage of mRNA vaccines is that they can be designed and produced more quickly than traditional vaccines, which can be crucial for tackling rapidly changing viruses and in a pandemic response."
        },
        {
            "text": "mRNA vaccines have the potential to be more rapidly tailored to different diseases, or different variants of a disease, by changing the mRNA. They can also be more easily personalised to target the unique profile of cancer in each individual patient or for people with rare diseases. These uses of mRNA vaccines are known as therapeutics as they prevent recurrence in people with an existing condition."
        },
        {
            "heading": 2,
            "text": "What opportunities do mRNA vaccines hold for the future?"
        },
        {
            "text": "Beyond fighting pandemic-level threats, mRNA technology offers some exciting opportunities in treating non-pandemic disease."
        },
        {
            "text": "There are many threads being researched at the moment, but there are hopes that in the future mRNA vaccines could be used to train our immune systems to target cancer cells. The government has partnered with BioNTech to run clinical trials for personalised mRNA cancer vaccines in the UK and Moderna has several cancer vaccines in development."
        }
    ]
}