{
    "url": "https://equalities.blog.gov.uk/2018/04/19/promoting-lgbt-equality-globally/",
    "title": "Promoting LGBT equality globally",
    "authors": [
        "Mary Peart"
    ],
    "categories": [
        "LGBT"
    ],
    "pub_date": "2018-04-19T19:00:52+01:00",
    "content": [
        {
            "text": "This week the UK Government is hosting the Commonwealth Summit, bringing leaders and civil society from 53 nations together to work on a common agenda to promote prosperity, democracy and peace. This is a great opportunity for the UK to show its commitment to ensuring equality for all people, regardless of sexual orientation and gender identity."
        },
        {
            "text": "The UK has a special responsibility to promote LGBT equality in the Commonwealth as laws criminalising same sex acts in most of the Commonwealth countries are a legacy of Britain’s colonial past. As the Prime Minister said in her recent speech, she “deeply regret[s] both the fact that such laws were introduced, and the legacy of discrimination, violence and even death that persists today”."
        },
        {
            "heading": 2,
            "text": "Supporting change"
        },
        {
            "text": "The UK will support any Commonwealth nation seeking to reform anti-LGBT legislation, and the Home Secretary has announced today that £5.6m will be made available to support LGBT and gender equality in the Commonwealth."
        },
        {
            "text": "Working with the Kaleidoscope Trust, the Royal Commonwealth Society, Human Dignity Trust and Sisters for Change, this programme supports the reform of laws discriminating against women and LGBT people and the enactment of progressive equality legislation or policies. It also provides support and capacity building to civil society."
        },
        {
            "heading": 2,
            "text": "Acknowledging progress"
        },
        {
            "text": "Many members of the Commonwealth have already progressed LGBT equality in their own countries whether that is reforming anti-LGBT laws, enacting non-discrimination legislation, or sensitising health services to address the specific needs of LGBT people."
        },
        {
            "text": "The Government Equalities Office has commissioned an best practice guide to share the diversity of approaches that countries around the world are taking to protect LGBT citizens, and to inspire others on their own path to equality. The guide has been developed by OutRight Action International and you download the guide on their website."
        },
        {
            "heading": 2,
            "text": "Sharing experiences"
        },
        {
            "text": "The UK has also been on a journey towards ensuring equality, from decriminalising same sex acts in 1967 to introducing marriage for same sex couples in 2013, and has benefited from doing so. However, there is still more to do and the Government Equalities Office is working towards furthering LGBT equality in the UK, through funding an anti-homophobic, biphobic and transphobic bullying programme in schools or consulting on how to make the gender recognition process less bureaucratic and intrusive for trans people."
        },
        {
            "heading": 2,
            "text": "Equality benefits everyone"
        },
        {
            "text": "We want to tackle the remaining inequalities faced by LGBT people so that the UK is a place where everyone can succeed, no matter who they are; because we have learnt that equality benefits everyone. We want to encourage other countries to pursue their own journey towards equality, and reap the benefits from it."
        },
        {
            "text": "We’ve made a video sharing our progress since 1967. We hope that, by sharing what the UK has achieved over the last 50 years, we will inspire others to share their own progress so we can learn from each other."
        },
        {
            "text": " "
        }
    ]
}