{
    "url": "https://defrafarming.blog.gov.uk/2024/08/06/dartmoor-land-use-management-group-appointment-of-a-chair/",
    "title": "Dartmoor Land Use Management Group: appointment of a chair",
    "authors": [
        "Joe Phoenix"
    ],
    "categories": [
        "Farming and Countryside Programme"
    ],
    "pub_date": "2024-08-06T12:04:54+01:00",
    "content": [
        {
            "text": "In April, we published  our response to the Independent review of protected site management on Dartmoor.  "
        },
        {
            "text": "We agreed with the recommendation to create a land use management group to reinforce Dartmoor’s existing governance and provide a place for cooperation and collaboration between stakeholders and arm’s length bodies. "
        },
        {
            "text": "I’m pleased to confirm that following the election, we are now able to move ahead and appoint an independent chair for the Dartmoor Land Use Management Group (DLUMG)."
        },
        {
            "text": "The group will develop a land use framework and land use plan for this internationally significant site. It will also provide oversight and steward the delivery of the 25 recommendations put forward in the response to the review.   "
        },
        {
            "text": "In this post, I'll provide a summary of the role of the chair along with a link to the advertisement on GOV.UK. "
        },
        {
            "heading": 2,
            "text": "The role of the chair  "
        },
        {
            "text": "The chair's first task will be to identify and appoint members who bring the necessary knowledge, expertise and engagement to the group.  "
        },
        {
            "text": "They will set the agenda for meetings and help maintain a neutral and safe space to discuss and resolve issues. They will act as an independent mediator between stakeholders. "
        },
        {
            "text": "They must also consider the responsibilities of arm's-length bodies, such as Natural England, the Rural Payments Agency. Both are committed to supporting the group.  "
        },
        {
            "text": "A secretariat to support the chair is already in place."
        },
        {
            "heading": 2,
            "text": "Timeline"
        },
        {
            "text": "The following is subject to change but is broadly as follows: "
        },
        {
            "text": "The job description for the chair can be found on GOV.UK. "
        },
        {
            "text": "It includes:"
        },
        {
            "text": "I'll blog again when we're ready to announce the new chair."
        }
    ]
}