{
    "url": "https://rpc.blog.gov.uk/2024/08/06/lack-of-government-action-could-be-leaving-ineffective-or-out-of-date-regulation-on-the-statute-books/",
    "title": "Lack of government action could be leaving ineffective or out-of-date regulation on the statute books",
    "authors": [
        "Stephen Gibson"
    ],
    "categories": [
        "Better regulation",
        "Evaluation",
        "Independent scrutiny"
    ],
    "pub_date": "2024-08-06T09:47:40+01:00",
    "content": [
        {
            "text": "Before the recent election, the RPC published a Blogpost on the Government’s record on undertaking Impact Assessments (IAs). This showed the huge difference between the best performing departments (like BEIS, which achieved 90% ‘Good’ or ‘Satisfactory’ ratings) and poorer performers (like DLUHC, DfE and DHSC which received 54%, 50% and 47% respectively). It also showed the improvement in the quality of IAs as a result of the RPC review process – with 29 of the 35 IAs that were initially judged to be ‘Red’ (not fit for purpose) being improved to ultimately receive a ‘Green’ (fit for purpose) rating."
        },
        {
            "text": "We are now publishing similar information on Post-Implementation Reviews (PIRs) – reviews of whether regulations are operating as intended or failing to meet their objectives. A second spreadsheet has been added to the existing webpage. One of our previous Blogposts explained why PIRs are key to a smarter regulatory framework and how they inform decisions about whether to revise or remove a regulation so as to avoid outdated or ineffective regulation remaining in force."
        },
        {
            "text": "While we have published opinions on over 140 IAs since Dec 2020 (which should mean a similar number of PIRs), we have actually only seen 30 PIRs over the same period. We have commented repeatedly on the previous Government’s failure to meet their statutory obligation to produce and publish PIRs - these numbers highlight our concerns. Without reviewing the performance of recent regulation, government could be leaving ineffective or out-of-date regulation in place, causing unnecessary burdens on business and society."
        },
        {
            "text": "Around a third of PIRs produced recommend revising the regulation – this may be because it was not achieving its objectives, or possibly because it was working well and the government wanted to expand its scope to increase its effectiveness. For example, Defra’s PIR on dog microchipping regulations recommended extending the rules to include both cats and dogs. Clearly, many more regulations would be revised if their performance was assessed."
        },
        {
            "text": "The RPC is the independent Better Regulation Watchdog and is responsible for assessing new regulation, as well as the PIRs of existing regulation. We will update the information about IAs and PIRs on a regular basis (and also provide information about Options Assessments under the new Better Regulation Framework)."
        },
        {
            "text": "We hope that the Government will prioritise reviews of existing regulation which is vital to ensure that it is as effective as possible, remains up to date and meets its objectives, while imposing the minimum burdens on businesses and consumers."
        },
        {
            "text": "We welcome any comment below."
        }
    ]
}