{
    "url": "https://mhclgmedia.blog.gov.uk/2024/08/06/new-towns-speculation/",
    "title": "New Towns speculation",
    "authors": [
        "mhclgpress"
    ],
    "categories": [
        "Housing"
    ],
    "pub_date": "2024-08-06T11:46:22+01:00",
    "content": [
        {
            "text": "There has been inaccurate media reporting regarding the location of the Government’s proposed new towns and resulting concerns raised by local residents."
        },
        {
            "text": "As we made clear last week, the location of these New Towns has not been agreed. The Taskforce chaired by Sir Michael Lyons, will present a final shortlist of recommendations on appropriate locations to ministers within 12 months following engagement with local leaders and communities. No decisions have yet been made on the location of any new towns and speculation to the contrary is deeply unhelpful."
        },
        {
            "text": "We are clear that these new communities will be governed by a ‘New Towns Code’, which will ensure all the necessary infrastructure and public services will be in place."
        },
        {
            "text": "The new towns will help deliver hundreds of thousands of much-needed affordable and high quality homes, as well as create thriving communities. They will also spread opportunities for every walk of life – creating good jobs and delivering the transport links, access to public services like GP surgeries and schools, and high quality green spaces."
        },
        {
            "text": "Deputy Prime Minister, Angela Rayner said:"
        },
        {
            "text": "“Our new towns will deliver housing fit for the future, shaping new communities with real character that people can be proud to call home."
        },
        {
            "text": "“With Sir Michael in the driving seat, I know his Taskforce will work together with local people to help us decide on the right places for these new towns, delivering more homes, jobs and green spaces."
        },
        {
            "text": "“We are getting Britain building again and our long-term vision for a new generation of new towns will enrich the lives of working people in the years to come.”"
        }
    ]
}