{
    "url": "https://governmentscienceandengineering.blog.gov.uk/2024/03/08/60-years-to-a-chief-government-scientific-adviser-leadership-challenges-for-women-in-science/",
    "title": "60 years to a Chief Government Scientific Adviser: Leadership challenges for women in science",
    "authors": [
        "gseprofession"
    ],
    "categories": [
        "Uncategorized"
    ],
    "pub_date": "2024-03-08T15:42:36+00:00",
    "content": [
        {
            "text": "As part of our work to celebrate the United Nations “International Day of Women and Girls in Science”, the GSE’s Women’s Working Group organised a special panel event looking into the leadership challenges women face in science. The event was a success and 236 people from over 40 departments/agencies were in attendance.  "
        },
        {
            "text": "Our panellists were: "
        },
        {
            "text": "Dr Liz Ainsbury who leads the Radiation Effects Department at the UK Health Security Agency (UKHSA) and Deputy Head of the Science and Engineering Profession for UKHSA, with over 120 peer reviewed publications. "
        },
        {
            "text": "Dr Vicki Chalker, currently the Deputy Chief Scientific Officer for NHS England and formerly the first Chief Scientific Officer for NHS Blood and Transplant, and a former chair of the GSE’s Diversity and Inclusivity Action Group. "
        },
        {
            "text": "Dr Jackie Hughes, the Head of Science and Advice for Scottish Agriculture leading a team of 170 scientists, inspection, policy and support staff overseeing Scotland’s agricultural and horticultural sectors. "
        },
        {
            "text": "Dr Biz Sykes, the Head of Observations Operations at the MET Office leading a team of 80 engineers, meteorologists and IT experts. "
        },
        {
            "text": "And chairing these amazing panellists was Dr Freya Cleasby, a second year Civil Service Science and Engineering Fast Streamer currently on secondment at NPL. "
        },
        {
            "text": "(clockwise Liz Ainsbury, Vicki Chalker, Jackie Hughes, Freya Cleasby and Biz Sykes)"
        },
        {
            "text": "Over the course of the hour, a wide range of topics were discussed from saying yes to opportunities that scare you, to creating your support network to building resilience. The panel covered what it is like to be in a woman in leadership, how their career journeys had led them to their current positions and what we collectively need to do to ensure more women are STEM leaders within government. Overwhelmingly, the panel was about supporting and inspiring women to be authentic leaders, take the opportunity (even when you don’t tick every single criterion) and to lead with empathy and compassion.  "
        },
        {
            "text": "The feedback from the event was overwhelmingly positive with many people commenting on how encouraged and inspired they were by the panel’s real-life examples and advice.  "
        },
        {
            "text": "‘The wealth of experience was inspiring to listen to, I found it really interesting’  "
        },
        {
            "text": "‘Fantastic panel; I came away extremely inspired and encouraged by their insights’ "
        },
        {
            "text": "We at the Women’s Working Group are also encouraged by this feedback and how engaged people are with these kinds of events.  "
        },
        {
            "text": "While some of the work GSE delivers is undertaken by the GSE Profession Team located in GO-Science, there are many areas such as the diversity and inclusivity strand where the work is conceived, organised and managed by volunteers from across the GSE.  "
        },
        {
            "text": "There are countless opportunities for GSE members to get involved in things like this – many short term projects are advertised in the GSE newsletter or in the monthly Community of Practice meeting, (email GSE@go-science.gov.uk, if you would like to attend), or you can get involved in longer term areas of work such as the talent and learning workstream, or diversity and inclusivity strand. Not only do you get a chance to develop valuable and useful skills you might not get through your day-to-day work (e.g. volunteering to help organise a huge event like the GSE Conference), you also get to meet and mix with people from a range of different departments which certainly adds to a feeling of us all being part of a wider Civil Service science and engineering team. "
        },
        {
            "text": "This is your GSE, be a part of it. "
        },
        {
            "text": " "
        }
    ]
}