{
    "url": "https://mojdigital.blog.gov.uk/2024/03/08/breaking-gender-stereotypes-a-personal-reflection/",
    "title": "Breaking Gender Stereotypes: A Personal Reflection",
    "authors": [
        "Kate Shiner"
    ],
    "categories": [
        "a great place to work",
        "Diversity and Inclusion",
        "International Women's Day"
    ],
    "pub_date": "2024-03-08T13:54:01+01:00",
    "content": [
        {
            "text": "This International Women’s Day, I wanted to reflect on the power of role models to increase inclusion and inspire change in the workplace.  "
        },
        {
            "text": "When he was five, my son asked me if men were ever allowed to be doctors. His question came from the world he knew - he had only ever seen or heard about women doctors. His aunt is a doctor, his granny a senior nurse, and of course Miss Rabbit in his favourite show, Peppa Pig, is a doctor, among her many other and varied professions. "
        },
        {
            "text": "I grew up in a family where traditional gender roles were ignored. My mum was the main earner whilst my dad stayed at home to look after the kids.  It never once occurred to me that being a woman would limit my potential or my dreams. My mum was a daily role model of a strong, inspiring woman with a series of very senior jobs. She showed resilience, capability, and confidence. I saw first-hand that a woman could be a mum and have the career she wanted at the same time. "
        },
        {
            "text": "What I didn’t see at the time of course were the barriers that she and her generation, as well as the women before her, were forced to overcome to get to that position. Or indeed how difficult it was to succeed in a still very male-dominated environment. Gender discrimination, limited job opportunities, unequal pay, and pervasive sexual harassment were harsh realities for women in the 1980s and 1990s. "
        },
        {
            "text": "Thankfully, pioneering women persisted in their pursuit of equality and paved the way for future generations like mine to challenge traditional gender roles and advocate for workplace fairness and a seat at the table. I stand on the shoulders of these giants - the courageous women like my mum who defied societal norms, shattered glass ceilings, and fought tirelessly for gender equality. Their unwavering determination and resilience has paved the way for me and countless others to succeed without the constraints of gender stereotypes.  "
        },
        {
            "text": "But despite my young son thinking that only women can be doctors, the battle isn’t yet won."
        },
        {
            "text": "Gender equality is not just a female fight "
        },
        {
            "text": "It’s up to everyone as a collective to drive progress. Today, in 2024, despite advancements in gender equality, women continue to face obstacles such as the gender pay gap, under-representation in leadership roles, and workplace harassment. "
        },
        {
            "text": "The McKinsey’s 2002 report on Women in the Workplace showed that when managers actively advocate for gender diversity and provide support and mentorship to female employees, gender disparities in the workplace are significantly reduced. Supportive managers play a crucial role in dismantling barriers and biases. "
        },
        {
            "text": "We also need to actively push for more diversity in our teams, especially in management roles. To increase inclusivity of course but also because diverse voices and views make a better Civil Service able to serve our communities more effectively. To do this, we need to increase awareness and educate our colleagues about the unique challenges faced by women from different cultures, ethnicities, and sexualities in the workplace. This means proactive not passive allyship – speak out against bias, advocate for opportunities, and become mentors and sponsors."
        },
        {
            "text": "Let's normalise diversity  "
        },
        {
            "text": "In Justice Digital, we strive to build an inclusive talent pipeline. We want a workplace culture where women feel valued, respected, and supported, to reduce the prevalence and likelihood of microaggressions and biases. That means standing up to poor behaviour, advocating for flexible working, and promoting the benefits of feminine, people-focused, leadership. "
        },
        {
            "text": "Since August of last year, we've welcomed 92 incredible women to Justice Digital, and we're eager to see this number continue to rise! We have also recently signed up to the Talent Tech Charter which aims to help organisations look at the different lenses of diversity and how these lenses impact strategies like recruitment, retention, and creating an inclusive culture.   "
        },
        {
            "text": "As we celebrate International Women’s Day, we pay tribute to the resilience and perseverance of women who have blazed trails for progress and have allowed us to feel we have a place (and a voice) at the table. Let us all play our part in advocating for an inclusive and equitable workplace that embraces diversity and empowers all women. "
        }
    ]
}