{
    "url": "https://moderncivilservice.blog.gov.uk/2024/03/08/building-an-ambitious-civil-service/",
    "title": "Building an Ambitious Civil Service",
    "authors": [
        "modernisationandreform"
    ],
    "categories": [
        "A Modern Civil Service",
        "Ambitious",
        "Government Reform",
        "Operational Delivery"
    ],
    "pub_date": "2024-03-08T10:51:33+00:00",
    "content": [
        {
            "text": "A Modern Civil Service is our vision of a skilled, innovative and ambitious organisation equipped for the future. We've discussed what we mean by skilled and innovative, but what does ‘building an Ambitious Civil Service’ mean?"
        },
        {
            "text": "Almost everyone has heard about successful but complex public events like the Commonwealth Games or the King’s Coronation that the civil service has helped deliver. Civil servants have proved themselves efficient and resourceful during the late Queen’s lying-in-state Westminster Hall, supported by DCMS Digital’s ground-breaking livestream tracker to help manage the five mile queue. "
        },
        {
            "text": "All these projects are fantastic examples of an ambitious civil service. An Ambitious Civil Service is one that achieves excellence in delivering service to the public. It strives for collaboration and outstanding project delivery. "
        },
        {
            "heading": 3,
            "text": "How are we achieving this goal?"
        },
        {
            "text": "We want to make it easier for the Civil Service to work as one on delivering our core priorities. This means working together and making sure that every civil servant, whether they are frontline staff, digital and data experts or policy professionals, contributes to the delivery of these priorities. It is particularly important as the operational delivery profession makes up over half of all civil servants. "
        },
        {
            "text": "We are already doing a lot of work that will help us achieve this goal. For example: "
        },
        {
            "heading": 3,
            "text": "What’s on the horizon?"
        },
        {
            "text": "Through reform we want to make sure that civil servants have the opportunities for collaboration, and easier exchange of information, to help them deliver their projects.There are many exciting projects on the horizon, including:"
        },
        {
            "heading": 3,
            "text": "As a civil servant, what can I do to help?"
        }
    ]
}