{
    "url": "https://lifeathmrc.blog.gov.uk/2024/03/08/climbing-the-career-ladder/",
    "title": "Climbing the career ladder",
    "authors": [
        "June"
    ],
    "categories": [
        "Diversity and inclusion",
        "General"
    ],
    "pub_date": "2024-03-08T09:10:14+00:00",
    "content": [
        {
            "text": "June Smith is the Learning and Capability Lead in the Benefits and Credits Operations team – part of HM Revenue and Customs’ (HMRC) Customer Services Group."
        },
        {
            "text": "My Civil Service career started quite ordinarily enough as I applied for and started an admin role straight from school aged 18 in the Department for Work and Pensions."
        },
        {
            "text": "I relocated to Leicester as an Admin Officer (AO) and worked in various roles from working on the public reception, to interviewing 16 and 17 years olds in severe hardship, processing claims to benefit and behind the scenes as the office cashier and stockholder (in the days when giros were handwritten!)."
        },
        {
            "text": "I remain very grateful for being able to take a career break when I had my children and for the opportunity when I came back to work family friendly hours. It greatly helped me to invest in my career while bringing up my 3 kids."
        },
        {
            "text": "Following my career break I worked, still as an AO, on the job-seekers allowance processing team which provided my first opportunity to deputise at the next level as a team leader. You learn fast about the dos and don’ts of being a manager and I can honestly say that now, after over 25 years of managing teams in various roles and levels, it is one aspect of my job I enjoy most."
        },
        {
            "text": "The first time I went for promotion to Executive Officer (EO) grade I didn’t pass the interview. My confidence was knocked as I had been effectively doing the job but one the best pieces of advice I had and can now give, is ask for and act on feedback. I was able to put this into practice and next time the opportunity came I applied again and got the job."
        },
        {
            "text": "I left DWP and moved to HMRC (and to the West Midlands) a few years later, when I was successful in another promotion exercise. I was an operations manager in a Customer Service Contact Centre where I led teams of up to 100 colleagues. It was a fast-paced working environment which helped to develop my performance and management skills further. I really enjoyed this role and was able to work towards a leadership and management qualification within the Operational Delivery Profession."
        },
        {
            "text": "I took the opportunity to take a level move on a 12-month secondment to work in HR as part of their capability team. There I learned a new approach in developing people and in particularly managers as I worked to create and deliver management programmes across the UK. I found that I had a natural ability in this area and thoroughly enjoyed the experience and the role. When a permanent post came up in the team, I jumped at it and in total spent 5 years learning my Learning & Development (L&D) trade which included completing a level 5 CIPD HR qualification and delivering several capability projects and initiatives across HMRC’s Customer Services Group and securing another promotion."
        },
        {
            "text": "I then took the chance of another sideways move to gain experience and insight into a different area of HR working in a Business Partnering Team. I realised I’d missed and enjoyed working directly with HMRC’s customer facing teams and was able to bring my L&D experience into the role to good effect by designing and delivering a colleague wellbeing virtual conference."
        },
        {
            "text": "So, all of this takes me to my current role in which I gained permanent promotion at Senior Leadership level following another spell in a temporary position. I can honestly say that I love my job, it’s the best of both worlds for me in that I’m using my talents, skills, experience and learning to build capability and develop colleagues to manage and deliver customer service excellence for HMRC. I’ve also gained another qualification as an accredited coach to support my new role, making the most of our departments learning offer."
        },
        {
            "text": "My path to senior leadership level may seem like a long one (over 30 years), partly by design in having a career break early on and guided by the opportunities available at the time. My career journey has also been mainly experiential but learning and qualifications have played a big part and without doubt have helped me get to where I am today."
        },
        {
            "text": "I’m grateful for the opportunities that have helped shape my career to be the best fit for me and which makes the best use of my skills for the department and others."
        },
        {
            "text": "Top tips"
        },
        {
            "text": "Be the best you can be to deliver your role."
        },
        {
            "text": "Seek opportunities to work at the next level to develop your skills."
        },
        {
            "text": "Make the most of learning opportunities to optimise your professional skill set."
        },
        {
            "text": "Don’t be opposed to sideways moves along the way to discover what may or may not suit you."
        },
        {
            "text": "Don’t give up, if I can do it, so can you!"
        },
        {
            "text": " "
        },
        {
            "text": "A career in your hands "
        },
        {
            "text": "At HMRC, we offer a variety of professions and opportunities for you to develop yourself personally and professionally."
        },
        {
            "text": "Visit HMRC-Learning and development | Civil Service Careers (civil-service-careers.gov.uk) to find out what programmes we have on offer to help you progress in your career."
        },
        {
            "text": "To discover our current vacancies and to apply, visit Civil Service Jobs."
        },
        {
            "text": " "
        }
    ]
}