{
    "url": "https://environmentagency.blog.gov.uk/2024/03/08/environment-agency-monitoring-of-the-south-wests-largest-abstractor/",
    "title": "Environment Agency monitoring of the South West's largest abstractor",
    "authors": [
        "Mark Pilcher"
    ],
    "categories": [
        "Environment Agency",
        "Other areas of our work",
        "Regulated industry",
        "Sustainability"
    ],
    "pub_date": "2024-03-08T09:00:13+00:00",
    "content": [
        {
            "text": "Mark Pilcher, Land and Water team leader in West Cornwall, talks about our demanding work to inspect one of the largest abstractors of water in the south-west. "
        },
        {
            "text": "The Environment Agency (EA) is responsible for regulating water in England - its allocation, quantity, and use. We have a key role to play in reducing demand, using less water and improving supply, to ensure there is enough for the future.  "
        },
        {
            "text": "We work with water companies and businesses to plan for secure water supplies for both now and the long term. Anyone who abstracts or impounds more than 20 cubic metres of water a day usually requires a licence. As these licences are reviewed, we regulate them for sustainability on how much water is taken – from where and for what purpose – to prevent environmental damage.    "
        },
        {
            "text": "Imerys Minerals Ltd (IML) has a number of Environment Agency licences allowing them to abstract water. Amongst them is a licence for abstraction of 428,870 cubic metres of water per year from 26 different locations – known as the points of abstraction. That is equivalent to 172 Olympic swimming pools of water! "
        },
        {
            "text": "The only company abstracting a larger volume of water in the southwest is the water company (Southwest Water). Imerys’ activities in Cornwall focus on extracting and processing Kaolin (china clay) and help make the UK the world’s 3rd largest producer and exporter of Kaolin after Brazil and the USA.  "
        },
        {
            "text": "Imerys depend on water to support the mining (or ‘winning’ in IML language), transporting and refining of china clay. Around 8 million tonnes are excavated from various clay pits in Cornwall every year, and the process relies on water to wash it out. The clay slurry is then transported in pipelines to the clay refiners and driers where the finished clay product is produced. The complex operational and pipeline infrastructure that Imerys operates allows it to recycle a significant amount of its water (estimated at 40%) thereby reducing its environmental impact.   "
        },
        {
            "text": "Given the volumes of water we license Imerys to abstract, inspecting their licences for compliance with their abstraction licence conditions is a high regulatory priority for us. But, a typical inspection of one of Imerys’ large abstraction licences in mid-Cornwall is not for the faint hearted.   "
        },
        {
            "text": "One of the points of abstraction is at the very bottom of the immense Littlejohns Clay Pit in Cornwall. Littlejohns is the world’s largest open cast china clay pit, more than 130 metres deep in places, and covering more than 1200 hectares, right in the middle of the Imerys central clay district.    "
        },
        {
            "text": "It’s a challenging journey to the bottom of the pit, as mining operations continue nearby, with huge 50 tonne dumpers moving up and down the pit roads. A strict Health and Safety procedure is followed at all times, with Imerys closely supervising.   "
        },
        {
            "text": "A sump in the bowels of the pit collects groundwater which is abstracted to support the washing process of clay in a different part of the pit.   "
        },
        {
            "text": "Completing compliance inspections like this in such extreme environments is not always easy. Health and Safety procedures are always the priority, but the regulation of such a precious resource is essential and key to supporting a healthy environment as well as a sustainable business.   "
        },
        {
            "text": "Climate change and population growth mean we need to take action now to ensure resilient water supplies are available to meet the needs of all users in the future. The National Framework, published in 2020, set out the country’s future water needs across all sectors to 2050. We are working with stakeholders to update it for Spring 2025 and to take a perspective out to 2100 and beyond.  "
        },
        {
            "text": "You can also Follow the Environment Agency on Twitter, and sign up for email alerts.   "
        },
        {
            "text": "   "
        },
        {
            "text": " "
        }
    ]
}