{
    "url": "https://dwpdigital.blog.gov.uk/2024/03/08/inspiring-inclusion-at-dwp-digital-this-international-womens-day/",
    "title": "Inspiring inclusion at DWP Digital this International Women's Day",
    "authors": [
        "Sue Griffin, DWP Digital Head of User Support Services and chair of the DWP Women in Digital group"
    ],
    "categories": [
        "Digital With Purpose",
        "Diversity",
        "Women in Digital"
    ],
    "pub_date": "2024-03-08T09:11:17+00:00",
    "content": [
        {
            "text": "Sue Griffin, Head of User Support Services, DWP Digital "
        },
        {
            "text": "Today (March 8th) is International Women’s Day and this year's theme is inspiring inclusion. The theme focuses on inspiring women to be included, creating a sense of belonging, relevance, and empowerment highlighting the crucial role of inclusion in achieving gender equality.  "
        },
        {
            "text": "This month we will be celebrating our colleagues and championing allyship through a host of events and mentoring opportunities.  "
        },
        {
            "heading": 2,
            "text": "Our commitment to diversity & inclusion "
        },
        {
            "text": "Almost 35% of our workforce are women and we’ve seen an increase of women at Senior Civil Servant level rise from 39% to 50% in recent years. As a Senior Civil Servant, I am proud of the work we have done towards better gender parity.  "
        },
        {
            "text": "Research shows that women rate company culture highly when looking for a job in the tech sector. DWP (Department for Work and Pensions) has a dedicated Women’s Network and Menopause Network providing communities of support, advice and guidance. Alongside the networks within DWP our Women in Digital and Women in Data forums provide a supportive community of women from all levels of the organisation. "
        },
        {
            "text": "The communities we’ve created through these networks have been recognised across the tech industry. In 2023, we won ‘Employer of the Year’ at the Women in IT awards and ‘Company of the Year’ at the TechWomen100 awards for our commitment to supporting women and encouraging diversity in tech.  "
        },
        {
            "text": "We also won ‘Best employer career site’ at the Women in Tech Employer awards for our dedication to closing the gender gap in tech, impressed by our focus on showcasing role models.  "
        },
        {
            "text": "We were shortlisted for ‘Diversity Employer of the Year’ at the Computing Women in Tech Excellence awards, and I was proud to be shortlisted for ‘Role Model of the Year’ due to my passion for our Women in Digital network.  "
        },
        {
            "heading": 2,
            "text": "Creating inclusive communities "
        },
        {
            "text": "I am very proud to be the sponsor of our Women in Digital network. The aim of the group is to create an inclusive environment for women to develop women in their careers, providing excellent networking and training opportunities to build confidence and engagement skills. "
        },
        {
            "text": "We get together at least once a month and some of the things we get up to include sharing stories and ideas; supporting each other with opportunities and tackling challenges; hearing from talented colleagues in DWP Digital; sharing information about our professional industry networks; learning together about our practices and job roles; and offer mentoring and coaching. "
        },
        {
            "text": "I’m lucky enough to have had a very long and varied career in DWP, and it really matters to me to give back to the organisation and help others grow and succeed. I firmly believe that the more diverse and inclusive our organisation is, the better products and services we will deliver which is ultimately why we’re all here."
        },
        {
            "text": "A small thing we can all do to inspire inclusivity is to notice what’s going on around us. When women aren't present in a meeting or a talent cohort or on a speaking panel, we must ask \"Why not?\" And change that! "
        },
        {
            "text": "#InspireInclusion "
        }
    ]
}