{
    "url": "https://food.blog.gov.uk/2024/03/08/inspireinclusion-women-in-science-at-the-fsa/",
    "title": "#InspireInclusion - Women in Science at the FSA",
    "authors": [
        "Dr Erin Lewis, Research Engagement and Partnerships Coordinator"
    ],
    "categories": [
        "People",
        "Science"
    ],
    "pub_date": "2024-03-08T09:09:55+00:00",
    "content": [
        {
            "text": "Cymraeg"
        },
        {
            "text": "This year, International Women’s Day falls on the start of British Science Week, so it seemed only right to focus our blog this year on how to #InspireInclusion for our Women in Science."
        },
        {
            "text": "Last year Jane Clark, our Director of Veterinary Services, gave us an amazing blog on Equity, equality and veterinary services for International Women’s Day (which we would highly recommend reading if you missed it!) that showed the gender gap in the Veterinary profession."
        },
        {
            "text": "This year we are looking at science more broadly and talking to some of our Women in Science."
        },
        {
            "text": "Recent research has shown a major confidence gap between girls and boys when studying maths and science, with 41% of girls feeling unconfident learning science compared to only 26% of boys. This is despite girls outperforming boys at GCSE level! This makes inspiring girls to go into science an important task, and role models play a key part."
        },
        {
            "text": "But the picture doesn’t get a lot better as we go up the educational pathways, or into science careers. In 2020, women made up less than 30% of the Science, Technology, Engineering and Math (STEM) workforce. Additionally, they face barriers working in STEM while being carers. Without women to act as role models it is even harder to inspire!"
        },
        {
            "text": "This year’s theme for British Science Week is time, which reminds us to reflect on the past and see how far we have come, even if we still have a long way to go. Between 2009 and 2020 there was nearly a 30% increase in girls taking STEM subjects at A-levels. Between 2011 and 2020, the number of women accepted to full-time STEM undergraduate courses increased by 50.1%."
        },
        {
            "text": "So here are some of the amazing women in science at the Food Standards Agency, reflecting on the theme of time, women in science and their careers in STEM."
        },
        {
            "heading": 2,
            "text": "Beth Routley"
        },
        {
            "heading": 3,
            "text": "What is your current team and job title?"
        },
        {
            "text": "I’m the Engagement and Influence Team Leader, within the Science and Research Unit. I have been at the FSA for around six months – though it feels like more and less at the same time! My team operates at the junction between the science division, the rest of the FSA and the outside world."
        },
        {
            "text": "We support our colleagues within FSA Science to publish their work and ensure that as many people as possible are interacting with their outputs. We also develop strategic initiatives to help the FSA engage with others in government and academia, to further FSA research aims."
        },
        {
            "heading": 3,
            "text": "Tell us about a woman in Science who you admire"
        },
        {
            "text": "Elizabeth Garrett Anderson. She was the first woman to qualify as a doctor in Britain, against a societal backdrop where the view was that ‘higher education in women produces monstrous brains and puny bodies’. Throughout her career, she fought tirelessly for the rights of women to practice medicine, resulting in legislation that prohibited the exclusion of women from universities and medical schools. When she retired, she clearly decided she hadn’t done enough for women’s rights and became the first female mayor in England (in the town of Aldeburgh, Suffolk)!"
        },
        {
            "text": "More recently, I’ve been really inspired by Dr Jess Wade – a practicing physicist herself, she has been a huge advocate for encouraging and recognising the contributions of marginalised groups in STEM. In 2018, she started writing Wikipedia entries for notable scientists in underrepresented groups, including women. To date has contributed over 2000 articles to the site (among other advocacy work and a day job!)."
        },
        {
            "heading": 3,
            "text": "What did you work on before joining the FSA?"
        },
        {
            "text": "Just before joining the FSA, I was working on a cross-government initiative to make it easier for analysts to access data for research to inform public policy. Before joining the civil service, I worked in research and development jobs in the third sector and academia."
        },
        {
            "heading": 3,
            "text": "What was your childhood dream job?"
        },
        {
            "text": "I distinctly remember a strong desire at around 7 or 8 to be an archaeologist! As I got older, the desire to learn more about human cultures of the past was replaced by an interest in people in the here-and-now, and I ended up pursuing my BSc in Human Psychology."
        },
        {
            "heading": 3,
            "text": "What is the best piece of career advice you have ever received?"
        },
        {
            "text": "“It’s good to have goals but don’t get too fixed - keep yourself open to unexpected opportunities.” I have always been a person who loves a plan, but some of my most challenging (and ultimately rewarding) professional experiences have come from saying yes to things that came out of the blue. It’s helped me to always have a feeling of learning and growing in my work, which I really value."
        },
        {
            "heading": 3,
            "text": "If you could give one piece of advice to people about engaging with science, what would it be?"
        },
        {
            "text": "Hands-down to harness the unabashed curiosity of children! In a previous job I used to go into schools and talk to children about Psychology and Neuroscience, and at the end of a talk or experiment there’d always be dozens of hands going up to ask questions ranging from “how do we dream?” to “why am I left-handed?” to “what’s that wrinkly bit at the bottom?” (it was the cerebellum...). I think sometimes as adults we can get a bit embarrassed about what we don’t know and take it all a bit too seriously. Fundamentally, science is just about asking loads of questions and wanting to learn."
        },
        {
            "heading": 2,
            "text": "Erin Lewis"
        },
        {
            "heading": 3,
            "text": "What is your current team and job title?"
        },
        {
            "text": "I am the Research Engagement and Partnerships Coordinator, within the Science and Research Unit. I have now been in the FSA for 4.5 years! Time has flown. I initially started off in the microbiological risk assessment team and moved across to my current role last year. In this role I work much more in science communication, promoting FSA science, both internally with colleagues in the FSA and externally in the wider science and food communities. This helps us to stay at the forefront of science. I also have a passion for showing some of our scientists as role models for children to inspire them to consider a future in science."
        },
        {
            "heading": 3,
            "text": "Tell us about a woman in Science who you admire"
        },
        {
            "text": "Temple Grandin, I hadn’t really heard of her until watching the amazing film of the same name. She is an animal behaviourist by trade, but also a prominent autism spokesperson. Her story is one of difficulty, being a woman in a ‘mans’ profession, being autistic in an unaccepting society, and yet she never let it stop her. Her quote ‘I am different not less’ is one that sticks with me."
        },
        {
            "text": "But a little closer to home, I would have to say I have been privileged to work with some amazing women throughout my career. My university supervisor (biochemist by trade) was the woman who wouldn’t let me drop out when I felt things were too hard and set off the process that led to me being diagnosed with dyslexia. My first manager (microbial ecologist by trade) was the woman who increased my self-confidence enough to believe I could do a PhD. My current mentor (now lead on inclusion, but in a former life STEM graduate and communicator) has pushed me to step out of my comfort zone and become part of our staff network being more open and honest about my own dyslexia and advocating for those with disabilities."
        },
        {
            "heading": 3,
            "text": "What did you work on before joining the FSA?"
        },
        {
            "text": "Before I came to the FSA, I was doing my PhD which was titled ‘Applications of Next Generation Sequencing for the Assessment of Microbiological Safety of Fresh Produce’ (yes, I had to look that up!) To put it slightly more simply, I was using novel techniques to try and look at the microbes found on vegetables that can make you ill. It was an interesting project, and I loved the science, which is why I chose to stay in food! I also did a lot of work during my PhD in science engagement. I was part of a street science team and have held many sessions showing kids how interesting and diverse a career in science is."
        },
        {
            "text": "One of the most interesting things I noticed during an activity we do called ‘draw a scientist’ is that, as children get older, we see a higher percentage of them drawing the stereotypical male scientist. This really outlines the need for more female role models in science."
        },
        {
            "heading": 3,
            "text": "What was your childhood dream job?"
        },
        {
            "text": "I have always loved science and always wanted to go into science! As a girl I was steered away from what people said were ‘boys subjects’ (engineering) and toward more biological sciences. Luckily, I love a good microbe and really enjoy food microbiology!"
        },
        {
            "heading": 3,
            "text": "What is the best piece of career advice you have ever received?"
        },
        {
            "text": "Don’t be afraid to ask for what you want. Whether this is career advice, a job, a pay rise, a new project or help. There is a massive strength in asking for what you want. It’s terrifying and certainly not a skill that comes naturally, or that I have mastered, but I am getting there! Women are often worse at embodying this skill, so I tend to try and think about a colleague I admire and think ‘what would she do?’ It can be a good way to remind yourself you are worth it too."
        },
        {
            "heading": 3,
            "text": "If you could give one piece of advice to people about engaging with science, what would it be?"
        },
        {
            "text": "Science isn’t as big and scary as it can looks (although it can seem it!). Scientists genuinely love talking about science, but sometimes we get so excited that we forget what level we need to talk about it at. If you think we have gone off at too high a level, just ask us to explain. It can feel daunting, but I have never been insulted by someone who wants to learn, asking me to be better at teaching."
        },
        {
            "heading": 1,
            "text": "#YsbrydoliCynhwysiant – Menywod mewn Gwyddoniaeth yn yr Asiantaeth Safonau Bwyd"
        },
        {
            "text": "Eleni, mae Diwrnod Rhyngwladol y Menywod yn cyd-daro â dechrau Wythnos Wyddoniaeth Prydain, felly dyma flog yn canolbwyntio ar sut mae ein Merched mewn Gwyddoniaeth yn #YsbrydoliCynhwysiant.  "
        },
        {
            "text": "Y llynedd, rhannodd Jane Clark, ein Cyfarwyddwr Gwasanaethau Milfeddygol, flog anhygoel ar degwch, cydraddoldeb a gwasanaethau milfeddygol ar gyfer Diwrnod Rhyngwladol y Menywod. Roedd y blog yn dangos y bwlch rhwng y rhywiau yn y proffesiwn milfeddygol (mae’n werth ei ddarllen os nad ydych chi wedi’n barod!)"
        },
        {
            "text": "Eleni, rydym yn edrych ar wyddoniaeth yn ehangach ac yn siarad â rhai o Ferched mewn Gwyddoniaeth yr Asiantaeth Safonau Bwyd (ASB)."
        },
        {
            "text": "Mae ymchwil diweddar wedi dangos bwlch mawr o ran hyder rhwng merched a bechgyn wrth astudio mathemateg a gwyddoniaeth, gyda 41% o ferched â diffyg hyder wrth astudio gwyddoniaeth o gymharu â dim ond 26% o fechgyn. Mae hyn er bod merched yn perfformio’n well na bechgyn ar lefel TGAU! Mae’n bwysig felly ysbrydoli merched i weithio yn y maes gwyddoniaeth, ac mae modelau rôl yn chwarae rhan allweddol."
        },
        {
            "text": "Ond nid yw’r darlun yn gwella rhyw lawer wrth edrych ar lwybrau addysgol pellach, neu yrfaoedd ym maes gwyddoniaeth. Yn 2020, roedd llai na 30% o’r gweithlu Gwyddoniaeth, Technoleg, Peirianneg a Mathemateg (STEM) yn fenywod. Yn ogystal, mae gweithio ym maes STEM yn cyflwyno rhwystrau i’r rhai sydd hefyd â chyfrifoldebau gofalu. Heb fenywod i fod yn fodelau rôl, mae’n anoddach fyth ysbrydoli!"
        },
        {
            "text": "Amser yw thema Wythnos Wyddoniaeth Prydain eleni, sy’n ein hatgoffa i edrych yn ôl i’r gorffennol a gweld pa mor bell yr ydym wedi dod, er ein bod yn cydnabod bod gennym ffordd bell i fynd o hyd. Rhwng 2009 a 2020, bu cynnydd o bron i 30% yn nifer y merched a astudiodd pynciau STEM ar gyfer Lefel A. Rhwng 2011 a 2020, cynyddodd nifer y menywod a dderbyniwyd i gyrsiau israddedig STEM llawn amser 50.1%."
        },
        {
            "text": "Felly dyma rai o’r merched anhygoel ym myd gwyddoniaeth yn yr ASB, yn trafod y thema amser, menywod mewn gwyddoniaeth a’u gyrfaoedd ym maes STEM."
        },
        {
            "heading": 2,
            "text": "Beth Routley"
        },
        {
            "heading": 3,
            "text": "Ym mha dîm ydych chi’n gweithio ar hyn o bryd a beth yw teitl eich swydd?"
        },
        {
            "text": "Fi yw Arweinydd y Tîm Ymgysylltu a Dylanwad, o fewn yr Uned Gwyddoniaeth ac Ymchwil. Rydw i wedi gweithio yn yr ASB ers 6 mis. Ar un llaw, mae’r amser wedi hedfan ac ar y llaw arall, rwy’n teimlo fel ‘mod i wedi bod yma ers blynyddoedd! Mae fy nhîm yn gweithio rhwng yr is-adran wyddoniaeth, gweddill yr ASB a’r byd y tu allan."
        },
        {
            "text": "Rydym yn cefnogi ein cydweithwyr yn nhîm Gwyddoniaeth yr ASB i gyhoeddi eu gwaith a sicrhau bod cymaint o bobl â phosib yn rhyngweithio â’u prosiectau.  Rydym hefyd yn datblygu mentrau strategol i helpu’r ASB i ymgysylltu ag eraill yn y llywodraeth a’r byd academaidd, i hyrwyddo nodau ymchwil yr ASB."
        },
        {
            "heading": 3,
            "text": "Dywedwch wrthym am fenyw mewn Gwyddoniaeth rydych chi’n ei hedmygu"
        },
        {
            "text": "Elizabeth Garrett Anderson. Hi oedd y fenyw gyntaf i gymhwyso fel meddyg ym Mhrydain, a hynny mewn cymdeithas a gredai fod ‘addysg uwch i fenywod yn cynhyrchu ymennydd gwrthun a chyrff eiddil’. Drwy gydol ei gyrfa, fe frwydrodd yn ddiflino dros hawliau menywod i ymarfer meddygaeth, a arweiniodd at ddeddfwriaeth a oedd yn gwahardd peidio â chynnig lle i fenywod mewn prifysgolion ac ysgolion meddygol. Ar ôl ymddeol, fe aeth hi gam ymhellach dros hawliau merched a daeth yn faer benywaidd cyntaf Lloegr (yn nhref Aldeburgh, Suffolk)!"
        },
        {
            "text": "Yn fwy diweddar, rydw i wedi cael fy ysbrydoli gan y ffisegydd Dr Jess Wade. Mae hi wedi bod yn bencampwr amlwg dros annog a chydnabod cyfraniadau grwpiau ymylol mewn STEM. Yn 2018, dechreuodd ysgrifennu cofnodion Wicipedia ar gyfer gwyddonwyr nodedig mewn grwpiau heb gynrychiolaeth ddigonol, gan gynnwys menywod. Hyd yma mae wedi cyfrannu dros 2000 o erthyglau i’r wefan (ar ben gwaith eiriolaeth arall a’i swydd o ddydd i ddydd!)."
        },
        {
            "heading": 3,
            "text": "Beth oedd eich gwaith cyn ymuno â’r ASB?"
        },
        {
            "text": "Cyn ymuno â’r ASB, roeddwn yn gweithio ar fenter drawslywodraethol i’w gwneud yn haws i ddadansoddwyr gael gafael ar ddata ar gyfer ymchwil i lywio polisi cyhoeddus. Cyn ymuno â’r gwasanaeth sifil, roeddwn yn gweithio mewn swyddi ymchwil a datblygu yn y trydydd sector a’r byd academaidd."
        },
        {
            "heading": 3,
            "text": "Beth oedd eich swydd ddelfrydol pan oeddech yn blentyn?"
        },
        {
            "text": "Pan oeddwn yn 7 neu 8, rwy’n cofio’n glir yr awydd cryf i fod yn archeolegydd! Wrth i mi fynd yn hŷn, newidiodd fy awydd i ddysgu mwy am ddiwylliannau dynol y gorffennol i ddiddordeb mewn pobl yn y presennol, gan arwain at astudio BSc mewn Seicoleg Ddynol."
        },
        {
            "heading": 3,
            "text": "Beth yw’r cyngor gyrfa gorau a gawsoch erioed?"
        },
        {
            "text": "“Mae’n dda cael nodau ond peidiwch â glynu atynt ormod – byddwch yn agored i gyfleoedd annisgwyl.” Rwyf bob amser wedi bod yn berson sy’n hoff o gynllun, ond mae rhai o fy mhrofiadau proffesiynol mwyaf heriol (a gwerth chweil yn y pen draw) wedi dod o ddweud ‘ie’ i bethau annisgwyl. Mae hyn wedi fy helpu i deimlo fy mod yn dysgu a thyfu yn y gwaith, sy’n bwysig iawn i mi."
        },
        {
            "heading": 3,
            "text": "Pa gyngor sydd gennych i bobl am ymgysylltu â gwyddoniaeth?"
        },
        {
            "text": "Heb os, manteisio ar chwilfrydedd eofn plant! Mewn swydd flaenorol, roeddwn yn mynd i ysgolion a siarad â phlant am Seicoleg a Niwrowyddoniaeth, ac ar ddiwedd sgwrs neu arbrawf byddai bob amser dwsinau o gwestiynau, o “sut rydyn ni’n breuddwydio?” i “pam ydw i’n ysgrifennu â llaw chwith?” i “beth yw’r darn crychlyd yna ar y gwaelod?” (gan gyfeirio at y serebelwm...). Rwy’n meddwl weithiau ein bod ni fel oedolion yn gallu teimlo ychydig o embaras am yr hyn nad ydym yn ei wybod, ac yn cymryd popeth ychydig yn rhy ddifrifol. Yn y bôn, mae gwyddoniaeth yn ymwneud â gofyn llawer o gwestiynau a’r awch i ddysgu."
        },
        {
            "heading": 2,
            "text": "Erin Lewis"
        },
        {
            "heading": 3,
            "text": "Ym mha dîm ydych chi’n gweithio ar hyn o bryd a beth yw teitl eich swydd?"
        },
        {
            "text": "Rwy’n Gydlynydd Ymgysylltu Ymchwil a Phartneriaethau o fewn yr Uned Wyddoniaeth ac Ymchwil . Rwyf wedi gweithio yn yr ASB ers 4 mlynedd a hanner! Mae amser wedi hedfan. Dechreuais i yn y tîm asesu risg microbiolegol ac yna symud i fy rôl bresennol y llynedd. Yn fy rôl bresennol rwy’n gweithio llawer mwy ym maes cyfathrebu gwyddoniaeth, gan hyrwyddo gwyddoniaeth yr ASB, yn fewnol gyda chydweithwyr yn yr ASB ac yn allanol yn y cymunedau gwyddoniaeth a bwyd ehangach. Mae hyn yn ein helpu i aros ar flaen y gad ym myd gwyddoniaeth. Rwy’n angerddol hefyd dros arddangos rhai o’n gwyddonwyr fel modelau rôl i blant i’w hysbrydoli i ystyried dyfodol mewn gwyddoniaeth."
        },
        {
            "heading": 3,
            "text": "Dywedwch wrthym am fenyw mewn Gwyddoniaeth rydych chi’n ei hedmygu?"
        },
        {
            "text": "Temple Grandin, doeddwn i ddim wir wedi clywed amdani nes gwylio ffilm anhygoel amdani. Mae hi’n gweithio fel ymddygiadwr anifeiliaid, ond hefyd yn llefarydd amlwg dros awtistiaeth. Mae hi wedi profi rhwystrau, fel bod yn fenyw mewn proffesiwn llawn dynion, a bod yn awtistig mewn cymdeithas angharedig, ac eto ni wnaeth hynny ei rhwystro hi. Mae ei dyfyniad ‘Rwy’n wahanol nid llai’ yn un sy’n aros yn y cof."
        },
        {
            "text": "Ond yn fwy personol, byddai’n rhaid i mi ddweud fy mod wedi cael y fraint o weithio gyda menywod anhygoel trwy gydol fy ngyrfa. Ni wnaeth fy ngoruchwyliwr prifysgol (biocemegydd) adael i mi roi’r gorau iddi pan oedd pethau’n galed, gan ddechrau’r broses a arweiniodd at i mi gael diagnosis o ddyslecsia. Rhoddodd fy rheolwr cyntaf (ecolegydd microbaidd) ddigon o hunanhyder i mi gredu yn fy hunan i astudio PHD.  Mae fy mentor presennol (sydd bellach yn arwain ar gynhwysiant, ond cyn hynny wedi graddio mewn STEM ac yn gyfathrebydd) wedi fy ngwthio i roi cynnig arni a dod yn rhan o’n rhwydwaith staff i fod yn fwy agored a gonest am fy nyslecsia fy hun, a bod yn bencampwr dros bobl sydd ag anableddau."
        },
        {
            "heading": 3,
            "text": "Beth oedd eich gwaith cyn ymuno â’r ASB?"
        },
        {
            "text": "Cyn i mi ddod i’r ASB, roeddwn yn astudio fy PhD ar ‘Geisiadau Dilyniannu’r Genhedlaeth Nesaf ar gyfer Asesu Diogelwch Microbiolegol Cynhyrchion Ffres’ (ie, digon cymhleth!) Yn symlach, roeddwn yn defnyddio technegau newydd i geisio edrych ar y microbau a geir ar lysiau a all eich gwneud yn sâl. Roedd yn brosiect diddorol, ac roeddwn i wrth fy modd gyda’r wyddoniaeth, a dyna pam dewisais aros yn y maes bwyd! Yn ystod fy PhD, gweithiais lawer hefyd ar ymgysylltu â gwyddoniaeth. Roeddwn yn rhan o dîm gwyddoniaeth stryd ac rwyf wedi cynnal llawer o sesiynau yn dangos i blant pa mor ddiddorol ac amrywiol yw gyrfa mewn gwyddoniaeth."
        },
        {
            "text": "Un o’r pethau mwyaf diddorol i mi sylwi arno yn ystod gweithgaredd o’r enw ‘darlunio gwyddonydd’ yw, wrth i blant fynd yn hŷn, fod canran uwch ohonynt yn darlunio'r gwyddonydd gwrywaidd ystrydebol. Mae hyn wir yn amlinellu’r angen am fwy o fodelau rôl benywaidd mewn gwyddoniaeth."
        },
        {
            "heading": 3,
            "text": "Beth oedd eich swydd ddelfrydol pan yn blentyn?"
        },
        {
            "text": "Rwyf o hyd wedi caru gwyddoniaeth ac yn awyddus i weithio yn y maes! Fel merch roeddwn yn cael fy annog i beidio ag astudio ‘pynciau gwrywaidd’ (peirianneg) a chael fy annog i astudio gwyddorau biolegol. Yn ffodus, dwi wrth fy modd â microbau ac yn mwynhau microbioleg bwyd yn fawr iawn!"
        },
        {
            "heading": 3,
            "text": "Beth yw’r cyngor gyrfa gorau a gawsoch erioed?"
        },
        {
            "text": "Peidiwch â bod ofn gofyn am yr hyn rydych chi ei eisiau. Boed yn gyngor gyrfa, swydd, codiad cyflog, prosiect newydd neu gymorth. Mae gofyn am yr hyn rydych chi ei eisiau yn gryfder mawr. Mae’n gallu bod yn frawychus, ac yn sicr nid yw’n sgil sy’n dod yn naturiol. Dwi heb ei feistroli eto, ond dwi’n dechrau dod! Mae merched yn aml yn waeth am arfer y sgil hon, felly dwi’n tueddu i geisio meddwl am gydweithiwr dwi’n ei hedmygu, ac yn meddwl ‘beth fyddai hi’n ei wneud?’ Gall fod yn ffordd dda o atgoffa eich hun eich bod yn werthfawr hefyd."
        },
        {
            "heading": 3,
            "text": "Pa gyngor sydd gennych i bobl am ymgysylltu â gwyddoniaeth?"
        },
        {
            "text": "Nid yw gwyddoniaeth mor fawr a brawychus ag y mae’n ymddangos. Mae gwyddonwyr wrth eu bodd yn siarad am wyddoniaeth, ond weithiau rydyn yn cynhyrfu cymaint, rydym yn anghofio ei thrafod mewn termau syml y gall pobl lleyg eu deall. . Os ydych chi’n meddwl ein bod ni’n trafod ar lefel rhy uchel, gofynnwch i ni egluro. Peidiwch â bod ofn, nid oes ots gennyf os oes rhywun yn ceisio dysgu, ac yn gofyn i mi esbonio’n well."
        }
    ]
}