{
    "url": "https://defradigital.blog.gov.uk/2024/03/08/international-womens-day-my-career-journey-into-defra/",
    "title": "International Women’s Day - my career journey into Defra",
    "authors": [
        "Angela Marriott"
    ],
    "categories": [
        "Defra digital",
        "Defra services"
    ],
    "pub_date": "2024-03-08T07:00:33+00:00",
    "content": [
        {
            "text": "On International Women’s Day, Angela Marriott shares her career story, which began on a Youth Training Scheme at a plastics company, and which has brought her to a senior role in our Service Management Office."
        },
        {
            "text": "I left school in June 1995 and began a Youth Training Scheme (YTS) placement two weeks later!  My birthday is the start of June, so I had only just turned 16. There wasn’t a lot of money while I was growing up, so getting out to work to earn my own money was important to me."
        },
        {
            "text": "When I look back, despite feeling like a grown up, I was a long way from that! Alongside my work in an IT Training team at a Wire, Plastic & Cable company in Swindon I was studying for an NVQ II in Business Administration & learning to touch type, I was paid £25 per week."
        },
        {
            "text": "I remember how proud I was to get the job – I took my burgundy ‘record of achievement’ folder from school to the interview with the female Head of IT. It’s great to recall that there was a woman in a leadership position even back then in the 90s!"
        },
        {
            "heading": 2,
            "text": "Right place, right time"
        },
        {
            "text": "The YTS scheme was due to last two years, within about 13 months I’d applied for a permanent position at the company and secured myself a role as an IT Service Desk Agent. That is my Service Management origin story!"
        },
        {
            "text": "I’ve never been a technical person, what does seem to come quite naturally to me is to listen and ask questions. I’m curious (some might say nosy…!) and have always been keen to learn."
        },
        {
            "text": "I spent five years at that first company. I moved into the request fulfilment team where I witnessed a partial IT outsource. I observed engineers being TUPE’d to a different organisation and the difficulties that brought with it."
        },
        {
            "text": "I saw things go wrong with processes, training, and people. I worked hard to deal with customer backlogs and the associated escalations for installations. I had a white board opposite my desk with post-it notes to show the priorities – the visual aspect of the post-it notes worked best with the engineers who I was having to direct. I wasn’t given any training to deal with it that way, I was working on instinct."
        },
        {
            "text": "I’ve had my fair share of imposter syndrome over the years. I think probably because I didn’t go onto higher education and therefore felt a bit under-qualified compared to others. I was often not only the youngest person in the room but the only female as well, such is the nature of IT in the late 90s and early 00s."
        },
        {
            "heading": 2,
            "text": "Moving on to pastures new….."
        },
        {
            "text": "I moved to the bright lights of Bristol because I met a boy and fell in love. I took on some temporary agency work for Orange (the mobile phone company, now EE) in their IT Change Management dept."
        },
        {
            "text": "After a couple of months, they offered me a permanent role for what felt like an enormous amount of money – I felt like I was winning at life.  Within a few years, I’d been promoted to team leader and then manager."
        },
        {
            "text": "And then, the best bit so far happened, I got a company car. (I was only 23 and it felt like a big deal for someone like me!) A VW Beetle convertible in baby blue with a cream interior was my pride & joy."
        },
        {
            "text": "I went through my first change programme and got put at risk of redundancy during my time at Orange. The change programme encouraged me to seek out other job opportunities. I didn’t get redundancy, but I did continue my Service Management career. I worked for Virgin Mobile as a Service Delivery Manager & Capgemini as a Service Management consultant."
        },
        {
            "heading": 2,
            "text": "On the move again"
        },
        {
            "text": "In 2008 I spotted an opportunity in the IT department at the Environment Agency. When I applied, I was working for Capgemini – little did I know that they would become the main supplier for EA shortly after I joined. I transferred into Defra when the Digital Data and Technology Services function was formed in 2017."
        },
        {
            "text": "For me, life & work is all about the relationships you develop along the way. I like to have a good chinwag about how people are doing before launching into ‘work’. A bit of kindness and a smile goes a long way in my book and makes work and life more enjoyable."
        },
        {
            "heading": 2,
            "text": "Knowing your colleagues is so important"
        },
        {
            "text": "It’s important to me to have rapport and to know a bit about the people I’m working with. Being successful at work is inextricably linked to my life at home. That’s one of the reasons I enjoy working at Defra, where bringing your whole self to work is promoted. Being open and honest at work really makes a huge difference to me and helps my resilience."
        },
        {
            "text": "Despite having worked at EA/Defra for nearly 15 years, I’ve had a different focus every couple of years, via assignments, development opportunities and EOIs."
        },
        {
            "text": "I’ve recently developed a more formal career plan with the support of my mentors and am more intentional about my career decisions and aspirations. I’m not sure what the future has in store but I’ve nearly been in my current role for coming up three years so it’s probably time for a change…..!"
        },
        {
            "text": " "
        }
    ]
}