{
    "url": "https://dluhcdigital.blog.gov.uk/2024/03/08/international-womens-day-2024-inspiring-inclusion/",
    "title": "International Women’s Day 2024: inspiring inclusion",
    "authors": [
        "DLUHC Digital team"
    ],
    "categories": [
        "Careers"
    ],
    "pub_date": "2024-03-08T08:56:05+00:00",
    "content": [
        {
            "text": " "
        },
        {
            "text": "In celebration of International Women's Day 2024, 4 colleagues working in digital roles in DLUHC share their perspectives on this year’s theme ‘Inspiring Inclusion’. Join us as we delve into their thoughts and experiences, shedding light on the power of inclusivity in shaping a better workplace."
        },
        {
            "heading": 3,
            "text": "Helen D’Alessio, Cyber Risk Analyst, Technology Team"
        },
        {
            "text": "As a cyber risk analyst with a background in computer science and software testing, I am very familiar with being a woman in a field still dominated by men. "
        },
        {
            "text": "Despite that, I’m glad to say I have not felt alienated or held back because of my gender. I have always been able to hit the ground running, also thanks to my dedication to self-study, personal development and the valuable training I have benefitted from in digital government. I have progressed to become a subject matter expert in my field."
        },
        {
            "text": "To women aspiring to work in similar roles, I cannot stress enough the importance of finding a mentor. Having someone independent to bounce ideas off of has been invaluable to me. Shadowing someone who is already doing the job is also a great way to gain insight and experience. Additionally, it is crucial to engage with and learn from other women working in technology across the department. A starting point for this can be through joining our technology community of practice. "
        },
        {
            "text": "One gender issue that I think generally persists for women starting a career is the unconscious expectation that they will handle more administrative tasks than their male colleagues. This perpetuates stereotypes and can hinder career growth."
        },
        {
            "text": "It is also important to see women in leadership positions, such as our Chief Digital Officer Gill Stewart here in DLUHC; they can serve as role models to demonstrate that there are no limits to our aspirations. "
        },
        {
            "heading": 3,
            "text": "Anisha Ahuja, Head of Business Architecture, Digital Directorate"
        },
        {
            "text": "As a Business Architect, people and teams have always been a big part of my job; making sure we have the right people also means figuring out how they can be their best. "
        },
        {
            "text": "Whilst some of the things we do in DLUHC Digital, such as reaching out to women digital talent through dedicated job boards or blind sifting are important, I believe that ensuring gender balance goes beyond ticking boxes. "
        },
        {
            "text": "One of the recent initiatives I led to inspire inclusion in digital was a series of workshops in partnership with Beyond Equality to raise awareness on practical actions teams and individuals can take to make inclusion a reality in the workplace. Central to these sessions was the question: 'What influence could I have to remove some of the barriers to other people's inclusion?'. "
        },
        {
            "text": "Another similar initiative centred on psychological safety in our teams – the shared belief that it's ok to take risks, speak up or make mistakes without fear of retaliation, thus creating a more inclusive environment and fostering a culture of continuous learning and improvement in digital. We continue to include these elements in our digital and agile learning offering."
        },
        {
            "text": "Unfortunately, unconscious bias can still manifest in various ways. But instead of pointing fingers, I believe in finding ways to help people recognise their bias and understand what they’re doing. Most of us do not have ill intentions – we simply need guidance. Throughout my Civil Service career, I often wondered why there were not more senior leaders who looked and sounded like me. However, thanks to my leader, I no longer feel different or isolated. Her inclusive leadership style has made a significant impact, fostering a sense of belonging and empowerment in our teams."
        },
        {
            "heading": 3,
            "text": "Emily Sullivan, Head of Product, Local Digital"
        },
        {
            "text": "DLUHC is my first experience in central government. One of the reasons I initially applied was because of the flexibility in ways of working offered by the role. As a single mum to 2 primary school children, work life balance is particularly important to me, and it’s great to feel that my parental responsibilities are understood and accommodated by the caring and compassionate leadership of my employer."
        },
        {
            "text": "I’m not going to lie – juggling a career with the ‘mental load’ that comes from raising children and managing a household can be really tough! I think this is getting more recognition from employers generally, but this requires additional flexibility and support to be available and preventative measures to be in place where needed to ensure that employee wellbeing is maintained where there might be conflicts between work and personal priorities. "
        },
        {
            "text": "It is obvious that diversity, equality and inclusion are highly valued within DLUHC. There are a number of support groups available for staff, including a gender equality network, which are all really diverse and active. I am a member of the Working Parents Network and, as well as providing a sense of community and support, being part of this network helps me to feel that my needs are being represented in wider conversations about policy changes within the department. "
        },
        {
            "text": "I’d encourage any woman aspiring to work in digital to approach women who inspire them to ask for the opportunity to talk about their career journeys, seek out opportunities to shadow and observe, and take part in coaching or mentorship, where offered to you. Never be intimidated by a successful, empowered, inspiring female leader or colleague. They have so much to offer in terms of experience, advice and wisdom, and your approach will probably give them a confidence boost too.  In my experience, women very rarely realise quite how amazing they are."
        },
        {
            "heading": 3,
            "text": "Baljit Rakhra, Head of Delivery, Digital Planning"
        },
        {
            "text": "Unconscious bias is an issue that we need to address. I once witnessed an example of this at a product conference where only men product owners were featured in a presentation. It was an eye-opener for me to realise the unintended impact this had on our colleagues and the perception of inclusivity."
        },
        {
            "text": "To enable inclusion, it’s also important to create a culture where open communication is encouraged. In my team, we foster a very open culture where everyone has the freedom to present their ideas and ask challenging questions to leaders. "
        },
        {
            "text": "You don’t necessarily need to have a degree in maths or engineering to excel in a digital role. By providing a clear understanding of the different roles and their requirements, we can help individuals of all backgrounds realise their potential and that the right attitude is what matters."
        },
        {
            "text": "It's inspiring to see that we have a good gender balance on our senior leadership team. You still do not see that often in the sector. Such visible models can really motivate other women."
        },
        {
            "text": "But crucially, inspiring inclusion starts early. Waiting until university is too late to encourage women to pursue careers in technology. We should go to schools, inspiring kids to consider digital careers. Whether it's becoming a software engineer, a delivery manager or a product specialist, we need to emphasise the importance of STEM subjects and show that anyone can be involved in creating and programming, regardless of their gender. "
        }
    ]
}