{
    "url": "https://governmentscienceandengineering.blog.gov.uk/2024/03/08/international-womens-day-2024/",
    "title": "International Women’s Day 2024",
    "authors": [
        "gseprofession"
    ],
    "categories": [
        "Blog Series",
        "Capability & Skills",
        "Diversity & Inclusion"
    ],
    "pub_date": "2024-03-08T10:14:46+00:00",
    "content": [
        {
            "text": " "
        },
        {
            "text": "To celebrate International Women’s Day 2024, on Friday 8 March, we decided to catch up with Sadia Shorif, a Science and Technology intern and learn more about why she chose a career in the Civil Service with a STEM background.  "
        },
        {
            "text": "Hi Sadia, can you tell us a little bit about your STEM background? "
        },
        {
            "text": "Of course. I recently graduated from the University of Westminster with a BSc (Honours) in Pharmacology and Physiology. I really enjoyed this degree but decided to join the Civil Service on an internship as my first role after university, and I am a Science and Technology Project Research Officer at the moment.  "
        },
        {
            "text": "That sounds interesting, can you tell me about your current role, what do you do? "
        },
        {
            "text": "Sure! I am currently working within the GSE profession communication team in Government Office for Science. I lead on our GSE newsletter which is for our members to keep up to date with courses, events, opportunities and much more happening within GSE and across-government. I also help with planning and executing events. Currently we are planning our presence for Civil Service Live and our biannual GSE Conference taking place in September 2024. I also work on projects for the team when this is required such as to help create a framework of allowances for scientist and engineers across government. "
        },
        {
            "text": "Currently my focus has been on organising events for British Science Week 2024. I really enjoyed taking a lead on this project and collaborating with speakers and organising events for them. I am really pleased with the range of events we have coming up internally and externally. To find out more, check out the GSE special edition newsletter.  "
        },
        {
            "text": "That sounds so different to your STEM background. Why did you decide to join government and not pursue a career in pharmacology? "
        },
        {
            "text": "When I graduated, I knew I wanted to carry on being involved with science as that’s what I enjoyed the most. I decided to join the government as I wanted to contribute to making a difference, whether that was through policies, courses for scientists, etc but overall wanted to be a part of promoting science. I think the government is the perfect place to be innovative, creative and involved in projects that make a real difference to our society. Overall, while pharmacology remains a field of interest to me, joining the government aligns with my desire to make a meaningful difference at a broader societal level and utilises my skills in communication and stakeholder engagement. "
        },
        {
            "text": "That sounds great, do you think being a scientist helps you in your current role?  "
        },
        {
            "text": "Yes of course, especially when I am doing project work and analysing data. Drawing insights from a range of data sheets and comparing them, is something I did a lot during university and constantly had to support my ideas with evidence. Working in comms means being quick on your feet and also being a part of a fast- paced environment, and as a scientist, I constantly had multiple ongoing projects that needed attention. This experience has helped me keep organised, keep calm under pressure and deal with deadlines swiftly. "
        },
        {
            "text": "Last question, what is the best thing about your current role?  "
        },
        {
            "text": "I enjoy that fact that I am given so many different opportunities in such a short amount of time and given the trust to lead projects. I enjoy working in events as I get to collaborate with a range of people, and it’s always satisfying seeing people sign up and enjoy the events. I also enjoy the fact that this role is very creative, which is something I haven’t done previously as a scientist. It has allowed me to push out of my comfort zone and become much more confident in myself, while also learning new skills such as writing scripts and collaborating with new people which I am sure will be beneficial in the future. "
        },
        {
            "text": "Thank you for speaking to us, Sadia. Good luck with your chosen career! "
        },
        {
            "text": "To find out more about International Women's Day, please visit the website. "
        }
    ]
}