{
    "url": "https://medregs.blog.gov.uk/2024/03/08/international-womens-day-inspire-inclusion/",
    "title": "International Women’s Day: Inspire Inclusion",
    "authors": [
        "simongoodman"
    ],
    "categories": [
        "Uncategorized"
    ],
    "pub_date": "2024-03-08T16:49:42+00:00",
    "content": [
        {
            "text": "International Women’s Day: Inspire Inclusion"
        },
        {
            "text": "It’s International Women’s Day and Mandy Budwal-Jagait, Head of our Good Clinical Practice (GCP), team discusses why it’s important for us to Inspire Inclusion in the workplace."
        },
        {
            "text": "Trust, representation, opportunity, understanding, belonging. These are just a few of the many words that come to mind when I think about what diversity and inclusion mean to me. Today is International Women’s Day, which aims to ‘Inspire Inclusion’ for women in all aspects of life. But I believe this sentiment should be carried beyond today and beyond gender alone."
        },
        {
            "text": "We’re all individuals with our own unique differences, be that race, gender, sexual orientation, religious beliefs, socio-economic background, physical and cognitive ability. However, there’s a richness in creating a diverse and inclusive environment that nurtures a sense of belonging and understanding to get the best out of every individual for themselves and for society."
        },
        {
            "text": "When individuals feel the security, safety and trust in the environment they’re working in, they can bring their whole selves to work. This can inspire confidence in putting their ideas or points across, knowing they’ll be heard, valued and have an equal voice."
        },
        {
            "text": "Having diverse perspectives helps generate new ideas, awareness of bias or areas requiring further review, helping us develop effective solutions. It helps allow the bigger picture thinking which is vital in the work that we do to serve the public and society at the MHRA. We must support and inspire the journeys of people from diverse backgrounds so we can continue to create a rich environment in our industry."
        },
        {
            "text": "When I think back to my own journey, my drive started at the age of 8 or 9. I’d just lost my grandfather and I wanted to find the cure for cancer. I thought the only route was to become a doctor as culturally that was a respected and stable job. However, I soon realised that it wasn’t the medicine, but the science that excited me the most, and this took me to an MSc in Toxicology, where I was inspired by the drug development process."
        },
        {
            "text": "When I finished university, I knew I wanted to work as a Clinical Research Associate (CRA) in the pharmaceutical industry, but this is where I met my first hurdle, I had no idea how to go about it. I had no role models in industry, I didn’t know anyone who could help, so I did my own research into the qualifications needed and self-funded my ICH-GCP course."
        },
        {
            "text": "I then encountered a few recruiters who gaslighted me and made me feel that I stood no chance in getting a role out of university as a CRA. But I knew this was what I wanted, and thankfully, one great recruiter contacted me about an entry level CRA role where a candidate had dropped out last minute and I got the job!"
        },
        {
            "text": "Culturally, being in a role as a single or married woman who spent a lot of time travelling and staying away was not seen as ideal at the time. I’m thankful for a supportive family who recognised my drive to make a difference and always supported and encouraged me."
        },
        {
            "text": "So here I am, Head of GCP at the MHRA, playing my small part in a much greater ecosystem! I’ve kept the drive I had as a child, it’s this drive that makes me stay in this industry, as any one of us and our loved ones can become ill, and we’ll all need medicine in our life. I want to make sure that there are safe, effective treatments available for all."
        },
        {
            "text": "That’s an important part of our work as a GCP team. We inspect clinical trials to make sure the participants are safe, and that the data generated are reliable. We’re also involved in policy and guidance development and have a key role in maintaining public trust in taking medicine."
        },
        {
            "text": "Just as diversity and inclusion are needed in the workplace and society, it’s vital for our clinical trials if we’re going to inspire trust in the populations who are going to take these medicines. We’ve seen changes in trial design and recruitment practices to reach underserved populations, but there’s still work to do to build that trust."
        },
        {
            "text": "As a diverse GCP team, we bring different perspectives, insights and experiences to the table, which are valued and respected and we all champion each other to succeed. I’m proud that colleagues in the MHRA have a shared commitment to a common goal of protecting public health and demonstrate this commitment on a daily basis."
        },
        {
            "text": "Like many other organisations, I believe we’re on a journey to becoming a more diverse and inclusive workplace. Whilst there’s work to do, I’m proud of the support offered by the Compliance Teams who continually work to define and improve our culture as teams of inspectors."
        },
        {
            "text": "Blogs and articles from colleagues on Black History Month, LGBT+ History Month and Ramadan guidance is a great initiative which we can continue to build upon for other groups and communities. I personally found the support from Civil Service networks such as The Ethnic Minorities Women Forum and previous Race to the Top Networks invaluable."
        },
        {
            "text": "If we’re going to continue to inspire inclusion in the workplace we have to build on the initiatives in place, but most importantly demonstrate our intention for impactful change."
        },
        {
            "text": "I recently participated in the Race in STEM Roundtable where we discussed the need to ensure that our efforts result in change. To support this, education is important and being open to learning as well as being aware of our own unconscious biases. We also discussed the importance of role models and if you can see it, you can be it, which was certainly true in my case when I joined as an inspector. Finally, we have some work to do in having sponsors in the workplace who can champion individuals within their career within the agency and provide guidance and support."
        },
        {
            "text": "I hope that continuing to have these discussions and shining a light on the importance and benefits of diversity and inclusion will continue to inspire people of all genders, races and backgrounds in the future, and help them see the way towards their goals as I did."
        }
    ]
}