{
    "url": "https://ruralpayments.blog.gov.uk/2024/03/08/international-womens-day-from-farmer-to-field-officer/",
    "title": "International Women's Day: From Farmer to Field Officer",
    "authors": [
        "RPA Editor"
    ],
    "categories": [
        "Women in agriculture"
    ],
    "pub_date": "2024-03-08T11:07:00+00:00",
    "content": [
        {
            "text": "On International Women’s Day, RPA Field Officer Donna Sweetmore, who is one of a 127 strong team of RPA Field Officers making more than 6,500 site visits a year, talks about her role, her background in agriculture and the visibility of women in farming."
        },
        {
            "text": "Hi, I’m Donna, a Field Officer working in the North West, Lancashire and North Yorkshire. I’m fairly new to the role as I’m just a year in, but I’ve worked in agriculture from a young age - I milked cows; with no parlour, just individual kits and units, so maybe many won’t remember these, and I also helped on my Dad’s milk round. Before joining RPA, I worked in the Veterinary Laboratories Agency on routine diagnostics for zoonotic diseases and parasitology for 18 years, and I’ve also worked at a farm animal veterinary practice."
        },
        {
            "text": "As a Field officer and part of the Regulatory & Advice Service, I speak to land-owners and farmers on a daily basis. That initial contact with them is so important, so I always approach any one I’m visiting as I’d like to be approached myself.  The time of year drives the type of visits, and I work over a wide geographical area so it’s important to plan.  We’re currently in cattle season, which I love, and we’ll move on to sheep and then land- based visits."
        },
        {
            "text": "I always plan my day; working on 24/48hrs notice for most of our visits. Most of the time I’ll speak to the farmer and land-owner to coordinate the visit and try to accommodate timings with them, so if it’s easier to go at milking time to do a cattle inspection, I go early morning. If you’re lucky enough to see the sun rising, you’ve a good day ahead and If you’re even luckier, you get a cup of tea and a slice of cake."
        },
        {
            "text": "One of the aspects of my role that’s very satisfying is being able to work with farmers to deliver a positive outcome or to make suggestions / adjustments that will help them. Most farmers will ask for guidance, but you can offer information just by talking if you feel it’s needed and chatting to farmers is the aspect of my role that I enjoy most."
        },
        {
            "text": "There are still misconceptions about women in farming, but it is getting better. Women have always been in farming, and it continues to improve as more women take on roles within farming and in agriculture. There’s no doubt that women are influencing the future of farming in rural areas. Women have a voice in agriculture. Minette Batters, the former president of the NFU, received a standing ovation at the recent NFU conference for the work she has done within the NFU and for farming. I think seeing her as a role model empowers women in farming to speak up."
        },
        {
            "text": "I play my part in this as I think the aspect of my role that has the greatest impact on farmers is that I, and my fellow Field Officers, are here to work with, and help them. I feel we officiate in keeping British agriculture at the pinnacle of world food production."
        },
        {
            "text": "Outside work I live in Samlesbury in Lancashire. My partner is a farmer and I enjoy helping him (depending on the job or how grumpy he is). I have three wonderful (sometimes) children, two sons and a daughter, that I love to spend time with. I love walking my dog and I do like to climb a hill or two (slowly). I did the Yorkshire Three Peaks last year. I was just happy to catch the barn at the bottom of Ingleborough serving cups of tea and cake - I think that was my quickest descent down Whernside like a slightly slower Usain Bolt, to make sure It hadn’t closed."
        },
        {
            "text": "I seem to spend a lot of time cutting up wood at the weekends. It’s normally a family thing - my Dad still uses the chainsaw. At 53 I thought I may have progressed to a better job than picking up logs and stacking them, and alas my children become very scarce at these times."
        },
        {
            "text": "An old Farmer once said to me, “If you do a job you love, you will never work a day in your life.”"
        },
        {
            "text": "I do believe this; I’m incredibly lucky in my role. I work within a brilliant team and have a fabulous Team Leader. What more could you ask for? (maybe just cake!)"
        }
    ]
}