{
    "url": "https://medregs.blog.gov.uk/2024/03/08/med-tech-regulatory-reform-webinars-trusted-advisors-and-heading-to-washington/",
    "title": "Med Tech Regulatory Reform: Webinars, Trusted Advisors and Heading to Washington",
    "authors": [
        "Laura Squire"
    ],
    "categories": [
        "Innovation",
        "Med Tech Regulations"
    ],
    "pub_date": "2024-03-08T17:07:56+00:00",
    "content": [
        {
            "text": "  "
        },
        {
            "text": "Welcome to the March issue of the Med Tech Regulatory Reform blog series. As the leader of a team which includes many talented female scientists, I am particularly delighted to be publishing this at the start of British Science week and on International Women’s Day. "
        },
        {
            "text": "It has been a busy month: we announced, alongside our delivery partners, the eight products moving into the Innovative Devices Access Pathway pilot; the statutory instrument Medical Devices (In Vitro Diagnostic Devices etc.) (Amendment) Regulations 2024 (IVDR for NI for short) completed its journey through parliamentary debates and will come into force on 21 March, and in line with our published Roadmap, we were delighted to be joined by 1400 people on our first webinar this week to discuss the scope, classification and essential requirements of the future new core regulations."
        },
        {
            "text": "At the webinar my colleagues gave some detail about our intentions to clarify the regulatory status of products specifically intended for the cleaning, disinfection or sterilisation of devices; for prediction or prognosis of disease; which support conception; are used for investigation, replacement or modification of a pathological process and which provide information by means of in vitro examination of specimens derived from the human body, including organ, blood and tissue donations. We talked about how we will provide clarity for device users on how, and when a device can be used according to its intended purpose to reduce risks to patients associated with potential misuse and gave an update on the intended new definition of Software as a Medical Device."
        },
        {
            "text": "We gave an update on the proposed changes to GB classifications for general medical devices and IVDs, which are risk-proportionate, more closely aligned to international systems and provide additional clarity for device manufacturers. We had some great questions which we will use to help develop useful guidance to support these new proposed regulations. We will publish a recording of Tuesday’s webinar on our Med Tech regulations web page -  anyone who is interested can register online to receive updates to this page."
        },
        {
            "text": "Webinars are a great way to reach wide audiences, and where we can, we will continue to use that format to communicate our draft new policies, but for many areas, we will need smaller sessions run under the Trusted Advisor Principles I told you about last month. In order to ensure that we can maximise the value of those sessions, in the last month we have adjusted our Trusted Advisor Principles, to enable those attending to share what they learn more widely and consult appropriate experts within their organisations in order to feed back."
        },
        {
            "text": "We have several stakeholder discussions under Trusted Advisor Principles in the coming weeks including one to examine the detail of the regulations concerning Approved Bodies and two to discuss our plans to exempt certain devices made in Healthcare Institutions from some aspects of the regulations. In addition, we have had requests for discussions on some additional issues linked to the regulations, such as system capacity and performance. This will be held 18 March. Members of Trusted Advisor Groups are sourced through the relevant Trade Associations."
        },
        {
            "text": "We know that for companies operating globally, the Framework for International Recognition is going to be a vital part of the new regulations. We continue to gather feedback from the day long Trusted Advisor Group event on International Recognition on 26 January and in parallel, work across government and the health system to ensure that others who may be impacted are involved in the process. To give more certainty, we aim to publish an outline of the International Recognition Framework for medical devices later this Spring aligned to the Life Sciences Council, subject to necessary approvals. Ahead of that we will be testing our framework by walking through it with some exemplar products to iron out key issues. These products will not be granted approvals through this process rather this will be an opportunity to test the current policy thinking in practice."
        },
        {
            "text": "Next week is the 25th Session of the International Medical Device Regulators Forum (IMDRF), hosted by the US Food and Drug Administration (FDA), in Washington DC. The meeting runs from 11-15 March and includes public sessions as well as closed sessions for the IMDRF management committee only. I am excited that on one of the public days the sessions will all focus on International Recognition. I will be heading to Washington at the weekend with some of the team and the MHRA will be co-chairing one of the panels. This will be a huge opportunity for us to add to our learning not only on what has worked well in other jurisdictions but also to understand what others plan to do in the future around this critical issue. It is also a reminder of how important our regulations will be beyond the framework for International Recognition. Whether other regulators will, at some point in the future, be minded to recognise the UKCA mark is beyond my control but I do know, if that call comes, we need to be in a position where we can say the UK regulatory framework is as good as it can be, and one that other regulators should feel confident to rely on."
        },
        {
            "text": " "
        }
    ]
}