{
    "url": "https://insidehmcts.blog.gov.uk/2024/03/08/meet-the-women-in-our-criminal-courts/",
    "title": "Meet the women in our criminal courts",
    "authors": [
        "Sarah Davies, Head of Crime Communications and Engagement"
    ],
    "categories": [
        "Crime",
        "Interviews",
        "Working at HMCTS"
    ],
    "pub_date": "2024-03-08T13:45:44+00:00",
    "content": [
        {
            "text": "If you follow our social media channels, over the last few weeks you may have seen some of our staff sharing their experiences of what it’s like to work behind the scenes in the criminal courts.    "
        },
        {
            "text": "With women making up 70% of our workforce, for International Women’s Day, we spoke to some of the women who work in the criminal courts, learning more about their experiences of being a woman in criminal justice. "
        },
        {
            "text": "We also discussed how they support other women to access the justice system, whether that’s championing and enabling new initiatives that support female defendants or victims of crime, or small considerations that enable female witnesses to give their best possible evidence.   "
        },
        {
            "heading": 2,
            "text": "Supporting those affected by domestic abuse  "
        },
        {
            "text": "Delivery manager Karen has been instrumental in co-ordinating first hearing courts for domestic abuse cases in Yorkshire. This initiative aims to ensure that these types of case can run more efficiently, with the right resources and support from various agencies.  "
        },
        {
            "text": "One of the challenges in domestic abuse cases is maintaining the victim’s engagement throughout the legal process. Karen has seen instances where, without the victim’s involvement, there is high risk of cases failing.  "
        },
        {
            "text": "She says that its often seemingly small things that can help victims and complainants of domestic abuse to feel more engaged in the proceedings and confident to give evidence. Part of the process in the first hearing court is making sure that special measures applications are made at that first hearing.   "
        },
        {
            "text": "This is something Bethan, a delivery manager who works with vulnerable witnesses, has first-hand experience of. She supports vulnerable witnesses to give evidence, by taking steps to ensure they can remain anonymous by giving evidence behind a screen. "
        },
        {
            "heading": 2,
            "text": "Going the extra mile  "
        },
        {
            "text": "Bethan recognises the importance of other small actions in helping women who find themselves in the court feel less anxious about the court process. She explained that issues such as period dignity can impact on a witnesses’ ability to give evidence and how she makes sure that period products are available in witness waiting areas in her court.  "
        },
        {
            "text": "She appreciates coming to court can be worrying for many people and says this is just one less thing for women to worry about: "
        },
        {
            "text": "As a listing officer, Ami recognises the impact of waiting for their case to be heard can have on victims of sexual assault and domestic abuse and where possible we’ll always try and list domestic violence and sexual assault cases as soon as we can. "
        },
        {
            "text": "She gave an example of one particular case where she was able to work with her resident judge, the Crown Prosecution Service and defence to review the current case list to ensure a domestic abuse case could be heard as early as possible. Her work had a huge impact on the victim who had been worried about how she would cope financially.  "
        },
        {
            "heading": 2,
            "text": "Supporting female defendants  "
        },
        {
            "text": "Marie is an Intensive Supervision Court-Coordinator working at an Intensive Supervision Court (ISC) pilot site specifically for female offenders. The ISC diverts offenders with complex needs away from short custodial sentences and into enhanced community-based sentences. They aim to reduce reoffending by targeting the root causes of offending behaviour and supporting access to substance misuse and mental health treatment, education, and employment. Marie acts as the ‘middleman’ between all the agencies involved in the scheme.  "
        },
        {
            "text": "Women involved in the pilot meet individually once a month with the district judge in a more informal setting, which Marie says can encourage them to speak more freely about their experiences. "
        },
        {
            "text": "Marie outlined the progress she's noticed that's already been made by some of the women on the pilot in Birmingham and tells us some of the women have gone back to university and others have returned to full time employment. "
        },
        {
            "heading": 2,
            "text": "Working in the courts  "
        },
        {
            "text": "There are plenty of other examples of brilliant women working across the justice system and our quartet are all big advocates for opportunities available.   "
        },
        {
            "text": "Ami advised, “if you want to work in a court service, you have to be committed. You need to love the challenges because every day you'll face with the new challenges. But in that you need to find the positivity as well, because how you are going to play your part and get a result.” "
        },
        {
            "text": "The challenges and variety were something that Karen also enjoys: "
        },
        {
            "text": "And Bethan added:  "
        }
    ]
}