{
    "url": "https://actuaries.blog.gov.uk/2024/03/08/the-government-actuary-how-to-inspireinclusion/",
    "title": "The Government Actuary - how to #InspireInclusion",
    "authors": [
        "Fiona Dunsire - Government Actuary"
    ],
    "categories": [
        "Careers",
        "Government Actuary"
    ],
    "pub_date": "2024-03-08T11:41:24+00:00",
    "content": [
        {
            "text": "For me inclusion is about everyone having access to the same opportunities to develop their career. However, we know that opportunities aren’t always freely available. If they were, you’d see there was a good balance by gender and race at all levels and throughout society. So, we need to take conscious actions to overcome what could be either implicit or explicit barriers blocking people from getting equal access to opportunities."
        },
        {
            "heading": 2,
            "text": "Overcoming challenges "
        },
        {
            "text": "I’ve always felt lucky that I haven’t had significant challenges at work, but it’s probably partly a conscious career choice as well. When you work in a consulting environment, like GAD, we know we do better for our clients when we work as a team, and we reward more collegiate behaviour. This positive element of culture allows people to contribute more easily and progress."
        },
        {
            "text": "However, even now there are still times when I go to a meeting and feel in the minority and that can be intimidating, especially at the earlier stages of your career. I found that by being authentic and bringing out your personality as well as your technical skills, meant it wasn’t as difficult an environment in practice. Remember there may well be other people in a meeting who are possibly intimidated by the environment for other reasons, maybe even by you being an actuary!"
        },
        {
            "heading": 2,
            "text": "Inclusion of women in the workplace and society"
        },
        {
            "text": "Inclusion is important to make sure we’re getting the best ideas out of everyone. I don’t want people to be sitting with great ideas in GAD, and for them to feel inhibited about speaking up or challenging how we are doing things. That’s an important benefit of creating an open culture and inclusion."
        },
        {
            "text": "When the proportion of women in the workforce increases, there’s a positive impact on economic growth. They also have a significant influence on how their earnings are spent. Globally they spend more money on education and health, which then has a societal benefit."
        },
        {
            "text": "The introduction of shared parental leave is hugely positive as well. It means that by their early- to mid-40s, men and women should have had the same amount of time out of the workforce. That will help in getting gender pay and leadership equality, provided employers follow through in supporting men to use their leave."
        },
        {
            "heading": 2,
            "text": "Advice to others"
        },
        {
            "text": "Generally, the culture in our profession is very positive, we are clear about the need and the ambition. But we still need to see more progress. Leaders at all levels must be incredibly persistent and never take their foot off the pedal on this. If you just leave it to chance, then you won’t get the outcomes you want on diversity and inclusion."
        },
        {
            "text": "It's important to understand the flow of women (and other diverse employees) through the workforce by level and take action where there are pinch points, checking that factors such as flexible working don’t inhibit progression."
        },
        {
            "text": "For women themselves, my advice is, be clear about your career ambitions as part of setting goals each year. Organisations should advertise significant roles to ensure everyone can access them, but there are still project and other opportunities which we want to find the right people for, and which support progression."
        },
        {
            "text": "The second message is put yourself forward for things. If you don't apply, then we won't have women that we can select from!"
        },
        {
            "text": "Probably one of the most significant career development for me was becoming Mercer’s Chief Executive in the UK. Although I had been in a senior leadership role I still thought, ‘that's not for me.’ I reconsidered after a colleague suggested I apply, and I realised I should take the risk."
        },
        {
            "text": "It was also an example of the importance of building your network.  It’s a two-way thing that you give and get from throughout your career. There's lots of data about how women only put themselves forward for a role when they think they've got 100% of things required, so a network that challenges you to see yourself differently is helpful."
        },
        {
            "text": "Maybe it’s no surprise that as an actuary I am putting a lot of emphasis on data-based evidence! But it’s important that we use that to drive action for the benefit of everyone."
        },
        {
            "heading": 2,
            "text": "Proudest achievement"
        },
        {
            "text": "I have to say I'm pretty proud to be the Government Actuary. I'm also very proud that I am the first woman to be the Government Actuary. I was also the first woman to be the CEO of any of the big pension investment consultancies in the UK."
        },
        {
            "text": "It's not because I'm special. There's an element that it is our time, but you have to put yourself forward otherwise we're not going have women in these roles."
        },
        {
            "heading": 2,
            "text": "Inspirational women"
        },
        {
            "text": "I love learning about women who were some of the first leaders in science and maths and who possibly didn't get the full credit at the time. It reminds me that we should use the equality of opportunities we have now, which they won for us."
        },
        {
            "text": "Some of them were ‘difficult women’, but I don't mind. Let's be difficult women if that means we get the opportunities we should have!"
        },
        {
            "text": "Disclaimer"
        },
        {
            "text": "The opinions in this blog post are not intended to provide specific advice. For our full disclaimer, please see the About this blog page."
        }
    ]
}