{
    "url": "https://charitycommission.blog.gov.uk/2024/03/08/the-uks-charitable-spirit-must-be-nurtured/",
    "title": "The UK’s charitable spirit must be nurtured",
    "authors": [
        "Orlando Fraser KC"
    ],
    "categories": [
        "News"
    ],
    "pub_date": "2024-03-08T12:03:49+00:00",
    "content": [
        {
            "text": "This comment piece was first published in the Telegraph on 4 March 2024"
        },
        {
            "text": "Charities have a fundamental role in our society. As Chair of the Charity Commission, I regularly see first-hand the vital work charity volunteers, staff and trustees do up and down the country. Just last week, I was privileged to be in Norwich to see how community workshops at the local Men’s Shed are supporting people’s wellbeing."
        },
        {
            "text": "Charities registered in England and Wales have also stepped up in the face of international crises including the earthquakes in Turkey, Syria and Pakistan and more recently, the conflict in the Middle East. Last year, I visited Romania and saw the work of oversees aid charities like Oxfam, providing essential support to families displaced by the Russian invasion of Ukraine."
        },
        {
            "text": "We should be proud of British charities helping those in need both here and abroad."
        },
        {
            "text": "None of this work would be possible, though, without the huge generosity of millions of people across the UK. The Charities Aid Foundation ranks the UK as the world’s 3rd most giving nation. It estimates that Britons gave £12.7 billion to charity in 2022 – the British public’s most generous year yet. We can and should be proud of that record."
        },
        {
            "text": "It appears though that we have a challenge. Evidence suggests that philanthropy from the wealthiest section of UK society has been on a downward trend, just at a same time when there is an urgent need for more monies to flow into the charity sector."
        },
        {
            "text": "This concerns me, and I am determined to do everything in my power to support greater philanthropic giving, and get more philanthropic funds into the sector."
        },
        {
            "text": "As we have seen, though, charities can face intense scrutiny when making decisions on donations from wealthy sources. While most donations are straightforward to accept, challenges can arise when questions of ethics are raised around funds from a particular organisation or individual. These decisions can be fraught and finely balanced, requiring careful consideration of all the consequences."
        },
        {
            "text": "But importantly, when charities are offered a donation, their starting position should be to accept. The law generally expects charities to take monies that are offered, only refusing when there is very good reason. Donations are vital to a charity’s ability to deliver the good cause they represent – and to have even more of an impact."
        },
        {
            "text": "We’ve heard that charity trustees need advice on navigating this tricky terrain – and have listened. That’s why we have today [4 March] published new guidance for trustees when deciding whether to accept a donation. This aims to help trustees make the best decision for their charity, by reminding them of the starting presumption under the law, whilst clarifying that other choices can be made so long as it is justified."
        },
        {
            "text": "There are of course instances where this choice is clear – for example trustees must always refuse any donation that has come from illegal sources such as terrorist or other criminal activity. But there are other circumstances where the issues are more complex, such as over significant reputational issues, and here charity trustees have a wide discretion."
        },
        {
            "text": "It should be clear that trustee boards have objectively weighed up the impact on their charity - including the adverse financial effect of refusing a donation – and decided that their course of action is in the best interests of the charity. Where they have done so, we will generally respect these decisions."
        },
        {
            "text": "However, trustees must not allow their personal views or interests – or those of others – to influence them into a decision that is not in their charity’s best interests."
        },
        {
            "text": "As a fair, balanced and independent regulator, the Commission will not weigh in unnecessarily, but where decision-making looks materially irrational, we can choose to take another look. By using our guidance to ensure decisions are properly made, trustees will be well placed should criticism arise."
        },
        {
            "text": "I want existing philanthropists and potential donors to feel confident to give generously, and charities to feel confident to accept donations, where it is in the best interests of their charity to do so."
        },
        {
            "text": " "
        }
    ]
}