{
    "url": "https://defrafarming.blog.gov.uk/2024/03/08/webinar-follow-up-the-offer-for-arable-and-horticulture-growers/",
    "title": "Webinar follow up: the offer for arable and horticulture growers",
    "authors": [
        "Becky Briggs"
    ],
    "categories": [
        "Farming and Countryside Programme",
        "Payments for equipment, technology and infrastructure",
        "Sustainable Farming Incentive",
        "Webinars"
    ],
    "pub_date": "2024-03-08T12:05:00+00:00",
    "content": [
        {
            "text": "On Thursday 29 February, we held a webinar for arable and field horticulture growers in England."
        },
        {
            "text": "In the session, we covered the Sustainable Farming Incentive (SFI), Countryside Stewardship (CS), the Improving Farm Productivity (IFP) grant and the Farming Equipment and Technology Fund 2024."
        },
        {
            "text": "We explained how SFI supports both productivity and the environment and went through the wide range of actions including for soils, nutrient management and integrated pest management."
        },
        {
            "text": "In this post, I’ll summarise the themes that emerged in the questions and I’ll set out the best ways for you to get answers as quickly as possible."
        },
        {
            "text": " "
        },
        {
            "heading": 2,
            "text": "Apply now for an SFI agreement"
        },
        {
            "text": "Don’t delay, apply today!"
        },
        {
            "text": "Over 13,000 farmers have already applied for an SFI agreement.  You can apply for an SFI agreement now and choose from the 23 actions currently on offer."
        },
        {
            "text": "By waiting for the 2024 actions to become available, you could be losing out on money. If you apply now, you'll be able to add actions to your agreement annually - or have an additional SFI agreement on the same parcel of land, as long as the agreements don’t pay twice for the same action."
        },
        {
            "text": " "
        },
        {
            "heading": 2,
            "text": "SFI management payment increase"
        },
        {
            "text": "Good news! We announced we are doubling the SFI management payment so those with existing SFI agreements receive up to an extra £1,000 this spring, and we are extending it to Countryside Stewardship Mid tier for the first year of agreements starting by March 2025."
        },
        {
            "text": "It will apply to all SFI agreement holders with an agreement live on 1 January 2024, starting from the first day of their agreement, and to all new entrants into SFI from now on, including the expanded offer this summer. We are prioritising increasing the payment in the first year, because this is when costs are highest for farmers."
        },
        {
            "text": "In the first year, it will pay £40 per hectare for up to the first 50 hectares entered into an eligible agreement and £20/ha for the first 50 hectares for years 2 and 3.  It is an annual payment paid each year of the agreement. The annual payment is divided into 4 equal instalments and paid on a quarterly basis. The first quarterly instalment will usually be made in the fourth month after the start date of your SFI agreement. You don’t have to do anything to receive the payment, it will be paid automatically.  The RPA will be in touch with agreement holders soon to confirm when you will receive the payment."
        },
        {
            "text": "This payment comes alongside other improvements to SFI, including: a 10% increase in the average value of agreements in SFI and CS Mid Tier; 50 new actions farmers can get paid for; and a single streamlined application process."
        },
        {
            "text": " "
        },
        {
            "heading": 2,
            "text": "How does an SFI agreement work?"
        },
        {
            "text": "It’s possible to be in SFI and Countryside Stewardship at the same time if the actions are compatible and you are not being paid for the same action twice."
        },
        {
            "text": "Those already in SFI will be able to add more actions and land to their agreement on the anniversary of their agreement start date.  To do this, you submit an ‘upgrade request’ towards the end of the first and second years of your 3-year SFI agreement.  More details of how to do this, can be found in the SFI handbook under section 5.1.3 Requesting changes to your SFI agreement."
        },
        {
            "text": "If you choose a rotational SFI action, you’ll tell us the area and location of that action for the first year of your SFI agreement in your application.  It will be possible for you to vary the coverage of rotational actions, so they work with your crop rotation and different sizes of land parcels.  This means that in the second and third years of your agreement, you’ll be able to do the action on:"
        },
        {
            "text": "The RPA will let you know how to tell them about a change to the area and location of rotational actions for the second and third agreement years."
        },
        {
            "text": "Something that was also asked was how to cross-reference land-use and areas.  The best way to do this would be to login into RPA twice on two separate windows or tabs, and have them open at the same time to make it easier to cross reference between the two."
        },
        {
            "text": "Find out how SFI can work for you."
        },
        {
            "text": " "
        },
        {
            "heading": 2,
            "text": "The combined offer"
        },
        {
            "text": "We’re streamlining the way we present our offer. We currently have separate SFI and CS Mid and Higher Tier schemes offering different types of actions and agreements."
        },
        {
            "text": "We will open the combined offer, containing the actions previously available through CS Mid Tier and SFI, at scale by July 2024 – this means most farmers will be able to apply online by July and start their agreements by the autumn."
        },
        {
            "text": "We will publish the details of the 2024 SFI offer by May, so that farmers can plan ahead. This will include full details of the actions, prices, and rules for combining different actions on the same land."
        },
        {
            "text": "We will open for applications in time for the agreement to start next January, as usual, but we will be accepting applications through a rolling window – we will confirm the timings and process for this shortly."
        },
        {
            "text": "When we have more information on moving from an ES/HLS agreement into SFI, we will share that information here on the blog, and RPA will get in contact with agreement holders. An ES/HLS agreement holder can have an SFI agreement, as long as options don't overlap and there is no dual funding."
        },
        {
            "text": "Learn more about the combined offer."
        },
        {
            "text": " "
        },
        {
            "heading": 2,
            "text": "Apply now for capital grants"
        },
        {
            "text": "A few questions were asked about the capital grants offer in the webinar.  Capital grants are 3-year agreements offering capital items to achieve specific environmental benefits within 4 groups:"
        },
        {
            "text": "There is no limit on either the maximum amount for any application or the amount you can apply for in each of the 4 groups.  You can select multiple items from the 4 different groups."
        },
        {
            "text": "You can check if you are eligible to apply for a capital grant.  Some of you asked if you could still apply for capital items if you were already in an existing CS Mid-Tier or Higher Tier agreements.  The answer is yes, if all capital works on that parcel in your CS Mid Tier or Higher Tier agreement have been fully completed and paid for, then you just need to make sure that:"
        },
        {
            "text": "The good news is you can submit a capital claim at any time of the year once the work is completed.   You just need to have been charged/invoiced for the items by your supplier.  The RPA aim to pay valid claims within 2 months of receiving them."
        },
        {
            "text": "Learn more about capital grants"
        },
        {
            "text": " "
        },
        {
            "heading": 2,
            "text": "Apply now for grants to improve Productivity, Slurry management and Animal Health and Welfare "
        },
        {
            "text": "The Farming Equipment and Technology Fund also provides grants for equipment and technology that support improvements in:"
        },
        {
            "text": "You can apply for one grant from each of the 3 themes."
        },
        {
            "text": "The fund is competitive. The Rural Payments Agency (RPA) will allocate funding after all applications within an application window have been received and scored. You may not receive any, or all of the funding you apply for."
        },
        {
            "text": "Successful applicants will receive a grant of:"
        },
        {
            "text": "We will pay a percentage of the cost depending on the item. For many items, this percentage is an increase on last year. This funding will go towards either:"
        },
        {
            "text": "Our team will host a webinar on 12 March 2024. You will be able to put your questions to policy leads during this session. Register to attend the webinar."
        },
        {
            "text": "Apply for the Farming Equipment and Technology Fund 2024"
        },
        {
            "text": " "
        },
        {
            "heading": 2,
            "text": "Further support and guidance "
        },
        {
            "text": "With improved choice and payment rates, now is the time to apply for SFI. For more information visit our dedicated SFI site which sets out the full offer, and you can watch RPA’s how to apply for SFI video."
        },
        {
            "text": "There’s now a tool for you to check what SFI actions you can get paid to do on your land. Just select your land type in the SFI filter tool for a list of compatible actions in SFI23.  It doesn’t commit you to anything, it’s free, and you can print the results."
        },
        {
            "text": "To help you manage the transition and plan, you can get free advice from an independent provider.  If you have a query about SFI, you can contact the RPA."
        },
        {
            "text": "You can also access free advice through an independent provider if you receive BPS."
        },
        {
            "text": "The guidance for every scheme and grant on offer can be found on the Funding for farmers, growers and land managers page on GOV.UK."
        }
    ]
}