{
    "url": "https://space.blog.gov.uk/2024/11/15/planet-hunting-and-meteor-spotting-the-night-sky-in-november-2024/",
    "title": "Planet hunting and meteor spotting: the night sky in November 2024",
    "authors": [
        "Derek Smale"
    ],
    "categories": [
        "Astronomy"
    ],
    "pub_date": "2024-11-15T14:05:19+00:00",
    "content": [
        {
            "text": "November is a great month for a night of stargazing; you can see the planets of our Solar System, meteor showers, and the most distant object we can see with the naked eye, the Andromeda Galaxy."
        },
        {
            "heading": 2,
            "text": "November is a great month for planet-hunters"
        },
        {
            "text": "Innermost planet Mercury is challenging to spot as its close orbit around the Sun means it’s never visible in the dark skies of night. "
        },
        {
            "text": "This month however, brightest planet Venus is a handy guide, lying just to the left of Mercury. Look for both, low on the south-western horizon around 30-45 minutes after sunset."
        },
        {
            "text": "Mars rises in the east around 10pm this month, lying on the border of the constellations of Gemini and Cancer. "
        },
        {
            "text": "The red planet will get steadily brighter over the coming weeks and early risers will get to see its distinctive red hue shining high in the southern sky before dawn."
        },
        {
            "text": "Our Solar System’s largest planet, Jupiter lies in the constellation of Taurus and is visible from around 7pm in the north-eastern sky. "
        },
        {
            "text": "It’s visible all night and is still shining brightly in the west in the morning when the rising Sun’s light outshines it."
        },
        {
            "text": "Jupiter reaches its brightest for 2024 early next month and is much higher in our skies than it has been for a decade, so it’s a wonderful time to try to see it."
        },
        {
            "text": "Saturn is easy to spot as darkness falls as it’s the brightest object in the southern sky. It remains visible until it drops to the south-western horizon shortly after midnight."
        },
        {
            "text": "Uranus is at its brightest this month but can only be spotted without optical assistance under very dark skies, lying just to the right of the Pleiades star cluster in the constellation of Taurus."
        },
        {
            "text": "Neptune is much fainter and can be found to the left of Saturn."
        },
        {
            "text": "Those wishing to see all the planets this month will need binoculars or a telescope to complete the set!"
        },
        {
            "heading": 2,
            "text": "November is a great month for:"
        },
        {
            "text": "Galaxy spotting:  While spring is the time when astronomers can see most of our larger neighbouring galaxies, the next few months are a great chance to see the Andromeda and Triangulum galaxies."
        },
        {
            "text": "Meteor showers:  The middle of November is a great time to look for meteors in our night skies, as the peak of two meteor showers, the Taurids (12 November) and Leonids (16-17 November), fall within days of each other."
        },
        {
            "text": "The star-map below shows the constellations where these two lie, high in the south-eastern sky as darkness falls. "
        },
        {
            "text": "Get away from bright city lights and Andromeda is visible with the naked eye, though you may need binoculars to find Triangulum. Both galaxies lie around 2.5 million light years away."
        },
        {
            "text": "The Taurids, fragments of rock and ice trailing in the path of 5km (3 mile) wide Comet Encke, enter our atmosphere at a relatively slow 27km (17 miles) per second. The Leonids, debris from Comet Tempel-Tuttle, blaze through our upper atmosphere at around 70km (45 miles) per second."
        },
        {
            "text": "The Milky Way:  At this time of year as darkness falls, the nearest spiral arm of our Milky Way arches high overhead."
        },
        {
            "text": "To the south-west lies the brighter, star-dense centre of our galaxy, where under darker skies, the now-fading summer constellations of Sagittarius, Aquila and Cygnus slide towards the horizon."
        },
        {
            "text": "To the north-east, the Milky Way provides a fainter glow as we are looking out towards the edge of our galaxy, through a thinner spread of stars. You can use the star-map in last month’s edition to find the glowing constellations of Cassiopeia, Perseus, Auriga and Taurus. Following them a little later in the evening comes the distinctive and beautiful winter constellation of Orion."
        },
        {
            "heading": 2,
            "text": "DID YOU KNOW?"
        },
        {
            "text": "We’ve been sharing these monthly astronomy blogs for four years now.  In the time it has taken us to complete those four orbits around the Sun:"
        },
        {
            "text": "Thank you for reading. Wishing you clear skies!"
        }
    ]
}