{
    "url": "https://mhrainspectorate.blog.gov.uk/2024/11/15/public-consultation-on-the-international-council-for-harmonisation-ich-e6-r3-guideline-for-good-clinical-practice-annex-2/",
    "title": "Public Consultation on the International Council for Harmonisation ICH E6 (R3) Guideline for Good Clinical Practice Annex-2",
    "authors": [
        "Michelle Gabriel"
    ],
    "categories": [
        "Good clinical practice"
    ],
    "pub_date": "2024-11-15T16:41:55+00:00",
    "content": [
        {
            "text": "As a GCP Inspector at the UK Medicines and Healthcare products Regulatory Agency (MHRA), I thought it would be useful to inform you that Annex 2 of the International Council for Harmonisation (ICH) E6 Good Clinical Practice (GCP) Guideline has reached Step 2b and is available for public consultation."
        },
        {
            "text": "The ICH Expert Working Group for ICH E6(R3) (EWG) has been updating the ICH E6(R2) GCP guideline (current version). The MHRA represents the Pharmaceutical Inspection Co-operation Scheme (PIC/s) in the EWG and MHRA GCP Inspectors have been attending the EWG meetings. "
        },
        {
            "text": "The update of ICH E6 is to address the application of GCP to new trial designs, technological innovations and to strengthen a proportionate risk-based approach of its application for clinical trials of medicines to support regulatory and healthcare decision making. This was set out in the ICH Reflection paper on Renovation of Good Clinical Practice and the ICH E6(R3) Concept Paper and a Business Plan was developed. ICH E6(R3) has been restructured and is composed of an overarching principles section, Annex 1 (interventional clinical trials), Annex 2 (additional considerations for non-traditional interventional clinical trials), Glossary and Appendices."
        },
        {
            "text": "The overarching principles, Annex 1, Glossary and Appendices will replace the current E6(R2) and were released for public consultation by ICH in May 2023. "
        },
        {
            "text": "The Annex 2 concept paper was endorsed by the ICH Management Committee on 28 April 2023 and was published on the ICH website.  "
        },
        {
            "text": "A subgroup of members of the EWG was involved in preparing Annex 2 of the guideline.  MHRA did not participate in the drafting group, but have provided feedback during the production of the guidance.  "
        },
        {
            "text": "Annex 2 has now reached Step 2b and is available for public consultation."
        },
        {
            "text": "MHRA became a full regulatory member of ICH in May 2022, and whilst feedback on the ICH E6(R3) Annex 2 guidance can be provided via the ICH website, MHRA is consulting directly with UK stakeholders to compile and co-ordinate their comments to the EWG. I encourage you to provide your comments, in the consultation, this should be done by submitting your comments via an uploaded Excel® spreadsheet. Please note we have also asked a few questions to obtain UK stakeholder views on whether Annex 2 has realised the objectives set out in the concept paper for it."
        }
    ]
}