{
    "url": "https://digitaltrade.blog.gov.uk/2025/06/24/product-adoption-what-it-is-why-it-matters-and-how-to-improve-it/",
    "title": "Product Adoption - What it is, why it matters and how to improve it",
    "authors": [
        "Stephanie Chaytor, Head of Engagement and Strategic Adoption"
    ],
    "categories": [
        "Products"
    ],
    "pub_date": "2025-06-24T11:11:21+01:00",
    "content": [
        {
            "heading": 3,
            "text": "Stephanie Chaytor"
        },
        {
            "text": "Working in an engagement role within Digital Data and Technology (DDaT) at the Department for Business and Trade (DBT), every day I come up against a new work or concept that I do not understand. What is code? Where is the cloud? One of the best bits about this DDaT team is there is never any shame in asking 'what does that mean?!' "
        },
        {
            "text": "So, I am using this blog to explain the work of my own team and how we drive quality ‘product adoption’ as I often get asked what it is and why it matters."
        },
        {
            "text": "It's important that all colleagues across the department understand product adoption because it is something that everyone in the organisation has responsibility for at all grades and professions. It’s central to the success of a modern workforce."
        },
        {
            "text": "This blog will cover what product adoption is, why it matters and how organisations like ours might improve it. The focus of this blog will be on internal product adoption, and it is very much in the context of an organisation like DBT."
        },
        {
            "heading": 2,
            "text": "What is product adoption?"
        },
        {
            "text": "Product adoption is the process whereby colleagues start using a product or service. It usually follows these stages:"
        },
        {
            "text": "The faster and easier the adoption, the more successful the product becomes!"
        },
        {
            "heading": 2,
            "text": "Why does it matter?"
        },
        {
            "text": "Colleagues who are aware of the products available to them, interested in understanding how to use them and can see the value in using them (putting that to the test) will be more likely to adopt them in their work each day."
        },
        {
            "text": "This leads to better quality data and time saving. It helps avoid duplication, streamlines processes and drives a more joined up coordinated culture."
        },
        {
            "text": "As an example - one of our key internal products here at DBT is Data Hub. This is our central system for managing, tracking, understanding and building relationships with UK and international businesses. Relevant colleagues need to know that this tool exists; how to use it via training and guidance, understand where this information goes and how it’s used. They must also be encouraged to use the tool by their colleagues and senior leaders. Failure to do this might impact our ability to engage with businesses effectively and join the dots internally."
        },
        {
            "heading": 2,
            "text": "How DDaT teams can drive adoption"
        },
        {
            "text": "Teams can do this by:"
        },
        {
            "text": "However, it’s not just about what the quantitiave data is saying and it’s not as simple as how many users we have. We need to focus on quality adoption. That means ensuring that the right people in the department are using the right tools in the right way."
        },
        {
            "text": "We might want to measure a specific behaviour or feature usage within that.  Alternatively, we might want to target adoption in specific areas of the department.  For example, we could target business facing colleagues to adopt Data Hub or our business analysts to use Data Workspace (our reporting and analysis platform which provides access to key datasets, reports and dashboards)."
        },
        {
            "text": "We continuously gather feedback from users to understand their needs, challenges, and suggestions for improvement. Here at DBT we have user researchers who highlight these areas for product teams - identifying any pain points or blockers to usage. This feedback can be used (along with other metrics) to iterate on the product and make enhancements that address colleagues’ concerns.​"
        },
        {
            "heading": 2,
            "text": "How everyone can support adoption"
        },
        {
            "text": "Product adoption isn’t  something that only DDaT have responsibility for. To get maximum benefit teams across the organisation should focus on:"
        },
        {
            "heading": 2,
            "text": "Summary"
        },
        {
            "text": "Successful product adoption of internal digital tools and services will be one of the biggest factors impacting on how we evolve as an agile and productive workforce."
        },
        {
            "text": "By making sure colleagues are aware of these tools and know how to use them, that they see the value and that they’re being continually encouraged to use them, can the adoption be a success. Only with successful adoption can staff get the most value."
        },
        {
            "text": "DDaT teams have an important role in this. We need to learn from our user research and respond to feedback to make sure the tools are as relevant and easy to use as possible. However, there will always be tools that some colleagues are less keen to engage with but are essential to their job. Success relies on buy-in from teams across the organisation. It needs senior leaders to actively encourage buy-in from teams across the department. This will foster the right environment, leading by example and incentivising usage on an ongoing basis. "
        },
        {
            "text": "If you’re interested in finding out more, working with us or sharing ideas on how to improve adoption in your own department or team, you can reach us on: DDaT-News@businessandtrade.gov.uk."
        }
    ]
}