{
    "url": "https://gdsgeospatial.blog.gov.uk/2025/06/24/publication-of-principles-for-successful-delivery-of-data-sharing-initiatives/",
    "title": "Publication of principles for successful delivery of data sharing initiatives ",
    "authors": [
        "Dr Neil Brammall, NUAR Technical Product Owner"
    ],
    "categories": [
        "Technology"
    ],
    "pub_date": "2025-06-24T11:19:19+01:00",
    "content": [
        {
            "text": "How do you successfully deliver a data sharing initiative that delivers real value to users? Dr. Neil Brammall, Technical Advisor, and Issie Ferris, Policy Advisor, explain how collaboration with international partners has helped to formulate 15 principles that underpinned the delivery of the National Underground Asset Register (NUAR) and other initiatives. "
        },
        {
            "text": "As data-driven planning and decision-making becomes ever more crucial to governments and citizens around the world, making data available in a user-centred yet secure way is an increasingly common and global challenge. "
        },
        {
            "text": "The National Underground Asset Register (NUAR) is a digital service with a map of underground pipes and cables at its core, and part of broader efforts to strengthen and extend our digital and data public infrastructure. Its delivery typifies the challenges of secure data sharing based on user needs. "
        },
        {
            "text": "The Government Digital Service (GDS) team responsible for the delivery of NUAR has spent a great deal of time reflecting on the lessons learnt from all phases of the programme. These are lessons learnt from the things that went well and, more importantly, from the things that did not go well. "
        },
        {
            "text": "We have also learnt a great deal from collaboration with initiatives around the world that have gone before or run alongside NUAR. We have taken these lessons and formed them into 15 ‘principles’ for successful delivery, for data sharing programmes especially, but potentially for elements of any digital transformation programme. "
        },
        {
            "text": "We have shared and tested these principles with UK stakeholders, members of the delivery supply chain, cross-government teams and with international partners and stakeholders from around the world, contributing to a truly global set of principles built upon the learnings and shared experiences of colleagues from around the world. "
        },
        {
            "text": "The principles are split into three themes: "
        },
        {
            "text": "While these lessons provide learnings from the development of a specific project, they are applicable to organisations undertaking any manner of digital data projects, particularly targeted at public bodies and public-private supply chains, in the UK and abroad. We believe that they can provide useful, actionable insight and advice for those embarking on that data sharing journey. "
        },
        {
            "text": "We hope you’ve found this blog—and the principles we’ve formulated—both useful and thought-provoking. We’re excited to keep the conversation going and receive feedback, so feel free to reach out to us by email at geospatial@dsit.gov.uk "
        },
        {
            "text": "You can also sign up to get an email notification every time we publish a new blog post. More information about NUAR can be found on gov.uk or follow us on LinkedIn.  "
        }
    ]
}