{
    "url": "https://kingsawards.blog.gov.uk/2025/06/24/transreport-honoured-with-the-kings-award-for-enterprise-in-innovation/",
    "title": "Transreport Honoured with The King’s Award for Enterprise in Innovation",
    "authors": [
        "The Queen's Awards for Enterprise"
    ],
    "categories": [
        "Uncategorized"
    ],
    "pub_date": "2025-06-24T14:19:07+01:00",
    "content": [
        {
            "text": "Transreport has received the distinct honour of The King’s Award for Enterprise in the Innovation category – the UK’s most prestigious business accolade, championing outstanding achievement and impact. This recognition reflects Transreport’s commitment to creating inclusive technology solutions that make travel and everyday experiences accessible for all."
        },
        {
            "heading": 2,
            "text": "Discovering the King’s Award"
        },
        {
            "text": "The Transreport team first learned about The King’s Awards for Enterprise through its reputation as the gold standard for celebrating meaningful innovation and impact. Encouraged by their measurable success and growing global presence, Transreport felt inspired to apply for the award."
        },
        {
            "text": "With over 7 million assistance requests supported through their flagship technology, and more than 1 million users worldwide, Transreport’s vision to connect the world – by unlocking access to travel and experiences for Disabled and older people – continues to gain rapid momentum."
        },
        {
            "text": "Jay Shen, Founder and CEO of Transreport, notes, “Receiving this prestigious award not only showcases the real-world impact of our inclusive technology but also serves as a powerful call to action, highlighting the urgent need for greater accessibility and inclusion across industries.”"
        },
        {
            "text": "The application process provided a valuable moment for reflection, highlighting not only Transreport’s achievements to date but also the company’s ambitions for continued growth and positive social impact. The team focused on sharing quantifiable results and the broader societal value of their work."
        },
        {
            "text": "Jay offers some valuable advice for companies applying for the King’s Awards: “Start early, be specific about your impact, and answer the questions plainly. The strongest applications don’t rely on jargon – they show, clearly and confidently, how your work is making a real difference.”"
        },
        {
            "heading": 2,
            "text": "Celebrating with Purpose"
        },
        {
            "text": "Jay shares, \"We are exceptionally proud to have received the prestigious King’s Award for Enterprise in the Innovation category. This is an incredible recognition of Transreport’s commitment to creating a more connected world by designing inclusive technology solutions that make travel and experiences accessible for everyone.”"
        },
        {
            "text": "He reflects, “The idea behind Transreport was sparked by a conversation I had with a Disabled gentleman, who shared his experience of encountering barriers when travelling. That moment underscored the urgent need for change and deepened my commitment to developing technology that builds confidence and reduces anxiety when travelling. We’ve come a long way since then – and we’re only just getting started.”"
        },
        {
            "text": "The royal reception at Windsor Castle is a landmark milestone for Transreport, and will be followed by a personal award presentation ceremony with Mr Kevin McGrath OBE DL, the Lord-Lieutenant’s Representative Deputy Lieutenant for Hammersmith and Fulham, later this year."
        },
        {
            "text": "The Transreport team plans to honour this award through the ongoing impact of its technology on people’s everyday experiences. Building on this momentum, Transreport is pioneering the world’s first accessibility network – expanding into new sectors including tourism, hospitality, leisure and events to break down barriers for all and empower businesses to be more inclusive."
        },
        {
            "text": "The King’s Award will serve as a powerful platform to raise awareness of Transreport’s mission and encourage other organisations to prioritise inclusion. By sharing their success, the Transreport team hopes to inspire further innovation and collaboration to create a more accessible world for everyone."
        },
        {
            "text": "Jay highlights, “Receiving this award is a tremendous honour and a reflection of the hard work, dedication, and vision of our entire team. We remain committed to driving meaningful, inclusive innovation in the travel and transport sectors and beyond.\""
        },
        {
            "text": "Find out more about Transreport. "
        },
        {
            "text": "Apply for a King's Award for Enterprise. "
        }
    ]
}