{
    "url": "https://nationalscreening.blog.gov.uk/2025/06/24/uk-nsc-recommends-hpv-self-sampling-option-for-under-screened-women-in-cervical-screening-programme/",
    "title": "UK NSC recommends HPV self-sampling option for under-screened women in cervical screening programme",
    "authors": [
        "Carolina Martinelli"
    ],
    "categories": [
        "Cervical Screening",
        "UK National Screening Committee"
    ],
    "pub_date": "2025-06-24T07:29:33+01:00",
    "content": [
        {
            "text": "The UK National Screening Committee (UK NSC) has recommended that cervical screening providers in the 4 UK countries should be allowed to offer a self-sampling test option to women and other people with a cervix who never or rarely attend their routine cervical screening appointments."
        },
        {
            "text": "If the NHS determines that self-sampling might be a helpful addition to the programme, the HPV self-sampling option can be offered to these under-screened people. "
        },
        {
            "text": "The UK NSC made the recommendation at its March meeting following a review of the latest evidence and a 3-month public consultation."
        },
        {
            "text": "Participation in cervical screening has declined in recent years in the UK. Evidence suggests HPV self-sampling can be an effective and acceptable way to improve participation among people who never or rarely attend. It may also help to reduce health inequalities."
        },
        {
            "heading": 2,
            "text": "Choice of implementation approaches"
        },
        {
            "text": "Screening providers that offer the self-sampling option to the under-screened will be able to do so via:"
        },
        {
            "text": "The decision on which implementation approach to choose will depend on what is most feasible. Any other approaches should be supported by robust evidence and monitoring."
        },
        {
            "text": "People who are HPV positive will still need to go for a clinician-taken sample for cytology (an examination of cells from their cervix)."
        },
        {
            "text": "It is important to note at this stage that the UK NSC is only recommending the offer of a self-sampling option to the under-screened. Committee members agreed that this option is better than no test for those who currently do not attend their screening appointments."
        },
        {
            "text": "The UK NSC is organising further studies to find out whether self-sampling could be offered and used effectively across the whole population."
        },
        {
            "heading": 2,
            "text": "Read the full minutes"
        },
        {
            "text": "Other items discussed at the March UK NSC meeting included an update on the work to assess the evidence for screening for spinal muscular atrophy (SMA) and a presentation on the 26 submissions received under the committee’s 2024 call for new topics."
        },
        {
            "heading": 2,
            "text": "Keep up to date "
        },
        {
            "text": "The UK NSC blog provides up to date news from the UK NSC. You can register to receive updates direct to your inbox, so there is no need to keep checking for new articles. If you have any questions about this blog article, or about the work of the UK NSC, please email uknsc@dhsc.gov.uk. "
        }
    ]
}