{
    "url": "https://mhclgdigital.blog.gov.uk/2025/06/24/unlocking-innovation-in-planning-reflections-on-the-proptech-innovation-challenge/",
    "title": "Unlocking innovation in planning: Reflections on the PropTech Innovation Challenge ",
    "authors": [
        "Joanna Averley, Chief Planner, MHCLG"
    ],
    "categories": [
        "Artificial Intelligence",
        "Digital Planning",
        "PropTech",
        "Technology"
    ],
    "pub_date": "2025-06-24T08:59:31+01:00",
    "content": [
        {
            "text": "How do we bridge the gap between our ambitious housing targets and the complex realities of planning and development? "
        },
        {
            "text": "The answer may lie in the innovative solutions proposed through our PropTech Innovation Challenge – a powerful demonstration of how targeted innovation can help us tackle some of the most pressing challenges in the planning and housing sectors. "
        },
        {
            "text": "The 116 Expressions of Interest and 84 applications we have received, from start-ups to other innovators, reflect the sector’s real appetite for change."
        },
        {
            "text": "We're also thrilled to see that 225 partners have joined forces with the innovators – including small and medium enterprise (SME) developers, universities and local planning authorities – highlighting the readiness by all involved to co-create scalable solutions that can deliver real impact."
        },
        {
            "heading": 2,
            "text": "Addressing real-world challenges "
        },
        {
            "text": "The Challenge, which we’re running in collaboration with Geovation, from Ordnance Survey, has been designed around a set of carefully developed problem statements — each one grounded in extensive research and real-world challenges and opportunities across land ownership, small site delivery and infrastructure certainty. "
        },
        {
            "text": "You can find out more about the statements and the research that informed them in our previous blog post."
        },
        {
            "text": "These statements are not theoretical but directly address national priorities, including the government’s ambition to deliver 1.5 million homes by the end of this Parliament as part of the wider mission to kickstart economic growth.  "
        },
        {
            "text": "What's particularly significant is the overwhelming interest to our second problem statement— \"How might we increase the attractiveness of small sites for SME developers and other new market entrants through streamlining the processes involved in small site development?\" "
        },
        {
            "text": "This challenge question attracted over two thirds of the total applications – a clear signal that the market sees tremendous potential for small sites to play a big part of delivering 1.5 million homes. This interest directly aligns with the Deputy Prime Minister's announcement during Housing Week, in May, which highlighted this government’s focus on supporting small sites and SME delivery. The PropTech Innovation Challenge forms part of a comprehensive package of measures designed to empower SME housebuilders to build out smaller sites faster. "
        },
        {
            "text": "We are excited to see how technology and innovation can serve as crucial enablers in unlocking this potential. "
        },
        {
            "heading": 2,
            "text": "The innovative solutions"
        },
        {
            "text": "We've been truly impressed by the breadth and quality of solutions proposed. The applications range from artificial intelligence-powered platforms transforming land data accessibility and automating planning processes, to digital tools that de-risk investments for SME developers. Some solutions focus on leveraging data to identify viable sites quickly, while others promote the benefits of having the right infrastructure data to support early-stage feasibility studies and provide developers with greater certainty. The vast range of innovative ideas demonstrates how the sector is ready to embrace new tools and thinking and discover new ways of working to meet the needs of the future. "
        },
        {
            "text": "Equally important has been the spirit of collaboration that underpins this initiative. The co-design partnerships formed through the Challenge — between start-ups, local authorities, housing associations, academic institutions and developers of all sizes — are a testament to what’s possible when the public and private sectors come together with a shared purpose.  "
        },
        {
            "heading": 2,
            "text": "What’s next for the applicants? "
        },
        {
            "text": "Over the coming weeks, the applications will be carefully reviewed by an exceptional panel of judges from across central and local government – including MHCLG, the Environment Agency, HM Land Registry, Homes England, the Department for Business and Trade, the Government Digital Service, the Prime Minister’s office and local authorities – industry leaders including development corporations and the National Federation of Builders, infrastructure providers, universities and financial institutions like Nationwide. This unprecedented collaboration demonstrates how this Challenge is breaking down traditional silos to tackle shared challenges around infrastructure, delivery of small sites and land ownership.  "
        },
        {
            "text": "I look forward to following the next stages, as shortlisted teams will be invited to take part in a pitch-style bootcamp in mid-July with selected solutions announced in September.  "
        },
        {
            "text": "From there, selected companies and their partners will move forward to deliver scalable PropTech solutions that can transform how we approach housing delivery in support of the government’s ambitious housing targets. "
        }
    ]
}