{
    "url": "https://defraenvironment.blog.gov.uk/2024/04/02/biodiversity-net-gain-now-applies-to-small-developments/",
    "title": "Biodiversity net gain now applies to small developments",
    "authors": [
        "Katie Gowers"
    ],
    "categories": [
        "Biodiversity Net Gain",
        "Land Use"
    ],
    "pub_date": "2024-04-02T11:33:11+01:00",
    "content": [
        {
            "text": "Biodiversity net gain means that new developments will have to increase biodiversity compared to what was previously on site. It will provide nature-friendly developments that are good for residents, wider communities, and biodiversity."
        },
        {
            "text": "We’ve written about this policy previously on this blog, including outlining the benefits of biodiversity net gain."
        },
        {
            "text": "From today, 2 April, biodiversity net gain is mandatory for small developments."
        },
        {
            "text": "You can read the full definition of a small development. But essentially for residential development, it means a development with 9 houses or fewer, on less than 1 hectare of land."
        },
        {
            "text": "There are some exemptions to biodiversity net gain, so not all small developments will have this requirement."
        },
        {
            "text": "Biodiversity net gain has applied to major developments since February, and we are already seeing applications move through the planning process."
        },
        {
            "text": "The market for offsite biodiversity unit sites (locations for biodiversity gain outside of the development, if it’s not possible on-site) is developing. Sites are beginning to be made available on the Natural England register, meaning that they have all the necessary legal agreements in place to sell offsite units directly to developers or through online marketplaces."
        },
        {
            "text": "At Defra, we have been pleased to see a positive response to biodiversity net gain. All sectors recognise the long term benefits it will bring and are engaging with our guidance to learn about how the system works."
        },
        {
            "text": "That’s all you need to know, unless you’re a developer, architect or planner working on small development projects. If you fall under any of these groups, please read on to learn about more resources for small developments."
        },
        {
            "text": "If you are a developer, landscape architect or planner working on small development projects "
        },
        {
            "text": "The biodiversity net gain process is the same for small and major developments."
        },
        {
            "text": "We know that people involved with small developments want to deliver gains for nature just like major developments. So, we have provided extra resources to make it as easy as possible for everyone to meet their biodiversity net gain requirements."
        },
        {
            "text": "Firstly, there is a simplified version of the statutory biodiversity metric calculation tool, which calculates biodiversity value for biodiversity net gain. This is called the Small Sites Metric calculation tool (or SSM)."
        },
        {
            "text": "The SSM has been designed by experts. It makes some reasonable ecological assumptions, which means that an ecologist does not need to complete it."
        },
        {
            "text": "There is also a simplified version of the Habitat Management and Monitoring Plan Template available, which has been published by Natural England. This will help you provide the details of how you will be managing and monitoring your habitats over at least 30 years."
        },
        {
            "text": "You can find more guidance about biodiversity net gain and small development on GOV.UK, including:"
        },
        {
            "text": "Please subscribe to the blog to receive an email notification whenever we publish a new post. You can also filter all our blog posts by clicking 'Biodiversity Net Gain' under the main photo, to see posts related to just that subject."
        },
        {
            "text": " "
        },
        {
            "text": " "
        }
    ]
}