{
    "url": "https://dluhcdigital.blog.gov.uk/2024/04/02/future-councils-pilot-insights-common-challenges-to-digital-transformation-in-local-government/",
    "title": "Future Councils Pilot insights: Common challenges to digital transformation in local government",
    "authors": [
        "The Local Digital team"
    ],
    "categories": [
        "Future Councils",
        "Local Digital"
    ],
    "pub_date": "2024-04-02T15:42:29+01:00",
    "content": [
        {
            "text": "The aim of Future Councils was to understand the conditions required for councils to become modern and resilient."
        },
        {
            "text": "From March to October 2023, we worked closely with 8 pilot councils to identify the most common challenges that consistently block local government digital transformation work. In this blog post, we’re excited to share some of the key findings from our pilot report."
        },
        {
            "text": "The pilot enabled us to gain valuable insights into the challenges and opportunities for digital transformation in local government, and has shown we can be most effective where we lean into our position as a central government department. While Future Councils won’t continue in its current form, we are taking many learnings forward through our new stewardship approach."
        },
        {
            "heading": 2,
            "text": "Taking a whole-council approach"
        },
        {
            "text": "In the Local Digital Declaration we set out to “co-create the conditions for the next generation of local public services, where technology is an enabler rather than a barrier to service improvements”. Over the last 5 years, Local Digital has worked closely with councils aiming to turn this ambition into reality.  "
        },
        {
            "text": "However, we have also learned that improvements to one service do not necessarily drive digital transformation across a council; councils have told us of the importance of taking a broader approach that removes the barriers to change, if they are to meet the principles of the Local Digital Declaration. "
        },
        {
            "text": "Emily Sullivan, Head of Product at Local Digital"
        },
        {
            "text": "By engaging with 8 councils representative of the sector, the aim of the pilot was to understand:"
        },
        {
            "text": "Over 6 months, we worked with our pilot councils to define the common blockers they faced and the root causes underpinning these. This highlighted three key challenges that require collaboration among councils, central government, suppliers and other stakeholders to address:"
        },
        {
            "text": "We then held a series of roundtable discussions with 48 councils from across the sector to validate our findings and began looking at pathways for councils to overcome these issues at scale. "
        },
        {
            "text": "You can read more about the blockers and how we identified them in the pilot report."
        },
        {
            "heading": 2,
            "text": "The transformation lifecycle"
        },
        {
            "text": "In the final phase of the pilot, we sought to better understand each prioritised challenge and propose ways to overcome them at scale. This led us to organise our findings and recommendations around a central ‘digital transformation journey or lifecycle’. "
        },
        {
            "text": "The digital transformation lifecycle can be defined as a process that, largely, councils go through when trying to do something new. Therefore if you fix this, you improve digital transformation outcomes across most of the sector."
        },
        {
            "text": "The digital transformation lifecycle consists of 6 steps:"
        },
        {
            "text": "In order to modernise services, councils need to move through each step consistently. However currently councils are facing difficulties at every step of the lifecycle, whether this is struggling to have alignment across the organisation, making a strong business case or procuring the data or technology needed to be able to transform. "
        },
        {
            "text": "We introduced improvements to our service to reduce costs but it's difficult to understand the impact as we need access to data from other service areas, which is difficult to bring together. Services all measure different things based on their statutory requirements, but this doesn't tell us what the experience is like for people or how effectively we're meeting their needs. – Quote from a council worker "
        },
        {
            "text": "You can read more about the digital transformation lifecycle and case studies for each in the pilot report."
        },
        {
            "heading": 2,
            "text": "The impact"
        },
        {
            "text": "During the pilot, we explored how the challenges to digital transformation were manifesting in each pilot council and examined the impact through the lens of staff, service and residents. We identified a range of different costs including underutilised technology solutions, increased delivery cost and fragmented customer journeys which can result in poorer resident outcomes."
        },
        {
            "text": "Quote from a council worker"
        },
        {
            "text": "By addressing the systemic barriers, there is a huge opportunity to achieve sector-wide digital transformation quicker and at lower cost through sector-level collective action, rather than the same problems being tackled multiple times at an individual council level."
        },
        {
            "heading": 2,
            "text": "Generating solutions and next steps"
        },
        {
            "text": "Having understood the systemic barriers obstructing councils from becoming modern and resilient, we have now generated ideas for solutions."
        },
        {
            "text": "For the challenges that councils can address themselves, we found some immediate actions (see slide 86 of the report) that councils can take to increase momentum on a local scale. These include: "
        },
        {
            "text": "In many cases, these already build on work that is already underway within councils."
        },
        {
            "text": "Through working with the pilot councils, we have heard that there is a sector-wide need for guidance, and that councils look to DLUHC to provide this. In the short to medium term, we heard that councils would welcome more direction and support from central government, be that: scaling standards, how to better arrange governance or how to approach the market when procuring and so on."
        },
        {
            "text": "It will be important for Local Digital to work with the sector, to seek to understand where councils can address the challenges individually and collectively, where stakeholders may intervene and where DLUHC may convene and facilitate potential interventions. The long term ambition of Local Digital is to ensure the sector is mature and robust enough to guide itself, but for now there is a need for this additional support to unblock the sector."
        },
        {
            "text": "As outlined in our recent blog post, we are adapting our approach to take on a more strategic role as a ‘steward’, looking to bring the sector together to deliver modern digital services that enhance citizens’ lives. Reviewing our work to date and testing new approaches in Future Councils has shown that we can be most effective where we lean into our position as a central government department. By working in a more strategic role as a ‘steward’, we aim to bring the sector together to deliver modern digital services that enhance citizens’ lives. "
        },
        {
            "text": "We’ll be sharing more information on this shortly through our usual channels:"
        },
        {
            "heading": 2,
            "text": "And finally"
        },
        {
            "text": "A big thank you to our 8 pilot councils – without them we wouldn’t have been able to gain valuable insight into the challenges they are facing. We would also like to thank those who attended our roundtable sessions or shared feedback with us; this information was critical in validating our findings and shaping our priorities over the course of the Future Councils pilot. "
        }
    ]
}