{
    "url": "https://cyberandspecialistoperationscommand.blog.gov.uk/2024/04/02/hiking-weekend-air-cadets/",
    "title": "Hiking weekend for No2 Overseas Squadron (Gibraltar) Cadets",
    "authors": [
        "abievans"
    ],
    "categories": [
        "Uncategorized"
    ],
    "pub_date": "2024-04-02T13:41:37+01:00",
    "content": [
        {
            "text": "Thirteen cadets from the No 2 Overseas (Gibraltar) Squadron Air Training Corps spent a recent weekend hiking in Finca, La Alcaidesa, Spain."
        },
        {
            "text": "Equipped with heavy backpacks and hiking boots, the group, who were conducting their Bronze Duke of Edinburgh Award, split into two teams and began their walk."
        },
        {
            "text": "Filled with purposeful activities, outdoor navigation challenges, and unforgettable moments in nature, the cadets followed carefully planned routes which both groups had worked on before reaching the campsite."
        },
        {
            "text": "Once they reached their destination and had set up camp, they spent hours preparing the routes they would be taking the following morning & preplanning their qualifying camp which will take place later next month, taking into account lessons they learned during the day."
        },
        {
            "text": "After cooking and eating their evening meal, they settled down for the night, which for some was the first time they had ever been camping."
        },
        {
            "text": "On Sunday morning, they were up early, preparing breakfast and packing away their campsite, before they set off in good spirits towards their final goal."
        },
        {
            "text": "They arrived on time with the odd scratch and blister, which will soon fade but the memories will last a lifetime."
        },
        {
            "text": "Over the two days, the cadets displayed willpower, perseverance and excellent teamwork despite challenging terrain."
        },
        {
            "text": " "
        }
    ]
}