{
    "url": "https://stratcommand.blog.gov.uk/2024/04/02/rg-return-from-ex-jebel-tarik/",
    "title": "Royal Gibraltar Regiment return following successful EX JEBEL TARIK",
    "authors": [
        "abievans"
    ],
    "categories": [
        "Gibraltar",
        "Overseas Bases"
    ],
    "pub_date": "2024-04-02T13:50:14+01:00",
    "content": [
        {
            "text": "The Royal Gibraltar Regiment has concluded its annual firing camp, Ex Jebel Tarik, in the UK and is now returning to Gibraltar after a successful and productive training exercise."
        },
        {
            "text": "The Regiment's participation in Ex Jebel Tarik reaffirms its commitment to readiness, preparedness, and excellence in defence."
        },
        {
            "text": "From February 27 to March 28, the Royal Gibraltar Regiment engaged in intensive training, marksmanship drills, tactical exercises, and team-building activities as part of Ex Jebel Tarik."
        },
        {
            "text": "The firing camp provided an invaluable opportunity for the Regiment's personnel to enhance their skills, assess their capabilities, and strengthen camaraderie within the unit."
        },
        {
            "text": "Commanding Officer of the Royal Gibraltar Regiment, Lieutenant Colonel Matt Moore, expressed his pride in the performance and dedication of all personnel during Ex Jebel Tarik."
        },
        {
            "text": "He commended the Regiment for its professionalism, discipline, and commitment to achieving operational readiness and excellence."
        },
        {
            "text": "The successful completion of Ex Jebel Tarik underscores the Royal Gibraltar Regiment's ongoing commitment to maintaining a high state of readiness and operational effectiveness."
        },
        {
            "text": "The training and experiences gained during the firing camp will further enhance the Regiment's capabilities and preparedness to fulfil its mission in defence of Gibraltar."
        },
        {
            "text": "As the Royal Gibraltar Regiment returns to Gibraltar, the unit looks forward to applying the lessons learned and skills practiced during Ex Jebel Tarik to its ongoing operations and future training activities."
        },
        {
            "text": "The Regiment remains steadfast in its dedication to serving the community of Gibraltar and upholding its proud traditions of service and excellence."
        }
    ]
}