{
    "url": "https://environmentagency.blog.gov.uk/2024/04/02/the-environment-agencys-role-in-biodiversity-net-gain/",
    "title": "The Environment Agency’s role in Biodiversity Net Gain",
    "authors": [
        "Environment Agency"
    ],
    "categories": [
        "Climate change",
        "Environment Agency",
        "Sustainability"
    ],
    "pub_date": "2024-04-02T11:24:34+00:00",
    "content": [
        {
            "text": "Did you know there are more than 242,000km of watercourses in England? "
        },
        {
            "text": " Our rivers, lakes, ponds, estuaries, and wetlands cut across and connect many landscapes, providing natural corridors for wildlife and supporting a wealth of biodiversity. However, our nation’s wildlife and their habitats are under significant pressure. "
        },
        {
            "text": " On 12 February 2024, new legislation from the Department for Environment, Food & Rural Affairs (Defra) came into effect. This legislation requires the majority of major new planning developments to deliver biodiversity net gain (BNG) benefits. This will lead to positive outcomes for nature, better places for local communities and more consistent and transparent requirements for developers. "
        },
        {
            "text": " Additionally, from 2 April 2024, small developments that meet certain criteria must also deliver biodiversity net gain benefits. Further guidance is available online.  "
        },
        {
            "text": " What is Biodiversity Net Gain? "
        },
        {
            "text": " BNG ensures that development delivers an evidence based positive outcome (‘net gain’) for biodiversity with the creation, restoration and improvement of habitats and green spaces when building new housing, commercial or infrastructure developments, while requiring that habitat to be maintained for at least 30 years.   "
        },
        {
            "text": " BNG will help deliver much needed water improvements and help integrate green infrastructure into developments from the early planning stages. With only 16% of England’s water bodies being of good ecological status, BNG brings a greater recognition of watercourses for their biodiversity value, placing emphasis on investment and delivery of actions for nature recovery.  "
        },
        {
            "text": " BNG is mandatory under the Town and Country Planning Act 1990 and is calculated using the statutory biodiversity metric (or the small sites metric for small developments). This metric measures all types of habitats including aquatic, intertidal and coastal habitats. "
        },
        {
            "text": "The Environment Agency’s (EA) role in developing BNG  "
        },
        {
            "text": "Developing BNG policy and guidance has been a collaborative effort between DEFRA, Natural England, the Forestry Commission and ourselves at the Environment Agency, while also drawing on industry expertise.  "
        },
        {
            "text": "Alongside partners, we’ve used our technical expertise in the water environment to help design the policy and tools to enable BNG to clearly realise the opportunities associated with water. This allowed us to achieve a key ambition to reward the restoration of watercourses and their natural processes.   "
        },
        {
            "text": " We will continue to work both nationally and locally alongside Natural England and the Forestry Commission to ensure BNG becomes an effective delivery mechanism for nature recovery.  In addition, we are also supporting the development of Marine Net Gain,  a similar initiative covering marine habitats.  "
        },
        {
            "text": "How BNG influences our work  "
        },
        {
            "text": "BNG aligns with the Environment Agency’s three long term goals to have:   "
        },
        {
            "text": " The Environment Agency is well placed to support embedding BNG through its role as operator, developer, planning advisor and key contributor to Local Nature Recovery Strategies (LNRS). As an organisation, we will focus on the opportunities provided by BNG to protect and enhance the water environment, including river and wetland habitats.  "
        },
        {
            "text": " BNG requirements also need to be met where planning permission is required for the Environment Agency’s own developments. Our Flood and Coastal Erosion Risk Management Schemes are just one example of where we will be contributing significantly to BNG.  "
        },
        {
            "text": " It should be noted that the Environment Agency does not have a direct statutory duty in relation to BNG.  "
        },
        {
            "text": " Alan Lovell, Chair of the Environment Agency, welcomes the new legislation:  "
        },
        {
            "text": " “Biodiversity Net Gain will help to restore vital habitats, accelerate species recovery, and connect people with nature in their daily lives.  "
        },
        {
            "text": " \"Through our unique role as developers and advisors, we have helped design the policy and tools to enable BNG to clearly realise the opportunities associated with water. Nature brings all important benefits that can help us in our work creating climate resilient places and nature-based solutions that slow the flow are key to nature’s recovery and reducing flood risk. "
        },
        {
            "text": "   \"We have also invested in training to make sure we have the right skills and specialisms across the business to help local authorities and developers bring nature recovery into the heart of future development.”  "
        }
    ]
}