{
    "url": "https://moderncivilservice.blog.gov.uk/2024/04/02/what-the-heck-is-interoperability/",
    "title": "What the heck is 'Interoperability'?",
    "authors": [
        "Government Reform"
    ],
    "categories": [
        "A Modern Civil Service",
        "Ambitious",
        "Capability",
        "Digital and data",
        "Government Reform",
        "Interoperability",
        "Modernisation and Reform",
        "Operational Delivery",
        "Proud Civil Servant"
    ],
    "pub_date": "2024-04-02T14:43:13+01:00",
    "content": [
        {
            "text": "It's an odd word with a huge impact and a key part of building A Modern Civil Service. Interoperability means making it easier for different departments to work together, unlocking potential and getting rid of things that slow the job down."
        },
        {
            "text": "Effective information sharing is essential to keep Government services running smoothly, and interoperability is at the heart of this. But what exactly is interoperability, and how does it affect your day-to-day working and personal life?"
        },
        {
            "text": "Simply put, having the tools and systems in place to let us all talk to each other and share information quickly will make us a more efficient civil service. Individually, this means making daily working as friction-free as possible. "
        },
        {
            "text": "The interoperability portfolio has four elements that will help civil servants. These are:"
        },
        {
            "text": "Collectively, this portfolio will allow civil servants to:"
        },
        {
            "text": "One example of interoperability in action is how One IT has supported government organisations to align how they configure their Microsoft 365 tools. This can enable civil servants to collaborate consistently and securely with colleagues in other organisations. How is this relevant to interoperability? Well, this allows civil servants to:"
        },
        {
            "text": "To learn more about interoperability, you can visit the Interoperability page."
        }
    ]
}