{
    "url": "https://defrafarming.blog.gov.uk/2025/02/25/an-update-on-capital-grants-2/",
    "title": "An update on Capital Grants ",
    "authors": [
        "The Team"
    ],
    "categories": [
        "Farming and Countryside Programme",
        "Things we're doing"
    ],
    "pub_date": "2025-02-25T12:20:48+00:00",
    "content": [
        {
            "text": "Following the temporary closure of the Capital Grants scheme in November 2024, we’re pleased to share that we’ve secured sufficient funding for Capital Grants for 2025/26.  "
        },
        {
            "text": "This means we can now process the 4,040 completed Capital Grants applications that were on hold."
        },
        {
            "text": "If you haven't applied, we encourage you to submit an application through the Rural Payments service when the improved scheme re-opens later this year. "
        },
        {
            "text": "If you submitted an application and it was put on hold, you don’t need to do anything. Your application will be processed and, if approved, you’ll receive an agreement to complete your works as planned."
        },
        {
            "text": "The Rural Payments Agency (RPA) will be in touch once your application has been processed.  "
        },
        {
            "text": "If you didn’t complete your application before the temporary closure, you’ll be able to re-apply through the Rural Payments service later this year. "
        },
        {
            "text": "Once the scheme re-opens, guidance will be published on GOV.UK – we’ll blog again when it’s available.  "
        },
        {
            "heading": 2,
            "text": "Background "
        },
        {
            "text": "The Capital Grants scheme helps farmers and businesses by providing funding to cover part or all the cost of activities such as tree planting, buying equipment to improve air and water quality, or habitat restoration. "
        },
        {
            "text": "This makes it easier for farmers, foresters and land managers to increase biodiversity and improve the local environment.   "
        },
        {
            "text": "All items in the Capital Grants scheme focus on projects that help the environment, for example, planting hedges or improving natural flood management.  "
        },
        {
            "text": "The benefits often last for many years, helping to reduce pollution and improve air and water quality. "
        },
        {
            "heading": 2,
            "text": "Improvements to the Capital Grants scheme "
        },
        {
            "text": "The improvements we've made are to the management of the Capital Grants scheme. "
        },
        {
            "text": "It forms part of our overall approach to evolving and refining our offers over time. As we learn more about how different initiatives are delivering results and responding to the demand we receive, we adjust and improve what we provide.  "
        },
        {
            "text": "This ensures that farms and businesses continue to receive the support needed to achieve the best possible environmental outcomes. "
        },
        {
            "text": "The improvements we’ve made include controls to manage demand.  "
        },
        {
            "text": "Capital Grants will still support investments that improve water quality, air quality, natural flood management, restoring and improving boundaries and tree planting, but with a few tweaks:"
        },
        {
            "heading": 3,
            "text": "Spending caps "
        },
        {
            "text": " Last year we saw huge demand, with some applications worth over £1 million. This meant funds were used up quickly and many farmers missed out. The new controls aim to ensure smaller farms and high-priority projects get a fair chance. "
        },
        {
            "text": "Limits will be set on how much you can apply for in each of the 4 categories. The new limits will be: "
        },
        {
            "text": "The cap does not apply to capital plans.  "
        },
        {
            "text": "You can apply for a grant in more than one category but only one application per Single Business Identifier (SBI) can be submitted per year. "
        },
        {
            "text": "If you submitted an application and it was put on hold (and you’re eligible) the new caps will not apply to you. We will honour the offer as it was when you applied. "
        },
        {
            "heading": 3,
            "text": "Rolling application window "
        },
        {
            "text": "You'll be able to apply throughout the year and we’ll continue to monitor the situation to make sure demand doesn’t exceed the available funding.  "
        },
        {
            "text": "This will help ensure a fair process for everyone and that the funding goes to projects with better environmental outcomes. "
        },
        {
            "text": "By keeping track of applications, we can adjust if needed and ensure the scheme remains sustainable. "
        },
        {
            "heading": 2,
            "text": "Additional support and guidance "
        },
        {
            "text": "You can continue to apply for the following: "
        },
        {
            "text": "If you are an existing capital grant agreement holder, there is guidance to help manage your agreement effectively and meet its requirements. "
        },
        {
            "text": "For the latest from the Farming and Countryside Programme, subscribe to the Farming blog.  "
        }
    ]
}