{
    "url": "https://defrafarming.blog.gov.uk/2025/02/25/an-update-on-higher-level-stewardship-and-countryside-stewardship-higher-tier/",
    "title": "An update on Higher Level Stewardship and Countryside Stewardship Higher Tier ",
    "authors": [
        "The Team"
    ],
    "categories": [
        "Countryside Stewardship",
        "environmental land management schemes"
    ],
    "pub_date": "2025-02-25T12:52:46+00:00",
    "content": [
        {
            "text": "In this post, we provide an update on Higher Level Stewardship (HLS) and Countryside Stewardship Higher Tier (CSHT)."
        },
        {
            "text": "To better reflect the contributions made by those with HLS agreements and to support the continued protection and management of these sites, we’re increasing HLS payment rates."
        },
        {
            "text": "We’re also encouraging those considering applying for a CSHT agreement to familiarise themselves with the process to prepare.  "
        },
        {
            "text": "This follows Environment Secretary Steve Reed's speech at the NFU Conference this morning. "
        },
        {
            "heading": 2,
            "text": "Higher Level Stewardship  "
        },
        {
            "text": "HLS agreement-holders have led the way in environmental land management for years, protecting habitats, restoring landscapes, and boosting biodiversity."
        },
        {
            "text": "They play a vital role in managing important habitats and delivering environmental benefits, such as maintaining species-rich grasslands and moorland."
        },
        {
            "text": "To better reflect this contribution and to support the continued protection and management of these sites, we’re increasing payment rates across a range of the HLS options. "
        },
        {
            "text": "All HLS agreement holders will be eligible, but the change to payment rates will depend on the options contained in the actual agreement. Agreement holders will see an increase to the value of their agreements from the 2025 claim year. If you have an option with a payment rate that is increasing, the new rate will be paid as part of your usual claim payment from December 2025.  "
        },
        {
            "text": "We’ll publish a table showing the updated payment rates for each HLS option as soon as possible.  "
        },
        {
            "text": "We’ll also write to HLS agreement holders by April to explain the new rates and what they mean for them. "
        },
        {
            "heading": 2,
            "text": "Countryside Stewardship Higher Tier "
        },
        {
            "text": "Countryside Stewardship Higher Tier (CSHT) offers funding to farmers and land managers for managing land in ways that protect, restore, or enhance the environment, while also helping to mitigate the effects of climate change.  "
        },
        {
            "text": "The scheme can be applied to various types of land, including woodlands, farmed areas, and land managed for nature, or a combination of these. It also covers important environmental and historic sites, such as Sites of Special Scientific Interest (SSSIs), commons, woodlands, and scheduled monuments. "
        },
        {
            "text": "We are rolling out an improved CSHT scheme this year. We have started inviting farmers and land managers to begin the pre-application process. "
        },
        {
            "text": "Currently, access to the scheme is by invitation only as we continue to test the pre-application process. However, there will be opportunities for other farmers and land managers to access CSHT in the future."
        },
        {
            "text": "This is part of our ongoing commitment to ensuring more people can benefit from the scheme and support environmental improvements on their land.  "
        },
        {
            "text": "CSHT focuses on delivering ambitious and targeted environmental outcomes, which is why you need to work with Natural England and Forestry Commission advisers to develop your application. If you want to manage woodland through CSHT, you’ll need to complete a Woodland management plan as a first step.  "
        },
        {
            "text": "You must complete the pre-application process before making an application. This advice ensures that your application is well-prepared, meets the necessary requirements and has the best chance of success. It is an essential requirement towards being able to make an application later in the year. We recently blogged with an overview of the process and held a webinar.  "
        },
        {
            "text": "To ensure you get the most out of pre-application advice, you should consider what beneficial management you would like on your land and use the relevant scheme guidance on GOV.UK.  "
        },
        {
            "text": "If you are not able to enter CSHT straightaway, you can still take steps to prepare, including applying for capital grants to help you prepare plans to support a CSHT application. For example, grants are available for an implementation plan, woodland management plan, agroforestry plan, species management plan or a feasibility study, as well as a Moorland Mapping tool.   "
        },
        {
            "text": "We will confirm details on the further rollout of CSHT, including the next priority groups to be invited, in the summer. "
        },
        {
            "text": "The guidance on GOV.UK sets out what you can do now to prepare to apply and what funding will be available. "
        },
        {
            "text": "Colleagues at the Forestry Commission recently held a webinar for woodland applicants preparing for CSHT.  "
        },
        {
            "heading": 2,
            "text": "Subscribe to the Farming blog  "
        },
        {
            "text": "By subscribing to the Farming blog, you'll stay up to date with the latest developments from the Farming and Countryside Programme.  "
        },
        {
            "text": "As soon as we publish a new post, you’ll receive an email notification. "
        }
    ]
}