{
    "url": "https://defrafarming.blog.gov.uk/2025/02/25/coming-soon-grants-for-equipment-technology-and-innovation/",
    "title": "Coming soon: grants for equipment, technology and innovation",
    "authors": [
        "The Team"
    ],
    "categories": [
        "Payments for equipment, technology and infrastructure",
        "Payments for research and innovation"
    ],
    "pub_date": "2025-02-25T14:08:46+00:00",
    "content": [
        {
            "text": "Today, Steve Reed, Secretary of State for Environment, Food and Rural Affairs, announced new opportunities to apply for productivity grants in 2025. "
        },
        {
            "text": "Grants will be offered through: "
        },
        {
            "text": "In this post, we’ll give an overview. "
        },
        {
            "heading": 2,
            "text": "The Farming Equipment and Technology Fund (FETF) "
        },
        {
            "text": "FETF offers grants for equipment, technology and small infrastructure to boost productivity, improve slurry management and enhance animal health and welfare. "
        },
        {
            "text": "Over the past 3 rounds of FETF, farmers, growers, foresters and other contractors in England have received over £107 million to buy new equipment and technology. "
        },
        {
            "text": "This spring, we will launch one round of FETF. Grants of between £1,000 and £25,000 will be available. "
        },
        {
            "text": "In total, £30 million will be available for productivity and slurry and £16.7 million will be available for animal health and welfare."
        },
        {
            "text": "We’ll blog again and let you know when the guidance for this round is available on GOV.UK and when you can apply. "
        },
        {
            "heading": 2,
            "text": "The Farming Innovation Programme (FIP) "
        },
        {
            "text": "Through FIP, funding is available to farmers, growers and foresters who want to develop and use new, innovative methods and technologies.   "
        },
        {
            "text": "You'll be able to apply for grants through the following competitions: "
        },
        {
            "text": "We’ll blog again and let you know when the guidance for these competitions is available on the Farming Innovation Programme website and when you can apply. "
        },
        {
            "text": "Through FIP, we’ve invested £51.8 million to date, with an additional £98 million committed to ongoing projects advancing agri-technology research. "
        },
        {
            "text": "This funding has supported innovative trials, such as the use of semi-transparent solar panels in glasshouses and polytunnels. This allows sunlight to reach plants, enhancing growth and generates clean energy, contributing to sustainable farming practices.  "
        },
        {
            "text": "In addition, the funding has enabled research into the use of daffodil extract in cattle feed. This natural additive could help reduce methane emissions from cows, which would represent a significant step toward lowering methane emissions and the environmental impact of livestock farming.  "
        },
        {
            "text": "If you'd like to read some case studies, visit the Farming Innovation Programme."
        },
        {
            "heading": 2,
            "text": "Accelerating Development of Practices and Technologies Fund (ADOPT)  "
        },
        {
            "text": "ADOPT provides collaborative farmer-led, innovation grants, for farmers and farm businesses to trial new technology and methods on their farm. "
        },
        {
            "text": "These practical research projects will help to prove innovative ways of boosting farm productivity, food security and nature’s recovery across England.  "
        },
        {
            "text": "It will open for applications in spring 2025 and grants will be available to fund projects of between £50,000 to £100,000 in size. "
        },
        {
            "text": "To ensure farmers and growers can access ADOPT and the evidence generated effectively, we have established a bespoke Support Hub to support farmers in their application and encourage collaboration.  "
        },
        {
            "text": "The hub will be led by RSK ADAS with support from the UK Agri Tech Centre and Soil Association.   "
        },
        {
            "text": "Through the FIP and ADOPT competitions, we are making up to £63 million available starting in the 2025/26 financial year."
        },
        {
            "text": "We encourage farmers, foresters, growers, research organisations and others in the industry to consider these opportunities.  "
        },
        {
            "text": "We’ll post again and let you know when the guidance is available on the Innovation Funding Service website.  "
        },
        {
            "heading": 2,
            "text": "Subscribe to the Farming blog  "
        },
        {
            "text": "By subscribing to the Farming blog, you'll stay up to date with the latest developments from the Farming and Countryside Programme.  "
        },
        {
            "text": "As soon as we publish a new post, you’ll receive an email notification.  "
        }
    ]
}