{
    "url": "https://space.blog.gov.uk/2025/02/25/pioneering-projects-approach-conclusion-as-uk-australia-space-bridge-marks-anniversary/",
    "title": "Pioneering projects approach conclusion as UK-Australia Space Bridge marks anniversary ",
    "authors": [
        "UK Space Agency"
    ],
    "categories": [
        "International"
    ],
    "pub_date": "2025-02-25T10:02:52+00:00",
    "content": [
        {
            "text": "Since the framework was signed four years ago, the UK-Australia Space Bridge has unlocked many new opportunities for collaboration, innovation, and economic growth across both nations’ space sectors. Now, the partnership between the UK and Australia approaches a major new milestone as three ground-breaking projects under the UK Space Agency’s International Bilateral Fund (IBF) near completion."
        },
        {
            "text": "The IBF launched in 2023 to support collaborations between UK organisations and international partners on cutting-edge research and commercial ventures. Co-funded by the Australian Space Agency and UK Space Agency, with the Australian contribution amounting to up to AUD $3 million, the three IBF projects are focused on enhancing water quality monitoring, advancing autonomous agriculture, and improving space sustainability.  "
        },
        {
            "text": "All three projects demonstrate the tangible benefits of cross-border partnerships, strengthening space capabilities, and contributing to solutions with worldwide impact. They also exemplify what the Space Bridge was designed to do: bring together the best in science and technology across both countries to tackle global challenges through space. "
        },
        {
            "heading": 2,
            "text": "Co-funded Project Spotlights  "
        },
        {
            "text": "AquaWatch AUK: Advancing Water Quality Monitoring from Space "
        },
        {
            "text": "Led by Surrey Satellite Technology Ltd (SSTL), AquaWatch AUK is improving water quality monitoring by using Earth observation, in-situ data, and data modelling. Now in its second phase, the project is laying the groundwork for a mission to provide critical insights into coastal and inland water health. "
        },
        {
            "text": "Key achievements "
        },
        {
            "text": "Consortium partners SSTL (UK), CSIRO (Aus), Pixalytics Ltd (UK), STFC (UK), Assimila Ltd (UK), SmartSat CRC Ltd (Aus), Airbus Australia Pacific Limited (Aus), Cefas (UK), UKCEH (UK), and the University of Stirling (UK). "
        },
        {
            "text": "Vertical Future: Autonomous Agriculture for Space and Earth "
        },
        {
            "text": "This project is developing advanced imaging and sensor technology for remote monitoring of plant growth in controlled environments. Its outcomes will support astronaut health and nutrition on long-duration space missions in the future,  through the creation of robust system architecture, communications protocols, and processing. In addition, the project will help transfer lessons learned about sustainable agriculture in space back to Earth, by simplifying the pathway of data from in-space plant growth systems to agronomists on the ground. "
        },
        {
            "text": "Consortium partners Vertical Future (UK), University of Cambridge (UK), University of Adelaide (Aus), University of Western Australia (Aus), University of Southern Queensland (Aus), Axiom Space (USA), Saber Astronautics (Aus, USA), South Australian Space Industry Centre (Aus). "
        },
        {
            "text": "University of Strathclyde: AI for Space Sustainability "
        },
        {
            "text": "As space becomes more congested with satellites and other objects, there is a growing risk of collisions impacting everyday lives on Earth through the loss of vital services. By accelerating the adoption of AI technologies in space, such as the use of machine learning to help predict the motion of space objects, this project is paving the way for a safer space domain with reduced risk of collisions. It also sets the foundations for an international virtual institute dedicated to advancing AI in space sustainability. "
        },
        {
            "text": "Key achievements "
        },
        {
            "text": "Consortium Partners University of Strathclyde (UK), Massachusetts Institute of Technology (US), Columbiad (Canada), University of Arizona (US), University of Waterloo (Canada), GMV UK, LIFT ME OFF Ltd UK, The Alan Turing Institute (UK), Nominal Systems (Aus). "
        }
    ]
}