{
    "url": "https://educationhub.blog.gov.uk/2022/04/19/everything-you-need-to-know-about-primary-school-offer-day/",
    "title": "Everything you need to know about Primary School Offer Day",
    "authors": [
        "mediaofficer"
    ],
    "categories": [
        "Primary Schools"
    ],
    "pub_date": "2022-04-19T08:59:50+01:00",
    "content": [
        {
            "text": "On Tuesday 19 April, thousands of families received a primary school place offer for their child, kickstarting the beginning of their primary education journey."
        },
        {
            "heading": 3,
            "text": "Since 2010, primary schools have improved, making it more likely for parents to have a good school on their doorstep"
        },
        {
            "text": "Delivering good quality school places is a top priority. In 2021, 91.8% of families received an offer of a place at their first choice of primary school and 98.0% received an offer from one of their top three choices."
        },
        {
            "text": "At the same time, over 1 million additional school places have been created between May 2010 and May 2021, increasing school capacity."
        },
        {
            "heading": 3,
            "text": "Most families will have received an offer from one of their top choices, but parents can still appeal if they have been refused a place at a school they have applied for"
        },
        {
            "text": "If a parent wants to appeal, they should first contact the school’s admission authority. The school’s admission authority is responsible for establishing the appeal panel, but the panel itself is an independent body."
        },
        {
            "text": "The appeal panel must come to its own independent conclusion as to whether the school should admit the child, having regard to the case presented by both the admission authority and the parent."
        },
        {
            "text": "The decision of the appeal panel is binding – if the appeal is upheld, the admission authority must offer the child a place at the school."
        },
        {
            "text": "Admission authorities and appeal panels must comply with the statutory School Admission Appeals Code, which is available here."
        },
        {
            "heading": 3,
            "text": "The Free Schools Programme is providing extra school places in areas that need them most"
        },
        {
            "text": "Through the free schools programme this government has funded thousands of good new school places, many of which are in disadvantaged areas. Nearly 40% of free schools are open in the 30% most deprived areas in the country."
        },
        {
            "text": "Of the mainstream free schools approved since 2014, 86% have been in areas where there was a need for more school places and over 90% of mainstream primary free schools with an Ofsted inspection rating are good or outstanding."
        },
        {
            "text": "We will deliver further mainstream free schools in areas with the greatest need for more places, prioritising proposals in Education Investment Areas."
        }
    ]
}