{
    "url": "https://environmentagency.blog.gov.uk/2022/04/19/fishery-volunteer-invested-in-giving-back/",
    "title": "Fishery volunteer invested in giving back",
    "authors": [
        "Environment Agency"
    ],
    "categories": [
        "Uncategorized"
    ],
    "pub_date": "2022-04-19T07:24:30+00:00",
    "content": [
        {
            "text": "This week is National Volunteer Appreciation Week, and one volunteer who stood out to East Anglian fisheries officers is Phil Wood. Phil has given up copious amounts of his own time to benefit his local fishing community."
        },
        {
            "text": "I’ve volunteered at Leiston Youth and Community Angling Society (LYCAS) club for almost two years now and I lead the fundraising efforts for equipment and fishery improvements. I have also recently qualified, via the Angling Trust, as a licensed angling coach."
        },
        {
            "text": "Before I joined the club they only had one small fishing pond to service a large amount of members. Thankfully though, in January 2021 we found a disused irrigation pond and transformed it into something anglers could fish from. I funded this myself and it was developed specifically with young anglers in mind. We then went on to receive a grant from the Environment Agency and donations from local businesses to complete the project in time for our proposed first children’s fishing event, in Spring 2022."
        },
        {
            "text": "The support from the Environment Agency has been amazing, Fisheries Officer Andy Ward’s help and advice has been immeasurable. As well as the grant, we were also lucky enough to receive some crucians and tench stock from the Environment Agency’s fish farm at Calverton. These lovely fish will thrive in the more diverse depths of our new pond, which will allow us to hold coaching sessions for more challenging techniques in deeper water and longer distances."
        },
        {
            "text": "This work wouldn’t have been possible without the fantastic help of other LYCAS volunteers, who gave up hundreds of hours of their free time."
        },
        {
            "text": "Fishing has been very good to me and has probably saved my life at one time or another. So, my goal for retirement was to really give something back to fishing, LYCAS is the perfect way for me to do that."
        },
        {
            "text": "It's fantastic to see how far the young anglers have come in Leiston in just the two seasons I’ve been involved. We pride ourselves on our conservation work and commitment to diversity and inclusion and are proud to have a higher-than-average percentage of young girls, elderly, and disabled anglers. It's particularly rewarding to see how much our anglers living with a disability love fishing and come out of their shells when taking part. Just looking at the children’s and parents faces at our end of season presentation event makes all the hard work totally worthwhile."
        },
        {
            "text": "If I could give any advice to young people, or their parents, who are wondering whether to take up fishing it would be to try something new. There is so much more to immerse yourself in, we are often treated to some true spectacles of nature that the non-angler might not see, such as kingfishers, Dragon Flies, Deer etc."
        },
        {
            "text": "Why not give it a go?"
        },
        {
            "text": "Fisheries Officer Andy Ward added:"
        }
    ]
}