{
    "url": "https://ukhsa.blog.gov.uk/2023/06/29/noise-pollution-mapping-the-health-impacts-of-transportation-noise-in-england/",
    "title": "Noise pollution: mapping the health impacts of transportation noise in England",
    "authors": [
        "Blog Editor"
    ],
    "categories": [
        "Reducing the burden of disease"
    ],
    "pub_date": "2023-06-29T12:56:30+01:00",
    "content": [
        {
            "text": "Noise can have a significant impact on our health, beyond just being annoying or disturbing sleep. The UK Health Security Agency (UKHSA) has conducted a new study to better understand how noise can affect health and wellbeing. The research builds on long established evidence that living in an area with higher noise levels from traffic can lead to stress and sleep disturbance, and more recent research shows that this can lead to an increase in an individuals’ risk of developing more serious health problems such as heart disease or diabetes. In 2018, the World Health Organization also published noise guidelines to highlight these issues."
        },
        {
            "text": "Led by Dr Benjamin Fenech from UKHSA with Professor Anna Hansell of the University of Leicester and Prof. John Gulliver (now at St. George’s, University of London), the study is the first detailed assessment of its kind, assessing the health impact of transport noise in every local authority in England."
        },
        {
            "heading": 2,
            "text": "How can we measure the disease burden of noise?"
        },
        {
            "text": "To measure the impact of noise on health, the researchers used a standard internationally recognised metric called Disability Adjusted Life Years (DALYs). One DALY represents the loss of one year of good health."
        },
        {
            "text": "The team’s findings show that in 2018, around 100,000 DALYs were lost in England due to road traffic noise. A further 13,000 were lost from railway noise and 17,000 from aircraft noise. Most of these losses were due to chronic annoyance and sleep disturbance, followed by stroke, ischemic heart disease and diabetes."
        },
        {
            "text": "In studies like this, “noise annoyance” has a specific meaning: it refers to people who are very bothered or disturbed by noise over a long period of time. This can have a direct impact on their wellbeing and quality of life. It can also increase the risk of developing serious health problems like depression, anxiety, and heart disease."
        },
        {
            "heading": 2,
            "text": "Where is noise a problem for health?"
        },
        {
            "text": "The impact of noise on health varied across regions and local authority districts: these disparities can be attributed to variations in noise levels, population density and local disease burden."
        },
        {
            "text": "For example, London, the Southeast and Northwest regions had the highest number of DALYs lost from road-traffic noise. London also had the most DALYs attributable to aircraft noise. It’s important to note that these estimates may be conservative because the study only included roads with high traffic volumes and excluded people exposed to lower levels of traffic noise."
        },
        {
            "text": "The study found that 40% of all adults in England were exposed to long-term averaged road-traffic noise levels exceeding 50 decibels (dB), but the percentages varied across different areas. Health effects are more likely to be detected if people are exposed to noise levels exceeding 50 dB Lden, which is around the level of noise seen on a quiet street. Around 5% of the population in England experienced aircraft noise above 50 dB, with higher concentrations in and around London. Approximately 5% were exposed to railway noise exceeding 50 dB, with less variations across local authorities than for road and aircraft noise."
        },
        {
            "text": "As this is the first assessment of its kind in England, the study can be considered as a baseline on which future studies will be built. Comparing trends over the years both within England and between countries is difficult due to different approaches to noise measurement methods."
        },
        {
            "heading": 2,
            "text": "How can our research address the problem?"
        },
        {
            "text": "Many people still consider noise to be simply a nuisance, rather than a threat to public health. Our research adds to the growing body of evidence showing that major sources of noise such as road traffic, rail and aircraft noise contribute to a burden of disease across the population."
        },
        {
            "text": "Our study demonstrates the need to consider the health impacts of noise in the decision-making process for new transport infrastructure and urban planning, such as improved acoustic design of residential development. It also supports interventions to reduce noise exposure, within the existing transport infrastructure, such as quieter road surfaces, tyres and vehicles, smoother wheels and rails for trains, and appropriate design of flight paths. Measures to help reduce exposure to noise should help prevent harmful effects on our health."
        },
        {
            "text": "To find out more about the study and its findings, you can read the full report here."
        }
    ]
}