{
    "url": "https://socialworkwithadults.blog.gov.uk/2023/06/29/principal-social-workers-making-positive-changes/",
    "title": "Principal Social Workers making positive changes",
    "authors": [
        "Lyn Romeo",
        "Hannah Scaife"
    ],
    "categories": [
        "Care and support",
        "Co-production",
        "Knowledge and skills",
        "Our profession"
    ],
    "pub_date": "2023-06-29T14:48:24+00:00",
    "content": [
        {
            "heading": 2,
            "text": "Positive PSWs"
        },
        {
            "text": "It has been a privilege to be a Principal Social Worker (PSW) for adults and co-chair of the National Adult PSW Network, working to improve social work practice and making a positive impact on all those we support. Every day, we ask ourselves how we can better influence the profession and develop practice empowering those we serve."
        },
        {
            "text": "The roles and responsibilities of PSWs are to promote and embed the highest standards of social work practice across organisations. We do this by providing skilled, experienced leadership and practice knowledge to social workers and social care practitioners."
        },
        {
            "text": "We contribute to the strategic leadership of services, developing and implementing standards to provide a cohesive and high performing social work workforce, one that embraces cultural change and improves strength-based practice with our citizens."
        },
        {
            "text": "As a PSW, I feel I’m constantly ‘zooming in’ and ‘zooming out’ like a camera lens on different aspects of social work practice, but it’s always important to stay connected to people and the issues that matter to them."
        },
        {
            "heading": 2,
            "text": "Amanda's story"
        },
        {
            "text": "A case in point: I first met Amanda two years ago when she was unhappy with her initial experience of adult social care. We had an interesting conversation about her role as a carer, her hopes for the future and the state of social care. We also talked about activism and I explained there were opportunities for carers and people with lived experience to co-design the way we work."
        },
        {
            "text": "I then spent time with her newly qualified social worker, Abby, going through the guidance about working with carers and the therapeutic benefits of a Carers Assessment. Abby went to see Amanda and arranged a carers direct payment for her to undertake guitar lessons and art classes."
        },
        {
            "text": "A year later, I am part of an NIHR (National Institute of Health and Care Research) funded research project and Amanda is the chair of the Service User and Carers Advisory Group.  She co-produced a workshop with our evidence champion and researcher in residence about the importance of how social workers communicate during these assessments."
        },
        {
            "text": "In her training to staff, she spoke about how worried she was about being assessed, concerned her ability to care would be judged, that her home may not be viewed as clean or tidy enough, and a deep-seated fear this may result in her partner being placed in a care home."
        },
        {
            "text": "She explained the importance of the relationship Abby built with her, and how the support she received from her was invaluable. I hadn’t provided Amanda with this opportunity to be part of this advisory group, it had naturally evolved through her own connections, as her network, passion and confidence had expanded over the time since we first met."
        },
        {
            "heading": 2,
            "text": "Faith in ourselves and others"
        },
        {
            "text": "It's notoriously hard to measure impact. What starts with a small ripple can build to a big wave of change for many, including ourselves, as Jolaade Anjorin, who sits on the PSW Adult Network Chairing Team, explains:"
        },
        {
            "text": "For me, leadership is about creating the right conditions for individuals, communities and organisations to thrive, by creating safe spaces for people to learn, be creative and develop."
        },
        {
            "text": "Looking back over our first year as co-chairs, Sarah Range and I worked to create these conditions, not only for the PSW networks, but for each other as we developed as strategic leaders. It's been a privilege to build relationships with a new group of people and see them thrive and progress."
        },
        {
            "text": "During Carers Week, Amanda wrote a blog about the support she received from Abby and how being seen as a person rather than just a carer has positively impacted her life. She did this to raise the national profile of carers."
        },
        {
            "text": "Abby explained how the blog has helped her loved ones understand the work she does and has made her and them feel proud. She’s now planning to apply for an Advanced Social Worker role, having grown in both experience and confidence. Being part of her career development has been wonderful. It’s an amazing feeling to think I helped play a part in that journey as a Principal Social Worker."
        }
    ]
}