{
    "url": "https://defradigital.blog.gov.uk/2023/06/29/why-world-wellbeing-week-is-an-opportunity-for-us-all-to-celebrate-the-many-aspects-of-wellbeing/",
    "title": "Why World Wellbeing Week is an opportunity for us all to celebrate the many aspects of wellbeing",
    "authors": [
        "David Light",
        "Lucy Holland"
    ],
    "categories": [
        "Defra digital"
    ],
    "pub_date": "2023-06-29T07:00:42+01:00",
    "content": [
        {
            "text": "In World Wellbeing Week, David Light and Lucy Holland reflect on the importance of wellbeing, and highlight some of the joint activities which Defra and Atos, one of our key strategic suppliers, have undertaken in recent months."
        },
        {
            "text": "Wellbeing is the 'state of being comfortable, healthy or happy' and relates to how we feel in ourselves, how we feel about life and how we feel about what we are able to do. We all must make time to prioritise our physical and mental health and take responsibility for our own wellbeing as good wellbeing is fundamental to allowing us to achieve our full potential."
        },
        {
            "heading": 2,
            "text": "David Light, Defra Lead Supplier Manager:"
        },
        {
            "text": "“In Defra Digital Data and Technology the wellbeing of colleagues is an Executive Board priority, to the extent that we will soon be introducing our very own wellbeing charter. Having a charter will provide each of us with key principles that we can all align with, bringing together work life tips, pledges and new working practice principles which have been pioneered by some of our amazing people."
        },
        {
            "text": "“A charter, by itself, won’t improve things though. As individuals, we all have a role to play in ensuring our working practises follow principles aimed at maintaining a healthy work life balance."
        },
        {
            "text": "“In my working life I have always felt that there is more to work than just work.  I have enjoyed a number of activities outside of work with colleagues - from white-water rafting to karaoke, and off-shore sailing, or rounders at sports day, to name a few."
        },
        {
            "text": "“I have always found it so much more rewarding to spend time with colleagues outside of the work environment.  This melding of life outside work, with work, is a major contributing factor for me to my wellbeing."
        },
        {
            "text": "“During Covid such activities took a back seat, but in September 2021 we had an opportunity to take part in a team activity with Atos in one of Atos’ virtual expeditions.  Our aim was to collectively ‘travel’ across Europe to COP26 in Glasgow via a very circuitous route, by individually logging our physical activities over a period of weeks to complete the 2,050km journey. It was great working together with Defra and Atos colleagues, encouraging each other's contribution and celebrating the distance travelled.  It gave us all an incentive to get out and be active."
        },
        {
            "text": "“Last summer, I also had the chance to join Atos in a beach clean on Brighton beach.  I had watched a webinar about a previous clean and was inspired by the good deed, and the fun had by the people taking part."
        },
        {
            "text": "“Casually I told the team how much I had enjoyed the virtual event, and that is how I came to find myself on one of the hottest Fridays of the summer, weaving past sunbathers to pick up rubbish. As well as the fulfilment of helping to clean up the beach – and learning about the sort of rubbish you can find (all of which would be harmful to wildlife if ingested) - it was great just to spend some time with the Atos account team.”"
        },
        {
            "heading": 2,
            "text": "Lucy Holland, Responsible Business Lead, Defra ATOS team:"
        },
        {
            "text": "“Atos have been a strategic supplier to Defra for a number of years, and at the core of our relationship is a shared focus on creating a positive work environment where everyone is valued. Within Atos, we recently hosted a Wellbeing Week for the Eviden team which included several events such as yoga sessions, a panel discussion with senior leaders and a fun breakfast ‘cook-off’ event."
        },
        {
            "text": "“Initiatives like this are key to promoting the importance of wellbeing, and within our Atos Defra team, we have hosted a variety of similar initiatives with Defra colleagues to support wellbeing."
        },
        {
            "text": "“From hosting an annual Christmas quiz, to celebrating individual achievements through our ‘Star of the Month’ initiative, we foster a collaborative and fun place to work. As David has mentioned, last year we also took part in a beach clean hosted by the Atos Green Network and the Marine Conservation Society, utilising the volunteering days which both of our organisations offer to allow employees time to give back to the community.”"
        },
        {
            "text": "Here are a few of our tips for how you might improve your wellbeing at work:"
        }
    ]
}