{
    "url": "https://forestrycommission.blog.gov.uk/2023/06/29/why-is-landscape-design-so-important-to-woodland-creation/",
    "title": "Why is landscape design so important to woodland creation?",
    "authors": [
        "Robin Gray"
    ],
    "categories": [
        "Woodland creation"
    ],
    "pub_date": "2023-06-29T12:11:03+01:00",
    "content": [
        {
            "text": "Can you think of a country with the richness of landscape as England? No, I can’t either. From the majestic Lake District and their mountains, fells and meres to the downs with their patchwork of heath and woodland and their ancient trackways. So integral to our national identity is landscape that we could claim to have exported our English Landscape School,of which Capability Brown (the famous 18th Century English landscape gardener and artist) is the most famous, across the globe. Landscape not just defines nations but communities and individuals. Woodland enriches our landscapes in many ways alongside the range of ecosystem services that woodland and forestry provide to society."
        },
        {
            "heading": 2,
            "text": "Integrated woodland design: an efficient approach to UKFS compliance"
        },
        {
            "text": "With the drivers of climate change, biodiversity decline and timber supplies, there is an accelerating woodland creation programme in England and a focus on larger and grouping of schemes often across sensitive landscapes. As such the need to focus on woodland design has never been greater. We are fortunate to have had a long legacy of considering landscape in woodland creation going back at least fifty years to the seminal work of Dame Sylvia Crowe ,and those principles refined and broadened are clearly set out in the UK Forest Standard . Like many in the Forestry Commission, I was introduced to this through one of Simon Bell’s Woodland Design workshops back in 1997 and here I am today, twenty six years later delivering those workshops. The workshops set out how applying UKFS guidelines and requirements to a site (through the Landscape Character Appraisal produced by Richard Hellier and myself and featured within our Woodland Creation Planning Guide) helps to champion integrated woodland design."
        },
        {
            "text": "What do we mean by integrated woodland design? Woodland creation has many steps; identifying priority habitat, recognising historic environment and cultural assets and not least recognising the soil and moisture constraints of a site in a changing climate. We have seen how the discipline of considering landscape context at the outset and following this through to the site appraisal and woodland design concept has helped applicants inform their ideas. It really is the most efficient approach."
        },
        {
            "text": "For example, I worked closely with Anna Gugan , a landscape architect based with the University of Leeds on a woodland creation scheme within a 37 hectare site owned by the University on the edge of Leeds. The appraisal formed the basis for collating all the site information in a consistent way and communicating this both internally and to outside stakeholders including local residents."
        },
        {
            "heading": 2,
            "text": "Landscape does matter: How do residents engage with woodland creation?"
        },
        {
            "text": "Knowing how a scheme can be perceived by communities is really important to our work to sustain broad public support. We commissioned market research company Research Box in 2022 to recruit members of the public from various communities where woodland is a key element in the landscape or where woodland expansion is anticipated. Our report found that, unprompted, residents would express principles in UKFS without necessarily using our terminology. Interestingly, there were differences to be aware of between generations. Generally speaking, younger generations appeared to have embraced the need for action whilst older generations, not surprisingly, reflected on changes in the landscape. Perhaps that is obvious but it is worth considering."
        },
        {
            "text": "In looking at landscape change, psychologists have suggested that we revert to the landscapes of our childhood memories or youth as in some way to be idyllic. There is some evidence of this; interviewing older residents in East Anglia there was a sense of loss associated with the huge impact of Dutch Elm Disease and the removal of hedgerows from the landscape that was not felt by younger generations."
        },
        {
            "text": "We need to consider how we communicate woodland establishment as a ‘journey’. We know there can be a reaction to the infrastructure, shelters and fencing necessary for woodland creation. For example, the potential to introduce arable ‘weeds’ such as ragwort. This can be a ‘touchstone’ amongst the farming community. For some in that community it represents a ‘landscape that is unmanaged.’ We need to be mindful of that even if we do not always possess the tools to control it. For example, by considering ‘edges’ and ‘open space’ as integral to the on-going scheme."
        },
        {
            "heading": 2,
            "text": "An evolving agenda"
        },
        {
            "text": "Perceptions of landscape change over time. Just think of the arcadian landscape of the English School and contrast that with a more recent aspiration for ‘wilder landscapes’. When one of the National Parks recently posted an image suggesting it was an attractive landscape,it went viral – almost universally derided for showcasing a ‘sheep-wrecked desert devoid of trees and shrubs.’ Incorporating nature recovery objectives into schemes is one of the challenges that is informing our approach to guidance."
        },
        {
            "text": "We have sought to facilitate discussions through landcsape and woodland design workshops across the country. Working on a range of sites from estates in Yorkshire to the Shropshire Hills Area of Outstanding Natural Beauty, and from the urban fringe in Manchester to productive forestry in Northumberland, has highlighted how every landscape and every site is unique, with opportunities for woodland creation as a driver for wider landscape restoration whilst also recognising the real constraints to woodland creation."
        },
        {
            "text": "We work as teams in our workshops on design options drawing from our own staff and across the various stakeholders including agents, Natural England, National Trust and RSPB on each site. Of course, the landowner and/or farmer’s aspirations are the starting point for a design. We may consider the constraints and opportunities referencing ecology and the historic environment before considering options for woodland design and going deeper. For example, designing our network of open space, protection and operational demands are critical to an integrated design. This team-approach has led to some really engaging conversations between different stakeholders and hopefully a broader understanding."
        },
        {
            "text": "We have several more workshops planned over the coming months but we are always looking for those sites and venues that showcase a range of issues for training. Please get in touch with the Landscape & Woodland Design Advisors at landscape@forestrycommission.gov.uk if you can help."
        },
        {
            "text": "With the publication of guidelines on the government website we can reinforce UKFS principles and communicate them to stakeholders and a wider public through training, research and stakeholder engagement. In particular, we work closely with our colleagues in Natural England, protected landscapes and the Environment Agency to be consistent in our approach to landscape."
        }
    ]
}