{
    "url": "https://civilservice.blog.gov.uk/2025/07/10/heating-up-success-how-were-building-a-cleaner-greener-britain/",
    "title": "Heating Up Success: How we're building a Cleaner, Greener Britain",
    "authors": [
        "Sean Pitman"
    ],
    "categories": [
        "A great place to work",
        "A Modern Civil Service",
        "Uncategorized"
    ],
    "pub_date": "2025-07-10T15:52:49+00:00",
    "content": [
        {
            "text": "Sean Pitman, Senior Policy Advisor, Boiler Upgrade Scheme team at the Department for Energy Security and Net Zero, tells us how he and his team are building a cleaner, greener Britain."
        },
        {
            "text": "The moment I tell people I work on heat pumps, I usually get one of two reactions – either intense curiosity or a glazed expression! But what we're doing with the Boiler Upgrade Scheme (BUS) is genuinely transforming homes across England and Wales, with £7,500 grants to help cover the cost of installing low carbon heat pumps."
        },
        {
            "text": "I still get a buzz from our numbers. Since launching in April 2022, we've supported more than 50,000 installations across England and Wales, and since July, we've been inundated with 33,000+ more heat pump applications and paid out over 22,000 grants. Every morning I check our dashboard thinking, \"That's another street, another town moving towards clean power and net zero.\" "
        },
        {
            "text": "Our Warm and Fuzzy marketing campaign has been a revelation. I was in a taxi recently when the driver mentioned our ads, asking me loads of questions about heat pumps – we're definitely cutting through. Even at a recent family party, my proud relatives didn’t hold back, asking questions, which reminded me why this matters so much."
        },
        {
            "text": "What gives me the most joy is our team’s evolution. When I joined DESNZ four years ago, it felt quite London-centric. Now, we're a national team with brilliant colleagues in Salford and Darlington bringing fresh perspectives and giving more talented individuals opportunity across the country. "
        },
        {
            "text": "Emmerdale "
        },
        {
            "text": "Heat pumps even found their way onto TV’s popular Emmerdale in April, when new ‘resident’ in the village, Dr Liam Cavanagh, a GP and sustainability pioneer made the switch from a gas boiler to a heat pump. Our Campaigns team in the Communications Directorate got busy behind the scenes, working with Emmerdale and ITV to bring this story to life, tying in with the department’s ongoing ‘Warm and Fuzzy’ advertising campaign. "
        },
        {
            "text": "Our aim was to promote the Boiler Upgrade Scheme by connecting Emmerdale with a practical step watched by four million TV viewers, who might be unfamiliar with heat pump technology."
        },
        {
            "text": "So what have I learned? "
        },
        {
            "text": "Just by bringing policy closer to people, we’ve developed better solutions that truly meet local needs across Britain. The proof? Our heat pump scheme works because we understand the communities we serve."
        },
        {
            "text": "So next time someone glazes over when I mention heat pumps, I'll just smile and think of those 50,000 homes staying warm while helping keep our planet cool! I’m proud to be helping thousands more households transition to clean energy while supporting the Government’s Mission to become a clean energy superpower."
        },
        {
            "text": "This is part 1 of a four-part series marking 1 Year of Government showcasing the extraordinary work of civil servants delivering the Missions. "
        }
    ]
}