{
    "url": "https://moderncivilservice.blog.gov.uk/2025/07/10/join-a-profession-real-stories-of-cross-government-careers/",
    "title": "Join a profession: real stories of cross-government careers",
    "authors": [
        "Government Reform"
    ],
    "categories": [
        "A Modern Civil Service",
        "Capability",
        "Digital and data",
        "Government Reform",
        "Join a profession",
        "Policy",
        "Professional Networks",
        "Proud Civil Servant",
        "Skilled"
    ],
    "pub_date": "2025-07-10T15:35:18+01:00",
    "content": [
        {
            "text": "Government professions are important communities that unite civil servants with shared skills across departments. More than just networks, these professional groups support your learning, development and career progression, connecting you with like-minded colleagues, mentors and new areas of work. As part of Join a profession, our new initiative designed to help civil servants find their professional home, we’ve asked colleagues to share their career highlights. You can read more stories on our hub site."
        },
        {
            "heading": 2,
            "text": "Voices from government professions"
        },
        {
            "heading": 3,
            "text": "Government Risk Profession"
        },
        {
            "text": "“In 2022, I joined the Ministry of Defence as a Risk Analyst. Starting as a Risk Lead and progressing to a Senior Executive Officer role, I now lead on stakeholder engagement and support risk reporting across multiple areas of defence. This work allows me to contribute to the department’s strategic objectives and influence key decisions at the highest level. Continuous learning has been central to my progress – I’ve worked on major projects, including redefining principal risks, renewing risk postures after the latest Spending Review, and supporting a Defence Board risk appetite session."
        },
        {
            "text": "The Government Risk Profession has been a huge asset – its resources, tools, best practice and learning opportunities have supported my development at every stage. I completed the ‘Risk Management for Non-Risk Professionals’ course on Civil Service Learning to deepen my understanding of the Orange Book’s core principles. I’m also proud to be continuing my professional development, having recently gained the Institute of Risk Management’s International Certificate and continue working towards full accreditation. I regularly recommend the Induction Hub to colleagues as a starting point in the profession and completing the induction steps also gives you an Affiliate badge, which you can proudly display in your signature to demonstrate being part of the profession.”Anis Khaldoun, Risk Specialist, Ministry of Defence"
        },
        {
            "heading": 3,
            "text": "Property Profession"
        },
        {
            "text": "\"After joining the Property Profession, I completed the IWFM L6 Workplace Leadership, and it has given me the confidence to drive forward improvements in the standard of workplaces for HM Revenue & Customs. The accreditation has given me the confidence in my capability, and that it does really mean something to me.\""
        },
        {
            "text": "Rob Short CIWFM, User Experience Workplace Review Lead, HM Revenue & Customs"
        },
        {
            "heading": 3,
            "text": "Digital and Data Profession"
        },
        {
            "text": "\"Working in the Digital and Data Profession has given me a unique platform to drive transformative change across government. From leading cross-departmental digital strategies to delivering user-centred innovations during Brexit and the COVID-19 response, I’ve seen firsthand how our profession shapes outcomes that matter. What I value most is the culture of collaboration—bringing together diverse teams from policy, technology, and operations to deliver meaningful results. The profession's framework has helped me build capability in others while continuously evolving as a leader. It’s more than a job—it’s a purpose-driven community driving excellence at scale.\""
        },
        {
            "text": "Baljit Singh Rakhra, Head of Digital Delivery, Ministry of Housing, Communities & Local Government"
        },
        {
            "heading": 3,
            "text": "Policy Profession"
        },
        {
            "text": "“Networking within the Policy Profession has been central to my professional satisfaction, collaborating with international experts while mentoring students and early career professionals. These connections across academia and government have created a rich professional ecosystem that benefits my current role.”"
        },
        {
            "text": "Sarbani Banerjee, Senior Research Manager, Medr, Commission for Tertiary Education and Research"
        },
        {
            "heading": 3,
            "text": "Digital and Data Profession"
        },
        {
            "text": "“One of the best parts of being a part of the Digital and Data Profession is collaborating and connecting with like-minded colleagues across government so we can share best practice and offer support for common issues.''"
        },
        {
            "text": "Samantha Merrett, Senior Accessibility Specialist, Ministry of Justice"
        },
        {
            "heading": 3,
            "text": "Property Profession"
        },
        {
            "text": "\"The breadth of opportunities in the Property Profession is incredible, alongside a scale and complexity of work that you’ll struggle to find elsewhere. The profession acts as one large umbrella organisation, encouraging members to grow their careers and develop different skills in very different environments and property portfolios.\""
        },
        {
            "text": "Stuart Burrows, Head of Sustainability-Weybridge, Department for Environment Food and Rural Affairs"
        },
        {
            "text": "Join the many civil servants who are part of a professional network and grow your skills, progress your career and build your network. Join a profession today."
        }
    ]
}