{
    "url": "https://ipo.blog.gov.uk/2025/07/10/keeping-pets-safe-as-toxic-chemicals-are-found-in-counterfeit-flea-treatment/",
    "title": "Keeping pets safe as toxic chemicals are found in counterfeit flea treatment ",
    "authors": [
        "Imogen Percival"
    ],
    "categories": [
        "Enforcement"
    ],
    "pub_date": "2025-07-10T14:31:07+01:00",
    "content": [
        {
            "text": "We’re a nation of animal lovers, going to great lengths to keep our pets healthy and happy. From maintaining a quality diet to keeping medication and vaccinations up to date, a lot of care, love and money goes into their health. "
        },
        {
            "text": "There’s an underlying threat behind this care that many pet owners aren’t aware of – intellectual property (IP) infringing counterfeit medicines that can cause serious harm and even death."
        },
        {
            "text": "Earlier this year, Alan Wall from Preston purchased online what he thought was genuine Frontline Spot On flea treatment for his cat, Smokey. Alan was devasted when Smokey became very unwell. The condition was so severe that Smokey required emergency intestinal surgery to survive. This was followed by a week-long stay at the veterinary surgery and significant bills to support his recovery. "
        },
        {
            "text": "Alan urges other pet owners to be wary of these fake products so that no one else goes through what he and his family have. "
        },
        {
            "text": "Recognising the serious impact these products could have on our beloved pets, we worked closely with an extended network of stakeholders to raise public awareness of these issues. These efforts are a part of our wider aim to reduce demand for counterfeit goods and help consumers understand the harms of IP crime, as outlined in our Counter-Infringement Strategy 2022-27. "
        },
        {
            "heading": 3,
            "text": "The truth behind counterfeit flea treatment"
        },
        {
            "text": "Trade marks such as the one Boehringer Ingelheim holds for Frontline, establish brand recognition and credibility, reassuring the consumer that they are buying a genuine product.  "
        },
        {
            "text": "After assessment by the rights owner, Boehringer Ingelheim, the product was confirmed as counterfeit. The packaging itself contained flaws. Notably, the label used ‘GATTI’ (Italian for cats) instead of the English ‘CAT’, alongside multiple spelling errors - common indicators of counterfeit products.  "
        },
        {
            "text": "Further testing of the product by the University of Bath confirmed the presence of Pirimiphos-methyl, a dangerous insecticide toxic to cats."
        },
        {
            "text": "Further testing of the product by the University of Bath confirmed the presence of Pirimiphos-methyl, a dangerous insecticide toxic to cats. "
        },
        {
            "text": "The Veterinary Medicines Directorate, the authority responsible for veterinary medicines regulation in the UK, confirmed the potential impact of this substance."
        },
        {
            "text": "A Veterinary Medicines Directorate Veterinary Surgeon and Efficacy Assessor, Dr Heilin-Anne Leonard-Pugh, explains: "
        },
        {
            "text": "Sue Horseman, from Bristol also purchased what was later confirmed to be counterfeit flea treatment online. Sue explained she immediately became suspicious when she opened the packaging and detected a strong smell of white spirit and paraffin. "
        },
        {
            "heading": 3,
            "text": "Uniting new stakeholders"
        },
        {
            "text": "When we were first presented with this issue, we recognised the serious potential impact of these products and worked to unite an extended network of stakeholders to raise public awareness of these products. "
        },
        {
            "text": "These partners helped us build our evidence and provided veterinary expertise.  "
        },
        {
            "text": "This collaborative effort has been key to understanding the serious threat that counterfeit pet medication can pose to pet owners and to raising public awareness of these products. "
        },
        {
            "heading": 3,
            "text": "Protection for pet medicines"
        },
        {
            "text": "Counterfeit pet medicines deliberately mimic the appearance and packaging of genuine products to deceive consumers. These fakes typically lack the proper active ingredients, making them ineffective at best. At worst, they contain harmful substances that can cause severe reactions in our pets. "
        },
        {
            "text": "All veterinary medicines sold in the UK must be authorised. This ensures they are safe and effective for specific animals. "
        },
        {
            "text": "Consumers can check if the medicine they are buying is authorised in the UK by searching the VMD’s Product Information Database. "
        },
        {
            "text": "These medications are also protected by trade marks, offering protection for the brand and trust that consumers are getting a safe and tested product. Common pet medication brands have diligently protected their brands with a range of trade marks covering their range of products. Class 5, ‘Insecticides and antiparasitic preparations for veterinary purposes’ covers products like flea treatments. "
        },
        {
            "heading": 3,
            "text": "Warning signs of fake medicines"
        },
        {
            "text": "Pet owners should check the packaging and always be cautious of third-party sellers when shopping on e-commerce sites for any type of pet medication. Look out for: "
        },
        {
            "heading": 3,
            "text": "Staying safe when buying pet medicines"
        },
        {
            "text": "To ensure they're buying genuine pet medications, pet owners are advised to purchase from trusted sources such as veterinary practices or registered pharmacies and retailers. "
        },
        {
            "heading": 3,
            "text": "What to do if your pet is affected"
        },
        {
            "text": "If it’s suspected that a pet has been exposed to a counterfeit medicine, consumers are recommended to seek veterinary advice immediately. The sooner pets receive treatment, the better their chances of recovery. "
        },
        {
            "text": "We’re urging consumers to contact local Trading Standards or Crimestoppers  if they see these goods being offered for sale, whether on a website, social media post or on the high street.  "
        },
        {
            "text": "For our beloved pets like Smokey, the difference between a genuine product and a fake could literally be life or death. By understanding the importance of intellectual property rights and making informed choices when purchasing pet medications, we can help protect our furry family members from these dangerous counterfeits. "
        },
        {
            "heading": 3,
            "text": "Our message remains as always: remember, if a deal seems too good to be true, it probably is. "
        }
    ]
}