{
    "url": "https://cspl.blog.gov.uk/2025/07/10/reflections-on-the-30th-anniversary-of-the-nolan-principles-by-harry-rich-registrar-of-consultant-lobbyists/",
    "title": "Reflections on the 30th anniversary of the Nolan Principles by Harry Rich, Registrar of Consultant Lobbyists",
    "authors": [
        "Harry Rich"
    ],
    "categories": [
        "30th Anniversary",
        "Lobbying"
    ],
    "pub_date": "2025-07-10T17:12:28+01:00",
    "content": [
        {
            "text": "Lobbying Transparency"
        },
        {
            "text": "In 2014, Parliament created the role of Registrar of Consultant Lobbyists to help the public see who is lobbying ministers and Permanent Secretaries on behalf of paying clients. Under the law, it is consultant lobbyists, not ministers, who must declare their lobbying activity. Because lobbyists aren’t public servants, the Nolan Principles of Public Life don’t apply to them directly."
        },
        {
            "text": "Yet the Nolan Principles are central to lobbying transparency."
        },
        {
            "text": "The Nolan Principles at the heart of my work"
        },
        {
            "text": "As Registrar, I am a public office holder, operating independently of both government and lobbyists. This independence ensures that registration and enforcement decisions are fair, impartial, and based on evidence and the law. The Register itself is a tool for openness, and I support this by publishing guidance, decisions, and information about my own meetings and correspondence."
        },
        {
            "text": "Shaping guidance through the lens of integrity"
        },
        {
            "text": "The Registrar provides formal guidance on how the 2014 Act works in practice. The Act sets the boundaries and starting point, but the transparency goals of the legislation and the Principles of Public Life are essential guides as I draft and update guidance. For example, I expect (voluntary) codes of conduct for consultant lobbyists to recognise their responsibilities to the people they lobby and to include an independent complaints process for anyone to use."
        },
        {
            "text": "Transparency is a shared responsibility"
        },
        {
            "text": "Lobbying transparency is often viewed as something for lobbyists alone. In reality, it is a two-sided coin:"
        },
        {
            "text": "Ministerial transparency is critical, particularly since in-house lobbying is not captured by the Register and is only visible through departmental disclosures. The Nolan Principles remind ministers of their duty to demonstrate integrity, openness, honesty, leadership, and accountability in how they receive lobbying."
        },
        {
            "text": "Departmental transparency data needs to improve"
        },
        {
            "text": "Currently, departmental transparency data is incomplete, often late, and published only quarterly. A disclosure stating that a minister met an energy company to discuss “energy” six months after the event does not meaningfully advance transparency. The House of Commons Public Administration and Constitutional Affairs Committee (PACAC) has recommended monthly publication on a central database with standardised, meaningful information. Implementing this would enhance transparency, strengthen public trust and align with the Nolan Principles."
        },
        {
            "text": "Towards transparent and effective policy making"
        },
        {
            "text": "Transparent, ethical lobbying can contribute to informed and effective public policy. The 2014 Act and the work of my Office help by placing consultant lobbying in the public domain. But integrity and objectivity demand that ministers and policymakers seek out diverse voices, not just those of the most organised or well-funded. Too often, it is unclear whether ministers have the rounded view necessary for good decision-making."
        },
        {
            "text": "Lobbying transparency requires both sides, lobbyists and ministers, to play their part. That way the public can have confidence that policy decisions are made fairly, openly and in the public interest."
        }
    ]
}