{
    "url": "https://governmentscienceandengineering.blog.gov.uk/2025/07/10/women-in-space-and-the-power-of-job-sharing/",
    "title": "Women in space and the power of job-sharing ",
    "authors": [
        "gseprofession"
    ],
    "categories": [
        "Blog Series",
        "Engineering",
        "Our People & Deep Dives",
        "Science"
    ],
    "pub_date": "2025-07-10T09:41:39+01:00",
    "content": [
        {
            "text": "by Tania Celani and Miriam Grigg, Department for Science, Innovation and Technology"
        },
        {
            "text": "Last year on 22 November, Emily Calandrelli became the 100th woman to fly to space. We can’t claim to have been into space ourselves (perhaps except using VR), but we have been job-sharing as Deputy Directors in DSIT’s Space Directorate since January 2022.  "
        },
        {
            "text": "We love being part of an inspiring and boundary-pushing policy area to address the complex geopolitical and technological issues of tomorrow. We have a fantastic team and partner with the UK Space Agency, other departments, and industry and international stakeholders to drive economic growth and protect national security through space.  "
        },
        {
            "text": " We are passionate that diversity and inclusion are core to our organisation's culture. We are Space D&I and DSIT flexible working champions and set up the BEIS job-sharing network to help those interested in trying this innovative flexible working model. Last year, we were delighted to support the UN Gender Mainstreaming Toolkit for space.  "
        },
        {
            "text": "For anyone who has ever wondered about job-sharing, there are some fundamental benefits to it. These include overcoming the loneliness of leadership, having two brains to find creative solutions to thorny problems, knowing that the whole week is covered to better balance work and family commitments, and bringing complementary strengths to have more impact together. These in turn benefit the business which leads to higher productivity and innovation, a chance to draw from a wider talent pool, and improves diversity across grades.  "
        },
        {
            "text": "Even though the sector - like many in STEM - has a long way to go on diversity, it boasts of and rightly celebrates many inspiring women; whether working as CEOs, engineers, diplomats, or astronauts. With opportunities and expertise of this scale, we are excited to see how these women - and the next generation - shape the future of space.   "
        }
    ]
}