{
    "url": "https://governmentscienceandengineering.blog.gov.uk/2025/10/20/applications-are-open-for-the-royal-society-pairing-scheme-2/",
    "title": "Applications are open for the Royal Society Pairing Scheme  ",
    "authors": [
        "gseprofession"
    ],
    "categories": [
        "Collaborating & Networking",
        "GSE Opportunities",
        "Learning & Development"
    ],
    "pub_date": "2025-10-20T15:29:43+01:00",
    "content": [
        {
            "heading": 2,
            "text": "Civil Service applications are now open until Friday 21 November 2025"
        },
        {
            "text": "What is the Royal Society Pairing Scheme? "
        },
        {
            "text": "The Royal Society Pairing Scheme is a well-established collaboration between the Government Science & Engineering (GSE) Profession and The Royal Society. Each year, 30 research scientists and engineers are matched with UK parliamentarians and civil servants for a week-long programme. The scheme aims to upskill policy makers on how best to work with scientists outside of government and how to engage with academia more broadly.  "
        },
        {
            "text": "In 2026, the scheme will run from Monday 16 March to Thursday 19 March. "
        },
        {
            "text": "The scheme is supported by the Head of GSE, and the Government Chief Scientific Adviser, Professor Dame Angela McLean:  "
        },
        {
            "text": "What is involved?"
        },
        {
            "text": "During the programme, participants will get the opportunity to attend collaborative workshops, a parliamentary reception, and other events. Scientists will shadow civil servants for two days to gain insight into government work, while civil servants will also visit the scientists’ institutions to better understand research environments."
        },
        {
            "text": "Why  get involved?"
        },
        {
            "text": "It is a unique opportunity for civil servants to collaborate with leading UK scientists and strengthen evidence-based policy making."
        },
        {
            "text": "You will:"
        },
        {
            "text": "Former participant Rodolfo Barradas, shares his thoughts on the experience: "
        },
        {
            "text": "Who can apply?"
        },
        {
            "text": "The Royal Society Pairing scheme is aimed at a wide range of career stages, and civil servants are matched to scientists based on their expertise, interest and career stage."
        },
        {
            "text": "Royal Society scientists are matched with engaging civil servants who work in a policy area that matches one of the scientists' fields of study."
        },
        {
            "text": "To be eligible for the scheme you must: "
        },
        {
            "text": "Please note: If you do not have access to a London office, please contact the GSE Profession Team for support in arranging a suitable working location. Additionally, if you are an HEO and believe the scheme would be a good fit for you, please contact us."
        },
        {
            "text": "Apply now"
        },
        {
            "text": "Key dates "
        },
        {
            "text": "If you’re interested in applying, please fill out the application form. If you would like more information on the scheme, please contact gse@go-science.gov.uk."
        }
    ]
}