{
    "url": "https://defrafmp.blog.gov.uk/2025/10/20/dive-into-fmps-engaging-with-stakeholders-groups-and-forums/",
    "title": "Dive into FMPs: engaging with stakeholders, groups and forums",
    "authors": [
        "FMP Comms Team",
        "FMP Policy Team"
    ],
    "categories": [
        "- Defra led FMPs"
    ],
    "pub_date": "2025-10-20T10:34:43+01:00",
    "content": [
        {
            "text": "As we move forward with our Fisheries Management Plans (FMP), we want to make it easier for you to see how everything comes together. "
        },
        {
            "text": "This is the final post in a three-part series to dive into FMPs. Part one looked at governance and part two looked at our partners and experts."
        },
        {
            "text": "In this post, we’ll look at how and when we engage and how you can get involved. "
        },
        {
            "text": "We'll also explore some of the groups and forums that we work with to bring in stakeholder knowledge and experience."
        },
        {
            "text": "Whether you’re a part of the fishing industry and its associated sectors (which includes both commercial and recreational activities), a scientist or environmental non-governmental organisation (eNGO) or are simply interested in fisheries management, this post will help you see the best ways to engage."
        },
        {
            "heading": 2,
            "text": "What is engagement? "
        },
        {
            "text": "Engagement is “to actively involve and build relationships with individuals or groups who can affect or are affected by a project decision or initiative”. "
        },
        {
            "heading": 2,
            "text": "How we engage "
        },
        {
            "text": "FMPs mark a shift in how fisheries are managed. The Joint Fisheries Statement (JFS) puts emphasis on involving stakeholders through participation and collaboration.  "
        },
        {
            "text": "Different stages of FMP delivery require different approaches- from drafting, scientific input, communications, implementation of measures and more.  "
        },
        {
            "text": "The way we engage can vary by fishery or region, drawing on social, economic, and environmental knowledge from different places.  Engagement can include informing, consulting, involving, and collaborating.  "
        },
        {
            "heading": 2,
            "text": "Let’s dive into how and when stakeholders are involved in FMPs"
        },
        {
            "text": "A wide and complex network of individuals and organisations are involved in fisheries across the UK, with different knowledge and perspectives to bring forward. The first six FMPs paved the way, trialling different ways of working. Through evaluation of these, we learnt what works well, or where improvements are needed - which are continually being made. "
        },
        {
            "text": " Some of the ways we engage are through: "
        },
        {
            "text": "• Meetings- Defra and delivery partners (that you met in the last post in this series) meet with specific individuals or groups to work on proposals, gather information and keep them updated.• Public engagement- in-person and online events, often hosted by delivery partners, to reach stakeholders who may not be in groups or formally represented.• Communications- Defra and partners communicate directly and on public facing channels such as GOV.UK, social media and the blog you’re on now- which was developed in response to stakeholder requests for more transparency on FMP work."
        },
        {
            "text": "Engagement happens at different stages of FMP delivery: developing drafts, public consultation and implementation. See the FMP stages in an earlier post: What are FMPs and how are they prepared. "
        },
        {
            "heading": 2,
            "text": "Now, let’s look at the different groups that contribute to FMPs"
        },
        {
            "heading": 3,
            "text": "FMP led groups "
        },
        {
            "text": "Defra or their delivery partners set up groups to support the development of some FMPs. They brought together stakeholders to collaborate, share knowledge and ideas, and to help shape the goals and proposals.  Membership varies, but can include commercial and recreational fishermen, scientists, and environmentalists. "
        },
        {
            "text": "Once a plan is published, these groups may close or continue. Members may move into other groups or form new ones to support implementation- which includes putting the FMP into action and to help meet its goals."
        },
        {
            "text": "Some of the active groups have been set up following the publication of FMPs and have members from many sectors: "
        },
        {
            "text": "The bass and king scallop groups are chaired by Defra you’ll find links to their details on the new FMP directory."
        },
        {
            "text": "The crab and lobster and whelk groups are chaired by Seafish."
        },
        {
            "heading": 2,
            "text": "Established groups and forums "
        },
        {
            "text": "FMP teams also work with other groups and forums. By working with them, we aim to reduce the number of meetings stakeholders have to consider attending."
        },
        {
            "text": "They may be established by organisations or stakeholders for a specific sector or fishery and can be national, or local. These groups can also interact and overlap. "
        },
        {
            "text": "They engage with members of that fishery, ensuring that local knowledge and needs are integrated into the FMPs."
        },
        {
            "text": "One group in particular that FMPs have partnered with is the Regional Fisheries Groups (RFGs). They work closely with the inshore sector which includes commercial, recreational and associated sectors."
        },
        {
            "text": "We also work closely with several non-FMP led groups that are coordinated by other bodies such as Seafish who lead the Finfish Advisory Group (FIAG), Shellfish Industry Advisory Group (SIAG) and sub-groups, the Crab and Lobster Management Group and the Whelk Management Group. You’ll find links to their details on the new FMP directory."
        },
        {
            "text": "FMP teams also engage with a range of groups including the Recreational Sea Fishing Forum, Angling Trust, eNGOs, UK Association of Fish Producer Organisations (UKAFPO). These meetings vary, from giving updates, to gathering views on FMPs on behalf of their members. If you are a fisherman, recreational angler or an eNGO we encourage you to get involved through these groups and have your voice heard."
        },
        {
            "heading": 2,
            "text": "How you can get involved"
        },
        {
            "text": "At this stage, we’re preparing the final four Defra plans for consultation where all our stakeholders can have a say on the plans before they’re published."
        },
        {
            "text": "The first six plans that were published in 2024 are being implemented and we’re also getting ready to publish the next five plans that were consulted on last year. There are opportunities to get involved as this work continues, and we’ll continue to promote opportunities here on the blog."
        },
        {
            "heading": 2,
            "text": "New on the FMP blog"
        },
        {
            "text": "We’ve just launched a new page on the blog- the FMP directory. "
        },
        {
            "text": "It includes key information and important links for each of Defra’s 15 FMPs. You can also find out how to keep updated and engage."
        }
    ]
}