{
    "url": "https://mhclgdigital.blog.gov.uk/2025/10/20/diving-into-planning-decisions-what-we-learned-from-our-latest-user-research/",
    "title": "Diving into planning decisions: What we learned from our latest user research ",
    "authors": [
        "Mike Rose, Data, Licensing and Intellectual Property SME",
        "Elliot Rowen, Senior Planner"
    ],
    "categories": [
        "Data",
        "Digital Planning"
    ],
    "pub_date": "2025-10-20T13:38:09+01:00",
    "content": [
        {
            "text": "Across England, local planning authorities use different formats to record the outcomes of planning applications. To unlock the full potential of this information and make critical details about what’s been approved and where more accessible, we’ve started work to standardise decision notices. This will help local authorities access the information they need instantly, supporting more effective planning and reporting for housing and infrastructure, while making this data available to others for analysis and forecasting. We’re driving forward these important improvements as part of our mission to standardise planning data across England."
        },
        {
            "text": "Now that our work to standardise the planning application submission stage is well underway and entering the testing phase, we've shifted our focus to the other end of the planning permission process: the decision stage. "
        },
        {
            "text": "We recently concluded a round of user research with our data standards community to understand the challenges and requirements around standardising decision data. We're defining this as the official decision itself, plus all the supporting information and up-to-date conditions that exist at the point the decision is made. This is more than just ‘approve’ or ‘refuse’ information – it’s the final, accurate data on what's actually been approved. "
        },
        {
            "text": "We have been receiving responses to our survey and following up with in-depth interviews with local authorities and planning consultants. Thank you to everyone who took the time to contribute – your feedback is invaluable. "
        },
        {
            "heading": 2,
            "text": "Why standardised decision data is critical "
        },
        {
            "text": "Our research confirmed that crucial information is currently scattered across documents, submitted during the planning application process, making it incredibly difficult to use this data for analysis or forecasting. The research identified 5 core areas where standardised decision data is urgently needed: "
        },
        {
            "heading": 2,
            "text": "The problems we need to solve "
        },
        {
            "text": "Unlike the submission stage, where we had existing national application forms as a starting point, we face a fundamental challenge looking at the decision stage: there is no single, standardised format for decision notices. This lack of a baseline is compounded by several other issues: "
        },
        {
            "heading": 2,
            "text": "Community insights: Our focus areas "
        },
        {
            "text": "When we asked the community what the priorities were for standardisation, their insights highlighted a number of key areas where we can make the biggest positive impact:  "
        },
        {
            "heading": 2,
            "text": "Next steps: Join the conversation "
        },
        {
            "text": "This research confirms that the work ahead will require more than just technical fixes. It demands a serious effort to address cultural and process issues too. "
        },
        {
            "text": "We will keep you updated on our progress. In the meantime, we need your continued help: "
        }
    ]
}