{
    "url": "https://teaching.blog.gov.uk/2025/10/20/finding-harmony-in-flexible-working/",
    "title": "Finding harmony in flexible working",
    "authors": [
        "Francis Ball"
    ],
    "categories": [
        "Flexible working"
    ],
    "pub_date": "2025-10-20T10:00:16+01:00",
    "content": [
        {
            "heading": 3,
            "text": "Quick summary"
        },
        {
            "heading": 2,
            "text": "Transitioning to the classroom"
        },
        {
            "text": "I am in my third year as a history teacher at Barking Abbey School, in East London. My journey began in local and oral history, working with young people to document the stories of elders in their communities. Moving into classroom teaching felt like a natural progression, and I’m truly grateful I made the step. I find the work deeply fulfilling, intellectually stimulating and meaningful. "
        },
        {
            "text": "However, like many new teachers, I found the pace of school life a real adjustment. In my previous role, I had more flexibility during the week to regularly engage in hobbies and creative interests. Transitioning into teaching meant adjusting to a new rhythm, one that was rewarding but more structured."
        },
        {
            "heading": 2,
            "text": "Embracing flexible working early in my career"
        },
        {
            "text": "It wasn’t until my training mentor mentioned the possibility of part-time teaching that I realised flexible working could be an option - even this early in my career. I was excited by the idea, but also unsure whether it would be viable for me or the school. Fortunately, my school was supportive of my request, and I moved to a four-day week."
        },
        {
            "text": "The impact has been transformative."
        },
        {
            "text": "I've been a drummer for 25 years, and music remains one of my greatest passions. By working four days a week, I now have the time to pursue music seriously - whether practising solo, rehearsing with my band or travelling to gigs. I have since performed locally and further afield. These opportunities were made possible by working flexibly.   "
        },
        {
            "heading": 2,
            "text": "Flexible working enhances my teaching"
        },
        {
            "text": "This change hasn’t just brought personal fulfilment - it’s also enhanced my teaching. With a more balanced week, I return to the classroom with renewed focus, creativity, and enthusiasm. The two parts of my life now play in harmony rather than competition."
        },
        {
            "text": "Flexible working has enabled me to maintain a high level of professional commitment while nurturing a lifelong interest. It’s proof that rethinking the rhythm of the working week can help teachers flourish - both personally and professionally. "
        },
        {
            "text": "I’m proud to work in a school that values this approach, and to be part of a profession that’s increasingly open to new ways of working."
        },
        {
            "heading": 2,
            "text": "Discover more"
        }
    ]
}