{
    "url": "https://insidehmcts.blog.gov.uk/2025/10/20/making-justice-real-how-hands-on-learning-helped-students-understand-knife-crime/",
    "title": "Making justice real: how hands-on learning helped students understand knife crime",
    "authors": [
        "Sian Wharton-Goodman, Senior Communications Manager"
    ],
    "categories": [
        "Crime",
        "General",
        "User experience and research"
    ],
    "pub_date": "2025-10-20T13:23:21+01:00",
    "content": [
        {
            "text": "[English] - [Cymraeg]"
        },
        {
            "text": "Westminster Magistrates’ Court isn’t a place most teenagers hope to spend the day. But for students from two London schools, it became the setting for a powerful learning experience. In our ‘Caught to Court’ anti-knife crime event, they took part in a mock trial that showed how the justice system works, and what happens when young people make dangerous choices."
        },
        {
            "text": "Knife crime continues to affect communities across the UK, with young people often both victims and perpetrators. In the year ending March 2024, just over 3,200 knife or offensive weapon offences were committed by children resulting in a caution or sentence. "
        },
        {
            "text": "The Westminster event – now in its second year – aimed to help students aged 14 to 17 understand the effects of knife-related offences. Led by HMCTS court staff, the immersive experience saw students take on courtroom roles and follow a fictional knife crime case from start to finish. Stepping into the shoes of legal professionals, they didn’t just hear about consequences, they lived them."
        },
        {
            "heading": 2,
            "text": "The mock trial: experiencing justice firsthand"
        },
        {
            "text": "For the mock trial, students took on roles such as prosecutors, defence lawyers, police officers, and magistrates. Guided by real professionals, they examined evidence, cross-examined witnesses, and delivered verdicts. A real judge presided, encouraging student magistrates to challenge both sides."
        },
        {
            "text": "“The mock trial was very different from what was expected,” said one student who played the prosecutor. “I really enjoyed being the prosecutor and visualising all the evidence.”"
        },
        {
            "text": "Justice Minister Jake Richards MP, a former barrister who attended, praised the approach:"
        },
        {
            "text": "“The children engaged brilliantly with the mock trial. To see the kids today learn in just a few hours and then perform in front of a room full of people and a learned judge was just brilliant to see.”"
        },
        {
            "heading": 2,
            "text": "Experiential learning"
        },
        {
            "text": "“This is the first time that we've been to a court, so we're really excited,” said Tanya Withers, Assistant Head at Woodmansterne School and Sixth Form. “These sorts of activities being in a real location are so helpful because the students are seeing a workplace, they're seeing how a court would work. They're learning – I don't want to go down that route.”"
        },
        {
            "text": "Students also appreciated the difference from classroom learning: “It's different to being in the classroom as you're not just looking at a screen. You can actually ask the people that are performing the acts the questions.”"
        },
        {
            "text": "The event also helped students develop important life skills like public speaking, critical thinking and confidence building that will serve them far beyond the courtroom."
        },
        {
            "heading": 2,
            "text": "Collaborative impact"
        },
        {
            "text": "The event brought together criminal justice system partners, influencers and community organisations offering support and positive alternatives."
        },
        {
            "text": "Ian Rawlins, an HMCTS legal adviser, organised the event, emphasising the collective approach: “We all have a duty to try and tackle knife crime together.” His message was clear: “Think twice about taking that weapon when you leave your house. Think twice if you're going to accompany friends who've got a weapon.”"
        },
        {
            "text": "Minister Richards agreed: “Community engagement like this is incredibly important for ensuring that children learn about the dangers of knife crime and how our law and courts work. It's really good to see HMCTS lead the way and organise events like this.”"
        },
        {
            "heading": 2,
            "text": "A lasting message"
        },
        {
            "text": "Students summed up the event: “It has changed what I knew about knife crime. The biggest thing I've taken away is that you shouldn't carry knives, and you should think about the consequences before you do.”"
        },
        {
            "text": "By putting young people at the heart of the justice system, we’re showing that hands-on learning can transform understanding and help young people make safer choices."
        },
        {
            "text": "As Ian concluded: “If everyone who attends this event tells at least one other person what they've seen and heard today, and we prevent one person from carrying a knife or becoming a victim, we’re saving a life.”"
        },
        {
            "text": "[English] - [Cymraeg]"
        },
        {
            "heading": 1,
            "text": "Cyfiawnder go iawn: sut wnaeth dysgu ymarferol helpu myfyrwyr i ddeall troseddau cyllyll"
        },
        {
            "text": "Nid yw Llys Ynadon San Steffan yn rhywle y byddai mwyafrif pobl yn eu harddegau yn dymuno treulio eu diwrnod. Ond i fyfyrwyr o ddwy ysgol yn Llundain, daeth yn lleoliad ar gyfer profiad dysgu pwerus. Yn ein digwyddiad yn erbyn troseddau cyllyll – ‘Caught to Court’ – bu iddynt gymryd rhan mewn ffug dreial a oedd yn dangos sut mae’r system gyfiawnder yn gweithio, a beth sy’n digwydd pan fydd pobl ifanc yn gwneud dewisiadau peryglus."
        },
        {
            "text": "Mae troseddau cyllyll yn parhau i effeithio ar gymunedau ledled y DU, ac yn aml mae pobl ifanc yn gallu bod yn ddioddefwyr ac yn gyflawnwyr. Yn y flwyddyn ddaeth i ben ym Mawrth 2024, cyflawnwyd ychydig dros 3,200 o droseddau arfau ymosodol gan blant, a wnaeth arwain at rybudd neu ddedfryd. Nod y digwyddiad yn San Steffan – sydd bellach yn ei ail flwyddyn – yw helpu myfyrwyr rhwng 14 a 17 oed ddeall effeithiau troseddau sy’n ymwneud â chyllyll. Wedi’i arwain gan staff GLlTEF, roedd y profiad yn gweld myfyrwyr yn cyflawni rolau gwahanol yn yr ystafell llys, ac yn cynnal achos trosedd cyllyll o’r dechrau i’r diwedd. Gan gamu mewn i esgidiau gweithwyr cyfreithiol proffesiynol, yn lle clywed am y canlyniadau yn unig, roeddynt yn byw’r canlyniadau."
        },
        {
            "heading": 2,
            "text": "Y ffug dreial: profi cyfiawnder yn uniongyrchol"
        },
        {
            "text": "Ar gyfer y ffug dreial, roedd myfyrwyr yn cyflawni rolau fel erlynwyr, cyfreithwyr yr amddiffyniad, swyddogion heddlu ac ynadon. Dan arweiniad gweithwyr proffesiynol go iawn, roeddynt yn archwilio tystiolaeth, yn croesholi tystion ac yn traddodi dyfarniadau. Roedd barnwr go iawn yn llywyddu, gan annog myfyrwyr a oedd yn chwarae rôl ynadon i herio’r ddwy ochr."
        },
        {
            "text": "“Roedd y ffug dreial yn wahanol iawn i’r hyn roeddwn i’n ei ddisgwyl,” meddai un myfyriwr, a oedd wedi chwarae rôl yr erlynydd. “Wnes i wir mwynhau bod yn erlynydd ac ystyried yr holl dystiolaeth.”"
        },
        {
            "text": "Bu i’r Gweinidog dros Gyfiawnder, Jack Richard, AS, cyn-fargyfreithiwr a wnaeth fynychu’r digwyddiad, ganmol y dull hwn:"
        },
        {
            "text": "“Roedd y plant yn cymryd rhan frwdfrydig yn y ffug dreial. Roedd gweld y plant heddiw yn dysgu cymaint mewn ychydig oriau ac yn perfformio o flaen ystafell yn llawn pobl a barnwr dysgedig yn beth hollol wych i’w weld.”"
        },
        {
            "heading": 2,
            "text": "Dysgu arbrofol"
        },
        {
            "text": "“Dyma’r tro cyntaf rydym wedi ymweld â llys, felly rydym yn teimlo’n gyffrous iawn” meddai Tanya Withers, Dirprwy Bennaeth Ysgol a Chweched Dosbarth Woodmansterne.  “Mae cynnal gweithgareddau fel hyn mewn lleoliad go iawn yn helpu cymaint, oherwydd mae’r myfyrwyr yn gweld gweithle, maen nhw’n gweld sut byddai llys yn gweithio. Maen nhw’n dysgu – dydw i ddim eisiau mynd lawr y lôn hon.”"
        },
        {
            "text": "Roedd myfyrwyr hefyd yn gwerthfawrogi’r gwahaniaeth o ddysgu yn yr ystafell ddosbarth: “Mae’n wahanol i fod yn yr ystafell ddosbarth oherwydd nid ydych yn edrych ar sgrin yn unig. Gallwch ofyn cwestiynau i’r bobl sy’n perfformio’r rolau.”"
        },
        {
            "text": "Roedd y digwyddiad hefyd wedi helpu myfyrwyr i ddatblygu sgiliau bywyd pwysig fel siarad yn gyhoeddus, meddwl yn feirniadol a datblygu hyder, a fydd yn eu helpu ymhell tu hwnt i’r ystafell llys."
        },
        {
            "heading": 2,
            "text": "Effaith cydweithredol"
        },
        {
            "text": "Bu i’r digwyddiad ddod â phartneriaid cyfiawnder troseddol, dylanwadwyr a chyrff cymunedol ynghyd i gynnig cymorth a dewisiadau amgen cadarnhaol."
        },
        {
            "text": "Ian Rawlins, cynghorydd cyfreithiol yn GLlTEF, drefnodd y digwyddiad, gan bwysleisio’r dull cydweithredol: “Mae gennym oll ddyletswydd i geisio mynd i’r afael â throseddau cyllyll gyda’n gilydd.” Roedd ei neges yn glir: “Meddyliwch ddwywaith am mynd â’r arf yna gyda chi pan fyddwch yn gadael eich tŷ. Meddyliwch ddwywaith os ydych am fod yn gwmni i ffrindiau sy’n cario arfau.”"
        },
        {
            "text": "Roedd y Gweinidog Richards yn cytuno: “Mae ymgysylltu cymunedol fel hyn yn hynod o bwysig i sicrhau bod plant yn dysgu am beryglon troseddau cyllyll ac am sut mae ein cyfraith a’n llysoedd yn gweithio. Mae’n dda iawn gweld GLlTEF yn arwain ar hyn trwy drefnu digwyddiadau fel hyn.”"
        },
        {
            "heading": 2,
            "text": "Neges fydd yn aros yn y meddwl"
        },
        {
            "text": "Dyma ychydig eiriau gan fyfyrwyr yn crynhoi’r digwyddiad: “Mae wedi newid y ffordd dw i’n meddwl am droseddau cyllyll. Y peth mwyaf dw i wedi dysgu yw dylech chi ddim cario cyllyll, a dylech chi feddwl am y goblygiadau cyn i chi wneud o.”"
        },
        {
            "text": "Trwy roi pobl ifanc wrth wraidd y system gyfiawnder, rydym yn dangos bod dysgu ymarferol yn gallu trawsnewid dealltwriaeth a helpu pobl ifanc i wneud dewisiadau mwy diogel."
        },
        {
            "text": "A’r sylwadau i gloi gan Ian yw: “Os bydd pawb sy’n mynychu’r digwyddiad hwn yn dweud wrth o leiaf un person arall am yr hyn maen nhw wedi’i weld a’i glywed heddiw, ac os rydym yn atal un person arall rhag cario cyllell neu rhag dod yn ddioddefwr, rydym ni’n achub bywyd.”"
        }
    ]
}