{
    "url": "https://rpc.blog.gov.uk/2025/10/20/rpc-publishes-its-corporate-report-for-2024-to-2025/",
    "title": "RPC publishes its corporate report for 2024 to 2025",
    "authors": [
        "Stephen Gibson"
    ],
    "categories": [
        "Better regulation",
        "Corporate governance"
    ],
    "pub_date": "2025-10-20T16:05:03+01:00",
    "content": [
        {
            "text": "We have today published the RPC’s Corporate Report for 2024-2025."
        },
        {
            "text": "The report reflects on a very busy year with many changes for the RPC, including the completion of the transition to the revised Better Regulation Framework (BRF). This new framework has moved the RPC's scrutiny role to earlier in the policy-making process and focused our work on reviewing the rationale and choice of options to support better policy making."
        },
        {
            "text": "Of the 77 submissions we received this year, 43 were impact assessments submitted under the previous BRF, 27 were under the new BRF, and the remaining seven were post-implementation reviews (PIRs)."
        },
        {
            "text": "We are particularly pleased to report substantial progress in addressing the longstanding issue of departments failing to complete PIRs. Following our publication of a list of outstanding PIRs across government and direct engagement with permanent secretaries in departments with the most outstanding PIRs, we have seen a positive response with significant progress being made. While there is still some way to go, this represents an important step in improving attention to evaluation. "
        },
        {
            "text": "Toward the end of March 2025, the Chancellor published an Action Plan to cut red tape and kickstart economic growth, including a pledge to cut the administrative cost of regulation on business by 25% before the end of the Parliament. We are keen to help government in developing this target and offering our expertise in independently verifying the cost reductions achieved."
        },
        {
            "text": "The report details our additional activities. This includes our continued engagement with business representative groups, industry associations, and civil society organisations, our work on Free Trade Agreement Impact Assessments and the cross-government training we provide."
        },
        {
            "text": "The report also notes changes to the RPC membership, with Hilary Jennings being reappointed for a second term and John Davies, Allan Little, Caroline Turnbull-Hall, and Frances Warburton joining in April 2025. Members Daniel Dalton, Stephen Gifford, John Longworth and Andrew Williams-Fry left the committee this year and we wish them the best in their future endeavours."
        },
        {
            "text": "We welcome comments on our work and how we might be more effective in the future. Please leave a comment below or email us at: enquiries@rpc.gov.uk"
        }
    ]
}