{
    "url": "https://space.blog.gov.uk/2025/10/20/scouts-speak-to-astronauts-aboard-the-international-space-station/",
    "title": "Scouts speak to astronauts aboard the International Space Station",
    "authors": [
        "The Scouts"
    ],
    "categories": [
        "Championing Space"
    ],
    "pub_date": "2025-10-20T13:35:58+01:00",
    "content": [
        {
            "text": "More than 100 Scouts embarked on an extraordinary journey, without ever leaving Earth.  "
        },
        {
            "text": "Thanks to funding from the UK Space Agency, the young adventurers earned the rare opportunity to host a live Q&A session with a NASA astronaut aboard the International Space Station (ISS), who are living 400km above the Earth’s surface, gaining first-hand insight into life in orbit. "
        },
        {
            "text": "In preparation for the cosmic conversation, the Scouts, have been working toward their Space Activity Badge, introduced last year through a pioneering partnership with the UK Space Agency. "
        },
        {
            "text": "The badge has ignited a passion for space exploration, inspiring curiosity, innovation, and a deeper understanding of space science among young people. "
        },
        {
            "text": "Owen, Cub Scout, age 8, said:"
        },
        {
            "text": "The Scouts from Leamington Spa have etched their names into UK history by receiving the highest number of questions answered by an astronaut aboard the International Space Station during the call on Saturday 18 October. "
        },
        {
            "text": "This extraordinary achievement was made possible through Amateur Radio on the International Space Station (ARISS), a volunteer-led initiative that connects young people with space exploration. Adding to the milestone, the group became the first UK participants since 2018 to establish visual contact with an astronaut via Ham TV, bringing space one step closer to Earth. "
        },
        {
            "text": "Gavin Gill, a Beaver Team Leader at 1st Radford Semele Scout Group, said: "
        },
        {
            "text": "Astronaut and Scout Ambassador Tim Peake said: "
        },
        {
            "text": "This live Q&A session offered Scouts a once-in-a-lifetime opportunity to immerse themselves in space science and develop skills for life. By engaging directly with astronaut Jonny Kim aboard the ISS, these young people weren’t just asking questions, they stepped into a world of possibility.  "
        },
        {
            "text": "Ingmar Kamalagharan, Head of Education and Future Workforce at the UK Space Agency, said: "
        },
        {
            "text": "The experience encouraged critical thinking, curiosity, and confidence, while showing that even the most distant dreams can be within reach. Whether it sparks a future career in STEM or simply deepens their appreciation for the Universe, this moment will stay with them long after the ISS has passed overhead. It’s a powerful reminder that learning can take any form - and that sometimes, even the sky isn’t the limit. "
        }
    ]
}