{
    "url": "https://moderncivilservice.blog.gov.uk/2025/10/20/the-government-statistical-service-building-strength-in-numbers/",
    "title": "The Government Statistical Service: Building strength in numbers",
    "authors": [
        "Government Reform"
    ],
    "categories": [
        "A Modern Civil Service",
        "Capability",
        "Data science",
        "Digital and data",
        "Innovation",
        "Join a profession",
        "Professional Networks",
        "Skilled Civil Service"
    ],
    "pub_date": "2025-10-20T14:53:44+01:00",
    "content": [
        {
            "text": "In this article we hear from Jason Bradbury, Steve Ellerd-Elliott and Jane Naylor, Deputy Heads of the Government Statistical Service (GSS)."
        },
        {
            "text": "Statistics shape every decision the government makes, from healthcare policies to economic strategies. Behind those crucial numbers is the Government Statistical Service, a community of UK civil servants who collect, analyse, produce and communicate the statistics that inform our nation's future."
        },
        {
            "text": "The network of people within GSS is vast and innovative. We work together across boundaries to make a positive difference, which we're really proud of. What makes our community special is how we support one another to deliver the best possible statistics and understandings across our full range of topics, prioritising trustworthiness, value and quality. We often win awards for quality and collaboration in our work - most recently, our professionals have won Royal Statistical Society Campion Awards, Government Analysis Awards, and Civil Service Awards. You could be next!"
        },
        {
            "text": "Being part of the GSS is very simple. If you work with statistics in any capacity, you're already a member - all you need to do is get involved.  If you’re a statistician or data scientist, you can also join the Government Statistician Group (GSG) profession by completing a badging exercise."
        },
        {
            "heading": 2,
            "text": "Delivering our vision together"
        },
        {
            "text": "The Deputy Heads of the GSS, Steve Ellerd-Elliott, Jane Naylor and Jason Bradbury, bring years of experience and genuine passion for getting the best out of our community. They share the following reflection:"
        },
        {
            "heading": 3,
            "text": "Growing with the GSS"
        },
        {
            "text": "Members of the GSS enjoy access to a range of training and career development opportunities, including:"
        },
        {
            "text": "Our People Advisory Group and steering groups continuously work to update learning, development and recruitment opportunities. You can read about their plan and actions, and sign up to get involved, on the GSS webpages."
        },
        {
            "heading": 3,
            "text": "The time and space to create your community"
        },
        {
            "text": "Our community includes access to a Head of Profession in each department and a network of experts at all levels across the Civil Service. There are plenty of opportunities to get involved with projects and make a positive difference to your career."
        },
        {
            "text": "GSS task and finish groups take forward cross-cutting priorities. Current topics include reviewing GSS governance, considering the future role of statisticians, and ensuring diversity and inclusion across our community. Getting involved provides you with the opportunity to build connections, gain experience in planning and delivering improvements, and develop new skills."
        },
        {
            "text": "Champion networks offer an excellent way to connect with the wider community, learn from others, and build capability across the GSS by sharing your expertise. Topics include quality, data linkage, presentation, dissemination, reproducible analytical pipelines, geography and harmonisation. Regional networks are available in most areas of the UK providing local seminars, career opportunities, and socials throughout the year."
        },
        {
            "text": "As a GSS member, you'll also have access to quarterly Community Calls with the GSS Deputy Heads and range of speakers, alongside our yearly GSS Conference packed with learning and networking opportunities. There are methodological knowledge sharing sessions for topical experts across departments and networking opportunities with peers across the GSS. Stay up to date with upcoming events on our webpages."
        },
        {
            "heading": 3,
            "text": "Get involved"
        },
        {
            "text": "Your input is central to sustaining and developing the GSS. Learn about our strategic vision: Strength in Numbers."
        },
        {
            "text": "Members regularly share blogs, guidance and information on our social media, monthly newsletter, and GSS webpages. Subscribe and follow to stay updated."
        },
        {
            "text": "You can find out more about Civil Service professions on the A Modern Civil Service hub."
        }
    ]
}