{
    "url": "https://insidedio.blog.gov.uk/2021/10/14/a-big-day-for-dio-as-new-head-office-is-officially-opened/",
    "title": "A big day for DIO as new Head Office is officially opened",
    "authors": [
        "Lucy Bogue"
    ],
    "categories": [
        "Estates",
        "Sustainability",
        "Working at DIO"
    ],
    "pub_date": "2021-10-14T14:48:19+00:00",
    "content": [
        {
            "text": "Some of us at DIO had a memorable morning yesterday with the official opening of our new head office by the Chief of the Defence Staff, General Sir Nick Carter.  "
        },
        {
            "text": "This has been a few years in the planning and we have now moved from our old head office in Sutton Coldfield to a purpose-built, state of the art building at Defence Medical Services (DMS) Whittington, in Staffordshire. The new building is called St George’s House and can accommodate more than 550 staff, working flexibly, who have relocated to the site following the closure of our former home in Sutton Coldfield.  "
        },
        {
            "text": "The Royal Logistic Corps’ Silver Stars parachute display team provided the \"wow\" factor, before handing over a flag to DIO Chief Executive Graham Dalton. The assembled staff and dignitaries listened to General Sir Nick Carter give a speech on DIO’s support to military operations, and Graham Dalton talked to us about the rationalisation of the Defence estate. Peter Homa, Director General DMS Whittington, then welcomed us to the DMS Whittington community.  "
        },
        {
            "heading": 2,
            "text": "The result of years of work "
        },
        {
            "text": "This opening is the culmination of a lot of work by a large number of people. The planning started several years ago, with our contractors Kier starting work in January 2020 and completing the building in August 2021. The £12m project covered the demolition of an existing building, construction of the new headquarters as well as a new secure car park with 230 additional spaces. "
        },
        {
            "text": "I am personally proud and privileged to be part of the project team that has delivered this from the “twinkle in the eye” at initial design, through to a build and then onto a fabulous fitout that supports a flexible and agile, post-pandemic workforce. DIO is leading Defence by delivering a sustainable and innovative Head Office. "
        },
        {
            "heading": 2,
            "text": "Sustainability in action"
        },
        {
            "text": "The new building not only offers a modern working environment, but has also been designed to reduce carbon contribution through the use of renewable energy, low water usage systems, improved insulation, low energy lighting and electric car-charging points. An area outside has been planted with wild grasses to encourage natural wildlife. "
        },
        {
            "text": "All of the building’s energy requirements come from renewable energy sources, with half provided by rooftop solar panels. The panels generate enough electricity to power five houses and will reduce CO2 emissions by nearly 29,000kg annually, the equivalent of eight flights from London to New York. Overall, these and other measures are predicted to reduce building running costs by £18m over the next 25 years.   "
        },
        {
            "text": "Huge congratulations to the fabulous team that has got us here; they have left us a legacy that we can be proud of. The new DIO Head Office will help us to deliver against our mission to work as One Team, providing Excellent Advice and Outstanding Delivery for our military customers.  "
        }
    ]
}