{
    "url": "https://publicpolicydesign.blog.gov.uk/2021/10/14/achieving-policy-excellence-with-austins-butterfly/",
    "title": "Achieving policy excellence with Austin's Butterfly",
    "authors": [
        "Kate Lloyd"
    ],
    "categories": [
        "Thought leadership"
    ],
    "pub_date": "2021-10-14T12:00:09+01:00",
    "content": [
        {
            "text": "‘Austin’s Butterfly’ is a film about the power of critique and descriptive feedback. It has lessons for us all, both individually and organisationally, on how we can look, listen, and learn to achieve excellence in what we do, including our ability to continually improve and innovate."
        },
        {
            "text": "It is a simple but powerful metaphor for how the UK’s government might have acted differently in the case of the Windrush scandal, and how it must strive to operate in future."
        },
        {
            "text": "Take a look at this film. It is just over 6 minutes long - so grab a cuppa..."
        },
        {
            "heading": 2,
            "text": "Important behaviours revealed"
        },
        {
            "text": "​​​​​In the film, Austin is willing to share his work and to listen to and act on feedback, to improve his original drawing (we all need to get things done, often very quickly, but encouraging challenge and being willing to iterate will always make what we are working on better). This process helps Austin to really look (as a scientist would), rather than creating something from his mind’s eye based on his assumption of what ‘a butterfly’ looks like (assumptions are really helpful to get started on tackling a problem, but you must prove or disprove them along the way). Taken together, this looking and listening enables Austin to learn to the extent that he succeeds in completing his task to an extremely high standard."
        },
        {
            "text": "The students provide Austin with constructive and specific advice, in a kind way, and they recognise and celebrate the progression that Austin has made."
        },
        {
            "text": "The teacher does not critique Austin himself, but provides the context and conditions necessary for Austin to achieve excellence. Firstly, he gives Austin the opportunity to improve, rather than accepting it as ‘good enough’. Secondly, he provides the space, process and environment within which others can provide critique in a positive and constructive way."
        },
        {
            "heading": 2,
            "text": "​​​​​​​Lessons for policymakers"
        },
        {
            "text": "For me as a policymaker, it emphasises the importance of experimentation and iteration as a fundamental part of developing good policy and services. Nobody can be expected to get it right first time and for it to emerge from someone’s head fully formed."
        },
        {
            "text": "It is also about the importance of collaboration (e.g. multidisciplinary working) by deliberately seeking expertise and evidence from others, out of your silo and out of your own organisation, and encouraging challenge and different ways of thinking (diversity of background and thought). In sum, being a good policymaker means providing rounded, well researched advice, that enables decision makers to make the best possible decisions grounded in fact, not assumption."
        },
        {
            "heading": 2,
            "text": "Righting wrongs for the Windrush generation"
        },
        {
            "text": "For me as a Home Office official, Austin’s butterfly echoes many of the cultural and systemic lessons that we as a Department are trying to apply in response to the Windrush Lessons Learned Review.  Wendy Williams found a Departmental culture and operating environment that made the terrible experiences of members of the Windrush generation more likely to happen, and more likely to go unnoticed. There was a failure in the policy making process. Specifically, the failure to sufficiently consider the potential impact of the hostile (now compliant) environment measures, including “an institutional ignorance and thoughtlessness towards the issue of race and the history of the Windrush generation.” Wendy Williams said: “Ultimately, the department failed to look, engage, listen and learn, across all stages of making and implementing the elements of immigration policy covered in this report.”"
        },
        {
            "text": "In March 2020, following publication of Wendy Williams’ report, the Home Secretary apologised to members of the Windrush generation and accepted all 30 of Wendy Williams’ recommendations. Six months later the Home Office published its Comprehensive Improvement Plan, setting out how it intends to implement Williams’ recommendations, including righting the wrongs of the scandal and a focus on ‘wholesale and lasting cultural change’. Wendy Williams began her revisit of the Department at the end of September and aims to publish her assessment of progress by the end of March 2022."
        },
        {
            "heading": 2,
            "text": "Improving outcomes across government"
        },
        {
            "text": "More widely the lessons from Austin’s butterfly reflect many of the principles set out in the Declaration on Government Reform published in June, such as the importance of deepening our understanding of citizens in all parts of the country, fostering originality and challenging conventional thinking and supporting and encouraging multidisciplinary teams. It also reminds me of the OECD’s framework for public sector innovation, which emphasises the need for government to provide the right environment for public sector organisations to encourage and enable innovation."
        },
        {
            "text": "Policymakers must be given permission to experiment – to try new things, and to learn. By experimenting we can build an evidence base that provides assurance that our ideas are needed and will deliver the expected outcomes – and ultimately deliver public value. Policymakers must also have the tools and environments they need to look, listen and learn, and innovate (e.g. better commissioning, access to better information and evidence, more collaborative ways of working, permission and skills to engage widely, including with critics)."
        },
        {
            "text": "So I challenge us all to keep listening, looking and learning together, both individually and organisationally, so we can continue to achieve our own organisational metamorphosis in line with the civil service reform agenda."
        }
    ]
}