{
    "url": "https://ipo.blog.gov.uk/2021/10/14/closing-the-loop-dealing-with-the-deluge/",
    "title": "Closing the Loop: dealing with the deluge",
    "authors": [
        "Gary White"
    ],
    "categories": [
        "Business",
        "Closing the loop",
        "Design",
        "Design right",
        "Trade marks",
        "User research"
    ],
    "pub_date": "2021-10-14T13:01:20+01:00",
    "content": [
        {
            "text": "Our 'Closing the Loop' series focuses on how we have responded to, and acted on, the invaluable feedback that we receive from our customers. "
        },
        {
            "text": "Customer feedback helps us in our endeavours to deliver excellent IP services and create a world leading IP environment. In this update, we're taking a look at what happened when a worldwide pandemic had an unexpected impact on our trade mark and design examination applications. "
        },
        {
            "heading": 4,
            "text": "A tidal wave of trade marks and designs"
        },
        {
            "text": "Cast your mind back to March 2020, at a time when we, like so many other organisations across the UK and beyond, had to adapt overnight to the virtual world of work. For IPO this meant: "
        },
        {
            "text": "Not only were we adapting to a new working world, but something striking was happening to the volumes of trade mark and design applications. "
        },
        {
            "text": "The volume of applications started arriving at such pace that we very quickly found ourselves dealing with significant backlogs. Our customer service standard of ten working days to issue the first report on applications was becoming impossible to meet. "
        },
        {
            "heading": 4,
            "text": "Accelerated planning and people power"
        },
        {
            "text": "We were determined to get back to delivering the service standards that we had set ourselves prior to this influx of work. We entered a phase of accelerated planning and delivery. "
        },
        {
            "text": "Recruitment has grabbed many of the headlines during this period as we have recruited and trained over 180 new examiners, growing from a section of 7 teams to 21 teams. The training and support that our new examiners have received has been of the highest standard. Colleagues have worked together to devise training programmes suitable for a virtual environment. "
        },
        {
            "text": "Prior to the pandemic, examiners would undertake a three month office based training programme, studying the relevant legislation, case law and associated practice and how to apply these to the examination process. Alongside this, the training focused on developing the analytical and decision-making skills needed for well-reasoned and legally sound decisions to be made. "
        },
        {
            "text": "In this respect the training has not changed. We have, however, utilised one to one and small group mentoring a lot more in the virtual training world to consolidate learning and to avoid anyone feeling isolated while learning from home. Pleasingly, the feedback on our virtual training has been overwhelmingly positive, which is testament to the tremendous team effort.  "
        },
        {
            "heading": 4,
            "text": "Meeting the challenge"
        },
        {
            "text": "Throughout this period, we have kept our customers at the centre of our plans. We have maintained clear communications via our website and filing receipts to ensure transparency regarding our 'days to examine'. Our continuous improvement culture at the IPO has also been key to meeting the challenges. We have introduced:  "
        },
        {
            "text": "All of these are helping us move closer to the position where our speed of service is back to where both we and our customers want it to be. At the same time we have been able to ensure that quality is not compromised. "
        },
        {
            "heading": 4,
            "text": "Driving down the delay times"
        },
        {
            "text": "Turning our attention to the future, we have every reason to be confident. Earlier this year, for example, our working days to examine for domestic trade mark applications was 36 days. At the time of writing this blog we were at 12 'days to examine', which is in line with our forecasts and means that we expect normal service to resume from 2022. "
        },
        {
            "text": "Undoubtedly there will be challenges ahead but we have made huge strides and learnt many lessons from the last 15 months. We are committed to delivering the highest standards of service for our customers and by doing so, continuing to play a key role in UK innovation into the future. "
        },
        {
            "text": "Watch our video to find out more about how we close the loop on your feedback:"
        }
    ]
}