{
    "url": "https://socialcare.blog.gov.uk/2021/10/14/how-to-recruit-and-retain-great-care-staff/",
    "title": "How to recruit and retain great care staff",
    "authors": [
        "Fiona Oxley"
    ],
    "categories": [
        "Care and support",
        "coronavirus",
        "Workforce"
    ],
    "pub_date": "2021-10-14T15:59:55+00:00",
    "content": [
        {
            "heading": 2,
            "text": "Challenges worth overcoming"
        },
        {
            "text": "Staff recruitment and retention remain long-standing challenges for the care sector, with the coronavirus pandemic adding to the difficulties many providers face."
        },
        {
            "text": "Throughout my 14-year career at Cygnet Health Care, I have held management positions at various services and managed to reduce staff turnover figures to very low or zero within a year. This experience has given me some insight into what it is needed as a manager when it comes to employee loyalty and maintaining high retention rates."
        },
        {
            "text": "In 2019, I became a registered manager at Eleni House, a specialist residential home for adults with learning disabilities and associated complex needs in Colchester, Essex, and quite a high number of staff had been coming and going. Within a year, the turnover figures reduced to zero."
        },
        {
            "text": "One of the critical factors is the attitude and mindset of the hospital manager. Although we are here to care for our residents, staff are equally important. Working in adult social care sector can be challenging and looking after the mental health and wellbeing of employees is crucial."
        },
        {
            "heading": 2,
            "text": "Nurture and support your colleagues"
        },
        {
            "text": "As a manager, I think it is important to empower people to express themselves and to nurture their individual talents. I tend to look at what people can do. If one of our staff is less able in a certain area, I will sit down with them and discuss what they can do and how we improve. No matter how small it can be, people work better when they are given the opportunity to do more."
        },
        {
            "text": "I consider myself a hands-on manager and I have an open-door policy. You can see when staff are feeling a bit down, so I always try to check everyone is okay and identify how we can help them or point them in the right direction, if necessary. The company also has its own employee assistance programme which provides our staff members with support and practical advice on issues that might be affecting their wellbeing and performance."
        },
        {
            "text": "I also attend a twice-daily handover to see all the staff which lets me pinpoint where they need a little bit of extra help. Engaging with staff in person is important too. Even if it is just half an hour, being with them and having a chat helps to build a good relationship and personal connection with them."
        },
        {
            "text": "At Cygnet Health Care, we also have a yearly performance appraisal as well as bi-monthly supervision session to look at employee’s job performance and improvement over a period of time. This review plays a crucial role in the development, retention, and motivation of the staff members. We also carry out regular staff surveys so we can identify any staff issues and gauge staff satisfaction."
        },
        {
            "heading": 2,
            "text": "Celebrate colleagues' achievements"
        },
        {
            "text": "Staff successes are celebrated. Many of our managers send thank you cards or small gifts and put on events for staff and, during lockdown, some services arranged for food parcels to be delivered to staff who were isolating. At Eleni House, our staff members organise social events by themselves around three times a year and we have organised a number of events in the past including paintball games."
        },
        {
            "text": "Employee retention is also important for our service users. There is plenty of research that shows low retention rates make it more difficult to attain and maintain high standards of care. It’s unsettling when strange faces keep coming in. Having the same staff all the time makes us feel like a family, and it can make a big difference."
        },
        {
            "text": "Our team of 25 at Eleni House has managed the pandemic really well and I’m so pleased to have such an amazing staff team. I appreciate everything they do and I’m lucky to work with a fantastic group of people."
        }
    ]
}