{
    "url": "https://governmentscienceandengineering.blog.gov.uk/2021/10/14/reasonable-adjustments-as-part-of-world-sight-day-14-october/",
    "title": "Reasonable Adjustments as part of World Sight Day [14 October]",
    "authors": [
        "Selina Khan"
    ],
    "categories": [
        "Diversity & Inclusion",
        "Our People & Deep Dives"
    ],
    "pub_date": "2021-10-14T10:00:55+01:00",
    "content": [
        {
            "text": "How many of us are familiar with the process of getting reasonable adjustments at work? Or with what the term reasonable adjustments actually means? The term ‘reasonable’ is subjective in itself as what is reasonable to me may not be to someone else, so who determines what is ‘reasonable’?"
        },
        {
            "text": "I’d like to share my experience of the last 18 months in getting an adjustment that I needed. I have a vision impairment and use assistive software, ZoomText, to magnify and read the screen contents.  As a software developer, the environments I use are resource heavy, requiring high power CPU and memory. Unfortunately, so does ZoomText, the software that essential to help me do my job. COVID-19 occurred, and we had to work from home, however there was no way I could run ZoomText and my development applications on a laptop. I started the process of requesting a more powerful laptop as a Reasonable Adjustment. I had no idea what I was in for but was fortunate to have the support of my manager along with that of the wider team, which I am really grateful for."
        },
        {
            "text": "Our IT department then checked the current laptop performance, updating software and drivers but they agreed it was not up to the task and I needed a more powerful laptop. My request was cleared by IT for approval."
        },
        {
            "text": "I was told that to put together a business case to enable IT to purchase a suitable laptop. I was offered another laptop that did not meet the specification I required. I wanted to show that I was open to try different laptops and I hoped this one would be adequate."
        },
        {
            "text": "On testing it did not have the power that was required and was slow to use. Imagine typing an email and the letter appearing 1 to 3 seconds after you had typed them, this was the level of performance I was having to contend with.  If I shut down ZoomText it would behave normally, so I know the assistive software was the cause, but without it, I’m unable to use the computer."
        },
        {
            "text": "I reported my findings and experience back but at this point I didn’t know what to do, I thought I had exhausted every avenue available; I was demonstrating the problem to everyone and anyone who would listen."
        },
        {
            "text": "The problem was, we have no centralised system for handling reasonable adjustment requests and funding, no one knew what to do, who would pay for what, who had the authority to purchase the equipment.  The whole system was not connected. It’s left up to the individual to sort out the issue, liaising between departments, which put the requester under great stress."
        },
        {
            "text": "The office was going through a review of our ED&I strategy and the topic of reasonable adjustments had been discussed.  I shared my experience with one of the contractors focussing on the ED&I strategy and she was horrified at the way this was being handled."
        },
        {
            "text": "After a further 9 months it transpired that high-powered laptops were available within our support contract.  Once this information was unlocked, things started to move.  It took a further 3 months to get the machine, and have it configured, but I’m pleased to say, in mid-September I took delivery of the new laptop."
        },
        {
            "text": "I can’t express in words how much of a difference this has made, the software runs so much better, everything happens instantly, I’m not waiting for letters to appear on a screen, I feel I finally have the tools I need to do the job along with my team."
        },
        {
            "text": "While I am really pleased this has concluded and I finally have the tools I need, the amount of stress this has put me under has been tremendous, I had days where I felt physically sick."
        },
        {
            "text": "I wanted to share my story, in the hope to show the level of impact that this delay caused. Please don’t underestimate what impact delays have on a disabled person."
        },
        {
            "text": "No one person is at fault here, I want to be clear on that. It’s a system / policy failure, which I want to highlight so please take a look at your processes for handling Reasonable Adjustments, do all your managers know what to do?  Do you have a central budget? Do managers have the authority to buy equipment. Is all the emphasis on the disabled individual to arrange everything?  We know what we need but do we really need to be involved in the purchase, installation and management of said equipment?"
        },
        {
            "text": "Leona Atkins"
        },
        {
            "text": "Senior Software Developer, Met Office."
        },
        {
            "text": "I am very grateful to Leona for being so open and honest about the personal cost of this situation. The last 18 months have been difficult for all of us on so many levels but one thing that many people have been grateful for is the ability to work effectively from home. Leona’s story illustrates all to clearly the impact of having that productive working environment taken away from you which would be difficult enough without having to deal with working through an unsupportive and ill-defined system. This situation could so easily have provided a positive outcome. Leona’s needs were clearly understood and had previously been accommodated and this just needed to be translated to the new IT hardware in a time course measured in weeks rather than months! This is sadly a situation all too often faced by disabled staff and we all need to work harder to create systems and procedures that are people focused that enable staff and are flexible enough to cope with a diversity of needs. "
        },
        {
            "text": "David Kenyon Chair of GSE Disability work stream and Head of Chemistry, Molecular Biology & Wildlife, Scottish Governments Agriculture and Rural Economy Directorate"
        },
        {
            "text": " "
        },
        {
            "text": "Do you know enough about reasonable adjustments? Check out this webpage and improve what we do for those we work with. Reasonable adjustments: a legal duty - GOV.UK (www.gov.uk)"
        }
    ]
}