{
    "url": "https://insidehmcts.blog.gov.uk/2021/10/14/super-courtrooms-spearhead-good-multi-hander-progress/",
    "title": "Super courtrooms spearhead good multi-hander progress",
    "authors": [
        "Daniel Flury"
    ],
    "categories": [
        "Court and tribunal reform",
        "Crime"
    ],
    "pub_date": "2021-10-14T13:00:30+01:00",
    "content": [
        {
            "text": "The Manchester super courtroom – which opened its doors at the Crown Court last month – got underway with its first large trial last week, as HMCTS passed another significant milestone in recovering our ability to hear ‘multi-hander’ trials (that is, those involving multiple defendants). The case involves eight defendants charged with murder and violent disorder in Moston, Manchester on Bonfire Night last year."
        },
        {
            "text": "It’s large trials like these that have been particularly challenging to facilitate during the pandemic, at a time when social distancing mitigations have put space in our buildings at a premium. We have been holding large multi-hander trials but they have often required us using two or three courtrooms.  So it is a source of some relief and great pride to get our first large case going through the super courtroom in the north-west, and the result of immense effort, determination and skill from court staff, judges and representatives alike."
        },
        {
            "text": "The Manchester facility is three times the size of a usual courtroom – allowing us to safely hear trials with up to 12 defendants in a single courtroom. These trials may include gang-related crime such as county lines drug trafficking, murder, and money laundering. A second super courtroom will follow Manchester very soon, with a similar facility in Loughborough due to open in November to also deal with Crown Court work."
        },
        {
            "text": "These courtrooms – which are national resources so can take on trials from anywhere across England and Wales where needed and appropriate – are giving us the capacity we need to clear these physically-difficult types of case from the backlog, whilst preventing disruption to other courtrooms in the building."
        },
        {
            "text": "Progress in our ‘traditional’ estate"
        },
        {
            "text": "Whilst our super courtrooms are deservedly grabbing headlines, there are also plenty of other examples of big trials being successfully heard across our existing Crown Court estate, which are just as crucial to our recovery progress."
        },
        {
            "text": "Large murder trials in Crown Court buildings at Leeds (6-hander), Preston and Reading (both 8-handers) have all concluded recently."
        },
        {
            "text": "These are all testament to the people working at those courts, and have depended on creativity, innovation and usually technology, to minimise the impact on other courtrooms within the building and protect capacity."
        },
        {
            "text": "To give an idea of how consistently we’re delivering multi-hander cases, let’s take Monday this week (11 October 2021) as a snapshot. We held 40 trials involving 3 to 4 defendants, 18 trials involving 5 to 6 defendants, and 8 trials involving 7 or more defendants listed in Crown Courts across England and Wales. That’s in addition to 130 other trials in session that day."
        },
        {
            "text": "Rising to the challenges"
        },
        {
            "text": "Despite outstanding examples like these, and the recent lifting of many of the social distancing measures in place in our buildings, challenges – and some safety measures - do still remain. It’s more important than ever that we continue to work shoulder to shoulder with our criminal justice partners – like the police, Crown Prosecution Service and prisons – to find ways of safely delivering large multi-hander trials."
        },
        {
            "text": "Pressures are particularly acute in court custody suites which tend to be enclosed, smaller rooms and often see a higher level of different people passing through them each day, meaning social distancing measures remain in place. This has had some impact on the number of trials we’ve been able to hold at the same time. We’re working with our partners to directly address this pressure."
        },
        {
            "text": "We’re also working closely with our partners at HM Prisons & Probation Service (HMPPS) to explore, where appropriate and with judicial agreement, it may be possible to use Prison Video Conferencing Centres for parts of large trials, reducing footfall within the court."
        },
        {
            "text": "Recently, Preston Crown Court, used video technology successfully to enable four Category A prisoners from HMP Manchester to attend the majority of their trial, minimising footfall and reducing the impact on other courtrooms in the building. We estimate that by confining a case that could have used all the rooms in the court, to just 2 linked courtrooms, over the 10 weeks we saved capacity for up to an extra 50 trials, 250 sentencing hearings, and 20 appeals – not to mention around 500 pre-trial preparation, case management, pre-trial review, and mentions hearings. So there are clear benefits to being able to replicate this more consistently."
        },
        {
            "text": "Again, working with HMPPS, Prisoner Escort Custody Services (PECS) and the UK Health Security Agency (which has replaced Public Health England), we’re also looking closely at how, as COVID-19 restrictions in prisons ease, we can begin to safely increase our dock capacity. And at Snaresbrook Crown Court this winter, we’re adding a secure unit to accommodate an additional 12 defendants in custody when they’re at court."
        },
        {
            "text": "Turning the tide"
        },
        {
            "text": "Crown Court recovery will take more time and more hard work. But, as these examples prove, good progress is being made to deliver complex criminal cases up and down the country, and together are setting us on the path to turning the tide on the outstanding caseload. We’ll need to keep working alongside our partners and colleagues across the system, but by working together, I’m confident that we will maintain and increase the momentum that we are now beginning to see."
        }
    ]
}