{
    "url": "https://educationhub.blog.gov.uk/2021/10/what-is-an-academy-and-what-are-the-benefits/",
    "title": "What is an academy and what are the benefits?",
    "authors": [
        "mediaofficer"
    ],
    "categories": [
        "Academies",
        "Schools"
    ],
    "pub_date": "2021-10-14T14:01:24+01:00",
    "content": [
        {
            "text": "We want every school in the country to be part of a family of schools in a strong multi academy trust. But what are academies and what are the benefits of of this plan?"
        },
        {
            "text": "The academies programme gives individual schools greater freedoms compared to local authority control. Being an academy gives schools the power to decide on the best curriculum for their pupils, determine how they spend their budgets, and much more."
        },
        {
            "heading": 3,
            "text": "What is an academy? "
        },
        {
            "text": "Academies are state-funded schools but they’re independent from local authorities meaning they aren’t run by councils. They can decide on their own curriculums, term dates, school hours and much more."
        },
        {
            "text": "They’re still funded by the government but they get to decide how they spend their money, from how much they pay teachers to how much they spend on classroom equipment."
        },
        {
            "text": "Over half of pupils are already educated in academies and there are three types:"
        },
        {
            "text": "Primary, secondary, middle, all-through, 16-19, alternative provision and special schools can all be academies."
        },
        {
            "heading": 3,
            "text": "What are multi academy trusts? "
        },
        {
            "text": "Multi Academy trusts are charities that have responsibility for running a number of academies. They cannot, as charities, be run for financial profit and any surplus must be reinvested in the trust."
        },
        {
            "text": "By working in partnership with each other, the schools within a trust can share staff, curriculum expertise and effective teaching practices, and work together to deliver the best outcomes for pupils."
        },
        {
            "text": "While other types of school partnerships can be effective, the key difference with academy trusts is that there is shared accountability for standards across the trust; all schools within the trust support each other and the trust is accountable for them all."
        },
        {
            "heading": 3,
            "text": "Why is the government’s focus now on supporting schools to join strong trusts?  "
        },
        {
            "text": "Joining a multi academy trust remains a positive choice for schools. They enable the strongest leaders to take responsibility for supporting more schools, develop great teachers and allow schools to focus on what really matters – teaching, learning and a curriculum that is based on what works."
        },
        {
            "text": "Every year, hundreds of schools choose to convert and benefit from the freedom that academy status can provide, at a timescale that suits them best."
        },
        {
            "text": "As we build back better from the pandemic, multi-academy trusts have the capacity to provide the best training and evidence-based curriculum support for already great teachers, freeing them to focus on what they do best – teaching."
        },
        {
            "heading": 3,
            "text": "If they have all this freedom, how are they accountable? "
        },
        {
            "text": "This freedom does not mean academies are not regulated. The department’s National and Regional Schools Commissioners and their teams, together with the Education and Skills Funding Agency, provide robust educational and financial oversight of all academy trusts."
        },
        {
            "text": "Individual academies are still subject to Ofsted inspections and ratings in exactly the same way as council-run schools."
        },
        {
            "text": "In fact, academies are subject to greater accountability than council-run schools because of increased financial regulation."
        },
        {
            "heading": 3,
            "text": "What happens if an academy fails? Can they be transferred back to local authorities? "
        },
        {
            "text": "If an academy is failing to meet the required standards, the current system allows the department to take swift action, including transferring the academy to a more suitable trust where necessary. But we don’t believe transferring a school back into the control of a local authority is the best way to bring about improvement."
        },
        {
            "text": "If you’d like to find out more about trusts and academies then more information is available at:"
        }
    ]
}