{
    "url": "https://socialcare.blog.gov.uk/2021/10/14/why-i-decided-to-take-the-covid-19-vaccine/",
    "title": "Why I decided to take the COVID-19 vaccine",
    "authors": [
        "Sofija Igonkina"
    ],
    "categories": [
        "Care and support",
        "coronavirus"
    ],
    "pub_date": "2021-10-14T14:48:36+00:00",
    "content": [
        {
            "heading": 2,
            "text": "A difficult beginning"
        },
        {
            "text": "My name is Sofija Igonkina, from Latvia. I have been living in England for 15 years. I'm a nurse and I work in Evergreen nursing home in Hastings. I want to share my story about why I had the COVID-19 vaccine and why I'm going to get a booster jab this winter."
        },
        {
            "text": "Last year was very difficult for everyone, particularly at the beginning of the pandemic when we went into lockdown. We stopped letting visitors in and our residents’ lives changed completely as contact with family was limited to phone or video calls."
        },
        {
            "text": "Instead of having a lovely Christmas last year,  COVID-19 came into the home and changed everything. Despite our best efforts, many of our residents contracted the virus, including myself and most of the staff."
        },
        {
            "text": "In 13 years of working in Evergreen, I have never felt so helpless, devastated and emotionally broken. In a short period of time we lost half of our residents. I cannot express how hard it is to see people dying in front of your eyes whom you have looked after for many years. I cried nearly every day at home and at work. I had to do it so that no one could see it because I have to be strong and be a role model for my colleagues. COVID-19 changed our lives."
        },
        {
            "heading": 2,
            "text": "A moment of acceptance"
        },
        {
            "text": "In January, I decided to get vaccinated. I wanted to protect myself, our residents and my family. I do not wish anyone to go through what we went through last Christmas."
        },
        {
            "text": "When we heard on the news that a vaccine had been developed and my manager asked if I wanted to have it, I said no. At first I didn't trust a vaccine made so quickly could protect us from a virus science knew little about. But I changed my mind when when I myself contracted COVID-19 and saw so many residents become infected too. And now I want to say thank you to the scientists for being able to make an effective vaccine in such a short time."
        },
        {
            "text": "Many people will say that, because I work as a nurse, it is my responsibility to get vaccinated to protect the elderly people I care for. It is true, as social care workers, many of the people we care for are at high risk from COVID-19. I also think we all have a duty to do what we can to protect each other."
        },
        {
            "text": "It is better to prevent something in advance than deal with the consequences and have to live with them afterwards. This is why I would recommend everyone gets vaccinated this winter."
        },
        {
            "text": "Having a COVID-19 booster vaccination will help ‘top up’ your immunity and give you greater protection against the virus this winter. Together we can prevent the spread of the virus, protect each other and those in our care who are most at risk."
        }
    ]
}