{
    "url": "https://gfie.blog.gov.uk/2022/05/24/all-about-going-forward-into-employment/",
    "title": "All About Going Forward into Employment",
    "authors": [
        "Andrew Ashworth"
    ],
    "categories": [
        "#GFIEsuccessstory",
        "agreatplacetoworkforveterans",
        "Care Leavers",
        "connect",
        "Inclusion",
        "levelling up",
        "Life Chances",
        "Prison Leavers",
        "Social mobility",
        "Uncategorized",
        "Veterans"
    ],
    "pub_date": "2022-05-24T16:10:49+01:00",
    "content": [
        {
            "heading": 2,
            "text": "A complete guide to Going Forward into Employment\n"
        },
        {
            "heading": 2,
            "text": "What we do"
        },
        {
            "text": "The Going Forward into Employment (GFiE) Team works across the UK with a range of partners to match people who may not otherwise consider a role in the Civil Service, into a wide variety of Civil Service jobs."
        },
        {
            "text": "We are actively contributing towards the ambition that the Civil Service will draw on the talents of the widest possible range of geographical and social backgrounds.  Our work increases cognitive diversity, reaching out into communities, bringing new voices and lived experiences into the Civil Service."
        },
        {
            "text": "We provide support to candidates and line managers so that candidates can flourish.  "
        },
        {
            "heading": 2,
            "text": "Who we work with"
        },
        {
            "heading": 2,
            "text": " Find out more"
        },
        {
            "text": "The following schemes are run by the GFiE team and are available for use across every Civil Service department, on a national basis:"
        },
        {
            "text": "If you are a Civil Servant you can use one of our schemes to fill your vacancy! Contact us for more information.   "
        },
        {
            "text": "GFiE Life Chance schemes accredited by the Civil Service Commission are running across Government and are available for Civil Servants to use.  Most accredited schemes are run by, and for the use of, individual departments and agencies. "
        },
        {
            "text": "You may be familiar with the Department for Work and Pension (DWP) Social Mobility apprenticeship and the Department for Education (DfE) Care Leavers internship schemes, both available to utilise across government. "
        },
        {
            "text": "We support and  facilitate the accreditation of over 28 different life chance schemes across government departments.  Click here to read about our network of Life Chance schemes."
        },
        {
            "text": "If you are a civil servant who wants to support our work you can also volunteer to become a buddy.  Read more about becoming a buddy here or register your interest by emailing the team."
        },
        {
            "text": "If you are looking for work and are a Prison Leaver, Veteran or Military Partner/Spouse, Carer or Care Leaver and are interested in applying for a role you can contact us for more information (for the Veteran schemes, check out our facebook page and you can see all available roles on the CTP pages). "
        },
        {
            "text": "If you are an organisation who works with Prison Leavers, Care Leavers, Carers, Homelessness or Veterans and are interested in our work, you can get in touch with us here."
        },
        {
            "text": "GET IN TOUCH:"
        },
        {
            "text": "For more information get in touch with us by emailing us at  GFIE@cabinetoffice.gov.uk "
        },
        {
            "text": "Or check out our Twitter page "
        },
        {
            "heading": 2,
            "text": "Want to know or read more?"
        },
        {
            "heading": 2,
            "text": "These might be of interest too!"
        },
        {
            "text": " "
        }
    ]
}