{
    "url": "https://naturalengland.blog.gov.uk/2022/05/24/building-partnerships-for-nature-and-peoples-recovery/",
    "title": "Building partnerships for nature and people’s recovery",
    "authors": [
        "Natural England"
    ],
    "categories": [
        "Mental health and wellbeing"
    ],
    "pub_date": "2022-05-24T15:54:38+01:00",
    "content": [
        {
            "text": "Poor mental health costs the UK an estimated £118 billion per year (around 5 per cent of UK GDP). On an individual level, one in four adults and one in 10 children experience mental illness. The government has recently published a call for evidence to inform a new 10-year mental health plan to level up mental health across the country and put mental and physical health on an equal footing. At Natural England, we understand the role that connecting people with nature can play to support happy and healthy people in thriving, natural settings."
        },
        {
            "text": "The positive link between a connection to nature and good physical and mental health is supported by years of scientific study. I recently visited the Wild Being project in Reading funded by the Thriving Communities Programme. The project supported an extensive programme of arts, culture, nature, physical activity and life advice for 300 people including pop up arts, English language conversations, and gardening. At the event I was reminded of a study from 1984 (incidentally the year I was born), which reported that people can recover from surgery or deal with pain more effectively, if exposed to a natural environment. Viewing nature alone can aid in the path to recovery (Ulrich RS, 1984)."
        },
        {
            "text": "Back to the present day, our latest People and Nature Survey results for March shows that 81 per cent of people say that being in nature make them feel happy and people reported that nature/wildlife (39 per cent) and visiting green and natural spaces (40 per cent) had been even more important to their wellbeing since coronavirus restrictions began."
        },
        {
            "text": "While we know that the evidence is strong on the links between nature and health, a cross-government and cross-sector approach is needed to realise the potential. That’s why Natural England is championing green social prescribing (GSP), which is the practice of supporting people to engage with nature-based interventions and activities to improve their mental health. Nature provides inspiration and a foundation from which we can re-build our own sense of self and connection, on our terms."
        },
        {
            "text": "With GSP, there are many referral pathways open to people to access services, including self-referral. Working with the NHS, for example, social prescribing Link Workers (and other trusted professionals in allied roles) connect people to community groups and agencies for practical and emotional support, based on a ‘what matters to you' conversation."
        },
        {
            "text": "A national conference marks the one-year milestone for the Green Social Prescribing Pilots, which aims to \"Prevent and tackle mental ill health through green social prescribing.\""
        },
        {
            "text": "The GSP programme is a national £5.77m project preventing and tackling mental ill health through green social prescribing, which runs until March 2023. The project builds on the government’s commitment to transform mental health services and increase social prescribing, set out in the NHS Long Term Plan."
        },
        {
            "text": "On Tuesday 10 May, Natural England and our cross-government partners organised a national conference to share insights and discuss scaling up green social prescribing across England. Partners from the Department for Environment, Food and Rural Affairs (Defra), NHS England, Department of Health and Social Care (DHSC), the Department for Levelling Up, Housing and Communities (DLUHC), Sport England and the National Academy for Social Prescribing, as well as a host of local community and health partners, came together. We discussed how we can scale up GSP and ensure it meets the needs of individuals facing inequalities in health and access to the natural environment."
        },
        {
            "text": "The conference was attended by 350 people online and 150 people in person. We heard from a wide range of senior leaders who have championed GSP throughout the pilot. This event was a major milestone for the national GSP pilot and a testament to the successful collaboration of the cross-government partnership and local delivery."
        },
        {
            "text": "Building Partnerships for Nature and people’s Recovery"
        },
        {
            "text": "Last week our Chair, Tony Juniper, wrote a blog summarising Natural England’s response to the Nature Recovery Green Paper. In it he says that “Nature recovery can’t be achieved by any single body or government department.”"
        },
        {
            "text": "The GSP Pilots are a great example of what we can deliver when we join up across government and are why I believe so strongly in the partnerships we’ve been developing to join up people and natures’ health and recovery. The possibilities are truly transformational:"
        },
        {
            "text": "These partnerships give us the opportunity to embed nature into the decisions we take at an individual, local and national level, but this integration wouldn’t be possible without the dedicated and passionate teams we have in Natural England and our partners."
        },
        {
            "text": "Thriving nature is not the sole answer to the mental health crisis nor other major challenges we are facing as a society but it has a key role to play. Local green and blue spaces are often the focal point for communities. We now need to harness their power to connect people as part of our approach to improve health outcomes, build community connections and a create greater connection to nature."
        },
        {
            "text": "Dave Bell"
        },
        {
            "text": "Principal Adviser: Health, Wellbeing & the Environment"
        }
    ]
}