{
    "url": "https://gds.blog.gov.uk/2022/05/24/gds-advisory-meets-with-suppliers-in-manchester-hub/",
    "title": "GDS Advisory meets with suppliers in Manchester hub",
    "authors": [
        "Lucy Taylor, GDS Advisory Support Officer"
    ],
    "categories": [
        "Digital, Data and Technology"
    ],
    "pub_date": "2022-05-24T10:42:27+01:00",
    "content": [
        {
            "text": "Government Digital Service Advisory held an event with their commercial suppliers on 11 May at the Government Digital Service (GDS) offices in Manchester. The team at GDS Advisory used this opportunity to explore ways of improving processes and management tools. Working together with their suppliers, GDS Advisory successfully highlighted great ideas to strengthen its ability to provide expert services to clients at a high standard and support Digital Capability across government. "
        },
        {
            "heading": 2,
            "text": "What is GDS Advisory?"
        },
        {
            "text": "GDS Advisory currently supports digital transformation across government in two ways via:"
        },
        {
            "text": "Our pool of civil servants comprises experienced civil servants in a range of Digital, Data and Technology (DDaT) professions. As well as bringing DDaT expertise, team members act as a ‘critical friend’ in their deployments. They consistently receive excellent feedback, in particular from organisations still in the early stages of setting up their DDaT function."
        },
        {
            "text": "Our third party supplier route provides urgent DDaT support for departments or arm’s length bodies who can help deliver outcomes where no civil servants are available and procurement is time prohibitive.  "
        },
        {
            "text": "GDS Advisory uses the Digital Outcomes and Specialists (DOS) framework to find suppliers with the capability and capacity to support government with urgent digital delivery whilst maintaining the digital standard. We procure single supplier contracts which are managed centrally by our GDS Advisory team."
        },
        {
            "heading": 2,
            "text": "What we did on the day"
        },
        {
            "text": "We gathered four commercial suppliers together (Nomensa, Madetech, LAInternational, Opencast) to have thoughtful discussions in order to make suggestions on how we can iterate our contract management processes to provide better outcomes and ensure we leave clients and departments with all the tools and knowledge to continue into their next phases of delivery.  "
        },
        {
            "text": "We began the day with a presentation from the Head of GDS Advisory, Nick Tait, who provided an overview of where GDS Advisory sits within Government Digital Service (GDS), along with a summary of our strategic goals for the future."
        },
        {
            "text": "Following on from that, we then broke off into teams to review current contract management processes and tools such as the Triage form, Statement of Work (SOW) and Weekly Contract Review. In keeping with GDS tradition, we used post it notes to document ideas before regrouping, sharing ideas and experiences to iterate how we deliver across government. "
        },
        {
            "heading": 2,
            "text": "Feedback from the organisers"
        },
        {
            "heading": 3,
            "text": "Dean Woolliscroft, Contracts Manager"
        },
        {
            "text": "\"These sessions are crucial in helping GDS Advisory deliver at pace whilst ensuring governance and the Digital standard are adhered to.  This was the 1st event in the 3 years I have managed these and previous contracts that we could sit and speak with our suppliers in one room.  The session will help inform how we iterate our processes and management tools but also gave crucial insight into how we can help broaden the GDS Advisory offering to focus more on supporting Digital Capability across government.\""
        },
        {
            "heading": 3,
            "text": "Nick Tait, Head of GDS Advisory"
        },
        {
            "text": "\"An excellent day with our GDS Advisory suppliers, all of whom contributed to its overall success. Working together to improve our triage and Statement of Work processes means that we co-create a shared understanding of our client's needs so that we can meet and exceed them.\""
        },
        {
            "heading": 2,
            "text": "Feedback from the suppliers "
        },
        {
            "heading": 3,
            "text": "Nomensa"
        },
        {
            "text": "\"With 21 years heritage in accessible user centred design, Nomensa believes that digital experiences should be accessible to all, which aligns so perfectly with GDS's manifesto to be digital by default for the benefit of all citizens. Today was a genuine meeting of minds that has inspired us all to keep doing what we love for the benefit of everyone we serve.\""
        },
        {
            "heading": 3,
            "text": "LA International"
        },
        {
            "text": "\"Interesting to meet other suppliers and understand their challenges and it was good to meet the GDS team in person to build relationships. There were some really good suggestions that came out during the SoW and Triage document discussions.\""
        },
        {
            "heading": 2,
            "text": "Get in contact! "
        }
    ]
}