{
    "url": "https://ukhsa.blog.gov.uk/2022/05/24/information-on-monkeypox-and-our-investigation-into-recent-cases/",
    "title": "Information on monkeypox and our investigation into recent cases",
    "authors": [
        "Blog Editor"
    ],
    "categories": [
        "Health Protection"
    ],
    "pub_date": "2022-05-24T10:56:14+01:00",
    "content": [
        {
            "text": "UKHSA is urgently investigating a number of monkeypox cases recently identified in the UK. You can find our updates on this GOV.UK page."
        },
        {
            "text": "Monkeypox is a viral infection usually associated with travel to West Africa. This is the first time that there has been suspected community transmission in the UK without known links to countries where it is endemic, so the current situation is unusual and we are acting with urgency to learn more."
        },
        {
            "text": "Monkeypox is usually a mild illness that does not spread easily between people and gets better by itself, with most people recovering within a few weeks. The risk to the UK population remains low, but this is being kept under review as we continue to investigate and learn more about transmission patterns and risks."
        },
        {
            "text": "This blog contains information about monkeypox, its symptoms, how it spreads, how we treat it and what to do if you’re concerned."
        },
        {
            "heading": 2,
            "text": "What are the symptoms and how does it spread?"
        },
        {
            "text": "Initial symptoms of monkeypox include fever, headache, muscle aches, backache, swollen lymph nodes, chills and exhaustion. A rash can develop, often beginning on the face, then spreading to other parts of the body including the genitals."
        },
        {
            "text": "The rash changes and goes through different stages, and can look like chickenpox or syphilis, before finally forming a scab, which later falls off."
        },
        {
            "text": "The virus enters the body through broken skin (even if not visible), the respiratory tract, or the mucous membranes (eyes, nose, or mouth) and doesn’t usually spread easily between people."
        },
        {
            "text": "Spread can occur when a person comes into close contact with someone or something contaminated with the virus."
        },
        {
            "text": "Anyone with concerns that they could be infected is advised to contact NHS 111 in the first instance, or a sexual health clinic. People should notify clinics ahead of their visit. Calls or discussions at clinics will be treated sensitively and confidentially.  Confirmed cases will be contacted by UKHSA local Health Protection Teams to help identify and trace contacts so that the appropriate public health action can be taken to prevent the spread of infection."
        },
        {
            "heading": 2,
            "text": "What happens if I’ve been in close contact with someone with monkeypox?"
        },
        {
            "text": "We are contacting any identified close contacts of the cases to provide health information and advice."
        },
        {
            "heading": 2,
            "text": "How is it treated?"
        },
        {
            "text": "Most of those with monkeypox will recover within a few weeks without treatment."
        },
        {
            "text": "Treatment for monkeypox is sometimes offered to help people avoid more severe consequences of the virus."
        },
        {
            "heading": 2,
            "text": "Is there a vaccine?"
        },
        {
            "text": "There isn’t a specific vaccine for monkeypox, but the vaccinia (smallpox) vaccine does offer some protection. Giving the vaccine to contacts after they have been exposed to the virus can prevent infection developing or reduce the severity of illness depending on how quickly this can be given."
        },
        {
            "text": "Some healthcare workers caring for individuals and those with higher level of exposures may be offered this smallpox vaccine following an assessment."
        },
        {
            "heading": 2,
            "text": "Is monkeypox an STI and why are gay and bisexual men being told to be particularly alert?"
        },
        {
            "text": "Recent cases in UK and Europe have been found predominantly in gay and bisexual men, so we are particularly urging these communities to be alert to the symptoms and seek help if they are concerned."
        },
        {
            "text": "Monkeypox has not previously been described as a sexually transmitted infection, though it can be passed on by direct contact during sex. It can also be passed on through other close contact with a person who has monkeypox or contact with clothing or linens used by a person who has monkeypox."
        },
        {
            "text": "UKHSA is recommending anyone who has changed sex partners regularly, or who has had close contact with individuals that they don't know, to come forward if they develop a rash."
        },
        {
            "heading": 2,
            "text": "What is UKHSA doing to find the cause?"
        },
        {
            "text": "UKHSA has quickly identified cases and we are carrying out extensive contact tracing of anyone who has come into contact with confirmed cases to stop the spread. We are continuing to rapidly investigate the source of these infections and are liaising with public health bodies in all four UK nations to raise awareness among healthcare professionals of what to look out for."
        },
        {
            "text": "Anyone who thinks they might have monkeypox symptoms should call NHS 111 or phone their local sexual health centre as appropriate."
        },
        {
            "text": "You can read guidance on epidemiology, symptoms, diagnosis and management of monkeypox virus infections on gov.uk here."
        }
    ]
}