{
    "url": "https://educationhub.blog.gov.uk/2022/05/24/our-work-to-tackle-spiking-attacks-on-university-students/",
    "title": "Our work to tackle spiking attacks on university students",
    "authors": [
        "Media Officer"
    ],
    "categories": [
        "Higher Education",
        "Universities"
    ],
    "pub_date": "2022-05-24T14:00:10+01:00",
    "content": [
        {
            "text": " "
        },
        {
            "text": "Spiking is when people illegally drug victims, often by putting substances in their drinks or even by injecting them. In the last two years we’ve seen a rise in reports of spiking and, while the true scale of the issue is unknown, we know that students can be particularly vulnerable to this kind of attack and that’s why we are working to protect them."
        },
        {
            "text": "We’ve announced that a new working group involving university bosses, police, campaigners and other experts, will work to help us gain a better understanding of the issue. But that isn’t all we’re doing. Here we look at the ways in which the Government is working to tackle spiking."
        },
        {
            "heading": 3,
            "text": "What is spiking? "
        },
        {
            "text": "Spiking is when a person puts alcohol or drugs into another person’s drink or directly into their body without their knowledge or consent and it is against the law to do this. In the past, spiking has been associated with further crimes against the victim including robbery or sex offences."
        },
        {
            "heading": 3,
            "text": "How common is spiking?"
        },
        {
            "text": "A Home Affairs Select Committee report published in April found that the true prevalence of drink and needle spiking remains unknown – though a recent survey by the Alcohol Education Trust suggested more than 1 in 10 students had been victims of spiking. Attention on the issue has grown recently, and last year students across the country took part in a mass boycott of nightclubs following a spate of reported attacks in Nottingham, Exeter, Birmingham, Southampton, and other university towns across the UK."
        },
        {
            "heading": 3,
            "text": "What is the government doing to tackle spiking?"
        },
        {
            "text": "The Government has already taken action to reclassify GHB and closely related substances, which have been used for drink spiking. It is committed to going further to tackle this issue and, including through setting up the new working group, is working with law enforcement, local authorities, and other key partners to consider what can be done to tackle these horrific crimes. This includes considering the case for a specific criminal offence for spiking. The government has also provided funding through the Safety of Women at Night and Safer Streets funds to support initiatives which prevent people from becoming victims of spiking."
        },
        {
            "heading": 3,
            "text": "What will this new spiking working group do? "
        },
        {
            "text": "In March, the government brought together various people including police, university representatives and campaigners to talk about the issue and it was agreed that a coordinated approach to the issue was necessary. This new group will ensure that all bodies with a role to play as well as those with special expertise and experience can work together.  Professor Lisa Roberts, University of Exeter Vice Chancellor, will lead the group and coordinate the higher education sector’s response to the issue – with the aim that recommendations are made for universities to adopt before the autumn term, and that every university has policy in place by the end of the year."
        },
        {
            "heading": 3,
            "text": "What else is the government doing to tackle violence against women and girls?"
        },
        {
            "text": "We’ve encouraged universities to take a pledge to end the use of non-disclosure agreements (NDAs) to silence victims of sexual harassment, bullying and abuse. NDAs are effectively gagging contracts that prevent people from speaking publicly about issues. Over 50 higher education providers have signed up. You can read more here."
        },
        {
            "text": "The government is taking significant action to tackle crimes that disproportionately affect women and girls. Our Violence Against Women and Girls Strategy will drive long-term change to prevent more of these crimes from happening in the first place, bring perpetrators to justice and ensure victims get the support they need. We are committing to radically changing how we end violence against women and girls with a whole system approach focusing on: prioritising prevention, supporting survivors, pursuing perpetrators, underpinned by a stronger system. This details a number of steps, including immediate investment in measures to make our streets safer, more funding for specialist support services, and a large scale public behaviour campaign to challenge."
        }
    ]
}