{
    "url": "https://prisonjobs.blog.gov.uk/2022/05/24/why-mental-health-support-is-so-important-in-the-youth-estate/",
    "title": "Why mental health support is so important in the Youth Estate",
    "authors": [
        "Dr Varinder Panesar"
    ],
    "categories": [
        "Personal stories"
    ],
    "pub_date": "2022-05-24T17:22:17+01:00",
    "content": [
        {
            "heading": 4,
            "text": "Dr Varinder Panesar is a forensic psychologist in the Wellbeing Team at Feltham Young Offenders Institute (YOI) in West London. She shares why understanding the role of trauma and creating a safe, mental health-informed environment can be game-changing for youth offenders. Alongside proven mental health-boosters like access to sports and a library, Feltham’s staff take the time to understand every boy’s story – with the hope of stopping the cycle of offending."
        },
        {
            "text": "“Recent evidence has indicated that the number of young people coming into custody with mental health needs has grown significantly over the last few years."
        },
        {
            "text": "These young people demonstrate needs in multiple areas and with behaviour that present a high risk to themselves and others – or from others. This means that traditional interventions do not work for them."
        },
        {
            "text": "Typically, these are the young people who have challenged whole systems where community teams have not been successful at engaging them – they are high-risk, high-harm and high-vulnerability."
        },
        {
            "text": "If they have engaged with community teams, they may have picked up a number of labels from a variety of professionals, e.g. ‘conduct disorder’, ‘complex trauma’, ‘learning disability’, ‘ADHD’, ‘Autism’, ‘Attachment Disorder’."
        },
        {
            "text": "Labels do not give us much information about what has happened to these young people in their lives so far, what threats they have faced, what they have had to survive, and what strengths they have.”"
        },
        {
            "text": "\nWhy trauma can lead to offending"
        },
        {
            "text": "“We know that ‘normal’ adolescent behaviour is characterised by risk-taking, impulsive behaviour and difficulty thinking about consequences of actions."
        },
        {
            "text": "These typical characteristics are exacerbated by early traumatic experiences which change the structure and chemistry of the brain and lead to abnormal reactions to stress and difficulty in trusting others."
        },
        {
            "text": "The young people coming into the youth estate have typically experienced a high number of adverse childhood experiences in their families of origin (e.g. abuse, neglect, domestic violence) and/or their local communities (e.g. experiencing or witnessing serious violence). Many of them are living with active trauma symptoms resulting in constant high levels of hypervigilance about their surroundings and the intentions of others."
        },
        {
            "text": "Due to how much trauma they may have seen or been through, their brains are not able to effectively differentiate between a real and perceived threat. This makes it more likely that young people will struggle to assess danger accurately and therefore engage in high-risk, reckless, or self-destructive behaviours (e.g. carrying weapons) as a way to feel safe, which inadvertently results in the cycle of offending behaviour continuing.”"
        },
        {
            "text": "How Feltham’s trauma and mental health-informed environment helps"
        },
        {
            "text": "“Supporting mental health for children in our care comes not just from the therapeutic input of our dedicated Wellbeing Mental Health Team but is a foundation of everything that happens here at YOI Feltham."
        },
        {
            "text": "The centre has adopted a ‘whole-prison’ approach to supporting the mental health needs of each young person by taking the time to collaboratively understand each boy’s story (i.e. what has led them to offending and being in custody) in weekly meetings that are attended by a representative from each agency, including prison officers."
        },
        {
            "text": "Every member of operational staff receives training in the core concepts of attachment, child and adolescent development and trauma. This means prison staff can be empowered to understand the needs behind the presenting challenging behaviour and change their interactions with the young person to support them more effectively."
        },
        {
            "text": "Prison officers take on the role of ‘therapeutic parents’ and therefore understand that every interaction they have with a young person matters because every interaction has the power to shape behaviour.”"
        }
    ]
}