{
    "url": "https://cyberandspecialistoperationscommand.blog.gov.uk/2024/07/11/army-swimming-team/",
    "title": "Army swimming team in overseas training camp",
    "authors": [
        "abievans"
    ],
    "categories": [
        "Gibraltar",
        "Overseas Bases"
    ],
    "pub_date": "2024-07-11T12:50:50+01:00",
    "content": [
        {
            "text": "The Army Swimming Team recently spent two weeks in Gibraltar as part of their Overseas Training Course in preparation for the upcoming Inter-Services Competition to be held at Aldershot Garrison Sports Centre in July."
        },
        {
            "text": "25 swimmers, from across a range of Corps and Cap badges, and 4 support staff arrived on the Rock to make use of the facilities in Lathbury Sports Complex."
        },
        {
            "text": "During their overseas training camp, the athletes took part in several land training sessions, including strength, and conditioning training as well as several pool sessions, both in Helm Point on the Four Corners Military Housing Estate and up at the Lathbury Sports Complex."
        },
        {
            "text": "Army Swimming Team Manager, Major Marcus Roberts, said: “It has been great being out here in Gibraltar. The Lathbury Sports Complex is unbelievable and has been an invaluable part of our training."
        },
        {
            "text": "Having the use of the Helm Point pool based on the estate has also been a huge benefit to the team, particularly so we can enjoy the fantastic weather in Gibraltar. It makes all the difference.”"
        },
        {
            "text": "The Army Team, which comes from a vast array of Corps and Cap badges, were given a tour of Gibraltar, including the Upper Rock, by teammate and local Gibraltarian swimmer Private Jordan Gonzalez, from the Band of the Royal Gibraltar Regiment."
        },
        {
            "text": "Assistant Army Swimming Team Manager, Major Steve Clench, said: “We do not usually get to train as a team back in the UK, so this was a unique moment for the swimmers."
        },
        {
            "text": "“We have been the double champions for two years running so we are hoping the training we are doing will help us take the title once again.”"
        },
        {
            "text": "Having since returned to the UK, the Army triumphed over the Royal Navy and Royal Air Force in the Inter-Services for a third year running."
        }
    ]
}