{
    "url": "https://hmlandregistry.blog.gov.uk/2024/07/11/changes-to-our-address-for-service-policy-and-practices/",
    "title": "Changes to our address for service policy and practices",
    "authors": [
        "David Linn, Practice Team Lead"
    ],
    "categories": [
        "Law and practice"
    ],
    "pub_date": "2024-07-11T09:13:35+01:00",
    "content": [
        {
            "text": "We are constantly looking to improve clarity and consistency, as well as aiming to reduce the number of requisitions we send. With these aims in mind, we have changed our policy on addresses for service."
        },
        {
            "heading": 2,
            "text": "What is happening?"
        },
        {
            "text": "We use addresses for service to contact applicants and to get in touch with property owners when we need to.  "
        },
        {
            "text": "Apart from applications made solely to change ownership of land or property, customers now need to formally apply to change an address for service as part of their larger application.  "
        },
        {
            "heading": 2,
            "text": "What this means for conveyancers"
        },
        {
            "text": "This means that if you want to update a registered proprietor’s address for service you must include a change of address for service transaction within the application. We no longer check across deeds and documents and either assume panel 9 of the e-AP1 is correct or raise a requisition if we find a discrepancy. "
        },
        {
            "text": "Digital Registration Service (DRS) customers should add the ‘Change of address for service’ transaction from the drop-down menu and upload evidence as prompted on screen. "
        },
        {
            "text": "Business Gateway and postal customers should include ‘Change of address for service’ in the ‘Application, priority and fees’ section. "
        },
        {
            "text": "If you are using a paper form AP1, you must clearly state the address for service in panel 9 and make an application to update the address for service in panel 4. If it is not clear that you act for the registered proprietor however, we will not change the address, but we will issue a stock letter on completion of the application or add it to any requisitions arising. "
        },
        {
            "heading": 2,
            "text": "Service enhancements to come"
        },
        {
            "text": "We will be supporting this change with enhancements to our external services and guidance in due course. Once these are in place, when submitting non-change of ownership applications through the HM Land Registry portal, customers will be prompted to consider applying to update the address for service. "
        },
        {
            "text": "For Business Gateway users, we are working to ensure the ‘Application, priority and fees’ data will auto populate when an address is added to the field ‘Name and address(es) for service of the proprietor of any new charge to be entered in the register’."
        },
        {
            "text": "At present, however, all customers should follow the relevant existing process for making an application. "
        },
        {
            "heading": 2,
            "text": "Why we are doing this"
        },
        {
            "text": "Currently, confusion can arise as to whether an address for service needs to be updated or not. Our new, more streamlined approach should ensure greater consistency, as well as encouraging applications that are clear and correct from the outset.  "
        },
        {
            "text": "While service enhancements will eventually help, our aim is to eliminate confusion as soon as we can, to tackle inconsistency and reduce the number of requisitions we send. "
        },
        {
            "heading": 2,
            "text": "Points to note "
        },
        {
            "text": "If your application is solely to change ownership, our existing practice stands. You need to provide an address for service, which we will take from the details you submit.  "
        },
        {
            "text": "For all other applications, we will only consider a change of address when you formally apply to update it. So, for example, if you are using DRS, add the transaction ‘Change of address for service’ to your application from the drop-down menu. When you download the e-AP1 to check the details, it won’t have auto-populated into the ‘address for service’ section (panel 9), but it will be listed in the ‘Application, priority and fees’ section (panel 4).  "
        },
        {
            "text": "You will also need to upload the right evidence, such as correspondence that makes it clear what the new address for service should be, and that you have the authority to make this change."
        },
        {
            "text": " We will take no further action if you submit evidence of a change of address without making a specific application on the relevant form."
        },
        {
            "text": "You will find more process-related articles in our monthly newsletter for conveyancing professionals, Practice and Process, along with a round-up of recent practice changes and what they mean for you."
        },
        {
            "text": "If you haven’t done so already, sign up to Practice and Process now."
        },
        {
            "text": "  "
        }
    ]
}