{
    "url": "https://deframedia.blog.gov.uk/2024/07/11/coverage-of-secretary-of-state-steve-reeds-attendance-at-the-great-yorkshire-show/",
    "title": "Coverage of Secretary of State, Steve Reed’s attendance at the Great Yorkshire Show",
    "authors": [
        "Defra Press Office"
    ],
    "categories": [
        "Farming"
    ],
    "pub_date": "2024-07-11T17:10:19+01:00",
    "content": [
        {
            "text": "There has been significant coverage of the Secretary of State for Environment, Food and Rural Affairs, Steve Reed’s first official visit since taking office at the Great Yorkshire Show. The Secretary of State met with farmers and stakeholders, including visits to the NFU and CLA stands. Farming Minister Daniel Zeichner also attended the event."
        },
        {
            "text": "In a speech given by the Secretary of State at the CLA breakfast he reaffirmed the government’s commitment to provide a new deal for farmers. This included seeking a new veterinary agreement with the EU to get food exports moving; cutting energy bills for farmers by switching on GB Energy and tackling fairness in the supply chain."
        },
        {
            "text": "In broadcast, BBC News Look North covered the Secretary of State’s visit to the Great Yorkshire Show and the new government’s food and farming policy plans. This included an interview with the Secretary of State where he stated that “farming is an absolute priority” and that for the government “food security is national security”. The broadcast also included an interview with Rachel Hallos, Vice President of NFU, where she said felt reassured after meeting the Secretary of State and outlined what she wanted to see from the new government."
        },
        {
            "text": "Elsewhere, in regional press various outlets picked up the visit including Yorkshire Post and the Northern Echo who included the government’s commitment to Environment Land Management schemes and the Secretary of State’s assurance he will “fight the corner on the budget”. BBC Yorkshire ran an online piece positively titled: “Farmers ‘cautiously hopeful’ for new government” which included interviews with NFU farmers and the Secretary of State."
        },
        {
            "text": "In trade media, Farmers Weekly ran a piece outlining the key priorities the Secretary of State set out at the show and the piece started on the assurance he made on fighting the corner for farmer son the budget."
        },
        {
            "text": "Finally, BBC Farming Today focused their latest episode on the Great Yorkshire Show meeting with show organisers, farmers and the Secretary of State. In the episode they included the full recording of the media huddle held with the press and Secretary of State. Overall, the Secretary of State’s answers to questions were carried well throughout the coverage."
        },
        {
            "text": "Secretary of State for Environment, Food and Rural Affairs Steve Reed said:"
        }
    ]
}