{
    "url": "https://space.blog.gov.uk/2024/07/11/noctilucent-clouds-and-meteor-showers-the-night-sky-in-july-2024/",
    "title": "Noctilucent Clouds and meteor showers: the night sky in July 2024",
    "authors": [
        "Derek Smale"
    ],
    "categories": [
        "Astronomy"
    ],
    "pub_date": "2024-07-11T15:17:07+01:00",
    "content": [
        {
            "text": "With two meteor showers, the star-packed band of our Milky Way Galaxy arching overhead and the chance of seeing Noctilucent Clouds, July is a great month for a night of stargazing."
        },
        {
            "heading": 2,
            "text": "The Milky Way Core"
        },
        {
            "text": "When you look low in the southern sky during the night this month, you’re looking in towards the centre of our Milky Way Galaxy. The ‘core’ lies around 25,000 light years away in the direction of the constellations of Sagittarius, Ophiuchus and Scorpius. You can use the star map below to locate these constellations for yourself."
        },
        {
            "text": "From darker skies away from the bright lights of our towns and cities, this is visible as a brighter and wider part of the star-packed pale band of light that stretches across the night sky, marking the plane of our galaxy."
        },
        {
            "text": "The brightest star in this part of the sky is Antares, the heart of the constellation of Scorpius. Antares is red super-giant star that lies around 550 light years away, and is a remarkable 700 times larger than our Sun. Placed at the centre of our solar system, it would extend out to between the orbits of Mars and Jupiter, and shine 10,000 times brighter than our Sun."
        },
        {
            "text": "At around 11 million years old (a stellar infant compared to our 4.5-billion-year-old Sun) Antares is expected to burn through the last of its fuel within the next million years, before exploding as a supernova."
        },
        {
            "text": "This month the band of our Milky Way Galaxy is a spectacular sight from darker skies, arching up from the core in the south, passing high overhead through the constellation of Cygnus, and down through Cassiopeia towards Perseus and Auriga low on the northern horizon."
        },
        {
            "text": "Noctilucent Clouds are earth’s highest clouds, and are formed by ice crystals floating on the edge of space over 80km (50 miles) up in our atmosphere. While the Sun is below the horizon for those of us on the ground, the high altitude of these ice crystals means they are under-lit by the Sun, causing them to glow silvery-blue in our night sky."
        },
        {
            "text": "Studies have shown that the dust from meteors that have entered our atmosphere and burned up is a key component in forming these clouds, binding the ice-crystals together. Noctilucent Clouds have also been linked to volcanic activity, leading scientists to believe volcanic ash may cause a similar affect."
        },
        {
            "text": "Noctilucent Clouds form nearer polar regions as that is where the mesosphere is coldest (around -120 degrees Celsius), and as a result tend only to be visible at latitudes of 50 degrees or more above or below the equator."
        },
        {
            "text": "Thankfully this means this spectacular night sky sight can be spotted across the UK, and the angle of the Sun’s light means Noctilucent Clouds are usually spotted in the northern sky an hour or two after sunset and before sunrise. Look for the characteristic glow and the appearance of ‘texture’ or patterns within them, compared to the darker, featureless ‘blobs’ of normal clouds that lie at much lower altitudes."
        },
        {
            "heading": 2,
            "text": "Other Night sky sights – the Planets and the Summer Triangle"
        },
        {
            "text": "Several planets of our solar system line up in the eastern pre-dawn skies this month. Saturn is the brightest object in the south-eastern sky, while Mars and bright Jupiter lie a little lower to the north-eastern horizon as the morning skies start to lighten."
        },
        {
            "text": "Look high overhead as darkness falls, and the first three stars to emerge will be those of the ‘Summer Triangle’. These bright stars are Vega (in constellation Lyra), Altair (constellation Aquila) and Deneb (constellation Cygnus)."
        },
        {
            "text": "Vega and Altair are bright because they are relatively close to our Sun, being around 25 and 16 light-years away respectively. Deneb however is believed to be between 1,500 and 2,500 light-years away, and appears bright because it is between 100 and 200 times larger than our Sun."
        },
        {
            "text": "If Deneb was the same distance from us as the other stars of the summer triangle, it would be the brightest star in our sky, visible during the day and casting shadows at night!"
        },
        {
            "heading": 2,
            "text": "Meteor showers"
        },
        {
            "text": "Two meteor showers, the Delta Aquarids and the Alpha Capricornids, peak at the end of this month.  These overlap with the start of next month’s Perseids shower, so it’s a great time to see if you can spot any meteors streaking across the night sky."
        },
        {
            "text": "The meteors we see are fragments of rock, dust and ice that trail around the orbits of the comets of our Solar System, falling into our atmosphere at great speeds and burning up, creating glowing streaks across the night sky."
        },
        {
            "text": "Be sure to join us next month for more information on August’s Perseid meteor shower, one of the highlights of the astronomy calendar!"
        }
    ]
}