{
    "url": "https://defraenvironment.blog.gov.uk/2024/07/11/trees-for-bees-how-wakehurst-is-using-citizen-science-to-help-pollinators/",
    "title": "Trees for bees: how Wakehurst is using citizen science to help pollinators",
    "authors": [
        "Sian Watts",
        "Janine Griffiths-Lee"
    ],
    "categories": [
        "Gardening",
        "Nature",
        "Plants",
        "Pollinators"
    ],
    "pub_date": "2024-07-11T08:54:11+01:00",
    "content": [
        {
            "text": "It’s Bees’ Needs Week. Every year, Defra and other organisations work in partnership to raise awareness of the importance of pollinators, and to share ideas on how to support them."
        },
        {
            "text": "My name is Sian and I work in the Pollinators and Biodiversity Pressures team at Defra."
        },
        {
            "text": "On Monday, I told you about the 5 simple actions you can take to help pollinators. Everyone has a part to play to encourage more pollinators in their local area."
        },
        {
            "text": "In this post, you can learn about Wakehurst, Kew's wild botanic garden in the heart of rural Sussex, and what they’re doing to help pollinators."
        },
        {
            "text": "I sat down with Wakehurst’s pollination research lead Dr Janine Griffiths-Lee to find out more."
        },
        {
            "text": "Postdoctoral Research Associate, Janine, is using Wakehurst’s tapestry of landscapes as a living laboratory, investigating which habitats, plants and trees provided the most benefits to pollinators. Through citizen science studies, onsite surveys and pollen analysis in the labs, she’s getting to know Wakehurst’s pollinator population, and how they behave across this 535-acre site."
        },
        {
            "text": "Janine, what does Bees’ Needs Week mean to you?"
        },
        {
            "text": "Bees’ Needs Week is an important event in the bee calendar, helping raise awareness of the importance of pollinators and educating people about how they can help our pollinators thrive."
        },
        {
            "text": "It also helps promote the work that we and many other organisations around the country are doing to conserve our wild bee species."
        },
        {
            "text": "How is Wakehurst marking Bees’ Needs Week?"
        },
        {
            "text": "At Wakehurst, we are promoting the ’Trees for bees’ citizen science project."
        },
        {
            "text": "This fun and engaging project is free to take part in, and takes you on a walk through the diverse, amazing landscape at Wakehurst, where we ask visitors to stop by certain trees and count the insect visitors. We have a ‘Trees for bees’ app, which makes the whole process easy and enjoyable!"
        },
        {
            "text": "At Kew, we also hosted a Bees’ Needs Event with our partner organisations: the UK Centre for Ecology & Hydrology, Reading University, and Pollinating London Together."
        },
        {
            "text": "You can find more about this in our latest episode of Kew’s podcast Unearthed: Nature needs us, as environmentalist ‘Birdgirl’ Dr Mya-Rose Craig speaks to experts about our pollination research and other nation-wide conservation projects."
        },
        {
            "text": "Beyond Bees’ Needs Week, we’ll continue to work on raising awareness of how pollinator health connects to the health of humans and the planet."
        },
        {
            "text": "Can you tell us more about the ‘Trees for bees’ project?"
        },
        {
            "text": "The project is part of the pollination research stream of Wakehurst’s Nature Unlocked pollinator science programme."
        },
        {
            "text": "It investigates which species of tree are the best for a diverse range of pollinators. We have 1,500 species of tree and woody plants at Wakehurst, so it’s the ideal location to answer this question!"
        },
        {
            "text": "Where did the project idea come from?"
        },
        {
            "text": "Many studies on habitat management for pollinators focus on wildflowers and agricultural landscapes."
        },
        {
            "text": "In our urban centres where space is limited and there isn’t room for swathes of meadows, we could plant a diverse range of tree species that take up less space. They’d be like 3-dimensional sky meadows and provide lots of pollen and nectar to our pollinators."
        },
        {
            "text": "But to inform landscape planning we first need to find out which are the best trees to plant, and that’s what this project is all about."
        },
        {
            "text": "How can people get involved in the ‘Trees for bees’ project?"
        },
        {
            "text": "It’s easy to get involved! Once you arrive at Wakehurst you can pick up a guide from the Visitor Centre or access the free app on your mobile."
        },
        {
            "text": "Look at the calendar in the guide, which tells you which trees should be in flower the month you visit. Then follow the map to the tree of interest. Once you find the tree, you use the ‘Trees for bees’ app to count down 3 minutes while you count the insects you see visiting the tree."
        },
        {
            "text": "The guide tells you about the different pollinator groups and you don’t need to be an expert to take part. You can do as many or as few tree visits as you like – every visit helps!"
        },
        {
            "text": "The project is so much fun to do but more importantly, citizen scientists get to contribute to a real science project and make an impact."
        },
        {
            "text": "Play your part this Bees’ Needs Week"
        },
        {
            "text": "Many people across the UK are already doing their bit to help pollinators."
        },
        {
            "text": "You can help too."
        },
        {
            "text": "If you’re not able to visit Wakehurst, you can do a pollinator count at home instead. Read our previous blog post for more information on how to do your own count."
        },
        {
            "text": "For further information on pollinators and how to help them, visit the Bees’ Needs website."
        }
    ]
}