{
    "url": "https://stratcommand.blog.gov.uk/2024/07/11/vrsm-medals/",
    "title": "B Company volunteer reserve service medals awards ceremony",
    "authors": [
        "abievans"
    ],
    "categories": [
        "Gibraltar"
    ],
    "pub_date": "2024-07-11T12:43:16+01:00",
    "content": [
        {
            "text": "The Royal Gibraltar Regiment’s B Company recently came together to honour the achievements of several of its members."
        },
        {
            "text": "Following their evening drills, a parade was held to recognise their dedication to the Royal Gibraltar Regiment Reserves."
        },
        {
            "text": "The Volunteer Reserve Service Medal and Clasps are awarded to personnel of all ranks in recognition of long and efficient service and exemplary conduct in the Volunteer Reserve Forces."
        },
        {
            "text": "Reservists must have completed their mandatory training commitment in nine of the 10 qualifying years and their service deemed as efficient."
        },
        {
            "text": "During the ceremony, the Royal Gibraltar Regiment’s Commanding Officer, Lieutenant Colonel Matthew Moore, presented Volunteer Reserve Service Medals to three deserving individuals."
        },
        {
            "text": "The Volunteer Reserve Service Medal acknowledges 10 years of loyal service in the Reserves."
        },
        {
            "text": "These were awarded to Major Bonfante, Lieutenant Diani, and Corporal Hughes."
        },
        {
            "text": "Alongside this, clasps were awarded to those who had served an additional five years beyond their initial 10-year commitment."
        },
        {
            "text": "Sergeant Vinas was awarded a 2nd clasp and Warrant Officer Class 2 Brosco was awarded a 3rd clasp for their dedication and service to the Reserves."
        },
        {
            "text": "A highlight of the event was the presentation of a 4th clasp and a Gold Rosette to Lance Corporal Balloqui. This recognition marks an incredible 30 years of service within the RG Reserves."
        },
        {
            "text": "The Volunteer Reserve Service Medal awards represent the commitment and perseverance of these individuals. Their dedication serves as an inspiration to the entire B Company. The ceremony fostered a sense of camaraderie and appreciation for those who have given so much to the Reserves."
        }
    ]
}