{
    "url": "https://ukhsa.blog.gov.uk/2024/07/11/whooping-cough-my-daughter-spent-the-third-week-of-life-in-an-induced-coma/",
    "title": "Whooping cough: my daughter spent the third week of life in an induced coma",
    "authors": [
        "Blog Editor"
    ],
    "categories": [
        "Children and Young people",
        "immunisations"
    ],
    "pub_date": "2024-07-11T13:12:27+01:00",
    "content": [
        {
            "text": "Our daughter Layla was born at 36 weeks in July 2012 and at just 10 days old Layla developed a cough. We had her checked twice by our GP, and she was diagnosed with a viral infection."
        },
        {
            "text": "Around four days later, Layla was having a bout of coughing when she went blue and stopped breathing – I was terrified."
        },
        {
            "text": "Thankfully, I was able to get her breathing by picking her up and rubbing her back. We called 999 and were taken to Accident & Emergency (A&E) at our local hospital, where doctors suspected she had whooping cough."
        },
        {
            "text": "Layla turned grey twice while at the hospital, but fortunately the doctors were able to help clear her airway."
        },
        {
            "text": "Layla stayed overnight for observation, and the next morning it was decided that her condition was so serious she needed to be cared for by the Paediatric Intensive Care Unit (PICU) at St Mary's hospital."
        },
        {
            "text": "We were taken to St Mary’s by ambulance and it wasn't long before Layla was intubated, put in an induced coma and given IV antibiotics – we were told this would give her the best chance of survival."
        },
        {
            "text": "When Layla was first taken to PICU the doctor sat us down and explained that she couldn't give us any guarantees that our daughter would survive."
        },
        {
            "text": "I was already struggling with Post Natal Depression and so my mental health took a further hit."
        },
        {
            "text": "Layla spent the third week of her life in an induced coma. It would take a week until she would be well enough to wake and have her breathing tube removed."
        },
        {
            "text": "Thanks to the amazing doctors and nurses, caring for her around-the-clock, Layla was well enough to come home and would make a full recovery."
        },
        {
            "text": "Layla’s fight with whooping cough didn’t end when we left the hospital, the cough lasted for 3 months in total. The whole experience was so traumatic, as you can imagine. But we were fortunate to have the support of our families, friends and the dedicated NHS staff."
        },
        {
            "text": "In 2014 I became pregnant with our son Thomas, we were so fortunate this time to have the pertussis vaccine available for pregnant women, and of course I didn't hesitate to have it."
        },
        {
            "text": "The vaccine made me feel reassured that we wouldn’t have to go through the same ordeal again."
        },
        {
            "text": "I would urge any pregnant woman who has not received the vaccine to talk to a health professional about any concerns you may have. Don't ask people online!"
        },
        {
            "text": "Without the vaccine your baby is vulnerable to whooping cough within the first 8 weeks of life and that is a scary thing to contemplate with the rising cases currently in the UK."
        },
        {
            "text": "Our daughter is now a healthy 11-year-old but our story could've been so different, many others haven't been so fortunate."
        },
        {
            "text": "From one parent to another, please get vaccinated and don't risk going through the hell that we did."
        }
    ]
}