{
    "url": "https://civilservice.blog.gov.uk/2026/02/18/a-year-of-partnership-and-progress-for-the-leeds-health-and-social-care-hub/",
    "title": "A year of partnership and progress for the Leeds Health and Social Care Hub",
    "authors": [
        "Kathryn McCarter"
    ],
    "categories": [
        "Uncategorized"
    ],
    "pub_date": "2026-02-18T10:28:39+00:00",
    "content": [
        {
            "text": "2025 marked a transformative year for the Leeds Health and Social Care Hub, cementing its position as a pioneering model of collaboration between national government and local health and care systems. Emma Heeson, Head of the Hub, tells us more."
        },
        {
            "text": "The Hub brings together DHSC and local delivery partners including NHS trusts, Leeds City Council, third sector organisations, higher education institutions, and Leeds and West Yorkshire businesses. It aims to bridge the gap between policy and practice by bringing civil servants closer to frontline professionals and people with lived experience."
        },
        {
            "heading": 3,
            "text": "2025 key achievements"
        },
        {
            "text": "In June, the Hub achieved national recognition when Leeds was announced as a Thematic Campus designed to address systemic challenges across the UK. As the designated campus for the health mission under the Civil Service Places for Growth Strategy, the Hub focuses on neighbourhood health as a central pillar of the 10 Year Health Plan."
        },
        {
            "text": "In September, the Hub led DHSC’s formal application to become the newest member of the prestigious Leeds Anchor Network (LAN). LAN brings together 13 influential organisations including 3 NHS trusts, academic partners, and utility industry partners. By joining LAN, DHSC committed to being an employer ‘of’ the city, not just ‘in’ it."
        },
        {
            "text": "The Hub is also building partnerships with the Leeds Business Anchor Network and Leeds Community Health Anchor Network, creating a network that connects public, private, and community sectors – providing unique opportunities to access diverse expertise and ensure lived experience shapes policy development."
        },
        {
            "text": "Tom Riordan, Second Permanent Secretary DHSC, said:"
        },
        {
            "text": "“2025 has been a landmark year for the Leeds Health and Social Care Hub. Being named as a Thematic Campus reflects the strength of our partnerships across the city and our commitment to developing policy that’s grounded in the reality of frontline delivery."
        },
        {
            "text": "“The Hub demonstrates what’s possible when national and local governments work together with a shared purpose – connecting policy to practice and ensuring the voices of citizens, clinicians and practitioners shape decisions that affect their lives. Leeds is showing how place-based collaboration can drive meaningful change for communities across the country.”"
        },
        {
            "text": "To find out how the Hub can help your policy area, email emma.heeson@dhsc.gov.uk"
        }
    ]
}