{
    "url": "https://mhclgmedia.blog.gov.uk/2026/02/18/coverage-of-new-political-donation-rules/",
    "title": "Coverage of new political donation rules",
    "authors": [
        "mhclgpress"
    ],
    "categories": [
        "Elections"
    ],
    "pub_date": "2026-02-18T16:49:15+00:00",
    "content": [
        {
            "text": "There has been significant coverage in the media of our changes to political finances."
        },
        {
            "text": "These tough new rules will protect our democracy against foreign interference and respond to longstanding stakeholder recommendations, including from the Ethics and Integrity Commission (formerly the Committee on Standards in Public Life) and the Electoral Commission."
        },
        {
            "text": "Some stakeholders have called for a single test to determine eligibility for company donations. We have gone beyond this by introducing three new tests a company must meet.  Here is some more on what the new changes propose:"
        },
        {
            "text": "What are the three new tests?"
        },
        {
            "text": "Together, these three new tests provide a much more robust framework to ensure only companies with a legitimate connection to the UK can influence UK politics."
        },
        {
            "text": "What else is changing?To go even further, under our new Know Your Donor requirements recipients of significant donations from companies will also need to conduct a risk assessment to judge the likelihood of foreign or illicit sources of funding. We are also requiring donors to declare any benefits linked to their donation, improving the transparency around the true source of a donation."
        },
        {
            "text": "These measures work together to close loopholes and strengthen rules at all stages in the political donations process, providing stronger safeguards against malign foreign actors who seek to undermine our democracy."
        },
        {
            "text": "This is all part of the biggest expansion of democratic participation in a generation being delivered through the Representation of the People Bill –  extending voting rights in all UK elections to  16 and 17 year olds and reinforcing the government’s zero-tolerance approach to foreign interference in UK democracy."
        }
    ]
}