{
    "url": "https://space.blog.gov.uk/2026/02/18/first-impressions-of-working-in-nspoc/",
    "title": "First Impressions of Working in NSpOC ",
    "authors": [
        "UK Space Agency"
    ],
    "categories": [
        "NSpOC",
        "Space surveillance and tracking"
    ],
    "pub_date": "2026-02-18T10:40:33+00:00",
    "content": [
        {
            "text": "The UK National Space Operations Centre (NSpOC) is responsible for developing and operating the UK’s space surveillance and protection capabilities. Today we talk to James Carmichael, Deputy Head (Civil Operations) who recently joined NSPOC and has responsibility for civil operations.  "
        },
        {
            "heading": 3,
            "text": "Q1: James, what was your background before joining NSpOC, and how did you feel about the opportunity? "
        },
        {
            "text": "My substantive role is within the UK Space Agency’s office of regulation, where I support development of UK space policy across government and industry. Before that, my background was in emergency planning and resilience, with about 10 years in the public and third sectors and prior experience in private security. "
        },
        {
            "text": "When the chance to support NSpOC came up, I was immediately attracted. It offered the chance to deepen my knowledge in a technically complex operational environment while applying my planning and response experience to help develop national capability. "
        },
        {
            "heading": 3,
            "text": "Q2: What were your first impressions of the team and environment? "
        },
        {
            "text": "The team’s enthusiasm was striking and this is a new and exciting operational area. I also quickly realised how much I had to learn, and how quickly. NSpOC’s mission spans technical processes, analysis, communication, and stakeholder engagement. From the start, the team’s expertise was clear, and they’ve been hugely supportive in getting me up to speed. "
        },
        {
            "heading": 3,
            "text": "Q3: What does a typical week look like for you? "
        },
        {
            "text": "No two days are the same. A core part of my role is ensuring rapid response to potential space-related risks. That means supporting the ALERT function — providing actionable intelligence on re-entries, conjunctions (potential collisions), and launches that may affect UK space assets. This work directly supports national resilience and protects critical infrastructure."
        },
        {
            "text": "Beyond incident response, I coordinate planning with analysts, military colleagues, and external stakeholders to progress projects and improve capability. Engagement with government partners is key to ensuring NSpOC delivers products that meet national Space Domain Awareness* needs. "
        },
        {
            "heading": 3,
            "text": "Q4: Any memorable events or learning moments so far?"
        },
        {
            "text": "Every day is a learning opportunity. NSpOC only recently marked its first year of operation, so we’re constantly refining processes. One notable case — before I joined — was the break-up of a launch vehicle over a UK overseas territory. It highlighted the importance of timely expertise to support cross-government responses. That case has since been used to improve tactical planning and readiness for similar events. "
        },
        {
            "heading": 3,
            "text": "Q5: What has intrigued you most about NSpOC’s role in the UK’s wider space strategy? "
        },
        {
            "text": "I’ve been most interested in how NSpOC serves as a focal point for government interest in space. It bridges civil and military domains, offering technical expertise and operational capability to inform and protect space infrastructure. Its work connects to policy, sustainability, and national security — making it central to the UK’s future operations in space. "
        },
        {
            "heading": 3,
            "text": "Q6: From your perspective, what value does NSpOC bring to the UK? "
        },
        {
            "text": "On the civil side, NSpOC provides validated, actionable intelligence that enables informed government decision-making. It also underpins policy development by supplying up-to-date information on the space environment, while delivering time-sensitive intelligence during risk events. "
        },
        {
            "text": "The potential of this capability is still emerging. As global norms evolve around issues like Space Traffic Co-ordination and Management and sustainable practice, the UK’s ability to contribute credible operational expertise will become increasingly important. "
        },
        {
            "heading": 3,
            "text": "Q7: Looking back on your first few months, what have you learned — professionally or personally? "
        },
        {
            "text": "The biggest lesson has been the importance of joint working. NSpOC engages a broad set of partners across government, industry, and the military, as well as internationally. With so many stakeholders and such a high technical ceiling, programme management and shared situational awareness are critical. It’s been a fast-moving and eye-opening environment. "
        },
        {
            "heading": 3,
            "text": "Q8: And outside of work, what do you enjoy? "
        },
        {
            "text": "Outside of work I have a large (growing) number of hobbies and interests. I’m in my fifth year of a Planetary Science and Astronomy degree with the Open University. At home, we have a Husky called Bear, four hens, and several beehives. I also enjoy art, sewing, reading, gaming, and motorcycling — though I’m between bikes at the moment. "
        },
        {
            "text": "*Space Domain Awareness (SDA): The provision of security-focused, decision-quality information that can be used to successfully mitigate adversary space effects while supporting the integration of allied space effects into multi-domain operations. Note: space domain awareness is derived from the fusion and aggregation of broader intelligence and knowledge of the terrestrial domains with space situational awareness and space surveillance and tracking data "
        }
    ]
}