{
    "url": "https://sustainableict.blog.gov.uk/2026/02/18/how-were-making-technology-procurement-more-sustainable/",
    "title": "How we’re making technology procurement more sustainable",
    "authors": [
        "Harry Kenny"
    ],
    "categories": [
        "Sustainable ICT",
        "Sustainable procurement"
    ],
    "pub_date": "2026-02-18T12:46:40+00:00",
    "content": [
        {
            "text": "Harry Kenny talks about how in Defra we are reimagining our approach to technology procurement."
        },
        {
            "text": "In Defra, we are putting this approach into practice through our new End User Services (EUS) contract. This is the contract that provides laptops, phones, and tablets to colleagues. We are the first government department to adopt refurbished and remanufactured laptops at scale as part of a broader commitment to more sustainable technology use."
        },
        {
            "text": "Remanufactured devices are used devices that are restored to meet the same quality standards as new devices. The parts have been broken down to their individual components and rebuilt back to the manufacturer’s specification using both old and new parts. Refurbished devices are those that have had mostly cosmetic changes, bringing the device back to looking like new."
        },
        {
            "text": "The contract focuses on four priorities:"
        },
        {
            "text": "We are delivering this new contract with ATOS and their partners."
        },
        {
            "heading": 2,
            "text": "Making the most of remanufactured and refurbished devices"
        },
        {
            "text": "The Defra group has over 30,000 colleagues and around 72,000 devices. At this scale, we have a significant opportunity to make a difference."
        },
        {
            "text": "Over the 5-year life of the contract, 90% of Defra’s laptops, phones, and tablets will be refurbished or remanufactured. This will include redeployment to keep existing devices until the end of their life."
        },
        {
            "text": "The move will:"
        },
        {
            "text": "These savings are compared to buying new devices."
        },
        {
            "text": "The financial case is also compelling. Refurbished devices offer cost savings of up to 40%. This frees up resources to reinvest in frontline services or new areas of innovation."
        },
        {
            "heading": 2,
            "text": "Partnerships are key"
        },
        {
            "text": "We responsibly manage devices at the end of their life, with our zero-to-landfill policy. Where appropriate, we donate equipment to social enterprises. This supports digital inclusion and extends the lifespan of devices. We recycle devices that have reached end of their life."
        },
        {
            "text": "The recycling process includes working with partners to support a prison workshop programme. This helps to upskill and retrain incarcerated individuals. Another partnership means that for every new phone or tablet we buy, a phone in Africa is collected and recycled."
        },
        {
            "text": "Our annual ‘amnesty’ days also give Defra colleagues the opportunity to recycle un-used personal devices."
        },
        {
            "text": "We have relocated our logistics hub and introduced more smart lockers for device delivery and collection. Smart lockers are secure storage units where colleagues can collect and return devices. This aims to reduce delivery-related CO₂ emissions by over 30%."
        },
        {
            "heading": 2,
            "text": "Smarter, data-driven device management"
        },
        {
            "text": "The contract enhances our pre-existing performance-based refresh cycles. Instead of replacing devices on a fixed schedule, we will monitor device performance. This helps us to proactively identify when we need replacements or repairs, avoiding unnecessary upgrades and extending the useful life of equipment, reducing both waste and cost."
        },
        {
            "text": "We are also introducing a role-basedapproach, meaning colleagues receive technology that matches what they need for their role. It helps us avoid giving people more equipment than they need and reduces the amount of hardware in circulation."
        },
        {
            "heading": 2,
            "text": "Building sustainability into the contract"
        },
        {
            "text": "Sustainability isn’t treated as a standalone objective — we have embedded it throughout the contract through carefully designed key performance indicators (KPIs), collaborative governance, and proactive supplier engagement."
        },
        {
            "text": "One notable feature is a class-leading shift in sustainability and social value weighting of 20%. This doubles the standard 10% weighting."
        },
        {
            "text": "We have launched new Experience Level Agreements. These put the user’s experience at the core by rewarding supplier performance based on user sentiment and how responsive the technology is."
        },
        {
            "text": "A colleague - Katie Bishop, our Digital Sustainability Lead - really captured the essence of our journey so far with these reflections:"
        },
        {
            "heading": 2,
            "text": "A model for sustainable, user-focused technology"
        },
        {
            "text": "Our new approach to providing IT hardware demonstrates how departments can take practical, measurable steps toward more sustainable technology. By reusing more of our devices and rethinking traditional refresh models, we are reducing our environmental impact while maintaining high standards of performance, security, and user experience. This is all alongside the reduction in technology spending, providing better value for money for the taxpayer."
        },
        {
            "text": "Our work in this space directly aligns with our new Digital Sustainability Strategy, particularly with strategic objective 3, which outlines our circular economy approach. This objective outlines our goals to use remanufactured devices and performance-driven refresh cycles, both of which are front and centre in this contract."
        },
        {
            "text": "This is an innovative approach in this sector, and one we hope other departments may follow."
        },
        {
            "text": "Harry Kenny is a product manager from the digital sustainability team in Defra Digital Data Technology and Security."
        },
        {
            "text": "We’d love to hear what you’re doing in your organisation or department, to drive more digital sustainability practises. Why not leave us a comment here."
        },
        {
            "text": "If you have any further questions or feedback, please reach out to the Defra digital sustainability team. You can also join the conversation on LinkedIn."
        },
        {
            "text": "Keep up to date with the sustainability world with the GDSA podcast - Ctrl+Alt Sustain - which is available on all audio and music platforms – listen, like and subscribe to the show now!Apple PodcastsSpotifyAudible"
        }
    ]
}