{
    "url": "https://ukhsa.blog.gov.uk/2026/02/18/how-does-cold-weather-affect-health-our-new-report-explores-the-hidden-impact/",
    "title": "How does cold weather affect health? Our new report explores the hidden impact",
    "authors": [
        "Blog Editor"
    ],
    "categories": [
        "Protecting the country's health",
        "Winter"
    ],
    "pub_date": "2026-02-18T10:38:52+01:00",
    "content": [
        {
            "text": "When we talk about winter deaths, we may think of hypothermia or people dying directly from low temperatures. The reality is more complex - and often invisible."
        },
        {
            "text": "Cold weather can trigger heart attacks, strokes and respiratory problems. It can worsen chronic conditions like dementia and lung disease. And it can increase the spread of infections like influenza and pneumonia. Unlike the immediate consequences of extreme heat, the effects of cold weather are subtle. They build over days or weeks and rarely appear directly on death certificates."
        },
        {
            "text": "Today we publish the first Cold Mortality Monitoring Report as Official Statistics in Development, providing estimates of deaths associated with cold weather during winter 2024/25 - and offering fresh insight into how this risk may be changing."
        },
        {
            "heading": 2,
            "text": "The challenge of counting cold-related deaths"
        },
        {
            "text": "The effects of cold weather on health are often delayed. Heart-related deaths tend to increase several days after cold exposure, while respiratory and infection-related deaths show longer delays still. This means we cannot simply look at death certificates to understand how many people die because of cold weather."
        },
        {
            "text": "To address this, we use a statistical model that examines how daily temperatures relate to deaths over the following days and weeks. The model estimates the cold-associated deaths that happen when temperatures reach or fall below the Cold Health Alerting thresholds. This allows us to identify deaths linked to cold weather - even when cold is not listed as the cause."
        },
        {
            "heading": 2,
            "text": "What we found"
        },
        {
            "text": "Our analysis estimates that 2,544 deaths were associated with cold weather across 3 cold episodes between November 2024 and January 2025. Of these, 1,448 deaths were directly linked to cold temperatures, with the remaining deaths occurring when cold weather and elevated influenza levels overlapped, and likely acted together to increase mortality."
        },
        {
            "text": "The most severe episode, a 6-day period in early January, accounted for 1,630 deaths, while shorter episodes in November and early January were associated with 421 and 493 deaths respectively."
        },
        {
            "text": "Cold-associated mortality rises sharply with age, with the highest impact among people aged 65 and over. We see strong associations with circulatory diseases, dementia, influenza, pneumonia and chronic respiratory conditions."
        },
        {
            "heading": 2,
            "text": "How this relates to other estimates"
        },
        {
            "text": "The Office for National Statistics (ONS) has also published research on climate-related mortality, examining data from 1988 to 2022. That 35-year analysis provides a valuable estimate of the average impact of cold weather across more than 3 decades."
        },
        {
            "text": "Our report has a different purpose. Rather than looking at long-term averages, we focus on recent winters and estimate the impact of specific cold weather episodes under today's conditions - reflecting the current population structure, present-day health system pressures, and contemporary patterns of vulnerability. Because the methods and aims differ, the figures should not be directly compared, but together they offer complementary insights."
        },
        {
            "heading": 2,
            "text": "Is vulnerability to cold increasing?"
        },
        {
            "text": "One of the most significant findings concerns how risk is changing. When comparing the most recent 5-year period with the previous 5 years, the relationship between temperature and mortality appears steeper - the risk of death associated with cold temperatures may have increased."
        },
        {
            "text": "Several factors could explain this: an ageing population, fuel poverty increasing exposure to cold indoor environments, and the longer-term health impacts of the COVID-19 pandemic reducing our collective resilience to winter stressors. While longer-term research is needed to confirm this trend, the findings suggest vulnerability to cold may be growing."
        },
        {
            "heading": 2,
            "text": "Why this matters"
        },
        {
            "text": "Cold weather is not just a discomfort - it is a preventable driver of death. Understanding how mortality risk changes at different temperatures helps ensure that Cold Health Alerts and preparedness measures are grounded in evidence, not weather forecasts alone."
        },
        {
            "text": "If vulnerability is increasing, this points to the importance of broader factors: housing quality, access to affordable energy, management of long-term health conditions, and support for older adults living alone. This report contributes to the evidence base underpinning the Adverse Weather and Health Plan for England."
        }
    ]
}