{
    "url": "https://defrafarming.blog.gov.uk/2026/02/18/join-our-webinar-grants-for-farmers-on-lowland-peat/",
    "title": "Join our webinar: grants for farmers on lowland peat ",
    "authors": [
        "The Lowland Peat Team"
    ],
    "categories": [
        "Webinars"
    ],
    "pub_date": "2026-02-18T17:26:00+00:00",
    "content": [
        {
            "text": "England’s lowland peatlands, including the Cambridgeshire Fens, Somerset Levels and Lancashire Mosses, cover around 250,000 hectares, roughly the size of Dorset. These landscapes have supported some of the country’s most productive farmland for generations."
        },
        {
            "text": "Since the 1600s, much of this land has been drained for agriculture. That drainage has brought benefits for production, but it has also caused these carbon-rich soils to erode and the land to sink, making it harder to keep farming these areas in the same way over the long term."
        },
        {
            "text": "Changing the way water is managed in lowland peat landscapes can help reduce carbon loss and slow down soil loss."
        },
        {
            "text": "3 new grants will support this change, and we're hosting 2 webinars for farmers on lowland peat to understand how they can access them. There will be opportunities to give feedback and ask questions."
        },
        {
            "heading": 2,
            "text": "Background"
        },
        {
            "text": "Peat soils are naturally fertile and an important carbon store. But when soils are drained, the organic matter breaks down, releasing carbon into the atmosphere. The soil compacts, the surface level drops, and the peat layer thins."
        },
        {
            "text": "As land subsides, ditches and drains often need more maintenance, pumping can become more important, and water levels can be harder to control. That can mean higher operating costs and greater vulnerability in both wet and dry periods."
        },
        {
            "text": "Managing water levels helps reduce emissions and supports national climate goals, which is why lowland peat is a priority area for government investment and future support."
        },
        {
            "text": "Business-as-usual on drained peat soils is becoming a less sustainable option for the future. We want to support farmers and land managers to explore alternatives, such as conventional cropping at higher water tables, and exploring markets for crops better suited to wet conditions."
        },
        {
            "text": "In the Environmental Improvement Plan, we announced £85 million of funding for peat. The majority of it will support measures to improve lowland agricultural peat, including grants for exploration, water infrastructure, and trials for wetter farming and paludiculture (growing crops that are suited to wetland conditions)."
        },
        {
            "text": "This funding is intended to help farmers and land managers make changes to water management and take more sustainable actions on peat, including exploring viable markets for crops grown on wetter peat soils."
        },
        {
            "heading": 2,
            "text": "Join our webinars"
        },
        {
            "text": "Next week, we are hosting two webinars about the lowland peat grant schemes which will launch this year and run until 2030."
        },
        {
            "text": "Both webinars will be recorded for anyone who registers, even if they cannot attend on the day. We’ll add a link to the recording in this post too. "
        },
        {
            "text": "We will also host pre-application webinars in the coming months, once funding is confirmed, scheme design and documentation are complete, and application windows are about to open."
        },
        {
            "text": "Both engagement webinars take place on Wednesday 25 February."
        },
        {
            "heading": 3,
            "text": "Lowland Peat Water Schemes"
        },
        {
            "text": "This webinar is led by the Environment Agency’s Peat Team."
        },
        {
            "text": "Wednesday 25 February"
        },
        {
            "text": "Time: 11:00 to 11:45"
        },
        {
            "text": "Discovery Grants will fund partnerships in lowland peat regions to form, expand and work together to create water implementation plans. These plans will support the raising and management of water tables to improve lowland peat soils."
        },
        {
            "text": "Implementation Grants will fund projects that directly enable the safe and sustainable raising and management of water tables to improve lowland peat soils, primarily through water infrastructure and telemetry."
        },
        {
            "heading": 3,
            "text": "Paludiculture and Wetter Farming Fund"
        },
        {
            "text": "This webinar is led by the Natural England Peat Team."
        },
        {
            "text": "Wednesday 25 February"
        },
        {
            "text": "Time: 14:30 to 15:15"
        },
        {
            "text": "The Paludiculture and Wetter Farming Fund is the successor to the Paludiculture Exploration Fund. It will support research-focused projects that address outstanding evidence gaps and help advance the viability of farming at higher water tables on lowland peat soils."
        },
        {
            "text": "There are 2 themes."
        },
        {
            "heading": 2,
            "text": "Register to attend"
        },
        {
            "text": "To sign up, please email lowlandpeat@defra.gov.uk by the end of Monday 23 February, indicating:"
        },
        {
            "text": "We will then send invitations for the relevant events, which will take place on Microsoft Teams."
        },
        {
            "text": "If you have any accessibility requirements, please get in touch by emailing lowlandpeat@defra.gov.uk. Equally, if you have questions, please send them to us in advance. We will use them to help shape the session and do our best to answer them during the webinars."
        },
        {
            "text": "We recognise the vital role lowland peat farms play in agricultural production and rural economies and want to make these sessions as useful as possible."
        },
        {
            "text": "These webinars are an early step in engaging interest in support that works on the ground, helping farmers and land managers make informed choices about water management, protect peat soils, and explore practical options for the future."
        },
        {
            "text": "We look forward to seeing you at the sessions!"
        }
    ]
}