{
    "url": "https://nationalscreening.blog.gov.uk/2026/02/18/uk-nsc-consults-on-targeted-antenatal-screening-for-htlv-1/",
    "title": "UK NSC consults on targeted antenatal screening for HTLV-1",
    "authors": [
        "Rebecca Dliwayo"
    ],
    "categories": [
        "Antenatal screening"
    ],
    "pub_date": "2026-02-18T17:48:20+00:00",
    "content": [
        {
            "text": "The UK National Screening Committee (UK NSC) has opened a consultation on evidence relating to targeted antenatal screening for Human T-lymphotropic virus 1 (HTLV-1)."
        },
        {
            "text": "We are asking individuals and organisations to provide feedback on the findings and conclusions of an evidence review and modelling study commissioned in response to 2 targeted screening proposals submitted via the UK NSC’s open call process."
        },
        {
            "text": "The conclusions of this evidence review are that screening should not be introduced because it was not found to improve health outcomes. "
        },
        {
            "text": "To take part in the consultation, download the consultation documents by clicking on the grey ‘View documents’ button on the UK NSC’s  HTLV-1 screening recommendation page. Then submit your response by clicking on the green ‘Submit comments’ button."
        },
        {
            "text": "The deadline for responses is 11.59pm on 13 May."
        },
        {
            "text": "The consultation evidence documents can also be downloaded from the following links:"
        },
        {
            "heading": 2,
            "text": "Background"
        },
        {
            "text": "HTLV1 is a sexually transmitted retrovirus (like HIV) which affects the immune system. Most people with this incurable lifelong infection have no symptoms but it can cause severe diseases."
        },
        {
            "text": "The UK NSC archived the topic of universal screening for HTLV infections in pregnancy after commissioning a 2022 evidence map. That was the sixth time the committee had considered the topic and the evidence map did not find enough evidence to show that screening would do more good than harm."
        },
        {
            "text": "Following the expansion of the UK NSC’s remit to include targeted screening, 2 proposals for antenatal targeted screening for HTLV-1 were submitted during the 2022 UK NSC open call for topics."
        },
        {
            "text": "To address these submissions, the UK NSC commissioned a modelling study to look at the effectiveness of introducing a targeted antenatal screening programme for HTLV-1 in the UK."
        },
        {
            "heading": 2,
            "text": "Updated evidence"
        },
        {
            "text": "The reviewers identified and reviewed published evidence on the health consequences of HTLV-1 and compared people who had confirmed HTLV-1 infection to those without the virus."
        },
        {
            "text": "They reviewed evidence on health effects including how many people became ill or died. They found no studies looking a people with HTLV-1 who have no symptoms."
        },
        {
            "text": "It was difficult to draw conclusions from the evidence because studies involved different groups of people and measured different health outcomes."
        },
        {
            "text": "This project looked at whether screening only pregnant women at higher risk of HTLV-1 (targeted screening) would improve health. Screening would involve 2 blood tests, then counselling and advice to avoid breastfeeding for those who test positive."
        },
        {
            "text": "The model compared targeted antenatal screening with no screening, looking at health outcomes over mothers’ and children’s lifetimes.  "
        },
        {
            "text": "Screening was not found to improve health. The harms of stopping breastfeeding, such as increased childhood infections, and psychological impact of learning about an incurable lifelong infection were estimated to outweigh the benefits."
        },
        {
            "text": "During the public consultation we are asking individuals and organisations to provide feedback on this evidence and to flag any issues they think should be considered."
        },
        {
            "heading": 2,
            "text": "Keep up to date"
        },
        {
            "text": "The UK NSC blog provides up to date news from the UK NSC. You can register to receive updates direct to your inbox, so there is no need to keep checking for new articles. If you have any questions about this blog article, or about the work of the UK NSC, please email uknsc@dhsc.gov.uk."
        }
    ]
}