{
    "url": "https://naturalengland.blog.gov.uk/2024/11/19/celebrating-30-years-of-the-national-lottery-supporting-nature-recovery-projects/",
    "title": "Celebrating 30 years of the National Lottery supporting nature recovery projects",
    "authors": [
        "Natural England"
    ],
    "categories": [
        "Biodiversity",
        "Connecting People with Nature",
        "Landscapes",
        "Natural England",
        "Nature Recovery",
        "Nature-based solutions",
        "Parks, trails and nature reserves",
        "Species recovery",
        "Tree Planting",
        "Wildlife"
    ],
    "pub_date": "2024-11-19T11:49:56+00:00",
    "content": [
        {
            "text": "By Adelle Rowe, Natural England Director of External Affairs"
        },
        {
            "text": "Today sees the 30th anniversary of the National Lottery and Natural England is reflecting on the transformative role lottery funding has played in projects that protect and restore nature and give more opportunities for people to enjoy being in nature. "
        },
        {
            "text": "Since 1994, The National Lottery Heritage Fund has distributed £8.6bn of National Lottery funds to more than 47,000 projects.  Among those projects, over £2.1bn has been awarded to more than 4,900 land, nature and biodiversity projects across the UK.   "
        },
        {
            "text": "Eilish McGuinness, Chief Executive, The National Lottery Heritage Fund, said: "
        },
        {
            "text": "“The National Lottery Heritage Fund is the largest funder for the UK’s heritage and 2024 marks a huge year for us, as we celebrate our 30th anniversary of supporting heritage projects across the UK. We’re taking this opportunity to reflect on the transformative impact we’ve had on communities, landscapes, and wildlife across the country.  "
        },
        {
            "text": "\"In that time, we've invested in partnerships with Natural England on vital projects that have not only helped halt and reverse the loss and decline of habitats and species; they've helped communities connect with the nature on their doorstep, igniting their passion to care for it. Projects such as Back from the Brink and Revitalising Redesdale are critical in supporting nature recovery and environmental sustainability, furthering our vision for heritage to be valued, cared for and sustained for everyone, now and in the future.” "
        },
        {
            "text": "Below are just some examples of Natural England projects that couldn’t have happened without funding from The National Lottery Heritage Fund. "
        },
        {
            "text": "Revitalising Redesdale  "
        },
        {
            "text": "Redesdale is a hidden gem, tucked away in the far north of Northumberland. Natural England was awarded a grant of £1.8m from The National Lottery Heritage Fund in October 2015 for Revitalising Redesdale, a Landscape Partnership project. It achieved match funding from 17 partners to secure £3m in total.  "
        },
        {
            "text": "Thanks to the Revitalising Redesdale Landscape Partnership Scheme, its unique landscape, history, and heritage is celebrated, enhanced, and conserved for the benefit of local people and visitors alike. "
        },
        {
            "text": "It has inspired and involved volunteers, farmers and businesses in the conservation of Redesdale’s rich ecology and culture. The project has had huge benefits in the area: the conservation of peatlands and habitats; the restoration of species-rich grasslands; the recording and protection of biodiversity; new walking trails; fascinating interpretation boards, taking in Romano-British settlements, star cairns, historic churches and a medieval battlefield along the way. "
        },
        {
            "text": "Lydia Speakman, who worked on the project said: "
        },
        {
            "text": "“The Revitalising Redesdale Landscape Partnership has enabled Natural England to develop a place-based approach to this special area which has delivered nature-based recovery at a landscape scale, whilst integrating a deeper appreciation and understanding of the way communities have, and continue to, shape and experience that landscape. "
        },
        {
            "text": "“Partnership has been key to securing that holistic view of place and enabling us, as an organisation, to work with different organisations and groups that we haven’t traditionally worked with. This Partnership has enriched the projects and aspirations of Revitalising Redesdale, and this way of working will inform Natural England’s approach in other areas.” "
        },
        {
            "text": "Back from the Brink: saving Britain’s most threatened species "
        },
        {
            "text": "Back from the Brink was one of the most ambitious conservation projects ever undertaken. Its aim was to save 20 species from extinction and benefit over 200 more through 19 projects that span England; from the tip of Cornwall to Northumberland.  "
        },
        {
            "text": "Natural England received £4.9m from The National Lottery Heritage Fund in November 2015 for the Back from the Brink project, which aimed to establish ways to help save some of Britain’s most threatened species. "
        },
        {
            "text": "It’s the first time that so many conservation organisations came together with one focus in mind – to bring back from the brink of extinction some of England’s most threatened species of animal, plant and fungi. Explore the diverse projects below to find out how we got on. "
        },
        {
            "text": "Natural England with partners, Amphibian and Reptile Conservation Trust, Bat Conservation Trust, Bumblebee Conservation Trust, Buglife, Butterfly Conservation, Plantlife and the Royal Society for the Protection of Birds and over 100 other organisations united their conservation efforts for Back from the Brink. We worked at more than 150 locations across England, including the Dorset heaths, North Downs, Cotswolds, Breckland, Rockingham Forest, Dearne Valley, Sefton Coast and the Yorkshire Wolds. "
        },
        {
            "text": "Together they supported 96 priority species to make progress along their ‘species recovery curves’, improving their conservation status and future prospects. "
        },
        {
            "text": "Millions of people had opportunities to see the work of the project, more than 10,000 people learnt skills and nearly 4,000 volunteered. "
        },
        {
            "text": "The vast programme was made up of 19 projects, including: "
        },
        {
            "text": "Back from the Brink was recognised for its work with a Best Heritage Project Award in the 25th Birthday National Lottery Awards.  The programme’s legacy includes a network of trained volunteers, a wealth of information available online and continued funded projects from some of the partner organisations.  Working in this way drew up a blueprint for future collaboration across the conservation sectore and beyond.  "
        },
        {
            "text": "Bats In Churches "
        },
        {
            "text": "Bats in Churches was a highly successful five-year, £5m partnership project between Natural England, Church of England, Churches Conservation Trust, Bat Conservation Trust and Historic England, funded by National Lottery Heritage Fund. "
        },
        {
            "text": "The partnership developed novel collaborative approaches to mitigate the damage, and associated distress, caused by bats roosting over precious church heritage. Working with more than 120 churches nationally, the project showed that major capital works can be effective, but in many cases an increased understanding of bats, and community collaboration with local bat groups, were transformative in resolving the human-wildlife conflict. At least two churches were saved from closure, and roosts of regional and national significance have been preserved and maintained.  "
        },
        {
            "text": "The mitigation involved the construction of lowered ceilings, bat lofts, bell tower enhancements, deploying winched ‘sails’ to catch dropping and the installation of heated boxes to encourage bats to use less-sensitive areas of the church. Community events that incorporated cleaning, and specialist conservation cleaning workshops for church volunteers were also effective. Minor mitigations included catch trays and draped fabrics, as well as funding the purchase of lightweight modern vacuum cleaners! "
        },
        {
            "text": "The project also pioneered an ambitious citizen science project which surveyed more than 750 churches across England for bats and led to two records of the rare Grey Long-eared Bat, a Back from the Brink species not previously recorded in churches, being captured. "
        },
        {
            "text": "A specialist, more flexible, Bats in Churches class license, a peer-reviewed paper and a Buildings for Mission fund to help churches with bats are part of the project legacy, as well as the lovely picture book The Little Church Bat by Rose Riddell, Diana Spencer | Waterstones. The project won a Highly Commended award for Best Practice Stakeholder Engagement at the Charted Institute of Ecology and Enviromental Management Awards 2024.The same partnership team are now writing a new bid that focusses on biodiversity in places of worship.  "
        }
    ]
}