{
    "url": "https://forestrycommission.blog.gov.uk/2024/11/19/into-the-woods-resilience-for-the-future/",
    "title": "Into the woods: resilience for the future",
    "authors": [
        "Jon Burgess"
    ],
    "categories": [
        "Climate change and resilience",
        "Into the woods series",
        "Tree planting",
        "Woodland management"
    ],
    "pub_date": "2024-11-19T09:00:00+00:00",
    "content": [
        {
            "text": "A place that has always been a very special place for me is Culm Davy on the Blackdown Hills near Taunton. I have walked this woodland for years and always keep returning to it when in need of peace and solace – this is where I go to connect with nature."
        },
        {
            "text": "The site is atmospheric throughout the year; located on the southwestern end of the hill, it catches both the wind and the sun, and always offers great views. The woodland offers a wide variety of different textures, from open heathland, younger scrubby thickets, to a mature canopy of a range of tree species. It is a Forestry England site with the access tracks you would expect, but many desire lines that allow you to wander freely off the beaten track."
        },
        {
            "text": "I admit that I applied for a job in Forestry Commission for the chance to get to manage this special site and did so for nearly 10 years as a Forester. Through this time, I began to understand what made Culm Davy a great model for creating climate resilient woodlands."
        },
        {
            "heading": 2,
            "text": "Planting for a drier climate"
        },
        {
            "text": "In this part of Devon, we have a coastal climate with warm damp summers and mild winters. However, with climate change we expect hotter summers with longer dry periods in the future."
        },
        {
            "text": "The thin hilltop soils are at increased risk of drought, so whilst managing the site I planted species that would tolerate long dry spells. This included a mixed stand of sweet chestnut, sessile oak and Scots pine. These are all species which can handle dry weather, grow well together and contribute to the beauty of the site. When planted together they can support each other, and they should boost the health and vigour of other species. The mix of species makes the most of the site's resources."
        },
        {
            "text": "Responding to the threat of climate change in a timely way proved worthwhile during the drought of 2022. While many newly planted trees elsewhere died from drought, we didn’t lose any new trees at Culm Davy."
        },
        {
            "text": "The woodland is diverse in both species and structure. It contains many native and non-native species growing happily alongside each other; each tree giving more habitat options for wildlife. The site holds some fantastic old craggy pines and a cathedral-like Douglas fir grove where the big trees stretch up into the mist. Big beech trees, characteristic of the local landscape, line the internal hedge banks which have survived well inside the wood."
        },
        {
            "text": "On the exposed hilltop, the structural diversity of the woodland is hugely important. Stands of Western hemlock are managed as a continuous cover forestry system which relies on natural regeneration to restock the woodland. This creates a wood that catches the mist and increases the humidity of the surrounding areas, benefitting many native species such as birch, hazel and rowan and supporting the woodland ecosystem."
        },
        {
            "heading": 2,
            "text": "Finding emotional resilience"
        },
        {
            "text": "My favourite thing is to visit on a sunny day, stand under the majestic stems of the Douglas firs, close my eyes and breathe in the heavenly scent of the warm trees. This smell is like nothing else on earth and has always given me an incredible sense of wellbeing. "
        },
        {
            "text": "Over the years, scientific literature has increasingly attempted to explain why. As well as the refreshing sights and sounds experienced in green spaces, volatile terpenes are emitted by some conifers and inhaled during visits to the woods. These are linked to both physical and mental health improvements, so I now understand why this simple act in this wonderful woodland always felt so right."
        },
        {
            "text": "I don’t often stop to ‘smell the roses’ but I do still pause to ‘sniff the firs’ and advise you to do the same!"
        }
    ]
}