{
    "url": "https://enablingdigitalidentity.blog.gov.uk/2024/11/19/monitoring-inclusion-in-the-digital-identity-market/",
    "title": "Monitoring inclusion in the digital identity market",
    "authors": [
        "Katie Sunley"
    ],
    "categories": [
        "Digital identity",
        "Inclusion"
    ],
    "pub_date": "2024-11-19T08:05:00+00:00",
    "content": [
        {
            "text": "Digital identities should be inclusive and accessible for as many people as possible. At OfDIA,  our aim is that anyone who chooses to use a digital identity is able to do so. To best understand how we can achieve this, we need to know how inclusive the market currently is so we can make the right interventions to improve inclusion. "
        },
        {
            "text": "This week my team has published a report on the results of an inclusion monitoring survey. This survey is mandatory for digital identity providers who are certified against the trust framework. You can read the full report on GOV.UK. "
        },
        {
            "heading": 2,
            "text": "What is the inclusion monitoring survey? "
        },
        {
            "text": "The survey is designed to build a picture of how inclusive the certified market is as a whole. It consists of roughly 30 questions on areas such as documentation and evidence, technology, accessibility, data collection and biometrics.   "
        },
        {
            "text": "This is the first year of collecting and publishing this data, and we’ll repeat the process every year. This will allow us to monitor the measures of inclusion over time to see whether things are improving. We will use this data to feed into the development of the trust framework and our inclusion policy more broadly. "
        },
        {
            "heading": 2,
            "text": "What does the report tell us about inclusion? "
        },
        {
            "text": "The results show a broadly positive picture of the inclusivity and accessibility of the market.  For example: "
        },
        {
            "heading": 2,
            "text": "What can’t the report tell us? "
        },
        {
            "text": "The survey doesn’t collect information on the rates of digital identity use or the perspective of users. The survey was only completed by certified services so doesn’t cover the wider market. "
        },
        {
            "text": "There are also broader factors that can affect people’s ability to access digital identity services, such as lack of connectivity, lack of access to devices or low digital skills. Monitoring these factors is not in scope of this survey, but will be part of wider work DSIT is doing on digital inclusion. "
        },
        {
            "heading": 2,
            "text": "What are we doing next? "
        },
        {
            "text": "First, we are assessing the effectiveness of the survey and thinking of ways to improve it for next year, which may include adding more questions or revising how we ask current ones. "
        },
        {
            "text": "Secondly, while the results of the report are broadly positive, there is scope for improvement. We want to ensure that anyone who wants to use a digital identity can do so. We are looking at the areas where we could be most impactful and considering options for further development. We’ll have more to share on this soon. "
        },
        {
            "text": "In the meantime, we would welcome any comments or suggestions about the report and the survey questions. "
        }
    ]
}