{
    "url": "https://openpolicy.blog.gov.uk/2024/11/19/people-centred-and-participatory-policymaking/",
    "title": "People-centred and participatory policymaking ",
    "authors": [
        "camillabuchanan",
        "nehasharma"
    ],
    "categories": [
        "Policy Lab"
    ],
    "pub_date": "2024-11-19T14:07:07+01:00",
    "content": [
        {
            "text": "Policy Lab has a ten-year history of using people-centred and participatory methods in policy. Such approaches help to build evidence, understanding and empathy. Participation and engagement are already part of the Policy Profession Standards, and we are excited to see growing interest amongst policy professionals. These methods are highly varied and have differing potential and value - some are well established in central government whilst others are relatively untested.  "
        },
        {
            "text": "In this blog, we draw on our portfolio of more than 250 policy projects to explain people-centred and participatory policymaking. We describe a spectrum of methods and their potential applications in a range of policy contexts. We also share resources offering more information and examples. "
        },
        {
            "text": "What are people-centred and participatory methods? "
        },
        {
            "text": "“I’ve been asking for ages for people to actually come and video us and see what it’s like. Come and share with us and see, instead of asking us to fill in the forms, people should come and watch because observation is the best way to learn (...) we can just be us, we can share our views and we can give you a tiny little glimpse into our world” - Policy Lab Research Participant, Disability Unit Project"
        },
        {
            "text": "People-centred and participatory policymaking varies from light-touch engagement and collaboration to deeper exercises entailing extensive co-production and deliberation, often over longer periods of time. When applied well, such methods mean that policy professionals have access to additional types of evidence and that people impacted by policy can have greater influence on, and buy-in to, decisions. In our work at Policy Lab, we often experience how participation can inform, steer and add depth to policy areas, not as an adjunct but as a deeply integral part of sensitive and effective policymaking. This is particularly conducive to the connected and horizontal working required in mission-led government.  "
        },
        {
            "text": "A spectrum of people-centred and participatory methods "
        },
        {
            "text": "Different policies can play out in radically different ways depending on circumstance and place. Accordingly it is important for policy professionals to have access to a diverse suite of people-centred methods, from gentle and compassionate techniques that increase understanding with small groups of people to higher-profile, larger-scale engagements. The image below shows a spectrum of people-centred and participatory methods that can be used in policy, ranging from light-touch involvement (e.g. consultation), to structured deliberation (e.g. citizens’ assemblies) and deeper collaboration and empowerment (e.g. participatory budgeting). This spectrum of participation is speculatively mapped against stages of the policy cycle. "
        },
        {
            "text": "Ten years of practice "
        },
        {
            "text": "We have a decade of experience working with policy teams to identify, shape and deliver opportunities to bring different people-centred and participatory methods into varying policy contexts. For example, we have brought our film ethnography work to twelve government departments in over thirty different projects, building empathy by enabling hundreds of people to share their daily realities directly with policy teams. Our films for the Windrush Lessons Learned Review presented first-hand experiences of immigration policy and provided the review team with an important alternative form of insight and evidence. We have used co-design in numerous projects as a collaborative approach to developing policies which involves people affected by the policy or policy challenge. A recent example is access to language learning for refugees. More recently, our experiments and investigations with participatory technology are facilitating engagement with larger groups, particularly through collective intelligence, demonstrated in a debate involving nearly 300 people on the delicate issue of sea bass fisheries management.  "
        },
        {
            "text": "The table below provides a summary of selected participatory methods, their value and current use in central government.  "
        },
        {
            "text": "Through ten years of practice, we have learnt much about using people-centred and participatory approaches in policy. Our work is highly attentive to context and place. Increasingly we find this requires developing a mixed-methods approach to a policy question which may involve combining participatory methods with other techniques. Across our portfolio we have observed first-hand the validation and recognition people can feel when engaged directly by policy teams. We have also repeatedly seen how artistic, creative, and material techniques can enhance people’s experience of government and their ability to explore and shape the issues in question. Such approaches can make policy more tangible and accessible to people who are unused to interacting with government or in challenging personal circumstances. This is an important area that we are exploring further including through initiatives such as our MANIFEST programme. "
        },
        {
            "text": "How to engage and find out more "
        },
        {
            "text": "To find out more about Policy Lab’s methods you can see examples on our blog, read our Lived Experience in Policymaking Guide and take our open-access, five-week course: People-Centred Policy Design. Alternatively, please get in touch: team@policylab.gov.uk.  "
        },
        {
            "text": "We are not alone in this work and there are many mature organisations outside of government as well as several groups and networks across the Civil Service trialling and raising awareness of people-centred and participatory policymaking. This includes the Policy Design Community and Participatory Methods Forum, which you can sign up for here.  "
        }
    ]
}