{
    "url": "https://ofsi.blog.gov.uk/2024/11/19/strengthening-global-sanctions-two-years-of-enhanced-partnership/",
    "title": "Strengthening Global Sanctions: Two Years of Enhanced Partnership",
    "authors": [
        "OFSI"
    ],
    "categories": [
        "OFSI Blog"
    ],
    "pub_date": "2024-11-19T15:46:08+00:00",
    "content": [
        {
            "text": "In October 2024, representatives from the United Kingdom’s (UK) Office of Financial Sanctions Implementation (OFSI) and the U.S. Department of the Treasury’s Office of Foreign Assets Control (OFAC) convened in Washington, DC at our annual technical exchange, marking the second anniversary of our Enhanced Partnership. In response to increasingly complex geopolitical developments, sanctions continue to be a critical tool in tackling threats to the United States’ and United Kingdom’s national security. Together, we are steadfast in continuing to limit the ability of Russia to finance and support its illegal and unprovoked invasion of Ukraine, while responding to the conflicts in the Middle East. "
        },
        {
            "text": "As we stated in 2022, financial sanctions work best when implemented multilaterally, and we remain committed to designing, communicating, and implementing new sanctions in close coordination with each other, as well as with other key allies and partners. It is imperative that we collaborate with each other and industry to ensure sanctions are implemented as effectively as possible."
        },
        {
            "text": "This year marked a significant milestone in our enduring relationship as we moved from establishing a shared understanding to developing critical solutions to common problems via ongoing communication throughout the year. Whilst our annual technical exchange is an important feature of our relationship, it is the regular engagement between colleagues across all levels of our organizations that truly embodies the enhanced partnership."
        },
        {
            "text": "Joint Engagement"
        },
        {
            "text": "One of the most enriching aspects of the partnership, including these exchanges, is the opportunity to conduct joint private sector outreach. As part of the exchange, we met with the Bank Policy Institute to discuss critical issues facing financial institutions, differences in UK and U.S. sanctions regimes, and possibilities for future alignment."
        },
        {
            "text": "The private sector is a critical partner in helping uphold our shared national security goals, and we welcome opportunities to not only promote compliance and understanding, but also hear about shared challenges when navigating our sanctions regimes. Both OFAC and OFSI have made significant progress this year on new initiatives to support sanctions implementation by the private sector. OFAC has begun updating its “baseline” FAQs on general sanctions questions and issues, issued key humanitarian guidance in Arabic, and published an introductory sanctions guidance document in Spanish. OFSI introduced the eagerly awaited frequently asked questions (FAQs) to help support industry in understanding and implementing UK sanctions."
        },
        {
            "text": "Information Sharing"
        },
        {
            "text": "A critical part of implementing sanctions effectively is ensuring that we are sharing the right information, with the right people, at the right time. As such, a highlight of this year’s visit included the signing of a Memorandum of Understanding (MOU). This MOU enhances our ability to collaborate and share information, further fortifying our coordinated efforts in implementing and enforcing sanctions. While we were already committed to sharing information of common interest through existing information sharing channels, the MOU will further support these efforts."
        },
        {
            "text": "Analysis continues to be at the heart of how we design, implement, and understand the effectiveness of sanctions. For example, how we identify areas or industries that would benefit from additional guidance or engagement or understanding significant policy changes or circumvention methodologies. As part of our previous commitment to share analysis, we reviewed lessons learned from the successful implementation of the new prohibitions on Russian metals jointly introduced by the United States and the United Kingdom, considering the steps necessary to prevent market speculation or price increases that could be anticipated. While operational functions have historically been at the forefront of our information-sharing, we look forward to collaborating more closely in sharing our analysis to support our future actions and any mitigation measures."
        },
        {
            "text": "Similarly, we are delighted to see the reciprocal secondee program enter its second year. With OFAC and OFSI secondees now embedded with the other office, the program continues to function as a critical way to share expertise, best practices, and collaborate on projects of common interest. Going forward, these secondees will continue to support effective information sharing, while identifying future areas to share their hands-on experience and ensure the enhanced partnership’s objectives progress at all levels."
        },
        {
            "text": "Modernization"
        },
        {
            "text": "The ability of our organizations to quickly adapt and respond to new challenges in an increasingly complex sanctions landscape is critical to our success. During the exchange, we discussed organizational modernization, software that helps support our licensing and enforcement functions, and the use of new technologies as we look to stay at the cutting-edge of implementation. As part of this, we reflected on how OFAC’s recent announcement of its modernization efforts could be adapted and replicated within the UK to ensure delivery of timely and effective responses to those seeking to comply with our regulations."
        },
        {
            "text": "Similarly, retaining and attracting talent also remains a critical part of ensuring that our organizations have the right skillsets to accomplish our mission. The exchange included a Women in Sanctions roundtable to bring together viewpoints from both organizations, fostering a dynamic exchange of ideas and experiences. The roundtable not only highlighted the significant contributions of women in the field of sanctions but also underscored the importance of gender diversity and inclusion in achieving our objectives."
        },
        {
            "text": "Looking Ahead"
        },
        {
            "text": "The second anniversary of OFAC and OFSI’s partnership is more than just a milestone; it is a reaffirmation of our unwavering commitment to global security through the development and implementation of effective sanctions. The recent exchange underscores the strength of the UK and U.S. sanctions relationship and strong bonds between our offices. In an increasingly volatile world, together we have set the stage for continued collaboration and success in the years to come."
        },
        {
            "text": "Giles Thomson, Director Economic Crime & Sanctions, The Office of Financial Sanctions Implementation, HM Treasury"
        },
        {
            "text": "Lisa Palluconi, Acting Director, Office of Foreign Assets Control, U.S. Department of the Treasury"
        }
    ]
}