{
    "url": "https://buyingforschools.blog.gov.uk/2024/11/19/update-for-schools-and-trusts-on-procurement-act-2023-are-you-ready/",
    "title": "Update for schools and trusts on Procurement Act 2023 - are you ready?",
    "authors": [
        "Hannah Mears, Commercial Lead for Get help buying for schools"
    ],
    "categories": [
        "Advice and support"
    ],
    "pub_date": "2024-11-19T12:49:13+00:00",
    "content": [
        {
            "text": "Hannah Mears is a Commercial Lead for Get help buying for schools, the DfE’s free supported buying service for schools and trusts. In this blog post, Hannah updates on the latest advice around the Procurement Act 2023, and how schools can get ready for the new regulations that come in February 2025."
        },
        {
            "text": "The new Procurement Act 2023 was initially due to take effect from 28 October 2024 but will now come in to force on 24 February 2025. The postponement allows the new government to write a National Procurement Policy statement (NPPS) that will set out its procurement priorities.Preparation you may have already undertaken is not lost; this slight delay will give more time for those not familiar with the Act to prepare for the changeover."
        },
        {
            "text": "The new Procurement Act means changes in procurement regulation and practices, aimed at bringing about a more flexible, strategic approach to public procurement."
        },
        {
            "text": "This creates challenges and opportunities for schools and trusts. Many are well prepared for the change in regulations, but for those not familiar you still have time to prepare."
        },
        {
            "text": "Transforming Public Procurement (TPP) TrainingThe Cabinet Office have provided free TPP training for all operational procurement staff available year-round. This includes staff whose main role is to run tenders or let contracts, or procurement/commercial professionals whose main role is to manage suppliers or contracts."
        },
        {
            "text": "It is recommended that staff in schools with responsibility for procurement and buying take the time to access and complete this free training over the coming months."
        },
        {
            "text": "The e-Learning modules are only available via registration with the Government Commercial College (GCC). Visit www.govcommercialcollege.co.uk to register."
        },
        {
            "text": "Once registered, you will find the e-learning product on the dedicated TPP area on the GCC website. There will be a direct link to the e-Learning course from the GCC homepage."
        },
        {
            "text": "The training is 10 x one hour modules, the e-learning covers all aspects of the new reforms, including:• key regulation changes• frameworks• transparency• competitive flexible procedure"
        },
        {
            "text": "Learners who complete the course and achieve certification will be awarded a certificate along with an e-badge for adding to email signatures, evidencing attainment at Practitioner level. The course offers unlimited retakes to achieve a pass."
        },
        {
            "text": "Procurement Pathway toolThe Cabinet office launched the Procurement Pathway tool on 27 September 2024. The tool is easy to use and gives:"
        },
        {
            "text": "• access to relevant policy, legislation, guidance and standard templates in one place• a high-level overview that identifies what may need to be considered and/or acknowledged across commercial stages• a guide to plan, define, procure and manage procurement activities supporting effective decision-making."
        },
        {
            "text": "To assist you in planning and developing your procurement, the tool incorporates guidance, legislation and regulations, templates and Procurement Policy notes all in one place."
        },
        {
            "text": "Preparation checklistIt is always good to be prepared. There is not much time left until the regulations change, but there are still things you can do to help get yourself and your school or trust ready."
        },
        {
            "text": "Actions to take now:• If you are unfamiliar with the upcoming changes watch the Knowledge Drops, Procurement Act 2023 Knowledge Drop for contracting authorities - schools• Review the knowledge drop with schools specific guidance - The Official Transforming Public Procurement Knowledge Drops - GOV.UK• School procurement leads should complete the e-Learning and register for Deep Dives if required The Official Procurement Act 2023 learning modules - GOV.UK• Read the GOV.UK Procurement Act 2023 Guidance documents• Think about your pipeline of procurements or bids and what would benefit from the new procedures• Engage in events and groups to talk to peers, read The Procurement Regulations 2024, challenge and ask questions"
        },
        {
            "text": "YPO and CPC have some helpful information on their websites in relation to the new act which you can access here:• Procurement Reform | YPO• Procurement Act 2023 | CPC"
        },
        {
            "text": "What does the delay mean for my existing procurement?If you had a procurement scheduled before February 2025 you will need to decide whether to proceed with the planned timetable under the existing regulations or delay the start until March 2025. You may be able to still meet your award date by restructuring your procurement timetable."
        },
        {
            "text": "If you need to extend your contract to cover the gap created by waiting for the new regulations, check if an extension is possible under the existing procurement regulations."
        },
        {
            "text": "Guidance and support availableGet help buying for schools service provides advice and guidance to schools and trusts free of charge and will continue to provide updates as more information becomes available."
        },
        {
            "text": "In the meantime, if you are a school or trust and need any free help and support with your procurement, contact Get help buying for schools."
        },
        {
            "text": "If you’ve found this article useful and want to learn more about how we’re supporting schools, click ‘sign up and manage updates’ to subscribe to our blog and receive notifications when we next post."
        }
    ]
}