{
    "url": "https://naturalengland.blog.gov.uk/2024/05/14/a-new-interactive-website-for-our-national-character-area-profiles/",
    "title": "A new interactive website for our National Character Area profiles",
    "authors": [
        "Sally Marshall"
    ],
    "categories": [
        "Biodiversity",
        "Development",
        "Ecosystem Services",
        "Green Infrastructure",
        "Landscapes",
        "Natural Capital",
        "Natural England"
    ],
    "pub_date": "2024-05-14T10:48:33+01:00",
    "content": [
        {
            "text": "By Sally Marshall, Principal Landscape Adviser, Natural England"
        },
        {
            "text": "Today (14 May 2024) we are excited to be launching a new interactive website for England’s National Character Areas (NCAs). This latest chapter in the long history of NCAs makes the valued evidence they contain far more accessible to a wide range of audiences.  As a former landscape planner/manager in private practice, I know first-hand how useful the NCA evidence is."
        },
        {
            "text": "I started my career sitting beneath a colourful poster of England’s 159 NCAs, with a box file of the original ‘Countryside Character Area’ regional volumes on my desk.  Barely a week went by in those 18+ years when I didn’t refer to the NCAs for one reason or another."
        },
        {
            "text": "Whether that was to inform a local Landscape Character Assessment, set the context for a site-based Management Plan, or to provide information (and a spatial framework) for targeting agri-environment schemes – the NCA information was invaluable to me.  I am therefore very excited to have been involved in the latest phase of their evolution."
        },
        {
            "text": " "
        },
        {
            "text": "My involvement in the review and refresh of the NCA profiles began in 2017.  Natural England let a contract with LUC, where I worked, to undertake a review of effectiveness and opportunities for NCA profiles as an evidence tool for delivering Conservation 21: Natural England’s Conservation Strategy for the 21st Century.  Informed by a series of interviews with a range of profile users, our report made a series of recommendations for NE to consider.  One of the headline recommendations was that:"
        },
        {
            "text": "‘There would be significant benefit in developing an updated digital platform for NCA profiles with increased accessibility and versatility, adaptable for current and future needs’."
        },
        {
            "text": "The phased project to make this a reality was then born."
        },
        {
            "text": "Starting in 2020, Natural England commissioned LUC and web developers Brand New Media to deliver work in the following phases:"
        },
        {
            "text": "I took on my role as Principal Landscape Adviser at NE, and SRO for this project, part way through Phase 2.  It was rather strange to be switching from being the contractor to being my former teammates’ client!"
        },
        {
            "text": "It was a great experience though to work closely with the consultancy team to explore new functionality and features to breathe new life into the NCA profiles – which, through my 2017 research – we know are of great value to many different audiences and for many different uses."
        },
        {
            "text": "Phase 3 involved user testing of the prototype website, with representatives from local authorities and other public sector organisations, private practice, members of the general public and other NE teams invited to ‘have a play’ with the website and make suggestions for improvements."
        },
        {
            "text": "Our contractors did a brilliant job of addressing comments and suggestions, though not everything was possible to address with the time/resource available.  We have a series of further recommendations from the User Testing that are documented in an accompanying project report – to consider as and when it is possible."
        },
        {
            "text": "Phase 3 also involved our Area Teams in taking new photographs of their NCA landscapes for the refreshed profiles.  The hope is that photographs will continue to be added to the website over time; keeping the content fresh and ensuring the imagery reflects the current landscapes."
        },
        {
            "text": "Users familiar with the previous (2014) profiles will see that much of the content and structure has been translated into the more accessible web-based format.  New features include interactive mapping on a range of topic themes, updated statistics and signposting to other sources of information."
        },
        {
            "text": "The design of the website (based on WordPress) allows for an easier process of updating the information, including as new evidence becomes available.  We have an accompanying User Guide which will allow NE to undertake non-structural updates ourselves, without the need to outsource to contractors."
        },
        {
            "text": "It has been a challenge at times but I am proud to have been involved in a piece of work that has so much personal resonance with my career to date, both in landscape consultancy and at Natural England."
        },
        {
            "text": "The new NCA Profiles website is available to access via: https://www.gov.uk/guidance/national-character-area-profiles-information-for-local-decision-making"
        },
        {
            "text": " "
        },
        {
            "text": "The previous PDF publications from 2012-2014 will still be available on NE’s Access to Evidence site as a past record of information for interested users."
        }
    ]
}