{
    "url": "https://teaching.blog.gov.uk/2024/05/14/a-whole-school-approach-to-mental-health-and-wellbeing/",
    "title": "A whole school approach to mental health and wellbeing",
    "authors": [
        "Jayne Kumi",
        "Matthew Bradley"
    ],
    "categories": [
        "Attendance",
        "Inspiring teachers",
        "Primary schools",
        "Pupil wellbeing and behaviour",
        "School funding",
        "Secondary schools"
    ],
    "pub_date": "2024-05-14T09:05:11+01:00",
    "content": [
        {
            "text": "Jayne Kumi is the designated safeguarding lead and senior mental health lead at Woodmansterne School and Sixth Form, an all-through school in London. She reflects on her leadership role in the journey to implement a whole school approach to mental health and wellbeing. "
        },
        {
            "text": "Implementing a whole-school approach to mental health is a journey, rather than a task with an end point. At the beginning of the journey, I asked myself, ‘what is our vision for a whole-school approach - and how can I ensure that both senior and middle leaders buy into this vision?’"
        },
        {
            "text": "We began by setting up a trained mental health team to coordinate mental health and wellbeing activities across the school. In efforts to make mental health and wellbeing visible throughout the school, we posted images of the team in all classrooms and put a mental health display board in the foyer. Each member of the team also started wearing a specially designed T-shirt at key events with bold print on the front and back stating \"Mental Health, Let's talk about it\"."
        },
        {
            "text": "We operate an open-door policy for new ideas and suggestions which is essential to an effective whole-school approach that everybody feels ownership of. A recent suggestion was regarding a school therapy dog, and following consultation, we now have Pepper  in school 2-3 days per week, providing a calm, stress release experience for children."
        },
        {
            "text": "I completed a 12-week DfE funded senior mental health training with Place2Be which gave access to invaluable resources and a chat room for networking.  There are a number of providers for the course, and I would recommend that settings seek to identify a course relevant to their needs using the Carnegie ‘select a course tool’. "
        },
        {
            "text": "Following the training, SLT undertook a mental health audit of our existing provision and the findings were presented to teaching and non-teaching staff. The audit helped identify our strengths and served as a foundation for confidence and growth and areas for development.   As a result of the training, I am more confident and proactive in in my role. I have put in place a mental health framework which provides tiered and context-based guidance for school staff on how to be involved with mental health. The framework enables staff to understand their role in promoting mental health in everyday activities, identifying potential concerns, listening and referring on."
        },
        {
            "text": "Supporting the wellbeing of staff through the work of our staff wellbeing committee is also key. We often remind staff of the importance of ‘putting your oxygen mask on first’, to ensure they are mentally well and able to support our children. This is true of our parents and carers also; hence we work hard to engage them with resources, workshops, fairs, and an open-door policy."
        },
        {
            "text": "Our senior leadership team have achieved so much through our continuous efforts to involve the whole school, including staff, pupils, parents and carers in our approach. This is a continuous journey, and we remain open to learning and growing as we further develop our approach."
        },
        {
            "text": " "
        },
        {
            "text": "Matthew Bradley is the headteacher and mental health lead at Newton Farm Nursery, Infant and Junior school in London. He talks about how the senior leadership team worked together to review and develop their approach to supporting mental health and wellbeing throughout the school.  "
        },
        {
            "text": "Mental health is an interesting and challenging problem for any school. It poses complex questions that we feel need to be managed by senior members of staff."
        },
        {
            "text": "At our school, the deputy headteachers and I are senior mental health leads (SMHL). In order to better understand the issues, we undertook training through the DfE’s senior mental health lead training grant."
        },
        {
            "text": "Following the training, we spent a day together, discussing what we had learned, and developing our strategic thinking to come up with a plan that would be understood, accepted and genuinely embedded across the school. To ensure whole school buy-in, SLT have championed efforts to promote mental health and wellbeing by promoting several core principles:"
        },
        {
            "text": "We reviewed all our mental health initiatives and increased their visibility. We made changes to common strategies:"
        },
        {
            "text": "The management changes we have introduced ensure that our whole school approach is understood and actively supported by staff. We maintain the profile of mental health by ensuring that some element of wellbeing is discussed in each of our weekly “All Hands” meetings. This means staff feel involved in the decision-making processes, and their concerns are understood. The investment of time and energy made by working together has resulted in a happier and more productive school - and a journey well worth engaging in for any SLT."
        },
        {
            "text": "Further reading: "
        }
    ]
}