{
    "url": "https://stratcommand.blog.gov.uk/2024/05/14/algarve-it-a-go/",
    "title": "An exercise with the Portuguese Navy? Algarve it a go!",
    "authors": [
        "abievans"
    ],
    "categories": [
        "Gibraltar",
        "International",
        "Overseas Bases"
    ],
    "pub_date": "2024-05-14T13:17:28+01:00",
    "content": [
        {
            "text": "One of the two Royal Navy Gibraltar Squadron (RNGS) patrol vessels has completed her maiden over the horizon deployment to Portugal to take part in Exercise ALLGARVEX-24."
        },
        {
            "text": "After a slightly bumpy transit through the Strait of Gibraltar, HMS CUTLASS (CTLS) arrived in Portimão to partake in two days of competitive but good-natured training. Portuguese Naval Vessels NRP CASSIOPEIA and NRP HIDRA worked alongside CTLS, as well as boarding exercises with a Portuguese marine team. The training included simulated Fast Inshore Attack Craft attacks, Officer of the Watch Manoeuvres, towing, Man Overboard recovery drills and Gunnery."
        },
        {
            "text": "The exercise is a huge milestone for the Cutlass-class Royal Navy Patrol Launch (RNPL), which typically patrols British Gibraltar Territorial Waters (BGTW), operating an immediate readiness profile 365 days a year, and builds upon last May’s successful visit to Tangier, Morocco."
        },
        {
            "text": "The Commanding Officer of HMS CUTLASS said: “The Royal Navy Gibraltar Squadron used to visit Portugal frequently, but due to COVID-19 and the work getting the Cutlass-class to full operational capability, we haven’t visited the region since 2018 in HMS SCIMITAR."
        },
        {
            "text": "The deployment has been very important for the Squadron to prove the range of the Cutlass-class whilst also visiting somewhere different and working alongside our friends in the Portuguese Navy."
        },
        {
            "text": "It was fantastic to share tactics and procedures with a fellow NATO ally by training together; our hosts from the Southern Maritime Zone Command could not have been more welcoming and we very much look forward to returning in the future.”"
        }
    ]
}