{
    "url": "https://nationalscreening.blog.gov.uk/2024/05/14/annes-ethical-principles-forged-in-tandem-careers/",
    "title": "Anne’s ethical principles forged in tandem careers",
    "authors": [
        "Mike Harris"
    ],
    "categories": [
        "General"
    ],
    "pub_date": "2024-05-14T10:03:48+01:00",
    "content": [
        {
            "text": "Professor Anne Slowther has enjoyed tandem careers as a GP and an academic."
        },
        {
            "text": "These parallel roles have been very important in her work as a clinical ethicist and a member of the UK National Screening Committee (UK NSC)."
        },
        {
            "text": "She said:"
        },
        {
            "heading": 2,
            "text": "Background and career"
        },
        {
            "text": "Anne grew up in Newcastle upon Tyne, studied medicine at Manchester University and worked as a junior doctor in Manchester after qualifying."
        },
        {
            "text": "In the mid-1980s, she and her husband Martin worked for 2 years as GPs in Lusaka, Zambia. On their return, Anne worked for several years as a GP in Altrincham, Cheshire. It was during this time that she developed an interest in medical ethics."
        },
        {
            "text": "Anne was a member of the local research ethics committee at that time, so had an interest in ethics from a research perspective as well. She moved south with her husband Martin when he took up a career in medical research. She took this opportunity to pursue her interest in medical ethics by studying for a master's in medical ethics and law at King’s College, London."
        },
        {
            "text": "Anne became particularly interested in the role of clinical ethics committees in supporting and advising healthcare professionals on ethical issues around patient care."
        },
        {
            "text": "Her research on clinical ethics committees with Tony Hope, professor of medical ethics at Oxford University, led to the establishment of the UK Clinical Ethics Network and she was a member of the network’s board of trustees until recently."
        },
        {
            "text": "Anne completed a DPhil at Oxford, looking at ethical decision-making in primary care, before moving to the University of Warwick in 2006 where she led the teaching of medical ethics in the medical school curriculum. Her research has continued to focus on the ethics of decision-making in clinical practice and she continued with her clinical work as a GP in Coventry until 2016."
        },
        {
            "text": "She formally retired at the end of 2023 but continues to do some research and teaching at Warwick as an emeritus professor."
        },
        {
            "heading": 2,
            "text": "Ethical issues in screening"
        },
        {
            "text": "National screening programmes involve very large numbers of people, so the potential benefits are great, but so are the potential harms."
        },
        {
            "text": "The ethical principles that are so important at an individual patient level need very careful consideration at a population level where the consequences can be amplified."
        },
        {
            "text": "Anne said:"
        },
        {
            "text": "Anne chaired the working group that developed the UK NSC ethical framework in 2021 ."
        },
        {
            "text": "The committee thinks very carefully about the potential ethical implications of its decisions. A good example is the work carried out with Genomics England and the UK Research and Innovation’s Sciencewise programme to consider the complex ethical and societal implications of using whole genome sequencing (WGS) technology in newborn screening."
        },
        {
            "text": "Anne chaired the oversight group that guided this in-depth public dialogue, which subsequently won a prestigious national award. The research considered difficult questions about the possible use of WGS in newborn screening, such as what conditions it would be acceptable to screen for and how parents could be helped to make truly informed choices."
        },
        {
            "text": "With its expanded remit, and against a backdrop of AI and other technological developments, the UK NSC will need to grapple with many more ethical issues."
        },
        {
            "text": "Anne added:"
        },
        {
            "heading": 2,
            "text": "Pedal power"
        },
        {
            "text": "Away from her tandem careers of clinical practice and academia, Anne rides tandem to relax with Martin on their bicycle made for 2 and they have been on many trips at home and abroad."
        },
        {
            "text": "In recent years they have been completing a tandem cycle ride from the Atlantic to the Black Sea."
        },
        {
            "text": "Their ride across Europe started in Biarritz on France’s Basque coast and they got as far as Budapest in 2019. Covid then put a spoke in their wheel but they hope to complete their adventure to the Black Sea soon."
        },
        {
            "text": "Anne’s other main leisure interest is the theatre and she is a regular audience member at the Royal Shakespeare Theatre in Stratford on Avon near her Cotswolds home."
        },
        {
            "heading": 2,
            "text": "Keep up to date"
        },
        {
            "text": "The UK NSC blog provides up to date news from the UK NSC. You can register to receive updates direct to your inbox, so there is no need to keep checking for new articles. If you have any questions about this blog article, or about the work of the UK NSC, please email uknsc@dhsc.gov.uk."
        }
    ]
}