{
    "url": "https://defrafarming.blog.gov.uk/2024/05/14/funding-available-for-nutrient-management-solutions/",
    "title": "Funding available for nutrient management solutions",
    "authors": [
        "Joss Wallace"
    ],
    "categories": [
        "Payments for research and innovation",
        "Payments to improve soil health"
    ],
    "pub_date": "2024-05-14T15:09:06+01:00",
    "content": [
        {
            "text": "With good nutrient management, farmers and growers can increase their productivity and protect the environment too.  "
        },
        {
            "text": "Nutrient management involves using either organic or manufactured nutrients as efficiently as possible to maximise plant uptake, crop growth and yield. "
        },
        {
            "text": "It also includes applying nutrients where and when they can be best used by plants, thereby combating run-off and soil erosion.  "
        },
        {
            "text": "But the management of nutrients is not without its challenges: from leaching and run off to the removal of contaminants.  "
        },
        {
            "text": "Through the £15 million Nutrient Management competition,  part of the Farming Innovation Programme, we’re offering funding to develop solutions which address the challenges related to nutrient management in soils and water associated with agricultural livestock and crop production. "
        },
        {
            "text": "In this post, I’ll share an overview of the competition and link to the guidance so you can prepare to apply when applications  open on 29 May.  "
        },
        {
            "heading": 2,
            "text": "Competition overview  "
        },
        {
            "text": " There is now the opportunity to apply for a grant through two competition strands:  "
        },
        {
            "text": "Projects which might be funded could include:   "
        },
        {
            "text": "Projects should develop technologies that can be readily adopted by English farmers and growers to improve their nutrient management.  "
        },
        {
            "text": "We are also exploring a second opportunity to apply for funding later this year. We'll keep you updated. "
        },
        {
            "heading": 2,
            "text": "Dates to note "
        },
        {
            "text": "The competition is delivered in partnership with Innovate UK, part of UK Research and Innovation (UKRI). "
        },
        {
            "text": "If you have any questions about the competition, get in touch with Innovate UK: support@iuk.ukri.org"
        },
        {
            "text": " Subscribe to the Farming blog for updates from the team and details of funding opportunities ahead.  "
        }
    ]
}