{
    "url": "https://governmentscienceandengineering.blog.gov.uk/2024/05/14/homeward-bound-part-2/",
    "title": "Homeward Bound Part 2",
    "authors": [
        "gseprofession",
        "Harriet Teare"
    ],
    "categories": [
        "Blog Series",
        "Guest Blog"
    ],
    "pub_date": "2024-05-14T12:51:07+01:00",
    "content": [
        {
            "heading": 3,
            "text": "It rained in Antarctica, and ice that is thousands of years old is melting – my journey to Antarctica"
        },
        {
            "text": "In this blog we check back in with Harriet Teare, a GSE member from MHRA, who embarked upon the Homeward Bound expedition to Antarctica last November. In this instalment, Harriet shares her experiences on the trip and the learnings she brought home."
        },
        {
            "text": "The journey begins"
        },
        {
            "text": "The voyage was the face-to-face element of Homeward Bound, the global leadership programme for women and non-binary people with backgrounds in STEMM (science, technology, engineering, maths and medicine), which I had first applied to in January 2020."
        },
        {
            "text": "The programme was delivered in a variety of workshops and discussions, including a ‘symposium at sea’ – where we each presented on our backgrounds and motivations for being part of the group. It was a significant highlight to hear about the variety of career interests, disciplines, sectors, nationalities, and cultures that the 109 members of our cohort brought to the programme."
        },
        {
            "text": "I set off from Heathrow in early November, alongside several of our Scottish participants, and we gradually gathered into a larger group as we made our way, via Buenos Aires, to congregate in Puerto Madryn. We spent two days together to set the foundations for our programme, to develop our code of conduct, and intentionally consider how we would work together and live together aboard the Island Sky."
        },
        {
            "text": "Learning to adapt"
        },
        {
            "text": "Our first glimpse of the impact that climate change is having on Antarctica and its surrounding waters came as we crossed the Drake Passage – the infamous stretch of water between southern Argentina and Antarctica. While the Drake is renowned as one of the most treacherous stretches of water for ships to cross, the weather conditions we encountered were unusual as the wind was travelling directly north, which, combined with the 8metre swell, caused the ship to roll and pitch dramatically."
        },
        {
            "text": "We were crossing the Drake Passage on our way to King George Island, in the South Shetlands, and our introduction to Antarctica. At least this was the current plan, as it had changed several times in response first to avian flu and then due to the unusual weather, and danger of further rough seas requiring us to bypass Elephant Island – the site where Shackleton’s crew awaited his rescue."
        },
        {
            "text": "Throughout our voyage, we were reminded of the need to constantly respond to changing circumstances and conditions, and to treat each change as ‘plan A’, because it was the best available choice for the day. This was one of many lessons in emergent leadership which our surroundings inspired."
        },
        {
            "text": "Arriving in Antarctica"
        },
        {
            "text": "Following two days of rough seas to cross the Drake, we awoke to pristine silence, absolute calm, and our first impression of Antarctica. A mixture of turquoise-tinged ice bergs, snow-covered islands, and rafts of porpoising penguins. Throughout the voyage, we were treated to sightings of 6 different species of penguin, humpback and fin whales, Weddell, crabby and elephant seals, and a daily entourage of albatross and petrels, cormorants and terns."
        },
        {
            "text": "Our days were divided between the leadership programme and excursions off ship, for example to Deception Island – an active volcano which last erupted in 1967. On shore, we climbed to the edge of the crater, and then gathered at the water’s edge for our much-anticipated ‘polar plunge’, an opportunity to swim in 0.6°C water. We also visited Port Lockroy, and the ‘Penguin Post Office’."
        },
        {
            "text": "The programme itself covered the four streams we’d been working on virtually – leadership, strategy, visibility, and STEMM. The first half of the voyage was led by our faculty members, and then we put our names in a hat, and three ‘leaders’ were selected each day to enable an emergent leadership approach. We discussed priorities for these sessions across the group, forming collaborative workshops to develop projects to continue beyond the project, and build the legacy of our journey – and we continue to work on these priorities together now we’re home."
        },
        {
            "text": "A journey to remember "
        },
        {
            "text": "The voyage provided an opportunity to be totally disconnected from the rest of our lives, and to experience an isolated corner of the world which demonstrates up close the impact of humankind on the climate, and the significant consequences changes in Antarctica will have on the rest of the world. The expedition crew included several polar researchers who, over recent decades, have witnessed the changes that are occurring and could point out how unusual some of our experiences were – including experiencing rain on one of our outings, signalling much milder temperatures than would usually be expected at that time of year."
        },
        {
            "text": "Antarctica is a remarkable demonstration of international collaboration, science and peace, and there is much that we can learn from it. It was an immense privilege to witness its beauty, and to understand its vital and fragile role in supporting life around the world. For all of us on our return, the challenge is how we share this experience and continue to work together to help secure our future."
        }
    ]
}