{
    "url": "https://cddo.blog.gov.uk/2024/05/14/understanding-the-new-digital-and-technology-spend-controls/",
    "title": "Understanding the new Digital and Technology Spend controls",
    "authors": [
        "Joe Ward, Senior DDAT Advisor, CDDO",
        "Matt Wadds, Senior DDAT Advisor, CDDO"
    ],
    "categories": [
        "CDDO",
        "Digital transformation",
        "Government Digital and Data"
    ],
    "pub_date": "2024-05-14T09:30:13+01:00",
    "content": [
        {
            "text": "In the Central Digital and Data Office (CDDO) performance and assurance team, we apply the digital and technology spend controls process with government organisations to make sure that public money is spent efficiently, effectively and that outcomes are aligned to government digital and data standards such as the technology code of practice."
        },
        {
            "text": "The digital and technology landscape across government has advanced considerably, with new technologies and further investment to drive productivity, so it is important that our assurance process is proportionate, focused and impactful and aligns to our commitments in the digital roadmap’s mission six - A system that unlocks digital transformation. The new policy keeps pace with the vast digital transformation work being done across government. "
        },
        {
            "text": "We have updated the policy and simplified how spend cases are assessed, all whilst helping government assurance teams meet their challenges and empowering them to deliver. This is supported by a new get approval to spend service. "
        },
        {
            "heading": 3,
            "text": "Get approval to spend service"
        },
        {
            "text": "Tracking digital and technology spend is difficult. Categorising it for assurance purposes even more so. Organisations are using different, mainly manual, methods to track spend. This meant that getting meaningful insights to help inform decisions and future opportunities was challenging. The get approval to spend service changes that and supports the whole version 6 digital and technology spend controls process. It captures spend cases in a standard way, automatically builds out a pipeline of activity for organisations and enables much improved tracking of case conditions. It will unlock standardisation and will deliver greatly enhanced insights. "
        },
        {
            "heading": 3,
            "text": "Digital and technology spend controls version 6 policy"
        },
        {
            "text": "The policy sets out how the digital and technology spend controls process works from start to finish. We have made the guidance clearer, removed ambiguous terms and streamlined the process making it an easier process to follow."
        },
        {
            "heading": 3,
            "text": "Risk and importance framework"
        },
        {
            "text": "Previous versions of the digital and technology spend approvals process followed an approach which assessed all spend cases in a similar way, regardless of the risk and importance of the case. The risk and importance framework ensures that high-risk and high-value cases get the attention they require, whilst making the approval process for low risk and low value cases more efficient for organisations. The risk and importance framework is built into the get approval to spend service, so when a user uploads a spend case, they answer a series of questions to be provided with an automated risk rating. This means all cases get a baseline assessment to work from, making it easier to determine how cases get assured. "
        },
        {
            "heading": 3,
            "text": "Earned Autonomy"
        },
        {
            "text": "There is a big difference across government organisations in how digital and technology spend controls are managed internally, whether that’s in terms of team capacity, skills or maturity. We want to empower internal teams to independently approve low and medium risk spend activity wherever they can. "
        },
        {
            "text": "This is based on alignment to the government functional standard for digital  and ministers will now be able to grant a greater level of digital and technology spend control decision making. This means that organisations can progress low and medium risk spend activity much more quickly. Not only does this empower organisations to strive for and develop internal maturity, but it also enables CDDO to focus and conduct more in-depth assurance on high-risk and high-value cases."
        },
        {
            "heading": 3,
            "text": "Alignment to strategic commitments"
        },
        {
            "text": "We’ve updated them, aligned them to the transforming for a digital future roadmap and made them clearer. Strategic commitments will be checked for major spend activity using the get approval to spend service. Strategic commitments are important and aligned to government strategy. Not meeting them will mean a case is considered contentious and could be a reason to reject spend."
        },
        {
            "heading": 3,
            "text": "When will these changes be introduced across government?"
        },
        {
            "text": "Adherence to these new changes will start once your organisation has been on-boarded onto the get approval to spend service. CDDO will work with you to understand and best implement these changes in your organisation."
        },
        {
            "text": "We’ve started a new chapter in digital and technology assurance, and will continuously refine our approach, with the help of government organisations so your support is needed."
        }
    ]
}