{
    "url": "https://stratcommand.blog.gov.uk/2024/05/14/we-are-strategic-command-with-jason-acourt/",
    "title": "We Are Strategic Command with Jason A'Court",
    "authors": [
        "HeatherS"
    ],
    "categories": [
        "Uncategorized"
    ],
    "pub_date": "2024-05-14T09:13:43+01:00",
    "content": [
        {
            "text": "Learn about the crucial role that the Risk and Performance Team in Strategic Command ensure informed decisions are made."
        },
        {
            "text": " "
        },
        {
            "text": "Interviewer: Can you tell us about the work that you and your team deliver? "
        },
        {
            "text": "Jason: My team and I analyse and deliver critical risk and performance information to the Command Group, aiding them in making informed decisions on how to manage risk and to see how the Command is doing against our organisational objectives."
        },
        {
            "text": " The team is part of the Risk, Performance, and Management System (RPMS) at Strategic Command, where I serve as the Assistant Head of the Performance and Risk Team. My responsibilities involve overseeing delivery across both the performance and risk sides of the team."
        },
        {
            "text": " "
        },
        {
            "text": "Interviewer: How do you define risk management within your role? "
        },
        {
            "text": "Jason: Risk management, from our perspective, involves effective preparation for potential future events that could disrupt our ability to meet objectives or outputs."
        },
        {
            "text": " "
        },
        {
            "text": "Interviewer: Can you explain how your team operates within the organisation?"
        },
        {
            "text": " Jason: We have two primary areas of focus: the Performance side, which interfaces with Head Office via the Strategic Hub, and the Risk side, which connects with Head Office through the Defence Risk Authority (DRA)."
        },
        {
            "text": "The looks at areas, involving our High-Level Budgets (HLBs), functions of the Command, and various monitored objectives tied to these areas."
        },
        {
            "text": " "
        },
        {
            "text": "Interviewer: How does your team monitor performance against these objectives?"
        },
        {
            "text": " Jason: We monitor performance by writing narratives based on objectives and associated metrics. These narratives, along with RAG (Red, Amber, Green) assessment scoring, help us analyse performance and make informed decisions to reduce organisational risk and improve performance."
        },
        {
            "text": " "
        },
        {
            "text": "Interviewer: What sets your approach apart in delivering risk and performance management?"
        },
        {
            "text": " Jason: One unique aspect is our ability to work across all HLBs and functions within the Command. This provides us with valuable insight into Defence's key strategic outputs."
        },
        {
            "text": " "
        },
        {
            "text": "Interviewer: Could you share what you find rewarding about your role?"
        },
        {
            "text": " Jason: The most rewarding aspect is gaining insight into Defence's main outcomes, which allows us to contribute significantly to decision-making processes."
        }
    ]
}