{
    "url": "https://defrafmp.blog.gov.uk/2024/05/14/welcome-to-the-fisheries-management-plans-blog/",
    "title": "Welcome to the Fisheries Management Plans blog!",
    "authors": [
        "Nicola Lewellen, Programme Engagement and Communications lead"
    ],
    "categories": [
        "-Defra FMP programme"
    ],
    "pub_date": "2024-05-14T09:00:15+01:00",
    "content": [
        {
            "text": "Hello, and welcome to the Fisheries Management Plan (FMP) blog! "
        },
        {
            "text": "The blog is run by the FMP team and is the place you can find all news and updates about FMPs. "
        },
        {
            "text": "We’ve been busy over the last couple of years and already published five FMPs, with another on its way.  We are about to consult on another five draft FMPs, and we are starting to deliver the actions set out in the first of those published FMPs. "
        },
        {
            "text": "Central to our approach is collaboration. We asked the fishing sector what they wanted in a new fisheries policy after we left the EU.  As well as better, more adaptive and appropriate management, the sector really wanted to be involved in developing that management.  And they want to take more responsibility for ensuring sustainable stocks – something crucial for future generations.   "
        },
        {
            "text": "We have listened and have started out as we mean to go on. Hundreds of conversations in online and quayside meetings as well as emails and consultation responses have helped us shape the FMPs and are beginning to help us deliver the actions in the FMPs.   "
        },
        {
            "text": "Regular communication and engagement are key to the success of FMPs. We haven’t got everything right and are learning as we go along.  But we hope this blog will help people with an interest keep in touch with developments and understand what is happening.   "
        },
        {
            "text": "Our posts will range from short updates and stories to big announcements covering the development and implementation of the plans, as well as details on how and when you can get involved. "
        },
        {
            "text": "Find out why we blog, how we blog and more about us at About this blog and About Us"
        }
    ]
}