{
    "url": "https://defrafarming.blog.gov.uk/2024/05/14/wet-weather-and-temporary-adjustments-to-agri-environment-agreements/",
    "title": "Wet weather and temporary adjustments to agri-environment agreements",
    "authors": [
        "The Team"
    ],
    "categories": [
        "Countryside Stewardship",
        "Environmental Stewardship",
        "Sustainable Farming Incentive",
        "Sustainable Farming Incentive pilot",
        "Things we're doing"
    ],
    "pub_date": "2024-05-14T15:28:18+01:00",
    "content": [
        {
            "text": "Between October 2023 and March 2024, England experienced the second wettest 6-month period on record. The rainfall was nearly 60% above the 10-year average. "
        },
        {
            "text": "Heavy rainfall has a devastating and long-term impact on farming, with soil erosion, crop damage and flooding. This disruption not only affects the livelihoods of farmers and land managers but also has wider implications for food security and the economy."
        },
        {
            "text": "In addition to the package of support offered through the Farming Recovery Fund, we have introduced temporary adjustments and easements within the Sustainable Farming Incentive (SFI), the SFI Pilot, Countryside Stewardship (CS) and Environmental Stewardship (ES) to support farmers and land managers dealing with the impacts of severe weather in England. "
        },
        {
            "text": "Essentially, if bad weather has caused disruptions to your farming activities or affected your ability to meet the mandatory requirements set out in your agreements, the adjustments allow more time to establish or defer some activity to later in the year. "
        },
        {
            "text": "Today we published official guidance on these temporary easements and adjustments on GOV.UK."
        },
        {
            "text": "The adjustments recognise that weather conditions are beyond the control of farmers. They are designed to provide flexibility during this difficult period. They cover the period from 1 October 2023 to 31 July 2024 for agreements that are now live. "
        },
        {
            "text": "The adjustments will automatically apply – you don’t need to submit a request.  "
        },
        {
            "text": "In some cases, you may not have been able to attempt an action or option due to being underwater. If this applies to you and you do not believe you can meet the aims of the option or action within the temporary adjustment provision, you must contact the Rural Payments Agency (RPA). "
        },
        {
            "text": "You’ll need to fill in a minor and temporary adjustment form for ES and CS and tell us about a change of circumstance for SFI to amend your agreement. This detail is already available in the Extreme weather guidance for farmers and land managers on GOV.UK. "
        },
        {
            "text": "It’s a good idea to keep evidence such as farm records showing field operations at a land parcel level, associated invoices and photographs of how you have been affected in case we need to see them. "
        },
        {
            "text": "In this post, we'll share a summary of the actions and options. As mentioned, details of the adjustments and easements for each action are on GOV.UK. "
        },
        {
            "text": "Please note that the following tables (which mirror those on GOV.UK), may not cover all the options and actions impacted by the wet weather. If this is the case for you, contact the RPA, they’ll talk through your options.  "
        },
        {
            "heading": 2,
            "text": "Environmental Stewardship"
        },
        {
            "heading": 2,
            "text": "Countryside Stewardship"
        },
        {
            "heading": 2,
            "text": "Sustainable Farming Incentive (SFI)"
        },
        {
            "heading": 2,
            "text": "SFI Pilot "
        },
        {
            "text": "The SFI Pilot has groups of actions which form a standard. SFI Pilot agreement holders must meet all actions to achieve the standards. The table below shows which actions within each standard are subject to easements."
        },
        {
            "text": "No easements apply to the Farm Woodland Standard or Hedgerow Standard."
        },
        {
            "heading": 2,
            "text": "Further flooding support "
        },
        {
            "text": "In addition to this immediate relief, we are also supporting farmers to build greater resilience into farm businesses and mitigate the impacts of extreme weather long-term.  "
        },
        {
            "text": "Farmers are eligible for support through the Flood Recovery Framework. We recently blogged about support for farmers affected by Storm Henk."
        },
        {
            "text": "This also includes a grant of up to £2,500 as part of the Business Recovery Grant.   "
        },
        {
            "text": "We are introducing new actions with flood mitigation benefits to our environmental land management offer this year. These include actions to reduce flood risk, restore and enhance floodplains, and better storage of flood water.   "
        },
        {
            "text": "Through Landscape Recovery, we are funding river restoration projects that have direct flood mitigation benefits. These will restore water bodies, rivers and floodplains to a more natural state, reducing nutrient pollution, benefiting aquatic species, and improving flood mitigation and resilience to climate change.   "
        },
        {
            "text": "Earlier this year, we announced a one-off fund of up to £75 million to help Internal Drainage Boards in England recover from recent flooding and modernise infrastructure. "
        },
        {
            "text": "The government is also investing £5.6 billion as part of a 6-year plan (2021-2027) to better protect communities across England from flooding and coastal erosion."
        }
    ]
}