{
    "url": "https://defrafmp.blog.gov.uk/2024/05/14/what-are-fmps-and-how-are-they-prepared/",
    "title": "What are FMPs and how are they prepared",
    "authors": [
        "Claire Dyer, Policy Advisor, Defra"
    ],
    "categories": [
        "-Defra FMP programme"
    ],
    "pub_date": "2024-05-14T09:10:12+01:00",
    "content": [
        {
            "text": "On leaving the EU and the Common Fisheries Policy, we had the opportunity to think about how to manage our fisheries differently.   "
        },
        {
            "text": "Globally, Fisheries Management Plans (FMPs) are considered to be the best way to manage fisheries.  They allow fisheries to be managed according to local conditions and priorities, to be adaptive and for management to develop over time.   "
        },
        {
            "text": "So, the four fisheries Administrations (in England, Scotland, Wales and Northern Ireland), with the support of the fishing sector and other stakeholders decided to make FMPs the cornerstone of our new fisheries management approach.   "
        },
        {
            "text": "We made the production of FMPs a requirement in the Fisheries Act 2020.  "
        },
        {
            "text": "The Act required the publication of a UK wide Joint Fisheries Statement (JFS). The JFS sets out the high-level policy framework and list of Fisheries Management Plans (FMPs), who is responsible for producing them and the timetable for publication. "
        },
        {
            "text": "What are FMPs? "
        },
        {
            "text": "FMPs set out policies to maintain or increase stocks to sustainable levels (or contribute to doing so) and give the fishing sector a greater role in managing fishing activity. "
        },
        {
            "text": "As our last blog post set out, FMPs allow us to work more closely with the fishing and recreational sectors as well as wider stakeholders. We can now work together to tailor management to our fisheries. "
        },
        {
            "text": "Defra is responsible for preparing and publishing 10 plans in English waters, four jointly with Welsh Government and one jointly with Scottish Government.  We are working collaboratively with many others - we’ll set out who in a future blog post. "
        },
        {
            "text": "Each plan is tailored to the species, type of fishing and location/s - this is why working with the groups and communities that understand and use these fisheries is so important "
        },
        {
            "text": "The draft plans go through public consultation giving all interested parties the opportunity to give their views, before being published. We will continue to work together with the fishing sector and wider stakeholders to implement the plans including how we fill our evidence gaps.  "
        },
        {
            "text": " "
        },
        {
            "text": "What is the process for developing an FMP?"
        },
        {
            "text": "For a printable version of this process please email us at fmp@defra.gov.uk"
        }
    ]
}