{
    "url": "https://defrafmp.blog.gov.uk/2024/05/14/where-we-are-now-with-fmps/",
    "title": "Where we are now with FMPs?",
    "authors": [
        "Claire Dyer, Policy Advisor, Defra"
    ],
    "categories": [
        "Bass FMP",
        "Black seabream FMP",
        "Celtic Sea and Western Channel demersal FMP",
        "Celtic Sea and Western Channel pelagic FMP",
        "Channel non-quota demersal FMP",
        "Cockles FMP",
        "Crab and lobster FMP",
        "King scallop FMP",
        "North Sea and Channel sprat FMP",
        "Queen scallop FMP",
        "Southern North Sea and Channel skates and rays FMP",
        "Southern North Sea and Eastern Channel mixed flatfish FMP",
        "Southern North Sea non-quota demersal FMP",
        "Whelks in English waters FMP",
        "Wrasses complex FMP"
    ],
    "pub_date": "2024-05-14T13:56:42+01:00",
    "content": [
        {
            "text": "Here's the latest on what we’ve been up to with the Defra led Fisheries Management Plans (FMPs). "
        },
        {
            "text": "Each FMP is moving along at different stages. The key thing to note is that these plans are not a one-size-fits-all deal - it's all about taking a targeted approach, working together to develop and implement the right plans for our fisheries.  "
        },
        {
            "text": "Defra are leading the preparation of 15 FMPs.  "
        },
        {
            "text": "If you see* next to an FMP name below this means there are multiple stocks or species. You can find the details of these on our policy page- https://www.gov.uk/government/publications/fisheries-management-plans/fisheries-management-plans"
        },
        {
            "text": " "
        },
        {
            "heading": 3,
            "text": "We consulted on the first six FMPs between July and October 2023, covering:  "
        },
        {
            "text": " On 14 December 2023, we published the first five plans (the sixth will be published in 2024) The published plans can be found here: https://www.gov.uk/government/publications/fisheries-management-plans/fisheries-management-plans#recent-fmps  "
        },
        {
            "text": "Work has started, in a collaborative and transparent way, to tackle evidence gaps and implementation of the actions in the FMPs. There will be opportunities to get involved so come back to the blog for updates as this work progresses. "
        },
        {
            "heading": 3,
            "text": "We are developing a further five FMPs to be published by the end of 2024 covering: "
        },
        {
            "text": "We will announce on the blog when the consultations are open and how you can have your say. "
        },
        {
            "heading": 3,
            "text": "A further four plans are in development, and these will be published by the end of 2025. They cover: "
        },
        {
            "text": " To get involved in the development of these draft FMPs contact the delivery partner. Contact details can be found here: https://www.gov.uk/government/publications/fisheries-management-plans/fisheries-management-plans#fmps-in-development-for-publication-in-2025 "
        },
        {
            "text": " "
        },
        {
            "text": "This infographic gives an overview of the timeline for the development, publication and implementation of Defra's FMPs. "
        }
    ]
}