{
    "url": "https://openpolicy.blog.gov.uk/2024/04/17/announcing-the-second-year-of-manifest-three-new-artists-placed-in-policy-teams/",
    "title": "Announcing the second year of MANIFEST: three new artists placed in policy teams",
    "authors": [
        "Stephen Bennett"
    ],
    "categories": [
        "Policy Lab"
    ],
    "pub_date": "2024-04-17T09:32:49+01:00",
    "content": [
        {
            "text": "Policy Lab provides an experimental environment for testing and evaluating new ways to make policy. In our ten-year history we have created space for designers, technologists, ethnographers and other novel practitioners, all with the aim to make policy more effective, efficient and informed by the voice of the citizen. To this end, our MANIFEST programme provides opportunities for artists, funded by the Arts and Humanities Research Council (AHRC), to work with policymakers to jointly consider whether artists or artistic approaches can be useful in policymaking. We recently shared an evaluation of this from the first year of the programme. Policy Lab is pleased to announce a second year of MANIFEST, with three new artists beginning placements in policy teams.  "
        },
        {
            "text": "Ruth Levene is an artist based in Sheffield, Yorkshire. For some time, Ruth’s practice has explored ways of bringing people together to look at complex systems and collectively share different understandings. Ruth has worked with anthropologists, model makers, quakers and farmers - to name a few - to carve out space and create tools to share learning, help dialogue and re-imagine new systems to live by.  "
        },
        {
            "text": "As an example of Ruth’s previous work, Towards A Common Waters Policy (2016 – 2021), created with anthropologist Dr Megan Clinch, explores causes of flooding in the Calder catchment and what we can do about it. It is an oblique and creative approach to policy. The resultant ‘policy document’ takes the form of a beautifully crafted poetic book, whilst some of the ‘consultations’ involved discussions in pubs and community centres, with Ruth deploying CNC-milled maps and geological cake baking. But in many ways Ruth’s process is underpinned by the same principles which characterise some of the best policymaking: engaging a broad spectrum of people; going to where people are (not expecting them to come to you); using tailored modes of communication and engagement; a dialogical approach; the development of innovative policy ideas. "
        },
        {
            "text": "Kasia Molga based in Margate, Kent, is an interdisciplinary practitioner driven by a curiosity how design, science and technology intersect and how art can reveal stories embedded in those intersections. Kasia focuses on ever-changing human relation towards, and perception of, the natural. She seeks ways of conveying notions of collaboration with nature. Kasia makes objects, sculptures, audio visual work, immersive experiences, hybrid interfaces or sometimes simple drawings or illustrated stories.  "
        },
        {
            "text": "As an example of Kasia’s prior work, Human Sensors fuses data science, fashion tech, speculative design and art to result in stunning, working wearables which allow humans to detect Kings College London air quality data as they walk around environments. The piece is emblematic of Kasia’s ability to create immersive environments which can help citizens and policymakers more fully feel how policy issues may play out and be experienced by people in the future.    "
        },
        {
            "text": "Artist duo YARA + DAVINA make social practice artwork, creating ambitious public pieces that respond to site, context and audience. The pair seek to make accessible artworks about complex ideas to open up a space for conversation and dialogue. They do this by using formats from popular culture, to create engaging and playful artworks that act as provocations.  "
        },
        {
            "text": "YARA + DAVINA’s participatory work Goals (2023), developed with the South London Gallery, sheds light onto their approach. The artists worked with young people, from local estates near the gallery, to think about their personal and collective goals. From site visits and research, they identified an unusual, but very effective, medium: football. Through workshops the artists identified two main themes that the group were interested in: compassion and kindness, and achievement. These themes led to the creation of the two slogans: be a defender and occupy the field. YARA+DAVINA knitted their characteristic aesthetic style with the vernacular of the terraces to manifest a pair of striking scarves. The fusion of empathy, flair and participatory modes of engagement promises enticing results for radically thinking about policymaking. "
        },
        {
            "text": "As well as the AHRC, who have funded the artists, we would like to thank the Policy Profession who have supported the delivery of MANIFEST, as well as Kings College London, the Contemporary Visual Artist Network, the University of Arts London, the Government Art Collection and the Flat Time House. If you would like to speak with us about bringing multidisciplinary practitioners into policy teams, whether artists, designers, creative technologists or systems thinkers, please get in touch.  "
        }
    ]
}