{
    "url": "https://competitionandmarkets.blog.gov.uk/2024/04/17/cma10-essay-competition-winners-announced/",
    "title": "CMA10 essay competition: winners announced",
    "authors": [
        "Lucy Eyre"
    ],
    "categories": [
        "Life at the CMA"
    ],
    "pub_date": "2024-04-17T14:06:05+01:00",
    "content": [
        {
            "text": "We ran an essay competition to mark the 10th anniversary of the CMA. 85 students and recent graduates sent in their entries in response to the question: ‘What are the benefits of a strong competition and/or consumer protection regime, and how can the CMA best deliver them?’"
        },
        {
            "text": "The essays were judged by an eminent panel comprised of Sarah Cardell (Chief Executive of the CMA), Amelia Fletcher CBE (Professor of Competition Policy at Norwich Business School), Richard Whish (Emeritus Professor of Law at King’s College) and Dr Mike Walker (Chief Economist at the CMA)."
        },
        {
            "text": "The winner was Maxwell Curtis, who completed a Masters in Corporate Law from Cambridge in July 2022 and is currently studying at BPP for the Solicitor Qualifying Exams. The judges enjoyed Max’s creativity in presenting his answer as a CMA merger decision."
        },
        {
            "text": "The 2 runners-up were Alex Christou who is studying economics at Strathclyde University, and Henry Rugg who wrote an essay that caught the eye of the judging panel, despite still being in Year 13 (at Dame Alice Owens' Sixth Form in North London). Henry hopes to study maths and economics at university next year and became interested in the work of the CMA when following Microsoft's acquisition of Activision Blizzard in the news last year and seeing the role that the CMA played in safeguarding consumer interests."
        },
        {
            "text": "All 3 winners will be joining CMA staff and key figures from the business, consumer, and competition communities at an event on 18 April to make the CMA’s 10th anniversary."
        },
        {
            "heading": 2,
            "text": "Maxwell's winning essay"
        },
        {
            "text": "Adopting the framework of a CMA merger decision, this essay contends that the CMA, through its expanding statutory powers, can align the interests of consumers and businesses to unlock the competitive potential of ‘UK plc’."
        },
        {
            "text": "Counterproductively, much of the debate concerning competition law policy is premised on the notion that businesses and consumers are on opposing sides. The polarised political climate is undoubtedly contributing to this false dichotomy. This narrative presents the CMA with a seemingly impossible task to promote the interests of both groups. Much like a football referee, it inevitably faces backlash from all directions."
        },
        {
            "text": "In reality, like most things in our complex society, the situation is more nuanced. It is not a zero-sum game. Businesses and consumers have many shared interests, which the CMA can foster by promoting a competitive market and enforcing consumer law pragmatically."
        },
        {
            "text": "The ‘merger’ proposed below sets out how the CMA can best achieve this, ‘clearing’ the way for a reinvigorated UK plc."
        },
        {
            "heading": 3,
            "text": "Proposed Merger between Consumer and Business Interests in the UK"
        },
        {
            "heading": 4,
            "text": "1. The Parties"
        },
        {
            "text": "The proposed transaction seeks to bring together the interests of the 2 key organs of the economy - consumers and businesses - to establish a more competitive UK plc."
        },
        {
            "text": "There are approximately 5.6 million private sector businesses in the UK, with 8,000 ‘large’ businesses (employing over 250 staff) (Footnote 1). There are approximately 67 million consumers in the UK (Footnote 2), spending approximately £1.4 trillion annually (Footnote 3). The UK’s share of supply in the global production of goods and services is estimated at 2.17% (Footnote 4)."
        },
        {
            "text": "The interests of consumers and businesses already overlap in many ways. Whilst businesses are legal persons, they are managed by, and employ, natural persons i.e., consumers. Equally, consumers are vital (active and passive) shareholders and stakeholders in business."
        },
        {
            "heading": 4,
            "text": "2. Background to the Transaction"
        },
        {
            "text": "The proposed transaction would take place at a critical juncture. The UK economy is amidst a cost-of-living crisis, still recovering from the lingering effects of the pandemic. Globally, increased geopolitical conﬂict is threatening the rules-based order and the risks of climate change can no longer be ignored. Adding to this mix is the rapid proliferation of generative AI, which is disrupting all sectors of the economy."
        },
        {
            "text": "In times of such immense challenge and profound uncertainty, the consequences of anti- competitive markets and unfair business practices are particularly severe. Accordingly, the rationale of this proposed transaction is to optimise the UK’s strong competition and consumer protection regime."
        },
        {
            "text": "Not only would this deliver tangible beneﬁts for consumers through lower prices (Footnote 5), it would signal that UK plc is, in fact, ‘open for business’."
        },
        {
            "heading": 4,
            "text": "3. Counterfactual"
        },
        {
            "text": "The counterfactual is a continuation of the partisan discourse of businesses pitted against consumers, distracting from meaningful action to align their interests. The various risks of the status quo are clear:"
        },
        {
            "text": "First, in the absence of a formal co-ordination agreement with the EU, the UK economy would face increasing isolationism from its closest long-term trading partners. There would be a lack of legal certainty, reduced investment and a downward trend in the UK’s global share of supply."
        },
        {
            "text": "Second, if consumers remain largely unaware of their consumer rights and the CMA’s role in safeguarding these, consumers will continue to feel helpless in seeking redress for misleading and unfair practices. Intervention will also be less impactful."
        },
        {
            "text": "Third, the merger control process will grow more adversarial and unpredictable, alienating businesses from the outset of the process. Mergers are an important source of innovation due to their combinatorial nature. Too much unpredictability in merger control can disincentivise start-ups and dampen dynamic competition. This could curtail the UK’s potential as an international leader in AI (Footnote 6)."
        },
        {
            "heading": 4,
            "text": "4. Implementation"
        },
        {
            "text": "Considering the counterfactual risks, the proposed transaction involves three key steps which all have as their object (and hopefully their effect) enhanced legal certainty, consumer protection and dynamic competition for UK plc:"
        },
        {
            "heading": 5,
            "text": "4.1 Entering into a formal co-operation agreement with the EU"
        },
        {
            "text": "Exiting the European Competition Network has made it harder for the CMA to share expertise and coordinate investigations with the European Commission and National Competition Authorities. A formal co-operation agreement with the EU would harmonise the institutions and their processes to enhance legal certainty."
        },
        {
            "text": "Substantively, the agreement could reduce multi-jurisdictional divergence, for example by including guidance on a uniﬁed approach towards behavioural remedies."
        },
        {
            "heading": 5,
            "text": "4.2 Improving public awareness of consumer rights and making more targeted interventions"
        },
        {
            "text": "The CMA is poised to signiﬁcantly enhance its consumer protection enforcement, wielding its impending powers under the Digital Markets Competition and Consumers Bill (DMCC)."
        },
        {
            "text": "Regrettably, consumers in the UK remain largely unaware of their consumer rights and how the CMA acts to protect them. If consumers do not know their rights, they cannot identify illegal practices. This proposal calls for the CMA to ramp up its educational function alongside its enforcement. For example, by entering partnerships with consumer advocacy bodies and launching more digital campaigns. With more informed consumers, unfair trading practices could be deterred without the CMA’s involvement. Furthermore, the CMA would intervene in areas where consumers have expressed greatest concerns, leading to more targeted and impactful enforcement."
        },
        {
            "text": "Ongoing monitoring of potential loopholes is also imperative to effective consumer protection. For example, despite the CMA’s open letter to grocery retailers on unit pricing (Footnote 7), various retailers continue to conceal unit prices for goods which are on ‘special’ through a loyalty scheme."
        },
        {
            "heading": 5,
            "text": "4.3 Allowing for more meaningful engagement earlier in merger inquiries"
        },
        {
            "text": "A merger inquiry is fundamentally a fact-ﬁnding mission. The process aims to uncover the true rationale behind a transaction and how it is likely to affect consumers. However, much of the process is dominated by lengthy written submissions, and opportunities are limited for in-person meetings with key stakeholders until after substantive decisions have been made. This can result in material facts emerging late in the process, frustrating all parties involved and wasting important public resources."
        },
        {
            "text": "Opportunities for early engagement would also be enhanced if case teams comprised of staff with (‘in-house’) business experience from a range of different industries. Merging businesses could then exercise their right to be heard more meaningfully, reducing antagonism and leading to more pro-active future engagement with the CMA."
        },
        {
            "heading": 3,
            "text": "Conclusions"
        },
        {
            "text": "With the imminent introduction of the DMCC, and the emergence of new forms of market power in AI, the proposed transaction would take place at a watershed moment. The CMA’s ability to align consumer and business interests by promoting a well-functioning competitive environment has never been more important."
        },
        {
            "text": "The CMA has a successful track record of preventing anti-competitive industry consolidation (Footnote 8), sanctioning anti-competitive conduct and championing consumer rights. However, by ‘clearing’ the proposed transaction and adopting the above proposals, the CMA can unleash the competitive potential of a revitalised UK plc."
        },
        {
            "text": "Crucially, the CMA can achieve this whilst preserving its political independence, which is a hallmark of the UK’s competition and consumer protection regime."
        },
        {
            "text": " "
        },
        {
            "text": "(Footnote 1): Business population estimates for the UK and regions 2023: as of the start of 2023"
        },
        {
            "text": "(Footnote 2): Population estimate as of mid-year 2021."
        },
        {
            "text": "(Footnote 3): Household ﬁnal consumption expenditure in 2022."
        },
        {
            "text": "(Footnote 4): Using ‘2024 GDP based on PPP, share of world’ measured by the IMF as a proxy."
        },
        {
            "text": "(Footnote 5): In this essay, the term ‘price’ is used as a proxy for various parameters of competition including price, quality and innovation."
        },
        {
            "text": "(Footnote 6): For example, UK signals step change for regulators to strengthen AI leadership."
        },
        {
            "text": "(Footnote 7): Summary of consumer research and unit pricing analysis."
        },
        {
            "text": "(Footnote 8): For example, CMA blocks merger between Sainsbury’s and Asda."
        },
        {
            "heading": 2,
            "text": "A well done and thank you from the CMA"
        },
        {
            "text": "Congratulations to our winner Maxwell, and our 2 runners-up Alex and Henry for their brilliant essays."
        },
        {
            "text": "And a thank you to everyone who entered and took part in the competition."
        }
    ]
}