{
    "url": "https://sustainableict.blog.gov.uk/2024/04/17/engendering-passion-for-our-natural-world/",
    "title": "Engendering passion for our natural world",
    "authors": [
        "Toby Strong"
    ],
    "categories": [
        "GDSA",
        "Sustainable ICT"
    ],
    "pub_date": "2024-04-17T10:33:38+01:00",
    "content": [
        {
            "text": "Toby Strong, award winning cinematographer, and colleague and friend of David Attenborough, shares his reflections on the importance of engendering a passion for our natural world.  "
        },
        {
            "text": "I was honoured and excited to be at the recent GDSA summit and very lucky to be able to speak in front of such a captive audience.  I don’t often get the opportunity to meet such influential change makers from Government and the tech industries, and I hope some of the conversations I had has really engendered a passion for our natural world amongst others. "
        },
        {
            "heading": 2,
            "text": "One planet"
        },
        {
            "text": "Capturing wildlife is what I do, I am privileged that I have seen many things and been to many places most people don't get a chance to. Travelling far and wide has taught me that we, as humans, are animals too, and part of a global ecosystem, an ecosystem I capture as a filmmaker and cinematographer.  "
        },
        {
            "text": "My whole life is centred around my passion for the natural world and capturing it. I use technology to do that. I need the digital world to allow me to capture the natural world, so I can show people beautiful places and species, and hope that this lights a fire in their imagination, so they too recognise how we all must protect our planet, because we only have one.  "
        },
        {
            "text": "By sharing what I have seen I hope that the films that I and my colleagues make inspire people to recognise the beauty of our one planet, and the urgency and necessity to change our ways to protect it, because we are running out of time, and we, as a human race, cannot afford to be anything less than brilliant. "
        },
        {
            "text": "What I mean by that is that climate change is happening. I have seen the effects of it in my 25-year career, it’s affecting people and nature and it is only likely to get worse.  "
        },
        {
            "text": "Climate change affects the places I capture, the wildlife I see and the people I meet. According to The Institute for Economics and Peace, up to 1.2 billion people could be displaced globally because of climate change by 2050. "
        },
        {
            "heading": 2,
            "text": "Be brilliant"
        },
        {
            "text": "We can be, and are brilliant, and we must continue to be brilliant to tackle climate change. I've met hundreds of innovate and inspiring individuals around the world that are helping fix some of the issues society faces, and by doing so are protecting our planet and limiting or even reversing the effects of climate change. "
        },
        {
            "text": "My pledge is to continue my mission to highlight the work of brilliant people around the world who are doing their best to be guardians of our planet, who are developing solutions and tackling our global issues.  "
        },
        {
            "text": "By telling their stories I hope I can spark a passion amongst society, and especially future leaders, for just how important it is to protect our planet, the wonderful  world we live in.  "
        },
        {
            "text": "We can ensure that the future of the digital and tech industry is a sustainable one. We are clever enough and innovative enough to make sure our technological and economic needs are balanced with our societal ones, and I’ve met many people around the world, and here in the UK, who are on a mission to do just that. "
        },
        {
            "text": "I think the biggest challenge is for everyone to remember what is at risk if we fail. For success to happen everyone has to feel the importance of protecting the planet and doing something about it.  "
        },
        {
            "text": "Our hearts and minds must be in this mission for change; let’s do it for our children, for our grandchildren and for all life on Earth. I love to share some of the magic that I have seen, to help visually tell stories and convey what it is we are trying to protect; ultimately that is nature, and in turn, ourselves.  "
        },
        {
            "heading": 2,
            "text": "About Toby:"
        },
        {
            "text": "Toby has worked as a wildlife photographer, filmmaker and cinematographer for over 25 years. Before attending the GDSA summit Toby was filming in Papahānaumokuākea, the most remote archipelago on earth. 1500km Northwest of Honolulu, Hawaii, Papahānaumokuākea is one of the largest marine conservation areas in the world. It encompasses 582,578 square miles of the Pacific Ocean, which equates to just 0.004% of the world’s oceans. Papahānaumokuākea supports incredible biodiversity, providing homes to many rare species such as the green turtle. "
        },
        {
            "text": "Toby spends his career capturing often rare and important species. But these are in decline. According to IUCN more than 44,000 species are threatened with extinction; 28% of all known species. Toby reminds us that “beneath the figures there are beating hearts” - we can often reverse the damage, and we can forge a future that is better. Positive work is being done, but we need to ensure solutions get more attention to enable larger scale results. "
        }
    ]
}