{
    "url": "https://defrafarming.blog.gov.uk/2024/04/17/fipl-spotlight-the-central-dartmoor-farm-cluster/",
    "title": "FiPL spotlight: the Central Dartmoor Farm Cluster",
    "authors": [
        "Mark Ward"
    ],
    "categories": [
        "Payments to support parks, National Landscapes and the Broads"
    ],
    "pub_date": "2024-04-17T13:12:12+01:00",
    "content": [
        {
            "text": "Dartmoor is a distinctive landscape. Open, windswept moorland sheltered woodland valleys, enclosed farmland, varied geology and unrivalled opportunities for recreation are just a few reasons why it was designated as a National Park in 1951. "
        },
        {
            "text": "It is home to 35,000 people, a place for work for 10,000 and a source of enjoyment for millions. Farming has been the main land use for more than 5,000 years. Today, around 90% of the land within the National Park is used for farming. "
        },
        {
            "heading": 2,
            "text": "Farming on Dartmoor "
        },
        {
            "text": "Much of this is moorland, where livestock is grazed, and the remainder is made up of fringe farmland bordered by dry stone walls and hedge banks. "
        },
        {
            "text": "These provide a mosaic of different wildlife habitats, including marshy Rhôs pasture (a priority rush pasture), hay meadows and dry grasslands. "
        },
        {
            "text": "Dartmoor’s climate is cool and wet. One of the main challenges faced by farmers is the impact of climate change; warmer, wetter winters and hotter, drier summers. Climate change will result in increased (and decreased) river flows and an increasing frequency of extreme weather events. "
        },
        {
            "text": "Therefore, farmers are having to evolve with this by establishing nature recovery areas, adopting natural flood management techniques, and adapting their farm practices so that they are more resilient."
        },
        {
            "text": "One example of farmers responding to this challenge is seen in the work of the Central Dartmoor Farm Cluster Community Interest Company (CIC).  "
        },
        {
            "text": "The Cluster of farmers first came together initially in 2019 with funding from the Countryside Stewardship Facilitation Fund as well as instrumental support and continued guidance from the Dartmoor Hill Farm Project. At the time the cluster comprised 10 farmers covering approximately 4,300 acres of in-bye land on Central Dartmoor. "
        },
        {
            "text": "With funded advice and training, they were able to tailor the management of their different areas of boggy Rhôs pasture to benefit the Marsh Fritillary Butterfly. They wanted to go one step further and learn how to improve habitat so that wildlife could become more interconnected and move between their farms. "
        },
        {
            "heading": 2,
            "text": "Cluster plans"
        },
        {
            "text": "They identified the need to have better information about the existing and potential enhancements to the biodiversity and soil on their farms. In 2022, the cluster applied for a grant through the Farming in Protected Landscapes (FiPL) programme to address this need. "
        },
        {
            "text": "Their project aimed to carry out a series of baseline habitat and soil health surveys over the course of two years and then to share their knowledge with others on Dartmoor."
        },
        {
            "text": "Their proposal included other elements, such as website development, first aid courses, educational farm walks, volunteer days and the installation of 256 bird boxes across their land holdings. "
        },
        {
            "text": "After working with the cluster to obtain additional information, the project was approved by our Local Assessment Panel at the end of 2022. "
        },
        {
            "heading": 2,
            "text": "Progress"
        },
        {
            "text": "The Cluster received around £22,000 for their FiPL project. In the first year, they began measuring and improving soil health across their land holdings. By purchasing a soil aerator, a soil auger/corer tool, and a soil compaction testing tool to share between them, the cluster were able to learn about and improve the condition of their soils, and particularly the amount of carbon sequestered."
        },
        {
            "text": "Prior to applying to FIPL, the group had a series of soil surveys undertaken in their hay and silage cutting fields, which identified that many were suffering from soil compaction from the use of heavy machinery. This had impacted soil health, plant growth, water absorption and retention. "
        },
        {
            "text": "Using an aerator in these fields will not only resolve this issue but worked well with the cluster’s plans to move towards no-till planting of herbal leys, as a way of both reducing damage to the structure and biodiversity of the soil and carbon loss during reseeding. "
        },
        {
            "text": "Since being awarded a FiPL grant, cluster members have been able to analyse 50 soil samples in terms of their soil organic matter, bulk density, nutrients, and pH. This has provided a baseline assessment of current soil condition across the whole cluster that will be used to guide future management. "
        },
        {
            "text": "The cluster developed, coordinated and shared each farm’s Natural Capital Plan, along with baseline surveys. These plans identified existing high-quality natural habitats (Rhôs pasture, woodland, hedgerows, heath, enclosed moorland, grasslands, streams and ponds), alongside opportunities to enhance or expand them. "
        },
        {
            "heading": 2,
            "text": "Wider impact "
        },
        {
            "text": "In addition to their joint FiPL project, and having identified areas for action in their natural capital plans, many members of the cluster have been inspired to apply to FiPL for projects on their own farms:  "
        },
        {
            "text": "The impact this project will have on Dartmoor is demonstrated by what the cluster have been able to achieve beyond their initial FiPL application. Their track record of collaborating to deliver environmental benefits, and their preparation of Natural Capital Plans were key in the cluster’s ability to successfully apply for the Landscape Recovery Scheme.  "
        },
        {
            "text": "As the lead organisation working with many other farmers, the Duchy of Cornwall, and a number of supportive partners, the Central Dartmoor Landscape Recovery project plans to have a positive impact across at least 90 square miles covering over 25% of Dartmoor National Park. "
        },
        {
            "text": "As Mark Owen, Secretary of the cluster said: “The flexibility of FiPL makes it a fantastic scheme. Asking a land manager to justify how their project proposal can help deliver both local and national priorities and demonstrate that it offers value for public money, allows for innovation and bespoke solutions to the differing challenges and opportunities on every holding."
        },
        {
            "text": "Having a relatively simple application and claim process along with ongoing advice and support available from our local team has been really helpful, and this is illustrated by the quality and variety of projects which are being delivered on Dartmoor.\""
        },
        {
            "text": "I'll add links to learn more are in the box below."
        }
    ]
}