{
    "url": "https://teaching.blog.gov.uk/2024/04/17/offering-wraparound-childcare-at-our-schools/",
    "title": "Offering wraparound childcare at our schools",
    "authors": [
        "Lyndsy Killip"
    ],
    "categories": [
        "Uncategorized"
    ],
    "pub_date": "2024-04-17T15:42:30+01:00",
    "content": [
        {
            "text": "Executive Deputy Headteacher, Lyndsy Killip, at Queen’s Park Federation tells us about their experience of being an early adopter of wraparound childcare and the benefits wraparound has brought to their school community."
        },
        {
            "text": "The Queen’s Park Federation Community"
        },
        {
            "text": "Queen’s Park Federation comprises of Dorothy Gardner and Mary Paterson Nursery Schools, Queen’s Park Primary School, and Queen’s Park Family Hub. Set within one of the most diverse communities in Westminster with high levels of deprivation, we cater for children aged 2-11 within our schools and support children and young people up to the age of 25 through our family hub."
        },
        {
            "text": "Across our community we’re still seeing the impact of the pandemic and cost of living crisis. We’ve also seen parents struggling to get back into the workplace, particularly as a result of the cost of childcare and the lack of wraparound care available locally."
        },
        {
            "text": "Being an early adopter"
        },
        {
            "text": "The impact of being an early adopter of wraparound childcare - offering both breakfast club and extended club – has meant that we have been able to extend our reach, engaging with more families than ever before."
        },
        {
            "text": "We adapt to the needs of our families, whether through attending an after-school club and then an extended club service, through homework support, or the food we serve."
        },
        {
            "text": "Our families know that there is a reliable service, run by people they are familiar with and trust as part of a school community.  Parents are able to build rapport with our team and see them as not just a wraparound care service, but as an extension of the school day, by providing continuity through the staff that work across our settings."
        },
        {
            "text": "The wraparound childcare offer"
        },
        {
            "text": "Through our wraparound childcare offer, not only do we support some of the most vulnerable children within our community, but we give parents the option to go to work. Having this choice can help them cater for their own family’s needs, whether through earning vital income or supporting their own wellbeing and mental health."
        },
        {
            "text": "We aim to meet the needs of families who currently find childcare unaffordable and want our childcare offer to extend to support their family circumstances."
        },
        {
            "text": "We’ve opened our doors to families, offer a fair and affordable model with staff that our families know and trust. We understand our families and offer flexibility for their needs and offer both long and short-term access dependent on their needs."
        },
        {
            "text": "My tips for other schools:"
        },
        {
            "text": "Support with offering wraparound childcare"
        },
        {
            "text": "Wraparound care is before and after school childcare for primary school aged children in England during term time, such as breakfast clubs and regular afterschool provision that runs until 6pm or later."
        },
        {
            "text": "The wraparound childcare guidance for schools explains the role of schools and academy trusts in supporting parents to access wraparound childcare."
        },
        {
            "text": "Read the guidance."
        },
        {
            "text": " "
        }
    ]
}