{
    "url": "https://mhclgmedia.blog.gov.uk/2024/04/17/our-plan-for-cambridge/",
    "title": "Our plan for Cambridge",
    "authors": [
        "mhclgpress"
    ],
    "categories": [
        "Housing",
        "Levelling Up"
    ],
    "pub_date": "2024-04-17T10:06:55+01:00",
    "content": [
        {
            "text": "There remains much interest in our plan to unleash the economic potential of Cambridge, by building new homes and increasing the amount of lab space."
        },
        {
            "text": "Cambridge is a key part of our long-term plan for housing and we believe the city’s global leadership in life sciences and tech is a huge national asset."
        },
        {
            "text": "We do not underestimate the challenge in Cambridge, but we are making good progress and have already set up a Cambridge Delivery Group to spearhead this work, headed by the Chair of Homes England Peter Freeman, who is working with local leaders and communities to deliver on our vision."
        },
        {
            "text": "The Spring Budget marked another important step forward in our plan for Cambridge, confirming that the future Development Corporation will receive a long-term funding settlement at the next Spending Review. This will allow us to deliver on our plans and grow the economy."
        },
        {
            "text": "At the Spring Budget and through our Case for Cambridge we also announced £10.2m investment to support the development of the Cambridge Biomedical Campus, £7.2m of which will improve transport infrastructure and £3m will support the growth plans of the Cambridge University NHS Trust."
        },
        {
            "text": "We recognise the need to address the water constraint issues in Cambridge and the Delivery Group is working closely with the Environment Agency, Ofwat and local government to provide sustainable water supplies.  Alongside this work, we have published a policy paper setting out how we are addressing water scarcity and we are on track to deliver a set of water saving measures which could unlock more than 9,000 homes in the Cambridge area."
        },
        {
            "text": "In the long-term, two proposed schemes – the transfer of water into the Cambridge Water area from Grafham Water and the new reservoir in the Fens, are crucial to our plans and will help reaffirm and reinforce Cambridge’s position as an intellectual centre of the world."
        },
        {
            "text": "Falling back in love with the future: Secretary of State’s speech – 19 December 2023"
        },
        {
            "text": "Long-term plan for housing: Secretary of State's speech – 24 July 2023"
        }
    ]
}