{
    "url": "https://defrafarming.blog.gov.uk/2024/08/20/agri-environment-schemes-work-natural-englands-latest-findings/",
    "title": "Agri-environment schemes work: Natural England’s latest findings",
    "authors": [
        "Usha Waygood"
    ],
    "categories": [
        "environmental land management schemes",
        "Farming and Countryside Programme"
    ],
    "pub_date": "2024-08-20T14:24:54+01:00",
    "content": [
        {
            "text": "This month, Natural England published its annual report summarising projects from the Agri-Environment Scheme Monitoring & Evaluation Programme. The programme is one of the ways through which evidence of the effectiveness and impact of agri-environment schemes is gathered and delivered. Not only do the programme’s findings inform policy development and scheme design, but they also help us to monitor our contribution to government targets. In this guest post, Natural England’s Usha Waygood, Senior Officer in the Evidence Directorate, highlights some of the team’s findings from the report."
        },
        {
            "text": "Defra’s agri-environment schemes include both the existing Environmental Stewardship, Countryside Stewardship, and the newer Sustainable Farming Incentive (SFI) and Landscape Recovery. "
        },
        {
            "text": "On 7 August, we published the Agri-Environment Evidence Annual Report 2023.  "
        },
        {
            "text": "The report summarises the findings of 7 peer-reviewed research projects completed during 2022 and 2023.  "
        },
        {
            "text": "The projects, with specific links available in the document, were:"
        },
        {
            "text": "In this post, I’ll shine a light on the findings of 3 projects. If you have a question about the report, you can ask it in the comments section at the bottom of the post. "
        },
        {
            "heading": 2,
            "text": "Biodiversity at landscape-scale "
        },
        {
            "heading": 3,
            "text": "Aim: "
        },
        {
            "text": "The landscape-scale monitoring study looked to gather valuable insights into the impact of different levels of agri-environmental scheme management on species diversity and abundance. "
        },
        {
            "text": "The study examined the impact of scheme management at local and landscape scales on “mobile” species including butterflies, moths, bees, hoverflies, birds and bats. "
        },
        {
            "heading": 3,
            "text": "What we learned: "
        },
        {
            "text": "Findings revealed that higher scheme uptake was associated with greater species richness, diversity and/or abundance among butterflies, moths and 2 bat species.  "
        },
        {
            "text": "The study also found evidence that the abundance or species richness of larger and more mobile butterflies, moths and hoverflies was associated with scheme uptake at landscape-scale."
        },
        {
            "text": " This indicates that landscapes with high levels of scheme intervention may support more of these species. "
        },
        {
            "text": "The results of this research are from an analysis of baseline data. This means we focus only on the spatial responses of species to current scheme interventions. "
        },
        {
            "text": "A re-survey of this baseline is in development, which will demonstrate the extent to which scheme interventions benefit species and increase their abundance over time. "
        },
        {
            "heading": 2,
            "text": "Benefits of maintaining our historic environment "
        },
        {
            "heading": 3,
            "text": "Aim: "
        },
        {
            "text": "We wanted to understand the effectiveness and cultural value of Countryside Stewardship options to maintain traditional farm buildings. "
        },
        {
            "heading": 3,
            "text": "What we learned: "
        },
        {
            "text": "The findings showed that these options are popular among land managers and effective and successful at delivering desired social, environmental and economic outcomes, namely:  "
        },
        {
            "text": "Social"
        },
        {
            "text": "Surveys showed that the traditional farm building stock was both highly visible and accessible to the public. This enables public engagement with the historic and natural environment. By keeping traditional farm buildings in agricultural use, the options help to affirm agreement holders’ farming identity.  "
        },
        {
            "text": "Environmental"
        },
        {
            "text": "The options conserve and enhance the local landscape character, distinctiveness and historic functions. They can also benefit species by providing and improving habitats for roosting and nesting opportunities for wildlife.  "
        },
        {
            "text": "Economic"
        },
        {
            "text": "The options support the local economy through conservation of local craft skills and of suitably experienced local workers, and by helping to keep the buildings in farm use."
        },
        {
            "heading": 2,
            "text": "Meeting nature recovery ambitions through collaboration "
        },
        {
            "text": "Since 2015, the Countryside Stewardship Facilitation Fund (CSFF) has provided funding at the landscape scale for individuals or organisations to bring farmers, foresters, and other land managers together to increase their knowledge and awareness, and align delivery with the environmental priorities for the local area. "
        },
        {
            "text": "The aim is to increase the positive impact on the environment by expanding the area under environmental land management."
        },
        {
            "heading": 3,
            "text": "Aim: "
        },
        {
            "text": "In this study we looked to establish how successful CSFF groups are at bringing about environmental improvements. "
        },
        {
            "heading": 3,
            "text": "What we learned: "
        },
        {
            "text": "CSFF groups are helping and supporting their members. Of those surveyed, 80% considered their membership of a CSFF group to be useful or very useful to them, mainly citing access to advice and support as the main reason for this.  "
        },
        {
            "text": "Almost 72% of the total area of CSFF groups under scheme agreement covered priority habitats. "
        },
        {
            "text": "This suggests that the targeting of options within CSFF groups helps increase the active management of priority habitat, maintaining and enhancing its extent and condition.  "
        },
        {
            "text": "More widely, CSFF groups play an important role in protecting habitats nationally. "
        },
        {
            "text": "At the time of the study in 2020, CSFF groups covered more than 10% of priority habitat within England. There has been a significant increase in coverage to date. A further 100 groups have since been created. "
        },
        {
            "text": "The results of this study will help inform our understanding of the issues concerning collaboration and partnership for landscape-scale initiatives aimed at nature recovery such as the Landscape Recovery scheme. "
        },
        {
            "text": "A case study presented in a previous Natural England blog post also highlights the many positive outcomes that local collaborations can bring for nature, farmers and the community. "
        },
        {
            "heading": 2,
            "text": "A note of thanks "
        },
        {
            "text": "The team would like to thank all farmers and land managers who supported our monitoring and evaluation work by giving us permission to access their land for field surveys and responding to agreement holder surveys. This collaboration is crucial to help us deliver meaningful evidence. "
        },
        {
            "text": "Thanks also go to the specialists who helped to guide the projects.  "
        },
        {
            "text": "Keep an eye on the Natural England blog for a post about our recent findings on the historic environment.  "
        },
        {
            "text": "Natural England has been responsible for delivering the Agri-Environment Scheme Monitoring and Evaluation Programme on behalf of Defra since 2011. We work closely with the wider environmental land management team in Defra, as well as the Forestry Commission, Environment Agency and Historic England. If you have any questions about the team or our monitoring and evaluation work, please leave a comment below."
        }
    ]
}