{
    "url": "https://naturalengland.blog.gov.uk/2024/08/20/thriving-together-nature-and-community/",
    "title": "Thriving Together: Nature and Community",
    "authors": [
        "Natural England"
    ],
    "categories": [
        "Biodiversity",
        "Coast and access",
        "Connecting People with Nature",
        "Education",
        "Mental health and wellbeing",
        "National Nature Reserve",
        "Natural England",
        "Nature Recovery",
        "Parks, trails and nature reserves",
        "Protected sites and species",
        "Uncategorized",
        "Wildlife"
    ],
    "pub_date": "2024-08-20T10:54:19+01:00",
    "content": [
        {
            "text": "Image: Natural England"
        },
        {
            "text": "At the edge of Barrow-in-Furness, on the north-west coast of England, lies the island of Walney. A wild and windy landscape, it features some nationally rare and important habitats. It is linked to the much larger Morecambe Bay, which has the biggest expanse of intertidal mudflats and sandflats in the UK, and is a key area for many projects in the region."
        },
        {
            "text": "The northern side of Walney Island is home to North Walney National Nature Reserve (NNR). It runs to Earnse Bay, and then to Cumbria Wildlife Trust’s South Walney Nature Reserve at the southern tip of the island. Habitats on the island include sand dunes, dune heath, intertidal mud flats and salt marsh, which attract countless significant species to the area; North Walney NNR is considered one of the best coastal nature reserves in the country, retaining a real sense of wilderness in what is largely an industrial local landscape."
        },
        {
            "text": "The island is an important nesting area, and resting spot, for many key bird species. From wildfowl to waders, many birds use the island each year. It is also home to the nationally endangered natterjack toad, which thrives on the island’s wild terrain, as well as a grey seal colony and the world’s only population of the Walney Island geranium, Geranium sanguineum var. striatum. Alongside this, a large community of people live and work across the surrounding region. Whilst many of them earn good salaries within the nearby shipyard, one in five residents of the Barrow-in-Furness area lives in poverty, with limited interaction with the natural environment. It is this lack of connection that we have sought to overcome, to build a deeper bond between the community and their natural heritage."
        },
        {
            "text": "Overcoming barriers to nature is one of Natural England’s priorities. We aim to tackle barriers to people’s enjoyment, engagement and connection to the natural world, in line with Government priorities, as set out in the Environmental Improvement Plan. Building our understanding of how and why people face challenges in accessing nature is allowing us to devise projects with local partners to work with communities facing the greatest environmental deprivation, creating more access for all."
        },
        {
            "text": "In Barrow-in-Furness, we are collaborating with Cumbria Wildlife Trust, Westmorland and Furness Council, and Art Gene on an initiative known as the ‘Earnse Project’. The project has been granted initial funding from National Lottery Heritage Fund to develop a 5-year project with the community. The project will help people increase their own feeling of nature connectedness through ‘pathways to nature’ - activities that engage senses, emotions, appreciation of beauty, and that create personal meaning."
        },
        {
            "text": "Named after the beautiful sand and shingle found at Earnse Bay, The Environment & Arts Resource for Neighbourhood, for Schools, for Everyone, (Earnse), was launched in 2023, and comes to life with a one-year development phase grant from the National Lottery Heritage Fund. This development phase is focusing on a longer-term project with local communities, listening to their ideas and co-curating the activities that will ignite their passion for the natural wonders at Earnse Bay. This project includes elements of Brilliant Barrow, an ambitious programme whose aim is to ensure that Barrow-in-Furness thrives as ‘a great place to live, work and visit now and into the future’. Under this programme, Westmorland and Furness Council is finalising plans for a community space on Walney Island, part of the Earnse Project. We have been supported further through Defra Capital funding to create a new NNR base, volunteer workshop and beach school, in partnership with the council and Brilliant Barrow programme."
        },
        {
            "text": "We aim to provide a platform for everyone to explore the wonders of nature on their doorstep. By hosting and promoting a variety of engagement activities, including art-based workshops and volunteering programmes, it is hoped that the community can connect with their local habitat around Morecambe Bay, and with the creatures that have made this stretch of coastline their home."
        },
        {
            "text": "Earnse Bay will be one of four sites developed within the Brilliant Barrow Community Hubs project. Other key locations include Ormsgill, Barrow Island, and Barrow Town Centre."
        },
        {
            "text": "Through the Earnse Bay project, we aim to deliver long-term benefits for the health and wellbeing of the communities of Barrow-in-Furness, as well as sustainability through better connectedness with nature. We want it to be home to a healthy population that can deliver a prosperous, inclusive and fair future. In turn, we will see nature thrive; flourishing together with the community that embraces and celebrates it fully."
        },
        {
            "text": "More information & contact: "
        },
        {
            "text": "The success of this project hinges on the active participation of the community it serves. We invite everyone to share ideas and suggestions, telling us what activities would inspire you and your family to visit Earnse Bay."
        },
        {
            "text": "EarnseHub@naturalengland.org.uk"
        },
        {
            "text": "For more info about the Brilliant Barrow Project, follow the below link:"
        },
        {
            "text": "Brilliant Barrow – The Future of Barrow is Bright"
        },
        {
            "text": "If you would like to receive an e-newsletter about the Earnse Project, please register your interest using the sign up form"
        },
        {
            "text": "You can also stay up to date with the latest from our local social media channel:"
        },
        {
            "text": "Twitter: @NECumbria"
        },
        {
            "text": " "
        }
    ]
}