{
    "url": "https://socialworkwithadults.blog.gov.uk/2025/06/05/championing-unpaid-carers/",
    "title": "Championing unpaid carers",
    "authors": [
        "Beverley Tarka",
        "Sarah McClinton"
    ],
    "categories": [
        "Care and support",
        "Recognition"
    ],
    "pub_date": "2025-06-05T12:13:22+00:00",
    "content": [
        {
            "heading": 3,
            "text": "Introduction from Sarah McClinton, Chief Social Worker for Adults"
        },
        {
            "text": "According to the 2021 Census, almost one in ten people in England provide unpaid care, equal to 4.7 million people caring for a loved one. As Social Workers and as system leaders, celebrating, supporting and championing unpaid carers is our day job. Beverley Tarka shares her experience…"
        },
        {
            "heading": 2,
            "text": "My experience by Beverley Tarka"
        },
        {
            "text": "Many of you will be familiar with the reflections I shared upon becoming President of the Association of Directors of Adult Social Services (ADASS), particularly about my mother’s lifelong role as an informal carer. She devoted herself to caring for my brother David, who has a learning disability, often putting her own health and wellbeing second to her love and commitment. Her experience deeply influenced my decision to pursue a career in social care."
        },
        {
            "text": "My mother is one of over five million unpaid carers in the UK who give so much, often without the recognition or support they deserve. As we mark Carers Week, I welcome the opportunity to reflect on the invaluable role of carers and the importance of supporting them."
        },
        {
            "text": "One of the proudest moments in my mother’s life was being nominated for and receiving a Carer of the Year award. That recognition meant the world to her, and it helped affirm the value of her tireless efforts. Her story inspired me to champion the recognition and support of informal carers during my tenure as ADASS President in 2023."
        },
        {
            "heading": 2,
            "text": "Supporting Carers Hub"
        },
        {
            "text": "During that year, we launched the Carers Challenge in partnership with Carers UK, Carers Trust, and Partners in Care and Health. The goal was to encourage individuals and organisations to share stories and showcase the excellent practices making a real difference for unpaid carers. This initiative culminated in the launch of the Supporting Carers Hub at the 2024 Spring Seminar. "
        },
        {
            "text": "Hosted on the ADASS website, the Hub is a central resource for discovering innovative practices, learning from others, and adapting strategies to meet the needs of specific communities. The ADASS Annual Report 2024 describes the Hub as:"
        },
        {
            "text": "The Hub was also included and recommended in the Minister of Social Care’s 2024/25 annual adult social care winter letter."
        },
        {
            "text": "I recently reviewed the progress of the Hub and was heartened to see how far it’s come: it now features more than 40 examples of impactful practice and has received over 7,500 visitors since launch. The breadth of innovation is inspiring."
        },
        {
            "text": "In West Sussex, financial grants are being provided to carers facing hardship, ensuring they receive the support they’re entitled to. In York, there's a project offering personalised, holistic support for carers looking after someone with substance misuse issues. In my own borough of Haringey, councils are working hand-in-hand with carers to co-produce new approaches to support, reflecting the importance of listening to carers’ lived experiences."
        },
        {
            "heading": 2,
            "text": "We can all be champions for unpaid carers"
        },
        {
            "text": "Having recently retired, I feel deeply privileged to have been part of this journey. It has been an honour to contribute to the momentum behind greater recognition and improved support for unpaid carers. Caring touches us all at some point—whether directly or through someone we know."
        },
        {
            "text": "As we observe Carers Week, let us renew our commitment to highlighting the contributions of unpaid carers. But let’s not limit our advocacy to just one week a year. Every day offers an opportunity to recognise, celebrate, and campaign for the support our carers need and deserve. In short, we can all be champions for unpaid carers—our anchors of care."
        }
    ]
}