{
    "url": "https://socialcareinspection.blog.gov.uk/2025/06/05/getting-the-front-door-right-for-children-and-families/",
    "title": "Getting the ‘front door’ right for children and families",
    "authors": [
        "Yvette Stanley"
    ],
    "categories": [
        "children's services",
        "joint inspection",
        "local authorities",
        "multi-agency",
        "partnership working",
        "social care professionals"
    ],
    "pub_date": "2025-06-05T11:00:36+01:00",
    "content": [
        {
            "text": "Back in 2018, we first set out the ingredients of effective multi-agency safeguarding arrangements, using what we had seen working well in our reviews and inspections."
        },
        {
            "text": "Over time, through our inspections, we’ve learned more about what the most effective arrangements look like."
        },
        {
            "text": "Our joint inspections with Care Quality Commission (CQC) and HMI Constabulary and Fire & Rescue Services (HMICFRS) have given us a good insight into what partnerships do best in their response to children in need of help and protection. Some of the components needed for multi-agency practice to flourish include:"
        },
        {
            "text": "In this blog, we’ll go into more detail on some of the components of good practice. We hope this is useful for making improvements and learning."
        },
        {
            "heading": 2,
            "text": "The ‘front door’"
        },
        {
            "text": "We know that the first response to children and families, often known as ‘the front door’, is critical. It should set up the right pathway for the child to get the help they need and to be protected."
        },
        {
            "text": "There is no one model of a front door. Local areas vary how they do it. Many describe it as a multi-agency safeguarding hub (MASH) but even these can vary significantly."
        },
        {
            "text": "There is a lot to celebrate in the areas we’ve inspected so far, and these common components significantly help in getting the front door right."
        },
        {
            "heading": 2,
            "text": "The critical role of leadership in quality improvement"
        },
        {
            "text": "Local safeguarding children’s partnerships (LSCPs) play a critical role in quality assurance and scrutiny."
        },
        {
            "text": "Strategic partners need to have oversight and a line of sight to practice within their own organisations, at the front door. Without this, it’s hard for partners to identify what needs to be done to improve, which means they may not take action where it’s needed."
        },
        {
            "text": "In places where leadership arrangements are working well, the LSCP regularly scrutinises practice. This is often done through carrying out multi-agency audits alongside using quantitative and qualitative information."
        },
        {
            "text": "In effective strategic partnerships, when the partners understand what is happening in practice and make improvements, this leads to better experiences for children and their families."
        },
        {
            "text": "We have seen many good examples in our inspections. Here are a few:"
        },
        {
            "text": "Lewisham"
        },
        {
            "text": "Walsall"
        },
        {
            "text": "Gloucestershire"
        },
        {
            "text": "Being in school is a protective factor and provides a safety net for some children. We saw a good initiative in Blackburn and Darwen where leaders have set up network meetings for designated safeguarding leads in schools:"
        },
        {
            "text": "In Richmond, we also saw good leadership work:"
        },
        {
            "heading": 2,
            "text": "The risks when leadership is less effective"
        },
        {
            "text": "If leaders do not ensure that partner agencies engage with each other as an effective partnership, then:"
        },
        {
            "text": "Leaders are critical to setting the culture around:"
        },
        {
            "text": "Leaders should ensure the quality of scrutiny and supervision across the partnership, particularly around health staff. Without this, it can lead to children not being consistently identified and responded to appropriately."
        },
        {
            "heading": 2,
            "text": "Evolving mental health practice"
        },
        {
            "text": "Across our different inspections, we have seen significant variability in the quality of child and adolescent mental health services (CAHMS) and mental health support for children. However, we have seen some positive examples."
        },
        {
            "text": "Kingston Upon Thames, for example, has integrated CAMHS into its ‘single point of access’. This helps to ensure a proactive response to support children’s mental health. "
        },
        {
            "text": "Another good initiative we saw was a mental health ‘triage car’ in Buckinghamshire, which is:"
        },
        {
            "text": "Unfortunately, we know these examples showing positive work are not always the case nationally. CAMHS and mental health support are often areas that need improving across local areas."
        },
        {
            "heading": 2,
            "text": "Dealing with capacity issues"
        },
        {
            "text": "Having the capacity to respond in a timely and effective way to children at risk remains a challenge. The best areas monitor their capacity closely and, if they can, increase it when needed. As resources are stretched, this is not easy, and may be getting harder. This means that, despite some mitigation, there can be delays in responding to children."
        },
        {
            "text": "We have seen particular problems, including:"
        },
        {
            "text": "All of these can further add to stretched resources at the front door."
        },
        {
            "text": "However, we have seen good practice where partnerships identified increasing demand on the front door and quickly allocated resources that made sure timely decision-making for children could continue."
        },
        {
            "heading": 2,
            "text": "Good information-sharing and communication"
        },
        {
            "text": "Information-sharing and communication are areas that need to improve. This has been the case for some time – it often comes up as a reflection in child safeguarding practice reviews and serious case reviews."
        },
        {
            "text": "Where communication works well, it can make a significant difference to children’s lives. For example, in the Hampshire pilot, we saw that ‘professionals work collaboratively to share information, mitigating risk and ensuring that children receive the right level of help and protection.’"
        },
        {
            "text": "But some multi-agency meetings, such as strategy discussions, do not have the information they need to make the best decisions. And in some local areas, health information is not sought or provided at all."
        },
        {
            "text": "Poor-quality referrals also affect capacity and timely decision-making. Partners do not consistently have a clear understanding of what information they need to make timely and effective decisions."
        },
        {
            "text": "In many areas, local authority support for schools improves information-sharing and communication. This helps children and families access the right help, and helps schools know what services are available. For example, in one area, the education safeguarding team gives training on dealing with emotionally based school avoidance. They also give briefings about extra-familial harm."
        },
        {
            "text": "However, too often, information systems do not consistently support the timely access and sharing of information."
        },
        {
            "heading": 2,
            "text": "Multi-agency training"
        },
        {
            "text": "Multi-agency training to support an effective front door is variable. Where this training is accessible to all, it can enhance identification of harm and professional curiosity."
        },
        {
            "text": "We saw this in Rochdale:"
        },
        {
            "heading": 2,
            "text": "In conclusion"
        },
        {
            "text": "Our unique insight into partnership working across England confirms that those components we first set out 6 years ago remain relevant in dealing with today’s challenges. They are especially relevant as all areas begin to implement the reforms in line with Families First Partnership programme."
        },
        {
            "text": "For further reading on the ‘front door’, the National Police Chiefs' Council (NPCC) has recently published a guiding principles document for local areas."
        },
        {
            "text": "Finally, I would like to note that, through our inspections, we saw a huge number of people doing incredible work, often in very difficult circumstances. Thank you for everything you do."
        },
        {
            "text": "We hope this blog has been helpful."
        }
    ]
}