{
    "url": "https://planninginspectorate.blog.gov.uk/2025/06/05/last-call-join-the-planning-inspectorate-as-a-band-2-or-3-inspector/",
    "title": "Last Call: Join the Planning Inspectorate as a Band 2 or 3 Inspector",
    "authors": [
        "pinscomms"
    ],
    "categories": [
        "Local plans",
        "nationally significant infrastructure projects",
        "Public service",
        "Recruitment"
    ],
    "pub_date": "2025-06-05T12:45:25+01:00",
    "content": [
        {
            "text": "Be an independent decision maker. Planning Inspectors needed to lead on major plans and infrastructure. Apply by 8 June."
        },
        {
            "heading": 3,
            "text": "Embark on a role that makes a difference to the economy, environment and society"
        },
        {
            "text": "Are you a chartered professional looking for a role where you can directly influence sustainable development across England and Wales? The Planning Inspectorate is recruiting for 14 Band 2 and 20 Band 3 Planning Inspectors to help deliver the Government's economic, social, and environmental objectives."
        },
        {
            "heading": 3,
            "text": "What makes this role special?"
        },
        {
            "text": "As current Band 3 Inspector Yvonne Wright shares: \"I came into the organisation ten and a half years ago directly into Band 2 to deal with local plans. I could bring all of my skills from the local plan policy world in local government.\""
        },
        {
            "text": "This is an opportunity to:"
        },
        {
            "heading": 3,
            "text": "You don't need to be a planner!"
        },
        {
            "text": "While many inspectors have planning backgrounds, we welcome professionals from diverse disciplines including:"
        },
        {
            "text": "The essential requirement is chartered membership of a relevant professional body, alongside skills in analysis, decision-making, and communication."
        },
        {
            "heading": 3,
            "text": "What will you do?"
        },
        {
            "text": "You'll examine and make recommendations on:"
        },
        {
            "text": "Band 3 Inspectors additionally lead panels of fellow inspectors and provide mentoring support."
        },
        {
            "heading": 3,
            "text": "Support and development"
        },
        {
            "text": "You won't be thrown in at the deep end. The Inspectorate offers:"
        },
        {
            "heading": 3,
            "text": "Flexible, rewarding work"
        },
        {
            "heading": 3,
            "text": "Application timeline"
        },
        {
            "heading": 3,
            "text": "Ready for a new challenge?"
        },
        {
            "text": "If you're motivated, inquisitive and can confidently manage challenging public events while producing clear, well-reasoned reports to tight deadlines, we want to hear from you."
        },
        {
            "text": "Applications close in just 3 days – don't miss this opportunity to shape England and Wales' sustainable future."
        },
        {
            "text": "Apply now through Civil Service Jobs before 11:55pm on Sunday 8th June 2025."
        },
        {
            "text": "See our recording of a recent Q&A session where you can find out more about the roles."
        }
    ]
}