{
    "url": "https://publicpolicydesign.blog.gov.uk/2025/06/05/the-case-for-designing-democracy/",
    "title": "The case for designing democracy",
    "authors": [
        "Michael Saward"
    ],
    "categories": [
        "PublicPolicyDesign",
        "Research"
    ],
    "pub_date": "2025-06-05T09:30:00+01:00",
    "content": [
        {
            "text": "‘Design for policy’ and ‘policy design’ are key concepts among civil servants, academics and others engaged in the issues and practices featured in this blog. My question is: why not design for polity, with ‘ty’ at the end, as well as design for policy, with ‘cy’?"
        },
        {
            "text": "By design for polity, I mean design of the formal political system: design for processes and organisations of democratic governance itself – such as government departments and agencies and parliamentary bodies, and the links between them. As opposed to the design of specific policies within, and which largely take as given, the existing institutions of democratic government."
        },
        {
            "heading": 2,
            "text": "Democracy designs do not have to be radical"
        },
        {
            "text": "‘Design of democracy’ and ‘polity design’ may sound like unfeasibly grand enterprises. But design of polity need not be seen as radical. It does not have to be whole-system design but can be part-system and single-institution design. Think of reconfiguring government departments in ministerial reshuffles, or the devolution and House of Lords reform proposals in the Gordon Brown-led Commission on the future of the UK, published in 2022, or further plans for Lords reform proposed by the Starmer government. The polity/policy distinction (blurred as it is) does not imply further distinctions (big/small, macro/micro, system/people, or important/less important, for example). The tools in my ‘democratic design framework’ can be used to think about design of small town council governance, or reconfiguring a government department or agency, as much as restructuring governance at the national level."
        },
        {
            "heading": 2,
            "text": "Policy design helps people participate in democracy"
        },
        {
            "text": "Policy design involves close and imaginative engagement with ideas of democracy, framed for example in terms of co-production, participatory design or citizen engagement in defining problems and devising solutions. Notable design thinkers and practitioners are more explicit in invoking ‘democracy’. When they do, arguably they embrace the work of design for polity, as well as for policy. However, they often frame the state or national government as suspicious, remote, perhaps even undemocratic. Design practice embracing local communities is valued, while indirect or representative relations are suspect. The focus is on democracy as local, community based, about ordinary people, working with design professionals, acting together to create new public things and public spaces. Ezio Manzini’s emphasis on democratisation as action in ‘small local open communities’ is one example; Carl DiSalvo’s similar emphasis on local action is another. In Alistair Fuad-Like’s terms, ‘taking micro-steps locally with people’ is design’s democratic task."
        },
        {
            "text": "To this trend, I would say… Yes to democracy as action and engaging ordinary people and their concerns at the scale of the local community. But I question whether that focus should prevent designers paying attention to how democracy is (or could be) structured larger scales such as that of national government. Design thinking about democracy need not be restricted to the local scale."
        },
        {
            "heading": 2,
            "text": "Democracy itself can benefit from design too"
        },
        {
            "text": "The reasons that design thinking and practice is often highly valued – openness to people and ideas, participation and shared inquiry, pooling knowledge, imagination, creating innovative solutions - can be elements of polity or government, at large as well as smaller scales. Democracy – including a democratic polity - can also be a product of design. It is, already, designed, and can be redesigned."
        },
        {
            "text": "So, democracy plus design is not a matter of either-or: either local or nation-state; either process or product. It can be ‘both-and’: both participative and representative, local and supra-local, process and product. And small scale does not match exclusively with face-to-face participatory design. Designers can work with participatory design at the larger, national scale – Citizens Assemblies’ crucial role in Ireland’s recent dealing with constitutional issues such as abortion may be an example. That said, design work on institutions or procedures for the democratic polity does not need to be conducted wholly democratically. Designing for democracy (the ‘product’), and designing democratically (the ‘process’), are different things that may or may not be pursued together. By the same token, expertise and representation are not anti-democratic and can be compatible with participatory or co-design."
        },
        {
            "text": "A turn to design and the democratic polity could take different forms. Some of these are expressed, for example, in Margolin and Manzini’s 2017 call to ‘the design community’:"
        },
        {
            "text": "Policy design, as it is most familiar in government today, is perhaps most clear a part of design in democracy.  I am advocating an opening to design of democracy."
        }
    ]
}