{
    "url": "https://charitycommission.blog.gov.uk/2025/06/05/towards-the-new-sorp/",
    "title": "Towards the new SORP",
    "authors": [
        "Joint Chairs of the Charities SORP Committee"
    ],
    "categories": [
        "Consultation"
    ],
    "pub_date": "2025-06-05T14:44:13+01:00",
    "content": [
        {
            "text": "We would like to thank everyone who has contributed to the SORP consultation process so far. We have received nearly 60 responses to date on the Exposure Draft Charities SORP and want to encourage anyone who has not already done so to engage with the consultation."
        },
        {
            "text": "We are encouraged by comments shared at in person and online events as well as in sector media. Our consultation aims to:"
        },
        {
            "text": "All the documents and details of how to contribute views can be found at www.charitysorp.org. The deadline is noon on Friday 20 June."
        },
        {
            "text": "The breadth of charities that prepare accounts in line with the SORP is considerable, from very small to household names. The SORP must balance what it asks charities to report with meeting accounting standards and stakeholder expectations, which is tricky to get right."
        },
        {
            "text": "In drafting the next SORP, there are new requirements that originate from accounting standards that we cannot change – the main ones relate to leases and income that charities receive under contracts with customers. Our focus in the SORP is on clearly explaining and illustrating those requirements to ensure those preparing charity accounts understand what they need to do. "
        },
        {
            "text": "Separately, we are proposing changes to the content of the Trustees’ Annual Report to support charities in meeting the changing needs and expectations of their stakeholders, to show that they are forward thinking and conscious of the changing environment they operate within. Charities should have much of this information at their disposal, so it should be straightforward to gather, and including it supports transparency about how the charity is operating."
        },
        {
            "text": "Fundamentally, good financial reporting positively contributes to the trust and confidence in charities. All views on how well the SORP supports this are important to help us make further improvements before finalising the SORP and publishing it in the autumn. Please take this opportunity to share your opinions and suggestions with us – every single one is valued and appreciated."
        },
        {
            "text": "The Joint Chairs of the Charities SORP Committee:"
        }
    ]
}