{
    "url": "https://insolvencyservice.blog.gov.uk/2022/07/21/a-very-victorian-scam-the-story-of-ernest-terah-hooley/",
    "title": "A very Victorian scam: the story of Ernest Terah Hooley",
    "authors": [
        "Jason Pawlin"
    ],
    "categories": [
        "Fraud",
        "Scams"
    ],
    "pub_date": "2022-07-21T11:41:49+00:00",
    "content": [
        {
            "text": "At one point, towards the end of the 19th century, Ernest Terah Hooley appeared to have it all: influence, fame, property and lots of money. Lots and lots of money. Hooley had a knack of buying a company and reselling it back to the public for more than it was worth. But the deceit would catch up with him eventually."
        },
        {
            "text": "Born in Nottinghamshire in 1859, young Hooley worked with his father in his lace-making business. Before his 30th birthday, Hooley had purchased Risley Hall in nearby Derbyshire and set about establishing himself as a stockbroker in Nottingham."
        },
        {
            "heading": 2,
            "text": "The boom in bicycles and the money pours in"
        },
        {
            "text": "Seeing an opportunity to further his career as a company promoter in London, he moved his business there in 1896, just as the boom in the bicycle industry was reaching its peak."
        },
        {
            "text": "He famously purchased the Dunlop Pneumatic Tyre Company for £3million, a company the owners themselves had valued at £2.5million, but floated it for £5million. Other now-famous companies went through his hands such as Schweppes, Raleigh and Bovril."
        },
        {
            "text": "Hooley was passionate and relentless about his work, had a great sense of humour, and seemingly had a terrific track-record of successful company promotion. Investors were seemingly eager to be associated with such a success story, without really looking into where their money was going."
        },
        {
            "text": "He also spent a fortune in sweeteners to newspaper editors and journalists to talk up a company he was about to float. He filled boards of directors with people of influence and members of aristocracy."
        },
        {
            "heading": 2,
            "text": "The Siberian Goldfield Development Company"
        },
        {
            "text": "One of Hooley's companies that again brought him to the attention of the courts was a company looking after some mining interests overseas."
        },
        {
            "text": "The Siberian Goldfield Development Company saw Hooley and his partner H.J.Lawson charged with fraudulent share promotion in 1904. Lawson spent the next months in jail, while Hooley was spared jail time after being acquitted."
        },
        {
            "text": "Failing to produce adequate company accounts and statements to his then trustee, a Mr. Basden, he was charged with contempt of court for hiding his company affairs for 5 years. He spent a month in Brixton jail after being found guilty."
        },
        {
            "text": "He then spent another 12 months in jail for obtaining money under false pretences in a land deal and was again made bankrupt."
        },
        {
            "heading": 2,
            "text": "The fraudulent promotion of Jubilee Cotton Mills Limited"
        },
        {
            "text": "Trading in shares in the cotton industry after the war, Hooley was found guilty of fraudulently misrepresenting the shares in Jubilee Cotton Mills Limited. In fact, not only did the shares not actually exist, neither did the mill."
        },
        {
            "text": "Court papers reveal the company itself was not yet registered. To hide the fact there was no money in the company, Hooley had a colleague take out an option on the company's profits for £10,000, which was then promptly placed on the balance sheet as credit."
        },
        {
            "text": "The Pall Mall Gazette was quick to cast further judgment on Hooley, saying in its 10 April 1922 edition:"
        },
        {
            "heading": 2,
            "text": "Reporting misconduct by companies, directors and bankrupts"
        },
        {
            "text": "There was less protection for investors during Hooley's first famous bankruptcy, and far fewer powers to restrict his business dealings as an undischarged bankrupt."
        },
        {
            "text": "Today, however, the Insolvency Service has various powers to consider misconduct and tackle those who abuse their creditors or customers."
        },
        {
            "text": "We can carry out confidential enquiries into solvent companies where we have received complaints and we can look into the conduct of company directors where there has been an insolvency or dissolution process. We can also look into the affairs of someone subject to bankruptcy or a debt relief orders and impose further restrictions to protect future creditors."
        },
        {
            "text": "As for Ernest Hooley, his story was not quite finished with his fraud conviction. He was made bankrupt a fourth time in 1939 for failing to pay the Inland Revenue income tax to the value of around £700. In his later years he was a property developer, and died aged 88 in 1947."
        }
    ]
}