{
    "url": "https://forestrycommission.blog.gov.uk/2022/07/21/addressing-the-possible-shortfall-of-oak-for-the-2022-23-planting-season/",
    "title": "Addressing the possible shortfall of oak for the 2022/23 planting season",
    "authors": [
        "David Bole"
    ],
    "categories": [
        "Tree Planting",
        "Woodland creation"
    ],
    "pub_date": "2022-07-21T09:00:56+01:00",
    "content": [
        {
            "text": "Oak has a special place in our culture in Britain and is often the first species of choice when creating native woodland. It has many benefits. It is a strong competitor against weeds, supports a wealth of native invertebrates and, looked after well can produce highly valuable timber."
        },
        {
            "text": "This coming planting season we are facing the possibility of insufficient supply from nurseries to meet demand for our two native species of oak - Pedunculate (Quercus robur) and Sessile (Quercus petraea). Nurseries report that the situation for Quercus robur is the worst affected."
        },
        {
            "text": "As a result, land managers may need to approach planting  projects creatively this season, assessing availability of oak and considering the possibility of a more diverse planting scheme."
        },
        {
            "text": "Whilst this news is disappointing, it does gives project managers a chance to think differently about species choice. This could result in greater diversity in new woodlands as people select alternative replacement species to oak   These diverse woodlands can be more resilient to current and future threats if the species are site-adapted and, in turn, can deliver positive benefits for both wildlife and people."
        },
        {
            "heading": 3,
            "text": "Why is there less oak available this year? "
        },
        {
            "text": "Oak trees and several other native species produce seed in natural cycles with bumper crops some years and nothing in others. These years of plenty are called ‘mast years.’ The process is not well understood but has been linked to various causes over the years, primarily weather and climatic conditions."
        },
        {
            "text": "Unusually, this natural cycle coordinated over wide areas of Europe, perhaps due to a very wet spring last year (2021). This means a particularly poor supply of seed across much of Western Europe. Despite pulling out all the stops, nurseries have been unable to source all that they need."
        },
        {
            "text": "Why can’t we store oak seed for these poor years? Well, to be doubly awkward, storing oak seed is difficult and results in very poor germination rates, meaning that currently there is very little we can do to prevent years when supply is a problem."
        },
        {
            "heading": 3,
            "text": "The value of a diverse planting mix"
        },
        {
            "text": "The current circumstances create an opportunity for land managers to pause and re-consider the most suitable tree species, perhaps moving away from oak as the default."
        },
        {
            "text": "Using a diverse mix of species in planting schemes has clear benefits. In 2018, the UK government published the Tree Health Resilience Strategy in response to the increasing threat of pests and diseases impacting our woodlands. One of the key recommendations is that we should increase the species, genetic, and structural diversity of our woodlands."
        },
        {
            "text": "Where oak is included as a large proportion of the project, reducing this and including other species may mean an overall increase in species diversity.  Such diversity can help our trees and woods survive, adapt to changing environmental conditions and reduce the impact and spread of pests and disease threats."
        },
        {
            "heading": 3,
            "text": "Next steps and support "
        },
        {
            "text": " We expect that as natural cycles progress, supplies will return to more normal levels from next year and the current issue is short-term.  Although supply is down, we hope that people will plan for this and the impact on individual projects and tree planting plans will be minimal."
        },
        {
            "text": "As there is potentially a greater availability of Sessile oak for this planting season, it is anticipated that nurseries may offer this as an alternative in the first instance. It is important that the differences between the two native oaks is understood to select the best species of oak for a site, but this is likely to be a good option in terms of building in climate change resilience.  Speak to your local nursery to find out more."
        },
        {
            "text": "There are many alternative species to oak which can be considered, as well as ways to use the available oak supply carefully. As each site has different requirements, talk to your Woodland Creation Officer/Woodland Officer to get expert local advice and guidance."
        },
        {
            "text": "In addition, the Forestry Commission has a range of free tools to help land managers better understand the suitability of alternative species. The Ecological Site Classification Decision Support System (ESC-DSS) requires the input of soil moisture and nutrient information together with the site location. The software then compares a range of climate factors such as accumulated temperature and exposure. The results are presented on a scale of ecological suitability for the site for each of the main species used in the UK."
        },
        {
            "text": "We also advise that anyone wishing to plant in the season 2022-23 should contact their local nursery to discuss plant supply at the earliest opportunity to see if the required species are available.  Those aiming to plant in 2023-24 should also contact their nursery about their requirements to help them understand the potential future demand."
        },
        {
            "text": "It's important the plants and trees you use are free from pests and diseases. Where possible, get your plants from nurseries with clear plant health management standards in place including, for example, nurseries with Plant Healthy certification or similar."
        },
        {
            "text": " "
        }
    ]
}