{
    "url": "https://actuaries.blog.gov.uk/2022/07/21/bank-of-england-bank-rate/",
    "title": "Bank of England Bank Rate",
    "authors": [
        "Paul Butcher - Actuary"
    ],
    "categories": [
        "Analysis",
        "Finance"
    ],
    "pub_date": "2022-07-21T13:58:12+01:00",
    "content": [
        {
            "text": "The Bank of England’s (BoE) main role is to maintain monetary stability and oversee the work of financial functions in the UK. One way it does this is by setting interest rates."
        },
        {
            "text": "In June, the BoE’s Monetary Policy Committee voted to increase the Bank Rate (also known as the ‘Bank of England base rate’ or ‘interest rate’) by 0.25 percentage points to 1.25%. The Bank Rate determines the interest rate the BoE pay to commercial banks that hold money with them. It therefore influences the rates those banks charge people to borrow money or pay on their savings."
        },
        {
            "text": "The news of this base rate increase comes amid rising inflation. The most recently released statistics show that the annual rate of the Consumer Prices Index (CPI) has now risen to 9.4%. The CPI is the headline measure of inflation and is used by the government to set the BoE inflation target of 2%."
        },
        {
            "heading": 2,
            "text": "Base rate and inflation"
        },
        {
            "text": "As we know with the current cost-of-living increases, inflation means price rises. Inflation is a quantitative measure of the fall in purchasing value of money as the price of goods and services rise. (Read more around this in Inflation, it’s personal a blog by GAD actuary Christophor Ward.)"
        },
        {
            "text": "The BoE is responsible for keeping inflation rates low and stable. The Base Rate is the main tool at the BoE disposal to help control inflation, as increasing the base rate is expected to reduce borrowing and increase saving."
        },
        {
            "text": "These reduce how much people spend overall, which helps to push inflation down. A target set by HM Treasury means the BoE must aim to keep the inflation rate at 2%."
        },
        {
            "text": "If the Bank fails to meet this 2% target by more than 1% either side, the Governor must explain why, to the Chancellor of the Exchequer. This explanation will also need to set out points of action to get back to the ideal 2%."
        },
        {
            "text": "It can be difficult for businesses if the inflation is too high or fluctuates regularly, resulting in people finding it hard to balance spending, saving and investing. On the other hand, if inflation drops too low (or goes negative, which is called deflation), spending can be delayed as people expect prices to fall."
        },
        {
            "text": "If prices fall, then companies may begin to reduce costs, and this can lead to redundancies, as staff costs are usually a big cost for businesses. Falling prices and increased unemployment are often contributing factors to a country entering a recession."
        },
        {
            "heading": 2,
            "text": "Balancing act"
        },
        {
            "text": "The Bank Rate set by the BoE will affect people differently depending on whether you are borrowing or saving money. As an example, if the rate falls future borrowing may get cheaper. On the other hand, when it comes to savings, you may be paid less interest."
        },
        {
            "text": "Lower rates tend to increase the value of wealth, as the value of holding assets increase. For example, lower interest rates could mean that you are willing to pay more for a house, as the interest payments are more affordable."
        },
        {
            "text": "To conclude, for the Bank of England to be able to meet the inflation target set out by the government, it needs to be able to judge how people intend to save and spend, given current interest rates."
        },
        {
            "heading": 2,
            "text": "Recession and rates"
        },
        {
            "text": "In 2008, the financial crisis in America quickly escalated to a global recession. This led to the UK suffering a severe downturn which lasted for just over 18 months."
        },
        {
            "text": "Between 2008 and 2009, thousands of businesses shut down and figures indicate that almost 2 million people in this country alone lost their jobs. The BoE decided to cut interest rates to an extremely low level, to allow critical spending and support jobs."
        },
        {
            "text": "At the beginning of the pandemic in 2020, the BoE reduced the bank rate to 0.1% and in some countries the bank rate went negative (the commercial banks had to pay the central bank to hold their money). This was done to encourage investment and stimulate growth."
        },
        {
            "text": "However, since then supply chain pressures, high fuel prices, labour shortages and global instability have led to the rising prices we see today."
        },
        {
            "heading": 2,
            "text": "Certain uncertainty"
        },
        {
            "text": "As for where next - the next Monetary Policy Committee (MPC) meeting is due in August, which will detail whether there is any change to the Bank Rate. On the same day, the quarterly Monetary Policy Report will also be published. This sets out economic analysis and inflation projections. The MPC uses this analysis in its Bank Rate decision."
        },
        {
            "heading": 3,
            "text": "Disclaimer"
        },
        {
            "text": "The opinions in this blog post are not intended to provide specific advice. For our full disclaimer, please see the About this blog page. "
        }
    ]
}