{
    "url": "https://naturalengland.blog.gov.uk/2022/07/21/bees-needs-why-air-pollution-matters-to-pollinators/",
    "title": "Bees’ Needs: Why Air Pollution matters to Pollinators",
    "authors": [
        "Natural England"
    ],
    "categories": [
        "Biodiversity",
        "Climate change",
        "Natural England",
        "Science and evidence"
    ],
    "pub_date": "2022-07-21T15:44:52+01:00",
    "content": [
        {
            "text": "Bees are undeniably beautiful and fascinating insects, but what many people do not always realise is how vital they are for a healthy environment and healthy economy. The vast majority of our food and wildflowers rely on pollination, which bees facilitate by transferring pollen between flowering plants. However, bee diversity and abundance are in decline. Bees’ Needs Week is a week-long campaign, which runs from 18th – 24th July this year, to help raise awareness of the importance of bees and other pollinators."
        },
        {
            "text": "There are many factors that threaten our pollinating insect species. One such lesser-known threat is air pollution. Until recently, most of our understanding of the environmental impacts of air pollution has focussed upon plants. This year, Natural England’s air pollution specialists had two great PhD placement students who spent three months reviewing the evidence for the effects of air pollution on other species, including pollinators."
        },
        {
            "text": " "
        },
        {
            "text": "Explore the Air Pollution Information System (APIS) to learn more about the different pollutants!"
        },
        {
            "heading": 2,
            "text": "How do these pollutants affect bees and other pollinators?"
        },
        {
            "text": "Changes to behaviour, learning and memory "
        },
        {
            "text": "Several recent studies have found that air pollution changes invertebrate recognition of biogenic Volatile Organic Compounds (VOCs) from plants and flowers. In one study, honeybees exposed to petrol exhaust emissions (primarily NOx) took significantly longer to learn plant VOCs and also forgot them faster than unpolluted ones[i]. Another recent field study found that ozone and NOx at levels below standards set for the protection of sensitive habitats reduced flower visits by pollinators by 83-90%[ii]. Air pollution results in it being more difficult for pollinators such as honeybees to recognise, locate and memorise the location of their floral resources which impacts foraging efficiency and consequently pollination. Particulate pollution can also be an issue for pollinators as the fine hairs on their bodies that become electrically charged to attract pollen can also attract other fine particulates, including dust and heavy metals[iii]."
        },
        {
            "text": "Changes to food quality and abundance"
        },
        {
            "text": "Eutrophication (nutrient enrichment) changes the availability of certain plants as a food source as a result of increased competition and shading from nitrogen-loving plants, or if the food plant itself is adapted to low nutrient conditions. For example, the marsh fritillary (Euphydryas aurinia) butterfly relies upon its nitrogen sensitive host plant devil's-bit scabious (Succisa pratensis) as a food source. In Denmark, fertiliser application and atmospheric nitrogen deposition have caused devils-bit scabious to be outcompeted by faster growing, less sensitive plant species. This decline in host plant abundance has led to the collapse of some marsh fritillary populations[iv]. Plant quality is also affected by pollution, which can alter nectar and pollen sugar as well as amino acid concentrations, which also affect insect populations. Studies have shown increases in dead larvae and workers in colonies of bumblebee (Bombus terrestris) visiting plants enriched with excess nitrogen as well as physical damage from consuming abrasive particles[v]."
        },
        {
            "text": "Changes to larval development "
        },
        {
            "text": "Eutrophication decreases temperatures at the soil surface by increasing plant height and density, preventing the sun’s rays from reaching the soil surface. Several recent studies have shown that this leads to slower growth and development of invertebrate larvae. This can cause misalignment of the timing of larval development and the critical growth stages of their host plant species[vi]. For example, a reduction in numbers and local extinctions of the wall brown butterfly (Lasiommata megera) was caused both by the loss of host plants and by microclimate cooling due to excess nitrogen[vii]."
        },
        {
            "text": "Why does it matter?"
        },
        {
            "text": "Alteration of plant communities and species composition as a result of a mixture of atmospheric concentrations and subsequent deposition of pollutants have resulted in changes to the behaviour of pollinating species as well as population declines. Pollination is a vital ecosystem service that benefits agricultural and horticultural production and therefore a decline in pollinating species could have devastating implications for food security. The beauty of our countryside and gardens would also be severely affected[viii]."
        },
        {
            "text": "Considering the substantial implications of this emerging research for pollinators and ecosystem services, the impact of air pollution on invertebrates requires further study. Impacts to the environment from air pollution are a universal and transboundary, as well as a local issue but are often overlooked as visible damage is difficult to directly attribute to air pollution. It is essential to recognise that the impact of air pollution will act in-combination with other environmental pressures. Pollution effects are also highly dependent on factors such as temperature and precipitation, therefore adverse effects are also likely to increase under predicted climate change[ix]."
        },
        {
            "text": "Natural England’s role"
        },
        {
            "text": "Natural England provides evidence and advice on air pollution and ecosystems to Government, regulators, farmers and land-managers, and other stakeholders – including around implementation of the Clean Air Strategy, 25 Year Environment Plan and agricultural transition.  We are excited to be piloting a ‘Shared Nitrogen Action Plans (SNAP)’ approach, working with local stakeholders to reduce nitrogen deposition affecting selected protected sites and delivering wider benefits. We are also inputting to the design of the new environmental land management schemes and slurry infrastructure grants. This year sees the continued large-scale expansion of our Catchment Sensitive Farming (CSF) advice programme to cover the whole of England, enabling a combined approach to tackling air and water pollution and achieving multiple benefits. Our Nitrogen Futures (Nitrogen Futures) work with Defra and JNCC will help identify other actions necessary to achieve our ambitions for biodiversity. Natural England is involved with developing more streamlined approaches to the assessment of pollution sources (UK AERIUS)."
        },
        {
            "text": "What can you do to help? "
        },
        {
            "text": "Air pollution and the decline in bee abundance are both global, transboundary issues which need to be tackled at a national and international level. However, you can also help by creating a haven for pollinators by letting areas grow wild and planting more flowers in your garden and local community. As an individual, you can also help to reduce emissions of air pollutants by choosing sustainable transport options where possible and choosing to eat food from local and sustainable sources."
        },
        {
            "text": "Discover more about Bees’ Needs Week and how you can support our pollinators here and do leave your comments below."
        },
        {
            "text": " "
        },
        {
            "text": "__________"
        },
        {
            "heading": 5,
            "text": "[i] R. J. Leonard, V. Vergoz, N. Proschogo, C. McArthur, and D. F. Hochuli, “Petrol exhaust pollution impairs honey bee learning and memory,” Oikos, vol. 128, no. 2, pp. 264–273, Jan. 2019, doi: 10.1111/oik.05405."
        },
        {
            "heading": 5,
            "text": "[ii] James M.W. Ryalls, Ben Langford, Neil J. Mullinger, Lisa M. Bromfield, Eiko Nemitz, Christian Pfrang, Robbie D. Girling, Anthropogenic air pollutants reduce insect-mediated pollination services, Environmental Pollution, Volume 297, 2022, 118847, ISSN 0269-7491, https://doi.org/10.1016/j.envpol.2022.118847."
        },
        {
            "heading": 5,
            "text": "[iii] G. Capitani, G. Papa, M. Pellecchia, and I. Negri, “Disentangling multiple PM emission sources in the Po Valley (Italy) using honey bees,” Heliyon, vol. 7, no. 2, p. e06194, Feb. 2021, doi: 10.1016/j.heliyon.2021.e06194."
        },
        {
            "heading": 5,
            "text": "[iv] Brunbjerg, A. K., Hoye, T. T., Eskildsen, A., Nygaard, B., Damgaard, C. F. & Ejrnaes, R. (2017). The collapse of the marsh fritillary (Euphydryas aurinia) populations associated with declining host plant abundance. Biological Conservation. 211, 117-124."
        },
        {
            "heading": 5,
            "text": "[v] Ceulemans, T., Hulsmans, E., Ende, W. V. & Honnay, O. (2017). Nutrient enrichment is associated with altered nectar and pollen chemical composition in Succisa pratensis Moench and increased larval mortality of its pollinator Bombus terrestris L. PLoS One. 12, 10.1371/journal.pone.0175160."
        },
        {
            "heading": 5,
            "text": "[vi] Nijssen, M. E., WallisDeVries, M. F. & Siepel, H. (2017). Pathways for the effects of increased nitrogen deposition on fauna. Biological Conservation. 212, 423-431."
        },
        {
            "heading": 5,
            "text": "[vii] Klop, E., Omon, B. & WallisDeVries, M.F. Impact of nitrogen deposition on larval habitats: the case of the Wall Brown butterfly Lasiommata megera . J Insect Conserv 19, 393–402 (2015). https://doi.org/10.1007/s10841-014-9748-z"
        },
        {
            "heading": 5,
            "text": "[viii] The National Pollinator Strategy: for bees and other pollinators in England (publishing.service.gov.uk)"
        },
        {
            "heading": 5,
            "text": "[ix] E. L. Zvereva and M. V. Kozlov, “Responses of terrestrial arthropods to air pollution: A meta-analysis,” Environ. Sci. Pollut. Res., vol. 17, no. 2, pp. 297–311, 2010, doi: 10.1007/s11356-009-0138-0."
        }
    ]
}