{
    "url": "https://planninginspectorate.blog.gov.uk/2022/07/21/new-registration-journey-trialled-by-two-national-infrastructure-applications-with-more-to-follow/",
    "title": "New registration journey trialled by two national infrastructure applications, with more to follow",
    "authors": [
        "Simone Wilding"
    ],
    "categories": [
        "Applications",
        "Digital",
        "Service improvement"
    ],
    "pub_date": "2022-07-21T11:12:59+01:00",
    "content": [
        {
            "text": "Simone Wilding, Head of Operations and Applications Service owner, outlines the latest work on our new online service for nationally significant infrastructure project (NSIP) applications."
        },
        {
            "text": "If you’re taking part in the examination of the Longfield Solar Farm application then there’s a good chance you used a new registration process. This is the first part of our new service that we recently launched and there’s much more to follow!"
        },
        {
            "text": "The next application to use elements of the new service will be the Drax Bioenergy with Carbon Capture and Storage Project, which has recently been accepted for examination. For the Drax application we have further improved the new Registration Service, building on feedback gathered from using it on the Longfield Solar Farm application. The registration period is due to open on 5 August. Once it has closed we are planning to launch a new document library that provides a new look and feel for displaying the many project documents users need to take part in the examination."
        },
        {
            "heading": 2,
            "text": "Feedback matters to us!"
        },
        {
            "text": "If you use the new elements mentioned above, we would be very interested to hear your feedback via the form linked from the page. This will help us to find out if the service meets your needs and how we can improve it."
        },
        {
            "heading": 3,
            "text": "Applications Service: The backstory"
        },
        {
            "text": "Back in December I blogged about the goals of the project and what our user research revealed. Whilst our Applications Service covers four other casework areas, we are focusing first on applications for national infrastructure to make the experience easier, faster and more cost effective for all users."
        },
        {
            "text": "The existing National Infrastructure Planning site serves as an essential resource in the lifecycle of these nationally important applications, and we want to provide users with an online experience that makes it even easier to:"
        },
        {
            "text": "Over the coming months we will gradually bring out new features, which will be accessible via the existing website. Ultimately we will switch over completely to the new service."
        },
        {
            "text": "Above: Example of relevant representations displayed on new service"
        },
        {
            "text": "Above: Example of project documents displayed on new service "
        }
    ]
}