{
    "url": "https://grantscommunity.blog.gov.uk/2022/03/08/breakthebias-women-succeeding-in-the-civil-service/",
    "title": "#BreakTheBias - women succeeding in the Civil Service",
    "authors": [
        "pennyhornerlong1"
    ],
    "categories": [
        "Government Grants Management Function"
    ],
    "pub_date": "2022-03-08T08:43:10+00:00",
    "content": [
        {
            "text": "It’s International Women’s Day and I’m reflecting - on my work/life balance as a working mother, my career journey and how I can support women to succeed at work."
        },
        {
            "text": "I head up the Government Grants Management Function (GGMF) in the Cabinet Office. I’m proud to be part of and lead a welcoming, inclusive, diverse and high performing team. I want to support colleagues to reach their potential, particularly women, encouraging them to have the confidence to take up new roles or new challenges.  I feel that it is often confidence rather than knowledge or experience that stands in our way as women. We need to give ourselves the permission to succeed, take up opportunities even when they feel a bit scary in the knowledge that we have a community of people behind us rooting for our success."
        },
        {
            "text": "GGMF has three women in senior leadership roles in a policy area usually the preserve of men. We take gender equality very seriously and, as senior leaders, we are in a position to create a positive working culture that supports diversity of thought and innovation. Alongside me, Ivana Gordon heads up our digital transformation teams and Lucia Webster heads up the new online service to help people find and apply for grants. We want to support women of all grades at every stage of their career. "
        },
        {
            "heading": 2,
            "text": "Work/life balance"
        },
        {
            "text": "An essential way to support diversity is to support diverse working patterns that help women who  have caring responsibilities. This includes flexible working (I work part time) and office locations around the UK to attract local talent and reduce travel times (I’m based in London, Ivana is based in York and Lucia in Glasgow). I’m also focusing on wellbeing to ensure the team has support to achieve the work/life balance they aspire to. We run a monthly staff survey to monitor stress levels and then we discuss how we can prioritise workloads as a team."
        },
        {
            "heading": 2,
            "text": "Be heard  "
        },
        {
            "text": "I am actively encouraging my teams to call out bad behaviour that discriminates against people because of their gender. This includes in meetings when someone gets ignored, interrupted or talked over. And I have seen that it is often the women in the group that get this kind of treatment. It can really knock your confidence. "
        },
        {
            "text": "Remind yourself that you have the right to be in the room and that your perspective is just as important as anyone else's. I’ve had many years experience chairing meetings, working with directors across government, having difficult conversations and briefing ministers. Preparation is key. Think about the messages you want to land in advance of the meeting and, if it helps, try them out in a safe space with others. Give yourself the permission to own your views. Don't be apologetic. Take your time and simply call people out if they try to take over. You will be amazed at the impact you can have. "
        },
        {
            "heading": 2,
            "text": "Be flexible "
        },
        {
            "text": "Like me, you may have had a plan and timeline for your career. And then you realise life is more complex. You might want to take time out - for further study (I took a year out for a MBA), raise a family (I have two great kids and took two years out to care for them full-time), care for an elderly parent or travel. "
        },
        {
            "text": "Nothing should stop you striving for a rich and rewarding career. These experiences enhance you and mean you have more to offer. You may, like me, end up taking a different route to achieve your professional ambitions. Understand and own your choices in building a rich and fulfilling career. Don’t drift. Make conscious decisions that support your preferred work/life balance. But stay flexible and keep an open mind. You never know when the next great opportunity will come your way.  "
        },
        {
            "heading": 2,
            "text": "Be bold"
        },
        {
            "text": "It does take courage to change jobs or even decide to move into leadership roles. It can feel risky. But it is possible. I have seen - too often - women are not prepared to step into a new role until they feel they tick all the boxes. This may mean missing out on chances and opportunities. At GGMF we have introduced a mentoring scheme to provide support, so women have a space where they are comfortable to discuss ideas and challenges they face. I have benefited from being mentored by some truly inspiring women, each with very different careers and having made different life choices. They have all helped build my confidence and self belief, provided me with a great sounding board and a safe space to try out new ideas and develop my thinking."
        },
        {
            "heading": 2,
            "text": "Be generous "
        },
        {
            "text": "Be generous with your time. Listen to your colleagues and share your career stories. For me, it's about giving back when you can and remembering your own experiences. I am a mentor and a member of the Cabinet Office Race Board and chair the Cabinet Office staff board. This is my opportunity to ensure women are not overlooked in policy making. "
        },
        {
            "heading": 2,
            "text": "Your experiences"
        },
        {
            "text": "I’m always open to new ideas to improve gender equality in the workplace. I would love to know your stories and how you’ve created a supportive environment for women in the workplace. Or what has helped you personally to progress your career."
        },
        {
            "text": " "
        },
        {
            "text": "Penny Horner-Long"
        },
        {
            "text": "Head of Government Grants Management Function (GGMF)"
        }
    ]
}