{
    "url": "https://nda.blog.gov.uk/breaking-the-bias/",
    "title": "Breaking the bias",
    "authors": [
        "sarahcorlett"
    ],
    "categories": [
        "Safety and Wellbeing",
        "Skills",
        "Uncategorized"
    ],
    "pub_date": "2022-03-08T11:48:47+00:00",
    "content": [
        {
            "text": "My name is Georgina Stalker, but most people call me Gina. I'm 27 years old, and I've been in the nuclear/manufacturing/engineering industry for almost 11 years now."
        },
        {
            "text": "I studied product design at GCSE level and I always knew I wanted to get involved with something that challenged me and made me think of solutions to problems. I accepted a Sellafield Ltd Mechanical Design Apprenticeship at the age of 16."
        },
        {
            "heading": 3,
            "text": "At the beginning"
        },
        {
            "text": "The Sellafield site was a cold, dark, big, old facility -  a working manufacturing facility, I remember when I went on the shop floor for the first time, I was 16 maybe 17 years old and it was daunting."
        },
        {
            "text": "99% of the workforce were male, and the majority were a lot older than I was. I was scared, nervous, anxious, overwhelmed but also excited."
        },
        {
            "text": "I soon learned that to excel in this industry I had to be confident, inquisitive, and positive. I stayed in the design office for 4 years alongside completing my Higher National Certificate and then my Higher National Diploma in mechanical engineering."
        },
        {
            "heading": 3,
            "text": "My journey"
        },
        {
            "text": "In 2015 when a secondment came up in the projects office, I jumped at the chance to become an assistant project engineer, managing the workshops and getting stuck into the ‘real’ manufacturing side of the business."
        },
        {
            "text": "Upon completing my Bachelor of Engineering in Nuclear Operations. I shadowed senior engineers and learnt from them, I asked the ‘silly questions’ and I really did stick in (a lot) to ensure I became the best engineer I could possibly be."
        },
        {
            "text": "I became the sole project engineer overseeing a £30 million project, and senior management knew that I was extremely capable. Not only was I trusted to lead extremely valuable projects, but I was also in charge of managing other engineers; guiding and helping them become the best possible versions of themselves."
        },
        {
            "heading": 3,
            "text": "I'm a girly girl"
        },
        {
            "text": "I am what most would probably stereotype a 'girly girl'. I have long blonde hair, I like to wear makeup and have my eyelashes done, I have extremely long nails that are usually painted in bright colours or wacky patterns and I like to look nice."
        },
        {
            "text": "However, this has probably meant that I have been faced with many challenges, comments and general judging of my professionalism and character throughout my career."
        },
        {
            "text": "I recently wrote a post on LinkedIn which showed 2 pictures of me. One in personal protective equipment on the shop floor at work, and one of me outside of work with my hair and makeup done. I wrote in my post how in both pictures I was still an engineer, and a good one, despite how I may look in either photo."
        },
        {
            "text": "Nothing could have prepared me for the number of interactions that post was about to get – 8,000,000 views worldwide, over 99,000 reactions, over 500 comments, over 5,000 connection requests and thousands of messages. I couldn’t believe it. Now ask yourself, do you think most of the comments were positive or negative?"
        },
        {
            "text": "I could tell you the answer, but I want to leave that thought with you. Ask yourself why would my post that was only ever meant to spread positivity, gender diversity, preconceptions and to inspire ever be meant in a negative connotation?"
        },
        {
            "heading": 3,
            "text": "My next steps"
        },
        {
            "text": "I chose to make the natural progression into project management after 10 years in engineering, I'm now on the project management graduate scheme. Although I'm not your typical graduate, I'm thoroughly enjoying the scheme, it gives me the opportunities and real-life scenarios to learn more about project management before hopefully moving into a full-time role."
        },
        {
            "text": "Sellafield Ltd has lots of networks and forums to get involved in, to stop any of the above transferring into our working life. There is the EDI hub, the BAME network, family support, LGBTQ+ network, physical disabilities support, the list goes on. It is such a warm, positive, and inclusive place to work, and I'm hopeful that I will never have to face any sort of gender equality issues again."
        },
        {
            "heading": 3,
            "text": "Leading the way"
        },
        {
            "text": "I'm a huge advocate now for encouraging girls and women into STEM (science, technology, engineering, maths) careers. I'm a STEM ambassador and have been for several years now. I would be here all day if I was to talk about all the opportunities I've been involved in. Over the years I've attended career fairs, schools, colleges, universities and conferences to talk about myself and my journey in engineering, manufacturing and nuclear."
        },
        {
            "text": "I think when you are young you tend to look up to the people you have around you as role models. You tend to lean towards similar career paths. I'm passionate about inspiring the younger generation particularly, as I think it's important to educate them on STEM subjects early on."
        },
        {
            "text": "Engineering and manufacturing are something which I think isn’t particularly portrayed as a glamorous and exciting job, but it really can be. It’s about changing the perception of what these careers can be or lead to these days."
        },
        {
            "heading": 3,
            "text": "My advice"
        },
        {
            "text": "If I could go back in time and give my younger self some advice, it would be to be confident in my abilities."
        },
        {
            "text": "Although it’s perfectly natural to be shy and anxious in new settings and new surroundings, it's important to still believe in yourself."
        },
        {
            "text": "If you know the answer speak up, don’t allow yourself to be over shadowed. Work hard, work harder than you ever have before to prove people wrong. Certain people will walk past you to ask the person next to you. Work hard to make sure in the coming days, weeks, months or even years, that they walk directly towards you."
        },
        {
            "text": "Most importantly don’t ever change. There were so many times I thought to myself 'maybe I should do my hair differently tomorrow', 'maybe I should cut my nails shorter', 'maybe I shouldn’t wear any make-up tomorrow', but you know what, I wouldn’t have felt comfortable if I did any of those things."
        },
        {
            "text": "Changing those things would have affected my confidence and therefore my ability, and why should I have done that to appease others that chose to judge me from first appearance? If it doesn’t affect your ability to be good at your job, a good person and keep bettering yourself – don’t ever change for anyone but yourself."
        }
    ]
}