{
    "url": "https://forestrycommission.blog.gov.uk/2022/03/08/celebrating-the-women-working-in-the-forestry-commission-georgi-ennis/",
    "title": "Celebrating the women working in the Forestry Commission: Georgi Ennis",
    "authors": [
        "Georgi Ennis"
    ],
    "categories": [
        "International Women's Day",
        "Our Staff"
    ],
    "pub_date": "2022-03-08T07:13:28+00:00",
    "content": [
        {
            "text": "My name is Georgi Ennis and I’m a Woodland Officer covering South Hampshire and Isle of Wight. As a Woodland Officer I am responsible for the delivery of Government Forestry policy through grants, licencing and regulations."
        },
        {
            "text": "I’ve be in the job role for about 9 months, it’s been a steep learning curve as this is my first role not being ‘on the tools’. I completed a Level 3 City and Guilds Diploma in Forestry and Arboriculture AND a Level 3 City and Guilds Extended Diploma in Forestry and Arboriculture when I was in college from 2016 to 2018. Since then, I’ve been working in the Arb industry totalling about 6 years as a climbing arborist."
        },
        {
            "text": "Whilst working as a sub-contractor, I had become more competent with climbing as I worked for many companies with different tools and teams with many years of experience. I’d also branched out into carving which I enjoy as it is creative. I had travelled and worked as a sub-contractor to numerous companies in the UK, Scotland and Sweden as a climber and carver as well as attending the annual Women’s Arb Camp which is held in a different country each year."
        },
        {
            "text": "In September of 2019, I started working at Royal Botanic Gardens, Kew. This has been a lifelong goal of mine as it is world renowned and one of the most diverse and amazing places on the planet. I completed my 1-year placement as Arboricultural Specialist Certificate, climbing and maintaining the living collections."
        },
        {
            "text": "During this time, I was also involved with the four-part documentary series, Kew Gardens: A Year in Bloom, as it takes you behind the scenes of their world-leading horticulture and science; and includes never-before-seen footage. Whilst at Kew, I had the opportunity to present my arboriculture journey to 250 apprentices and answer questions at the end. It was exciting to see how many people hadn’t thought of arb as a job and now wanting to be a part of it."
        },
        {
            "text": "After this, I returned to sub-contracting for about 6 months before seeing a job advertised for this role. As a woodland officer my job role includes site visits in relation to grant applications under the Countryside Stewardship Scheme, Woodland Creation and Tree Health Grants; reviewing woodland management plans; ensuring compliance with UK Forestry Standards, scheme rules and procedures; processing and inspecting felling licences, inspecting restocking notices, inspecting Enforcement notices, and responding to illegal felling reports and operations and much more."
        },
        {
            "text": "This is something completely new to me and has really got different parts of my brain working. I feel like my background on the tools has really helped me when talking to agents and landowners as I’ve been in the position of the ground worker and on the receiving end of felling licences."
        },
        {
            "text": "Back in December 2021, I was invited to give a talk at RBG, Kew for the Kew Mutual Improvement Society aka KMIS. The people that invited me are the first-year Diploma students, to which I found out, many were present as apprentices when I gave my talk a few years ago and wanted me back to do a similar talk! This was a very exciting moment for me as I remember watching KMIS talks when I was at Kew, and never in a million years would I have thought that I would one day stand in the auditorium giving a talk on my career, past and current."
        },
        {
            "text": "As a teenager I had an Instagram account and gained a following as I started to post photos of me as an arborist. I think my enthusiasm and love of my work has drawn more people to my account as well as the use of specific arb related hashtags in the posts. It has allowed me to become affiliated with companies such as Stihl and Courant. My use and promoting of equipment have generated more interest too. I have made information videos especially during lockdown."
        },
        {
            "text": "With the rise of arboriculture on social media platforms, it is attracting a lot more women to the industry who want to show they are capable, strong and can break the stereotype of arborists and forestry workers throughout the sector. Being a young, female often has its challenges as for one, veteran tree surgeons/agents/landowners may assume I don’t know anything as I’m still quite new to the industry in the grand scheme of things."
        },
        {
            "text": "In general, people in this sector want to develop either on the science side or the practical climbing/working side. The community of women arborists, tree officers, scientists etc. are amazing. You never feel overwhelmed, it’s always an enjoyable and educational environment. There is so much more to forestry and arboriculture than just ‘cutting trees’. It’s such a flexible sector that anyone could find their niche within this industry and be happy for life - I know I have."
        },
        {
            "text": "As mentioned earlier Women’s Arb Camp is an initiative of women for women within the Arboriculture/Forestry sector. The goal is to create a safe, friendly, fun, and inclusive event for all levels of skills and interests within Arboriculture, from climbing and pruning work to consultancy and business management. Each year the attendance had increased 10-fold as word got out and more women became interested in joining. I really look forward to the future of forestry and arboriculture, inviting more women to join and contribute their expertise for tackling climate crisis, new pests and diseases and improving existing woodlands."
        }
    ]
}