{
    "url": "https://mojdigital.blog.gov.uk/2022/03/08/diversity-within-technical-services/",
    "title": "Diversity within Technology Services",
    "authors": [
        "Rachel Winstanley",
        "Nava Ramanan"
    ],
    "categories": [
        "International Women's Day"
    ],
    "pub_date": "2022-03-08T19:15:35+01:00",
    "content": [
        {
            "text": "Rachel Winstanley: Cloud Ops Product Owner, Technology Services"
        },
        {
            "text": "I started as a Product Manager in the MoJ 4 months ago and have spent the last few years working in various product roles across government. As a relatively new member, the team has welcomed me with open arms, and I have really enjoyed my first few months here."
        },
        {
            "text": "I was attracted to the MoJ D&T team as I knew its reputation as a department where you could work on exciting and challenging products and push yourself in your role. I've definitely felt both since starting here. "
        },
        {
            "text": "It is also an accessible employer, which is very important to me. As someone with a disability, the ability to work from home and flex my hours as needed has been valuable. It has meant that I can manage my condition easily while not missing out at work. The move to digital hubs has also been fantastic. As I'm based in Leeds, it's given me a lot more choice about what work I do and what projects I can be involved in. "
        },
        {
            "text": "Working in tech, I got used to being the only woman in the room and sometimes having people react with confusion when I turned up to meetings. However, here I've felt included since the very beginning. Although there aren't as many women as we'd like in some of the more technical teams, I'm never treated as the odd one out and actively encouraged to get more involved and take on more responsibility by those around me. Senior leaders have regularly asked for my feedback, and I've felt comfortable to be honest even when my feedback is negative as I know it will be listened too and acted on. "
        },
        {
            "text": "Product Managers are still new in the technical services space, there has been a lot of scope for me to shape my role. I've influenced how my teams are structured, what the product manager role looks like, and I am helping to set up the profession in the technical services space. At the beginning of my career, this is an exciting opportunity to challenge myself and build experience."
        },
        {
            "text": "Nava Ramanan: Deputy Director – Head of Network, Voice, Video & Hosting Services"
        },
        {
            "text": "The MoJ is a modern and diverse workplace that promotes a healthy work-life balance and flexible working options. We understand lifestyle choices and the need to balance work with personal priorities, now more than ever. This ethos helps our colleagues play important societal roles outside work, including caring for children or the elderly. Recent work to enable “hybrid working” options have introduced still more flexibility for our workforce."
        },
        {
            "text": "We are committed to developing a more gender-diverse workforce, particularly in STEM roles. Institutional mindsets can be a barrier and are a major reason that we see fewer women in technical roles.  It can be all too easy to allow traditional stereotypical gender roles in society to drive assumptions about women at work and as leaders. I believe that to address these imbalances we need to start at the earliest levels of education and further enforce these changes in schools and universities. That said, we are lucky in MoJ to have a number of great female role models in our technical and senior leadership teams.  "
        },
        {
            "text": "A key element of my role is to create these diverse teams but also to enable a work environment where people feel comfortable challenging each other and sharing ideas openly and respectfully. "
        },
        {
            "text": "There is a perception that working in a government technical team can mean working with outdated tech, with a laid-back approach, in male-dominated teams. That is certainly not the case at MoJ. Our Technology Services are well maintained, we have diverse multidisciplinary teams, and can compete with the best of large enterprises. We are continuously adapting to new ways of working."
        }
    ]
}