{
    "url": "https://foresightprojects.blog.gov.uk/2022/03/08/genomics-you-and-your-family-tree/",
    "title": "Genomics: you and your family tree",
    "authors": [
        "Melissa Jackson"
    ],
    "categories": [
        "Foresight projects"
    ],
    "pub_date": "2022-03-08T16:52:50+00:00",
    "content": [
        {
            "text": "What secrets are you yet to uncover in your family tree? Who gets to decide if these stay hidden?"
        },
        {
            "text": "It’s now easier than ever to trace your own personal ancestry. Just submit a swab or a saliva sample to one of many specialist companies, and they will analyse your genetic ancestry in a matter of weeks."
        },
        {
            "text": "Ancestry analysis is probably the most popular form of direct-to-consumer (DTC) genomic service currently available to the public. However, it’s far from the only one. You could also undertake a disease risk assessment, or get personalised nutritional advice, all from the comfort of your own home. There are even third-party databases where you can upload your raw genomic sequence and receive an analysis of a variety of traits and risks in addition to those provided by the company you initially used."
        },
        {
            "text": "The rise of DTC"
        },
        {
            "text": "The global DTC genomics market is growing rapidly and is expected to be worth USD $2.7 billion by 2025 (1). DTC testing lets the public engage directly with genomics, offering them the excitement of finding out about their genetic make-up. It promises to unlock what your genome might tell you about your identity, disease risk and overall health. However, the rise in DTC genomic testing also comes with some risks."
        },
        {
            "text": "It is fuelling the rapid accumulation of the public’s genomic data by international private companies, raising issues around ownership, privacy, and consent. Also, if your genomic test uncovers a hidden hereditary health condition, or casts doubt on your true parentage, then this has implications for your relatives too - whilst your genome is unique, parts of it are intrinsically shared with your biological family and ancestors. You share 50% of your genome with your parents and siblings, 25% with each grandparent, and 12.5% with a first cousin. Once you have your genetic sequence, you can share it with a third-party database, exposing part of your relatives’ genomic information to further scrutiny, without their knowledge or consent."
        },
        {
            "text": " "
        },
        {
            "text": "Genetic genealogy"
        },
        {
            "text": "This genetic interconnectedness has been exploited by law enforcement in other countries. For example, in the US, they have used third-party genomic databases to identify criminals by uploading DNA sequences from crime scenes and uncover suspects through distant relatives. In the case of the ‘Golden State Killer’, investigators identified the perpetrator James DeAngelo via his third cousins, who shared a great great-grandparent and had uploaded their genomes to an online database (2). This approach is now solving many cases per year in the US, and some other countries are adopting similar tactics."
        },
        {
            "text": "There is no intention of adopting these practices in the UK, but it is worth noting that there is also currently no UK regulation explicitly prohibiting the police from accessing genomic databases for these purposes. However, the UK’s major health and research databases have stated that they will not allow the police to access the data they hold unless forced to do so by the courts. Should solving crimes trump people’s right to privacy, and control over their genetic information?"
        },
        {
            "text": "Our new report, ‘Genomics Beyond Health’ introduces genomics, explores how the science is developing, and considers where it might lead. The report discusses the impacts of DTC genomic testing and third-party genomic databases on our privacy, security, and even our freedom. It also explores issued beyond these, and looks at how genomics might impact sectors as diverse as criminal justice, education, and sport, and why people should think about the role that genomics could play in their future."
        },
        {
            "text": "We will be working with policy officials across departments to support them in considering how genomics might impact their departments’ areas of policy, and explore what action might be necessary to prepare for the opportunities and risks that the application of this fast-developing science will bring with it."
        },
        {
            "text": " "
        },
        {
            "text": "Footnotes:\n1: Bergin, J (2020) Direct to Consumer Genetic Testing: global market and technologies. BCC Research.\n2: Kaiser, J (2018) We will find you: DNA search used to nab Golden State Killer can home in on about 60% of white Americans. Science."
        }
    ]
}