{
    "url": "https://services.blog.gov.uk/2022/03/08/how-to-build-a-team-and-effect-culture-change/",
    "title": "How to build a team and effect culture change",
    "authors": [
        "Lisa Trickey – Service Manager Digital Strategy & Design, Dorset Council"
    ],
    "categories": [
        "New lenses and perspectives",
        "Service transformation"
    ],
    "pub_date": "2022-03-08T19:10:50+00:00",
    "content": [
        {
            "text": "In April 2021, the Dorset Council Cabinet meeting approved our Digital Vision for Dorset. It’s an exciting time, and we’ve been busy recruiting additional roles to help deliver change. However, this doesn’t come without its challenges. We have to think about how we continue to grow these capabilities locally and embed a user-centred design culture across the organisation."
        },
        {
            "heading": 2,
            "text": "Getting started"
        },
        {
            "text": "Our journey began in 2016, and there was a view that the information, communications and technology function (ICT) was not adding the value they could to the council. Time was spent producing business cases and implementing third-party systems with limited user satisfaction. So, inspired by the work that the change agency FutureGov were doing, the mission was set to introduce user-centred design to help improve services, bring creativity, and provide a different way to deal with budget cuts."
        },
        {
            "text": "In 2017, I was asked to ‘make digital happen’ at the council. Digital is such a broad agenda and needs to permeate everything we do and think about in the organisation. Although the ICT function in the council initiated ‘digital’, I didn’t want technology to be the focus of the change activity."
        },
        {
            "text": "Two opportunities presented themselves in different service areas when we were about to experiment with service design. We engaged FutureGov, who worked alongside service leads, ICT business analysts, content designers and application support officers, exposing them to user-centred design and working in multi-disciplinary teams. "
        },
        {
            "text": "The 2 engagements went very differently. In one, the service team engaged and bought into the process. The service team saw an improvement in customer satisfaction and their relationship with their customers. The other demonstrated our organisation’s challenges, which is about changing culture. It highlighted the need to manage managers’ expectations around discovery outputs and delivering minimum viable products."
        },
        {
            "heading": 2,
            "text": "A new team"
        },
        {
            "text": "We now had evidence, knowledge, and skills that we could build on. We decided to centralise several ICT business analysts in customer-facing IT support teams to take them on the journey of becoming service designers."
        },
        {
            "text": "The digital design team was born. My emphasis as the leader of this new area was on the team and individual development. We understood that service design is a different mindset from that of a business analyst. So we started our journey by focusing on understanding the problem and avoiding talking about solutions at an early stage."
        },
        {
            "text": "We focused on quick wins to gain confidence in the approach. The GOV.UK Notify messaging service and good content design to reduce failure demand helped with this. However, the most crucial aspect of our work was gaining people’s trust and building good relationships."
        },
        {
            "text": "National initiatives such as Services Week and Learning at Work Week were used to talk to the organisation about service design and our broader digital work.  Communication is key to raising awareness, demonstrating value, and generating excitement. This is where our Digital Dorset brand comes in."
        },
        {
            "heading": 2,
            "text": "The beginning of a new era"
        },
        {
            "text": "In the summer of 2018, a decision was made to reorganise local government in Dorset, creating 2 unitary authorities from 9 previous councils. As a manager of the new digital design team, the timing was interesting. It meant people were keen to re-skill, and there was a sense of urgency. But it was difficult in terms of the broader digital strategy work to get investment, commitment, and there was uncertainty of the future for people."
        },
        {
            "text": "Success was the new Dorset Council being co-signatories of the Local Digital Declaration as it was forming – this has provided me with a clear mandate for many conversations since.  "
        },
        {
            "text": "From the learning in our 2 initial examples, if we were to succeed, we would need to get digital into the heart of our organisation. This is where a brand new council with ambition and modern leadership provided a fantastic opportunity."
        },
        {
            "heading": 2,
            "text": "A new council"
        },
        {
            "text": "Dorset Council was formed on 1 April 2019. We have established behaviours that enable digital to thrive: recognition, respect, responsibility, collaboration. By embodying these behaviours, we can work together as #OneTeam. "
        },
        {
            "text": "A big win in the early days of the new council was intercepting a new ‘invest to save’ initiative to align it with the stages in the Design Council double diamond. This caused some confusion for a while but has helped embed the discovery concept, with people now regularly talking about understanding user needs.  "
        },
        {
            "text": "In that first year, we invited a peer review where our digital work was called out. It gave the team recognition and credibility: ‘“Your team’s focus on the user’s need was refreshing to be at the heart of your approach, rather than just being given lip service.”"
        },
        {
            "text": "This was all during a period of restructuring. On 1 January 2020, a new digital team was formed, made up of people passionate about making a difference. "
        },
        {
            "heading": 2,
            "text": "Creating a team structure"
        },
        {
            "text": "A consultancy designed the structure for the new council. There are 30 people in the digital team: business partners, architects, web managers, content designers, service design managers, service designers, service improvement analysts, and user adoption roles. User research is incorporated into content and service design roles, but a dedicated post would be helpful. We used the Digital, Data and Technology (DDaT) job families to create the job descriptions."
        },
        {
            "text": "The service is separate from ICT Operations, which has helped signal that digital isn’t just about technology. However, it would have been good to have some dedicated developer capacity and data roles within the service to enable quicker delivery. We have recently added a delivery manager to the team to focus on agile delivery alongside service design."
        },
        {
            "heading": 2,
            "text": "Embedding service design"
        },
        {
            "text": "We created a development matrix for service design based on the skills we believe are essential and use this to contribute to individual and team development. In addition, we use it for buddying up more extensive work (combining skillsets), and James Symonds, Manager for Service Design, provides coaching and mentoring, helping us grow a fantastic team of service designers."
        },
        {
            "text": "We have learnt you need to ‘do’ service design rather than ‘tell’ people about service design. A new language can be helpful in change, but we have learnt it can also be a barrier. So taking time to listen and create a shared understanding is essential."
        },
        {
            "text": "The team’s work proved valuable during the pandemic and beyond, identifying saving opportunities and making service improvements. Now, we are struggling to meet demand. There are still times when a service team questions the need for discovery. We can then refer to our core council value: “We put people first and design services around their needs now and in future”. "
        },
        {
            "text": "People’s expectation of a digital team can be that it’s about designing for the online user experience. Our business partners talk to services about the need to consider technology, data, people and process and how service design supports this."
        },
        {
            "heading": 2,
            "text": "The future"
        },
        {
            "text": "We have discussed how we focus discovery activity around our customer transformation principles to reduce the time it takes and help implement our digital platform."
        },
        {
            "text": "We need to skill service teams to improve their service, building on a 7 module course with follow-up mentoring that James has developed and tested with Highways colleagues."
        },
        {
            "text": "Recruiting the skills and capacity we need is challenging as many organisations following the pandemic are revisiting digital strategies and the types of skills they need. We will need to ‘grow our own’ and support Amy Newnham’s work at Adur & Worthing Council to create a service design apprenticeship."
        },
        {
            "text": "As with most aspects of digital, how you start depends on the local context. If you’ve not started the service design journey, how could you begin experimenting with building evidence? What strengths and opportunities do you have?"
        },
        {
            "text": "We participate in Services Week and share our skills work, mentoring Highways colleagues and our use of embedded digital champions to increase the use of online services."
        },
        {
            "text": "If you are interested in learning more about our work, you can follow Dorset Council on Twitter."
        }
    ]
}