{
    "url": "https://ipa.blog.gov.uk/2022/03/08/international-womens-day-challenge-the-status-quo-and-never-give-up/",
    "title": "International Women's Day: ‘Challenge the status quo and never give up’",
    "authors": [
        "laurenvamplew"
    ],
    "categories": [
        "Diversity & Inclusion"
    ],
    "pub_date": "2022-03-08T09:36:09+00:00",
    "content": [
        {
            "text": "As part of International Women’s Day, Lorraine Russell, Deputy Director at the Ministry of Defence, gives her views on the importance of strong female leadership and diversity in project delivery."
        },
        {
            "text": "“Life would be boring if we were all the same”"
        },
        {
            "text": "It is massively important to have diversity in all forms in project delivery and the Civil Service so that we are a representation of the communities we serve. A lack of diverse senior leadership or appropriate representation across the profession leads to a lack of innovation - life would be boring if we were all the same!"
        },
        {
            "text": "Project delivery professionals who are women and from ethnically diverse backgrounds tend not feel confident enough to apply for promotion, and that is due to less visibility at a senior level. More needs to be done to create a level playing field, such as ensuring we have true diversity on recruitment panels and visibility of women and ethnically diverse people across all channels. "
        },
        {
            "text": "My story "
        },
        {
            "text": "I started my career in a jobcentre in North London. The early part of my career in the Department for Work and Pensions really shaped my leadership style as you are responsible for quite a lot at a junior grade, but people often forget about the transferrable skills they have at junior grades that would benefit them for a career in project delivery."
        },
        {
            "text": "And although I would love to say that being a black woman has not been a barrier to me, I am sad to say that I have faced discrimination in my career. There have been instances where I have been passed over for a promotion in favour of someone else with a different background, I have been told I am too confident, I am not confident enough or that I lacked experience - which to me, says more about the person saying no. "
        },
        {
            "text": "People fear what they do not understand and are more likely to recruit those who look more like themselves. So, how did I overcome those experiences? I focused on my personal development, was not afraid to challenge the status quo and, most importantly, never gave up! You can not argue with skill and competence, so let that speak for itself."
        },
        {
            "text": "Being your authentic self"
        },
        {
            "text": "To progress through the ranks to senior levels and flourish as a leader, I think it is really important to share your lived experiences with as many people as possible. Show colleagues who aspire to progress their careers that it can be done while being your authentic self. Authenticity is a very important part of leadership in my view and I actively promote that idea. As soon as you start trying to act in a way that is not natural to you, that is when things go wrong. It's important to be relatable, human and compassionate as well as competent and skilled."
        },
        {
            "text": "When I first started out in the Civil Service and in the early stages of my project delivery career, there was not that many black female senior leaders, so I can see how colleagues from less represented groups would feel disempowered to even strive for promotion or to branch out into a new career path. "
        },
        {
            "text": "I see it as the responsibility of all female leaders to be visible role models and to mentor and coach as many people as possible. We need to do more to reduce the instances of bias in all of its forms and to create a more level playing field. Change starts from within!"
        },
        {
            "text": "My inspiration"
        },
        {
            "text": "As corny as it sounds, I would have to say my mum is my inspiration. She came here from Jamaica at a very young age in the 1950s and encountered sexism and racism in its ugliest forms. She taught me and my siblings the value of a good education, humility, hard work, being passionate about what you do, as well as the importance of being the best version of yourself and the power of your own fortitude. She is a formidable woman. "
        },
        {
            "text": "If I could give one piece of advice to a young woman starting a career in project delivery who perhaps does not feel as empowered as a male colleague to progress to a senior leader, it would be ‘don’t doubt yourself’. "
        },
        {
            "text": "And as my grandmother always said, “if you do not succeed at first, try, try again”. "
        }
    ]
}