{
    "url": "https://food.blog.gov.uk/2022/03/08/international-womens-day-breakthebias-in-the-workplace/",
    "title": "International Women’s Day – #BreakTheBias in the workplace",
    "authors": [
        "Rebecca Sudworth, Director of Policy"
    ],
    "categories": [
        "People"
    ],
    "pub_date": "2022-03-08T08:52:56+00:00",
    "content": [
        {
            "text": "Cymraeg"
        },
        {
            "text": "To mark International Women’s Day, Director of Policy, Rebecca Sudworth looks at the interplay between discrimination and bias in the workplace. She sets out positive steps and actions that all can take towards a more inclusive, supportive working environment."
        },
        {
            "text": " "
        },
        {
            "text": "When I started secondary school in the 1970s, we were told that the boys would do woodwork and metalwork and the girls would do sewing and cooking."
        },
        {
            "text": "I complained to my parents and my dad was down the school like a shot, threatening them with the European Court of Human Rights. After this, my friend Jane and I became the first, and only, girls in the metalwork class that year. (I'm still the one with the toolbox in our household.) No boys were brave enough to join the sewing class."
        },
        {
            "text": "Stopping someone from doing something because of their gender or another protected characteristic is discrimination. It's often pretty obvious when it happens and there are laws against it that most people know about."
        },
        {
            "heading": 2,
            "text": "The interplay of discrimination and bias"
        },
        {
            "text": "Bias is more subtle. Tackling discrimination meant that, in theory, boys and girls at my school were free to choose the subjects they wanted – but it was bias that stopped people being able to make a genuine choice."
        },
        {
            "text": "Bias is the attitudes, culture, behaviours, assumptions and prejudices that we all carry within us and express in ways that are implicit as well as explicit. Bias told those boys that our school would not be a welcoming place for boys who wanted to study sewing."
        },
        {
            "text": "When I reflect on my career so far I can see more clearly in retrospect the way in which the opportunities I've had were shaped by the interplay between discrimination and bias and how understanding these things can help make our workplaces more inclusive and diverse."
        },
        {
            "heading": 2,
            "text": "Flexibility at work"
        },
        {
            "text": "Twice in my career I've had to tell an employer on my very first day in a new job that I couldn't start work as expected because my partner was unwell and had been admitted to hospital. My partner was always the primary carer for our children and so if he was unwell that meant that I couldn’t get to work until I'd made other arrangements."
        },
        {
            "text": "It would mean that I'd need flexibility for an extended period at a time when my new employer expected me to give the new job my full attention. Not an easy thing to talk about with a brand new employer."
        },
        {
            "text": "Both of those employers exceeded my expectations. I knew that both had good family friendly policies and would be sympathetic – that they wouldn’t discriminate against me. But there is a big difference between having a policy in place and getting the kind of support and understanding that means you feel comfortable at work."
        },
        {
            "text": "I still remember those conversations when I had to screw up the courage to say, 'I'm really sorry, I know it’s my first day but I can't come in' – and the kind and wise HR professionals who responded with empathy and experience to let me know that it was OK, and I'd get the support I needed."
        },
        {
            "heading": 2,
            "text": "Challenging assumptions in the workplace"
        },
        {
            "text": "In fact, my career might have got going sooner if I'd had that kind of empathy and encouragement at an earlier stage. I'd been offered a great job in London when I found out I was pregnant with my first child. Living in Oxford with a long commute and not knowing how I would juggle work and family, arrange childcare etc., I simply assumed that meant I wouldn’t be able to do the role. When I rang the employer to explain, this was accepted as a matter of fact."
        },
        {
            "text": "Looking back now, I wonder what might have happened if that employer had taken some time to explain their maternity and flexible working policies to me, to offer me more time to think about the practicalities or even to keep me on a reserve list for future opportunities."
        },
        {
            "text": "They weren't discriminating against me – it was my choice to turn down that role – but my own assumptions about what I'd be able to do and their acceptance of those assumptions meant that the result was just the same."
        },
        {
            "heading": 2,
            "text": "What it takes to succeed"
        },
        {
            "text": "It happens a lot that women – and it is usually women – express reservations about whether they can cope with a new role alongside family and caring responsibilities. I always advise them not to think about all the reasons that they might not be able to do the job, but to think about what it would take to help them succeed."
        },
        {
            "text": "Talk to your manager or the recruiting team – be clear and positive about what you can contribute, given the right support. Explain what that support involves. Find out what they can offer. It really does work – you can take it from me."
        },
        {
            "text": "You might be thinking that's easy for me to say – I'm now senior in my career and in a very different position from people starting out. Earlier in my career I used to wait until I'd been offered a job before having these conversations. I figured that would give me more leverage, and in many cases I know that was true."
        },
        {
            "text": "That’s still something that a lot of people do, and I understand why – especially disabled people who continue to face significant discrimination and bias in the workplace."
        },
        {
            "text": "But increasingly, I see that employers are paying attention to the ways in which they can showcase their workplace culture, and using their recruitment campaigns to demonstrate that when they say they are inclusive – they really mean it."
        },
        {
            "heading": 2,
            "text": "Workplace culture at the Food Standards Agency"
        },
        {
            "text": "When I joined the FSA three years ago, I checked for things that would give me a flavour of what it was like to work here – what it’s really like, I mean, not what it says in the job advert."
        },
        {
            "text": "Talking to my prospective manager in advance, looking for clues about the organisational culture. For senior roles, the FSA has an employee panel – that was a chance for both of us to get to know each other. I liked what I saw."
        },
        {
            "text": "What I try and do now is to remember that battling bias is about our everyday interactions, a tone of voice, a reaction to news, the way you show people that you mean what you say. It’s about walking the walk and it’s not always easy."
        },
        {
            "text": "So don't assume that people know what you think and feel. Say it out loud – if a colleague tells you they are expecting a baby, be joyful, and ask what will help them at work during their or their partner's pregnancy and after the birth. In job adverts, actively welcome applications from people who have different working patterns. If someone asks for flexibility don't let your first response be 'I'll have to see if we can manage that' but, 'I'm really pleased you've explained what will help you'."
        },
        {
            "text": "If a talented colleague says that they worry about coping if they go for promotion, tell them to take it one step at a time and not to rule themselves out before finding out more."
        },
        {
            "text": "Saying it out loud is why I talk about diversity and equality at work. I'm proud to work for an organisation where the senior managers support staff networks and demonstrate personal commitment to change."
        },
        {
            "text": "So this International Women’s Day, I want to encourage you all to reach out to each other, and think about what you can say or do at work today to show your own visible commitment to #BreaktheBias."
        },
        {
            "heading": 1,
            "text": "Diwrnod Rhyngwladol y Menywod – #ChwaluRhagfarn yn y gweithle"
        },
        {
            "text": "Ar Ddiwrnod Rhyngwladol y Menywod, mae'r Cyfarwyddwr Polisi, Rebecca Sudworth, yn edrych ar y gydberthynas rhwng gwahaniaethu a rhagfarn yn y gweithle. Mae hi’n amlinellu camau cadarnhaol a chamau gweithredu y gall pawb eu cymryd er mwyn gweithio tuag at amgylchedd gwaith mwy cynhwysol a chefnogol."
        },
        {
            "text": " "
        },
        {
            "text": "Pan ddechreuais yn yr ysgol uwchradd yn y 1970au, dywedwyd y byddai'r bechgyn yn dysgu gwaith coed a gwaith metel a'r merched yn dysgu gwnïo a choginio."
        },
        {
            "text": "Es i adref a chwyno wrth fy rhieni a dyma fy nhad yn mynd ar ei union i’r ysgol, gan fygwth mynd at Lys Hawliau Dynol Ewrop. Ar ôl hyn, fy ffrind Jane a minnau oedd y merched cyntaf, a’r unig ferched, yn y dosbarth gwaith metel y flwyddyn honno. (Fi yw'r un â’r blwch taclau yn ein tŷ ni o hyd.) Nid oedd yr un bachgen yn ddigon dewr i ymuno â'r dosbarth gwnïo."
        },
        {
            "text": "Mae atal pobl rhag gwneud rhywbeth oherwydd eu rhyw neu nodwedd warchodedig arall yn wahaniaethu. Yn aml mae'n ddigon amlwg pan fydd yn digwydd, ac mae’r rhan fwyaf o bobl yn ymwybodol o’r cyfreithiau yn ei erbyn."
        },
        {
            "heading": 2,
            "text": "Y gydberthynas rhwng gwahaniaethu a rhagfarn"
        },
        {
            "text": "Mae rhagfarn yn fwy cynnil. Roedd mynd i’r afael â gwahaniaethu yn golygu, o ran egwyddor, fod bechgyn a merched yn fy ysgol i yn rhydd i ddewis y pynciau roedden nhw eisiau eu hastudio – ond rhagfarn oedd yn atal pobl rhag gallu gwneud dewis gwirioneddol."
        },
        {
            "text": "Rhagfarn yw’r agweddau, y diwylliant, yr ymddygiadau, a’r rhagdybiaethau sydd gan bob un ohonom ni, ac rydym ni weithiau’n eu mynegi mewn ffyrdd cynnil, ac weithiau mewn ffyrdd cwbl ddiamwys."
        },
        {
            "text": "Rhagfarn a ddywedodd wrth y bechgyn na fyddai ein hysgol ni yn lle croesawgar i fechgyn oedd am astudio gwnïo."
        },
        {
            "text": "Pan fyddaf yn myfyrio ar fy ngyrfa hyd yma, gallaf weld yn gliriach wrth edrych yn ôl pa effaith a gafodd y gydberthynas rhwng gwahaniaethu a rhagfarn ar y cyfleoedd a gefais, a sut y gall deall y pethau hyn helpu i sicrhau bod ein gweithleoedd yn fwy cynhwysol ac amrywiol."
        },
        {
            "heading": 2,
            "text": "Hyblygrwydd yn y gwaith"
        },
        {
            "text": "Ddwywaith yn ystod fy ngyrfa, rydw i wedi gorfod dweud wrth gyflogwr ar fy niwrnod cyntaf mewn swydd newydd na fyddai modd i mi ddechrau gweithio yn ôl y disgwyl oherwydd bod fy mhartner yn sâl a’i fod yn yr ysbyty. Fy mhartner oedd prif ofalwr ein plant bob amser ac felly os oedd e’n sâl, roedd hynny'n golygu na allwn i gyrraedd y gwaith nes i mi wneud trefniadau eraill."
        },
        {
            "text": "Byddai'n golygu bod angen hyblygrwydd arnaf am gyfnod estynedig, a hynny ar yr union adeg pan oedd fy nghyflogwr newydd yn disgwyl i mi roi fy holl sylw i'r swydd newydd. Doedd e’ ddim yn beth hawdd ei drafod â chyflogwr newydd sbon."
        },
        {
            "text": "Roedd y ddau gyflogwr hynny wedi rhagori ar fy nisgwyliadau. Roeddwn i’n gwybod bod gan y ddau bolisïau cyfeillgar i deuluoedd ac y byddent yn cydymdeimlo – hynny yw, na fyddent yn gwahaniaethu yn fy erbyn. Ond mae gwahaniaeth mawr rhwng cael polisi ar waith a chael y math o gefnogaeth a dealltwriaeth sy’n golygu eich bod yn teimlo’n gyfforddus yn y gwaith."
        },
        {
            "text": "Rwy’n dal i gofio’r sgyrsiau hynny pan fu’n rhaid i mi fagu’r dewrder i ddweud, ‘Mae’n wir ddrwg gen i, rwy’n gwybod mai heddiw yw fy niwrnod cyntaf ond alla’ i ddim dod i mewn’ – a’r gweithwyr AD proffesiynol caredig a doeth a ymatebodd gydag empathi a phrofiad i adael i mi wybod bod hynny’n iawn, ac y byddwn i’n cael y cymorth yr oedd ei angen arna’ i."
        },
        {
            "heading": 2,
            "text": "Herio rhagdybiaethau yn y gweithle"
        },
        {
            "text": "Yn wir, efallai y byddai fy ngyrfa wedi dechrau’n gynt pe byddwn i wedi cael y math hwnnw o empathi ac anogaeth yn gynharach. Roeddwn i wedi cael cynnig swydd wych yn Llundain pan wnes i ddarganfod fy mod i’n disgwyl fy mhlentyn cyntaf. Roeddwn i’n byw yn Rhydychen a byddai gennyf fi daith hir i gymudo i’r gwaith, a doeddwn i ddim yn gwybod sut y byddwn i’n jyglo gwaith a theulu, trefnu gofal plant, ac ati."
        },
        {
            "text": "Yn syml iawn, fe gymerais yn ganiataol bod hynny'n golygu na fyddwn i'n gallu gwneud y rôl. Pan ffoniais y cyflogwr i egluro, cafodd hyn ei dderbyn fel ffaith."
        },
        {
            "text": "Wrth edrych yn ôl nawr, tybed beth allai fod wedi digwydd pe bai’r cyflogwr hwnnw wedi cymryd amser i egluro ei bolisïau mamolaeth a gweithio hyblyg i mi, a chynnig mwy o amser i mi feddwl am y pethau ymarferol neu hyd yn oed i’m cadw ar restr wrth gefn ar gyfer cyfleoedd yn y dyfodol."
        },
        {
            "text": "Nid oedd yn gwahaniaethu yn fy erbyn – fy newis i oedd gwrthod y rôl honno – ond roedd fy rhagdybiaethau i fy hunan ynghylch yr hyn y byddwn i’n gallu ei wneud a pharodrwydd y cyflogwr i dderbyn y rhagdybiaethau hynny yn golygu mai'r un oedd y canlyniad."
        },
        {
            "heading": 2,
            "text": "Yr hyn sydd ei angen er mwyn llwyddo"
        },
        {
            "text": "Mae’n digwydd yn aml bod menywod – a menywod ydyn nhw fel arfer – yn mynegi amheuon ynghylch eu gallu i ymdopi â rôl newydd ochr yn ochr â chyfrifoldebau teuluol a gofalu. Rydw i bob amser yn eu cynghori i beidio â meddwl am yr holl resymau pam na fydden nhw’n gallu gwneud y swydd, ond yn hytrach i feddwl am yr hyn y byddai'n ei gymryd i'w helpu i lwyddo."
        },
        {
            "text": "Siaradwch â'ch rheolwr neu'r tîm recriwtio – byddwch yn glir ac yn gadarnhaol ynghylch yr hyn y gallwch ei gyfrannu, o gael y gefnogaeth gywir. Eglurwch beth mae'r cymorth hwnnw yn ei olygu. Gofynnwch beth y gallant ei gynnig. Mae wir yn gweithio – credwch chi fi."
        },
        {
            "text": "Efallai eich bod yn meddwl ei bod yn hawdd i mi ddweud hyn – rydw i bellach wedi dringo’r ysgol ac mewn sefyllfa wahanol iawn i bobl sy'n dechrau arni. Yn gynharach yn fy ngyrfa, roeddwn i'n arfer aros nes i mi gael cynnig swydd cyn cael y sgyrsiau hyn. Roeddwn i'n meddwl y byddai hynny'n rhoi mwy o fantais i mi, ac mewn llawer o achosion, rwy’n gwybod bod hynny'n wir."
        },
        {
            "text": "Mae hynny'n rhywbeth y mae llawer o bobl yn ei wneud o hyd, ac rwy'n deall pam – yn enwedig pobl anabl sy'n parhau i wynebu gwahaniaethu a rhagfarn sylweddol yn y gweithle."
        },
        {
            "text": "Ond yn gynyddol, rwy’n gweld bod cyflogwyr yn ystyried sut y gallant arddangos diwylliant eu gweithle, ac yn defnyddio eu hymgyrchoedd recriwtio i ddangos eu bod nhw wir yn ei olygu pan fyddant yn dweud eu bod yn gynhwysol."
        },
        {
            "heading": 2,
            "text": "Diwylliant y gweithle yn yr Asiantaeth Safonau Bwyd"
        },
        {
            "text": "Pan ymunais â'r ASB dair blynedd yn ôl, chwiliais am bethau a fyddai'n rhoi blas i mi o sut brofiad oedd gweithio yma – hynny yw, sut beth yw hi mewn gwirionedd, nid yr hyn y mae'n ei ddweud yn yr hysbyseb swydd."
        },
        {
            "text": "Gwnes i hyn drwy siarad â'm darpar reolwr ymlaen llaw, a chwilio am gliwiau am ddiwylliant y sefydliad. Ar gyfer rolau uwch, mae gan yr ASB banel gweithwyr – roedd hynny’n gyfle i’r Asiantaeth ddod i’m hadnabod i, ac i mi ddod i adnabod yr Asiantaeth. Roeddwn i’n hoffi’r hyn a welais."
        },
        {
            "text": "Yr hyn rydw i'n ceisio'i wneud nawr yw cofio bod brwydro yn erbyn rhagfarn yn ymwneud â'r ffordd rydym ni’n rhyngweithio bob dydd, tôn y llais, ymateb i newyddion, y ffordd rydych chi'n dangos i bobl eich bod chi'n golygu'r hyn rydych chi'n ei ddweud. Mae'n ymwneud â gwneud yn ogystal â dweud ac nid yw bob amser yn hawdd."
        },
        {
            "text": "Felly peidiwch â chymryd yn ganiataol bod pobl yn gwybod beth rydych chi'n ei feddwl a sut rydych chi’n teimlo. Codwch eich llais – os bydd cydweithiwr yn dweud wrthych chi fod babi newydd ar y ffordd, byddwch yn llawen, a gofynnwch beth fydd o gymorth yn y gwaith yn ystod y beichiogrwydd ac ar ôl yr enedigaeth. Mewn hysbysebion swyddi, nodwch yn rhagweithiol eich bod yn croesawu ceisiadau gan bobl sydd â phatrymau gwaith gwahanol. Os bydd rhywun yn gofyn am hyblygrwydd, yn hytrach nag ymateb yn syth gan ddweud ‘Bydd yn rhaid i mi weld a allwn ni reoli hynny’, dywedwch ‘Rwy'n falch iawn eich bod chi wedi egluro beth fydd yn eich helpu’."
        },
        {
            "text": "Os bydd cydweithiwr dawnus yn dweud ei fod yn poeni am ymdopi pe bai’n gwneud cais am ddyrchafiad, dywedwch: ‘un cam ar y tro; peidiwch â diystyru eich hun cyn darganfod rhagor’."
        },
        {
            "text": "Codi llais yw'r rheswm pam rwy'n siarad am amrywiaeth a chydraddoldeb yn y gwaith. Rwy'n falch o weithio i sefydliad lle mae'r uwch reolwyr yn cefnogi rhwydweithiau staff ac yn dangos ymrwymiad personol i newid."
        },
        {
            "text": "Felly ar Ddiwrnod Rhyngwladol y Menywod eleni, rydw i am eich annog i gyd i gefnogi eich gilydd, a meddwl am yr hyn y gallwch chi ei ddweud neu ei wneud yn y gwaith heddiw i ddangos eich ymrwymiad amlwg eich hun i #ChwaluRhagfarn."
        }
    ]
}