{
    "url": "https://food.blog.gov.uk/2022/03/08/international-womens-day-women-in-the-meat-industry/",
    "title": "International Women's Day - Women in the meat industry",
    "authors": [
        "Alice Leathley, Trainee Official Auxiliary",
        "Jessica Choyce, Inspection Team Leader"
    ],
    "categories": [
        "People"
    ],
    "pub_date": "2022-03-08T13:00:17+00:00",
    "content": [
        {
            "text": "Cymraeg"
        },
        {
            "text": "To mark International Women’s Day, we are shining a light on women building careers in the meat industry through the Food Standards Agency."
        },
        {
            "text": "Meat Hygiene Inspectors and Official Veterinarians play a key role in ensuring food safety and animal welfare standards are met across the food chain."
        },
        {
            "text": "Here we meet two women on the frontline currently making waves in the meat industry."
        },
        {
            "heading": 2,
            "text": "Alice Leathley – Trainee Official Auxiliary (TOA)"
        },
        {
            "text": "Alice is based in the Wales and West region and qualified in red meat in June 2021. She is currently working towards her white meat qualification."
        },
        {
            "heading": 3,
            "text": "What attracted you to the role of Trainee Official Auxiliary?"
        },
        {
            "text": "I worked as a chef for 8 years and the pandemic gave me a reason to think outside the box and find a new career. I was looking for something hands-on rather than office-based, industry-related, and somewhere that I could utilise transferrable skills."
        },
        {
            "text": "When I came across the TOA position, it really felt like I had hit a gold mine and somehow discovered the perfect job for me that I didn’t actually know existed."
        },
        {
            "text": "Working for the FSA and being part of such an important organisation in protecting the food chain somehow feels more like an honour than a job."
        },
        {
            "heading": 3,
            "text": "What has your experience been like?"
        },
        {
            "text": "The training itself is very intensive and definitely requires all of your time and energy for the full 27 weeks. Looking back, it doesn’t even seem real that we managed to write dissertation-length assignments each week, but at the time I think I was so drawn in by the things we were learning about that I genuinely wanted to spend every spare moment reading and researching."
        },
        {
            "text": "As soon as you dive into the world of parasites and pathology, it’s so fascinating to learn about all the weird and wonderful things out there (and, more importantly, how to recognise them in a carcass and know what to do when you find them)."
        },
        {
            "text": "It all feels worth it when you get your warrant to say “You made it! You’re a fully-fledged meat inspector!”"
        },
        {
            "heading": 3,
            "text": "Have there been any challenges?"
        },
        {
            "text": "Training during a pandemic, challenges were around having plant access issues at every turn. In the beginning, I could learn about certain topics at home, but I really hit a brick wall with some modules."
        },
        {
            "text": "Covid outbreaks, social distancing issues, reluctant Food Business Operators, and nowhere for me to go and actually experience production first hand posed real challenges."
        },
        {
            "text": "But like most challenges, there’s always ways to overcome it (albeit by driving nearly 15,000 miles in 6 months) - and I can’t stress enough the importance of building a support network."
        },
        {
            "text": "Myself and the other trainees had a WhatsApp group, a couple of mentors in plants would email me useful findings, and my assessor would always pick up the phone to answer my questions"
        },
        {
            "heading": 3,
            "text": "What do you enjoy most about your work?"
        },
        {
            "text": "For me, the turning point of the training was when I started the anatomy and physiology module. I found the subject really fun to read and write about, and it coincided with a more routine placement where I could see some great examples of draggers and old stock that was full of all sorts of pathology."
        },
        {
            "text": "I realised very quickly that there are so many meat inspectors who are passionate about what they do, and keen to share their experience with the new generation of FSA employees. This was the same at multiple plants I trained at, and I found it very inspirational to learn from them and hear about their careers."
        },
        {
            "heading": 2,
            "text": "Jessica Choyce - Inspection Team Leader"
        },
        {
            "text": "Jess is based in Leicestershire and currently works in the Eastern region. She has recently progressed to Inspection Team Leader in Cluster 21."
        },
        {
            "heading": 3,
            "text": "What attracted you to the role in meat inspection?"
        },
        {
            "text": "I spent many years working in the hospitality industry and due to this was aware of the FSA."
        },
        {
            "text": "Truth be told I stumbled across the job by accident online! After looking into it, having worked in hospitality I thought the job could be a good fit with my transferrable skills along with my understanding of the FSA’s role."
        },
        {
            "text": "That combined with the fact that the FSA is part of the Civil Service it became clear to me that it was an excellent career path with the scope to progress."
        },
        {
            "heading": 3,
            "text": "When did you join the FSA? How have you progressed?"
        },
        {
            "text": "I joined the FSA in April 2019 as a Trainee Official Auxiliary (Meat Hygiene Inspector). I then qualified following the training given and worked as an Official Auxiliary until January 2022, alongside the additional responsibility of being a Staff Engagement Representative and a Change."
        },
        {
            "text": "In January 2022, after several interviews and much hard work, I secured a Temporary Inspection Team Leader role which has now led to a permanent position starting soon."
        },
        {
            "heading": 3,
            "text": "What has your experience been like?"
        },
        {
            "text": "I have enjoyed my time working in the FSA since I started. Everyone has been very friendly and forthcoming with help and support, especially during my training when I started and also easing into my new role as an Inspection Team Leader."
        },
        {
            "heading": 3,
            "text": "Have there been any challenges?"
        },
        {
            "text": "There are always challenges! Particularly during the pandemic. We have a key role to keep the food industry moving - delivering Official Controls, protecting public health, keeping food safe for consumers, and ensuring animal welfare."
        },
        {
            "heading": 3,
            "text": "What do you enjoy most about your work?"
        },
        {
            "text": "I love learning new things and the career path I have chosen certainly lets me do a lot of this. I am proud to work for the FSA and be a part of a team that delivers Official Controls to protect public health and keep food safe for consumers."
        },
        {
            "heading": 1,
            "text": "Diwrnod Rhyngwladol y Menywod – Menywod yn y diwydiant cig"
        },
        {
            "text": "I nodi Diwrnod Rhyngwladol y Menywod, rydym ni’n taflu goleuni ar y menywod hynny sy’n datblygu eu gyrfaoedd yn y diwydiant cig drwy’r Asiantaeth Safonau Bwyd (ASB)."
        },
        {
            "text": "Mae Arolygwyr Hylendid Cig (Cynorthwywyr Swyddogol) a Milfeddygon Swyddogol yn chwarae rhan allweddol wrth sicrhau bod safonau diogelwch bwyd a lles anifeiliaid yn cael eu bodloni ar draws y gadwyn fwyd."
        },
        {
            "text": "Yma rydym ni’n cwrdd â dwy fenyw ar y rheng flaen sy’n cael effaith sylweddol ar y diwydiant cig ar hyn o bryd."
        },
        {
            "heading": 2,
            "text": "Alice Leathley – Cynorthwyydd Swyddogol dan Hyfforddiant"
        },
        {
            "text": "Mae Alice wedi’i lleoli yn rhanbarth Cymru a’r Gorllewin ac enillodd cymwysterau cig coch ym mis Mehefin 2021. Ar hyn o bryd mae hi’n gweithio tuag at gymwysterau cig gwyn."
        },
        {
            "heading": 3,
            "text": "Beth wnaeth eich denu at y rôl ‘Cynorthwyydd Swyddogol dan Hyfforddiant’?"
        },
        {
            "text": "Roeddwn i’n gweithio fel cogydd am 8 mlynedd ond rhoddodd y pandemig reswm i mi feddwl y tu allan i’r bocs a dod o hyd i yrfa newydd. Roeddwn i’n chwilio am rywbeth ymarferol a oedd yn ymwneud â’r diwydiant, yn hytrach na rôl mewn swyddfa, a rhywle y gallwn i ddefnyddio sgiliau trosglwyddadwy."
        },
        {
            "text": "Pan welais i’r swydd hon, roeddwn i wir yn teimlo’n hynod lwcus gan fy mod i rywsut wedi darganfod y swydd berffaith i mi, er nad oeddwn i’n gwybod ei bod yn bodoli."
        },
        {
            "text": "Mae gweithio i’r Asiantaeth Safonau Bwyd a bod yn rhan o sefydliad mor bwysig wrth ddiogelu’r gadwyn fwyd yn teimlo’n fwy fel anrhydedd na swydd."
        },
        {
            "heading": 3,
            "text": "Sut brofiad yw gweithio yn y diwydiant cig i chi?"
        },
        {
            "text": "Mae’r hyfforddiant ei hun yn ddwys iawn ac mae’n gofyn am eich holl amser ac egni am y 27 wythnos gyfan. Wrth edrych yn ôl, alla i ddim credu ein bod ni wedi llwyddo i ysgrifennu aseiniadau hir iawn bob wythnos. Ond ar y pryd, rwy’n meddwl fy mod i wedi fy nenu gymaint gan y pethau yr oeddem ni’n eu dysgu, roeddwn i’n wirioneddol eisiau treulio pob eiliad sbâr yn darllen ac yn ymchwilio."
        },
        {
            "text": "Cyn gynted ag y byddwch chi’n trochi eich hun ym myd parasitiaid a phatholeg, mae’n hynod ddiddorol dysgu am yr holl bethau rhyfedd a rhyfeddol hyn. (Ac, yn bwysicach oll, sut i adnabod eu carcas a gwybod beth i’w wneud pan fyddwch chi’n dod o hyd iddynt)."
        },
        {
            "text": "Mae’r holl waith yn teimlo’n werth chweil pan gewch chi eich gwarant i ddweud “Chi wedi llwyddo! Rydych chi’n arolygydd cig cyflawn!”"
        },
        {
            "heading": 3,
            "text": "A fu unrhyw heriau?"
        },
        {
            "text": "Wrth hyfforddi yn ystod pandemig, roedd heriau o ran cael mynediad at ffatrïoedd. Ar y dechrau, roeddwn i’n gallu dysgu am bynciau penodol gartref, ond roedd rhai modiwlau’n anodd iawn i mi."
        },
        {
            "text": "Roedd brigiadau o achosion Covid, materion cadw pellter cymdeithasol, gweithredwyr busnesau bwyd amharod, ac unman i fynd er mwyn cael profiad uniongyrchol o gynhyrchu yn peri heriau go iawn."
        },
        {
            "text": "Ond fel y rhan fwyaf o heriau, mae yna bob amser ffyrdd i’w goresgyn (er i mi orfod gyrru bron i 15,000 o filltiroedd mewn 6 mis) – ac mae’n rhaid pwysleisio pa mor bwysig yw cael rhwydwaith cefnogi."
        },
        {
            "text": "Roedd gen i a’r hyfforddeion eraill grŵp WhatsApp, byddai mentoriaid mewn ffatrïoedd yn anfon canfyddiadau defnyddiol dros e-bost, a byddai fy aseswr bob amser yn codi’r ffôn i ateb fy nghwestiynau."
        },
        {
            "heading": 3,
            "text": "Beth ydych chi’n ei fwynhau fwyaf am eich gwaith?"
        },
        {
            "text": "I mi, trobwynt yr hyfforddiant oedd pan ddechreuais i’r modiwl anatomeg a ffisioleg. Roedd yn hwyl iawn darllen ac ysgrifennu am y pwnc hwn, ac roedd yn cyd-fynd â lleoliad gwaith mwy arferol lle gallwn i weld rhai enghreifftiau gwych o ‘draggers’ a hen stoc a oedd yn llawn pob math o batholegau."
        },
        {
            "text": "Sylweddolais i’n gyflym iawn fod cymaint o arolygwyr cig sy’n frwd dros eu gwaith, ac yn awyddus i rannu eu profiadau â’r genhedlaeth newydd o weithwyr yn yr ASB. Roedd hyn yn wir mewn nifer o ffatrïoedd y bûm yn hyfforddi ynddynt, ac roedd dysgu gan y bobl hyn a chlywed am eu gyrfaoedd yn ysbrydoledig iawn."
        },
        {
            "heading": 2,
            "text": "Jessica Choyce – Arweinydd Tîm Arolygu"
        },
        {
            "heading": 3,
            "text": "Beth wnaeth eich denu at y rôl ym maes arolygu cig?"
        },
        {
            "text": "Treuliais lawer o flynyddoedd yn gweithio yn y diwydiant lletygarwch ac oherwydd hyn roeddwn i’n ymwybodol o’r ASB."
        },
        {
            "text": "A dweud y gwir, fe ddes i ar draws y swydd ar ddamwain ar-lein! Wrth edrych ar y swydd ddisgrifiad ac ar ôl gweithio ym maes lletygarwch, roeddwn i’n meddwl y gallwn i ddefnyddio fy sgiliau trosglwyddadwy ynghyd â’m dealltwriaeth o rôl yr ASB yn y swydd dan sylw."
        },
        {
            "text": "O ystyried hyn a’r ffaith bod yr ASB yn rhan o’r Gwasanaeth Sifil, daeth i’r amlwg ei fod yn llwybr gyrfa rhagorol gyda’r posibilrwydd i ddatblygu."
        },
        {
            "heading": 3,
            "text": "Pryd wnaethoch chi ymuno â’r ASB? Sut ydych chi wedi datblygu?"
        },
        {
            "text": "Ymunais â’r ASB ym mis Ebrill 2019 fel Cynorthwyydd Swyddogol dan Hyfforddiant (Arolygydd Hylendid Cig). Yna, fe wnes i ennill y cymwysterau perthnasol ar ôl cael fy hyfforddi a bûm yn gweithio fel Cynorthwyydd Swyddogol hyd at Ionawr 2022, ochr yn ochr â’r cyfrifoldeb ychwanegol o fod yn Gynrychiolydd Ymgysylltu â Staff."
        },
        {
            "text": "Ym mis Ionawr 2022, ar ôl sawl cyfweliad a llawer o waith caled, cefais rôl dros dro fel Arweinydd Tîm Arolygu, sydd bellach wedi troi’n swydd barhaol sy’n dechrau’n fuan."
        },
        {
            "heading": 3,
            "text": "Sut brofiad yw gweithio yn y diwydiant cig i chi?"
        },
        {
            "text": "Rwyf wedi mwynhau fy amser yn gweithio yn yr ASB ers i mi ddechrau. Mae pawb wedi bod yn gyfeillgar ac yn barod iawn i helpu a chefnogi, yn enwedig yn ystod fy hyfforddiant cychwynnol a hefyd wrth ddechrau fy rôl newydd fel Arweinydd Tîm Arolygu."
        },
        {
            "heading": 3,
            "text": "A fu unrhyw heriau?"
        },
        {
            "text": "Mae bob amser heriau! Yn enwedig yn ystod y pandemig. Rydym ni’n chwarae rôl allweddol yn sicrhau bod y diwydiant bwyd yn symud – gweithredu Rheolaethau Swyddogol, diogelu iechyd y cyhoedd, cadw bwyd yn ddiogel i ddefnyddwyr, a sicrhau lles anifeiliaid."
        },
        {
            "heading": 3,
            "text": "Beth ydych chi’n ei fwynhau fwyaf am eich gwaith?"
        },
        {
            "text": "Rwyf wrth fy modd yn dysgu pethau newydd ac mae’r llwybr gyrfa rwyf wedi’i ddewis yn sicr yn rhoi cyfle i mi wneud hyn yn aml. Rwy’n falch o weithio i’r ASB a bod yn rhan o dîm sy’n gweithredu Rheolaethau Swyddogol i ddiogelu iechyd y cyhoedd a sicrhau bod bwyd yn ddiogel i ddefnyddwyr."
        }
    ]
}