{
    "url": "https://socialworkwithadults.blog.gov.uk/2022/03/08/international-womens-day-compassion-in-a-crisis/",
    "title": "International Women's Day: compassion in a crisis",
    "authors": [
        "Lyn Romeo"
    ],
    "categories": [
        "Events",
        "Our profession",
        "Society"
    ],
    "pub_date": "2022-03-08T10:14:55+00:00",
    "content": [
        {
            "heading": 2,
            "text": "Progress and empowerment"
        },
        {
            "text": "Only the most cynical would say we have made little progress towards a more equal, open and understanding society. While social, economic and ethnic inequalities remain and must continue to be challenged, in our schools, communities and statute books, there is much greater acceptance of the diversity of the human experience – one not limited by sex, class, gender, ethnicity or sexual orientation."
        },
        {
            "text": "It seems entirely appropriate then, following February’s LGBT+ History Month, for International Women’s Day to make this year’s theme #BreakTheBias’, a call for the further empowerment of women – and of society as a whole."
        },
        {
            "text": "For many reasons, not least lingering stereotypical attitudes around ‘girl and boy jobs’, social care and social work remain female dominated professions (around 80%). Regardless of societal circumstances, recognition of - and just reward for - women’s contribution to the health and social care sector, both as paid workers and unpaid carers, is vital."
        },
        {
            "text": "As women, we are expected not just to be strong in ourselves, but to be strong for others, to be intuitive of their problems, and to give them the support they need to keep going."
        },
        {
            "text": "As we watch the tragedy of the Russian Ukraine war unfold on the borders of Europe, many women are finding themselves cast into these roles, but in ways they could not have anticipated, even a few weeks ago. Mothers, wives, partners, daughters, girlfriends - I salute them, as I do all Ukrainians and good Samaritans in neighbouring countries doing what they can for the distressed, displaced and dispossessed."
        },
        {
            "heading": 2,
            "text": "War in Ukraine and what it means for women"
        },
        {
            "text": "It is inevitable and right that our skills as social workers should be pressed into service, if not now then in the weeks and months ahead as colleagues and those we seek to help, at home and abroad, find themselves needing additional support to navigate a way through this crisis."
        },
        {
            "text": "More than four years ago, I hosted two blogs from Liz Hughes, a qualified social worker, on helping residents survive, process and rebuild after the trauma  of the Grenfell Tower blaze. She was working in a London borough as Head of Service for Prevention and Care Management at the time. She wrote at length of her experiences reconnecting with practice skills to help those whose lives had been turned upside down by an event they hadn’t anticipated or had any control over."
        },
        {
            "text": "These blogs have a new and terrible relevance now but are also filled with hope and a reminder that the worst of times can often catalyse the best of humanity."
        },
        {
            "text": "As we mark International Women’s Day, fairness and justice for women, the upholding of their human rights and their equal inclusion in all aspects of society has never been more essential. The women of Ukraine, indeed of any nation under siege by those who would seek to marginalise, stigmatise and destroy, are an inspiration to us all."
        },
        {
            "text": "Wherever, whoever and whatever we do, we are better than our oppressors and shall always be. Let’s make sure they never forget it and together forge a new world of equality, compassion, peace and love. We’re women – it’s what we’re good at!"
        }
    ]
}