{
    "url": "https://socialcare.blog.gov.uk/2022/03/08/international-womens-day-well-break-the-bias-but-never-womens-resolve/",
    "title": "International Women's Day: we'll break the bias but never women's resolve",
    "authors": [
        "Deborah Sturdy"
    ],
    "categories": [
        "Care and support",
        "Carers",
        "Events",
        "LGBTQ+",
        "Workforce"
    ],
    "pub_date": "2022-03-08T10:46:13+00:00",
    "content": [
        {
            "heading": 2,
            "text": "Strength in diversity"
        },
        {
            "text": "If the last two years have taught us anything, it’s the fundamental truth that collective action, free of self-interest, prejudice or judgement, can achieve amazing things."
        },
        {
            "text": "Look at the amazing speed with which safe and highly effective coronavirus vaccines were developed as the pandemic took hold. A process often taking more than a decade was compressed into mere months."
        },
        {
            "text": "This channeling of effort was spurred, in part, by individuals and organisations setting differences aside and collaborating as never before to serve the common good. Many thousands of lives were saved as a result."
        },
        {
            "text": "International Women’s Day has chosen ‘break the bias’ as this year’s theme and while its relevance to recent events, at home and abroad, may not be immediately apparent, I believe we can all draw strength from its ideal in these worrying times."
        },
        {
            "text": "The official site asks us to “Imagine a gender equal world, a world free of bias, stereotypes, and discrimination, a world that is diverse, equitable, and inclusive. A world where difference is valued and celebrated.”"
        },
        {
            "text": "These words have a new and terrible relevance as we struggle to comprehend the senseless tragedy unfolding in Ukraine and Putin’s wilful distortion of the truth to sow division, discord and intolerance among those who do not share his world view."
        },
        {
            "heading": 2,
            "text": "The inequality of conflict"
        },
        {
            "text": "As is so often the case in times of conflict, it is women who bear the disproportionate brunt of this unwanted disruption to our lives. It is they who struggle to keep families safe and relationships strong as many men depart to defend their country."
        },
        {
            "text": "I’m not just talking about Ukrainian women either. You will have seen on the news the amazing kindness of women (and families in general) in neighbouring countries like Poland, offering their homes as safe havens to those fleeing the conflict. In these situations, there is no bias, criteria or hidden agenda, just heartfelt expressions of compassion and the recognition of a universal truth: we are all human and we all need help sometimes."
        },
        {
            "text": "I feel particularly strong emotions for our Ukrainian care colleagues working in the UK (likely to be mainly women, given the longstanding gender bias in our sector), who will be so anxious about family, friends and loved ones back in Ukraine."
        },
        {
            "text": "Last week, I reached out to one of my ex colleagues, who is a care worker, to offer my support to her and her family and friends. She told me they are strong and resolute, which made me feel even more inadequate as this tragedy unfolds."
        },
        {
            "text": "I hope it is of some comfort to know that she and her fellow Ukrainians work in a supportive, accepting and compassionate workplace, where there is always someone to talk to when it all gets too much."
        },
        {
            "text": "International Women’s Day reminds us that, by celebrating our differences, we make ourselves stronger, even as others might wish us to fall apart. Whatever our gender, sexual orientation, ethnicity or beliefs, what unites us as women – as human beings – is our belief in a better world for everyone."
        }
    ]
}