{
    "url": "https://marinescience.blog.gov.uk/2022/03/08/launching-a-new-visual-tool-to-identify-shark-trunks-in-the-international-meat-trade/",
    "title": "Launching a new visual tool to identify shark trunks in the international meat trade",
    "authors": [
        "Joanna Murray"
    ],
    "categories": [
        "Vulnerable species"
    ],
    "pub_date": "2022-03-08T00:00:02+00:00",
    "content": [
        {
            "heading": 2,
            "text": "The first shark trunk visual identification guide is launched as part of a one stop toolkit for regulating trade in CITES-listed species"
        },
        {
            "text": "Warning: This blog contains images of sharks without fins or heads as part of a training exercise to identify species by their trunks. Some people may find this distressing."
        },
        {
            "text": "Indonesia is the world’s largest shark fishing nation and since 2015, there has been a dramatic increase in their export of shark meat products. As well as being available in processed form such as fillets, shark meat is also traded as whole-body trunks, which can be headless, finless or both. Officials tasked with verifying if trunks are a species of shark which is listed on the Convention of the International Trade in Endangered Species of Wild Fauna and Flora (CITES) voiced concerns about the lack of visual identification guides to support this challenging requirement during the opening phase of our Illegal Wildlife Trade Challenge Fund project."
        },
        {
            "text": "In response, the UK government (Defra) provided further support to the collaboration between Cefas and the Indonesian government to facilitate the production of the first visual guide for identifying the trunks of CITES-listed shark and ray species."
        },
        {
            "text": "This trunk guide is being launched as part of a three-guide series that covers whole animals, shark trunks and dried products such as shark fins and devil ray gill plates. The whole animal and product guides combine decades of previous work and have been developed as part of a global collaboration with governments, non-governmental organizations, and other partner and funding organizations (including the CITES Secretariat, the United Nations Food and Agriculture Organization (FAO), the European Union, the Pew Charitable Trusts, and Shark Conservation Fund). These guides simplify the training process for customs officials by covering all CITES listed species, and the major products in trade in one set of guides."
        },
        {
            "text": " "
        },
        {
            "text": "Dr. Rima Jabado, Founder, Elasmo Project and Chair, IUCN SSC Shark Specialist Group stated:"
        },
        {
            "text": " "
        },
        {
            "heading": 3,
            "text": "Developing and testing the guides"
        },
        {
            "text": "Before designing the guide, world leading shark experts and authors of the guides, Debra Abercrombie and Rima Jabado, travelled to Indonesia to understand firsthand the challenges of identifying shark trunks from Indonesian officials. During their visit they worked with local partners to collect high-resolution images of relevant species and their unique identifying features as the guide design process began."
        },
        {
            "text": "Once drafted, the trunk guide was shared with local officials in Indonesia for field testing and feedback on its practical use incorporated into later edits.  The guide and supporting training video are now a key element of the shark and ray trade management national training program and are already being used by officials in Indonesia to support the identification of CITES-listed species in the shark meat trade."
        },
        {
            "text": " "
        },
        {
            "text": "Dewa Gde Tri Bodhi Saputra, a Verification Officer from BPSPL Denpasar said about the trunk guide:"
        },
        {
            "text": " "
        },
        {
            "text": "During the next two weeks (7-11th March), Parties to CITES will be meeting in Lyon, France for the 74th Meeting of the Standing Committee. We have submitted this series of guides to CITES so that they can be hosted on their Shark and Ray Portal. We hope that in doing so, the work developed through this global partnership is freely and widely available and will support Parties who have international trade in sharks and rays ensure that their trade is well-regulated and sustainable."
        }
    ]
}