{
    "url": "https://insolvencyservice.blog.gov.uk/2022/03/08/our-womens-network-is-marking-international-womens-day-2022/",
    "title": "Our Women's Network is marking International Women's Day 2022",
    "authors": [
        "Agata Faro",
        "Jemma Harvey"
    ],
    "categories": [
        "Diversity",
        "Inclusion",
        "International Womens Day"
    ],
    "pub_date": "2022-03-08T09:09:31+00:00",
    "content": [
        {
            "text": "At the Insolvency Service, we offer our staff access to a variety of Diversity Networks. The networks serve as internal communities, providing personal connections, so our people feel valued and included."
        },
        {
            "text": "To celebrate International Women’s Day, the Women’s Network Group is hosting an online event with internal and external guest speakers. The theme for International Women’s Day this year is #BreaktheBias and the campaign asks you to cross your arms in solidarity to call out gender bias, discrimination, and stereotyping."
        },
        {
            "text": "In this blog, the Women’s Network Chair, Agata Faro, and network member, Jemma Harvey, talk about their experiences and beliefs, and how the Network will be marking the day with some events planned for its members."
        },
        {
            "heading": 2,
            "text": "Agata Faro, Lead, Women's Network"
        },
        {
            "text": "\"Despite some small challenges, I have a great life, full of love, respect, and happiness. I feel blessed to be a woman and I have 3 beautiful daughters."
        },
        {
            "text": "I am also, like some of you may be, one of those people who sometimes doubts themselves. I sometimes doubt whether I can achieve or try something new."
        },
        {
            "text": "But then I remember I am well educated, independent and can take care of myself, I am able to expand my options both professionally and personally  and on top of all that I too know how to use a screwdriver if need be!"
        },
        {
            "text": "I live a full life and I am happy to be a modern woman, free from restrictions, and if I need to cry my eyes out, I will do it without being judged."
        },
        {
            "text": "It's clear that the road to equality is still, unfortunately, a long and winding road that society needs to trudge. But I feel blessed to be a woman of today’s generation who can make a difference! So, I am crossing my arms in solidarity to call out gender bias, discrimination, and stereotyping. Together, we can forge women's equality.\""
        },
        {
            "heading": 2,
            "text": "Jemma Harvey, Women's Network steering group member"
        },
        {
            "text": "\"I’m at the age where my friends have started to get engaged, married, buy homes, and have children, while only last week I turned on the washing machine without a single item of laundry in it. So maybe I haven’t completely got to grips with 'adulting' yet. As I rapidly approach my thirties, I have learned to stop comparing my life to other people’s and start thinking about what I want from my life."
        },
        {
            "text": "As women, we have done things our grandmothers couldn’t imagine, achieved more than our mothers thought possible and had opportunities our sisters could only dream of. So much of our lives are unwritten and we are no longer covered by the glass ceiling that once governed how far we get in life."
        },
        {
            "text": "Every one of us is unique and extraordinary in our own way, so we should revel in our differences. Comparison is a waste of our time and we should celebrate ourselves more for who we are, rather than what we think we should be.\""
        },
        {
            "heading": 2,
            "text": "Our purpose and planned activities"
        },
        {
            "text": "The Women's Network Group is one of a number of Insolvency Service network groups that work together to promote diversity and inclusion in our workplace. The Women's Networking Group provides a great space to chat, space that our colleagues look forward to being in, with honest conversations, and shared experiences, where everyone can feel safe to share their stories."
        },
        {
            "text": "For International Women's Day 2022 the Women’s Network Group is holding an online event where several speakers will present throughout the morning. The celebrations will begin with a presentation by Advita Patel, the Managing Director of CommsRebel."
        },
        {
            "text": "We’ll then have a presentation from our own Rukhi Arshad who is the Chair of our Black, Asian and Minority Ethnic network 'FACES', and is a Senior Coordinator for the Official Receiver in Nottingham. Rukhi will share 5 things that define her as a British-born Pakistani woman."
        },
        {
            "text": "The event will close with some final thoughts from Dave Elliot, the Chair of the Men's Network, who is also an Ally of the Women's Network."
        },
        {
            "heading": 3,
            "text": "Further information"
        }
    ]
}