{
    "url": "https://charitycommission.blog.gov.uk/2022/03/08/regulating-charities-offering-complementary-and-alternative-medicine-therapies/",
    "title": "Regulating charities offering complementary and alternative medicine therapies",
    "authors": [
        "Helen Earner"
    ],
    "categories": [
        "Public benefit",
        "Registration",
        "Regulation",
        "Risk"
    ],
    "pub_date": "2022-03-08T13:49:46+00:00",
    "content": [
        {
            "text": "Today we published a summary of our case involving an organisation called Gerson Support Group, one of several cases we have opened examining the public benefit provided by charities offering complementary and alternative medicine (CAM) therapies. The organisation was set up to relieve sickness and to preserve and promote good health by providing support to cancer patients and to advance public education in the “Gerson nutritional therapy”."
        },
        {
            "text": "Gerson Support Group has been removed from the register of charities after we challenged whether it was able to fulfil the public benefit requirement."
        },
        {
            "text": "What are complementary alternative medicine therapies?"
        },
        {
            "text": "CAM therapies, which often fall outside of mainstream healthcare, include a diverse range of medicines and treatments, some of which are widely used, while others may be far less common."
        },
        {
            "text": "CAM organisations, which endorse the use of these therapies, are themselves diverse in the treatments and therapies they cover, and the nature of their work. Some claim reported health benefits that are contested by medical professions."
        },
        {
            "text": "Passing the public benefit test "
        },
        {
            "text": "What matters to us at the Commission is that all CAM organisations that have charitable status – and all charities generally – can demonstrate that they provide public benefit. That is a central principle enshrined in law."
        },
        {
            "text": "In 2018, we reviewed our approach to assessing the charitable status of CAM organisations. The review concluded that to satisfy the public benefit requirement and qualify for charitable status, an organisation that claims to offer a cure or treatment must provide objective scientific evidence."
        },
        {
            "text": "Those organisations promoting therapies to offer comfort and relief alongside conventional medical care may be able to rely on more subjective evidence, including patient testimonials, to demonstrate a tangible public benefit."
        },
        {
            "text": "This guidance is now helping to ensure that CAM organisations that cannot evidence their claims do not benefit from charitable status."
        },
        {
            "text": "We apply this guidance at the point of registration. In line with our regulatory and risk framework we also take steps to ensure that charities already on the register are able to show that they meet the requirements of charity status, such as in this instance."
        },
        {
            "text": "The Gerson Support Group case"
        },
        {
            "text": "In the case of Gerson Support Group, the Commission questioned the extent to which it was providing public benefit. The trustees themselves acknowledged that the evidence around Gerson nutritional therapy may not be sufficient to meet the public benefit requirement."
        },
        {
            "text": "We welcome the Gerson Support Group’s acceptance that the current evidence does not meet the Commission’s criteria for registration, and that they responded to this by winding up and coming off the register of charities."
        },
        {
            "text": "This case is a practical example of how we regulate charities that offer CAM therapies, and the work we do to promote and maintain the integrity of charitable status and public confidence in charities more broadly."
        },
        {
            "text": "What’s next "
        },
        {
            "text": "Our work scrutinising the activity of CAM organisations continues, and we encourage all CAM charities to consider the public benefit requirement and ensure that their own activities deliver clear public benefit."
        },
        {
            "text": "CAM charities’ work promoting alternative therapies for comfort and relief can deliver tangible public benefit to patients. There is a legitimate role for these organisations as part of our thriving charitable sector."
        },
        {
            "text": "We are conducting a number of other ongoing cases involving concerns about some CAM organisations. In some of these cases, our concerns may be resolved through dialogue with the trustees.  If our work reveals that an CAM organisation on the register cannot demonstrate public benefit, then we will take firm and robust action to remove it from the register."
        },
        {
            "text": "It is vital that we work in the public interest to uphold the integrity of the register, protect the special status of charities, and by extension promote public trust in charities."
        }
    ]
}