{
    "url": "https://mojdigital.blog.gov.uk/2022/03/08/whats-in-a-word/",
    "title": "What’s in a word?",
    "authors": [
        "Amie Alekna"
    ],
    "categories": [
        "International Women's Day"
    ],
    "pub_date": "2022-03-08T10:03:28+01:00",
    "content": [
        {
            "text": "Everything.  As society evolves over time, so do words and meaning. The world of Digital and Technology can be pretty baffling with lots of alienating technical jargon.  I’ve been working in the Digital and Technology world for the last four years and love it but have learned that once you manage to crack the code, it turns out that not all of that language is appropriate or acceptable in today's world.  "
        },
        {
            "text": "Why am I talking about this now?  There are a couple of reasons and I want to keep the conversations going.  It shouldn’t have taken the murder of George Floyd for there to be such a sharp focus on the deep-rooted inequality in our society, but it has, and we need to remember that. With it being International Women’s Day, it has made me reflect on the language we use and the different ways people of different genders interact, such as us rarely commenting on what men wear."
        },
        {
            "text": "I’ve become more aware of, witnessed, and been informed of, comments that are racially offensive however acceptable they appear to be on the surface. The word ‘mansplaining’ has entered our vocabulary - where typically a man explains something to a woman in a condescending way.  These situations make me feel uncomfortable and if I’m honest, I don’t always have the confidence to challenge them. "
        },
        {
            "text": "Words are not neutral - they can carry heavy meaning. I commit to challenging others who use inappropriate language, on purpose or inadvertently, and ensuring others feel able to challenge too and are supported when they do so."
        },
        {
            "text": "Language that has negative racial connotations must be challenged. Recognition of racism in language is an essential stepping stone to a coherent response in challenging abusive language.  An example is the phrase black listing - instead we should use unacceptable listing - which is a much clearer explanation for these lists.  It’s also important to understand the origin of words to understand why they are no longer acceptable. "
        },
        {
            "text": "We can all make a conscious effort to use words, phrases, terminology that promote inclusion and a progressive world view.  Things that I have done are continue the dialogue, discussion, and debate about language with my family (a particularly lively discussion) friends, and colleagues; and reading more widely with more diverse authors."
        },
        {
            "text": "So please, educate yourself about the language you are using and its origins, and explain to others if they use language that is inappropriate. That way, we can together create an environment where words are not the hidden tools of racism and sexism."
        }
    ]
}