{
    "url": "https://knowledgeasset.blog.gov.uk/2022/03/08/women-in-innovation/",
    "title": "Women in Innovation",
    "authors": [
        "Knowledge Assets Team",
        "Catherine Quinn",
        "Yupar Myint",
        "Dr Kirsty Hewitson"
    ],
    "categories": [
        "Department for Business Energy and Industrial Strategy",
        "Knowledge Transfer Network",
        "Maxwell Centre",
        "National Physical Laboratory (NPL)"
    ],
    "pub_date": "2022-03-08T10:47:48+00:00",
    "content": [
        {
            "text": "To mark this year’s National Women’s History Month and International Women's Day on 8th March, the Knowledge Assets team (KAT) is pleased to share a blog showcasing women working in innovation. KAT works very closely with women in senior positions within the public sector innovation community and university technology transfer offices. "
        },
        {
            "text": "In this article, Catherine Quinn (Non-executive Director at NPL), Yupar Myint (Head of Programme at the Maxwell Centre) and Dr Kirsty Hewitson (Director at the Knowledge Transfer Network (KTN)) (L-R) give their reflections on working in innovation and tips for women at the beginning of their careers in this field."
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": "KA Grant Fund"
        },
        {
            "text": "You may be aware that KAT recently administered the first round of the Knowledge Assets Grant Fund, which supports cutting edge technological innovations within the public sector. Please look out for a new blog in the coming days on the work of the Grant Fund to date."
        },
        {
            "text": "The Grant Fund Panel that oversaw these funding applications comprised individuals with investment expertise from across the public, private and university sector. Members of this this 8-strong panel included Catherine Quinn, Yupar Myint and Dr Kirsty Hewitson, all bringing different experience from their own careers and the sectors they have worked across. It was important to ensure there was diversity across panel members, as each member could bring along their own valuable insights to maximise our chances of success. KAT is grateful for the expert advice given during the development and management of the Grant Fund, as well as for the assistance offered to the to the applicants themselves to make the most of their projects and funding."
        },
        {
            "text": "Why is diversity and inclusion important for innovation?"
        },
        {
            "text": "Diversity and inclusion (D&I) principles are about respecting the unique needs, perspectives and potential of everyone and respecting people’s contributions equally. By incorporating wider perspectives when brainstorming and problem solving, we can avoid the formation of ‘groupthink’ – a psychological phenomenon that occurs within a group of people in which cohesiveness and the desire for harmony in the group results in a dysfunctional decision-making outcome. Ultimately, this can lead to a sub-optimal outcome and can affect the type of policies that are delivered to the public. D&I is not only essential for policymaking but can also be a key driver behind innovation."
        },
        {
            "text": "What does research show? The Harvard Business Review found from their analysis that diversity unlocked innovation and drove market growth, a finding which they felt should compel efforts to ensure senior ranking officials “embody and embrace the power of differences”. Similarly, McKinsey & Company analysed 1,000+ firms across 12 countries and found that executive teams in the top quartile for ethnic and cultural diversity were 33% more likely to outperform those in the bottom quartile. Finally, Boston Consulting Group (BCG) surveyed the innovative potential of 1,700 companies in eight countries and found that firms with above-average diversity produced a greater proportion of revenue from innovation (45% in total) than firms with below-average diversity (26%)."
        },
        {
            "text": "However, globally, women are underrepresented in the science, technology, engineering and maths (STEM) fields. Catherine Quinn, Yupar Myint and Dr Kirsty Hewitson have provided their reflections on their experiences of working in innovation below and advancing your career."
        },
        {
            "text": "Experiences as a woman in innovation"
        },
        {
            "text": "Yupar Myint: Innovators, like entrepreneurs, need a supportive environment to maintain and strengthen their innovative thinking, as well as the resources required to support the success of new growth opportunities. A positive attitude and encouragement are needed in fostering entrepreneurial mindsets and collaborative sprits within the innovation community, so that the cross-pollination of ideas, technologies and experiences from diverse disciplinaries and sectors can thrive in incubating new businesses."
        },
        {
            "text": "Kirsty Hewitson: I've been fortunate to work across a range of sectors including life sciences, energy and defence, with exposure to a vast array of technologies. But I’ve found that, irrespective of sector, the questions for technology translation remain the same - what is the market need, the market size, IP position, competition, time and cost to market etc. We should be focusing on technology pull, and not technology push."
        },
        {
            "text": "Catherine Quinn: My own experience of innovation was in no way deliberate or planned, but came about serendipitously through finding myself working at Oxford University in the early 1990s, when the University was just beginning to explore the opportunities to commercialise ideas emerging predominantly from the Sciences and Engineering. It was the days of Oxford's first major spin-out companies, when the process was handled through the office I began to work for in 1991, and long before the University's knowledge transfer firm really got going. It was a dynamic decade at Oxford, when the foundations for IP commercialisation were created, and it provided amazing opportunities for learning how academic knowledge could be translated for practical application and societal benefit. I ended up leading the service I had joined as a novice, and working in partnership with Isis Innovation (as it was back then - now Oxford University Innovation) - one of the most successful academic innovation companies in Europe. I want women to understand that experts in innovation develop through many and various complementary types of experiences. There is no single starting point for success. Thirty years later, and having decided to move to a portfolio career, my early experience of working in innovation has translated into some fascinating non-executive opportunities on the Boards of 'BEIS family' organisations such as The Met Office and The National Physical Laboratory; the Copyright Licensing Agency; and, most recently, CPI Ltd - Centre for Process Innovation (part of the Advanced Manufacturing Catapult)."
        },
        {
            "text": "Yupar Myint: It’s important to allow innovators to take risks and be proactive even in small projects – and to recognise this risk taking. Alongside this, by gaining experience, from both successes and failures, will help as evidence builds of entrepreneurial mindset, energy, ability to both spot opportunities and take tough commercial decisions. It is important that the innovators can access resources (including personal development opportunities) they need in creating new opportunities. From the idea creation followed by the commercialisation process, the heart of success is the innovator and the team. Give innovators the access to training opportunities where they can hone their skills, get them to work directly with entrepreneurs and tech investors who are used to evaluate disruptive innovations. The ability to create ideas which are deeply rooted in customer and market needs, clearly understand IP implications, the ability to articulate a commercial plan with financial and internal resources implications, are key areas of competence for success."
        },
        {
            "text": "Kirsty Hewitson: Working in innovation, the tech is of course an imperative – but the people and culture are also fundamentally important and we need to get this right in order to deliver the right results."
        },
        {
            "text": "Advancing your career as woman in innovation"
        },
        {
            "text": "Yupar Myint: I would suggest that women get a mentor who could give you independent guidance for personal and professional development. It is better that your mentor is not your direct supervisor or boss but you can find your mentor within or outside your organisation. You can have more than one mentor, someone with domain expertise and someone with personal coaching skills that meet your career ambitions. There are so many people out there willing to make their time to help and share experiences!"
        },
        {
            "text": "Catherine Quinn: I had an inspirational boss and mentor in my early career (June Clark, as she was then), who took me on and taught me everything I didn't know back then about negotiating research contracts, IP policy, licensing agreements, royalty deals and spinning out companies."
        },
        {
            "text": "Kirsty Hewitson: I agree. You should identify a mentor that will serve as a personal sounding board. And I’d recommend that you should try to develop a good network that spans sectors, skills, and experience that you can tap into when required."
        },
        {
            "text": "Yupar Myint: Of course; getting out and networking is important. Networking can sometimes be seen in a rather negative light by people who think it may be exploitative, superficial or just not their “thing”.  This is missing the point that among the resources needed to implement innovation is the knowledge, experience, expertise, energy, connections that people have in the wider environment. Networking is part of developing your social capital and constantly building relationships. Building your social capital is a subtle process, highly dependent on trust and reciprocity, takes time and is your lifetime asset."
        },
        {
            "text": "Catherine Quinn: I’d say to pay special attention to the sociology of innovation – i.e., as you said, build strong, positive relationships. Find experienced professionals who might specialise in different areas of expertise (how research is supported, what IP is, and how IP assets are protected, how licensing deals are made or how research-based companies are created and funded) - and learn from them."
        },
        {
            "text": "Yupar Myint: It is also good to build a network of advocates of your ability and track record. Get involved in new projects where you can learn and develop new skills. Build your personal credibility for being innovative and proactive in small projects. You need to be able to demonstrate track record of success, experience and learning from difficulties."
        },
        {
            "text": "Kirsty Hewitson: It’s good to be bold. Look for opportunities to learn and perhaps feel a bit outside of your comfort zone. Don't be scared of feedback - it doesn't always have to be \"good\" to ensure progress. As Yupar said, we learn from both success and failure."
        },
        {
            "text": "Catherine Quinn: Yes; experiment with your career. Take risks and find ways of learning about as many aspects of innovation as possible, building up a broad knowledge of how the moving parts fit together."
        },
        {
            "text": "Yupar Myint: Participate in the personal development courses offered by your organization. Use these courses to update your knowledge, skills and perhaps an opportunity to explore your passion in science, research, business for future career options."
        },
        {
            "text": "Catherine Quinn: You don't have to be a specialist to get going.  There will be time for that downstream. And understand that you don't have to be an entrepreneur, or a scientist or a patent attorney to have a fascinating career in innovation.  Learn as much as you can and apply it to working for organisations that interest you."
        },
        {
            "text": "Kirsty Hewitson: Recognise that change is inevitable and that you don't always have to be the expert. It’s also important to remember that most ideas and innovations will fail. But beware of imposter syndrome!"
        },
        {
            "text": "Backgrounds of the guest authors:"
        },
        {
            "text": "Catherine Quinn"
        },
        {
            "text": "For over 20 years, Catherine has worked in senior leadership roles that have crossed sectors, from research, science and technology, and higher education to professional services and national institutions.  She also recently served as Private Secretary to The Duchess of Cambridge in 2017, after having spent four years as Chief Operating Officer and Associate Dean at Oxford University's Saïd Business School. She also served in a non-executive capacity on the boards of several national institutions, including The Met Office, The Royal Household, The Charity Commission, and The Royal British Legion."
        },
        {
            "text": "Yupar Myint"
        },
        {
            "text": "Yupar Myint is Head of Entrepreneurship, Impulse for Tech Innovators at Maxwell Centre, University of Cambridge. She has more than 18 years of experiences in building up Entrepreneurship and Innovation Programmes. Impulse alumni - a programme she set up and now runs annually since 2017 have already raised £101 million of funding and their ventures support 392 new jobs. She has been involved in developing the IECT Hermann Hauser Summer School in Austria, and since 2015, serves as a programme director and mentor. Yupar was previously a Programme Director and Director of International Development where she led the Ignite programme at Cambridge Judge Business School for more than 11 years. During her leadership, Ignite has generated over 250 business ventures, more than £200 million in funding raised and approximately 4,300 jobs were created by its alumni."
        },
        {
            "text": "Dr Kirsty Hewitson"
        },
        {
            "text": "Dr Kirsty Hewitson is the Executive Director of Capability at KTN as well as Director and Executive Committee member of ‘Women in Nuclear UK’, who are driving gender equality across the nuclear sector. Before these positions, she held the position of VP Strategy and Innovation at the National Nuclear Laboratory (NNL) where she was responsible for identifying, translating and commercialising early-stage technology opportunities together with embedding a culture of innovation across the organisation. Additionally, Kirsty led the development of NNL’s four strategic themes that incorporated diverse targets areas from clean energy to nuclear medicine. Preceding NNL, she was also the Vice President of Life Sciences at Ploughshare Innovations – helping to convert defence and security innovations, from across the Ministry of Defence, into civilian applications."
        }
    ]
}