{
    "url": "https://foresightprojects.blog.gov.uk/2024/07/29/futures-on-the-fast-stream-how-futures-training-and-resources-influenced-my-work/",
    "title": "Futures on the Fast-Stream: how futures training and resources influenced my work",
    "authors": [
        "mikeaskew"
    ],
    "categories": [
        "Futures Capability & Resource"
    ],
    "pub_date": "2024-07-29T16:34:05+01:00",
    "content": [
        {
            "text": "By Jack Thirlwell, Migration Strategy Team Leader, Population and Migration Division, Directorate for Culture and External Affairs, Scottish Government"
        },
        {
            "text": "In this blog, Jack shares how learning about futures has supported his own development as a fast streamer, and how applying those tools and techniques contributed to successful policy outcomes. "
        },
        {
            "text": "I was introduced to futures thinking, and its importance within government policy and strategy development, via the Government Office for Science’s online futures masterclass course during my second year on the Civil Service Fast Stream. The course offered a blended approach to learning, including video interviews, articles, and long-read case studies, as well as discussion forums for learners to reflect on particular topics and contribute their own ideas. I was really impressed by the breadth and depth of the learning on offer and the array of examples from the UK Civil Service, international governments, and non-governmental organisations around the world. "
        },
        {
            "text": "Learning about the importance of developing responsible government, with an eye on solving not only the issues of today but also those we are likely to face in the medium to long-term, really struck a chord with me. Upon completing the course, I was eager to ensure that my own work reflected this longer-term strategic outlook.   "
        },
        {
            "text": "I was grateful for my introduction to futures when starting my final Fast Stream posting, working for the Scottish Government as a Policy Officer on its proposed Wellbeing and Sustainable Development Bill. The aim of the Bill was to make improvements to the effectiveness of decision-making by ensuring that all policy and delivery activity undertaken by public bodies in Scotland is focused on improving the wellbeing of people living in Scotland, not only now but also in the future. Amongst other suggested measures, the Bill advocated for the creation of a ‘Future Generations Commissioner’ within the Scottish Government, who, acting on behalf of future generations, would be empowered to hold public bodies, including Ministers, to account."
        },
        {
            "text": "The role of Future Generations Commissioner was pioneered and introduced by the Welsh Government, something I’d come across as a case study during my futures training. It was exciting to collaborate with those involved developing the Well-Being of Future Generations (Wales) Act and explore whether similar measures would suit Scotland’s unique social, political, economic and cultural circumstances."
        },
        {
            "text": "My basic grounding in futures enabled me to understand, develop, and articulate the policy ambitions proposed in the Wellbeing and Sustainable Development Bill, and I enjoyed being able to share various examples from the course with colleagues during our policy-development activity.  "
        },
        {
            "text": "I was also introduced to colleagues within the Strategic Insights Unit (SIU) while working in this role. This is a team of analysts and policy professionals who use futures tools and techniques to work collaboratively with policy colleagues to investigate topics likely to be of importance to Scotland in the future. The team uses literature, data and expert opinion to understand implications specific to Scotland and to develop insights into how we can strengthen current policy to shape the future and be ready for future challenges and opportunities. I’m delighted to see futures thinking being used in government, and I hope that moving forward, all key policy teams work together with futures analysts. The SIU has recently restructured to create a new Foresight and Capability Unit, who hold responsibility for Futures activity for Scottish Government. "
        },
        {
            "text": "I have now completed the Fast Stream and am beginning in a new permanent role, working on Migration Strategy in Scotland. I know that I’ll do my utmost to ensure I adopt a futures perspective when considering strategies, and will encourage collaborative working with Futures experts, including the Scottish Government’s Foresight and Capability unit. "
        },
        {
            "text": "Finally, I’d recommend everyone who reads this blog download and read the GO-SCIENCE Trend Deck, which handily provides one-page analyses of various social, economic, and demographic trends affecting the UK, often showing surprising and myth-busting insight into the way our futures may look. "
        },
        {
            "text": "To learn more about UK government futures work, see: https://www.gov.uk/government/groups/futures-and-foresight. "
        }
    ]
}