{
    "url": "https://educationhub.blog.gov.uk/2024/07/teacher-pay-everything-you-need-to-know-about-the-2024-pay-award/",
    "title": "Teacher pay: everything you need to know about the 2024 pay award",
    "authors": [
        "mediaofficer"
    ],
    "categories": [
        "Breaking news",
        "Schools",
        "Teacher pay"
    ],
    "pub_date": "2024-07-29T16:53:20+01:00",
    "content": [
        {
            "text": "The Education Secretary has accepted the recommendations of the School Teachers’ Review Body (STRB) and confirmed the teacher pay award for 2024-25, setting out what school teachers in England can expect to be paid next academic year."
        },
        {
            "text": "The STRB is an independent group that makes recommendations on the pay of teachers in maintained schools in England and reports to the Secretary of State for Education and the Prime Minister."
        },
        {
            "text": "Each year the STRB recommends a pay award based on different factors including the economy, school workforce data and evidence from organisations including the DfE, and the teaching unions."
        },
        {
            "text": "The government then considers the recommendations in depth and makes a decision on what pay award teachers receive for the coming year."
        },
        {
            "text": "Here’s everything you need to know about teacher pay."
        },
        {
            "heading": 3,
            "text": "Are teachers getting a pay rise this year?"
        },
        {
            "text": "The STRB recommended a pay award of 5.5% and this has been accepted in full by the Education Secretary, reflecting the vital contribution teachers make to children’s life chances."
        },
        {
            "text": "The 5.5% award would see pay packets increase by over £2,500 for the average classroom teacher, which would take the median salary for 2024/25 to over £49,000 a year."
        },
        {
            "heading": 3,
            "text": "Will teachers at all schools receive the pay award?"
        },
        {
            "text": "The pay award applies to maintained schools, with academies continuing to have freedom over their pay and conditions."
        },
        {
            "text": "However, in practice most academies follow the recommendations of the STRB."
        },
        {
            "heading": 3,
            "text": "Is the pay award fully funded?"
        },
        {
            "text": "Yes. Schools will receive £1.1 billion in additional funding to cover their overall costs in financial year 2024-25, including fully funding the pay award for teachers at a national level."
        },
        {
            "text": "This matches what we have calculated is needed to fully fund the teacher pay award and the support staff pay offer, at the national level, on top of the available headroom in schools’ existing budgets."
        },
        {
            "text": "We are also providing an additional £97 million for schools delivering post-16 education (£63 million) and early years (£34 million) provision."
        },
        {
            "text": "Taken together, this is an increase of almost £1.2 billion."
        },
        {
            "text": "The pay award impacts both financial years 2024-25 and 2025-26. This additional funding only covers the financial year 2024-25 portion of the award. We will take into account the impact of the full year's costs of the teacher pay award on schools when considering 2025-26 budgets, which are yet to be agreed."
        },
        {
            "heading": 3,
            "text": "When will teachers receive their pay rise?"
        },
        {
            "text": "Teachers will start receiving their new salary in the autumn, after a new pay order is laid in Parliament and comes into force."
        },
        {
            "text": "Pay will be backdated to 1 September 2024."
        },
        {
            "heading": 3,
            "text": "Will school support staff get a pay rise?"
        },
        {
            "text": "The teacher pay award only applies to school teachers, but the additional funding schools will receive also ensures schools are, at a national level, covered for the current 2024-25 pay offer for support staff, which is currently under negotiation."
        },
        {
            "text": "Unlike teachers, most school support staff are currently employed on the pay and conditions of the National Joint Council (NJC) for Local Government Services. The NJC is a negotiating body made up of representatives from trade unions and local government employers."
        },
        {
            "text": "We are committed to reinstating the School Support Staff Negotiating Body to give support staff like teaching assistants, caretakers and cleaners a stronger voice in government. The body will be tasked with establishing a national terms and conditions handbook, training, career progression routes, and fair pay rates for support staff."
        },
        {
            "heading": 3,
            "text": "What else are you doing to ensure teaching is an attractive profession?"
        },
        {
            "text": "Alongside the pay award, we have also announced that from September, schools will no longer be required to use the Performance Related Pay (PRP) system, which can lead to schools and teachers going through an overly bureaucratic process to agree individual teachers’ pay rises. This will help improve teacher workload."
        },
        {
            "text": "We will also clarify that teachers can carry out their planning time at home, improving flexible working for staff."
        }
    ]
}