{
    "url": "https://ukhodigital.blog.gov.uk/2024/07/29/the-vital-role-of-hydrography-for-maritime-safety-efficiency-and-sustainability/",
    "title": "The vital role of hydrography for maritime safety, efficiency and sustainability",
    "authors": [
        "Rear Admiral Angus Essenhigh OBE"
    ],
    "categories": [
        "Navigation",
        "UKHO"
    ],
    "pub_date": "2024-07-29T09:00:51+01:00",
    "content": [
        {
            "text": "Rear Admiral Angus Essenhigh OBE, the National Hydrographer and Director of Data Acquisition and Defence at the UK Hydrographic Office (UKHO), shares his insights to mark World Hydrography Day, which took place on 21 June, celebrating the vital role of hydrography in ensuring maritime safety, efficiency and sustainability."
        },
        {
            "heading": 2,
            "text": "Celebrating the importance of hydrography"
        },
        {
            "text": "The global hydrographic community is indeed a community. Our achievements result from our collaboration, and we will only realise our future ambitions through working together. World Hydrography Day is a wonderful opportunity to remind ourselves – and others – of the significance of our collaborative work."
        },
        {
            "text": "Hydrography plays a vital role within the wider maritime family in the UK and globally. Much of the collaborative work done by the International Maritime Organization (IMO), International Hydrographic Organization (IHO), the UKHO and other partners often goes unnoticed. Still, it is crucial for ensuring the safety of life at sea, supporting safe navigation and protecting our oceans."
        },
        {
            "heading": 3,
            "text": "Advancing with S-100 data standards"
        },
        {
            "text": "The UKHO is involved in developing and implementing the IHO's new S-100 data standard-based datasets and products, including S-101 ENCs, S-102 bathymetric surface data, S-104 water level information and S-111 surface currents. We have conducted successful S-100 sea trials with the Port of London Authority and have scheduled more trials with the Port of Milford Haven and the Port of Southampton. Recently, I also visited our counterparts in South Korea and witnessed firsthand their S-100 development lab, which is a tremendous example of their innovation and their openness to collaboration."
        },
        {
            "heading": 3,
            "text": "Investing in innovation"
        },
        {
            "text": "As the Director of Data Acquisition, a crucial part of my role is to oversee the diverse sources from which hydrographic data arrives. "
        },
        {
            "text": "Whether collected directly by us, by commercial partners or licensed from fellow hydrographic offices, and whether using traditional surveying techniques or more innovative technologies, data sharing is fundamental to our community."
        },
        {
            "text": "We are committed to investing in innovative tools and solutions for marine data insights. A prime example is our ADMIRALTY Digital Sailing Directions, a user-friendly digital version of our traditional Sailing Directions. We have also invested in Digital Twin technology, developing a port familiarisation product that creates an immersive visualisation of port entry and exit scenarios."
        },
        {
            "heading": 3,
            "text": "Future of navigation"
        },
        {
            "text": "The future of navigation is digital. We support end users through this digital transformation, especially smaller vessels and those below the international regulation threshold still reliant on paper charts. We are also developing an Electronic Chart System (ECS) solution for sub-ECDIS vessels, an initiative that will open the benefits of digital navigation to a wider range of users."
        },
        {
            "text": "Marine data is crucial across various maritime initiatives. It ensures safety and security, unlock"
        },
        {
            "text": "s new efficiencies in seaborne trade and supports sustainability commitments, including the decarbonisation goals of the IMO and partner organisations. High-quality marine data is essential for delivering carbon-efficient voyages and port operations."
        },
        {
            "text": "This is a challenging yet transformative time. Technological advances and a spirit of innovation, combined with our collaborative approach, will help us navigate this era of change and unlock new possibilities and higher ambitions."
        },
        {
            "text": "This year's theme for World Hydrography Day was \"for safer, more efficient, and sustainable marine activities\". It serves to both unite and challenge the hydrographic community. We must continue to explore how hydrography can enhance maritime safety, efficiency and sustainability. By working together, we can find the answers."
        },
        {
            "text": "Learn more about our work to raise hydrography's importance in our news article: Celebrating World Hydrography Day 2024."
        }
    ]
}