{
    "url": "https://ipo.blog.gov.uk/2023/10/04/dyslexia-its-a-different-way-of-thinking/",
    "title": "Dyslexia – it's a different way of thinking",
    "authors": [
        "Paula Davy"
    ],
    "categories": [
        "Environment",
        "Inclusion and diversity",
        "Innovation",
        "IPO",
        "Patents",
        "Recruitment",
        "STEM career"
    ],
    "pub_date": "2023-10-04T14:43:27+01:00",
    "content": [
        {
            "text": "The Intellectual Property Office (IPO) has recently been proud to achieve the British Dyslexia Association SMART award, in recognition of good practice when supporting the needs of dyslexic and neuro-diverse individuals.  Here we take a look at how colleagues with dyslexia are able to contribute positively to life and work at the IPO through their 'different way of thinking'. "
        },
        {
            "text": "All around the IPO, dyslexic and neuro-diverse colleagues are using their alternative ways of thinking to bring their different perspectives to work, to the benefit of the business, our colleagues and customers. They include: "
        },
        {
            "text": "The chair of the IPO’s neurodiversity staff network told me: "
        },
        {
            "text": "How does the IPO benefit from different ways of thinking? "
        },
        {
            "text": "To find out more about living and working with dyslexia, one of our Senior Patent Examiners was kind enough to give us some insight into their own experience. A mechanical engineer by training, they are responsible for examining patent applications for pumps and turbines at the IPO. While this has brought about its own challenges, they told us how, in their role as an examiner, having dyslexia isn’t necessarily the disadvantage some may believe. "
        },
        {
            "text": "When were you first diagnosed with dyslexia? "
        },
        {
            "text": "“I was assessed as dyslexic when I was about 10, due to the most common problems associated with dyslexia - poor reading and difficulty spelling. However, these are not so much problems as challenges – they are really only symptoms of the dyslexic brain thinking in a different way.  "
        },
        {
            "text": "One of the advantages is that people with dyslexia are more likely to have highly developed ‘spatial mechanical thinking’ than non-dyslexic people (although this by no means is unique to people with dyslexia).  "
        },
        {
            "text": "This spatial ability is a way of thinking where you can ‘see’ complex problems or systems in multiple dimensions in your mind. This makes it easy to understand the inter-relationships between different components of the system/problem, and how changes to one part of the system will have a knock-on effect throughout the rest of the system. "
        },
        {
            "text": "This way of thinking can be correlated positively with the likeliness of dyslexic people having higher performances in STEM (Science, Technology, Engineering, Mathematics) areas.  "
        },
        {
            "text": "What part does dyslexia play in your role as a patent examiner? "
        },
        {
            "text": "A large part of a patent examiner’s work involves searching for earlier documents which have already disclosed the invention. The dyslexic’s way of thinking can help an examiner to ‘think outside the box’ to find effective ways of searching. The ability to visualise 3-dimensional objects from 2-dimensional drawings can help with quickly identifying the most relevant documents, too. "
        },
        {
            "text": "A patent examiner’s job doesn’t just involve applying the law blanket fashion, irrespective of the situation. The aim is to work together with the applicant or their attorney to grant a valid patent as efficiently as possible.  "
        },
        {
            "text": "However, the challenge with thinking in multiple dimensions comes when I am trying to convert all the ideas and interrelationships into speech or writing, which is fundamentally only a single dimension. "
        },
        {
            "text": "How do I decide what order to express my thoughts in when I can see that to properly explain point A, I must first explain point B, which in turn needs points C, D, and E explaining - but before any of these can be explained I really need to have mentioned something specific from A?"
        },
        {
            "text": "Thankfully, I find communication gets a bit easier with repetition. After 15 years as an examiner, I have had plenty of practice writing common objections, and many of the pieces of case law provide a test which forms a helpful structure for your writing. But when I need to write in a style I don’t usually use (like writing this blog post), I slow right down and often end up rewriting the same thing numerous times in the quest for the perfect way to express what I am thinking.”"
        },
        {
            "text": "So, thank you to our Senior Patent Examiner for such frank and positive insight into the power of thinking differently. "
        },
        {
            "text": "It isn’t just patent examining that can benefit from diverse ways of thinking - to read more about the work the IPO has been doing towards its aim of becoming a truly inclusive employer, take a look at our Inclusion and Diversity report for 2022-23. "
        }
    ]
}