{
    "url": "https://charitycommission.blog.gov.uk/2023/10/04/from-our-social-media-manager-to-yours-why-implement-a-social-media-policy/",
    "title": "From our social media manager to yours: why implement a social media policy?",
    "authors": [
        "Emma Leeson – Digital Engagement Manager"
    ],
    "categories": [
        "Governance",
        "Guidance",
        "Risk"
    ],
    "pub_date": "2023-10-04T14:42:06+01:00",
    "content": [
        {
            "text": "New guidance published by the Charity Commission makes it clear that charities who use social media should have a policy in place and ensure that it’s followed."
        },
        {
            "text": "But, when you’re busy in the day-to-day (creating and scheduling posts, researching new content ideas, keeping up with the news, monitoring engagement and responding to comments, to name a few!) it might be tempting to view creating a social media policy as unwelcome admin."
        },
        {
            "text": "However, a social media policy is an important tool to help organisations ensure proper oversight, manage risks and address problems swiftly if they occur."
        },
        {
            "text": "But beyond these essentials that charity trustees need to consider, our in-house social media team share their views on the wider benefits a well formulated policy can have for those managing your channels and communications."
        },
        {
            "heading": 4,
            "text": "Less stress"
        },
        {
            "text": "Have you ever hit ‘post’ only for doubts to immediately creep in?"
        },
        {
            "text": "That anxiety when waiting to see how your audience responds is a feeling most of our team and other social media professionals we’ve worked with can relate to."
        },
        {
            "text": "For all its benefits, using social media can occasionally be a bit nerve-wracking, particularly if you are engaging on sensitive or emotive issues. The speed and ease at which you can potentially reach hundreds or thousands of people is a fantastic benefit of using social media, but it does up the stakes."
        },
        {
            "text": "Whether you’re part of a large team, or you’re handling the day-to-day management of your charity’s social media accounts solo, it’s not something you will want to (or should) shoulder responsibility for alone."
        },
        {
            "text": "Having a social media policy can take out much of the individual guesswork. By starting from agreed guidelines and making clear what it is you want to achieve when posting online, it can empower you or your team to post and share content, confident it’s right for your organisation and its purposes."
        },
        {
            "heading": 4,
            "text": "Seizing opportunities"
        },
        {
            "text": "Social media moves fast and a lot of what we do can feel reactive – whether that’s tapping into a trending hashtag to amplify your reach or responding to criticism."
        },
        {
            "text": "But it is possible to plan ahead so you can put yourself in the best position to respond quickly and effectively to situations as they unfold. For example, even simply deciding in advance who needs to be involved with, or authorise, certain types of content can save invaluable time and reduce the risk of slipping up."
        },
        {
            "text": "Mostly, social media policies will be concerned with risks and preparing for what to do if things go wrong. But the same principles apply when preparing yourself to make the most of opportunities as they present themselves."
        },
        {
            "heading": 4,
            "text": "Do what you do better"
        },
        {
            "text": "If your charity has a well-established social media presence, you or your team will no doubt already have your own internal processes and ways of working that you follow based on the knowledge you’ve accumulated in the role."
        },
        {
            "text": "However, our team feel it’s important to occasionally take a step back from the daily outputs, in order to consider whether you’re making the most of social media to achieve your organisation’s goals – looking beyond the number of likes and impressions."
        },
        {
            "text": "The process of getting what you do and want to achieve written down in a policy can help you achieve this and shape the development of your communication strategies."
        },
        {
            "text": "And as you don’t create social media content in a vacuum (we work with teams across the Commission to understand key priorities, develop content ideas and ensure our messaging is consistent) it can be used to help others in your organisation better understand your work and facilitate wider conversations around working effectively together."
        },
        {
            "text": "It can also help save you time in the long run - whether it’s using your policy to quickly bring a new recruit up to speed or by providing context to a senior employee you’re looking to support or review your work."
        },
        {
            "heading": 4,
            "text": "Next steps"
        },
        {
            "text": "While our new guidance is primarily aimed at trustees, it’s also useful if you use or manage any of your charity’s social media accounts. Plus, you’ll bring important knowledge and experience to help develop and implement a policy that is right for your charity."
        },
        {
            "text": "Not everyone in your charity will have the same level of understanding around using social media and our casework has revealed a knowledge gap, with trustees not always being aware of the risks that can arise."
        },
        {
            "text": "Our guidance and easy-to-use checklist will help trustees and other senior individuals within your charity have informed conversations about what your policy needs to cover."
        },
        {
            "text": " "
        }
    ]
}