{
    "url": "https://buyingforschools.blog.gov.uk/2023/10/04/how-can-school-resource-management-advisers-srmas-help-you/",
    "title": "How can School Resource Management Advisers (SRMAs) help you?",
    "authors": [
        "Lindsey Roberts, Engagement and Outreach Coordinator"
    ],
    "categories": [
        "Services"
    ],
    "pub_date": "2023-10-04T14:02:36+01:00",
    "content": [
        {
            "text": "Lindsey Roberts is an Engagement and Outreach Coordinator in the School Resource Management team at the Department for Education (DfE). In this blog post, Lindsey explains how the DfE's School Resource Management Adviser (SRMA) programme can support you with managing your school or academy trust’s finances or resources."
        },
        {
            "text": "What is the School Resource Management Adviser (SRMA) programme?"
        },
        {
            "text": "The SRMA programme provides free, independent and tailored advice and support from experts in this field."
        },
        {
            "text": "The programme is open to all local authorities, maintained schools, and academy trusts that would welcome peer-to-peer advice and support, whatever your financial position."
        },
        {
            "text": "Why would I request an SRMA? "
        },
        {
            "text": "SRMAs are independent advisers who have significant experience of school or academy trust business management and have undergone a challenging accreditation process. SRMAs may be practicing school or academy trust business managers, school leaders, or consultants working for themselves or for an education consultancy organisation."
        },
        {
            "text": "Your SRMA’s skills and experience will be matched to your specific context. SRMAs work with schools, academy trusts and local authorities across all types of educational settings with a range of different needs, in all financial circumstances."
        },
        {
            "text": "SRMAs can provide assurance that your current approach to managing school or trust resources is the most effective or give advice if you would like to make improvements. They can also help you with specific areas, for example, with procurement, digital needs and services, and managing your estate."
        },
        {
            "text": "SRMAs are not inspectors, they work with you and your school or trust to help you get the best outcomes for your pupils. After the SRMA visit has taken place, you own the report and it is up you to decide which, if any, of the SRMA's recommendations you would like to embed in your school resource management practice."
        },
        {
            "text": "What should I expect from an SRMA visit?"
        },
        {
            "text": "SRMA visits usually last between 1 and 3 days depending on the needs of your setting and can be planned for dates and times to suit you. These can be on consecutive days or spread over a longer period."
        },
        {
            "text": "Through supportive, peer-to-peer conversations they give advice that is tailored to your school, local authority or academy trust. Following the visit, the SRMA will produce a report that is quality assured by the department before being handed over to you."
        },
        {
            "text": "What areas of my school or trust finances will the SRMA look at?"
        },
        {
            "text": "The SRMA will look at all areas of your resources based on your organisation’s needs, focusing on areas like financial governance, looking at:"
        },
        {
            "text": "The SRMA programme also offers flexibility with the type of SRMA visit you can request. You can choose from either a comprehensive review, or more focused support which looks at one or two specific areas."
        },
        {
            "text": "What else do you offer? "
        },
        {
            "text": "Recently, we introduced Chief Financial Officer (CFO) and Chief Operating Officer (COO) mentoring to the SRMA programme, which offers school and academy CFOs or COOs a unique and cost-free opportunity to further develop their skills and knowledge via a one-to-one mentoring programme. Places on this programme are limited, for more information contact the SRMA team."
        },
        {
            "text": "How do I find out more or request an SRMA visit?"
        },
        {
            "text": "You can find more information about the programme at the SRMA page on GOV.UK. To request a visit email the team at ESFA.SRMA@education.gov.uk."
        },
        {
            "text": "Want to hear from school or trust leaders about their experience of having an SRMA? "
        },
        {
            "text": "Watch the latest video case study below and visit the SRM case studies collection page on GOV.UK."
        }
    ]
}