{
    "url": "https://teaching.blog.gov.uk/2023/10/04/how-the-national-tutoring-programme-improves-confidence-knowledge-and-skills/",
    "title": "How the National Tutoring Programme improves confidence, knowledge and skills",
    "authors": [
        "Victoria Owen"
    ],
    "categories": [
        "Inspiring teachers",
        "Pupil wellbeing and behaviour",
        "School funding",
        "Teachers' reflections"
    ],
    "pub_date": "2023-10-04T09:15:59+01:00",
    "content": [
        {
            "text": "Hear from Victoria Owen, the assistant vice principal at Maltby Academy as she shares with us how they are using the National Tutoring Programme (NTP). "
        },
        {
            "text": "Why have you decided to use the National Tutoring Programme?"
        },
        {
            "text": "We want to maximise opportunities for students. For us, this was targeted at our year 11 cohort, with a view to ensuring students reach their potential and we increase life chances by supporting them to achieve the best possible exam grades."
        },
        {
            "text": "We decided to use the school-led tutoring route because we found our students respond better to subject specialists who they already have relationships with. This approach allowed class teachers and subject leaders to develop lessons, and specific interventions, using up-to-date assessment data from examinations for each of the students."
        },
        {
            "text": "How do you select the pupils that would benefit from tutoring?"
        },
        {
            "text": "We identified students who needed tuition through a tracking system. Pupil premium students are considered for tutoring first and we engage parents from the beginning of the process. We advise parents that tutoring will be offered to selected students. Following this, parents and carers are required to consent to their child’s involvement via a Microsoft form. Parental engagement has been vital in the success of tutoring. Pleasingly we have had parents and carers requesting tutoring in additional subjects for their child or even asking for their child to be included in tutoring sessions."
        },
        {
            "text": "How do you schedule tutoring?"
        },
        {
            "text": "Tutoring sessions are held via Microsoft Teams four evenings a week in term time, from 4.30-5.30pm and then from 5.45-6.45pm. We chose online tutoring after school rather than during the school day, as this means additional hours and exposure to subject specialists, rather than taking students out of one subject to access tutoring in another."
        },
        {
            "text": "How do you track and monitor the impact of tutoring on your pupils?"
        },
        {
            "text": "To maximise the impact of tutoring, we monitor data, including student progress and exam results, along with their attitude towards receiving support. This has indicated when it would be appropriate for students to begin tutoring, or change subjects, depending on their needs."
        },
        {
            "text": "What has been the impact of tutoring?"
        },
        {
            "text": "We recognise the impact of tutoring on the school. It has improved the investment in learning of students and increased their confidence. We are seeing the benefits of tuition on the students as their skills and knowledge have improved. Some are so enthusiastic that they want to access tutoring in other subjects."
        },
        {
            "text": "It has been particularly pleasing to see how well students have invested in tutoring, with many students accessing 2 to 3 hours per week. Without a doubt, confidence, as well as knowledge and skills, has improved. We have a reserve list for tutoring places now - students are seeing the benefits in one subject and wanting to access tutoring in another subject, or they have heard about how well their peers are getting on and so want to be involved."
        },
        {
            "text": "Would you recommend the NTP to others? "
        },
        {
            "text": "Yes, absolutely – it has been an excellent opportunity for us to provide students with additional support, giving them opportunities to consolidate knowledge, access high quality guided writing from subject specialists, and receive immediate feedback."
        },
        {
            "text": "We would recommend keeping groups at small numbers, driving the offer with students and parents – by selling the ‘why’ with absolute clarity - and being relentless in ensuring every student attends every session offered to them."
        },
        {
            "text": "Read our Guide to Tutoring or view the NTP guidance for schools"
        }
    ]
}