{
    "url": "https://insideDIO.blog.gov.uk/2023/10/04/leopards-and-more-monitoring-rare-wildlife-in-bruneis-jungle-training-area/",
    "title": "Leopards and more: monitoring rare wildlife in Brunei’s jungle training area",
    "authors": [
        "Duncan Savage"
    ],
    "categories": [
        "Biodiversity",
        "Conservation",
        "Defence Training Estate (DTE)",
        "DIO Brunei",
        "Military Training",
        "Wildlife"
    ],
    "pub_date": "2023-10-04T15:57:34+00:00",
    "content": [
        {
            "text": "One of the animals spotted by the cameras - a pig-tailed macaque. [Copyright Universiti Brunei Darussalam)One interesting element of my job recently has been a study we’ve been working on in British Forces Brunei (BFB)’s jungle training areas to monitor whether training has any impact on the local wildlife. We’ve been working with the Brunei Forestry Department, and the University of Brunei Darussalam (UBD), led by Drs Salwa Khalid and Ulmar Grafe."
        },
        {
            "text": "The DIO Conservation Stewardship Fund financed motion sensor video cameras and BFB granted the university access and logistical support to the training areas, where we operate under agreement with the Forestry Department. UBD’s experienced camera trapping team and their expertise in Bruneian wildlife has been invaluable in distributing the cameras to the best effect."
        },
        {
            "heading": 2,
            "text": "Purpose of the project"
        },
        {
            "text": "Jungle fauna can be very difficult to spot in normal conditions, so the rationale was to use the cameras to better understand what our Jungle Warfare Division students are sharing the forest with, and to inform our environmental management practices. On top of that, many of the BFB team were very enthusiastic about the project, so there is an additional benefit for engaging them in conservation. The increased access has also helped increase the scope of the UBD’s long-term mammal distribution mapping project throughout Brunei."
        },
        {
            "text": "Brunei is far removed from any other MOD site, so we were hopeful this would be an opportunity to shine a light on some lesser-known species. Early results have not disappointed, with 30 medium to large mammals detected, representing 86% of the species that might be expected to occur. Most notable is the occurrence of the clouded leopard, and four endangered or critically endangered mammals: the Sunda pangolin, north Borneo gibbon, otter civet, and flat-headed cat. In addition, there were multiple sightings of a rare endemic bird, the Bornean ground cuckoo."
        },
        {
            "heading": 2,
            "text": "Conclusions"
        },
        {
            "text": "Dr Grafe has advised that from these findings and a preliminary evaluation, we can confirm that the training areas harbour a highly significant proportion of the medium to large sized mammal fauna found on the island of Borneo, including many endangered or critically endangered species. In common with findings in a similar project we run in Belize with our charity partners Panthera, it appears that the military training activity has not negatively impacted these mammals on either a long-term and short-term basis. In fact, it appears that military training provides a high degree of protection from wildlife poaching and that the training areas are of very high conservation value. The greatest threats to wildlife are likely to come from outside the boundaries of the military training area."
        },
        {
            "text": "The project represents a really successful use of the DIO Conservation Stewardship Fund, in expanding our knowledge of the estate, and also working with local partners to fulfil our host nation conservation objectives."
        }
    ]
}