{
    "url": "https://openpolicy.blog.gov.uk/2023/10/04/people-centred-policy-design-free-five-part-course-now-live-on-futurelearn/",
    "title": "People-Centred Policy Design: free five-part course now live on FutureLearn",
    "authors": [
        "prateekbuch",
        "diyamitra"
    ],
    "categories": [
        "Policy Lab"
    ],
    "pub_date": "2023-10-04T15:57:36+01:00",
    "content": [
        {
            "text": "Policy Lab and the Policy Profession have launched a new, free five-part course called People-Centred Policy Design, on FutureLearn. The course will help policy makers apply innovative, people-centred tools and methods. "
        },
        {
            "text": "This course is for policy makers interested in integrating people’s lived experience into policy design and who would like to learn about how film ethnography, co-design or speculative design and serious games can help improve policy outcomes. "
        },
        {
            "text": "From next practice towards best practice "
        },
        {
            "text": "As part of Policy Lab’s mission to radically improve policy, we have collaborated with teams across government and the wider public sector, to put diverse voices and perspectives at the heart of policy.  "
        },
        {
            "text": "Through more than 200 projects across nine years, Policy Lab has explored ‘next practice,’ introducing a range of tools and methods into the policy making system.  "
        },
        {
            "text": "The People-Centred Policy Design course was developed in partnership with the Policy Profession, in order to share what it is like for civil servants, methods experts, and members of the public to explore next practice in policy making. As stewards of the Policy Profession Standards, the profession supports more than 30,000 policy makers across the UK Civil Service to continuously improve how policy is developed and delivered. This includes involving those affected by policies in their design and those whose voices may have been marginalised.  "
        },
        {
            "text": "This new free course is aimed at all public servants who contribute to policy, whether as a formal part of the profession or in other ways through its design, delivery and evaluation. Completing the course and applying the featured tools, methods and mindsets will help policy makers bring diverse voices and perspectives into policy development, which is a vital skill for everyone who contributes to policy as the standards highlight (see standards 1.3, 3.1 and 3.2 in particular). "
        },
        {
            "text": "Learning from Policy Lab’s experience  "
        },
        {
            "text": "This new course sets out stories from Policy Lab’s long-standing experience of working with teams across government. It features four projects in detail, showing how you can: "
        },
        {
            "text": "The course has weekly modules and takes 10 hours over five weeks to complete. It features short films, that capture the reflections and experiences of past Policy Lab projects. Learners will also find written content explaining the methods, demonstrating how they can improve policy outcomes.  "
        },
        {
            "text": "Practical steps are also included each week for how to start applying the method in your own work. These draw on case studies where Policy Lab applied the featured methods across a range of tricky policy design challenges, from understanding the drivers of engagement with JobCentre Plus services, to fisheries management and English language learning provision for refugees. "
        },
        {
            "text": "Each module links out to resources and expertise from across the public sector and beyond that will help deepen your understanding of the methods involved and facilitates reflection on how to start implementing them. "
        },
        {
            "text": "Start your learning journey "
        },
        {
            "text": "The course forms part of a wider learning offer from the profession that will include induction resources, learning linked to the Policy Profession Standards, Knowledge Series and a Policy Festival, helping to spread good practice out from where innovation is happening into the wider policy making system. "
        },
        {
            "text": "If you are a UK Civil Servant or work in the public sector you can access the course here and can continue your learning conversation through the Policy Design Community, your own communities of practice, or by getting in touch with Policy Lab. "
        }
    ]
}