{
    "url": "https://environmentagency.blog.gov.uk/2023/10/04/preventing-crime-in-the-waste-sector/",
    "title": "Preventing crime in the waste sector",
    "authors": [
        "Environment Agency"
    ],
    "categories": [
        "Waste"
    ],
    "pub_date": "2023-10-04T09:23:58+00:00",
    "content": [
        {
            "text": "Our mission is to stop crime in the waste sector altogether. One of the ways we can do this is through working with Government to improve the regulatory system to make it harder for crime to be possible."
        },
        {
            "text": "Reforming waste exemptions"
        },
        {
            "text": "Change to the waste exemptions regime will bring protection to legitimate businesses in the waste industry. This light touch form of regulation allows some low risk, small scale waste activities to be carried out under a registration scheme."
        },
        {
            "text": "But we know that some types of waste exemptions have been routinely used by unscrupulous operators to hide illegal waste activities from regulatory control, whilst providing a veil of legitimacy."
        },
        {
            "text": "To support legitimate operators in the waste industry, the proposed changes to the waste exemptions regime are focused on stopping crime and poor performance in the waste sector. The changes target the 10 most abused waste exemptions, as well as prohibiting waste exemptions on permitted sites and restricting storage limits where multiple waste exemptions are registered on a site."
        },
        {
            "text": "Steve Molyneux, the Environment Agency’s Deputy Director for Waste Regulation, said:"
        },
        {
            "text": "\"We are determined to make life harder for criminals by disrupting and stopping illegal activity through better regulation and tough enforcement action."
        },
        {
            "text": "\"The changes to the waste exemption regime will help us in our goal by restricting or removing waste exemptions that are used to mask illegal waste sites. These sites undercut legitimate business, are a risk to the environment and people’s safety. We will keep working with Government and the waste industry to drive further action to stop waste crime.\""
        },
        {
            "text": "Check if your business is affected"
        },
        {
            "text": "Check what is changing and get yourself ready for change, as you may need to restrict your waste activity, get a permit or stop altogether: Waste Exemptions - Getting ready for change - Register your waste exemptions - GOV.UK"
        },
        {
            "text": "If you have registered waste exemptions:"
        },
        {
            "text": "Government will announce the parliamentary time for changes to the regulations to bring the changes into effect. Transitional periods will follow to allow industry time to adjust."
        },
        {
            "text": "Consultation"
        },
        {
            "text": "In autumn we will be consulting on waste exemption registration charges. These proposed charges will generate an income to allow us to proactively inspect waste exemptions to ensure they are not mis-used."
        },
        {
            "text": "Reforming the waste exemption regime and introducing charging will raise standards and support legitimate businesses, stopping poor performance and crime in the waste sector."
        },
        {
            "text": "Remember, you can help us STOP REPORT SHUT DOWN waste criminals, by reporting them to our incident hotline 0800 80 70 60 or through Crimestoppers 100% anonymous. Always. Giving information anonymously | Crimestoppers (crimestoppers-uk.org) or telephone 0800 555 111."
        }
    ]
}