{
    "url": "https://digitalpeople.blog.gov.uk/2023/10/04/spotlight-on-ddat-webinars-illuminating-the-world-of-digital-data-and-technology/",
    "title": "Spotlight on DDaT Webinars: Illuminating the World of Digital, Data, and Technology",
    "authors": [
        "Olga Winkle, CDDO"
    ],
    "categories": [
        "Capabilities",
        "Communities of practice",
        "Community",
        "Digital data and technology",
        "People and Skills",
        "Skills and Learning",
        "Training and progression"
    ],
    "pub_date": "2023-10-04T22:45:34+01:00",
    "content": [
        {
            "heading": 3,
            "text": "Introduction"
        },
        {
            "text": "It’s been a year since the Digital Capability team within the Central Digital & Data Office (CDDO) piloted its Spotlight webinars. Now is a good time to look back and evaluate how they are doing."
        },
        {
            "text": "Spotlight webinars focus on various aspects of the digital, data, and technology domains. They are typically hosted by experienced practitioners who share their insights, experiences, and expertise; tailoring their presentation to suit an audience working outside the digital, data, and technology professions."
        },
        {
            "text": "“The primary aim of these webinars is to create awareness, inform, and inspire participants, equipping them with the knowledge and skills needed to navigate the ever-changing digital landscape successfully; thus supporting Commitment 16, under Mission 5 of the Transforming for a Digital Future - the cross-government digital and data strategy for 2022-25” says Gemma Jones, Learning Pathways Lead."
        },
        {
            "text": "Image Credit: Samantha Borges - Unsplash"
        },
        {
            "heading": 3,
            "text": "Spotlight Webinars"
        },
        {
            "text": "In July 2022, inspired by the overwhelmingly positive feedback from three pilot webinars, CDDO decided to make these sessions a part of the ongoing upskilling offer for civil servants not working in the digital, data, and technology professions. These webinars are now staged regularly and CDDO has hosted 12 of them since October 2022; previous webinars have looked at:"
        },
        {
            "text": "The presenters are experts in their respective fields, bringing with them a wealth of knowledge and real-world experience. Their insights are invaluable as they share best practices, case studies, and practical tips that participants can immediately apply in their own projects or roles. From hearing about successful implementation stories to learning from past failures, these expert-guided sessions empower attendees to make informed decisions and avoid common pitfalls."
        },
        {
            "text": "Above all, Spotlight webinars go beyond being mere passive lectures, they provide an interactive learning experience where attendees can ask questions, seek clarifications, and engage in discussions with both the speakers or their fellow participants. This interactive element fosters a sense of community, promotes collaboration, encourages  sharing of perspectives and learning from one another. Attendees can connect with like-minded professionals and potential mentors, so these webinars serve as a hub for networking and relationship-building across departments. "
        },
        {
            "heading": 3,
            "text": "Building Networks"
        },
        {
            "text": "I know that colleagues working on Digital, Data, and Technology roles are successfully helping government departments to transform their services; and I remain convinced that talking about success and lessons learnt promotes further achievements. And respondents to our evaluation surveys agree with us! Therefore, we encourage participants to use the webinar chat function to ask questions and reflect on their own practice and often see people swapping contact details to continue talking about their aspirations and concerns, thus forming a support network. Our speakers often offer to reach out to them for further advice, and that is a truly invaluable resource for building momentum in Digital Transformation."
        },
        {
            "text": "One of the most significant advantages of webinars is their accessibility and convenience. This flexibility makes it easier for professionals with busy schedules to gain new insights without disrupting their workflow. It is therefore a great stepping stone for learning about digital, data, and technology. So far the sessions have had more than 4,000 registrations to date and attendance has grown more than 20 fold since the pilots - we've had to close registrations for our forthcoming webinar on “Emerging trends in digital and data capability” with over 1,000 people registrations! Most importantly, we have seen that having attended a webinar, individuals are more readily engaging with the rest of the CDDO Learning offer - specifically, the Innovation Masterclass and the Digital Excellence Programme."
        },
        {
            "text": "Creating awareness of our webinars across all government departments and professions is not the easiest of tasks, so I am thrilled by the response we get every time a webinar is advertised via a new channel. Especially when it comes from professions that are “removed” from DDaT. It turns out that individuals across the Civil Service want to engage with the CDDO Digital Essentials knowledge offer, so our registration numbers are steadily growing giving us a mandate to continue this initiative."
        },
        {
            "heading": 3,
            "text": "Join Us"
        },
        {
            "text": "Everyone with a gov.uk email address is welcome to attend, the next opportunity is our \"Colossus to ChatGPT” webinar taking place on Thursday, 12 October 2023 between 15:00 & 15:45 - find out more and register here "
        }
    ]
}