{
    "url": "https://vmd.blog.gov.uk/2025/02/20/controlled-drugs-in-veterinary-practice-a-vmd-inspectors-top-tips/",
    "title": "Controlled drugs in veterinary practice: A VMD inspector’s top tips",
    "authors": [
        "Lee Grist"
    ],
    "categories": [
        "Inspections"
    ],
    "pub_date": "2025-02-20T10:21:39+00:00",
    "content": [
        {
            "text": "As Head of Inspections and Enforcement at the Veterinary Medicines Directorate (VMD), I regularly see how veterinary practices manage controlled drugs (CDs). Through our programme of inspections, we've identified several areas where practices commonly face challenges. I'd like to share some insights to help practices maintain compliance and ensure the safe use of these vital medicines."
        },
        {
            "text": "Veterinary surgeon’s responsibilities"
        },
        {
            "text": "It is the vet's responsibility to make sure that CDs at the practice they work at are stored, used and supplied correctly. While you may delegate certain tasks to your team, such as recording entries in the CD register or having access to the CD cabinet, you retain ultimate accountability for:"
        },
        {
            "text": "Schedule 2 and 3 CDs"
        },
        {
            "text": "Schedule 2 and 3 CDs can only be supplied against a valid CD requisition order that must be hand signed by a registered vet. You should not request a CD without completing the relevant requisition order form. If you are supplied with the medicine without completing the relevant form, please ensure you report this to us at postmaster@vmd.gov.uk so we can investigate further."
        },
        {
            "text": "CD Registers"
        },
        {
            "text": "During inspections, we will always ask to see your CD registers. A register is required for ALL Schedule 2 CDs such as methadone, ketamine and quinalbarbitone. A register must be kept for each product in each area where it is being stored. This is so that it is easy for you to check what stock you should have against the stock you do have."
        },
        {
            "text": "Your register must be either:"
        },
        {
            "text": "Essential register requirements"
        },
        {
            "text": "For bound books you must ensure:"
        },
        {
            "text": "What do we check during vet practice inspections"
        },
        {
            "text": "At an inspection we will check your CD register and we will expect to see certain bits of information."
        },
        {
            "text": "For incoming stock, we need to see:"
        },
        {
            "text": "It is also good practice to record who has made the entry and the new running balance."
        },
        {
            "text": "For outgoing stock, we need to see:"
        },
        {
            "text": "It is also good practice to record who made the entry and the prescribing vet, the probable hub wastage and the new running balance."
        },
        {
            "text": "Stock discrepancies"
        },
        {
            "text": "Getting the running balance correct is challenging for vet practices. This can be for several reasons such as:"
        },
        {
            "text": "What to do when discrepancies arise"
        },
        {
            "text": "If you do not have an accurate balance at the end of a bottle you must review and investigate the discrepancies by following these steps:"
        },
        {
            "text": "If you have concerns over a discrepancy, you should report this to the police due to the potential for misuse, particularly if a full bottle has gone missing. You may also need to review who has access to the CD cabinet."
        },
        {
            "text": "Secure CD storage"
        },
        {
            "text": "Certain controlled drugs are required to be kept in a CD cabinet that complies with the Misuse of Drugs Regulations. These are:"
        },
        {
            "text": "It is good practice to store all controlled drugs securely, particularly any that may be open to abuse."
        },
        {
            "text": "The Misuse of Drugs Regulations has very specific requirements for CD cabinets, covering how thick the metal must be to the types of lock that can be used. It is your responsibility to ensure your cabinet meets the requirements. Please refer to the Home Office guidance to ensure your cabinet meets the required specifications."
        },
        {
            "text": "Witness Disposal"
        },
        {
            "text": "All schedule 2 controlled drugs that are out of date must be disposed of appropriately and in the presence of an independent witness. The leftover medicines must be made irretrievable and the best way to do this is to use a CD disposal kit. An approved witness can be:"
        },
        {
            "text": "For detailed information and to ensure you and your practice remain compliant with all regulations, consult:"
        }
    ]
}