{
    "url": "https://dragonsden.blog.gov.uk/2025/02/20/dragons-den-ip-blog-series-22-episode-7/",
    "title": "Dragons' Den IP Blog - Series 22 Episode 7",
    "authors": [
        "Paula Davy"
    ],
    "categories": [
        "Business",
        "International",
        "IP",
        "IP Attaché network",
        "Patents",
        "Trade marks"
    ],
    "pub_date": "2025-02-20T21:00:00+00:00",
    "content": [
        {
            "text": "If you’ve invented ‘the next big thing’ or are simply searching for inspiration, there’s plenty of entrepreneurial spirit to be found in the Den. From space saving solutions and self-cooling devices to sauces and seasonings, intellectual property (IP) and innovation were in abundance in tonight’s episode."
        },
        {
            "heading": 3,
            "text": "Hooked on IP "
        },
        {
            "text": "Elliot Tanner from Wales was first to enter the Den with the SpaceRail. The bike storage system, comprising of a series of rotatable hooks and a sliding rail, enables you to store several bicycles close together and save on space.  "
        },
        {
            "text": "Elliot was pitching for £100k and the backing of a Dragon, in return for a 2.5% stake in his business. "
        },
        {
            "text": "As a previous R&D manager helping clients bring their concepts to life, Elliot was no stranger to the world of IP and the benefits that protecting your IP can offer. He proudly told the Dragons that he has patents granted in the UK, EU and the US, and that 80% of his products ship worldwide.  "
        },
        {
            "text": "A quick search of our new patents search tool tells me that Elliot has protected ‘a system for storage of bicycles’ (GB2606001), which was first granted in the UK in 2023 then in the EU a year later. "
        },
        {
            "text": "I can also see from our search for a trade mark service that Elliot has protected the term ‘SpaceRail’ (UK00003718234), along with his business name, ‘Stashed’ (GB2606001), with registered trade marks.  "
        },
        {
            "heading": 4,
            "text": "On your bike "
        },
        {
            "text": "If, like Elliot, you are considering selling or licensing your products abroad, you may want to protect your IP in those countries before entering the market otherwise anyone can make, use or sell your IP without your permission. Because of the difficulties in obtaining patent protection abroad, it is recommended that you seek professional advice from an IP attorney. "
        },
        {
            "text": "After hearing all about Elliot’s background and his projected figures, the Dragons were keen to get in the saddle with him and all (apart from Peter Jones) made him an offer. After some 'wheeling' and dealing, Elliot eventually shook hands with Touker who offered all the money for 7%, lowering his stake to 4% once his investment has been returned.    "
        },
        {
            "heading": 3,
            "text": "Cool as a cucumber "
        },
        {
            "text": "Second to enter the Den this evening was Nitya Dintakurti and her assistant. Originally from Bangalore, Nitya has been a fan of Dragons' Den since she was little and was finally standing in front of the formidable entrepreneurs seeking investment in her own company, Unpause.  "
        },
        {
            "text": "Nitya was pitching for 100k in return for 2.5% of her business which includes the Coolzen, a wearable tech device to help menopausal women with hot flushes. Worn on the back of the neck, the device is said to detect the onset of a hot flush and provide a localised cooling effect, thus reducing the intensity of the episode.  "
        },
        {
            "text": "Hearing of such an innovative product, I hoped Nitya had considered IP protection and encouragingly, she informed the Dragons that she had a ‘patent pending’. The business also has registered trade marks for Coolzen and Unpause. "
        },
        {
            "text": "Unfortunately for Nitya, the ‘patent pending’ status wasn’t enough to persuade the Dragons on this occasion. Although they thought her product was innovative, her business valuation left them feeling a little hot under the collar and she left the Den without investment but with some sound business advice instead.  "
        },
        {
            "heading": 3,
            "text": "Last but not least "
        },
        {
            "text": "Congratulations to all the entrepreneurs from tonight’s episode, including Brendon and Jaydon Manders who were successful in bagging guest Dragon Emma Grede with support for their range of sauces and seasonings.  "
        },
        {
            "text": "If you’re thinking of protecting your IP but don’t know where to start, IP Equip is a free e-learning tool with four quick and easy modules to teach you the basics of IP.  "
        },
        {
            "text": "Disclaimer:  "
        },
        {
            "text": "The purpose of the IPO's Dragons' Den IP blog is to help identify the IP in entrepreneurs’ pitches and highlight how IP works, or could work, in the real-life examples featured. IPO’s authorship of this blog does not constitute its endorsement or sponsorship of any products, individuals or businesses referenced within it.  "
        }
    ]
}