{
    "url": "https://educationhub.blog.gov.uk/2025/02/keeping-children-safe-in-education-settings-everything-you-need-to-know/",
    "title": "Keeping children safe in education settings: everything you need to know  ",
    "authors": [
        "mediaofficer"
    ],
    "categories": [
        "Academies",
        "Behaviour",
        "Child protection",
        "Prevent",
        "School safety",
        "Secondary schools"
    ],
    "pub_date": "2025-02-20T10:26:06+00:00",
    "content": [
        {
            "text": "Schools should be safe places where children can focus on learning and staff can focus on delivering a great education.  In light of recent events, such as the tragic death of a boy after a stabbing at a Sheffield school, it is important that school staff, pupils and parents feel reassured about school safety.   "
        },
        {
            "text": "Schools have a duty to ensure staff and pupil safety, and the Department for Education provides guidance so leaders can put in place measures that work for their individual setting.   "
        },
        {
            "heading": 3,
            "text": "What does safeguarding mean?  "
        },
        {
            "text": "Everyone has a role to play in keeping children safe and schools and colleges play a really important role in keeping children safe in education. This work to provide a safe environment in which children can learn is called safeguarding.  "
        },
        {
            "text": "Schools and colleges are also part of a wider safeguarding operation that includes local authorities, health, and police. They also each have legal duties to safeguard and promote the welfare of children.  "
        },
        {
            "text": "Safeguarding is about making sure children are safe and protected from harm while at school or college. This includes preventing risks such as abuse, neglect, or any other dangers that could affect a child’s well-being.   "
        },
        {
            "heading": 3,
            "text": "What security measures do schools have in place?  "
        },
        {
            "text": "Schools are protective spaces by design – their buildings and perimeters must be secure to promote the safety of children.  "
        },
        {
            "text": "Although schools are generally very safe, they must be prepared for potential risks like vandalism, cyber-attacks, or even more serious incidents.   "
        },
        {
            "text": "Incidents in schools are rare, but we have clear processes and practices to support schools to protect children. This includes working closely with police and local authorities to plan and respond to any incidents.  "
        },
        {
            "text": "We expect schools to have policies in place on security measures, and we have clear guidance to support them to develop plans, covering everything from deterring attacks and keeping learners safe, to when it is appropriate to put in place lockdown.  "
        },
        {
            "text": "School leaders can introduce additional security measures, such as metal detectors or knife arches, if they consider it to be necessary.  "
        },
        {
            "text": "Before considering the installation and use of any technology used for screening, headteachers are encouraged to consult with local police who may be able to provide advice about whether installation of these devices is appropriate.  "
        },
        {
            "heading": 3,
            "text": "Do schools have to have knife arches?  "
        },
        {
            "text": "No, schools do not have to have knife arches. It is up to schools to decide if they think this is necessary.  "
        },
        {
            "heading": 3,
            "text": "How are you tackling knife crime in schools?  "
        },
        {
            "text": "While violent incidents in schools are rare, we are committed to tackle knife crime and are addressing this across key areas including:  "
        },
        {
            "heading": 3,
            "text": "What guidance do you give to schools to help staff prepare security plans?  "
        },
        {
            "text": "The department provides a range of guidance to support schools and colleges with their security plans. This includes the school and college security guidance which provides advice on when it might be appropriate to put in place lockdown procedures and the Protective Security and Preparedness for education settings guidance which sets out steps to keep learners and staff safe in the event of an incident.  "
        },
        {
            "text": "We have also developed a range of resources freely available to assist security leads, teachers, and learners in preparing and responding to counter terrorism incidents.  "
        },
        {
            "heading": 3,
            "text": "How can schools access more information?  "
        },
        {
            "text": "Keeping children safe in education: school staff should familiarise themselves with the statutory guidance and make sure they understand and meet their safeguarding responsibilities.  "
        },
        {
            "text": "School and college security guidance: non-statutory guidance to help schools and colleges manage their security effectively so they can meet their obligations.  "
        },
        {
            "text": "Protective security and preparedness guidance: the non-statutory guidance provides advice to help education settings become better prepared for and able to respond to terrorism and other major incidents.  "
        }
    ]
}