{
    "url": "https://naturalengland.blog.gov.uk/2021/08/13/2021-hen-harrier-breeding-statistics/",
    "title": "An update on another encouraging year for breeding Hen Harriers in England",
    "authors": [
        "Dave Slater"
    ],
    "categories": [
        "Uncategorized"
    ],
    "pub_date": "2021-08-13T09:12:28+01:00",
    "content": [
        {
            "text": "By Dave Slater, Director for Wildlife Licensing and Enforcement Cases at Natural England"
        },
        {
            "text": "We are very pleased that 2021 has seen a further increase in the number of breeding Hen Harriers in England, with 31 breeding attempts, of which 24 were successful, fledging 84 chicks. These are the highest numbers in modern times, and represent the latest in a series of annual increases following a low in 2016. Nevertheless, Hen Harriers remain rare and persecuted in England, and it will take time for us to feel confident that this is the start of a sustained recovery."
        },
        {
            "text": "Natural England is involved in a number of initiatives to support the recovery of Hen Harriers, including working with partners under the Hen Harrier Action Plan, published by Defra. This blog aims to share the current status of our work under the Action Plan."
        },
        {
            "text": "Tackling persecution"
        },
        {
            "text": "Illegal persecution on land managed for grouse shooting remains the main threat to the recovery of Hen Harriers. Natural England is clear that successful breeding seasons, like this one, cannot lead to a sustained population recovery if survival continues to be impacted by illegal persecution and deliberate disturbance."
        },
        {
            "text": "Natural England is committed to tackling illegal wildlife persecution. This work includes nest and winter roost monitoring, and enforcement activities, according to the extent of our powers under law and in partnership with the police, National Parks, land management organisations such as the Moorland Association, the RSPB and other partners. We have recently arranged to second a senior member of staff to the National Wildlife Crime Unit to identify improvements in how Natural England, the police, local communities and other relevant stakeholders can work together to prevent, identify, and take effective enforcement action in relation to raptor persecution incidents."
        },
        {
            "text": "Satellite tracking"
        },
        {
            "text": "Data gathered through satellite tagging allow us to track the fortunes of individual birds, and 12 of the birds that nested this year carried satellite tags (all published on our Hen Harrier tracking update webpage). We are grateful to all the highly skilled fieldworkers, from Natural England, the RSPB and Peak District Raptor Study Group, and other volunteers, for their commitment and considerable efforts to monitor Hen Harrier nests and fit satellite tags to chicks, as well as to the land managers who enabled access, and to Defra for funding. Patterns of satellite-tagged Hen Harrier disappearances were analysed and published in 2019, and we will be drawing up plans for further analysis to increase our understanding of the threats faced by Hen Harriers."
        },
        {
            "text": "Diversionary feeding"
        },
        {
            "text": "Another aspect of our Hen Harrier work is issuing licences to approach nests to provide additional food. In 2021, four sites on grouse moors were registered for diversionary feeding, in order to reduce predation of Red Grouse. In addition, supplementary food was provided at a small number of nests in other habitats, to support nesting success. While this additional food is likely to have contributed to their success this year, we believe that more work to provide support and best practice advice will ensure that additional feeding is having the best possible effect on Hen Harrier breeding success."
        },
        {
            "text": "Brood management "
        },
        {
            "text": "Natural England is involved in the five-year Hen Harrier brood management trial, which aims to investigate the feasibility and effects of taking eggs or nestling Hen Harriers from the wild, rearing them in captivity, and releasing them to become healthy adults. The trial will also investigate whether brood management will alter the perceptions and behaviour of the moorland community. In 2021, trial interventions were approved at two nests: one in North Yorkshire and one in Lancashire. All eight chicks from these nests have been successfully reared to become healthy fledglings and released."
        },
        {
            "text": "This year’s monitoring also revealed the positive fortunes of the 2020 cohort of brood-managed birds: six of the eight survived their first winter, and five attempted to breed this year, of which four were successful. Individual details can be found in the latest Hen Harrier tracking update, above. We are happy that this cohort have shown good survival rates and excellent recruitment into the breeding population, and are demonstrating successful breeding behaviour, thereby contributing to the increase in breeding Hen Harrier numbers. However, we are still within the trial period, and we will be drawing up plans for formal assessment and evaluation to determine the future role of brood management."
        },
        {
            "text": "Southern reintroduction"
        },
        {
            "text": "Under the Action Plan, Natural England is responsible for the Southern Reintroduction project, which aims to establish a viable population in southern England. To achieve this, we are working with partners, with funding from Defra, on plans to set up a captive breeding programme with rescued Hen Harriers from continental Europe. As yet, no birds have been imported, or released, and we are planning further assessment and stakeholder engagement to give this project the greatest chance of success."
        },
        {
            "text": "The road ahead"
        },
        {
            "text": "As tough as it has seemed at times, this is showing signs of being the start of the road to recovery for Hen Harriers, and we will be assessing all our activities, and reaching out to our many stakeholders and partners, to help plan and communicate the next stage of the journey."
        },
        {
            "text": "Natural England is just one partner amongst the range of different interests involved. All these partners will need to work together if we are to tackle the barriers to success, particularly in turning the tide on illegal persecution which continues to stifle widespread recovery."
        },
        {
            "text": " "
        },
        {
            "text": "Acknowledgements"
        },
        {
            "text": "A wide range of organisations are working together to support Hen Harrier recovery. These include: Natural England, Defra, RSPB, Forestry Commission, Moorland Association, United Utilities, National Trust, Hawk and Owl Trust, International Centre for Birds of Prey, Yorkshire Dales National Park Authority, Northumberland National Park Authority, Peak District National Park Authority, Nidderdale & Forest of Bowland Areas of Outstanding Natural Beauty, Northumberland Wildlife Trust, Game & Wildlife Conservation Trust, local police forces and the National Wildlife Crime Unit, various Estates and their representatives, and individuals including landowners, farmers, academic researchers and volunteer raptor enthusiasts."
        }
    ]
}