{
    "url": "https://deframedia.blog.gov.uk/2021/08/13/blue-planet-fund-delivers-first-multimillion-boost-for-global-ocean-recovery/",
    "title": "Blue Planet Fund delivers first multimillion boost for global ocean recovery",
    "authors": [
        "Defra Press Office"
    ],
    "categories": [
        "Weekly stories"
    ],
    "pub_date": "2021-08-13T13:20:03+01:00",
    "content": [
        {
            "text": "Today (13th August 2021), the government has announced the first set of programmes to receive funding from the £500m Blue Planet Fund launched by the Prime Minister at the G7 summit."
        },
        {
            "text": "The £16.2m sum has received national media coverage in the Daily Mail and trade media attention in Mirage News as well as international coverage in Euro News Weekly."
        },
        {
            "text": "The programmes, financed from the UK’s overseas aid budget, will increase marine protection, tackle plastic pollution and the decline of global coral reefs, as well as using the UK’s world-leading expertise to help respond to marine pollution disasters such as the Xpress Pearl in Sri Lanka."
        },
        {
            "text": "The full breakdown of the £16.2m funding is:"
        },
        {
            "text": "Environment Secretary, George Eustice, said:\n"
        },
        {
            "text": "The projects receiving funding include the launch of a new UK-led programme – the Ocean Country Partnership Programme (OCPP) - which will help developing countries partner with the UK’s world-leading scientists to better manage marine protected areas, and improve our understanding of the impacts of climate change and contaminants in the ocean."
        },
        {
            "text": "The UK is also leading calls for a new global ‘30by30’ target to protect at least 30% of the land and at least 30% of the ocean by 2030. Over eighty countries now support the marine protection target, and the Blue Planet Fund will help make sure that 30by30 becomes a reality."
        }
    ]
}