{
    "url": "https://valuationoffice.blog.gov.uk/2021/08/13/how-we-value-heritage-sites/",
    "title": "How We Value: Heritage Sites",
    "authors": [
        "matthewmountfordbrock"
    ],
    "categories": [
        "How We Value"
    ],
    "pub_date": "2021-08-13T13:35:22+01:00",
    "content": [
        {
            "text": "Alex Wheldon is a Senior Surveyor in the District Valuer Service (DVS) team – our team which provides valuation advice to public sector clients across England, Wales and Scotland. In the second instalment of our How We Value series, Alex talks about the valuation process for heritage sites."
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": "About heritage sites"
        },
        {
            "text": "Most people think of our built heritage as the castles, civic, or religious buildings that form part of our built environment - but according to the Royal Institution of Chartered Surveyors, at least one in four buildings can be considered historic.  As a guideline, we tend to consider any pre-1930s building of traditional construction as historic and this covers a large percentage of the UK’s built environment."
        },
        {
            "text": "Many historic buildings are protected because of their architectural or historical interest, but there are even more buildings that are simply classed as historic due to their age."
        },
        {
            "text": "On the DVS team we get to see a wide variety of property types and in valuing these more unusual properties - for sites ranging from Iron Age earthworks, through to stately homes- there are principles to valuing such properties which remain applicable."
        },
        {
            "text": "Most buildings can be valued using standard evaluation methods, involving comparing the buildings, looking at the investment involved, and more."
        },
        {
            "text": "However, for the historic environment there are often additional issues to consider. We call this the “adopt and adapt” approach.  We adopt whichever method is most suitable and adapt it to reflect the particular issues affecting the property.  This involves considering the following factors."
        },
        {
            "text": "Conservation philosophy: This includes philosophical aspects of the asset.  What are we trying to conserve, and why? It can be something as simple as proving a famous person from history had a connection with a site or establishing which type of stone the building was constructed from."
        },
        {
            "text": "Legal implications:  Many historic buildings are legally protected.  In the UK this often means a Scheduled Monument, or a Graded/Listed Building.  These are legally defined titles that offer protection from unsuitable development."
        },
        {
            "text": "Heritage value:  This is often difficult to quantify.  Our tourism industry benefits immensely because of our historic environment and this includes the additional economic effects.  A lot of heritage sites are unique and that in itself generates an interest as rarity adds value."
        },
        {
            "text": "Cost of repair:  Modern materials and techniques can often cause irreversible damage when used on historic buildings.  Some historic buildings are burdened with the liability of large repair costs and bridging this “conservation deficit” is a key part of finding a suitable economic use and also adding value to the building."
        },
        {
            "text": "Impact of grants/loans: One of the quickest ways to bridge large repair or conservation costs is through grants for historic buildings, however it is not always easy to find a suitable grant. Agreed funding can enhance the value of a property and undesirable buildings can be improved with grants to make them suitable for future uses."
        },
        {
            "text": "As you can see, there are a lot of additional factors that have an impact on value and the valuation of historic buildings."
        },
        {
            "text": "We provide valuations for a variety of reasons.  The most common are for grant purposes (i.e. before and after valuations showing the potential value enhancement for different final uses), valuations for acquisition or disposal, enabling development valuations and valuations for statutory purposes."
        },
        {
            "text": "The conservation of history is important to many people – historic buildings serve as landmarks in our timeline as a society and mark our progress as we continue to develop. That’s why we go through such intricate processes to put a valuation on something which is often invaluable in its nature."
        },
        {
            "text": " "
        },
        {
            "text": " "
        }
    ]
}