{
    "url": "https://insolvencyservice.blog.gov.uk/2021/08/13/mindfulness-and-me-bringing-your-best-self-to-work/",
    "title": "Mindfulness and me: Bringing your best self to work",
    "authors": [
        "Sarah Holland"
    ],
    "categories": [
        "Networks",
        "People and culture"
    ],
    "pub_date": "2021-08-13T11:03:16+00:00",
    "content": [
        {
            "text": "When I tentatively mentioned to the Insolvency Service’s Break the Stigma group – a staff network which works to break the stigma around mental health issues – that I’d restored my own mental health using meditation, I wasn’t expecting to be teaching classes to the whole agency just a few weeks later."
        },
        {
            "text": "As a new(ish) recruit to the agency, I wasn’t sure what to expect. I thought I would have to hide parts of my personality to fit in, let alone succeed. Telling anyone about my meditation practice was perhaps a conversation for after-work drinks, and only then once I’d established my colleague was a kindred spirit."
        },
        {
            "text": "How wrong I was."
        },
        {
            "heading": 2,
            "text": "Hidden skills and strengths"
        },
        {
            "text": "When I joined the agency, I was suffering with my mental health. My plan was to just concentrate on my work, speaking to only those people who had immediate relevance to my job. Instead, I blossomed."
        },
        {
            "text": "My team had a funny knack of extracting hidden skills and strengths. Soon, I was sharing not just ideas, but also myself."
        },
        {
            "text": "I was surprised by how many interests I shared with colleagues. I was soon confidently leading meetings, taking opportunities to be mentored and leading a team. I was ready to thrive."
        },
        {
            "heading": 2,
            "text": "Recovery through meditation"
        },
        {
            "text": "Alongside this, was my recovery through meditation. Taking advantage of the extra time lockdown presented to meditate without fail, every single morning, before work. As my confidence grew, both through the practice and the support of my colleagues, so did my willingness to share my story."
        },
        {
            "text": "As my health recovered, I felt more like myself, and the more I felt accepted. Contrary to my previous misconceptions, I was pleased to learn that there were lots of others in the Insolvency Service like me who practiced or were interested in meditation for all sorts of reasons."
        },
        {
            "text": "I found myself in a place where I did, in fact, fit in. And there was no better time than to shine, thrive and share my best self with those I worked with."
        },
        {
            "text": "The responses to a blog I posted on our agency's intranet – an honest, uncomfortable account, sharing my mental journey from torment to total health, all through the practice of mindfulness and meditation – confirmed that, after a year working with such supportive people, I had already been forced out of my shell."
        },
        {
            "text": "Looking back to when I started, I was so surprised that I now felt that comfortable to share such personal parts of me."
        },
        {
            "heading": 2,
            "text": "Sessions for all"
        },
        {
            "text": "When the idea to run sessions for the wider agency was floated, I tentatively asked my Director whether it was okay for me to take time out at 4pm every Tuesday to teach my colleagues how to meditate. The answer was a resounding 'yes'."
        },
        {
            "text": "Later, when I moved teams, I asked my new line manager whether it was still okay to deliver my meditation sessions. The answer, again, was 'yes', but also, 'how can we help you to promote this?'."
        },
        {
            "text": "Better still, my manager took the time from a busy schedule to join in. That, to me, was a double, 'yes!' And when one of our Executive Leadership Team rocked up, that was it – a shout-from-the-rooftops “yes!”."
        },
        {
            "text": "Now, between 30 and 50 people join every week, determined to take a precious half an hour for their wellbeing."
        },
        {
            "heading": 2,
            "text": "Early days, but encouraging feedback"
        },
        {
            "text": "It’s still early days for my ‘Meditate with Sarah’ sessions at the Insolvency Service, but the positive feedback has been overwhelming. From people feeling less stressed, enjoying better sleep, being eased of headaches, and so re-energised they’re ready to face a few hours of extra work in the evening, refreshed and ready. I hope to bring this opportunity for wellbeing in our working lives to even more colleagues."
        },
        {
            "text": "The Insolvency Service has enabled me to bring my absolute best self to work and benefit not just me, but tens of others, taking steps to be the best versions of themselves through the practice, too."
        },
        {
            "heading": 3,
            "text": "Further information"
        },
        {
            "text": " "
        }
    ]
}