{
    "url": "https://defrafarming.blog.gov.uk/2021/08/13/new-agriculture-and-horticulture-innovation-opportunities/",
    "title": "New agriculture and horticulture innovation opportunities",
    "authors": [
        "Leah Segal"
    ],
    "categories": [
        "Payments for research and innovation"
    ],
    "pub_date": "2021-08-13T11:00:57+01:00",
    "content": [
        {
            "heading": 3,
            "text": "Why does innovation in farming matter?"
        },
        {
            "text": "Innovation is a vital way to address the challenges currently facing the agricultural and horticultural sectors. New ideas, technologies and processes will play a key role in helping farmers, growers and businesses to become more productive. They will also enable the sector to be more environmentally sustainable and resilient, whilst helping it achieve its Net Zero ambitions."
        },
        {
            "heading": 3,
            "text": "What is the competition about?"
        },
        {
            "text": "In October 2021, Defra will launch the first competitions of our new Industry-led R&D Partnerships fund. This is the first of three different funds to launch in Defra’s new Farming Innovation Programme. "
        },
        {
            "text": "Through this fund, we want to encourage groups of farmers, growers, businesses and researchers to get involved in collaborative research and development. We believe that by working together, they will be able to solve challenges and exploit opportunities for increasing productivity and environmental sustainability in the agricultural and horticultural sectors in England."
        },
        {
            "text": "The Farming Innovation Programme will also support knowledge exchange between farmers, growers, businesses, and researchers. This will enable the results and learnings from the projects to be shared widely and will still benefit those who cannot directly take part in the competitions. "
        },
        {
            "heading": 3,
            "text": "Who will deliver it?"
        },
        {
            "text": "The Industry-led R&D Partnerships fund will be delivered in partnership with UK Research and Innovation (UKRI), building on the success of their £90m Transforming Food Production Challenge. This will also expand on our partnership with UKRI for the Farming Innovation Pathways competition launched earlier this year."
        },
        {
            "heading": 3,
            "text": "What funding is available?"
        },
        {
            "text": "There will be four types of competitions within the Industry-led R&D Partnerships fund, which are designed to encourage applications from a wide range of groups, sectors and regions. Each competition will offer different scales of funding. Project teams will be able to apply for grants towards the total project costs, while providing some of their own match funding. Competitions are summarised in the table below. "
        },
        {
            "heading": 3,
            "text": "Who can apply for funding?"
        },
        {
            "text": "You could be a farmer or grower with an exciting idea that will benefit England's farming sector, or for our larger projects, a group of agri-businesses wanting to collaborate with other businesses, researchers and end-users to develop and commercialise your innovative product. You might even be a business from outside the sector with a game-changing idea for English farming. Whether you have participated in multiple research projects before, or you want to test out an innovative idea for the first time, we want you to get involved! Look out for more details on who can take part, and how, later in the summer."
        },
        {
            "heading": 3,
            "text": "When do the competitions open and how long will they be open for?"
        },
        {
            "text": "The competitions will open to applicants in early October, and we will be sharing lots more information in the early autumn. This will include briefing events, detailed guidance on eligibility requirements and how to apply, and support to form partnerships with other applicants. "
        },
        {
            "text": "The competitions will be open to applications for 6-7 weeks, with different closing dates for each competition. But the Farming Innovation Programme is a long-term funding programme, and we will be launching lots more new and exciting competitions for ambitious R&D on a regular basis over the coming years."
        },
        {
            "heading": 3,
            "text": "How does the application process work?"
        },
        {
            "text": "The application process will vary depending on which type of project you are applying for: a simple application for the Research Starter Projects and Feasibility Projects, and a more detailed application process for the Small and Large R&D Partnership Projects. The latter includes a written application, followed by an interview for shortlisted applications. "
        },
        {
            "text": "All applications will be reviewed by independent expert assessors, with relevant industry or academic expertise. "
        },
        {
            "heading": 3,
            "text": "How can I find out more?"
        },
        {
            "text": "We will be sharing lots more information about the Industry-led R&D Partnerships fund and how to apply before the competitions open in October. We'll also be providing a first look at the exciting projects we have funded in the Farming Innovation Pathways competition. Make sure you’re signed up to Defra’s e-alerts and follow Defra, UKRI and Innovate UK on Twitter to keep up to date with news and alerts for our upcoming competitions."
        }
    ]
}