{
    "url": "https://mhrainspectorate.blog.gov.uk/2021/08/13/transfer-of-analytical-methods/",
    "title": "Transfer of analytical methods",
    "authors": [
        "Chris Smith"
    ],
    "categories": [
        "Compliance matters",
        "Good laboratory practice",
        "Good manufacturing practice"
    ],
    "pub_date": "2021-08-13T11:11:45+01:00",
    "content": [
        {
            "text": "Technical transfer of analytical methods, or analytical method transfer (AMT) is a GMP requirement for those involved in contract manufacturing and testing."
        },
        {
            "text": "The purpose of this post is to provide guidance to manufacturers and contract testing laboratories for the process of transferring a method for outsourcing of testing. Whilst not included within this post, the requirements of EU GMP Chapter 7 should also be met."
        },
        {
            "text": "Analytical method transfer is a verification process which has much in common with the validation activities described in EU GMP Annex 15 and the guidance it contains provides a useful framework to work from."
        },
        {
            "text": "The type of AMT most frequently seen on inspection is comparative testing. Comparative AMT requires both the transferring and receiving laboratory to perform an agreed number of analyses on the same manufacturing batch and compare the data generated within both laboratories."
        },
        {
            "text": "There should be a formal process for the introduction of new methods which allows the receiving laboratory to demonstrate that they can perform the analytical method effectively and reproducibly. It should also ensure that the transfer protocol covers all critical quality attributes and method parameters considered important for maintaining the method’s validated state and ensuring product quality can be consistently met by the receiving laboratory."
        },
        {
            "text": "Regulatory compliance is a shared responsibility and a collaborative approach will give both the transferring and receiving laboratories confidence in the data generated after the AMT is completed. For instance, performing a gap analysis would allow both parties to identify additional validation activities that may be required, and receiving laboratories should identify whether they have the staff and testing capacity to perform testing prior to AMT commencing."
        },
        {
            "text": "The use of risk management principles for AMT can be advantageous when identifying which tests to transfer and the number of tests to be performed. This approach is particularly useful where similar products are already tested using similar techniques."
        },
        {
            "text": "Having performed the AMT - successfully or unsuccessfully - a transfer report should be generated."
        },
        {
            "text": "Finally, here are some common findings around AMT:"
        }
    ]
}