{
    "url": "https://space.blog.gov.uk/2021/08/13/uk-and-iceland-strengthen-ties-for-uk-launch/",
    "title": "UK and Iceland strengthen ties for UK Launch",
    "authors": [
        "Ian Annett"
    ],
    "categories": [
        "Education",
        "International",
        "LaunchUK"
    ],
    "pub_date": "2021-08-13T15:37:58+01:00",
    "content": [
        {
            "text": "Last month, we achieved another key milestone in our Spaceflight Programme – the signing of a Memorandum of Understanding (MoU) between the UK and Iceland."
        },
        {
            "text": "Similar to our existing MoU with the Faroese Government, this arrangement secures the Icelandic Government’s support for UK launch activities and allows for launches from the UK involving Icelandic airspace and waters, in a safe and responsible manner."
        },
        {
            "text": " "
        },
        {
            "heading": 3,
            "text": "What does the MoU do?"
        },
        {
            "text": "Importantly, it provides UK launch companies with greater flexibility over their spaceflight operations whilst also offering certainty over the expectations when operating in or near Iceland’s maritime Exclusive Economic Zone (EEZ)."
        },
        {
            "text": "The signing of this MoU is the culmination of three years' work led by the UK Space Agency, but it was very much a cross-government effort and would not have been possible without the support of industry colleagues."
        },
        {
            "heading": 3,
            "text": "Benefits for young people"
        },
        {
            "text": "But more than that, the MoU with Iceland will help strengthen existing partnership and cooperation between our two countries in space, research, and student mobility – in particular through a new UK Space Agency student grant fund which offers a really valuable education programme for both sides."
        },
        {
            "text": "In addition, we will harness the Chevening Scholarship scheme to enable Icelandic students to study a one-year spaceflight related Master’s Degree at a UK university."
        },
        {
            "text": "This will ensure young people from both the UK and Iceland can share skills and learn from each other where there is mutual interest, helping to ensure we have the best and freshest talent to sustain the future spaceflight industry."
        },
        {
            "text": "Developing the future talent pipeline is vital to the ongoing success of the UK spaceflight industry and this Government is committed to supporting this endeavour."
        },
        {
            "text": "Only last month we announced an exciting new competition that will offer young people aged 16+ the opportunity to design a Nanosat to support the UK’s ambitious net zero targets. This competition forms part of our wider work to help secure a future spaceflight legacy for Great Britain, by inspiring young adults to build the skills needed to work within this exciting and growing sector."
        },
        {
            "text": "Elsewhere, we are providing funding to extend the reach of the CanSat programmme, so more schools across the UK can take part and encouraging a greater number of young people to consider a career in space."
        },
        {
            "text": "The UK Space Agency is also funding opportunities for undergraduate students to work on a spaceflight or satellite-funded projects through our sponsorship of the SPINtern Space Placements in Industry apprenticeship scheme. I could tell you how great it is or just let you read a first-hand account of how the scheme is benefiting students here."
        },
        {
            "text": "In July, our Spaceflight Regulations also came into force enabling the Regulator to receive licensing applications, paving the way for the first launches from the UK next year."
        },
        {
            "text": "This, together with our strong international partnerships and thriving talent pipeline will serve to cement the UK’s reputation as Europe’s most attractive destination for commercial spaceflight activities."
        }
    ]
}