{
    "url": "https://planninginspectorate.blog.gov.uk/2025/09/01/bridging-university-and-career-lessons-from-a-placement-year/",
    "title": "Bridging university and career: Lessons from a placement year ",
    "authors": [
        "Hafren Thomas"
    ],
    "categories": [
        "Appeals",
        "Enforcement",
        "People",
        "Recruitment"
    ],
    "pub_date": "2025-09-01T15:32:33+01:00",
    "content": [
        {
            "text": "Hafren Thomas, a Geography student from the University of Reading, reflects on her transformative placement year as an Environmental Impact Assessment Advisor at the Planning Inspectorate. From hands-on experience with planning appeals to navigating hybrid working, discover how her year in government helped bridge the gap between academic study and career aspirations. "
        },
        {
            "text": "I am a BSc Geography (Human and Physical) student at the University of Reading, who also wanted to include a placement year in my degree.  "
        },
        {
            "text": "A placement year, sometimes called a sandwich year, is an optional year spent working in industry as part of a university degree, usually between the second and final years of study.  "
        },
        {
            "text": "The Environmental Impact Assessment Advisor (Student Placement) role at the Planning Inspectorate is a role designed for students studying an environmental related degree to gain real-life work experience. This role involves a variation of tasks on a day-to-day basis that focuses on project work, environmental screening, skill development, team collaboration, networking and training opportunities. "
        },
        {
            "text": "When I came across the Environmental Impact Assessment Advisor (Student Placement) role it felt like the perfect fit. I’ve always been passionate about how humans interact with the environment and how we can improve that relationship. So, applying for this role was a no-brainer! Now that my placement year is coming to an end, it feels like the right time to reflect on why I chose to do it, what I’ve learned, and the new career paths I’m considering post-graduation. "
        },
        {
            "heading": 2,
            "text": "Why I chose to do a placement year "
        },
        {
            "text": "Like a lot of students, I wasn’t totally sure what career I wanted to pursue after my degree. But I did know that I was interested in the environment, policies that affect it, and what we’re doing to protect it. Since I wanted to get the most out of my degree and build experience in a relevant field, a placement year felt like the perfect way to explore my interests and gain real-world insight. That decision led me straight to this opportunity! "
        },
        {
            "heading": 2,
            "text": "What I've gained from my placement year "
        },
        {
            "heading": 3,
            "text": "My role "
        },
        {
            "text": "Working at the Planning Inspectorate has given me a real behind-the-scenes look at how planning appeals work. I’ve been able to see these processes unfold and even play a role in them myself. My work has ranged from supporting the team on larger projects to screening smaller appeals, handling admin tasks, organising meetings, assisting with report writing, and communicating with arms-length bodies. These are experiences I wouldn’t have gained without taking a placement year, and I’m so grateful for everything I’ve learned. "
        },
        {
            "heading": 3,
            "text": "Achievements "
        },
        {
            "text": "There have been plenty of personal achievements this year like being trusted with contributions to reports, expanding my knowledge of PINS work and understanding the work that goes on to ensure developments are suitable and safe from environmental perspectives. However, my favourite achievements have come from the general work environment itself. I’ve really built on skills like: "
        },
        {
            "heading": 3,
            "text": "Work from home vs office days "
        },
        {
            "text": "I feel incredibly fortunate to have joined an organisation that supported me in exploring the best of both remote and office-based work. Being a hybrid worker has taught me a lot about how I work best and helped me clarify what I want from a future job after university. "
        },
        {
            "text": "Although I was based out of an office in Bristol, I was supported in living at home in Barry. That support came in many forms, from virtual “Coffee Break” meetings where the whole team would drop into breakout rooms for spontaneous chats (replicating that all-important office communication and knowledge sharing), to regular check-ins from colleagues making sure I was coping okay with remote working. I always felt reassured that inboxes were open if I ever needed a chat. "
        },
        {
            "text": "The team’s communication also made it easy to coordinate days in the office with others, which made those in-person moments more beneficial. Whether it was for team meetings, lunchtime walks, or joining in on cake Wednesdays! "
        },
        {
            "heading": 3,
            "text": "Outside the office "
        },
        {
            "text": "One of the standout parts of my placement has been being part of an organisation that supports work-life balance. My biggest worry before joining was the leap from classroom to workplace. What I didn’t expect was how much the team would support that transition with fun, engaging challenges that supported communication beyond “work-chat”. "
        },
        {
            "text": "My favourite was the Around-the-World Challenge. Teams of ten set out to walk the equivalent of Earth’s circumference by the end of February. Each day, we tracked our progress, celebrated new “destinations” reached, and kept each other motivated. It turned out to be a great mix of movement, motivation, and shared achievement that really brought the team closer. "
        },
        {
            "text": "Other honourable mentions include the Veganuary Bake Sale and the 100km in May Challenge. "
        },
        {
            "heading": 2,
            "text": "Looking ahead "
        },
        {
            "text": "My next challenge will be returning to university and tackling a dissertation. Surprisingly, my experience has also shaped my academic journey. The insights I've gained here have inspired the topic and research method I plan to use in my dissertation. "
        },
        {
            "text": "Beyond university my placement has also really helped me think about my options for the future. I’ve been lucky enough to have conversations with individuals about their career journeys, which has given me great insight into different paths and nuggets of advice to take with me. Now, I’m looking into graduate schemes, master’s degree opportunities, gaining experience whilst travelling and roles to figure out the next steps for my career. "
        }
    ]
}