{
    "url": "https://defrafarming.blog.gov.uk/2025/09/01/coming-soon-over-12-million-to-fund-farm-innovation/",
    "title": "Coming soon: Over £12 million to fund farm innovation",
    "authors": [
        "Joss Wallace"
    ],
    "categories": [
        "Payments for research and innovation"
    ],
    "pub_date": "2025-09-01T11:59:18+01:00",
    "content": [
        {
            "text": "I’m pleased to let you know that 2 new competition rounds will open this autumn through the Farming Innovation Programme (FIP). "
        },
        {
            "text": "The competitions offer research groups alongside farmers, growers and foresters the chance to test and develop ideas that could improve productivity, sustainability and resilience in agriculture. "
        },
        {
            "text": "In total, £12.6 million will be split between: "
        },
        {
            "text": "We're not setting specific topics or themes for projects. Instead, we want to fund solutions that the industry tells us are the highest priority.  "
        },
        {
            "text": "This is the fourth round for each of the competitions, delivered in partnership with Innovate UK. These latest competitions are part of the government’s commitment, set out in the Industrial Strategy, to allocate at least £200 million for the Farming Innovation Programme up to 2030. "
        },
        {
            "heading": 2,
            "text": "Feasibility Studies competition "
        },
        {
            "text": "Feasibility Studies projects will test whether a research idea works in real-world conditions. "
        },
        {
            "text": "We want to support early-stage, innovative solutions and encourage businesses to work together on new ideas. There will be a consortia-building event to help you find partners. "
        },
        {
            "text": "Projects can receive between £200,000 and £500,000 in funding and last up to 24 months.  "
        },
        {
            "text": "The guidance will be available on 29 September. We’ll add the link when it’s live. "
        },
        {
            "heading": 2,
            "text": "Small Research & Development Partnerships competition "
        },
        {
            "text": "Small R&D Partnerships projects develop new farming products or services, bringing them closer to commercial use once you’ve proven your idea works in practice. "
        },
        {
            "text": "Projects should range from £1 million to £3 million and can last up to 30 months.  "
        },
        {
            "text": "The guidance for Small R&D Partnerships is available now."
        },
        {
            "heading": 2,
            "text": "Learn more "
        },
        {
            "text": "All projects in each competition must focus on improving the productivity, environmental sustainability and resilience of England’s agricultural, horticultural and forestry sectors. We hope you’ll join the events linked above.  "
        },
        {
            "text": "You can explore inspiring FIP case studies that highlight the real-world projects making a difference on farms and in forests across England.  "
        },
        {
            "text": "From breakthrough technologies to new ways of working, these stories show how fresh ideas are helping to tackle challenges and create a more efficient, sustainable future for the sector. "
        },
        {
            "heading": 3,
            "text": "Success story: RootWave"
        },
        {
            "text": "Our funding helped bring RootWave to market, which replaces chemical herbicide spraying with technology that zaps the weeds with electricity. As well as avoiding soil damage from chemicals, farmers have said that it cuts costs, and works in any weather unlike chemicals which cannot be used in bad conditions. "
        }
    ]
}