{
    "url": "https://space.blog.gov.uk/2025/09/01/elevating-uk-space-ventures-applications-open-for-business-accelerator/",
    "title": "Elevating UK space ventures: Applications open for business accelerator ",
    "authors": [
        "UK Space Agency"
    ],
    "categories": [
        "Catalysing Investment"
    ],
    "pub_date": "2025-09-01T14:04:08+01:00",
    "content": [
        {
            "text": "The UK Space Agency Accelerator is launching new cohorts of its flagship programmes Geo and Fusion: Connect with Capital, designed to help high-potential space businesses secure investment, strengthen leadership, and accelerate commercial growth. "
        },
        {
            "text": "Over the past few years, the UK Space Agency Accelerator has supported participating ventures in raising more than £15 million in private and grant funding. Within that, Geo and Fusion: Connect with Capital alone secured a combined £5.4 million in investment, highlighting the impact of tailored investor support. "
        },
        {
            "text": "Portia Bircher, Accelerating Business Growth Lead at UK Space Agency, said:"
        },
        {
            "text": "Building on the success of the UK Space Agency Accelerator, Geo and Fusion respond to two of the space sector’s most urgent needs: faster scale-up for commercially viable ventures, and stronger investor readiness. "
        },
        {
            "heading": 2,
            "text": "Geo - Supporting scale-up ambitions"
        },
        {
            "text": "Geo is a four-month business enablement programme open to UK-registered companies (TRL 5–9) that are ready to scale. Designed for ventures committed to reaching a multi-million-pound valuation within five years, Geo supports businesses already demonstrating traction through contracts, funding, or revenue. "
        },
        {
            "text": "Participants will benefit from: "
        },
        {
            "text": "By the end of the programme, ventures will have the tools to sustain year-on-year growth, a stronger grasp of advanced financing mechanisms, and an expanded network across the UK space ecosystem. "
        },
        {
            "heading": 2,
            "text": "Fusion: Connect with Capital"
        },
        {
            "text": "Running in parallel, Fusion is a 4-month investment-completion programme tailored to businesses actively raising seed or pre-seed rounds of up to £2 million. Designed for ventures already in investor conversations, Fusion focuses on sharpening pitches, strengthening data rooms, and facilitating direct connections with early-stage investors. "
        },
        {
            "text": "Programme features include: "
        },
        {
            "heading": 2,
            "text": "Driving tangible results for the UK space sector"
        },
        {
            "text": "Geo and Fusion reflect the next evolution of the UK Space Agency Accelerator - programmes built around outcomes, not just participation. Whether it’s securing investment, scaling operations, or strengthening sector leadership, both programmes are designed to help ventures move decisively towards commercial and strategic success. "
        },
        {
            "text": "These new programmes join Shuttle, a complementary programme for established SMEs in adjacent sectors seeking to expand into space applications, further reinforcing the UK’s space entrepreneurship pipeline. "
        },
        {
            "text": "Together, they form a powerful launchpad for UK space ventures by accelerating growth, attracting investment, and enabling sustainable impact in the global space economy. "
        },
        {
            "heading": 2,
            "text": "How to get involved"
        },
        {
            "text": "Applications for Geo and Fusion open on 1 September 2025 and close on 5 October 2025. "
        },
        {
            "text": "Find out more and apply to Fusion: https://www.fusionconnectcapital.co.uk "
        },
        {
            "text": "Apply to Geo and learn more: https://www.ukspaceaccelerator.co.uk/geo "
        },
        {
            "text": "The UK Space Agency Accelerator is funded by the UK Space Agency and delivered in partnership with venture acceleration and ecosystem experts, Entrepreneurial Spark. "
        }
    ]
}