{
    "url": "https://companieshouse.blog.gov.uk/2025/09/01/get-paid-on-time-and-free-your-mind-to-focus-on-business-growth/",
    "title": "Get paid on time and free your mind to focus on business growth",
    "authors": [
        "Emma Jones CBE - Small Business Commissioner"
    ],
    "categories": [
        "Running a company",
        "Starting a company"
    ],
    "pub_date": "2025-09-01T10:38:23+01:00",
    "content": [
        {
            "text": "The Office of the Small Business Commissioner (OSBC) is an independent public body set up by the government to tackle late payment and unfavourable payment practices."
        },
        {
            "text": "The OSBC was created in 2017 and works to support small businesses with contracting and payment issues, and with bigger businesses to identify small to medium enterprises (SMEs) in the supply chain and adapt processes to pay promptly."
        },
        {
            "heading": 2,
            "text": "The impact of chasing payment"
        },
        {
            "text": "In line with the government’s small business plan published in July 2025, research was released looking at the impact of late payment in the UK. Shockingly, the figures showed that 38 companies go out of business every day due to overdue invoices, and small businesses spend an average of 86 hours chasing debt. The cost of this issue to the economy is a whopping £11bn."
        },
        {
            "text": "Alongside this research, a consultation was opened looking at new measures to speed up payment terms and times, with a focus on large companies paying their smaller suppliers."
        },
        {
            "text": "As someone who’s been a founder and company director myself, I know what a thankless task it is to chase clients for payment for products and services delivered. If we can address this issue, it will free up precious time and money that can instead be spent on business growth tasks."
        },
        {
            "heading": 2,
            "text": "The work of the OSBC"
        },
        {
            "text": "The OSBC recently launched the Fair Payment Code to which companies of any size can apply to one of its 3 levels (bronze, silver or gold). It recognises businesses that are doing the right thing and paying suppliers on time. We’re currently working on signing up more household names to the Code, as well as companies that are strategic suppliers to government."
        },
        {
            "text": "For times when small businesses continue to struggle with late paying clients, we have a casework team that can investigate complaints and aim to get payments made and disputes resolved."
        },
        {
            "text": "The new measures being consulted on would take the powers of the OSBC further by:"
        },
        {
            "text": "After responses to the consultation are received, these new measures would go through a process of becoming law over the next couple of years."
        },
        {
            "heading": 2,
            "text": "How digital technology plays a part"
        },
        {
            "text": "As well as the fair payment code, the casework team and potential new legislation, we’re looking at how digital technology can speed up payment times."
        },
        {
            "text": "At an individual company level, there’s plenty of evidence to show small firms that adopt digital tools, such as cloud accounting, get paid quicker."
        },
        {
            "text": "At a macro-economic level, we’re starting test activity with the Centre for Finance, Innovation and Technology, to explore how the UK’s lead in Open Finance (opening up of a businesses’ transaction data) can make money move faster through the system, and into the hands of small businesses."
        },
        {
            "text": "AI is also having a positive impact as business owners and account departments can set prompts to chase late invoices and let the technology do the work."
        },
        {
            "heading": 2,
            "text": "The benefits of faster money flows"
        },
        {
            "text": "If we get this right and get money moving faster, it will free up founder time to focus instead on tasks like hiring, exporting, innovating and selling, which is what businesses do best."
        },
        {
            "text": "Each week we’re updating on payment progress, and introducing other government departments and agencies set up to support small businesses and their growth ambitions."
        },
        {
            "text": "Sign up to the small business boost newsletter and be part of the journey to build a positive payment culture across every supply chain in the UK."
        }
    ]
}