{
    "url": "https://hmlandregistry.blog.gov.uk/2025/09/01/the-land-registration-academy-shaping-the-future-of-our-caseworkers/",
    "title": "The Land Registration Academy – shaping the future of our caseworkers",
    "authors": [
        "Jeff Saunders, Head of Service Delivery – People, Strategic Improvement & Planning"
    ],
    "categories": [
        "Working at HM Land Registry"
    ],
    "pub_date": "2025-09-01T12:30:20+01:00",
    "content": [
        {
            "text": "Improving our speed of service for our customers is our main priority at HM Land Registry. You can read more about a recent milestone, and our plans to continue this progress, in our recent blog by Chief Executive and Chief Land Registrar Simon Hayes.  "
        },
        {
            "text": "Our people are the most crucial element to making these improvements happen. Just like a property cannot stand without a solid foundation, we can’t deliver exceptional services without our highly skilled, expert staff. While we are starting to reap the benefits of this, with more applications completed each month, land registration skills and expertise take time to build.  "
        },
        {
            "text": "Our expert people require sustained investment in training and development on the job as part of a long-term programme that ensures flexibility, resilience and responsiveness to an unpredictable market. This is where our award-winning Land Registration Academy comes in.  "
        },
        {
            "heading": 2,
            "text": "Investing in our people: the Land Registration Academy in numbers"
        },
        {
            "text": "Launched in April 2021, our Land Registration Academy recognises that we are an organisation of expert people where technical knowledge is essential for service delivery.  "
        },
        {
            "text": "Since launching, we have trained over 4,000 new starters or existing colleagues."
        },
        {
            "text": "As well as upskilling our expert caseworkers, we have launched and implemented trainer development and career paths, recruiting around 75 technical trainers across different grades. This will transform our capacity and delivery outcomes as we invest in the technical capability of our trainers. "
        },
        {
            "text": "We were delighted that we were recently recognised as one of the 57 exceptional training programmes to receive the prestigious Princess Royal Training Award this year. This is in addition to our training team winning ‘Gold’ in the UK National Contact Centre Awards last summer, reflecting the level of effort and pride we take in improving our services for our customers."
        },
        {
            "text": "Deb Hobkirk, Technical Development Lead, said:  "
        },
        {
            "heading": 2,
            "text": "Training alongside automation "
        },
        {
            "text": "As we invest in automating as much of our work as is practically possible, we do so to support our caseworkers in handling applications requiring expert judgement, such as multi-title applications, first registrations or lodging new leases. "
        },
        {
            "text": "We know that having to wait months for an application to be completed can be frustrating, which is why training our caseworkers to work on more application types is one of the priorities in improving our speed of service. And as we introduce greater levels of automation across HM Land Registry, we can move more of our people onto the complex applications and return those to customers sooner.  "
        },
        {
            "text": "When training evolves alongside changing market demands, it helps our team remain adaptable, efficient and equipped to provide the highest quality service. Ultimately, the ongoing process of learning and growth directly translates into a better overall customer experience. "
        },
        {
            "heading": 2,
            "text": "What does this mean for our customers?"
        },
        {
            "text": "As we continue to invest in the growth and development of the academy, our trainers and our learners, it’s exciting to see how these efforts translate into a better experience for our customers. Of course, just as no single factor can be attributed to the cause of our delays, there is no single solution to improving our service to the standards our customers deserve.  "
        },
        {
            "text": "We’ve implemented more specialist teams to focus specifically on some of our most complex applications which tend to comprise many of the oldest cases. We have enhanced our digital services to improve speed and control when submitting and managing applications and explored further automation within our services to increase processing speed. "
        },
        {
            "text": "None of this progress would be possible without our customers’ unwavering support. Our service is shaped by your feedback, challenge and collaboration. This has directly led to other initiatives designed to further improve our progress which you will hear more about in the coming months as our we continue our series of updates.  "
        },
        {
            "text": "Please remember, we also offer a range of free training for customers, from online webinars to in person workshops. Visit the training hub for more details. "
        }
    ]
}