{
    "url": "https://buyingforschools.blog.gov.uk/2025/09/01/wanted-school-governors-with-procurement-expertise/",
    "title": "Wanted: School governors with procurement expertise",
    "authors": [
        "Wendy Burdon, Schools Commercial Innovation and Development Team"
    ],
    "categories": [
        "Advice and support"
    ],
    "pub_date": "2025-09-01T11:21:14+01:00",
    "content": [
        {
            "text": "Wendy Burdon is a primary school governor and works for the DfE's Schools Commercial Innovation and Development Team. She explains why more procurement professionals are needed to become governors and trustees."
        },
        {
            "text": "Precision, strategy, and value for money. These things are the backbone of procurement professionals’ work – and exactly what school governing boards across the country need."
        },
        {
            "text": "I've been a governor at a small local primary school for the last eight years and absolutely love it, which is why I jumped at the chance to lead a campaign to encourage more commercial and procurement experts to become school governors."
        },
        {
            "text": "The aim is to strengthen educational governance by recognising the value commercial expertise adds to boards. By bringing these skills to governing boards, schools can improve their financial efficiency and ultimately enhance educational outcomes for pupils."
        },
        {
            "text": "There are currently around 20,000 vacancies for governors and trustees in England and Wales, and it would be great not only to fill those – but to do it with people that have procurement expertise."
        },
        {
            "text": "Schools and trusts are managing multi-million-pound budgets with increasing scrutiny and complexity. A critical aspect of governance is ensuring that public funds are spent effectively."
        },
        {
            "text": "That's why this campaign to get procurement professionals – people who know how to buy things well - to join school governing boards and share their knowledge is so important. Schools and trusts should be actively looking for people with commercial skills when they recruit new board members."
        },
        {
            "heading": 3,
            "text": "Supporting our campaign"
        },
        {
            "text": "The campaign has the support of the Chartered Institute of Procurement & Supply (CIPS) and Government Commercial Function. Through their combined membership we hope to reach around 25,000 procurement professionals."
        },
        {
            "text": "It’s also supported by Governors for Schools who are hosting the campaign page, where you can quickly and easily register your schools’ governor vacancies or submit an application to become a governor or trustee."
        },
        {
            "text": "The National Governance Association (NGA) and the Confederation of Schools Trusts (CST) are also promoting the campaign."
        },
        {
            "heading": 3,
            "text": "How your school or MAT will benefit"
        },
        {
            "text": "Having someone with buying experience on your board can bring real benefits to your school, including:"
        },
        {
            "text": "Someone with commercial experience can help you focus your procurement activity and ensure it is aligned with your school’s mission and strategic objectives."
        },
        {
            "text": "For example, you might prioritise projects that enhance inclusion or help underpin educational achievement."
        },
        {
            "text": "Commercial experts know how to make your money work harder. They understand when to negotiate, how to combine purchases to get bulk discounts, and when it makes sense to invest more upfront for long-term savings."
        },
        {
            "text": "For example, they might suggest buying certain equipment outright instead of leasing it or show how switching to energy-efficient lighting could cut your electricity bill."
        },
        {
            "text": "The Procurement Act brings changes that affect how schools buy goods and services. It can be confusing to understand what these rules mean for your school."
        },
        {
            "text": "A procurement expert can translate these regulations into plain English and help your school stay compliant. They can help you avoid costly mistakes and ensure you're following the correct processes."
        },
        {
            "text": "Good procurement isn't just about finding the cheapest option. It's about getting the best value for money."
        },
        {
            "text": "A commercial expert can help your school to buy better and smarter. They might help you find local suppliers to support your community, choose more environmentally friendly options, or build better relationships with suppliers so they provide better service."
        },
        {
            "text": "Commercially skilled governors can ask thoughtful questions about procurement processes, contracts and habitual practices that could be improved."
        },
        {
            "text": "For example, they might ask: How does this align with our strategic goals? Could we achieve better outcomes with a different approach? How could we get better value? Could we use a suitable framework?"
        },
        {
            "heading": 3,
            "text": "Updated guidance"
        },
        {
            "text": "I’ve also been working to make sure procurement guidance is available for governing boards. Working alongside our partners, together we have been reviewing guidance available; adding to and bringing it up to date. On GOV.UK, updated Buying for schools guidance provides access to a range of resources to help schools when it comes to buying goods and services, to make sure you are getting the best value and are compliant with procurement regulations."
        },
        {
            "text": "The latest  Academy Trust Handbook 2025 includes procurement basics, social value and sustainability considerations and details around compliance with the Procurement Act 2023 that went live on 24 February 2025."
        },
        {
            "heading": 3,
            "text": "A rewarding role"
        },
        {
            "text": "For procurement professionals considering board membership, I can promise it's a deeply rewarding experience."
        },
        {
            "text": "My school doesn’t have a procurement professional and as a governor with commercial expertise, I feel like I'm making a difference and proud to be able to help. It’s a role that challenges you professionally - but it is incredibly satisfying to see how your expertise can directly benefit children's education."
        },
        {
            "text": "Schools need your expertise. If you're a school or trust looking for new governors, recruit someone with buying or contract management experience."
        },
        {
            "text": "If you work in procurement, volunteer to join a school board. Your skills will directly improve children's education and help schools get better value for money."
        },
        {
            "text": "If you’ve found this article useful and want to learn more about how we’re supporting schools, click ‘sign up and manage updates’ at the top right of this page to subscribe to our blog and receive notifications when we next post."
        }
    ]
}