{
    "url": "https://naturalengland.blog.gov.uk/2025/09/01/why-access-and-inclusion-matter-in-our-protected-landscapes/",
    "title": "Why access and inclusion matter in our protected landscapes  ",
    "authors": [
        "Marian Spain"
    ],
    "categories": [
        "Connecting People with Nature",
        "Education",
        "Mental health and wellbeing",
        "Natural England",
        "Nature",
        "Parks, trails and nature reserves",
        "Wildlife"
    ],
    "pub_date": "2025-09-01T11:29:28+01:00",
    "content": [
        {
            "text": "By Marian Spain, Chief Executive of Natural England "
        },
        {
            "text": "Earlier this month I had the pleasure of visiting Dartmoor National Park and meeting the inspiring Kats Koster-Shadbolt, winner of last year’s New Perspective Award at the Campaign for National Parks’ National Park Protector Awards. "
        },
        {
            "text": "Kats and her team are doing extraordinary work to connect young people with Dartmoor’s wild beauty - many of them experiencing a National Park for the very first time. From Girls Do Dartmoor to Night Under the Stars, these projects are about more than just spending time outdoors; they’re about belonging, confidence, joy, friendships and creating memories that can spark a lifelong connection with nature. "
        },
        {
            "text": "Seeing the enthusiasm of the young people and the dedication of Kats and her team was a real reminder of why this work matters. Research has shown that not everyone in our society has the same opportunity to visit or feel at home in protected landscapes - National Parks, National Landscapes and National Trails, even though they were created for everyone- the whole nation- to enjoy.  "
        },
        {
            "text": "In 2019, the government commissioned a review of our protected landscapes called the Landscapes Review. This research, among others, reported that older people, young people, those from lower-socio economic or working-class backgrounds, people with disabilities, and those from a Black, Asian and ethnic minority backgrounds were much less likely to visit and enjoy protected landscapes.  "
        },
        {
            "text": "Sometimes the barriers are practical, like transport or cost. Other times, they are invisible but just as real - a lack of confidence, of not belonging a fear for personal safety, of not seeing friends and family connecting with nature as part of everyday life, or even as Kat told me, worries for girls about coping without a toilet. "
        },
        {
            "text": "That need to understand and address barriers to access for all is one of the reasons why the Protected Landscapes Partnership (PLP) was established. Bringing together Natural England, National Landscapes Association, National Parks England, and National Trails UK, with support from Defra, it is working to ensure these special places are for everyone.  "
        },
        {
            "text": "Natural England is proud to support the partnership’s Equity, Diversity and Inclusion (EDI) Workstream, which develops innovative projects to engage new audiences, diversify the sector, and create a genuine sense of welcome for all. "
        },
        {
            "text": "The projects I saw in Dartmoor are a shining example of what this looks like in practice. They break down barriers, create inclusive spaces, and show young people that nature is theirs to enjoy and care for. They also demonstrate that EDI in our landscapes isn’t just a “nice to have” - it’s an essential part of keeping these places alive and relevant for future generations. "
        },
        {
            "text": "In order to make our protected landscapes truly welcoming, organisations need to consider a wide range of strategies to break down these barriers. An example of this from the PLP includes Nature Calling, a flagship programme led by the National Landscapes Association, which works closely with artists in the landscape to engage new audiences in our towns, cities and countryside. "
        },
        {
            "text": "We face huge environmental challenges, from biodiversity loss to climate change, but the fight for nature has always gone hand in hand with the need for access. Protected landscapes like Dartmoor are for everyone - yet that principle only holds true if people from all backgrounds and of all ages feel able to visit and enjoy them. "
        },
        {
            "text": "My visit to Dartmoor reinforced just how important it is to make these places genuinely inclusive. When we remove barriers and create a real sense of welcome, we are setting up a new generation to advocate, care and celebrate these places.  "
        },
        {
            "text": "Why not explore what programmes your nearest protected landscape are running. Find out more at National Landscapes - National Landscapes, National Parks England, and Find your perfect trail, and discover the land of myths and legend - National Trails "
        }
    ]
}