{
    "url": "https://educationhub.blog.gov.uk/2022/07/advice-for-schools-and-other-education-settings-during-a-heatwave/",
    "title": "Advice for schools and other education settings during a heatwave",
    "authors": [
        "Media Officer"
    ],
    "categories": [
        "Colleges",
        "early years",
        "Schools"
    ],
    "pub_date": "2022-07-14T16:42:40+01:00",
    "content": [
        {
            "text": " "
        },
        {
            "text": "During heatwaves it’s important that everyone stays safe and makes sure they drink plenty of water and avoids being exposed to the sun for too long – this is especially important for children."
        },
        {
            "text": "We aren’t advising schools to close during high temperatures, but school leaders should make sure they take any steps necessary to make sure children are safe and comfortable."
        },
        {
            "text": "The Department for Health and Social Care has published guidance for schools and early years settings to help them, while the Health and Safety Executive provides general guidance for employers including education settings on how to manage high temperatures."
        },
        {
            "text": "Here are the key points:"
        },
        {
            "heading": 3,
            "text": "Children are more susceptible to high temperatures than adults "
        },
        {
            "text": "According to the Department for Health and Social Care, children cannot control their body temperature as efficiently as adults during hot weather because they do not sweat as much and so can be at risk of ill-health from heat. Heat-related illness can range from mild heat stress to heatstroke."
        },
        {
            "text": "The main risk from heat is dehydration (not having enough water in the body). If sensible precautions are taken children are unlikely to be adversely affected by hot conditions but teachers, assistants, school nurses and all child carers should look out for signs of heat stress, heat exhaustion and heatstroke."
        },
        {
            "heading": 3,
            "text": "How to protect children from the heat "
        },
        {
            "text": "The Department of Health and Social Care recommends children should not take part in vigorous physical activity on very hot days, such as when temperatures are in excess of 30°C. Children should wear loose, light-coloured clothing to help keep cool and sunhats with wide brims and should stay in the shade as much as possible. Sunscreen should be used to protect skin and children should be provided with plenty of water."
        },
        {
            "text": "In terms of how to manage heat indoors, they recommend that, where possible, windows should be opened as early as possible in the morning before children arrive, or preferably overnight to allow stored heat to escape from the building (checking insurance conditions and need for security if windows are to be left open overnight). Windows should be closed when the outdoor air becomes warmer than the air indoors – this should help keep the heat out while allowing adequate ventilation. Indoor blinds or curtains can be closed where possible but should not block ventilation."
        },
        {
            "text": "The use of electric lighting should be kept to a minimum and equipment should not be left in ‘standby mode’ as this generates heat. Oscillating mechanical fans can be used to increase air movement if temperatures are below 35°C – at temperatures above 35°C fans may not prevent heat-related illness and may worsen dehydration."
        },
        {
            "heading": 3,
            "text": "The health and safety executive provides general advice for employers on how to maintain a more comfortable working environment in high temperatures "
        },
        {
            "text": "By law there is no maximum temperature for a workplace but the Health and Safety Executive is clear that the temperature in any workplace, including education settings, should be reasonable."
        },
        {
            "heading": 3,
            "text": "Here are the signs of heat related medical conditions in children"
        },
        {
            "text": "The signs of heat stress are:"
        },
        {
            "text": "The signs of heat exhaustion include:"
        },
        {
            "text": "The symptoms are often the same in adults and children, although children may become floppy and sleepy."
        },
        {
            "text": "If someone is showing signs of heat exhaustion, they need to be cooled down."
        },
        {
            "text": "Signs of heatstroke include:"
        },
        {
            "text": "For more information on heat related illnesses visit the Department for Health and Social Care’s website."
        },
        {
            "heading": 3,
            "text": "If a child is suffering from heat related illness these are the steps you should take"
        },
        {
            "text": "As with any concern about a child’s health, schools will have their own policies around contacting parents and guardians and these should be followed."
        }
    ]
}