{
    "url": "https://gds.blog.gov.uk/2022/07/14/building-an-inclusive-environment-at-the-government-digital-service/",
    "title": "Building an inclusive culture at the Government Digital Service",
    "authors": [
        "Tom Read - Chief Executive Officer, Government Digital Service"
    ],
    "categories": [
        "GDS team",
        "People and skills"
    ],
    "pub_date": "2022-07-14T12:00:06+01:00",
    "content": [
        {
            "text": "\nMaking our organisation a genuinely representative, inclusive place - where people feel that they belong - is a priority for me, and for my leadership team. GDS needs to keep learning how to be better, so in this blog post I will briefly explain why creating a safe, diverse and inclusive culture for staff matters, what our data show and where we are going to be focusing our efforts."
        },
        {
            "heading": 2,
            "text": "Why this matters"
        },
        {
            "text": "GDS exists to help government make brilliant public services for everyone. We do that by running major services like GOV.UK, and by building digital products that underpin digital services built by other parts of government. To achieve this, it is vital that our teams reflect the rich diversity of the society we serve. Having diverse teams with alternative perspectives means we’re less likely to fall into group-think or miss important inclusivity considerations. It’s not a “nice to have”, it needs to be part of our DNA."
        },
        {
            "text": "By way of example, right now our biggest programme is building a new single-sign on and digital identity service that will be used by every department and agency in the UK government. We call this “One Login for Government”. Proving your identity is a hugely complex topic, and we have to be constantly thinking of how our design would work or feel to different groups."
        },
        {
            "text": "Users will have the option to use facial recognition and matching to prove their identity, and this needs to work whatever their skin colour or facial shapes. People will be able to prove they are who they say they are by answering “knowledge-based verification” questions. This needs to work for people with a mortgage and a credit card, but also for someone who has just left prison and doesn’t have much in the way of a digital credit history."
        },
        {
            "text": "By ensuring our teams are diverse and representative, we will have a richer, more creative, and higher-performing GDS."
        },
        {
            "heading": 2,
            "text": "What our data tells us"
        },
        {
            "text": "It is important for us to remember that the data can’t tell us much about the lived experience of staff. Diversity is not the same thing as a culture that is safe and inclusive. That said, the data are worth looking at. Here are a few interesting points."
        },
        {
            "text": "At the end of May 2022, 50% of the GDS workforce was female, 20% were from an ethnic minority background and 10% declared a disability."
        },
        {
            "text": "We have a good gender balance at GDS at all grades, especially compared to the wider tech sector, with the Tech Charter annual report reporting that the tech workforce in the UK has a 21% female workforce as per the 2019 Office of National Statistics (ONS) data. However, we also have a 10.4% average gender pay gap (6.6% median)."
        },
        {
            "text": "The ethnic diversity of our teams is similarly better than average, with the Civil Service dashboard reporting that 13.6% of the UK’s working population are from ethnic minorities. But again, we have an average ethnicity pay gap of 12.36% (median 6.62%)."
        },
        {
            "text": "At the end of May 2022, 10% of the Government Digital Service workforce reported that they had a disability (compared to the 21% of UK working age adults as a whole, according to National Statistics); 3% preferred not to say and 20% chose not to declare."
        },
        {
            "text": "Currently, 10% of our workforce is lesbian, gay or bisexual (compared to 2.7% of the UK adult population as a whole as recorded in 2019, per the ONS); 10% preferred not to say and 21% chose not to declare."
        },
        {
            "heading": 2,
            "text": "Where we are focusing our efforts"
        },
        {
            "text": "Over the next 12 months, we are focusing on the following 5 areas to make GDS a fairer and more inclusive place for our people:"
        },
        {
            "heading": 3,
            "text": "1. Open recruitment"
        },
        {
            "text": "To make sure our teams are diverse, we need to try harder to foster connections with diverse technology groups (like Black Women in Tech and Girls Who Code), and to make our adverts appeal to everyone."
        },
        {
            "text": "We have been committed to using diverse recruitment panels for a long time, making sure our panels feature a mix of people who represent different genders, races, backgrounds and ethnicities. We think that’s a step in the right direction but also recognise that it can place a greater burden on some groups - who get asked to sit on lots of panels on top of their busy day jobs - so we need to strike a balance and widen the pool of potential volunteers."
        },
        {
            "text": "We’re also introducing ‘This is Me’ biographies so interviewees get a better idea of the experience and diversity of the panel they will be speaking to in advance."
        },
        {
            "heading": 3,
            "text": "2. Inclusion training for line managers"
        },
        {
            "text": "We are ensuring that all of our people managers in GDS are trained on building an inclusive culture, becoming disability confident, and making sure that everyone is treated fairly."
        },
        {
            "heading": 3,
            "text": "3. Challenging inappropriate language and behaviours"
        },
        {
            "text": "We are training our people to be active bystanders and teaching them how to challenge behaviours that have no place in our organisation."
        },
        {
            "heading": 3,
            "text": "4. Diversity champions"
        },
        {
            "text": "All of our diversity networks will have a senior civil servant champion, and ensuring the networks prosper will be in the performance objectives of everyone in our leadership team."
        },
        {
            "text": "We will be running workshops to build closer links between all network leads and their sponsors, to set out what it means to be a network champion and provide a space for them to share best practice."
        },
        {
            "heading": 3,
            "text": "5. Introduce assurance of pay agreement for new and existing female and ethnic minority recruits"
        },
        {
            "text": "We will be recruiting circa 200-250 people in 2022/23 - this is an excellent opportunity to address the pay gap, or a potential risk to make it worse. We also want to look at the pay gap for all existing staff.  The digital, data and technology (DDaT) allowances give us a mechanism to do that."
        }
    ]
}