{
    "url": "https://charitycommission.blog.gov.uk/2022/07/14/charities-must-show-prudence-to-retain-trust-during-crisis-ahead/",
    "title": "Charities must show prudence to retain trust during crisis ahead",
    "authors": [
        "Orlando Fraser QC"
    ],
    "categories": [
        "Public Trust",
        "Research"
    ],
    "pub_date": "2022-07-14T16:11:54+01:00",
    "content": [
        {
            "text": "First published in the Telegraph newspaper on 14 July."
        },
        {
            "text": "There can be no doubt that we are living in tumultuous times. Last week’s dramatic events in Westminster have captured headlines around the world, while the war that continues to rage in Ukraine represents a grave threat to security in Europe. Much closer to people’s homes, another storm is building: the rapidly increasing cost of living is expected to plunge many families into acute financial precarity in the months ahead. Many more will face financial worries of some degree as prices of groceries, household energy, road fuel and other essentials continue to rise."
        },
        {
            "text": "It is during such times of collective challenge that charities come into their own, offering practical relief and other less tangible, but no less precious commodities: hope, community, and a sense of belonging. We have witnessed this again and again, most recently during the pandemic, and in response to the invasion of Ukraine earlier this year. I am confident that, as economic difficulties deepen, charities will again step up to the plate, serving as lightning rods for compassion, kindness, and resilience."
        },
        {
            "text": "But as demand for charities’ support grows, they too face financial strain. With households’ discretionary spending squeezed, some of those who previously donated generously may curtail their giving. Charities also face the same inflationary pressures as the rest of us. After a pandemic that saw many charities spend down their reserves, these growing demands may bring some organisations to the brink."
        },
        {
            "text": "And there are more subtle, and arguably more profound tests ahead for all charities. As we all tighten our belts, charities will need to be able to justify every penny of their spending. The public will be even less tolerant of financial carelessness in charities during times of financial crisis. Trustees and charity leaders ought to demonstrate the same skills and qualities their donors do: frugality, and restraint."
        },
        {
            "text": "This is not just my opinion. Today, we publish the latest findings of our regular research tracking public trust and confidence in charities. They show that trust in the sector has largely held up over the last year, while many other institutions have suffered plunging levels of public confidence. Charities remain among the most trusted groups in society. This is welcome, and vital. But a closer look reveals that this trust is conditional. The public has clear expectations of charity leaders, notably that a high proportion of funds goes on the end cause, and that charities make a tangible, positive difference. The public also places great emphasis on leadership in charities – they want to see charities living their values not just in what they achieve, but how they do so."
        },
        {
            "text": "As regulator, we don’t expect the trustees who lead charities – largely volunteers – to be super-human. I aim to lead an expert Commission that is fair, balanced and independent, and that means that while we will robustly tackle the most egregious wrongdoing, a major focus for us in the months and years ahead will be to offer support to trustees to get things right."
        },
        {
            "text": "But I urge charities to listen to what the public is telling them, and to keep in mind, at all times, one of their most basic legal duties, namely that of prudence. A central principle even during times of calm, this will become an ever more important watchword as charities navigate the difficult months ahead, stewarding the charitable funds they are entrusted with."
        }
    ]
}