{
    "url": "https://defrafarming.blog.gov.uk/2022/07/14/free-business-advice-next-phase-to-start-in-october/",
    "title": "Free business advice: next phase to start in October",
    "authors": [
        "Andrew Powley"
    ],
    "categories": [
        "Transition support"
    ],
    "pub_date": "2022-07-14T10:59:28+01:00",
    "content": [
        {
            "text": "Any farmer or land manager who receives BPS (Basic Payment Scheme payments) in England is eligible for free business advice during the early years of the agricultural transition. "
        },
        {
            "text": "The Future Farming Resilience Fund awards grants to organisations. These organisations then provide free business advice. They work with farmers and land managers to understand how the changes to farming will affect their businesses and help them to plan for the future. "
        },
        {
            "text": "Different advice providers offer different kinds of support, in different sectors. Many of them offer 1-to-1 consultations and farm visits, followed up by recommendations in a report. Others provide workshops, webinars, tours and networking opportunities to help farmers get support from other farmers. "
        },
        {
            "text": "As we explained when we launched the fund, we’re offering this support in phases. "
        },
        {
            "text": "The current ‘interim phase’ of support will close at the end of August. "
        },
        {
            "text": "So far, 6,600 farmers have accessed this free advice. A few organisations are still offering advice, so do visit the full list of providers on GOV.UK. The organisations are arranged by county."
        },
        {
            "heading": 2,
            "text": "Scaling up support"
        },
        {
            "text": "The next and final phase of support will open in October and it will be scaled up. £32 million has been awarded to 17 organisations. This will support up to 32,000 farmers and land managers."
        },
        {
            "text": "From October 2022 until March 2025, farmers and land managers will be able to contact: "
        },
        {
            "text": "Before the next phase opens in October, we’ll share a list of all the advice providers, the areas they cover, the type of support available and contact details for you to get in touch directly."
        },
        {
            "text": "If you’ve received free business advice through the Future Farming Resilience Fund and want to share your experience, please comment below. "
        },
        {
            "text": "Hear from farmers who have received free business advice by watching the video below."
        }
    ]
}