{
    "url": "https://buyingforschools.blog.gov.uk/2022/07/14/its-never-too-early-to-start-planning-when-buying-for-your-school/",
    "title": "It’s never too early to start planning when buying for your school",
    "authors": [
        "Peter McMullan, Senior Category Manager at the Crescent Purchasing Consortium (part of the CPL Group)"
    ],
    "categories": [
        "Advice and support"
    ],
    "pub_date": "2022-07-14T09:55:02+01:00",
    "content": [
        {
            "text": "Peter McMullan is the Senior Category Manager at the Crescent Purchasing Consortium (part of the CPL Group). Crescent Purchasing Consortium provide several of the DfE approved frameworks including building cleaning services and outsourced catering services. Access to these frameworks and more can be found at Get help buying for schools on GOV.UK. "
        },
        {
            "text": "Peter looks at the importance of planning ahead when buying for your school and why you don’t necessarily need to wait for the school holidays to make big changes."
        },
        {
            "text": "Planning ahead for all your buying needs is a must when buying for your school. If you need to buy goods and services for work planned during the school holidays, you should start the process well in advance. Public sector buying organisations like ours always see an increased demand in the lead up to key holidays periods such as Easter and Summer holidays. This spike in demand can sometimes mean that suppliers are overwhelmed by the volume of invitations to tender and won’t always have the capacity to bid for everything that comes their way. To avoid these busy periods you can, and should, start as early as possible to allow yourself the widest range of suppliers."
        },
        {
            "text": "Keeping a register of your existing supply contracts and expiry dates is an excellent way of identifying your future buying needs. Consider allowing 6-12 months for high value or strategically important buying."
        },
        {
            "text": "Once you have identified what you need to buy, you should start the planning process by drawing up a timeline. This will provide a prompt for each of the key steps in the buying process and will ensure you haven’t forgotten anything. Your timeline should include key milestones such as the date you will publish your invitation to tender (ITT), the last date for supplier queries, the final tender return date, and the date you intend to award."
        },
        {
            "text": "The importance of pre-market engagement"
        },
        {
            "text": "The buying process should always start with you talking to suppliers before you commence the formal buying process. This is called pre-market engagement and is a good opportunity to warm up and increase your knowledge of the market. It is also a signal to suppliers that you will soon be issuing an ITT or further competition and that you will be looking for quotes and responses from them."
        },
        {
            "text": "As a rule, you should allow 1 to 2 weeks for pre-market engagement, but it will depend on the complexity of your needs."
        },
        {
            "text": "Provide a quality specification"
        },
        {
            "text": "Before you send your specification out, ask yourself whether it is detailed enough for suppliers to provide a comprehensive response. Have you used all the insight that you have gained from your pre-market engagement? Use templates if you can and look at best practice examples."
        },
        {
            "text": "It's worth noting that by offering commitment to suppliers rather than more reactive ‘spot’ buying, it could make you a more attractive customer to suppliers and therefore increase both the number and competitiveness of quotes received. You should consider this within your specification."
        },
        {
            "text": "Give suppliers sufficient time to respond"
        },
        {
            "text": "Giving suppliers sufficient time to respond is more likely to attract a quality response. Insufficient deadlines can result in poor quality quotes, or suppliers may not submit a bid at all, potentially compromising your tender exercise."
        },
        {
            "text": "The timescales to allow for supplier responses will vary depending on the complexity of the requirement. Best practice suggests a minimum of 2 weeks from issuing the ITT to receipt of supplier bids. A longer timescale will be needed for more complex requirements, such as those that involve a supplier site visit prior to bid submission. We would recommend a minimum of 5 weeks for suppliers to respond to an ITT for these more complex types of buying, or longer if possible."
        },
        {
            "text": "You should build extra time into your schedule if buying during a busy period, for example for a 1 August delivery deadline, over Christmas or bank holidays. Suppliers may not hold stock if the volume required is high, and will need time to seek and confirm delivery dates."
        },
        {
            "text": "The evaluation period"
        },
        {
            "text": "Once your ITT period closes, you will then begin the process of evaluating proposals received from potential suppliers against your evaluation criteria. It is good practice to document your evaluation process via an evaluation matrix where responses can be assessed and scored against your advertised criteria, for example qualitative elements like service delivery, account management, innovation and social value as well as quantitative elements like pricing schedules. Managing your evaluation in a structured manner will ensure that your process retains the core principles of openness, transparency, and fairness. When using a framework agreement for your buying, the framework provider will often provide you with an evaluation template to help you compare bids."
        },
        {
            "text": "It can be frustrating when a low volume of bids is received. Suppliers have various reasons as to why they do not bid for an opportunity, for example the supplier might have capacity issues and be unable to take on the additional workload, or the opportunity is of such low value that the supplier cannot make a profit on it. We will always request to suppliers that they provide feedback where they choose to not bid, although undertaking a pre-market engagement exercise should mitigate any surprises here. It is best practice for both parties to provide feedback following a buying exercise as it may help guide future exercises."
        }
    ]
}