{
    "url": "https://ukhsa.blog.gov.uk/2022/07/14/staying-safe-in-extreme-heat/",
    "title": "Staying safe in extreme heat",
    "authors": [
        "Agostinho Moreira Sousa"
    ],
    "categories": [
        "Health Protection"
    ],
    "pub_date": "2022-07-14T12:50:57+01:00",
    "content": [
        {
            "text": "At this time of year most of us look forward to a bright blue sky with the sun shining. Being able to enjoy warm weather with friends and family and spending time outdoors. It makes a huge difference to what can feel like a long, cold winter – and after the pandemic we need a good summer more than ever."
        },
        {
            "text": "We want everyone to be able to enjoy the hot weather throughout the summer, however very high temperatures can have significant health consequences for some. When the heat rises, it can lead to increased illness and deaths in England."
        },
        {
            "text": "Throughout June to September we issue heat alerts when necessary, and further information and advice on what each level means can be found here."
        },
        {
            "text": "Every year we see excess deaths during periods of hot weather. In the summer of 2021, there were only eight days of weather that required a level 3 heat alert and over this period there were 915 excess deaths analysis showed."
        },
        {
            "text": "Although this was a very short period, there were real health implications for many people and unfortunately this shows that the saying ‘a bit of hot weather never hurt anyone’ simply isn’t true and many of these deaths and health issues can be avoided.  Wherever there’s clear evidence of a risk to health security, we’ll provide public health advice to help people minimise these risks."
        },
        {
            "text": "We are currently experiencing an extended period of extreme heat. Therefore, we need to be prepared for the real possibility of severe health impacts and take the needed steps to try and avoid them."
        },
        {
            "text": "It is important we all take sensible precautions to avoid becoming unwell and to enjoy the hot weather safely. If you have vulnerable family, friends and neighbours, make sure they are aware of how they can keep themselves protected from the warm weather. It is possible people can experience heat exhaustion and in very serious situations it can become heat stroke."
        },
        {
            "text": "There is more information available in the NHS advice on coping during heatwaves."
        },
        {
            "heading": 2,
            "text": "Who is vulnerable?"
        },
        {
            "text": "While everybody is at risk from the health consequences of heat, there are certain factors that increase an individual’s risk during a heatwave.  These include:"
        },
        {
            "heading": 2,
            "text": "What can we do to stay safe?"
        },
        {
            "text": "There are a few very simple things we can all to do stay safe when we experience very high temperatures."
        },
        {
            "heading": 2,
            "text": "Heat exhaustion and heatstroke"
        },
        {
            "text": "Heat exhaustion is not usually serious if you can cool down within 30 minutes. If it turns into heatstroke, it needs to be treated as an emergency."
        },
        {
            "text": "Heat exhaustion can include:"
        },
        {
            "text": "The symptoms are often the same in adults and children, although children may become floppy and sleepy."
        },
        {
            "text": "If someone is showing signs of heat exhaustion, they need to be cooled down. To do this you should:"
        },
        {
            "text": "You should call 999 if you or someone you are with is showing any of the signs of heatstroke:"
        },
        {
            "text": "The NHS website has more information on heat exhaustion and heat stroke."
        }
    ]
}