{
    "url": "https://publicpolicydesign.blog.gov.uk/2022/07/14/tensions-and-resistances-in-the-field-of-design-in-policy/",
    "title": "Tensions and resistances in the field of design in policy",
    "authors": [
        "Jocelyn Bailey"
    ],
    "categories": [
        "Events",
        "PublicPolicyDesign",
        "Thought leadership"
    ],
    "pub_date": "2022-07-14T12:00:36+01:00",
    "content": [
        {
            "text": "If design approaches are so useful in policymaking, why haven’t they been more widely adopted? Are people who talk about ‘policy design’ all talking about the same thing? Is ‘design’ a helpful concept when considering the messy reality of political process? Is there enough space in policy systems and practices to effectively enable the radical cultural changes we need to arrive at more sustainable ways of living? These were some of the challenging questions posed by the ‘provocateurs’ at the first meeting of the AHRC Design and Policy Network. With around 20 in-person and 30 online participants, comprising a mix of academics, civil servants, and designers, this inaugural conversation explored the ‘tensions and resistances’ in the contemporary field of design and policy."
        },
        {
            "text": "As previewed in our blog post, the network aims to bring together civil servants, policy makers and public servants working in different contexts, with academics from design, the humanities and political science, as well as experts from the private sector. Over the coming 18 months the network will map out the intersections between design and political science for future research, knowledge exchange and collaboration, and make recommendations for academic funders and institutions, and government."
        },
        {
            "heading": 2,
            "text": "Setting the scene for our new network"
        },
        {
            "text": "In the first meeting, network co-lead Professor Liz Richardson set the scene by highlighting the untapped potential of creative thinking for the world of policymaking, the fragmentation of discourses and communities surrounding design and policy, and the existence of many unresolved questions: around the policy infrastructure and processes that enable design to happen, the conflicting conceptualisations of design - as an organic, emergent, everyday process vs. a standalone or set piece activity, and the ‘origin story’ of design as a discipline conceived of by great white western male thinkers. The three speakers, embodying perspectives from policy practice, political science and design, then shared what they saw as the key challenges for the field."
        },
        {
            "text": "Dr Carla Groom (Deputy Director for Behavioural Science, Department for Work & Pensions), presented her reflections on why design has not yet made the in-roads it could: the need for adaptation of design tools for complex policymaking problems, and the attendant deep understanding of both that is required to do so; the need to combine design with practices and processes that allow for audit, nuance, and carefully monitored delegation of decision-making; and creating space in the framing of policy problems to allow design to do something more than tinker within a very tight set of constraints."
        },
        {
            "text": "Professor Paul Cairney (University of Stirling), reflected on the disconnect between theoretical models of policy design as developed in the 80s, and the messy reality of policymaking in practice. When considering design in relation to policy he argued for the need to pay attention to the strong rationale for aspects of policy processes that may appear to undermine design, such as shared or devolved decision-making, or the need for communities to articulate and respond to problems from their own perspective. He suggested there will always be a gap – not solvable by ‘design’ – between an idealised centralised process and what is accepted as ‘good enough’ in a decentralised process. (Read Paul’s comments and reflections on the discussion here.)"
        },
        {
            "text": "Finally, Professor Ann Light (University of Sussex / Malmo University), suggested that creative practice has the potential to influence societies at a cultural level to transform towards more sustainable futures. Drawing on traditions in participatory design and speculative design, she argued that transformation requires a destabilisation of norms, and a subversion of the present in order to entertain radically different possible ways of living. She questioned whether there is space or the appetite in political and policy systems to invite people in, and to imagine new worlds, in such an open, exploratory and experimental way."
        },
        {
            "text": "Provocations from speakers were then followed by an informal and free-flowing discussion in breakout groups, which ranged across a diverse set of challenges – from the practical to the conceptual – that network members are confronting in their own work."
        },
        {
            "heading": 2,
            "text": "Join our next meeting"
        },
        {
            "text": "The next Design and Policy Network meeting will be held on the 14th September, at the University of Manchester, and will focus on untapped potential in design thinking and practice. To participate in the network and receive updates, please join the LinkedIn group. Everyone with a professional interest in the intersections of design and public policy is welcome, from public policy, public services, academics and PhD students, and professional practice in design."
        }
    ]
}