{
    "url": "https://governmentscienceandengineering.blog.gov.uk/2022/07/14/trainee-patent-attorneys-in-defence-intellectual-property-rights-mod/",
    "title": "Trainee Patent Attorneys in Defence Intellectual Property Rights- MOD",
    "authors": [
        "Jamal Arabi"
    ],
    "categories": [
        "GSE Opportunities"
    ],
    "pub_date": "2022-07-14T17:31:58+01:00",
    "content": [
        {
            "text": "There is currently a really good opportunity for any engineers or scientists interested in joining the Defence Intellectual Property Rights (DIPR) group in the Ministry of Defence (MOD). DIPR has responsibility for all aspects of Intellectual Property (IP) within the MOD, including setting IP policy, managing the protection and exploitation of MOD-owned IP, drafting IP conditions for MOD contracts and negotiating IP aspects of international agreements."
        },
        {
            "text": "DIPR is currently seeking to recruit 4-5 new patent attorney trainees. It is rare for these posts to come up and it presents a great opportunity for those with an engineering or science degree (an essential pre-requisite) who are looking to change career paths. All of these roles are in the Project and Acquisition Support Team within DIPR, i.e. providing intellectual property rights advice across MOD – so the roles are far broader than pure patent attorney work and there is no shortage of variety and interest. These trainee posts begin at an equivalent to HEO/SEO level, with good career progression for those completing the rigorous training and qualification requirements."
        },
        {
            "text": "Emma Gardner, Deputy Head of DIPR and Principal Patent Officer, would be very happy to speak to anyone who may be interested in a career with DIPR. Please email emma.gardner336@mod.gov.uk."
        },
        {
            "text": "For more information including job specification and how to apply, please click here. The deadline for applications is 11:55 pm on Thursday 4th August 2022"
        }
    ]
}