{
    "url": "https://ruralpayments.blog.gov.uk/2023/10/12/celebrating-25-years-of-bcms-with-lee-mcmullen/",
    "title": "Celebrating 25 years of BCMS with Lee McMullen",
    "authors": [
        "RPA Editor"
    ],
    "categories": [
        "BCMS"
    ],
    "pub_date": "2023-10-12T16:11:38+01:00",
    "content": [
        {
            "text": "It’s 25 years since the formation of the British Cattle Movement Service (BCMS), which is responsible for maintaining the central online database of all bovine animals in Great Britain. This is the Cattle Tracing System (CTS), which animal keepers use to report the births, deaths and movements of their bovine animals. In the third of our series of blogs talking to BCMS staff past and present, Lee McMullen talks about his 13 years with BCMS. "
        },
        {
            "text": "Hello, I’m Lee and I worked in BCMS for 13 years before moving across to Business Transformation as a Senior Business Analyst. Whilst with BCMS I was a Team Member on the Cattle Tracing System (CTS) Transformation Team as well as general processing teams. Both in BCMS and since moving across to Business Transformation, my roles have heavily involved preparing colleagues and customers for changes, which are hopefully seen as improvements to help reduce red tape where possible."
        },
        {
            "text": "Whilst in BCMS I was really proud to be part of a small team of around ten people who helped develop, deliver and promote key improvements to BCMS and Cattle Tracing. This included the redevelopment of CTS Online and the introduction of the CTS Self Service telephone line, both of which offer English and Welsh language versions of the services 24/7 to allow keepers to report cattle births, deaths and movements at a time convenient to them. We also introduced the Single Page Cattle Passport, saving over £1million a year, and introduced the electronic death reporting for keepers and abattoirs, providing efficiency and improvements to the integrity of the food chain."
        },
        {
            "text": "My time in BCMS really helped me prepare for my current role where I look at existing and proposed business changes to make sure any new processes and guidance surrounding those changes are as beneficial and fit for purpose from both the farmer/land agent and business points of view as possible. My primary responsibilities are project and programme delivery; stakeholder and customer engagement and insight, process, system and service improvement and ensuring customers and the industry are aware of, and prepared for, any changes and improvements."
        },
        {
            "text": "The aspect of my role which has the greatest impact on customers is in the development of new, or improvements to existing services, and implementing customer experience improvements to allow people to interact with us easily at times that are convenient to them."
        },
        {
            "text": "There’s no typical day in my role.  It can involve holding workshops or interviews with interested parties to determine what’s required; drawing up new processes or system improvement opportunities; engaging directly with farmers and industry partners to gather feedback to ensure changes are fit for purpose; developing new guidance and support processes, followed by presenting those changes for approval."
        },
        {
            "text": "As in BCMS, the aspect of my role I enjoy most is engaging with all areas of the farming industry to help develop services and schemes that directly help them either engage with us or provide them with the support they need to keep British farming at the forefront."
        },
        {
            "text": "Outside of work I have a couple of voluntary roles chairing committees to improve and promote safe social opportunities for all members of the community. As well as this I enjoy socialising with friends, attempting to play darts, reading and watching true crime related books and programmes."
        },
        {
            "text": "As I live and work in near Workington in West Cumbria where the BCMS team is based, I see and hear directly how what we do as BCMS/ RPA/ Defra directly impacts the local farming community and use this insight to help influence and improve what we do at work."
        },
        {
            "text": "You will have read in the two previous blogs about BCMS and its 25 year anniversary Celebrating 25 years of the BCMS and Celebrating 25 years of the BCMS with Terry Gadd, that the Livestock Information Service (LIS) sheep bureau has moved into RPA, and will now manage the movement traceability for sheep, goats, and deer for England, alongside the existing cattle services. This forms part of the wider Livestock Information Transformation Programme, which will replace the existing traceability databases with one multi-species platform."
        },
        {
            "text": "I’m very excited for the future of BCMS, using the knowledge and expertise of the industry gained over the last 25 years to include tracing other livestock species, to further enhance the integrity and reputation of the British meat food chain."
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        }
    ]
}