{
    "url": "https://food.blog.gov.uk/2023/10/12/chief-executives-message-to-stakeholders-new-consumer-advice-on-cbd/",
    "title": "Chief Executive’s message to stakeholders - New consumer advice on CBD",
    "authors": [
        "Emily Miles, Chief Executive"
    ],
    "categories": [
        "Business guidance",
        "Our mission"
    ],
    "pub_date": "2023-10-12T09:58:36+01:00",
    "content": [
        {
            "text": "Cymraeg"
        },
        {
            "text": "Consumers are at the heart of everything we do. We work with industry to assess the safety of new foods coming to market and give advice to consumers so that they can make informed choices about the food they eat."
        },
        {
            "text": "One of the foods that we have been assessing is cannabidiol (CBD). There are many CBD-infused products currently available on the market. The novel food status of CBD extracts was confirmed in January 2019 and all CBD food products must apply for authorisation before they can be sold legally in Great Britain (GB)."
        },
        {
            "text": "The FSA issued consumer advice in 2020 while also setting a deadline for businesses to submit novel food applications. Since the FSA and Food Standards Scotland (FSS) took over responsibility for assessing the safety of novel foods in GB from the EU in January 2021, we have been working through industry applications and bringing the market into line with current regulations."
        },
        {
            "text": "One of the challenges of regulating CBD has always been that so little scientific evidence existed on the safety or effect of CBD on the body. Now that we have access to data specific to CBD use in food, as part of applications to our novel foods authorisation process, that is beginning to change. Based on this new evidence available to us, we are now recommending healthy adults should limit their consumption to 10mg of CBD per day. The more CBD you consume over your lifetime, the more likely you are to develop long-term adverse effects, like liver damage or thyroid issues. A comparison would be alcoholic drinks where the level of risk is related to intake level."
        },
        {
            "text": "We are encouraging consumers to check the CBD content on the product label to monitor their overall daily consumption of CBD and consider if they wish to make changes to how much they take based on this updated advice."
        },
        {
            "text": "As applications continue to move through the novel foods process, we will review our advice and make any changes necessary to ensure consumers have the information they need to make informed choices about what they eat."
        },
        {
            "text": "There are implications for products currently on the market that contain more than 10mg of CBD per serving. We will be working with industry to help consider what this updated advice means for products currently on our public list for England and Wales."
        },
        {
            "heading": 1,
            "text": "Neges i randdeiliaid gan y Prif Weithredwr – cyngor newydd ar CBD"
        },
        {
            "text": "Defnyddwyr sydd wrth wraidd popeth a wnawn. Rydym yn gweithio gyda’r diwydiant i asesu diogelwch bwydydd newydd sy’n dod i’r farchnad, ac yn rhoi cyngor i ddefnyddwyr fel y gallan nhw wneud dewisiadau gwybodus am y bwyd y maen nhw’n ei fwyta."
        },
        {
            "text": "Un o’r bwydydd rydyn ni wedi bod yn ei asesu yw canabidiol (CBD). Mae llawer o gynhyrchion sydd wedi’u trwytho â CBD ar gael ar y farchnad ar hyn o bryd. Cadarnhawyd statws echdyniadau CBD fel bwyd newydd ym mis Ionawr 2019, ac mae’n rhaid gwneud cais i awdurdodi unrhyw gynhyrchion bwyd CBD cyn y gellir eu gwerthu’n gyfreithlon ym Mhrydain Fawr.\nCyhoeddodd yr ASB gyngor i ddefnyddwyr yn 2020, a hynny wrth iddi osod terfyn amser i fusnesau gyflwyno ceisiadau am fwyd newydd. Ers i’r Asiantaeth Safonau Bwyd (ASB) a Safonau Bwyd yr Alban (FSS) gymryd drosodd y cyfrifoldeb am asesu diogelwch bwydydd newydd ym Mhrydain Fawr yn lle’r UE ym mis Ionawr 2021, rydym wedi bod yn gweithio drwy geisiadau’r diwydiant ac yn sicrhau bod y farchnad yn cydymffurfio â’r rheoliadau cyfredol."
        },
        {
            "text": "Un o’r heriau sydd wedi bod erioed wrth reoleiddio CBD yw’r ffaith bod cyn lleied o dystiolaeth wyddonol ar ddiogelwch neu effaith CBD ar y corff. Nawr bod gennym ni fynediad at ddata sy’n ymwneud yn benodol â’r defnydd o CBD mewn bwyd, fel rhan o geisiadau i’n proses awdurdodi bwydydd newydd, mae hynny’n dechrau newid. Yn seiliedig ar y dystiolaeth newydd hon, rydym bellach yn argymell y dylai oedolion iach gyfyngu ar eu defnydd o CBD i 10mg y dydd. Po fwyaf o CBD rydych chi’n ei gymryd yn ystod eich oes, y mwyaf tebygol rydych chi o ddatblygu effeithiau andwyol hirdymor, fel niwed i’r afu neu broblemau thyroid. Gellir ei gymharu â diodydd alcoholaidd yn hyn o beth – hynny yw, mae lefel y risg yn gysylltiedig â lefel y cymeriant."
        },
        {
            "text": "Rydym yn annog defnyddwyr i wirio cynnwys CBD ar label y cynnyrch i fonitro eu defnydd dyddiol cyffredinol o CBD ac ystyried a ydynt am addasu faint y maent yn ei gymryd yn seiliedig ar y cyngor diweddaraf hwn."
        },
        {
            "text": "Wrth i geisiadau barhau i symud drwy’r broses bwydydd newydd, byddwn yn adolygu ein cyngor ac yn gwneud unrhyw newidiadau angenrheidiol i sicrhau bod gan ddefnyddwyr yr wybodaeth sydd ei hangen arnyn nhw i wneud dewisiadau gwybodus am yr hyn y maen nhw’n ei fwyta."
        },
        {
            "text": "Mae goblygiadau i gynhyrchion sydd ar y farchnad ar hyn o bryd ac sy’n cynnwys mwy na 10mg o CBD fesul dogn. Byddwn yn gweithio gyda’r diwydiant i helpu i ystyried beth mae’r cyngor diweddaraf hwn yn ei olygu i gynhyrchion sydd ar ein rhestr gyhoeddus ar gyfer Cymru a Lloegr ar hyn o bryd."
        }
    ]
}