{
    "url": "https://dluhcdigital.blog.gov.uk/2023/10/12/join-the-dluhc-digital-recruitment-days-in-the-west-midlands/",
    "title": "Join the DLUHC Digital Recruitment Days in the West Midlands",
    "authors": [
        "DLUHC Digital team"
    ],
    "categories": [
        "DDAT Careers"
    ],
    "pub_date": "2023-10-12T13:55:37+01:00",
    "content": [
        {
            "text": "On 1, 2, 8 and 9 November, the Department for Levelling Up, Housing and Communities (DLUHC) will host its first Digital Recruitment Days."
        },
        {
            "text": "Our Digital Recruitment Days will offer an opportunity for digital professionals on the lookout for a meaningful and exciting career to meet, connect, have two-way conversations with our digital teams and potentially get hired."
        },
        {
            "text": "We’re holding the event at Molineux Stadium in Wolverhampton. Each day will be dedicated to different roles and we’ll welcome: "
        },
        {
            "heading": 3,
            "text": "What’s special about this event?"
        },
        {
            "text": "This event is an opportunity for you to really find out about us, just as much as we want to find out more about you. It will be informal and engaging and, for the right people, we’re looking to make job offers in the days immediately following the event."
        },
        {
            "text": "Whether you have years of experience under your belt or are just starting your career - we’d love to meet you. "
        },
        {
            "text": "During these events you’ll get to:"
        },
        {
            "heading": 3,
            "text": "Social impact, innovation, purpose"
        },
        {
            "text": "Now is an exciting time to join us. We have many transformational projects and have ambitious and far-reaching outcomes to achieve. Every day, we solve problems and build better services that positively affect the lives of communities and people right across the UK. "
        },
        {
            "text": "From investing in local areas to drive growth and create jobs, delivering affordable, better, greener homes, reducing homelessness, supporting community and faith groups, modernising funding, planning and building safety, we help the department deliver innovative, user-centred responses on a broad range of important issues."
        },
        {
            "text": "We work in autonomous, multi-disciplinary teams in 20 locations across the UK including Wolverhampton and Birmingham, and our people enjoy flexible and hybrid working plus generous benefits and development routes for learning and progression."
        },
        {
            "heading": 3,
            "text": "What our people say"
        },
        {
            "heading": 3,
            "text": "Register to attend"
        },
        {
            "text": "Sound like something you’d like to be part of? Meet us and let’s chat. To learn more, identify the relevant date for your specialism and register, visit our Eventbrite page."
        },
        {
            "text": "If you have any questions contact our DDaT recruitment team."
        },
        {
            "text": "Subscribe to our blog for news and updates from our teams"
        }
    ]
}