{
    "url": "https://environmentagency.blog.gov.uk/2023/10/12/make-a-difference-lead-with-the-environment-agency/",
    "title": "Make a difference – lead with the Environment Agency.",
    "authors": [
        "Environment Agency"
    ],
    "categories": [
        "Environment Agency"
    ],
    "pub_date": "2023-10-12T15:25:04+00:00",
    "content": [
        {
            "text": "We need dynamic and diverse leaders now more than ever."
        },
        {
            "text": "Worsening storms, more frequent floods and heatwaves, longer droughts, faster coastal change, significant species loss and greater pressures on water, land and air – climate change is happening now."
        },
        {
            "text": "We need leaders who can not only rise to meet this challenge, but who can see the ways to turn this turmoil into a triumph. We need bold ideas, innovation and expertise. We need forward thinking, curiosity and constructive challenge. If you can think differently and see opportunities to create better places for people and wildlife, then we’d like you to apply to be on the Environment Agency board.\nFrom our regulation of waste, water, nuclear and carbon-intensive industries, through to our flood resilience work, the Environment Agency operates at the forefront of addressing today’s most critical environmental issues. We have an impressive pool of expertise, spanning across scientific, financial and environmental practice from both local and national perspectives."
        },
        {
            "text": "As a board member, you would be making decisions to improve and protect the quality of our water, land and air. You would be helping businesses to comply with environmental regulations and fostering a healthy and diverse natural world, enhancing people’s lives and contributing to sustainable and resilient economic growth in the process. The board can help governments, businesses and communities to understand the benefits of particular environmental measures, as well as the risks of failing to act."
        },
        {
            "text": "This is a crucial time to join us. We are facing some of our biggest challenges in water quality and waste crime, set against a backdrop of a changing and unpredictable climate. Now is your chance to influence action on these critical issues and help shape the future."
        },
        {
            "text": "We are looking for three new people to join the Environment Agency board."
        },
        {
            "text": "In particular, we are looking for candidates with experience in one of the following areas:\n• finance, accountancy, audit\n• digital transformation and/or innovation\n• pensions"
        },
        {
            "text": "We can only be successful if we are inclusive. We are looking for high-calibre applicants to help us be as diverse as the communities we serve. We are a place-based organisation so it is important that our board members bring both a regional presence and local understanding."
        },
        {
            "text": "If you want to make a real difference, then apply to lead with us."
        },
        {
            "text": "The advert is now live here. The closing date for applications is 13 November 2023."
        }
    ]
}