{
    "url": "https://defrafarming.blog.gov.uk/2023/10/12/slurry-infrastructure-grant-guidance-now-available-for-round-2/",
    "title": "Slurry Infrastructure grant: guidance now available for round 2",
    "authors": [
        "Thomas Proudfoot"
    ],
    "categories": [
        "Payments for equipment, technology and infrastructure"
    ],
    "pub_date": "2023-10-12T15:15:41+01:00",
    "content": [
        {
            "text": "In April I blogged about the outcome of the first round of Slurry Infrastructure grants. In that post, I said we were planning to launch two further, larger rounds in Autumn 2023 and 2024. "
        },
        {
            "text": "I’m pleased to say that we are getting ready to open round 2 of Slurry Infrastructure grants in November. To help farmers get ready, today we published the full guidance for the grant on GOV.UK. "
        },
        {
            "text": "I will also be hosting a webinar about the scheme on 9 November 2023. You'll be able to put your questions to me, the Rural Payments Agency and Environment Agency leads during the session. Click here to register to attend. "
        },
        {
            "text": "In this post, I’ll explain what’s new about round 2 and what you can do now to prepare. I’ll also answer a question we often get asked about covering slurry stores by 2027. "
        },
        {
            "text": "The grant  "
        },
        {
            "text": "Grants of between £25,000 and £250,000 are available to improve your slurry storage to go beyond legal minimums.  "
        },
        {
            "text": "This will help you improve the use of organic nutrients on your farm, aiding productivity and reducing pollution. "
        },
        {
            "text": "The grant is only available for slurry stores located in England. "
        },
        {
            "text": "What’s new "
        },
        {
            "text": "Since launching round 1, we’ve gathered valuable suggestions how we can improve the Slurry Infrastructure grants.  "
        },
        {
            "text": "Based on feedback gathered online, at shows and on farms, we are making 5 changes to the scheme for round 2: "
        },
        {
            "text": "We are making these changes to improve flexibility and environmental outcomes.  "
        },
        {
            "text": "We appreciate some farms in round 1 may want to amend their application to take advantage of the revised offer. "
        },
        {
            "text": "RPA will contact round 1 applicants with a time-limited opportunity to update their application if they want to include these changes in their project, without having to reapply.  "
        },
        {
            "text": "We aren’t planning to make further changes to the items on offer for round 3. "
        },
        {
            "text": "Managing demand "
        },
        {
            "text": "In Round 2 we will be able to invite many more projects to submit a full application than we did last year. However, depending on how many farms apply, we may still need to limit the number of full applications to prevent swamping suppliers. "
        },
        {
            "text": "If we need to, we will prioritise projects in areas where coordinated action is needed to reduce water and air pollution from farming. This will ensure available public money is targeted to areas where it can make the biggest improvement to environmental outcomes. "
        },
        {
            "text": "We have significantly expanded these areas for round 2 by adding further indicators for water quality and using the latest air quality data.  "
        },
        {
            "text": "From November, you’ll be able to view the areas by selecting Slurry Infrastructure Grant – Round 2 (England) on MAGIC. In the updated guidance published today, we explain what the priority areas show and how we’ll use them. "
        },
        {
            "text": "The likelihood of your project being shortlisted in round 2 will depend on how many farms apply.  Last year, around 30% of projects shortlisted were outside the prioritised areas.  "
        },
        {
            "text": "We therefore strongly encourage everyone who wants a grant to submit an expression of interest when online applications open, wherever you are located. "
        },
        {
            "text": "What happens next "
        },
        {
            "text": "You will be able to apply in November. Subscribe to the blog to receive a reminder when the online checker, the first step to apply, opens.  "
        },
        {
            "text": "Once the online checker closes, we’ll know the level of demand. "
        },
        {
            "text": "Shortly after that, we’ll tell everyone whether they will be invited to submit a full application this round or not"
        },
        {
            "text": "If you aren’t shortlisted, there will be another opportunity to apply in 2024, where we will look to further widen the target areas. "
        },
        {
            "text": "You can get ready to apply by working out how much slurry storage you need to reach the scheme storage requirements.  "
        },
        {
            "text": "You must use AHDB’s latest version of slurry wizard — October 2023 or later — to do this. It’s been significantly updated based on last year’s farmer experience. "
        },
        {
            "text": "Covering slurry stores "
        },
        {
            "text": "One of the questions we get asked the most is whether all slurry stores will need to be covered by 2027. This was a suggestion made in the Clean Air Strategy, published in 2019. "
        },
        {
            "text": "Covering slurry stores is a well-established practice to minimise ammonia emissions. It’s set out in the Code of Good Agricultural Practice (COGAP). Earlier this year, the government restated its committed to consult on rules to reduce ammonia emissions from management of organic manures, including requirements to cover slurry and digestate stores.  "
        },
        {
            "text": "You should be confident that any stores built through the Slurry Infrastructure grant will be compliant with future rules. The scheme has been designed to invest in high specification stores and covers that maximise ammonia abatement. "
        },
        {
            "text": "All stores will not need to be covered unless or until new rules are brought in. Farmers will be given plenty of notice and support to implement any new changes. We do not expect that any new rules will require existing stores to be covered with impermeable covers by 2027. "
        }
    ]
}