{
    "url": "https://nda.blog.gov.uk/the-strategy-series-innovating-to-reduce-reuse-and-recycle/",
    "title": "The Strategy Series: Innovating to reduce, reuse and recycle",
    "authors": [
        "Dr Craig Ashton, Waste Services Director at NWS"
    ],
    "categories": [
        "Innovation/savings",
        "Mission delivery",
        "Research and development",
        "Science",
        "Waste management"
    ],
    "pub_date": "2023-10-12T14:56:49+01:00",
    "content": [
        {
            "text": "We’re onto the third instalment of our Strategy Series where we dissect our 2030 Corporate Strategy with the help of our Nuclear Waste Service (NWS) experts!"
        },
        {
            "text": " Our Corporate Strategy will help us to move forward in new, innovative ways with a refreshed focus on value and safety. As a newly integrated organisation, we are in an even better position to make nuclear waste permanently safer, sooner. This month, we’re diving into treatment and packaging with Waste Services Director, Dr Craig Ashton."
        },
        {
            "text": "Why is treatment and packaging so important?"
        },
        {
            "text": " Treatment and packaging are two separate but important parts of the waste lifecycle. Treatment is all about applying the waste management hierarchy – reduce, reuse, recycle. We can treat the waste to either avoid disposing of it or to minimise the volume going for disposal. It's important to reduce the amount of waste we dispose of. Minimising the amount of waste we produce and managing it more effectively not only means we reduce the amount of space taken up in our disposal facilities but also reduces other negative social and environmental impacts across the lifecycle."
        },
        {
            "text": " Packaging is a very important part of the process. For example, if we’re transporting waste to treatment or waste centres, there are a lot of safety regulations to meet as it travels to its destination. When it safely gets to its destination, it needs to be ready for what happens next whether that be disposal, treatment, or storage. The waste containers need to meet the requirements for the receiving facility also, which can be more complex and are more varied than the transport regulations."
        },
        {
            "text": "There are a number of different containers for different kinds of waste. For Lower Active Wastes, this has been standardised to meet the acceptance criteria for the downstream facilities.  However, there is still work to do to standardise containers for Higher Active Wastes to optimise processing and reduce risks for disposal at a geological disposal facility (GDF). One of our strategic objectives at NWS is to standardise higher active waste containers. The effective treatment and packaging of radioactive waste allows us to achieve our strategic objective to reduce overall waste volumes and maximise package performance."
        },
        {
            "text": "What kind of waste do you deal with?"
        },
        {
            "text": "In the simplest terms, there are three kinds of radioactive waste – Low Level Waste (LLW), Intermediate Level Waste (ILW) and High Level Waste (HLW).  Low Level Waste contains relatively low levels of radioactivity and usually comes from hospitals, universities and the operation and decommissioning of nuclear facilities.  The major components of Intermediate Level Wastes are nuclear reactor components, graphite from reactor cores and sludges from the treatment of radioactive liquid wastes. High Level Waste is more radioactive to the point where it generates its own heat and is generally in the form of spent nuclear fuel and vitrified high active waste (HLW is only a relatively small volume of waste at Sellafield).  That is why High Level Wastes and some Intermediate Level Wastes can only ever be disposed of in a GDF."
        },
        {
            "text": "How important is innovation at this stage of the process?"
        },
        {
            "text": "Innovation is a vital part of our work. We are continuously working towards a safer and more efficient process.  For example, our innovative ideas over the last decade have helped us divert huge volumes of waste away from LLW disposal, which includes the recycling of more than 90% of lower active metallic waste."
        },
        {
            "text": "Low level metallic waste can be reduced in size, cleaned and may require smelting.  After these processes, 95% of the metal will meet the threshold needed to be classed as ‘clean’. That means it can then be reused and turned into things like car parts! Our 2030 strategy also focuses technologies like thermal treatment for Higher Activity Waste and innovative ways to treat asbestos."
        },
        {
            "text": "Who do you work with? "
        },
        {
            "text": "We have a fantastic customer team who deal with all our customers whether they be waste generators or suppliers, such as Sellafield and Magnox, and other organisations that generate radioactive waste, including defence, healthcare, and industry. They are a vital point of contact for anybody who uses our One-Stop-Shop of services."
        },
        {
            "text": "What opportunities does this create?"
        },
        {
            "text": " Within 10 to 15 years, we want to create a group of internationally recognised waste experts who know how to make waste permanently safe, sooner no matter where they fall in the waste hierarchy. That is why we’ve put together a career pathway to take apprentices and graduates through a structured and refined scheme.  This year, we became the only nuclear operator to have a pathway accredited by the Chartered Institute of Waste Management!"
        },
        {
            "text": "What significant achievements have you had recently?"
        },
        {
            "text": "We’re diverting huge volumes of waste away from disposal. For example, in 2022-23 we treated 1689te of metallic waste - 98% of which was released for recycling."
        },
        {
            "text": "We’ve also worked with Magnox Ltd on 500l stainless steel drums at the treatable radioactive waste store at Winfrith – previously designated as ILW, detailed technical analysis has confirmed it falls within the LLW classification, which can be disposed of now, rather than being stored until a GDF is available for disposal."
        },
        {
            "text": "We’re creating containers fit for the job. Last year we made 57 containers, 766 soft-sided packages, and 5179 Drums - all licensed and certified for radioactive waste.  We even innovated one of our drums so it could be used to manage radioactive chemicals."
        },
        {
            "text": "What’s the next step towards a permanently safer future?"
        },
        {
            "text": "By liaising closely with our colleagues, supply chain and customers we can continue to innovate to reduce the amount of waste being sent for disposal and/or condition it so it can be disposed of sooner, which ultimately reduces risk and saves money for the UK taxpayer."
        },
        {
            "text": "We’re also working on a number of other “Safer Sooner” projects such as disposing of wastes at the LLWR, which are currently being stored in Sellafield. Once these projects enter the delivery phase, our portfolio and reputation for making waste permanently safe sooner through our One-Stop-Shop will really start to speak for itself."
        },
        {
            "text": "Read our 2030 Corporate Strategy to learn more - Nuclear Waste Services Corporate Strategy 2023 - GOV.UK (www.gov.uk)"
        },
        {
            "text": "To see how this impacts the next stage of the waste management process, read the next instalment of the Strategy Series with Chief Operating Officer Martin Walkinshaw as we explore disposal! "
        }
    ]
}