{
    "url": "https://forestrycommission.blog.gov.uk/2023/10/12/thriving-for-the-future-seizing-the-moment-for-trees-woods-and-forests/",
    "title": "Thriving for the Future: Seizing the moment for trees, woods and forests",
    "authors": [
        "Richard Stanford"
    ],
    "categories": [
        "Climate change and resilience",
        "Tree health",
        "Tree Planting",
        "Woodland creation",
        "Woodland management"
    ],
    "pub_date": "2023-10-12T10:30:38+01:00",
    "content": [
        {
            "text": "Many challenges in life could do with a magic wand to sort them out. Sadly reality isn’t like that and we have to work through all the factors and find a solution. However, we do have the next best thing to a magic wand with trees. They answer so many of today’s problems: climate change, biodiversity, economy, health and wellbeing, water quality, soil erosion and the list goes on."
        },
        {
            "text": "The Forestry Commission was founded with a sense of urgency: to reverse centuries of deforestation with limited capacity to meet our own demand for timber. By seizing the moment in 1919, we led a national mission that has doubled the forested area in England in a century. We are however still the least forested country in Europe and we import 81% of our timber."
        },
        {
            "text": "We now need to redouble our collective efforts, spurred on by further imperatives to fight climate change and improve nature. Together, we must make forestry work to capture and store carbon, enhance biodiversity, address timber security and produce benefits for people and communities. If we are to tackle the most pressing societal and environmental challenges of our age, the message is simple: we need more trees."
        },
        {
            "text": "With this in mind, the Forestry Commission has developed a new corporate strategy setting out how we will deliver – for the environment, for the economy and for society – over the next five years: ‘Thriving for the Future ’."
        },
        {
            "heading": 2,
            "text": "Our vision for the future"
        },
        {
            "text": "‘Thriving for the Future’ reflects the need for urgency, while taking the long view. As we look around, it is clear that now is the moment to help meet some of society’s biggest challenges by harnessing the potential of thriving trees, woods and forests – and that is the vision that will inspire and guide our action over the next five years, while setting us up for the next 50 years. Our goals help us to be clear what this will require:"
        },
        {
            "text": "Each part of the Forestry Commission contributes to delivering on our long-term goals and outcomes. There are four key cross-cutting opportunities where stronger collaboration across the Forestry Commission and with partners from many sectors is required to achieve a step-change in our collective impact on those goals. These focus areas will shape and inform what and how we deliver over the next five years."
        },
        {
            "text": "We will:"
        },
        {
            "text": "From these starting points we will build our programmes of work aimed at enabling a step-change in outcomes, subject to securing the funding and partner support required."
        },
        {
            "text": "The Forestry Commission is made up of three organisations which have separate remits and goals but together provide a powerhouse for forestry. ‘Thriving for the Future’ will build upon and connect the strategies of our agencies Forestry England and Forest Research, as well as our internal organisation, Forest Services – it does not replace them. As those strategies come up for renewal, we will consider the ways in which the Forestry Commission strategy helps to guide and inform the plans for each organisation going forward."
        },
        {
            "heading": 2,
            "text": "What does Thriving for the Future mean for England’s treescape?"
        },
        {
            "text": "Trees need to be front-and-centre of responding to today’s biggest challenges. Trees provide a uniquely versatile and proven solution to a range of today’s problems, but to ensure that our forests and woodlands can continue to deliver these benefits they must be resilient and thriving, even in the face of increasing threats from tree pests and diseases that are being driven by globalisation and climate change. Trees can take many decades to grow to maturity, so delaying decisions or making the wrong decisions represents a huge opportunity cost for the nation."
        },
        {
            "text": "Over the next five years, and beyond, together we can ensure that our trees, woods and forests thrive into the future. You will see more trees and woodlands growing, more diverse tree species and structures, and healthier, more resilient and well-managed forests. You will see people more connected to trees and woodlands and with improved health and wellbeing, forestry supporting communities and the economy, and a more sustainable timber supply. You will see technology and evidence being harnessed to support our trees and forests, and increasingly widespread benefits for nature and climate."
        },
        {
            "heading": 2,
            "text": "Our commitment to you"
        },
        {
            "text": "We have developed five guiding principles to underpin how we will work over the next five years."
        },
        {
            "heading": 2,
            "text": "Where next?"
        },
        {
            "text": "Complex challenges need inclusive solutions. We will be purposeful about who we partner with and how, seeking to build strategic alliances with people and organisations who share our vision. This will include:"
        },
        {
            "text": "We can’t do this alone. Together, we must seize the moment to secure the future of our trees, our sector and our country."
        }
    ]
}