{
    "url": "https://educationhub.blog.gov.uk/2023/02/28/how-ensuring-school-uniforms-affordable-families-grants/",
    "title": "How we are ensuring school uniforms are affordable for families",
    "authors": [
        "media officer"
    ],
    "categories": [
        "Schools",
        "Uniforms"
    ],
    "pub_date": "2023-02-28T14:05:53+00:00",
    "content": [
        {
            "text": "School uniforms can create a sense of identity and community for a school and its pupils, reduce peer pressure for the latest clothes and help children feel settled and prepared for lessons, but they can be costly for parents."
        },
        {
            "text": "No school uniform should be so expensive that families and pupils feel unable to apply to, or attend, a school of their choice."
        },
        {
            "text": "Here’s what you need to know."
        },
        {
            "heading": 3,
            "text": "Who decides whether to have school uniform? "
        },
        {
            "text": "It’s up to individual schools to set their own policies. The vast majority of schools in England have uniforms – but whatever schools decide, their policy should be fair for all."
        },
        {
            "text": "We believe uniforms provide a sense of belonging for students. They are helpful in creating a good learning environment and can promote the ethos of a school."
        },
        {
            "heading": 3,
            "text": "What are you doing to ensure the cost of school uniform remains affordable? "
        },
        {
            "text": "We’ve published legally-binding guidance on the cost of school uniforms, which schools must take into account when developing and implementing their own uniform policy."
        },
        {
            "text": "Schools should prioritise thinking about how much it will cost parents and carers when deciding on a uniform policy. This includes the cost of providing extra clothing that pupils will need to wear outside the classroom, such as a PE kit."
        },
        {
            "text": "Schools should:"
        },
        {
            "heading": 3,
            "text": "How to access second-hand school uniforms? "
        },
        {
            "text": "Second-hand uniform can benefit all parents, particularly those on low incomes, and is more sustainable by extending the life of clothes."
        },
        {
            "text": "Schools should make sure that parents are able to access second-hand uniforms. It is up to individual schools to decide how."
        },
        {
            "text": "Your school may offer second hand clothing directly or via their PTA (Parent Teacher Association), or they may advertise local, established, second hand uniform schemes."
        },
        {
            "text": "Whatever the method, schools should ensure that current and prospective parents and carers know how they can get hold of it by publishing details on the school’s website."
        },
        {
            "heading": 3,
            "text": "What financial help is available for parents to buy school uniforms?"
        },
        {
            "text": "In England, some local authorities (LAs) provide discretionary grants to help with buying school uniforms for those struggling to meet the costs, providing they are eligible."
        },
        {
            "text": "In some cases, individual schools or trusts may run their own schemes to provide assistance, for example to support new intakes of pupils or in the event of large changes to the existing uniform.  This will vary depending on the school."
        },
        {
            "heading": 3,
            "text": "What happens if a school doesn’t appear to be following the rules?"
        },
        {
            "text": "We expect schools to comply with the guidance, which was published in November 2021, and is rooted in law."
        },
        {
            "text": "All schools should be fully compliant with the guidance by summer 2023, although we recognise that some schools might be tied into existing contracts with suppliers so will become compliant after this date."
        },
        {
            "text": "If parents are concerned that their child's school is not following the guidance, they should raise this with the school, through the published complaints process."
        },
        {
            "text": "Where parents have gone through their school’s complaints process and feel the school has not adequately addressed their concerns, they may raise this with the department."
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        }
    ]
}