{
    "url": "https://vets.blog.gov.uk/2023/02/28/my-experience-and-advice-as-a-veterinary-surgeon-applying-for-a-job-in-the-civil-service-by-jane-holleran/",
    "title": "My experience and advice as a veterinary surgeon applying for a job in the Civil Service – by Jane Holleran",
    "authors": [
        "kenmeger"
    ],
    "categories": [
        "Government Veterinary Services",
        "Jobs and Experiences",
        "Policy Work",
        "Professional development"
    ],
    "pub_date": "2023-02-28T15:29:18+00:00",
    "content": [
        {
            "text": "My experience of applying to clinical vet roles in the UK was that it was generally very straight-forward; provide a CV, and if you meet the experience level for that position, you are likely to get an interview. In contrast, initially I found applying for a position in the Civil Service to be very daunting. Being more generalist, the process requires evidence of skills and behaviours under the ‘Success Profiles’ framework, something I was unfamiliar with when first applying for positions."
        },
        {
            "text": "However, keen to move from clinical practice to a policy role within the Civil Service, I decided to apply for the role of policy advisor within the Food Standards Agency (FSA) in 2021; and have now been working for the FSA for eight months. I hope providing an insight into my experience with the Civil Service application process, I can help any vets considering making the transition."
        },
        {
            "text": "Initial application"
        },
        {
            "text": "It is crucial to take time to carefully read the job description and any supplementary information, specifically noting the ‘essential criteria’. For my current role, I was required to:"
        },
        {
            "text": "The 1000-word statement asked me to evidence three types of skills. I allowed myself roughly 300 words for each one. For organisational skills, the examples I used included:"
        },
        {
            "text": "I used the CAR (Context, Action, Result) and STAR (Situation, Task, Action, Result) formats to structure my answers. Civil Service recruitment is focused on understanding decisions made and actions performed to demonstrate a behaviour or skill. It’s easy to be overly descriptive, but using the CAR and STAR formats help avoids this and keeps things concise. Even something you may consider menial, such as completing insurance forms and prescriptions, can be used to demonstrate organisation, attention to detail and the ability to prioritise."
        },
        {
            "text": "I made sure the answer I perfected the most was for the lead criteria. This was on the subject of using evidence to make decisions. I explained that this is fundamental to veterinary work, giving examples on how I obtained evidence, such as blood tests and use of data (which was sometimes limited) to make clinical decisions."
        },
        {
            "text": "Interview"
        },
        {
            "text": "The interview focused on ‘Behaviours’, that form part of the Civil Service ‘Success Profiles’. Behaviours, on the GOV.UK  website, are stated as ‘actions and activities that people do which result in effective performance in a job’. I was interviewed on four behaviours, one of which was ‘Changing and Improving’."
        },
        {
            "text": "As stated on GOV.UK, ‘Changing and Improving’, is the ability to ‘seek out opportunities to create effective change and suggest innovative ideas for improvement’. This got me thinking about potential questions relating to this theme, for example ‘Describe a time when you changed the way you work?’ Using a real-life example and STAR method, I recalled how I had adjusted my surgical technique for performing bitch spays, which resulted in shorter surgical time and reduced intra-operative bleeding, giving me much more confidence to perform this procedure unassisted."
        },
        {
            "text": "My top tips to conclude:"
        }
    ]
}