{
    "url": "https://ruralpayments.blog.gov.uk/2023/02/28/the-rpa-podcast-episode-5-transcript/",
    "title": "The RPA Podcast: Episode 5 Transcript",
    "authors": [
        "RPA Editor"
    ],
    "categories": [
        "Basic Payment Scheme",
        "Countryside Stewardship",
        "Environmental Stewardship",
        "RPA podcast",
        "Social Media"
    ],
    "pub_date": "2023-02-28T10:09:53+00:00",
    "content": [
        {
            "text": "Executive Summary"
        },
        {
            "text": "Interview with RPA Chief Executive Paul Caldwell"
        },
        {
            "text": "Countryside Stewardship"
        },
        {
            "text": "Environmental Land Management schemes announcements"
        },
        {
            "text": "Future Farming Resilience Fund"
        },
        {
            "text": " "
        },
        {
            "text": "****Intro music to fade****"
        },
        {
            "text": " "
        },
        {
            "text": "James: Hello and welcome to the fifth episode of The RPA Podcast. In today’s programme, I’m delighted to say we’ll be hearing from the RPA’s Chief Executive, Paul Caldwell. Paul will reflect on the successes and challenges of 2022 and look forward to what’s coming up in 2023. It’s an important time of year for the Countryside Stewardship scheme so we’ll be talking through the very latest updates, ensuring you’re prepared for the weeks ahead. Later in the episode we’ll reflect on the recent Environmental Land Management schemes announcements, including the extra Sustainable Farming Incentive scheme standards that will become available this summer. And finally, we’ll be discussing how the Future Farming Resilience Fund is supporting farmers and rural communities across the country and hear how you can take advantage of what the fund has to offer."
        },
        {
            "text": "But first today, the start of a new year is often a time to celebrate successes and reflect on where we can learn from our experiences and your feedback. This is certainly the case for the RPA’s Chief Executive, Paul Caldwell, and he recently spoke to Andrew Hawnt, from the RPA’s Internal Communications team, about his reflections of 2022 and ambitions for the year ahead."
        },
        {
            "text": " "
        },
        {
            "text": "****Music to fade****"
        },
        {
            "text": " "
        },
        {
            "text": "Andrew: So Paul, thank you very much for taking the time to talk to us today. It's really nice to get to talk to you personally. I don't think we've spoken directly before, have we? So I'm grateful for that."
        },
        {
            "text": "Paul: No, nice to Nice to meet you, Andrew, and thank you for the opportunity."
        },
        {
            "text": "Andrew: I just wanted to see how you're 2023 was going so far and what lay ahead for us all. So how has it been so far this year?"
        },
        {
            "text": "Paul: So far, 2023 has been good. It's been lively. We've had announcements at Oxford Farming Conference which have set up our year nicely in regard to the agricultural transition plan that we're a part of and we look forward to a very bright and varied 2023 I think."
        },
        {
            "text": "Andrew: Absolutely well said. So I want to know when I came here, I applied to RPA because I was interested in working for an organisation that was making a real, tangible difference with the work we do for the environment and industries, and I thought that was a really positive thing, something I could get behind. What attracted you to the Civil Service and what particularly attracted you to this organisation?"
        },
        {
            "text": "Paul: Well, I'm a career civil servant and I sort of came into this organisation in a round-about way. So I was attracted to the civil service pretty much from school, I read quite a lot about civil service careers because I was interested in science. And I read on the scientific organisations within the Civil Service and was really interested in the kind of different work that they did and in particular the impact on society and making a difference. I came into the RPA via a circuitous route because I lived in Cumbria and the British Cattle Movement Service ran an advert in Cumbria for people to come and join them, and it was a fascinating insight. So I gave it a try. I did it initially on secondment and really got to like it. And then via a number of different events, also including the foot and mouth outbreak in 2001, I ended up ensconced in the RPA and have been on a fascinating journey ever since."
        },
        {
            "text": "Andrew: It is a really interesting organisation. I came on to CS apps (Countryside Stewardship Applications) originally, I'm on comms now, but on CS apps, that was such an eye opener. Discovering all the things that the agency did, and it's really fascinating stuff, the depth that the agency goes to, to make sure things are done right is really interesting. So, what would you say some of the challenges and successes of 2022 were and what can we take away from them?"
        },
        {
            "text": "Paul: Well, I think 2022 was the culmination of a lot of what we set out we would do in our strategy. We, as many people know, inherited a number of very challenging circumstances and we committed to putting those right, not always seen by our customers and the public in the best of light. So, we've obviously been on a few years now trying to put that right as determined in our strategy, but particularly in there making ourselves an exemplar of operational delivery and an asset to the department and I think 2022 saw us, through our performance, and there's a saying in sport that you know tables don't lie, our performance speaks its own truth in terms of results, which shows how far we've come. But particularly pleasing was the way in which we've managed to do it. So, we haven't done so by going into crisis mode. We haven't sort of been embattled, we've done so in a way that everybody in the agency has contributed to, through our values, through our way of working, we've created something I believe here that stands us in really good stead, not just having got us through the difficulties of the past, but in really good stead for facing the future. And I think it's a really exciting future. 2023 is when we start to embark on that more fully, but 2022 I think really stood us in that stead. Across the board, we changed the way we did inspections, we've been involved with livestock information transformation, we've been at the centre of Defra's offering on grants, and people have come to realise the extent of expertise and variety of work that we do here. And of course, we've consolidated our Basic Payment Scheme payments and made huge improvements in Countryside Stewardship. So, all of those things that come together, I think that have showed us to be that exemplar that we want to be. We're still got a little way to go and one of the exciting things for 2023 is taking the next step in that journey. But we I think have taken ourselves to that place in 2022, that is less about the past, and more about the future."
        },
        {
            "text": "Andrew: Yeah, absolutely. And you mentioned we're going to face some of these things coming to coming throughout 2023. Could you tell us anything else about what lies ahead for 2023? How are we going to tackle these challenges?"
        },
        {
            "text": "Paul: 2023 for me is when all of the talk turns to action. Everybody is probably familiar with the things that have been said in terms of agricultural transition. One of the things that I frequently reflect on, waking up on the morning after the EU referendum. I think it's fair to say there was an extreme nervousness within the organisation as to what that means for the future, both in terms of the policy that we were responsible for administering, but also in terms of the chosen delivery vehicle and how might we be a part of that. We've come such a long way since then and we've seen all of the plans and we've seen the agricultural transition plan in the public domain. But what we've quietly and successfully done in the past few years is position ourselves in that delivery space in a way that has transitioned us from being the paying agency by right to being the delivery body of choice. And that means we've been at the heart of the Future Farming programme in order to be able to help the department realise that transition and now all of that planning, all of that talking is about to be a reality. This year, we're going to launch the next phase of the Sustainable Farming Incentive, which is the sort of, if you like, the meaty bit of it, you know we've kind of dipped our toe in the water and now we're gonna throw ourselves into it and start really swimming. We've got radical plans to change Countryside Stewardship and our ministers have confirmed Countryside Stewardship as a vehicle for the future and not just a legacy scheme. So managing those interfaces and that transition, along with our grants proposition, along with new approaches to regulation, we're gonna get to do all of that this year, which means we're gonna have to be prepared for it, it means we're gonna have to do quite a lot of work to stand it up and make sure we're ready. But it's when it all really comes to life which makes this year a really exciting prospect."
        },
        {
            "text": "Andrew: How do you think the things that we're working on for this year will influence how things will progress, how industry it will progress and how our own work will progress over the next few years?"
        },
        {
            "text": "Paul: I think, firstly, we feel different about ourselves, which is very important in having the confidence to face the future, but I think our stakeholders and our customers have started to feel differently about us. And there's something of a virtuous circle in that because everybody wants to feel that they're doing a good job. You asked me why I came to the Civil Service and you know what I like about this organisation, and making that difference, contributing to those outcomes, knowing that you're helping people to do that. I studied quite a lot of environmental science and like everybody else, it's never been more topical than it is now. And we are able to help people to realise those ambitions, the things that we are seeing on national television, we're a part of and a part of helping the general public, but particularly farmers and landowners, to promote that agenda, and that changes the way that we relate to our customers and I think what we've learned this last 18 months is that we can do that and we’re in a position to do that. We've learned the things that we need to change to be better at that. I think there are ways in which we can improve the relationships, there are ways in which we can improve the technology and the channels that we use to be able to conduct that dialogue. But I think, you know, we've learned a lot about how our customers need support and want us to be available for that support, and perhaps surprised ourselves a little bit in just how well we are placed to provide that support."
        },
        {
            "text": "Andrew: So, here we are early 2023. What is it about RPA and the people in the organisation that right now makes you most proud?"
        },
        {
            "text": "Paul: I think they're actually indistinguishable and synonymous. The people in the organisation are the RPA, that is, you know, what makes me most proud about the RPA is its people and what makes the RPA the organisation it is, is the people in it. What makes me most proud? The fact that people care so much. The fact that people are committed, really bought into what the organisation is trying to do I think. It's not always plain sailing and there are, you know clearly there's things we can learn. Our people serve our talk a lot about, you know, asking people to take part and listening to what's in there about how we can do better. And so obviously there are things about for example how we manage continuous improvement, how people are able to bring ideas to life and those sorts of things that I'd like us to maybe be better at but even that is indicative of the fact there is a strong desire to help, to do well, to be a truly excellent service and that all makes me feel really proud to be part of this organisation. I think it's an organisation that, you know, is about the people that make it tick."
        },
        {
            "text": "Andrew: Marvellous. Thank you ever so much for your time, Paul. Really appreciate it today."
        },
        {
            "text": "Paul: OK. Thank you."
        },
        {
            "text": "James: My thanks to Paul and Andrew for that fascinating insight. Next, we’ll be talking Countryside Stewardship."
        },
        {
            "text": " "
        },
        {
            "text": "****Music – leading to next segment ****"
        },
        {
            "text": " "
        },
        {
            "text": "James: As Paul mentioned earlier, at the Oxford Farming Conference in January, the Minister for Food, Farming and Fisheries, Mark Spencer announced that the payment rates for the majority of both Countryside Stewardship revenue options and capital items will increase. These changes were largely welcomed but there were also some concerns and feedback around the scope of the changes and eligibility for the increased capital payment rates. Defra and RPA listened to these concerns, acted upon them and issued a further capital payment rates announcement in mid-January with the amended scope. I’m pleased to say I’m now joined by Faye Slade from the RPA’s Countryside Stewardship Agricultural Transition team, to help us navigate the recent updates and give us the latest information. Faye, thank you for joining us today."
        },
        {
            "text": "Faye: Thanks James, it’s great to be here."
        },
        {
            "text": "James: Faye, I mentioned in my introduction that Minister Spencer made the initial announcement on 5th January, and the RPA issued a Capital Payments update on 18th January. So, what’s the latest?"
        },
        {
            "text": "Faye: As you mentioned, we announced at the Oxford Farming Conference that, from January 2023, we had updated payment rates for both revenue and capital options in Countryside Stewardship. That announcement included that the majority of CS capital payments – so that’s one-off payments for things like hedgerow creation – were being increased from 5th January, with rates going up by an average of 48%. We then issued an update to the announcement and that update focused on Countryside Stewardship Capital payment rates for 2023. We listened to feedback from farmers and land managers and, on 18th January, we announced that we had amended the scope of the updated payment rates to allow more farmers to benefit from those higher rates."
        },
        {
            "text": "James: So, following the feedback, what are the key amendments?"
        },
        {
            "text": "Faye: Well, the changes to the payment rates for capital items will now be applied to all CS and SFI pilot capital grant agreements which began on or after 1 January 2023, in addition to all the new applications for Capital offers that we receive from January 2023 onwards. This widens the number of customers eligible to receive the higher payment rates by nearly five thousand."
        },
        {
            "text": "James: And what about farmers who had an agreement which began in 2022 or earlier?"
        },
        {
            "text": "Faye: Well, if a CS agreement began in 2022 or earlier, customers will receive the new revenue payment rates but when they submit a Capital claim they will receive the rates that are currently within their agreement."
        },
        {
            "text": "James: And I’ve seen some farmers and land managers ask if they can withdraw agreements or items within their agreements, so they can reapply and get the higher capital rates. So, is that an option?"
        },
        {
            "text": "Faye: It might be an option, but there are some factors to consider here and we need to be really clear on this point: if your CS or SFI pilot agreement began in 2022 or earlier, you do have the option to withdraw capital works from your agreement or to withdraw whole agreements and reapply for them, but only if the works haven’t been started. You can only withdraw Capital options where materials have not already been ordered that are needed to do those works and the Capital works have not been started. The other thing to consider is that if you wish to reapply for these items, then you will be required to source any relevant new endorsements or consents."
        },
        {
            "text": "James: Thanks Faye, it’s really helpful to clarify those options. So going back a step to the initial announcement at the beginning of January, there were a few other interesting updates which our listeners may not have picked up."
        },
        {
            "text": "Faye: There certainly were James and, as well as payment rate increases, we really wanted to provide additional flexibility to farmers and land managers. We know how important Countryside Stewardship Capital Grants are to farmers in helping them protect our landscape, and that’s why for 2023 we’ve introduced further improvements building on the rolling application window which we introduced last year."
        },
        {
            "text": "James: We won’t be able to cover all the updates today, but can you just give us a flavour of the improvements this year?"
        },
        {
            "text": "Faye: Well, one example is that farmers told us they feel they need more time to complete capital works. To support this, the duration of agreements has increased for those that start on or after 5 January this year. Agreement Holders will now have three years to complete the capital works in their agreement, so there’s less pressure to complete the actions straight away. We’re also now applying more proportionate reductions if a capital claim is received late. So now, instead of a complete 100% reduction for being just one day late, the reduction will be scaled according to how late the claim is, and hopefully that makes the process a bit fairer."
        },
        {
            "text": "James: They sound really positive developments, all based on insight and feedback, and I believe there are also some significant additions and further payment uplifts this year?"
        },
        {
            "text": "Faye: Yes, we’ve opened a new Countryside Stewardship Higher Tier Capital Grants scheme which offers a selection of specialist Higher Tier capital items, and in the existing Capital Grants scheme we’ve also increased the maximum amount that’s allowable for a single application to £80,000, that’s a limit of £20,000 for four groups. Those groups of options are, Boundaries, Trees and Orchards; Water Quality; Air Quality; and Natural Flood Management. So, this is the latest set of improvements we’ve made to Countryside Stewardship in recent years, and we want to continue to encourage farmers to consider CS as a means to deliver great environmental outcomes."
        },
        {
            "text": "James: And when can our listeners apply and where can they find out more?"
        },
        {
            "text": "Faye: Well, you can apply for Capital Grants and for Higher Tier Capital Grants all year round, and you can read more about the payment rates on GOV.UK."
        },
        {
            "text": "James: And finally Faye, I just want to touch of February’s Higher Tier opening."
        },
        {
            "text": "Faye: Yes, the window opened on 7th February, and it will stay open until 28th April this year, and farmers and land managers are able to apply for Higher Tier Countryside Stewardship agreements for 1st January 2024 agreement start dates. CS Higher Tier is open to all eligible farmers and land managers, including new customers and those with existing CS and Environmental Stewardship agreements."
        },
        {
            "text": "James: So, can you remind us about the purpose of the agreements?"
        },
        {
            "text": "Faye: Yes, CS Higher Tier agreements are usually 5 and sometimes 10 or even 20-year agreements. These agreements help manage environmentally significant sites, commons, woodlands – and the works involved range from planting and maintaining new hedgerows or woodland, right through to restoring peatland and moorland."
        },
        {
            "text": "James: And if farmers and land managers are interested in exploring Higher Tier, what are the next steps?"
        },
        {
            "text": "Faye: Well, first of all it’s important to highlight that applications are welcome from all farmers and land managers, not just those who’ve already been approached by Natural England advisers.  We particularly welcome applications from those who want to protect, restore, enhance or create habitats, such as flower rich hay meadows, heathland, moorland, woodland and wood pasture, as well as those who wish to maintain other aspects of their land. If farmers and land managers are interested in applying for CS Higher Tier, they should apply via an application pack using the Rural Payments portal, and advice is also available from Natural England or the Forestry Commission."
        },
        {
            "text": "James: Thanks Faye, and the opening of Mid Tier for applications is a little later this year?"
        },
        {
            "text": "Faye: Yes, we’ve listened to feedback on what worked well on the SFI pilot and the SFI 2022 scheme, particularly the straightforward application process, and we wanted to see where we could introduce some of this into our other services. While CS Higher Tier will continue to use the established application process, CS Mid Tier is going to look a little different this year. So, to make sure we’ve got everything in place we’re moving the CS Mid Tier window this year to slightly later in the spring. The window will remain open for the same length of time so anyone that wants to apply should still have plenty of time to do so. We’re really excited about the changes and believe that this is going to make things even more straightforward for farmers to apply."
        },
        {
            "text": "James: Great, and we’ll look forward to hearing more about Mid Tier agreements in our next episode. Faye, thank you for joining us on The RPA Podcast."
        },
        {
            "text": " "
        },
        {
            "text": "****Music – leading to next segment ****"
        },
        {
            "text": " "
        },
        {
            "text": "James: Farmers and land managers have been eagerly awaiting further information about what standards will be added to the Sustainable Farming Incentive this year. The scheme, which has a rolling application window, first opened in June 2022 - and contained 3 standards to start with. The announcement at the end of January provided clarity about what more will be available this year and beyond. I’m now joined by Alex Hills, Sustainable Farming Incentive Delivery Manager at the RPA to discuss the announcement and pull out the key points of interest. Alex, welcome back to The RPA Podcast."
        },
        {
            "text": "Alex: Thanks James, it’s good to be here again."
        },
        {
            "text": "James: Alex, Defra published further information on the growth and rollout of the environmental land management schemes at the end of January. So, what did the announcement tell us?"
        },
        {
            "text": "Alex: The announcement included all the future actions we’ll pay for, including payment rates for the ones coming this year in the Sustainable Farming Incentive and Countryside Stewardship. It had more information about the evolved CS scheme, and finally there was information about the new round of Landscape Recovery, opening this year. Now the whole picture has been set out, you can really see that there’s something for everyone in our schemes and grants. And we’ve made them much more straightforward, flexible and workable. So, if you haven’t yet looked, now is the time to."
        },
        {
            "text": "James: So, starting with the Sustainable Farming Incentive scheme, or SFI, what do we know?"
        },
        {
            "text": "Alex: Well, the SFI pays farmers and land managers to carry out farming activities in a more environmentally sustainable way that, alongside food production, they can receive payment for environmental goods and services. Last year, we opened the SFI with 3 standards, with paid actions to do with improving soil health and moorlands, and there are now over 2,100 live SFI agreements. We’re going to learn as we go, expanding and refining the offer until the full scheme is available in 2024. Working in this way means we can make sure we’re giving farmers the support they need to produce high-quality food and take care of the environment. And, importantly, we’re making sure that there’s an offer for all farm types, regardless of size, location, ownership or the systems used."
        },
        {
            "text": "James: And there’s a broad range of actions paid for under the scheme."
        },
        {
            "text": "Alex: That’s right. As I said, the actions available right now are focused on soils and moorland. But this summer, we’re adding lots more actions. In fact, we’re introducing six new standards this summer – that’s three more standards than planned. It gives farmers a wide-ranging offer and helps us to achieve our ambitions for food production, the environment and climate. The six new standards are about nutrient management, integrated pest management, hedgerows, arable and horticultural land, improved grassland, and low input grassland standard."
        },
        {
            "text": "James: And what if you already have an SFI agreement?"
        },
        {
            "text": "Alex: If you have an agreement, you’ll be able to add these actions and more land. Many of the actions we’ll pay for will help farmers reduce costs, improve efficiency and improve the natural environment. For example, the nutrient and integrated pest management standards can help optimise use of inputs, helping to reduce costs whilst also potentially maintaining or even improving yields."
        },
        {
            "text": "James: Thanks Alex, and how long will the agreements last?"
        },
        {
            "text": "Alex: SFI agreements last for three years, and it’s important to highlight here that if you’re a tenant farmer, you don’t need landlord consent to take part. If you carry out the actions, payments will go to you. Also, you can leave the scheme early, with no penalty, if you unexpectedly lose management control of the land you’ve entered into the scheme."
        },
        {
            "text": "James: That all sounds very progressive Alex, and at the beginning of January, the SFI Management Payment was announced. What’s the payment for?"
        },
        {
            "text": "Alex: Well, in short, the SFI Management payment recognises the management costs and time involved for farmers participating in SFI. It responds to feedback about the management and administrative costs of being in the scheme and makes it viable and attractive. The payment is £20 per hectare, for up to the first 50 hectares of land entered into SFI actions. This means farmers will receive up to £1,000 per year in addition to their agreement to cover the administrative costs of participation. We’ll keep this payment under review over the next two years, along with all other elements of scheme design and delivery, to make sure the scheme works for farmers, delivers value for money and achieves our ambitions."
        },
        {
            "text": "James: And some have questioned why the payment is necessary?"
        },
        {
            "text": "Alex: Making the SFI offer financially attractive will increase uptake to the level we need to achieve our outcomes. It will benefit small farms in particular, as they’re currently half as likely as the average farm to be in an environmental land management scheme. We need that to change if we’re to achieve our challenging environmental targets."
        },
        {
            "text": "James: We heard from Faye earlier, who talked us through the latest Countryside Stewardship updates, but the announcement at the end of January also provided an update on Local Nature Recovery – what we now understand will be wrapped into Countryside Stewardship instead."
        },
        {
            "text": "Alex: That’s right. Building on the success of Countryside Stewardship, we’ve decided to evolve Countryside Stewardship to include what we’d originally planned for Local Nature Recovery, rather than introducing a new Local Nature Recovery scheme. This will enable us to achieve our original ambitions through a faster, smoother and familiar route. We’re going to improve CS so farmers benefit from greater flexibility over when they can apply and how they manage their agreements, with improved access for tenant farmers and increased access to Higher Tier options and agreements. The evolution of the Countryside Stewardship scheme will see around 30 additional actions available to farmers by the end of 2024 and, as the schemes evolve over the next two years, we intend to offer SFI and CS in a single, integrated service. There’s also Countryside Stewardship Plus, which will encourage collaboration between land managers, helping them work together to improve their local environment."
        },
        {
            "text": "James: I know this is still being developed but do we know how this will affect existing agreement holders?"
        },
        {
            "text": "Alex: We’re working to make the transition as smooth as possible. Where there are similar actions in both SFI and CS we’ll maintain parity of payment rates across both schemes. So, if you're already carrying out actions in CS you’re not at a disadvantage. People with a CS agreement can also have an SFI agreement, so long as we’re not paying for the same actions twice on the same piece of land, and the actions which we’re paying for are compatible. The scheme will also include what’s currently available through the England Woodland Creation Offer, once that scheme has transitioned. We’ll also improve access for tenants and expand access to Higher Tier options and agreements."
        },
        {
            "text": "James: And finally, Landscape Recovery – I believe further rounds of Landscape Recovery will open for applications in the spring this year and in 2024?"
        },
        {
            "text": "Alex: Yes, Landscape Recovery is designed to fund a smaller number of longer-term, larger-scale, bespoke projects to enhance the natural environment and deliver significant benefits. Last year, we announced the 22 projects chosen for the first round of the scheme, and these projects represent hundreds of farmers and landowners working together to deliver a range of environmental benefits across farmland and rural landscapes. As you said, we’ll open applications for further rounds of Landscape Recovery in spring this year and in 2024, and the second round will focus on net zero, protected sites and habitat creation."
        },
        {
            "text": "James: Thanks Alex, I appreciate we’ve covered a lot of ground today, so where can our listeners find out more about both the ongoing schemes and one-off grant payments?"
        },
        {
            "text": "Alex: The guidance for every scheme and grant on offer can be found on the ‘Funding for farmers and land managers’ page on GOV.UK, so I would encourage all your listeners to visit this page and explore the schemes and grants relevant to them."
        },
        {
            "text": "James: Alex, thank you again for your time today. Next, we’ll be discussing the Future Farming Resilience Fund."
        },
        {
            "text": " "
        },
        {
            "text": "****Music – leading to next segment ****"
        },
        {
            "text": " "
        },
        {
            "text": "James: The Future Farming Resilience Fund has provided business support to farmers and land managers during the first few years of adapting to agricultural transition. This has been an important resource for many in rural communities and, if you currently receive direct payments, you can receive this support free of charge. I’m now joined by Andy Powley, Defra’s policy lead for resilience, to talk more about the fund and how it’s helping farmers and land managers make the right business choices for the future. Andy, thank you for joining us today on The RPA Podcast."
        },
        {
            "text": "Andy: Thanks James, it’s great to be here."
        },
        {
            "text": "James: So, just to be clear for our listeners, what is the Future Farming Resilience Fund and who is eligible?"
        },
        {
            "text": "Andy: Well, through The Fund, any farmer or land manager in England who receives Basic Payment Scheme payments, or BPS, is eligible to receive free business advice from an independent provider during the early years of the agricultural transition."
        },
        {
            "text": "James: And I believe this support has been available for a while now?"
        },
        {
            "text": "Andy: Yes, that’s right. We've been offering this support in phases. I’m pleased to say the final phase of support is now underway, and it will run until March 2025. In this phase, we have seventeen organisations who have been funded by us to give advice to 32,000 people."
        },
        {
            "text": "James: It really does sound like a fantastic resource for our listeners, so how can they find out more about the advice on offer?"
        },
        {
            "text": "Andy: So, to access this advice, I would recommend your listeners take a look at the list of providers in the Future Farming Resilience Fund section on GOV.UK. The providers are arranged by county, and you can check what each adviser offers, so you can choose the one that best suits your particular needs."
        },
        {
            "text": "James: And what happens next?"
        },
        {
            "text": "Andy: You would then contact the provider and register directly, either by e-mail or phone."
        },
        {
            "text": "James: That all sounds really straightforward Andy and, I know from looking at the Future Farming Resilience Fund pages on GOV.UK, that the information is laid out in a very user-friendly way."
        },
        {
            "text": "Andy: Thanks James – certainly ensuring the information is easy to access was one of our main priorities."
        },
        {
            "text": "James: And you mentioned earlier that each adviser may provide a slightly different offer or service, so what support is typically available?"
        },
        {
            "text": "Andy: Well, there’s various types of support to choose from. A popular option is a farm business review, along with recommendations, and that’s something that most providers offer. You may wish to have access to workshops, webinars, farm tours. Farmers could consider carbon audits and benchmarking tools as well. So, there’s really a wide range of providers and support available and you are welcome to get introductory help and information from multiple providers. It’s important to highlight though, whilst you can attend as many opening webinars or introductory workshops as you like, you can only receive detailed 1-to-1 support from a single provider."
        },
        {
            "text": "James: Thanks, Andy, that’s a really important point of clarification. So, finally, could you highlight again where we can find out more about the Future Farming Resilience Fund?"
        },
        {
            "text": "Andy: So, to help you prepare, the easiest way to find the information is to visit the Funding for Farmers and Land Managers page on GOV.UK, and you can find a link to the Future Farming Resilience Fund in the ‘Get Advice’ section. The Funding for Farmers and Land Managers page is genuinely a really helpful asset and, as well as the Future Farming Resilience Fund, it also gives an overview of the new ongoing payments and one-off grants available to farmers in England."
        },
        {
            "text": "James: And if there are any problems accessing the list of providers, I believe there’s support available?"
        },
        {
            "text": "Andy: Yes, that’s absolutely right. If you have trouble accessing the list online, I’d suggest calling the Defra helpdesk, and that can be reached on 0345 933 5577."
        },
        {
            "text": "James: That’s great Andy. As I said before, I think this is a tremendous resource, particularly during these times of considerable challenge and change across the industry. Andy, thanks again for joining us today."
        },
        {
            "text": " "
        },
        {
            "text": "****Music – leading to next segment ****"
        },
        {
            "text": " "
        },
        {
            "text": "So, that’s all we’ve got time for today. Thank you to Paul, Andrew, Faye, Alex and Andy, and thank you once again for listening. We’ve covered a range of topics again today but we’re always happy to receive your questions and suggestions. So, if you’d like us to cover a particular topic or issue with our subject experts, please get in touch. You can e-mail us at External.Affairs@rpa.gov.uk, or you can follow us on Twitter - @Ruralpay - or follow the Rural Payments Agency on Facebook. We’ll be back soon with the sixth episode of The RPA podcast as we keep you updated on developments at the RPA and support you through the agricultural transition process. Goodbye."
        },
        {
            "text": " "
        },
        {
            "text": "****Close music to fade****"
        }
    ]
}