{
    "url": "https://ruralpayments.blog.gov.uk/2023/02/28/the-rpa-podcast-episode-5/",
    "title": "The RPA Podcast: Episode 5",
    "authors": [
        "RPA Editor"
    ],
    "categories": [
        "Basic Payment Scheme",
        "Countryside Stewardship",
        "Environmental Stewardship",
        "RPA podcast",
        "Social Media"
    ],
    "pub_date": "2023-02-28T10:11:52+00:00",
    "content": [
        {
            "text": "Welcome to the fifth episode of The RPA Podcast."
        },
        {
            "text": "In our latest episode, the RPA’s Chief Executive, Paul Caldwell, speaks to Andrew Hawnt, from the RPA’s Internal Communications team, about his reflections of 2022 and ambitions for the year ahead."
        },
        {
            "text": "Faye Slade, from the RPA’s Countryside Stewardship Agricultural Transition team, talks us through the recent Countryside Stewardship updates and gives us the latest information. This includes January’s Capital Payments announcements and the opening of the Higher Tier application window in February."
        },
        {
            "text": "We also take some time to reflect on the recent Environmental Land Management schemes announcements, including the extra Sustainable Farming Incentive scheme standards that will become available this summer. Alex Hills, Sustainable Farming Incentive Pilot Delivery Manager at the RPA, discusses the announcement at the end of January and how it provided clarity about what more will be available this year and beyond."
        },
        {
            "text": "Later in the episode we hear from Andy Powley, Defra’s policy lead for resilience, about how the Future Farming Resilience Fund is providing free business support to farmers and land managers during agricultural transition."
        },
        {
            "text": "You can also read the transcript for this episode here."
        },
        {
            "text": "The RPA Podcast is an opportunity to engage with farmers and land managers in a new way, and we encourage you to reach out to us with suggestions of particular topics that you’d like us to cover with our subject experts. You can e-mail us at External.Affairs@rpa.gov.uk."
        },
        {
            "text": "You can listen to episode 5 of The RPA Podcast on Apple and Spotify or through Buzzsprout."
        },
        {
            "text": "You can also listen to earlier episodes of The RPA Podcast on Apple and Spotify, or through Buzzsprout."
        },
        {
            "text": "Follow us on social media for the latest updates and information on the following accounts."
        },
        {
            "text": "By following and subscribing to our social channels and blog, you’ll be able to see the latest updates about important information."
        },
        {
            "text": " "
        }
    ]
}