{
    "url": "https://defrafarming.blog.gov.uk/2023/02/28/watch-how-the-sustainable-farming-incentive-works-hand-in-hand-with-arable-crop-production/",
    "title": "Watch: How the Sustainable Farming Incentive works hand in hand with arable crop production",
    "authors": [
        "Graham Higgins"
    ],
    "categories": [
        "A view from the farm",
        "Sustainable Farming Incentive"
    ],
    "pub_date": "2023-02-28T12:39:11+00:00",
    "content": [
        {
            "text": "We went to the Isle of Wight to meet agreement holder Caroline Knox. In this film, Caroline explains how the Sustainable Farming Incentive (SFI) works hand in hand with commercial maize and rye production on her farm."
        },
        {
            "text": "Thanks to Caroline for taking part in the film."
        },
        {
            "text": "Read the transcript."
        },
        {
            "heading": 2,
            "text": "Farming with nature"
        },
        {
            "text": "Last year, we launched the SFI with 3 standards:"
        },
        {
            "text": "We're introducing 6 more standards this year:"
        },
        {
            "text": "Subscribe to the blog to receive updates on the rollout of the 2023 standards."
        },
        {
            "text": "In the meantime, do consider the current SFI offer. As Caroline says in the film, you may well be carrying out the actions we'll pay for already."
        },
        {
            "text": "We've revised the scheme standards to make them clearer and self-explanatory. We've simplified the online application system to make it faster and easier for you to apply and we're processing applications and issuing payments quickly. "
        },
        {
            "text": "You can be in the SFI and Countryside Stewardship at the same time, so long as we’re not paying you for the same actions twice and the actions are compatible."
        },
        {
            "text": "You can always add more standards as they become available."
        },
        {
            "text": "Finally, in case you missed it, we recently blogged with an update on the rollout of our environmental land management schemes. We've published the full range of actions, payment rates and when they’ll be available on GOV.UK. This post summarises and links to it, so do take a look."
        }
    ]
}