{
    "url": "https://socialcare.blog.gov.uk/2023/02/28/wise-councils/",
    "title": "Wise councils",
    "authors": [
        "Zoe Fry"
    ],
    "categories": [
        "Care and support",
        "Information sharing",
        "Innovation",
        "Integrated care",
        "Leadership",
        "Workforce"
    ],
    "pub_date": "2023-02-28T12:06:38+00:00",
    "content": [
        {
            "heading": 2,
            "text": "New era of knowledge sharing"
        },
        {
            "text": "What an exciting time for the social care nursing profession! Social care nursing advisory councils have now been launched in every ICB (integrated care board) in England and will be chaired by nursing colleagues from across the sector."
        },
        {
            "text": "The new councils will allow each Chair to form a board of representatives from the local area. They will work with the Director of Nursing in each ICB to provide a better and wider understanding of nursing right across the health and adult social care sectors."
        },
        {
            "text": "For me, it’s an honour to be appointed as one of the Chairs. I see my role as supporting efforts to make sure the wider workforce is included in the development of nursing plans across all settings bringing health and social care together."
        },
        {
            "text": "The advisory group will bring considerable experience, knowledge, innovation and wisdom to the table to better inform the development of nursing practice across all settings."
        },
        {
            "text": "Chairing quarterly council meetings with the Director of Nursing for the ICB will allow me to invite members from frontline social care staff to facilitate and lead discussions relevant to the sector to help shape and inform delivery of ICS (integrated care system) priorities."
        },
        {
            "text": "This provides another avenue to evolve the future of the sector, identify challenges and opportunities, and promote joint working across health and social care. ICS nurses now have a “touchstone” with their social care counterparts to share experiences, provide intelligence and promote solutions within local health and care networks."
        },
        {
            "heading": 2,
            "text": "Problem solving for better outcomes"
        },
        {
            "text": "This is about encouraging diversity of ideas, listening to each other and acting on the things that will make the most difference. This means not only implementing change but sustaining it across health and social care."
        },
        {
            "text": "I see the councils as being places to debate and support the exchange of ideas on relevant professional, clinical and operational matters. They can also be forums to discuss and problem-solve areas important to social care nurses and the wider sector, whilst ultimately delivering better outcomes for individuals, populations and our teams."
        },
        {
            "text": "I have worked in the sector since the age of 13 and spent most of my years in nursing. To be selected to be a chair for one of the advisory councils is an incredible privilege and I look forward to working with the Chief Nurse of my allocated ICB and with colleagues across the sector."
        },
        {
            "text": "The Florence Nightingale Foundation are providing a development programme to support this fantastic project, which I am very much looking forward to completing."
        }
    ]
}