{
    "url": "https://otsi.blog.gov.uk/2025/10/13/compliance-clarity-real-world-lessons-in-trade-sanctions-breach-detection/",
    "title": "Compliance Clarity: Real World Lessons in Trade Sanctions Breach Detection ",
    "authors": [
        "Office of Trade Sanctions Implementation"
    ],
    "categories": [
        "Trade Sanctions"
    ],
    "pub_date": "2025-10-13T16:19:29+01:00",
    "content": [
        {
            "text": "OTSI is committed to sharing information with businesses to support their compliance with trade sanctions. This might be in the form of a disclosure linked to enforcement action, or updated guidance. It could also be in the form of blogs, like this one, where we share trends, typologies and other useful information. In this blog, we discuss a case involving financial services to highlight how good due diligence can prevent breaches of UK trade sanctions regulations. "
        },
        {
            "text": "Between April and June 2025, OTSI received a number of suspected breach reports from the UK branch of a multinational bank. The reports concerned several instances of trade of a product from Russia to a third country. "
        },
        {
            "text": "The product is sanctioned by the UK under The Russia (Sanctions) (EU Exit) Regulations 2019. These sanctions exist to limit Russia’s ability to fund its war in Ukraine.  "
        },
        {
            "text": "For certain goods subject to UK sanctions, it is an offence for a UK person to facilitate the movement of those goods from Russia to anywhere in the world.   This could include providing a bank account or handling a payment for the importing party. These regulations are particularly relevant for multinational financial institutions with branches in the UK, and UK firms which may provide account services to international customers.  "
        },
        {
            "text": "In this case study, payment for the prohibited goods was routed to the UK branch of the multinational bank. The UK branch was acting as an intermediary in the transaction. The UK branch of the bank meets the definition of a UK person. As such, it is subject to UK sanctions regulations. "
        },
        {
            "text": "Account screening by the UK branch identified the payments. Owing to trade sanctions concerns, the UK branch performed enhanced due diligence checks. Consequently, the UK branch did not process the payments.  "
        },
        {
            "text": "Following its own internal investigation, the UK branch of the bank reported the activity to OTSI using our online reporting tool. Our reporting tool allows businesses to submit their concerns along with any relevant documents. This could include, for example, invoices and contracts that have surfaced during internal investigations.  "
        },
        {
            "text": "The information provided by the bank meant we could examine the payments and the underlying trade flow. We concluded that there had not been a breach of trade sanctions by the UK branch of the bank, as the payments were not processed.  "
        },
        {
            "text": "The due diligence of the UK branch of the bank allowed them to stop payments which otherwise would have provided revenue for Russia.  This action safeguarded the bank’s business interests.  "
        },
        {
            "text": "OTSI has powers to share information with our international counterparts to enable them to investigate whether there has been a breach of sanctions in their jurisdiction. This supports the global effort to prevent Russian sanctions evasion. "
        },
        {
            "text": "Key ‘take aways’ for industry "
        },
        {
            "text": "Visit us online  "
        },
        {
            "text": "We invite UK businesses to explore the resources available on our website.   "
        },
        {
            "text": "Use our contact form for enquiries. We encourage businesses and individuals to reach out to us with any questions.    "
        }
    ]
}