{
    "url": "https://environmentagency.blog.gov.uk/2025/10/13/flood-action-week-how-prepared-are-you-for-flooding/",
    "title": "Flood Action Week: How Prepared Are You for Flooding?",
    "authors": [
        "Environment Agency",
        "Mark Garratt: Environment Agency Deputy Director for Capabilities, Stakeholder Management and Engagement."
    ],
    "categories": [
        "Flood"
    ],
    "pub_date": "2025-10-13T09:01:50+00:00",
    "content": [
        {
            "text": "As an Area Flood Risk Manager and National Flood Duty Manger responding to flood incidents over the last 20 years, I've seen first-hand the devastating impacts that flooding has on our communities. I’ve spoken to many families whose homes have flooded. For one family after months of waiting for their home to be repaired, whenever it rains, their children are afraid, not wanting to go to school, worried they’re going to flood again. Flood impacts continue long after that rain has stopped, and the waters recede.   "
        },
        {
            "text": "The UK is experiencing more frequent and intense extreme weather due to climate change, and we are warning communities not to be complacent about the risk of flooding even though drought is still being experienced in some parts of the country.  "
        },
        {
            "text": "6.3 million home and business in areas at risk "
        },
        {
            "text": "Flooding affects more people than you might think. Around 6.3 million homes and businesses in England are in areas at risk of flooding from rivers, the sea or surface water. Yet many people remain unaware of their personal risk or unprepared for what might happen. "
        },
        {
            "text": "Climate change is making extreme weather more frequent and intense across the UK. Last winter alone, the Environment Agency teams issued more than 3,000 flood alerts, 1,600 flood warnings, and three severe flood warnings. The Environment Agency is ready to respond should flooding happen, providing a 24/7 response, with 600 people on call at any one time around the country. "
        },
        {
            "text": "Don’t be complacent "
        },
        {
            "text": "We have today (13 October) launched our annual campaign to encourage you to take practical steps to keep you and your loved one’s safe, and to avoid the worst devastation flooding can cause to homes, businesses and neighbourhoods. "
        },
        {
            "text": "Even after this summer's dry conditions, communities must not become complacent about flood risk – drought and flood risk can exist in the same county at the same time. "
        },
        {
            "text": "Simple steps can make a big difference (and they really can!)  Taking action doesn't have to be complicated or expensive:"
        },
        {
            "text": "Staying Safe  While we can't prevent all flooding, we can significantly reduce its impact through proper preparation. The most effective flood protection combines professional flood defences with individual preparedness and community awareness."
        },
        {
            "text": "Remember, flooding can happen anywhere and at any time and the impacts live long after the rain stops. Whether you live near a river, by the coast, or in an urban area where surface water flooding can happen quickly understanding your risk and having a plan keeps you one step ahead. "
        },
        {
            "text": "Find out more about Flood Action Week: http://www.gov.uk/government/news/public-urged-to-get-flood-ready-as-environment-agency-launches-flood-action-week"
        }
    ]
}