{
    "url": "https://insidehmcts.blog.gov.uk/2025/10/13/inside-pecs-managing-one-of-governments-most-complex-contracts/",
    "title": "Inside PECS: Managing One of Government’s Most Complex Contracts ",
    "authors": [
        "Tim Coates, Head of Prisoner Escort Custody Services (PECS)"
    ],
    "categories": [
        "Crime",
        "Working at HMCTS"
    ],
    "pub_date": "2025-10-13T12:44:14+01:00",
    "content": [
        {
            "text": "[English] - [Cymraeg]"
        },
        {
            "text": "Every week, thousands of defendants are transported from prisons to court hearings across England and Wales. Behind this vital service is the Prisoner Escort and Custody Services (PECS) contract – one of government’s most complex operational arrangements. "
        },
        {
            "text": "PECS – which is overseen by HM Prison and Probation Service (HMPPS) – is responsible for the safe and secure movement and custody of prisoners across England and Wales, ensuring the right person is in the right place at the right time. That includes: "
        },
        {
            "text": "We manage over 600,000 prisoner movements a year through two regional contracts – GEOAmey covers north England and Wales, and Serco covers south England.  "
        },
        {
            "text": "Contracts are managed by operational contract delivery managers who visit courts, prisons and police stations to monitor performance and ensure suppliers meet their obligations. This service has been outsourced since 1994, with the current 10-year contract beginning in 2020. "
        },
        {
            "heading": 2,
            "text": "Contractual realities and performance metrics "
        },
        {
            "text": "The PECS contract sets out clear expectations for service delivery, including arrival times, handover procedures and reporting standards. We monitor performance through detailed metrics and regular reporting, and our suppliers are held to account through a range of Contract Delivery Indicators. Court measures include: "
        },
        {
            "text": "There are also specific measures for vulnerable prisoners such as children and women, including time limits for how long they can be held in court custody after their hearing. "
        },
        {
            "text": "We take failure to meet these requirements very seriously. Where fault lies with PECS, commercial and financial penalties are applied on suppliers (over £600 for every 15-minute delay in Crown Court and £375 in Magistrates’ Court). "
        },
        {
            "text": "The quarterly published PECS contractual performance data shows that compliance is consistently above 99%, with overall performance (which includes delays outside of PECS control) closer to 98%. While 1% is a small proportion, we know it has a significant impact on court users and proceedings given the contract handles hundreds of thousands of moves each year. "
        },
        {
            "text": "Within HMPPS, our Contract Management Boards meet monthly to oversee service delivery and review performance for each contract. Those boards work together to identify areas that are underperforming and decide on appropriate measures to drive improvements.  "
        },
        {
            "heading": 2,
            "text": "Part of an interconnected system "
        },
        {
            "text": "PECS doesn’t operate in isolation. The system is complex and depends on effective coordination between everyone.  "
        },
        {
            "text": "Smooth delivery can be impacted by several factors, including prisoner readiness, wellbeing and safety, court scheduling, and prison capacity – all of which are administered by different partners within the same system. For example, if a defendant in a trial has been moved from one prison to another without the relevant teams being notified, collection and transportation will take longer, impacting on delivery times and potentially delaying court proceedings.  "
        },
        {
            "text": "HMCTS, HMPPS, police and court staff constantly work closely with the regional suppliers to ensure defendants arrive at court safely and on time.  "
        },
        {
            "heading": 2,
            "text": "Collaborating with legal experts  "
        },
        {
            "text": "We know that for trials to run smoothly, PECS must operate effectively, and collaboration is at the heart of this work. We have 12 contract delivery managers across England and Wales. A vital part of their role is to engage with our partners in courts, areas and regions to help improve performance and develop solutions to overcome challenges.  "
        },
        {
            "text": "We also participate in national engagement groups with legal professionals, prisons and the police, and share our performance reports with partners to drive accountability, lead joint projects and improve efficiency. The lessons we learn through this engagement will directly inform how we design and implement future contracts. "
        },
        {
            "text": "Our learning is continuous and, since the current contract began, we’ve been planning how we can improve our service as part of the next agreement. We’re exploring how to:  "
        },
        {
            "text": "We’re working closely with HMCTS to improve the accuracy of our reporting and ensure that feedback from legal professionals is heard and acted on. To achieve this, we want to increase engagement with legal professionals so concerns can be raised and addressed more easily.  "
        },
        {
            "text": "The newly published HMPPS PECS user guide aims to help everyone in the system understand their own roles and responsibilities in the process. When we all work together effectively, PECS provides an essential logistics service to criminal justice, improving access to justice for all. "
        },
        {
            "text": "[English] - [Cymraeg]"
        },
        {
            "heading": 1,
            "text": "Inside PECS: Rheoli un o Gontractau Mwyaf Cymhleth y Llywodraeth"
        },
        {
            "text": "Pob wythnos, mae miloedd o ddiffynyddion yn cael eu hebrwng o garchardai i wrandawiadau llys ar hyd a lled Cymru a Lloegr. Tu ôl i’r gwasanaeth hanfodol hwn yw’r contract Gwasanaethau Carcharu a Hebrwng Carcharorion (PECS) - un o drefniadau gweithredol mwyaf cymhleth y llywodraeth."
        },
        {
            "text": "Mae PECS – sydd wedi’i oruchwylio gan Wasanaeth Carchardai a Phrawf EF (HMPPS) – yn gyfrifol am garcharu a hebrwng carcharorion ledled Cymru a Lloegr yn ddiogel, gan sicrhau bod y person iawn yn y lle iawn ar yr adeg iawn. Mae hyn yn cynnwys:"
        },
        {
            "text": "Rydym yn rheoli symudiad 600,000 o garcharorion y flwyddyn trwy ddau gontract rhanbarthol - mae GEOAmey yn gyfrifol am Gymru a Gogledd Lloegr, ac mae Serco yn gyfrifol am Dde Lloegr."
        },
        {
            "text": "Mae contractau yn cael eu rheoli gan reolwyr cyflawni contractau sy’n ymweld â llysoedd, carchardai a gorsafoedd heddlu i fonitro perfformiad a sicrhau bod cyflenwyr yn bodloni eu rhwymedigaethau. Mae’r gwasanaeth hwn wedi’i allanoli ers 1994, gyda’r contract cyfredol am gyfnod o 10 mlynedd wedi cychwyn yn 2020. "
        },
        {
            "text": "Rydym yn cymryd methiant i fodloni’n gofynion o ddifri. Lle bo PECS ar fai, mae cosbau masnachol ac ariannol i’r cyflenwyr (dros £600 ar gyfer pob 15 munud o oedi yn Llys y Goron a £375 yn y Llys Ynadon)."
        },
        {
            "heading": 2,
            "text": "Realiti contractau a metrigau perfformiad"
        },
        {
            "text": "Mae’r contract PECS yn gosod disgwyliadau clir ar gyfer cyflawni’r gwasanaeth, gan gynnwys amseroedd cyrraedd a safonau adrodd. Rydym yn monitro perfformiad trwy fetrigau manwl ac adrodd yn rheolaidd, ac mae ein cyflenwyr yn cael eu dal i gyfrif trwy amrywiaeth o Ddangosyddion Cyflawni Contract. Mae mesurau llys yn cynnwys:"
        },
        {
            "text": "Mae mesurau penodol hefyd ar gyfer carcharorion bregus fel plant a menywod, gan gynnwys terfynau amser ar gyfer pa mor hir y gellir eu dal yn nalfa’r llys ar ôl eu gwrandawiad."
        },
        {
            "text": "Mae data perfformiad chwarterol y contract PECS yn dangos bod cydymffurfiaeth dros 99% yn gyson, gyda pherfformiad cyffredinol (sy’n cynnwys oedi y tu allan i reolaeth PECS) yn agosach at 98%. Tra bod 1% yn ganran isel iawn, gwyddwn ei bod yn cael effaith ar ddefnyddwyr llys ac ar achosion, o ystyried bod y contract yn ymdrin â miloedd o symudiadau bob blwyddyn."
        },
        {
            "text": "O fewn HMPPS, mae ein Byrddau Rheoli Contractau yn cyfarfod yn fisol i oruchwylio’r ddarpariaeth gwasanaeth ac i adolygu perfformiad pob contract. Mae’r byrddau hynny yn cydweithio i adnabod meysydd sy’n tanberfformio a phenderfynu ar fesurau priodol i sbarduno gwelliannau."
        },
        {
            "heading": 2,
            "text": "Rhan o system gydgysylltiedig"
        },
        {
            "text": "Nid yw PECS yn gweithredu ar ei ben ei hun. Mae’r system yn gymhleth ac yn dibynnu ar gydlynu effeithiol rhwng pawb."
        },
        {
            "text": "Gall cyflawniad esmwyth gael ei effeithio arno gan nifer o ffactorau, gan gynnwys parodrwydd carcharorion, eu lles a diogelwch, amserlenni’r llys, a chapasiti’r carchardai - gyda phob un ohonynt yn cael eu gweinyddu gan bartneriaid gwahanol o fewn yr un system. Er enghraifft, os bydd diffynnydd mewn treial wedi cael ei symud o un carchar i’r llall heb i’r timau perthnasol gael eu hysbysu, yna bydd casglu a chludo’r carcharor yn cymryd yn hirach, gan effeithio ar amseroedd cyflawni ac o bosib yn achosi oedi i’r achos llys."
        },
        {
            "text": "Mae GLlTEF, HMPPS, yr heddlu a staff y llysoedd yn cydweithio’n gyson gyda’r cyflenwyr rhanbarthol i sicrhau bod diffynyddion yn cyrraedd y llys yn ddiogel ac ar amser."
        },
        {
            "heading": 2,
            "text": "Cydweithio gydag arbenigwyr cyfreithiol "
        },
        {
            "text": "Gwyddwn fod yn rhaid i PECS weithredu’n effeithiol fel bod treialon yn gallu rhedeg yn esmwyth, ac mae cydlynu’n ganolog i’r gwaith hwn. Mae gennym 12 o reolwyr cyflawni contractau ledled Cymru a Lloegr. Rhan hanfodol o’u rôl yw ymgysylltu â’n partneriaid yn y llysoedd, ardaloedd lleol a rhanbarthau i helpu i wella perfformiad a datblygu datrysiadau i oresgyn heriau."
        },
        {
            "text": "Rydym hefyd yn cymryd rhan mewn grwpiau ymgysylltu cenedlaethol gyda gweithwyr proffesiynol ym maes y gyfraith, carchardai a’r heddlu, ac rydym yn rhannu ein hadroddiadau perfformiad gyda phartneriaid i sbarduno atebolrwydd, arwain ar brosiectau ar y cyd a gwella effeithlonrwydd. Mae’r gwersi yr ydym wedi dysgu trwy’r ymgysylltu hyn yn cyfarwyddo’n uniongyrchol sut rydym yn dylunio ac yn gweithredu contractau yn y dyfodol."
        },
        {
            "text": "Rydym yn dysgu’n gyson ac, ers i’r contract cyfredol gychwyn, rydym wedi bod yn cynllunio sut y gallwn wella ein gwasanaeth fel rhan o’r cytundeb nesaf. Rydym yn archwilio sut i:"
        },
        {
            "text": "Rydym yn gweithio’n agos â GLlTEF i wella cywirdeb ein hadrodd a sicrhau bod adborth gan weithwyr proffesiynol ym maes y gyfraith yn cael ei glywed a’i weithredu arno. Er mwyn cyflawni hyn, rydym eisiau cynyddu’r ymgysylltiad â gweithwyr proffesiynol ym maes y gyfraith fel bod modd i bryderon gael eu codi ac i ni fynd i’r afael â nhw yn haws."
        },
        {
            "text": "Mae canllaw defnyddwyr HMPPS PECS sydd newydd ei gyhoeddi yn anelu at helpu pawb yn y system i ddeall eu rolau a’u cyfrifoldebau eu hunain yn y broses. Pan rydym oll yn cydweithio’n effeithiol, mae PECS yn darparu gwasanaeth logisteg hanfodol i’r maes cyfiawnder troseddol, gan wella mynediad at gyfiawnder i bawb."
        }
    ]
}