{
    "url": "https://defraenvironment.blog.gov.uk/2025/10/13/listening-and-improving-how-were-developing-species-monitoring/",
    "title": "Listening and improving: how we’re developing species monitoring  ",
    "authors": [
        "Abbie Brown"
    ],
    "categories": [
        "Research and data analysis"
    ],
    "pub_date": "2025-10-13T11:21:19+01:00",
    "content": [
        {
            "text": "Nature underpins our health, wellbeing and the economy. It gives us the essentials of fresh water, air, food, medicine, flood prevention and climate regulation, whilst also providing places to relax and enjoy.  "
        },
        {
            "text": "That’s why we are committed to protecting and restoring nature, and monitoring the abundance of species enables us to understand the state of the wider environment and improvements in biodiversity. "
        },
        {
            "text": "In May 2024 we published, for the first time, 'Indicators for Species Abundance in England' as an official statistic in development. The all-species abundance indicator, once fully developed, will be used to track progress with meeting our statutory biodiversity targets to: "
        },
        {
            "text": "Following this publication, we were keen to invite feedback on the all-species indicator to help inform further development. To achieve this, we:  "
        },
        {
            "text": "We have received an amazing amount of high-quality feedback, both written and verbally following this engagement, which we want to extend a huge thank you for. It has been critical to considering how we can improve future iterations of the all-species abundance indicator and has helped to shape our development plan for the indicator going forward. "
        },
        {
            "text": "Next steps for the indicator "
        },
        {
            "text": "We have now sought to categorise and respond to the feedback and have published our full response on GOV.UK."
        },
        {
            "text": "This covers the following topics:  "
        },
        {
            "text": "We also received some feedback on the priority species indicator – for more information on updates to this indicator, please read the 2025 statistical release.  "
        },
        {
            "text": "Alongside the response to feedback, we have also published some of the underlying code that we use to produce the all-species abundance indicator which will allow researchers to see how the methods are applied and increase transparency.  "
        },
        {
            "text": "This is the first time Defra has published code underpinning any of our statistics and we will aim to publish further scripts relating to the all-species abundance indicator alongside the 2026 release. "
        },
        {
            "text": "To provide any further feedback, please email the Environmental Statistics and Reporting team at biodiversity@defra.gov.uk. "
        }
    ]
}