{
    "url": "https://space.blog.gov.uk/2025/10/13/making-london-accessible-how-travel-hands-is-transforming-urban-mobility/",
    "title": "Making London Accessible: How Travel Hands Is Transforming Urban Mobility",
    "authors": [
        "UK Space Agency"
    ],
    "categories": [
        "Catalysing Investment"
    ],
    "pub_date": "2025-10-13T12:30:18+01:00",
    "content": [
        {
            "text": "Every day, thousands of Londoners with visual impairments face challenges that most of us rarely consider—from navigating busy streets to finding the right bus stop. For many, something as simple as a walk to the park or a trip to the shops can feel daunting without support."
        },
        {
            "text": "Travel Hands, a London-based charity, is changing that story. By pairing visually impaired people (VIPs) with trained volunteers, known as Travel Hands Guides, the service enables safe and confidence-boosting journeys across the city."
        },
        {
            "text": "With support from the UK Space Agency's Business Applications and Space Solutions (BASS) programme, Travel Hands has integrated cutting-edge space-enabled tracking technology to enhance the security and accessibility of its service. Together, they are building a more inclusive London where no one has to walk alone."
        },
        {
            "heading": 2,
            "text": "Innovation that Transforms Everyday Journeys"
        },
        {
            "text": "At the heart of Travel Hands lies a simple idea: independent mobility should be a right, not a privilege. The charity's app allows VIPs to request a journey and be paired with a trained volunteer Guide who will walk alongside them. A dedicated call centre also caters to VIPs who cannot use technology."
        },
        {
            "text": "With backing from BASS, Travel Hands has introduced real-time journey tracking, optimised route planning, and enhanced monitoring to ensure every journey is safe and efficient. A dedicated customer service team, available by phone and online, assists those who may not feel comfortable using the app independently, providing support throughout journeys when extra reassurance is needed."
        },
        {
            "text": "This support improved the user experience of mobile and web applications, enhanced volunteer training modules, and refined the matching algorithm whilst establishing AI foundations."
        },
        {
            "text": "Ishan Jha, Founder of Travel Hands, said:"
        },
        {
            "heading": 2,
            "text": "Backing from BASS"
        },
        {
            "text": "The UK Space Agency's BASS programme supports organisations that use space data and technologies to solve real-world problems on Earth. For Travel Hands, that meant expert mentoring, strategic guidance, and connections to a wider ecosystem of innovators. This support accelerated the charity's ability to refine its app, scale its impact, and demonstrate how space-enabled solutions can improve urban accessibility."
        },
        {
            "text": "Over the past year, Travel Hands has completed more than 1,200 journeys across London, supporting over 350 VIPs and building a community of more than 100 dedicated volunteers. The charity has developed strong partnerships with organisations including Bromley by Bow Centre and Link Up London, whilst delivering corporate volunteering events with JP Morgan Chase and participating in Victoria Park Community Walks and The Great Exhibition Road Festival. Most recently, Travel Hands launched a Macmillan-supported initiative providing tailored assistance for VIPs facing or recovering from cancer."
        },
        {
            "heading": 2,
            "text": "Community in Action"
        },
        {
            "text": "The strength of Travel Hands lies not only in its technology but also in its community. A recent volunteering day with JP Morgan Chase employees demonstrated this perfectly. Volunteers became Travel Hands Guides for the day, walking alongside VIPs through London's streets and transport hubs, experiencing first-hand the barriers faced by visually impaired people—from navigating station layouts to hearing announcements in noisy environments."
        },
        {
            "text": "For VIPs, the day offered connection and relationship-building opportunities. For volunteers, it provided an eye-opening reminder of how accessibility and inclusion benefit everyone."
        },
        {
            "heading": 2,
            "text": "The Power of Partnership"
        },
        {
            "text": "Travel Hands demonstrates what's possible when technology, government support, and community unite. By reducing social isolation and enabling independent journeys, the service is making London safer and more welcoming for visually impaired people."
        },
        {
            "text": "Dr Shuxiu Zhang, Head of Space Applications and Data at the UK Space Agency said:"
        },
        {
            "heading": 2,
            "text": "Next Steps"
        },
        {
            "text": "Travel Hands is now developing the next phase of innovation: integrating Artificial Intelligence into its application. With continued support from the UK Space Agency, the organisation is creating an audio-based interactive itinerary planner allowing VIPs to simply speak their journey requests. The AI will interpret requests, identify suitable guides, plan optimal routes, and provide real-time spoken updates, making booking and navigation more intuitive for audio-reliant users whilst enhancing guide matching and route coordination."
        },
        {
            "text": "By combining space-enabled data, AI innovation, and ongoing support, Travel Hands is setting the stage for the next generation of inclusive mobility in the UK, ensuring every step taken together brings London closer to being fully accessible."
        }
    ]
}