{
    "url": "https://defrafmp.blog.gov.uk/2025/10/13/mmo-updates-bass-fishing-guidance-for-2025/",
    "title": "MMO updates bass fishing guidance for 2025",
    "authors": [
        "Chris Collins, Fisheries Manager, Marine Management Organisation"
    ],
    "categories": [
        "Implementation"
    ],
    "pub_date": "2025-10-13T10:00:26+01:00",
    "content": [
        {
            "text": "The Marine Management Organisation (MMO) has updated the bass fishing guidance on GOV.UK to help improve the understanding on bass fishing regulations."
        },
        {
            "text": "View the updated guidance here Bass Fishing Guidance for 2025."
        },
        {
            "heading": 2,
            "text": "Updates"
        },
        {
            "text": "These updates have been made following discussions with members of the Bass Management Group (BMG) and through wider engagement with commercial and recreational stakeholders. Some important updates to the guidance are:"
        },
        {
            "text": "• Clearer guidance for commercial fishers• Clarification on activities undertaken by chartered angling vessels• Simplified guidance for recreational fishers• Links to related guidance and contact details have been brought together and made more concise."
        },
        {
            "heading": 2,
            "text": "Why it matters"
        },
        {
            "text": "With this clearer guidance, commercial and recreational fishers can better understand what they need to do which will help the long-term health of the stocks."
        },
        {
            "text": "This also helps us to achieve Goal 4 of the bass fisheries management plan (FMP), which is about making sure regulations are followed by improving how we communicate and understand each other."
        },
        {
            "text": "MMO is committed to transparency, stakeholder engagement, and sustainable fisheries management. If you have feedback on the new guidance, please email us at bass@marinemanagement.org.uk."
        }
    ]
}