{
    "url": "https://disabilityunit.blog.gov.uk/2022/05/04/remap-the-organisation-making-things-possible/",
    "title": "Remap: the organisation making things possible",
    "authors": [
        "Remap"
    ],
    "categories": [
        "Raising Awareness"
    ],
    "pub_date": "2022-05-04T08:00:23+01:00",
    "content": [
        {
            "text": "How can small changes support independence for disabled people? "
        },
        {
            "text": "Hear from Remap, a unique charity that has a network of 900 skilled volunteers across the UK, who design and make bespoke equipment for individuals free of charge. "
        },
        {
            "text": "In the last year alone, Remap volunteers have given over 70,000 hours of their time. There’s lots of good equipment on the market, but often there’s nothing quite right for people with specific needs and impairments. In these situations, Remap’s army of ingenious inventors design and make equipment and gadgets for people, young or old alike and free of charge. "
        },
        {
            "text": "The aim is always to help people achieve independence and quality of life, filling the gap where no suitable equipment is available commercially. How have we helped to give independence to disabled people?"
        },
        {
            "heading": 2,
            "text": "Helping Ava ride a bike for the first time"
        },
        {
            "text": "The West Midlands Remap Group worked with Ava to produce a handlebar that was smaller and closer to her body, helping her support her hand on the bike’s bar."
        },
        {
            "text": "Remap Volunteer, Nigel, details the adaptations he made to Ava’s bike:"
        },
        {
            "text": "“I produced two brackets out of a steel square tube, these were then drilled through for the correct size and capped off at each end to reduce sharp edges and increase strength. "
        },
        {
            "text": "Once this was complete I cut them along the length and fitted riv-nuts in order to increase the thread length, and keep sharp edges to a minimum not to catch clothing on. I also made an elbow joint for the handle bar itself with a thread in the end so I could attach a bigger washer to remove any risk of injury from the end of the bar. All open ends of tubes were capped off so fingers couldn’t get caught.”"
        },
        {
            "text": "Ava can now ride a bike for the first time. Her mum, Kerry, explains just how much this means to Ava:"
        },
        {
            "text": "“What the Remap volunteers have done is amazing! She really loves it, before we had the bike adapted Ava found it difficult to hold the handlebars and sit on the seat safely. It’s amazing to see her smiling and enjoying riding her bike.”"
        },
        {
            "heading": 2,
            "text": "Supporting Alun’s sheepdog handling"
        },
        {
            "text": "Alun has been farming for many years, and used a sheepdog to manage his sheep. He regularly competed in sheepdog trials before almost losing his life to cancer."
        },
        {
            "text": "He underwent laryngeal cancer surgery, which removed his voice box. This meant that he could no longer speak as he did before. As a result, he could no longer use a conventional shepherd’s whistle or command his dog using his voice."
        },
        {
            "text": "Alun’s friend Angie got in touch with Remap to see if our volunteers could help. Derek, a Remap Volunteer at the Gwent and Cwmbran panel, was more than happy to help. He cleverly designed a device that could produce four different sounds using the components from commercially available whistles. The compact device is worn on a lanyard and uses four buttons for the various sounds."
        },
        {
            "text": "Angie has successfully trained Alun’s dog to respond to the whistle. Jock can work 350 yards away in windy and wet conditions and still responds to the whistle. She will now be training a second dog to work to the whistle."
        },
        {
            "heading": 2,
            "text": "Find out more"
        },
        {
            "text": "Remap helps people of any age with a disability, in any situation where you can’t find the right item that fits your needs, or if you need something adapted."
        },
        {
            "text": "Each year, thousands of pieces of custom-made equipment are made to help transform the lives of disabled people.  "
        },
        {
            "text": "Could you or someone you know benefit from custom-made equipment in their life? "
        },
        {
            "text": "Could you help as a volunteer to create or adapt equipment? "
        },
        {
            "text": "Find out about how to contact Remap to get their help."
        }
    ]
}