{
    "url": "https://civilservice.blog.gov.uk/2022/05/04/secret-art-of-blogging/",
    "title": "Secret Art of Blogging",
    "authors": [
        "Lorraine McBride, Editor of the Civil Service Blog Channel"
    ],
    "categories": [
        "A great place to work",
        "A Modern Civil Service",
        "An Ambitious Civil Service",
        "An Innovative Civil Service"
    ],
    "pub_date": "2022-05-04T08:12:49+00:00",
    "content": [
        {
            "heading": 3,
            "text": "We’re here with everything you need to know about crafting a cracking blog post."
        },
        {
            "text": "As editor of the Civil Service Blog, I’m regularly asked what makes a great blog post, so let’s start with the basics. The goal for any blog is to write engaging content that holds your attention till the end. If you get bored reading it, chances are, so will everyone else. First up, consider your audience and what might captivate readers. People relate to authentic, real content - either because it’s relevant, interesting or they’ll learn something. So think about how you can hook people from the start. "
        },
        {
            "text": "Choose a strong topic"
        },
        {
            "text": "Consider key challenges, news, campaigns, careers, events, experience or projects you can write about. Keep an eye out for hot topics in the Civil Service, e.g. Modernisation and Reform, the COVID-19 response, or ever-green topics such as How to Nail That Civil Service Interview. Listicles are hugely popular, e.g. 10 Reasons Why: You Must Tune into Civil Service Live, and can be adapted to almost any topic."
        },
        {
            "text": "How long should my blog post be?"
        },
        {
            "text": "Keep your blog short and punchy because the appetite for reading online leans towards brevity. Blog posts must be no more than 650-870 words max. "
        },
        {
            "text": "Give it a funky headline"
        },
        {
            "text": "Hook readers with an attention-grabbing headline that makes them want to read every word. Alliterative and punny headlines can work brilliantly, and a bit of effort is rarely wasted. For example, Civil Service Reform sounds pretty dry, but tweaking it to Civil Service Reform Revolution sounds a bit more exciting. Last year, I opened a draft titled Evaluation which didn’t sound promising. It was swiftly turned into Don’t Stagnate - Evaluate to Innovate!"
        },
        {
            "text": "Another blog post, Workplace Adjustments, popped into my inbox with a photo of a Civil Service form - eek. The good news is most flaws are fixable. Our stories work best when there’s a human element at the heart of the story. "
        },
        {
            "text": "We discovered that a civil servant called Ruth had fractured her back in a motorbike crash, and feared for her career. Fortunately, Ruth was helped with a few modest workplace adjustments and was ultimately able to resume a thriving career. Most satisfyingly, the blog post was topped by a fantastic image of tattooed, smiley Ruth [left], long hair flowing, astride her motorbike, clearly living her best life. "
        },
        {
            "text": "Start with a punchy opener"
        },
        {
            "text": "Look at any online story and you’ll see a bold, punchy opening sentence. Known in the trade as the ‘standfirst’, this aims to sum up in a single snappy sentence the most interesting, insightful or colourful gems to hook readers. Look at the way newspapers present their intros and take your time, because it’s what ‘sells’ the article and lets readers decide whether to read on or click away."
        },
        {
            "text": "Storytelling"
        },
        {
            "text": "I’m regularly asked if a blog post can be personal. Yep, blogs featuring a personal story can be emotional and heartwarming. But if it sounds too soul-baring, then it probably strays over the line. Write like you’re talking to a reader for a conversational vibe. But remember, all our bloggers are ambassadors for the Civil Service, so be professional.  "
        },
        {
            "text": "Break up text "
        },
        {
            "text": "Long blocks of text are hard to read, so break it up with short sentences, punchy paragraphs and subheadings of two to three words. Use bullet points - but no more than three or four to avoid looking like a shopping list! Have a look at other posts on the Civil Service Blog to get a feel for the house style and tone."
        },
        {
            "text": "Writing soon gets dull when all sentences are the same length, so vary the tempo. All our articles adhere to shorter, simple sentences, no more than 22 words long. Finally, tie it together with a strong conclusion to wrap it up."
        },
        {
            "text": "Picture-perfect"
        },
        {
            "text": "Think of the main photograph as your shop window. Our latest blog post always tops the blog homepage, so you need something eye-catching to breathe life into the words, and help explain the story. Take time to get your images right because we can’t fix a blurry shot. It’s your responsibility to provide three strong images which must be hi-res, jpg and landscape. When photographing people, your frame should capture from the head to the waist and leave plenty space above and to the sides, as this leaves a little leeway for cropping."
        },
        {
            "text": "Author shots"
        },
        {
            "text": "If you’re taking a selfie, you don’t need expensive kit - most smartphones are up to the job. There are fantastic photography tutorials online to pick up tips. In a nutshell, take photos during the day, try and step outside into natural lighting and don’t take it too close up. Government buildings can add a pop of location interest. Consider the background (greenery works well) and shoot from different angles for variety. Above all, avoid virtual meeting shots which rarely look anything other than blurry and dull."
        },
        {
            "text": "A Modern Civil Service (AMCS)"
        },
        {
            "text": "The Civil Service is cha-cha-changing and we ask our bloggers to weave in a subtle mention of AMCS to reflect the goal of being Skilled, Innovative and Ambitious in how we serve our citizens."
        },
        {
            "text": "End your blog post like a pro"
        },
        {
            "text": "Aim to end your blog with a bang, not a fizzle, though your conclusion largely depends on your message and readership.  Strong endings include offering a solution to an issue or sharing links for readers to find out more. You might ask a thought-provoking question that lingers in the reader’s mind, or include a compelling call to action. "
        },
        {
            "text": "Want to be a blogger?"
        },
        {
            "text": "We’re always on the hunt for keen, talented writers (you must be a civil servant) so if you fancy being an author, go for it! To find out more, contact lorraine.mcbride@cabinetoffice.gov.uk. "
        }
    ]
}