{
    "url": "https://dwpdigital.blog.gov.uk/2021/09/09/innovation-from-discovery-to-alpha-6-tips-for-negotiating-that-grey-area/",
    "title": "Innovation from discovery to alpha: 6 tips for negotiating that grey area",
    "authors": [
        "David Doherty - UX & UI Designer, DWP Digital"
    ],
    "categories": [
        "Design",
        "DWP Digital",
        "Recruitment"
    ],
    "pub_date": "2021-09-09T15:30:07+01:00",
    "content": [
        {
            "text": "As a UX and UI designer, I’ve often found that there’s a strange grey area between the discovery and alpha phases of a project, where you can find yourself unsure of your next steps. You and your talented team have just gathered a huge amount of user research and data on your service. But what do you do next?"
        },
        {
            "text": "I believe this time is a perfect opportunity to unleash your team’s creative side to start thinking about how to redesign or optimise the service going forward. This communal creativity is exactly what we did when we were between the discovery and alpha phases of a recent project to improve the Access to Work application."
        },
        {
            "text": "Based on this experience, I’ve pulled together a series of tips for anyone else working in this area and looking to make the most of the skills of their team."
        },
        {
            "heading": 2,
            "text": "1. Rally the troops"
        },
        {
            "text": "Traditionally, designers are known as the creative types that can use their skills to design amazing ideas and prototypes, but the reality is that we need to harness the talents of the whole team. Your team has been involved in the project from the inception until now, so naturally they’ll come up with interesting ideas that you haven’t. Use this individuality to create the best possible service for your users by gathering your team for an inspiration and ideation session."
        },
        {
            "heading": 2,
            "text": "2. Use design cards"
        },
        {
            "text": "Before you get your team involved, invest some time in analysing the insights and data points your user researcher and business analyst have already ironed out. You will start to notice key themes emerging from a design perspective. Consolidate these key themes into simple and visual design cards that can be presented to the team during the session. This is a useful technique to provide a foundation and direction for the designs to go in. For example, to meet accessibility needs include an  ‘accessibility-by-default’ card to remind and inspire the team to think of creative ways of alleviating this pain-point."
        },
        {
            "heading": 2,
            "text": "3. Inspire your team"
        },
        {
            "text": "In order to energise the team, it’s important to refresh their memory of the great work they’ve done so far. One idea I’ve used in a workshop environment is an ‘inspiration board’, get creative with what you present to them – but remember to keep it simple. The aim is to get them thinking about the art of the possible. Look into areas such as:"
        },
        {
            "heading": 2,
            "text": "4. Showcase your designs"
        },
        {
            "text": "It’s important to highlight some of your design choices and ideas to the team, as they will appreciate your input and knowledge in the area. This will also provide them with an idea of what is expected from them when it is their turn to contribute. Make it clear that your ideas at this stage are only ideas and can be iterated."
        },
        {
            "heading": 2,
            "text": "5. Provide a blank canvas"
        },
        {
            "text": "I consider this to be the most important step of the process: to harness the individuality of the team and allow them to express their own thoughts and ideas with an abundance of sticky notes, creating their own board with plenty of encouragement to solve the pain points identified in discovery. Using the inspiration board, design cards and your initial design ideas, they will have enough ammunition to work with. You will be amazed at some of the ideas that emerge. A collection of ideation, looking at angles and perspectives that even the best designer will miss."
        },
        {
            "heading": 2,
            "text": "6. Create design cards 2.0"
        },
        {
            "text": "From the ideas generated by the team, additional design cards can be created, ranked, prioritised, and investigated further as the project progresses. The team can then confidently proceed to the next stage knowing that they are heading in the right direction."
        },
        {
            "text": "The beauty of design is that it fuels innovation, which must be flexible and fluid. If you find that a technique is not working, get creative and mix things up! Strict and rigorous processes can be detrimental in creating the best ideas, whereas flexibility is key to helping with creative processes."
        }
    ]
}