{
    "url": "https://defrafarming.blog.gov.uk/2021/09/09/introducing-the-animal-health-and-welfare-pathway/",
    "title": "Introducing the Animal Health and Welfare Pathway",
    "authors": [
        "Stewart Houston CBE"
    ],
    "categories": [
        "Payments to improve animal health and welfare"
    ],
    "pub_date": "2021-09-09T13:02:20+01:00",
    "content": [
        {
            "text": "I come from a pig farming background, although my dad was a joiner in a Tyneside shipyard."
        },
        {
            "text": "I’ve been a member of Defra’s Animal Health and Welfare Board for a number of years. We’ve worked on a huge variety of issues: from greyhounds to goats, cats to cows."
        },
        {
            "text": "However, the most exciting piece of work for me has been the development of a proposition to improve the health and welfare of English farmed animals by controlling and eventually eliminating endemic diseases."
        },
        {
            "text": "Over the last couple of years, a group of farmers, supported by vets, specialists and Defra colleagues have worked together to design a way to help fellow farmers bolster the health and welfare of their stock, whilst at the same time improving their bottom line. We’re calling it the Animal Health and Welfare Pathway."
        },
        {
            "text": "Right at the outset, it was evident that the farmers’ own vet needed to be at the heart of delivery and veterinary input has been immense in guiding us up the first steps of the Pathway."
        },
        {
            "text": "The programme is set to start in Spring 2022 with a vet visit. This will be paid for by the government. They will undertake a health and welfare review of the farm, including diagnostic testing, to set the foundations for the journey along the Pathway. The initial focus will be on improving disease prevention and controlling or eradicating an industry agreed list of diseases in each species."
        },
        {
            "text": "Having completed this first step, farmers will continue along the Pathway supported by Animal Health and Welfare grants which will be launched later in 2022 (more on these in October)."
        },
        {
            "text": "A payment by results programme is also in the planning stages, which will reward farmers for achieving higher welfare outcomes by supporting the ongoing costs involved in delivery."
        },
        {
            "text": "The ambition is that over time everyone, including your neighbours and small scale producers, will be engaged, thereby reducing the risk of re-infection to those who have forged ahead with the programme. We’ll have to remain flexible as we progress to long term delivery, as lessons are learned and implemented."
        },
        {
            "heading": 2,
            "text": "Why does this matter?"
        },
        {
            "text": "We know that disease and conditions such as lameness mean that farmers lose money every single day. We know they would like to do something about it, but don’t or can’t because of the risk of reinfection of disease. The difference with this programme is that everyone will be working together towards the same goal."
        },
        {
            "heading": 2,
            "text": "Who is this for?"
        },
        {
            "text": "This is for all livestock farmers. At the heart of the Pathway is the principle of the farmers’ own vet working with them on an individual farm basis whether you are farm assured or not, and there will be a format that covers the health and welfare needs of your farm."
        },
        {
            "text": "There are big wins here for the public purse, too. A higher health national flock or herd will have a reduced need for veterinary medicines, reduce the effect on the environment and underpin our international reputation for good health and welfare, bolstering our export opportunities."
        },
        {
            "text": "We also know that the British public value good welfare, so it makes sense to support farmers in reaching a higher standard."
        },
        {
            "text": "I don’t underestimate the challenges behind the delivery of this vision, so thank you for reading this and we’ll keep you up to date with progress. If you have any questions, leave them in the comments and don’t forget to subscribe to the Future Farming blog. "
        }
    ]
}