{
    "url": "https://dataarchitecture.blog.gov.uk/2021/09/09/join-us-at-dataconnect21-from-27-september-to-1-october-2021/",
    "title": "Join us at DataConnect21 from 27 September to 1 October 2021",
    "authors": [
        "sarahljohns"
    ],
    "categories": [
        "Data architecture",
        "Office for National Statistics"
    ],
    "pub_date": "2021-09-09T13:37:57+01:00",
    "content": [
        {
            "text": "DataConnect21 is almost here - a week of over 70 free online events and sessions for anyone working with data in the UK government and public sector - 27 September to 1 October."
        },
        {
            "text": "DataConnect21 is co-hosted by the Government Data Quality Hub and the Data Standards Authority at the Central Digital and Data Office, and supported by DAMA UK, the data professionals community. It brings together teams from across government, Local Government and the public sector to showcase their work, sharing learning and unpack some of the data community’s most important questions."
        },
        {
            "text": "There's an exciting range of online events ranging from data architecture, metadata, data standards to data ethics, governance, to data quality and security. Build your own agenda across the week with sessions relevant to you."
        },
        {
            "text": "Participating organisations include Sedgemoor Council, DWP Digital, DAMA UK, HMRC, National Innovation Centre for Data , Department for Education, Open Data Institute, Office for National Statistics, Open Data Institute Leeds, NHSX, Manchester Digital, Cabinet Office, Information Commissioners Office and many more."
        },
        {
            "text": "There's also an in-person day in Manchester on Thursday 30 September for those based in and around the city."
        },
        {
            "heading": 2,
            "text": "What’s in it for Data Architects?"
        },
        {
            "text": "DataConnect21 is an important opportunity for us to champion foundational data specialisms such as data architecture, metadata, data modelling and data engineering for successful data sharing and data use across government and the public sector."
        },
        {
            "text": "We've lined up a series of events with key people from across government including Alison Pritchard, Deputy National Statistician at ONS, Tom Read, Chief Executive Officer of Goverment Digital Service, Paul Wilmott, Chair of the Central Digital and Data Office. Tomas Sanchez Lopez, Chief Data Architect at Office for National Statistics will be chairing an event with Sarah Burnett, Chief Data Architect at Defra and Lisa Allen, Head of Consultancy for Data Programmes at the Open Data Institute."
        },
        {
            "text": "There are also sessions on data architecture, metadata, data engineering, business glossaries, data sharing and much more. We'll also have a special cross-Government Data Architecture Community meetup - find out more about this cross-gov Community and how you can join. GDAC is open to anyone working in a data architect or related role across government and the public sector."
        },
        {
            "text": "DataConnect21 is open to all government, Local Government and public sector staff regardless of grade – we welcome everyone with an interest in data. That includes senior leaders, data architects, engineers, modellers, delivery managers, developers, product owners and related professions. This is our most dynamic and ambitious data event yet so we’d like you to encourage your colleagues, or anyone you’re working on a data project with to attend."
        },
        {
            "text": "To see the schedule and register to attend, visit the DataConnect21 website and follow us on Twitter @DataConnect21."
        }
    ]
}