{
    "url": "https://apprenticeships.blog.gov.uk/2021/09/09/update-on-route-reviews/",
    "title": "Update on route reviews",
    "authors": [
        "Jill Nicholls"
    ],
    "categories": [
        "Apprenticeship standards"
    ],
    "pub_date": "2021-09-09T10:00:52+01:00",
    "content": [
        {
            "text": "As we move into autumn and the start of a new school year, work on all current route reviews is coming to a head and we can look forward to the launch of reports for four key sectors."
        },
        {
            "text": "A total of 58 occupational standards - which set out the key knowledge, skills and behaviours employers expect to be covered by apprenticeships and wider technical education - are being looked at for the route review covering engineering and manufacturing."
        },
        {
            "text": "I explained in my last blog in June that we had sent recommendations, which will help ensure the first 34 of these stay relevant and up to date, to our employer-led trailblazer groups. They are leading with implementation of these recommendations."
        },
        {
            "text": "I am delighted to say that our recommendations for the remaining 24 have also now been finalised and sent to the trailblazers. They impact on the following apprenticeships:"
        },
        {
            "text": "A lot of hard work has gone into this route review. It is the biggest that the Institute has done and I would like to thank all of those who took part in the consultation and conversations. This helped us to understand what the sector thought needed to change, and we believe our recommendations will really benefit and improve the quality of apprenticeships and technical education products on offer in the engineering and manufacturing sector."
        },
        {
            "text": "A full report is now being written and will be published in the autumn along with further full reports for other route reviews that have been completed over the last 18 months, which are:"
        },
        {
            "text": "As we move forward, the Institute is changing its approach to route reviews to enable a more collaborative and dynamic process with a timely and appropriate outcome for each route. We are currently piloting this approach in the construction route and hope to follow with other routes in early 2022."
        },
        {
            "text": "Partnered with the implementation of our new revisions prioritisation approach and our restructure into route-specific teams, we hope that our employers and stakeholders will be keen to engage with us to ensure our suite of technical education products provide the best possible experience for the apprentices and students."
        }
    ]
}