{
    "url": "https://insidedvla.blog.gov.uk/2021/11/17/be-a-road-safety-hero-by-making-sure-your-eyesight-is-fit-for-driving/",
    "title": "Be a ‘Road Safety Hero’ by making sure your eyesight is fit for driving",
    "authors": [
        "Dr Cathy Armstrong"
    ],
    "categories": [
        "Features"
    ],
    "pub_date": "2021-11-17T12:52:10+00:00",
    "content": [
        {
            "text": "This week is Road Safety Week. At DVLA, we take road safety very seriously – one of the ways we do this is by ensuring drivers meet the vision standards required by law to drive. This involves assessing drivers with visual disorders and encouraging all road users to regularly check their own eyesight."
        },
        {
            "text": "As the dark winter months draw near, it’s important to be aware that fewer daylight hours and poor weather can lead to reduced visibility when driving. Therefore, meeting the minimum eyesight standard for driving is essential for being safe on the road."
        },
        {
            "heading": 2,
            "text": "Be a ‘Road Safety Hero’ this winter"
        },
        {
            "text": "This year’s Road Safety Week theme is ‘Road Safety Hero’ and it’s important to remember that everybody can be one this winter, including you."
        },
        {
            "text": "Seasonal changes such as heavy rain, hail, sleet and snow, along with darker days, can all impact your vision when driving. Adverse weather is a challenge for all drivers, especially if you already have an eyesight condition."
        },
        {
            "text": "Fog, ice on the windshield, and even glare from low sun can make driving more hazardous during the winter months. If you’re planning a journey this winter, whatever the distance or time of day, then be a ‘Road Safety Hero’ by being aware of the hazards before setting out."
        },
        {
            "heading": 2,
            "text": "Is your eyesight fit for driving?"
        },
        {
            "text": "No matter the weather or time of year, your eyesight must be fit for driving at all times. And remember – seasonal changes and poor weather aren’t the only things that can affect your vision."
        },
        {
            "text": "Eyesight can naturally worsen over time, so make sure you have regular eye tests, at least every 2 years, or more often if your optician advises this. If you’re concerned about your vision, don’t wait for your next eye appointment – book a test with your optician as soon as you can. If you don’t meet the minimum eyesight standard, you must stop driving and tell DVLA."
        },
        {
            "text": "If you need to wear glasses or contact lenses for driving, make sure you wear them every time you drive to stay safe and reduce the risk of accident, injury or damage to others on the road. In good daylight, drivers must be able to read, with glasses or contact lenses if needed, a car number plate made after 1 September 2001 from 20 metres."
        },
        {
            "heading": 2,
            "text": "Take the 20-metre number plate test"
        },
        {
            "text": "But how far away is 20 metres? You won’t have a measuring stick in the car with you! 20 metres is around the length of 5 parked cars, or the length of 2 double decker buses."
        },
        {
            "text": "A survey by DVLA found that less than 50% of motorists are aware that they must read a number plate from 20 metres. That’s why we’ve launched a campaign to raise awareness of the 20-metre eyesight test. The number plate test is a simple and effective way to check if your eyesight meets the required standard for driving. Anyone can do the test at any time."
        },
        {
            "text": "Visit our page on driving eyesight rules for more information, and check if you need to tell DVLA about your eyesight problem. Our driving eyesight rules are also available in Welsh on GOV.UK."
        },
        {
            "text": "You can also visit Brake’s Road Safety Week campaign to find out how you can take action and become a ‘Road Safety Hero’ this winter."
        }
    ]
}