{
    "url": "https://insolvencyservice.blog.gov.uk/2021/11/17/collaborative-enforcement-jail-for-carbon-credit-fraudsters/",
    "title": "Collaborative enforcement: Jail for carbon credit fraudsters",
    "authors": [
        "Joe Peacock"
    ],
    "categories": [
        "Company investigations",
        "Disqualification",
        "Enforcement",
        "Fraud"
    ],
    "pub_date": "2021-11-17T09:31:03+00:00",
    "content": [
        {
            "text": "I’m Joe Peacock and I’m a Senior Investigator within the Insolvency Service's Investigation and Enforcement Services. I work in the Company Investigations Live team, a team that undertakes confidential investigations into companies which are active and trading normally."
        },
        {
            "text": "My team played an important role in the recent criminal case involving Paul Seakens. Paul Seakens is a convicted fraudster who has been jailed for 13 years and banned from running a limited company for 12 years."
        },
        {
            "heading": 2,
            "text": "Carbon credits"
        },
        {
            "text": "Paul Seakens was a company director who facilitated the sale of near worthless carbon credits as investments to the public. A carbon credit is a certificate or permit which allows the right to emit one tonne of carbon dioxide and can be traded for money."
        },
        {
            "heading": 2,
            "text": "Tullett Brown Limited"
        },
        {
            "text": "The first company in a long chain of companies involved in the sale of carbon credits as investments was Tullett Brown Limited. Tullett Brown Limited was initially engaged in land banking: selling small parcels of land - often in areas with no chance of development - at high mark-ups and claiming they will be developed into housing."
        },
        {
            "text": "The company then moved into marketing and selling carbon credits as investments. Both 'investments' were sold to the public at inflated prices and generated £3.2million."
        },
        {
            "text": "A winding up petition was presented in March 2012 against Tullett Brown Limited and 3 other companies, following our confidential investigations into the live companies. The 4 companies were wound up in June 2012, with the Official Receiver appointed as liquidator of these companies."
        },
        {
            "heading": 2,
            "text": "Eco Synergies Limited"
        },
        {
            "text": "The Official Receiver's appointment triggered further investigations, which identified Eco Synergies Ltd as a supplier of carbon credits. Enquiries into Eco Synergies Ltd established the company was a wholesaler of carbon credits which it supplied to other, often related companies, investment opportunities for the public."
        },
        {
            "text": "The investigation showed that each carbon credit was purchased for an average of 65p and sold by a web of companies at an 800% mark-up. The total amount of carbon credits sold was £19million which cost Eco Synergies Ltd approximately £2.3million. Investors were told that they could make in excess of 60%."
        },
        {
            "text": "Petitions were raised by the Secretary of State for the Department of Business, Energy & Industrial Strategy, and presented to the court in December 2013. Eco Synergies Ltd and Eco Synergies Nominees Ltd, along with 11 companies that sold carbon credits using high pressure and misleading sales techniques, were wound up in May 2014."
        },
        {
            "text": "Following the investigation into Eco Synergies Ltd, Carbon Neutral Investments Limited - who later changed their name to Opus Capital Investments Limited - was identified as a carbon credit sales facilitator and the next part of the chain. Some of the companies that used Eco Synergies Ltd services started using Opus Capital Investments."
        },
        {
            "heading": 2,
            "text": "Company investigation"
        },
        {
            "text": "The investigation into Opus Capital Investments began in February 2013 using confidential investigation powers under the Companies Act 1985. These powers enable us to require a company or individuals to provide information and documents."
        },
        {
            "text": "Investigators uncovered Opus Capital Investments provided back-end services that facilitated the sale of carbon credits to the public. Up to 90 broker companies were involved, selling carbon credits to the public by cold calling and using high pressure misleading sales tactics."
        },
        {
            "text": "In excess of 5 million carbon credits were sold for £36 million."
        },
        {
            "text": "Opus Capital Investments’ business was transferred to another company Gemmax Solutions Limited, another company controlled by the same director of Opus Capital Investments, Paul Seakens."
        },
        {
            "heading": 2,
            "text": "Criminal proceedings"
        },
        {
            "text": "As a result of City of London Police investigations, Paul Seakens and his associate, Luke Ryan were charged with running a business for fraudulent purposes. Paul Seakens and Luke Ryan were directors of a company called Enviro Associates Limited which sold carbon credits as investments to the public. Enviro Associates Limited was part of the 19 companies which were wound up in April 2015."
        },
        {
            "text": "To assist the police, a formal disclosure of information was made. I worked closely with the Insolvency Service's Legal Services Directorate to provide a witness statement to support the prosecution, which was in excess of 150 pages. At the trial, I gave evidence and was cross examined over 2 days."
        },
        {
            "heading": 2,
            "text": "Disqualification and conviction"
        },
        {
            "text": "Both defendants were found guilty, with Paul Seakens convicted of three counts of money laundering and one count of fraudulent trading, while Luke Ryan was convicted of one count of fraudulent trading."
        },
        {
            "text": "Both men were imprisoned on 28 May 2021. Paul Seakens received a 13 year sentence and was disqualified from being a company director for 12 years. Luke Ryan, for his part, was jailed for 6 years and disqualified from being a company director for 8 years."
        },
        {
            "text": "In summary, Her Honour Judge Cahill, QC, said \"I also pay tribute to Joe Peacock of the Insolvency Service. His investigation was of great help in the police investigation. It was thorough and pursued with tenacity. He is to be commended for it and I would ask that you make those comments known both to him and to his line managers.\""
        },
        {
            "text": "Following our hard work, the courts recognised the severity of Paul Seakens and Luke Ryans' actions and we're very pleased to have helped support the Crown Prosecution Service in its successful prosecution of these fraudsters. This was a great example of multi-agency work to protect the public from scammers."
        },
        {
            "text": "-----------------------"
        },
        {
            "heading": 2,
            "text": "Read more on this topic"
        },
        {
            "text": "Investigations and enforcement: what we do, our outcomes and complaints"
        },
        {
            "text": "Complain about a limited company"
        },
        {
            "text": "Company director disqualification"
        },
        {
            "heading": 3,
            "text": "Further information"
        }
    ]
}