{
    "url": "https://teaching.blog.gov.uk/2021/11/17/the-four-key-ways-were-supporting-staff-wellbeing/",
    "title": "The four key ways we’re supporting staff wellbeing",
    "authors": [
        "Laura Fordham"
    ],
    "categories": [
        "Reducing teacher workload",
        "Teacher mental health",
        "Teacher wellbeing"
    ],
    "pub_date": "2021-11-17T14:53:35+00:00",
    "content": [
        {
            "text": "Laura Fordham is part of the senior leadership team at Bedford Academy, she shares how they are prioritising staff wellbeing and using the DfE Education staff wellbeing charter and its principles to support this work."
        },
        {
            "text": "After a challenging 18 months, supporting staff wellbeing has never been more important and it’s something that is a priority for Bedford Academy. We’ve found that the charter complements the existing work on wellbeing that we’ve been doing during the pandemic. I’ve worked closely with headteacher, Chris Deller, and the leadership team to ensure staff wellbeing is considered in everything the academy does. This drills down to four main pillars of work:"
        },
        {
            "text": "1. Giving staff a voice in decision making"
        },
        {
            "text": "We have ensured staff have a say in the decisions that affect them, and their wellbeing, by giving them the chance to contribute to conversations around how the school operates."
        },
        {
            "text": "Chris, the school's head, sends out a brief bi-weekly survey which gives staff involvement in the shaping and structures of the school. It also allows the leadership team to check in on how staff are feeling and respond to any changes in staff wellbeing."
        },
        {
            "text": "All staff are invited to contribute ideas and opinions, to support wellbeing, during staff consultations. They can also join our wellbeing committee, formed of staff from all departments. The committee aims to promote the wellbeing of all employees and meets termly to coordinate wellbeing weeks and inform staff of new initiatives via the monthly wellbeing newsletter. They also evaluate the impact of any interventions we have introduced to improve wellbeing – such as reducing emails after 6pm or at the weekend – to ensure they’re effective."
        },
        {
            "text": "2. Driving down unnecessary workload"
        },
        {
            "text": "We know that workload has a massive impact on wellbeing, and we cannot address one without addressing the other."
        },
        {
            "text": "We have established a workload group, which is made up of different members of staff each term. The group includes those with a range of experiences, for example staff who have taught in at least one other school; staff who have previously worked outside of teaching and support staff. They identify priorities to support staff in managing workload by using the DFE’s School workload reduction toolkit. The group uses surveys to identify pinch points where workload interventions are needed and to remove any unnecessary burdens. For example, we’ve reduced the stress of lesson observations by using an effective feedback model. This has given way for a new approach, where feedback is practiced away from the lesson before being implemented in teaching practice."
        },
        {
            "text": "3. Embedding wellbeing in training and professional development"
        },
        {
            "text": "We view line management as critical to staff wellbeing. We shared a ‘top 10 tips’ guide for line managers to help better promote productivity and foster a supportive work environment. As well as an ‘expert teacher directory’ to signpost staff to best practice. The academy has also launched a shadowing programme, giving staff the opportunity to broaden their experience and get to know more about their colleagues and the roles they perform. We’ve found this can boost wellbeing and help staff work towards their career goals."
        },
        {
            "text": "4. Providing staff with tools and resources to support wellbeing"
        },
        {
            "text": "We will be offering mindfulness to staff this term, using charity resources provided by the Mindfulness in Schools Project (MiSP). This will work on the notion that wellbeing starts with the individual. We believe that schools will flourish if leaders give staff the support they need to take responsibility for their own and other people’s wellbeing."
        },
        {
            "text": "Find out more about the charter and the benefits of using it here."
        },
        {
            "text": "Download the charter."
        }
    ]
}