{
    "url": "https://civilservice.blog.gov.uk/2023/05/15/a-new-job-can-be-scary-talking-about-your-anxiety-shouldnt-be/",
    "title": "A new job can be scary, talking about your anxiety shouldn’t be",
    "authors": [
        "Alex Lennie"
    ],
    "categories": [
        "A great place to work",
        "A Modern Civil Service",
        "A Skilled Civil Service",
        "Uncategorized"
    ],
    "pub_date": "2023-05-15T08:41:53+00:00",
    "content": [
        {
            "heading": 3,
            "text": "Starting a new job can be daunting at the best of times, but for someone living with anxiety this can be even harder. Civil Service recruit Alex Lennie talks about the importance of being able to talk openly to her manager about finding solutions that have helped her thrive in the workplace. "
        },
        {
            "text": "I’ve lived with anxiety for as long as I can remember. Alongside some other mental health issues, I struggle with social anxiety and a more generalised anxiety. I’ve always worried this would be detrimental to my working life and while job searching, it was with trepidation that I poured over job descriptions, flagging areas that might trigger my anxiety. Pushing through this, I applied for several jobs and despite my nerves, I presented myself as a calm and confident person. All the while I worried inwardly that I might struggle to maintain this throughout my entire working life."
        },
        {
            "heading": 4,
            "text": "Starting work"
        },
        {
            "text": "I joined the Civil Service in July 2022 after finding a role within the VOA. I felt welcomed from the moment I started and some of my anxieties were eased by just the friendly staff around me. Seeing information about mental health on my local intranet and it being included in e-learning gave me the confidence to be more open about my personal mental health struggles."
        },
        {
            "text": "Opening up to anyone about your mental health problems can be nerve-wracking. I gave a lot of thought to what causes my anxiety to flare up and what I can do to adjust my working environment to make it a better place to work. If there is too much noise around me, specifically overlapping voices, I struggle to focus and it causes me to panic. Having an irregular schedule makes it difficult to balance my work life and personal life.  Speaking over the phone with external clients can cause me to fall into a panic attack, especially if it’s unexpected. "
        },
        {
            "heading": 4,
            "text": "What helps me?"
        },
        {
            "text": "Having solutions made it easier to speak to my line manager. It was a lovely conversation, talking back and forth about how to make the workplace a positive environment and help to make me a happy productive member of my team. It was encouraging to feel that I was being listened to, acknowledging that I would have good and bad days, but the support would be there for me regardless, when I needed it. "
        },
        {
            "heading": 4,
            "text": "Thrive app"
        },
        {
            "text": "Some of these adjustments have been access to mental health support through the Charity for Civil Servants offer of the Thrive app which has helped both in and out of work offering me a support service I can contact by text.  More focused on the workplace I have been able to choose quieter days to come into the office to avoid being over-stimulated by the noise of other people and if I am required to come in on a busy day for meetings, I can wear my loop earplugs that lessen background noise to help me focus."
        },
        {
            "text": "I’ve been part of the Civil Service now for almost a year. Having the ability to create a regular routine, to talk to my line manager openly about my anxieties and mental health issues, and the kindness of the people around me has made this a workplace where I feel I can thrive."
        },
        {
            "text": "This year the focus of Mental Health Awareness Week is anxiety. The Charity for Civil Servants have worked with the charity Anxiety UK for more than 10 years in order to offer civil servants specialist help and support. "
        },
        {
            "text": "The Charity for Civil Servants can offer you free membership for a year with Anxiety UK to help manage your anxiety, stress levels and mental wellbeing.  This membership gives you access to reduced cost therapies, access to the online CBT programme Beating the Blues, access to the Anxiety UK Members area and other free online resources and many other benefits.  You may also be able to fund counselling and therapy depending on your circumstances.  You will need to apply to the Charity for help and request to speak to a wellbeing adviser."
        },
        {
            "heading": 4,
            "text": "Useful links"
        },
        {
            "text": "Please visit the new pages on the Charity for Civil Servants website for more information on Workplace Adjustments ."
        }
    ]
}