{
    "url": "https://environmentagency.blog.gov.uk/2023/05/15/bathing-water-season-for-2023-officially-begins/",
    "title": "Bathing water season for 2023 officially begins",
    "authors": [
        "Environment Agency"
    ],
    "categories": [
        "Environment Agency"
    ],
    "pub_date": "2023-05-15T13:38:24+00:00",
    "content": [
        {
            "text": "As the weather warms up and the holiday season approaches, many of us will be gearing up for a trip to the seaside."
        },
        {
            "text": "Knowing the quality of the water at a beach or inland bathing spot means you can get the most out of your visit. Today marks the start of the bathing water season when our Environment Agency officers are out collecting samples to assess water quality."
        },
        {
            "text": "Between now and September, our teams will be taking over 7000 samples at 424 designated bathing waters across England."
        },
        {
            "text": "The samples are tested in our labs and then the results are uploaded onto Swimfo, which provides regular information on water quality across all designated bathing waters. This information is regularly updated throughout the season and then an annual classification for each bathing water, based on four years of data, is announced later in the year."
        },
        {
            "text": "Last year 97.1 per cent of bathing waters met the minimum standard of Sufficient, with 92.8 per cent meeting the highest standards of Good and Excellent."
        },
        {
            "text": "The data not only informs you about the quality of the water, it also drives huge investments and improvements. Overall bathing water quality has improved significantly over the last few decades - with a continuing upward trend - due to robust Environment Agency regulation and working with partners. In most places bathing water is now better than it has been for generations."
        },
        {
            "text": "Despite these improvements, there is work to do at newly designated inland waters, which requires a combined effort from water companies, farmers, regulators, councils, local businesses and the general public."
        },
        {
            "text": "How we sample"
        },
        {
            "text": "Our sampling measures two types of bacteria, E. coli and intestinal enterococci. These two faecal indicator organisms (FIOs) indicate the level of faecal pollution in water and can come from a variety of sources including sewage, agricultural livestock, urban drainage, wildlife and bathers."
        },
        {
            "text": "We follow a strict protocol to ensure samples are taken consistently both in terms of location and depth of water, and also covering a range of tidal states where it is safe to sample. The standards come from guidelines produced by the World Health Organisation (WHO)"
        },
        {
            "text": "Pollution "
        },
        {
            "text": "Most of our bathing waters have consistently high quality when we measure and classify these against the standards of the Bathing Water Regulations."
        },
        {
            "text": "Assessing levels of FIOs require a laboratory analysis and days for these to be cultivated so can’t be measured in real-time. Instead, to help bathers understand what water quality is likely to be on a given day, we carry out daily pollution risk forecasts throughout the summer. We issue a warning and advice against bathing if we become aware of a pollution incident or if we forecast that quality is likely to be reduced because of predictable factors like rain, wind or tides. Warnings are posted on Swimfo and displayed on signs at the beach so bathers can make informed decisions before deciding whether to enter the water."
        },
        {
            "text": "Our pollution risk forecasts do not include notifications of storm overflow operations as a method to consistently assess the impact of spills to bathing waters has not yet been developed. Water companies each have their own system to inform bathers when their storm overflows operate, which provides additional information on water quality for the public."
        },
        {
            "text": "This information about storm overflow spills can be found by visiting water company websites directly or the Safer Seas Service app from Surfers Against Sewage."
        },
        {
            "text": "New designations"
        },
        {
            "text": "Last month, following a public consultation, Defra announced four new designated bathing water sites; Sykes Lane Bathing Beach and Whitwell Creek at Rutland Water, Firestone Bay in Plymouth, and a section of the River Deben estuary at Waldringfield, Suffolk."
        },
        {
            "text": "We will be taking samples at these sites throughout the bathing water season to assess water quality and will use this evidence to explore whether action is needed to reduce pollution in order to meet Bathing Water standards."
        },
        {
            "text": "These sites will be classified at the end of the season but it is important to note that designation does not guarantee clean water for swimming. Bringing rivers up to bathing water standards will be a challenge and places greater responsibility on farmers, water companies and communities. We are working hard with all those who want to be part of the solution."
        },
        {
            "text": "Make sure you find out the current water quality of designated bathing sites by visiting our Swimfo site."
        },
        {
            "text": " "
        }
    ]
}