{
    "url": "https://mojdigital.blog.gov.uk/2023/05/15/designing-a-new-career-path/",
    "title": "Designing a new career path",
    "authors": [
        "Leigh Christie",
        "Siddiqah Islam",
        "Kate Weir",
        "Sumiti Hamilton"
    ],
    "categories": [
        "a great place to work",
        "Interaction Designer",
        "Learning at Work Week"
    ],
    "pub_date": "2023-05-15T11:41:42+01:00",
    "content": [
        {
            "text": "We are four early-career designers at the Ministry of Justice (MoJ). We’ve developed a buddy group to support each other, building on the wider support we’ve received from others in the MoJ user-centred design community. We’ll be talking more about the buddy group in the next post in this series. This post will tell you a bit about how we each made our career changes happen and why we love what we do."
        },
        {
            "text": "Leigh Christie - Interaction Designer"
        },
        {
            "text": "I went to university to study English Literature with grand plans of working in publishing—getting paid to read felt like a job that was too good to be true! But after graduation I found myself in data strategy roles, first in the banking sector and then at the Ministry of Justice. "
        },
        {
            "text": "During the pandemic, I decided to design a website for my mum’s business as a project to keep me busy while I was stuck inside. I spent my evenings learning basic html and realised I really enjoyed futzing around with layouts, colours and fonts. It became an activity I looked forward to in the evenings, so I decided to look for learning opportunities where I could expand on these skills through work and I found out about apprenticeships. At first I was nervous about applying, but MoJ apprenticeships are available to everyone, with no age or grade restrictions. I applied and was accepted onto a Software Engineering course."
        },
        {
            "text": "It took 18 months, but I successfully passed my apprenticeship in February 2022. It was often challenging to juggle both my off-the-job learning and my day-to-day work responsibilities, but I am very grateful as it led me to Interaction Design! About halfway through my apprenticeship, I realised that I had a much greater interest in designing user interfaces than full-stack development. With the support of another designer, I began to curate a portfolio of examples of how I’d been using the principles of design in both my work as a Data Strategy Manager and during my apprenticeship. I realised I had many transferable skills that could be applied to an Interaction Designer role. When a secondment opportunity came up for a junior role, I jumped at the chance to apply and here I am now, a year later in a permanent mid-weight role."
        },
        {
            "text": "Siddiqah Islam - Interaction Designer"
        },
        {
            "text": "I joined the Ministry of Justice in Nov 2020 as a junior interaction designer. I wrote a little on how I found my junior role during the pandemic here and now I have recently started my mid-weight designer role, yay! Before MoJ, I worked as a user experience (UX) designer at a startup company. I worked on projects that included designing for an East African remittance company, an e-commerce website and a service that helps young adults find work in Somalia. "
        },
        {
            "text": "I have always had a creative side, studying art and design and product design in secondary school. Through my summer internship at a graphic design company, I became very keen to pursue a career in design, but I had no idea where to start. It was from this experience I came across UX and UI design. I had two years of university left before I started thinking about my career. "
        },
        {
            "text": "I didn’t have the typical design background (and no one I know has either). After finishing my degree in sociology, I knew I had to put the work in and be consistent. I self-studied by finding an ‘intro to UX design’ course, watching videos on the day in life of a UX designer and looking at job specifications and skills needed as well as figuring out how to create a portfolio. It also helped speaking with experienced designers. Finding a startup helped me develop these skills. I felt extremely grateful. During lockdown I improved my UI skills by doing a daily UI challenge to better understand design patterns and components for both desktop and mobile."
        },
        {
            "text": "What would have helped me even more is finding out more about designing for accessibility, how to articulate design decisions and the importance of documenting iterations. These are some of the things I learnt on the job and I’m still working on these skills now. I’m grateful for the steps that I took to become a designer as I love what I do!"
        },
        {
            "text": "Kate Weir - Associate Interaction Designer"
        },
        {
            "text": "My journey to becoming a designer started in prison. I worked in Wormwood Scrubs for almost 3 years, starting as a prison officer on the Unlocked Graduates scheme before moving into managerial roles in Reducing Reoffending. "
        },
        {
            "text": "To drown out the mind-numbing racket of the central line, I filled the long commute to Wormwood Scrubs with podcasts. It was an episode of ‘Your Undivided Attention’, a series considering how we might redesign tech to produce humane outcomes, that kick-started my design thinking. I started to see design problems everywhere, particularly at work where a single task on C-NOMIS, a legacy digital prison tool, could take upwards of 20 minutes. I made notes of the issues I spotted and made little sketches of possible solutions. It felt like having a little hobby at work - I loved it!"
        },
        {
            "text": "A friend picked up on my recent enthusiasm for digital design and suggested looking into User Experience (UX) design. Upon further research, a problem-solving, human-centred  discipline with an element of visual design seemed like the perfect fit. There’s always a problem to solve in prison, and I enjoyed trying to understand prisoners and their needs to help them through their time in prison. I also designed graphics for club nights whilst at uni for fun and extra cash. It was an uncannily good fit!"
        },
        {
            "text": "The problem then was how to get the technical skills I needed to start a career in UX. Every Junior UX job I saw advertised required at least 1 year’s experience or a formal qualification.  I found a start-up willing to give me a short UX internship in my week off after night shifts in the prison, but it wasn’t enough. It seemed the perceived relevance of my prison experience did not extend to UX recruiters. I decided I needed to quit my job and complete a course that, fingers crossed, would kick-start my design career. It all seemed quite risky, not to mention expensive."
        },
        {
            "text": "I was lucky to have a very supportive manager in the prison who was aware of Justice Digital and suggested looking for UX opportunities within MoJ. It made perfect sense- here my prison experience could be an asset and not simply an incongruous chunk on my CV. After some email chains and video calls, it was arranged that I would join Justice Digital on secondment as an Associate Interaction Designer on the Prisoner Content Hub team whilst studying for a diploma in UX design. In the last 7 months I’ve received all the support, training and encouragement I could have dreamed of from my Justice Digital colleagues and the wider design community. It’s a testament to MoJ’s investment in early career designers that I’ve secured promotion to a permanent Junior Interaction Designer role halfway through my secondment. I can’t wait to get solving new problems, and I’m very pleased to be continuing my design journey here at MoJ."
        },
        {
            "text": "Sumiti Hamilton - Associate Interaction Designer"
        },
        {
            "text": "As I grew up in India, I wanted to be an artist. I studied for a degree in applied arts. It was nothing technical, all by hand, and I loved sketching and painting watercolours."
        },
        {
            "text": "I never had the chance to follow my childhood dream. After I finished my education, I had to pay bills so I got my first job as an admin officer. Although it helped pay the bills, it wasn’t the creative role I longed for."
        },
        {
            "text": "When I joined Justice Digital as a business support manager, I was amazed by the agile way of working and user-centred approach. One day I had to work with a designer on a new logo for a podcast series. When I saw the designer at work, my eyes lit up. "
        },
        {
            "text": "When I first began working, I had no digital art experience. I couldn’t afford to pay for courses. At the Ministry of Justice, I could use learning and development time for design training. "
        },
        {
            "text": "I didn’t have a plan and didn’t know where to start. I decided to speak with Jeffrey Allen- one of the design leads in MoJ,  who I have worked with previously. Jeff has years of design experience and took me on board into the design community"
        },
        {
            "text": "Straightaway we set up a plan for me to learn the skills of an interaction designer while working alongside others on one of our teams at the MoJ’. I had Senior Interaction Designer Jen Thompson as my coach and mentor, a plan and a buddy group of 4 mentors always around for support. I am very grateful to Jen,  who dedicated a lot of time to develop me before she went off to have a beautiful baby girl."
        },
        {
            "text": "I completed my 'Become an Interaction designer' course, all funded by the MoJ. "
        },
        {
            "text": "I also only found out when I joined the MoJ that I have dyslexia. Everything started to make sense about why I struggled with complex tasks. This made a big difference. Had I known this sooner, I wouldn’t have doubted myself when it wasn’t my fault at all. "
        },
        {
            "text": "Change can be hard, but it is worth it if you follow your heart. Even as big a change as changing careers."
        },
        {
            "text": "I’ve been lucky to have the support of an understanding and supportive employer. The Ministry of Justice has helped me move into a design career, providing training, space to grow and the support of mentors."
        }
    ]
}