{
    "url": "https://teaching.blog.gov.uk/2023/05/15/embedding-staff-wellbeing-at-the-heart-of-our-school-culture/",
    "title": "Embedding staff wellbeing at the heart of our school culture",
    "authors": [
        "Laura Fordham",
        "Chris Deller",
        "Dave Marsham",
        "Santay Lal"
    ],
    "categories": [
        "Teacher mental health",
        "Teacher wellbeing",
        "Teachers' reflections"
    ],
    "pub_date": "2023-05-15T11:56:23+01:00",
    "content": [
        {
            "text": "In this blog post teachers at Bedford Academy share how they’ve prioritised teacher wellbeing and improved staff retention."
        },
        {
            "text": "How are you managing staff wellbeing?"
        },
        {
            "text": "To manage wellbeing effectively, it can't be an add on, it needs to be part of your school culture."
        },
        {
            "text": "One of my top tips for supporting staff wellbeing is to look at workload – make sure that you cut out anything that's unnecessary. We do regular surveys for staff, on the processes and systems we’re using in school. It's been a massive transformational change, and something now that the team are really used to."
        },
        {
            "text": "We've made changes as a result – such as reviewing and updating our feedback policy, cutting the number of additional tasks we’re asking staff to do and giving them the autonomy to make decisions about things that they think are going to be impactful. This has made a difference to their wellbeing – they feel heard and empowered."
        },
        {
            "text": "Another top tip would be to factor in celebration events, so that you're making time to tell staff how well they're doing and creating a conversation about how things can improve."
        },
        {
            "text": "We're really pleased that the wellbeing strategies we're using have had a massive impact, reducing teacher turnover from 20% to 6% in 3 years. It improves the consistency for students, which makes a big educational impact and supports our learners."
        },
        {
            "text": "Chris Deller, Headteacher at Bedford Academy"
        },
        {
            "text": "How are you using the staff wellbeing charter?"
        },
        {
            "text": "The wellbeing charter is a declaration of our commitment to the wellbeing and mental health of everyone working in our school. It helps us ensure that wellbeing sits at the heart of the academy. Our approach drills down to four main pillars of work:"
        },
        {
            "text": "Laura Fordham, Deputy Headteacher at Bedford Academy"
        },
        {
            "text": "Check out Laura’s longer blog on their wellbeing strategy if you’d like to find out more."
        },
        {
            "text": "How can line managers support staff wellbeing?"
        },
        {
            "text": "Staff wellbeing has a huge role to play within line management because we help shape staff's workload."
        },
        {
            "text": "Workload has an impact on teachers’ job satisfaction, and job satisfaction affects teachers’ performance in the classroom, which ultimately affects the progress of our children."
        },
        {
            "text": "The best way for us to support staff wellbeing through our approach to line management is with transparency, trust and respect. That includes being vocal with our praise for staff, considering their mental health and wellbeing when we make decisions, and being there for them when they need that support. We’ve also got to be open to change and ideas, so that staff at all levels of the academy feel like they’re contributing to wider goals."
        },
        {
            "text": "Dave Marsham, Assistant Director of Achievement for Mathematics at Bedford Academy"
        },
        {
            "text": "How does the Wellbeing Committee work?"
        },
        {
            "text": "The Wellbeing Committee is a group of colleagues from across the school, including teachers, support staff and members of the leadership team who come together to discuss how we think school culture can improve. It gives us a space to share our honest opinion and play a part in making meaningful changes to school life."
        },
        {
            "text": "As well as looking at some of the barriers to wellness, we also plan loads of great activities for staff. My favourite was Ready Steady Cook! Even the Head joined in, and it was a really fun way to unwind."
        },
        {
            "text": "Santay Lal, Support Staff at Bedford Academy"
        },
        {
            "text": "Find out more about the staff wellbeing charter"
        },
        {
            "text": "The education staff wellbeing charter is a declaration of support for, and a set of commitments, to the wellbeing and mental health of everyone working in education"
        },
        {
            "text": "Take a look at the staff wellbeing charter."
        },
        {
            "text": "Want to receive blog posts in your inbox\nSign up to receive blog updates"
        }
    ]
}