{
    "url": "https://socialcareinspection.blog.gov.uk/2023/05/15/foster-care-fortnight-2023/",
    "title": "Foster Care Fortnight 2023",
    "authors": [
        "Yvette Stanley"
    ],
    "categories": [
        "children looked after",
        "Foster Care Fortnight",
        "fostering",
        "looked after children",
        "multi-agency",
        "partnership working",
        "social care professionals"
    ],
    "pub_date": "2023-05-15T12:05:27+01:00",
    "content": [
        {
            "text": "As we begin another Foster Care Fortnight, I want to again offer our rightful appreciation to the people providing incredible yet often unremarked-on foster care to tens of thousands of children every year."
        },
        {
            "text": "Fostering a child is an incredibly generous and selfless thing to do even in the best of circumstances. But in the tough context we currently live in, it is a remarkable act."
        },
        {
            "text": "The love, personal sacrifice and tenacity that so many foster carers exhibit every day, without expectation of recognition or reward, makes a huge difference. It makes a huge difference to the children they care for, and to the communities they live in."
        },
        {
            "text": "#FosteringCommunities"
        },
        {
            "text": "This year’s theme for the fortnight of #FosteringCommunities is well chosen. It recognises how foster care can help children to stay in their communities, with all of the benefits that brings. It recognises that, in fostering a child, carers are enriching and aiding their community. And it recognises that everyone involved in foster care is part of that wider fostering community."
        },
        {
            "text": "It's a community I’m proud to be a part of. When I was a director of children’s services (DCS), one thing I particularly loved were our annual foster carers celebrations, where we welcomed new arrivals, marked long service or celebrated wider successes. I was – and am – in constant awe of the people I met, and continue to meet through Ofsted. Creating the nurturing environment where children can thrive is not something that is easy to weigh or measure but whatever the essential ingredient is, foster carers have it in buckets."
        },
        {
            "text": "Making the difference"
        },
        {
            "text": "At this time of year, I am always fondly reminded of the foster carers I’ve met and some of the children whose stories will stay with me forever."
        },
        {
            "text": "I remember the foster carer who took up fishing to be able to spend time with his teenager – which was an important as it was the young lad’s connection and positive memories from time with his grandad."
        },
        {
            "text": "I remember the fostering family who maintained regular contact with a teenage boy who was in their care briefly, but who needed many months of in-patient mental health care. The support of the foster carers and his ‘foster-siblings’ was fundamental to his own belief in his long road to recovery."
        },
        {
            "text": "I remember two foster care families organising a joint trip to Butlins so that the siblings could holiday together."
        },
        {
            "text": "I remember foster carers’ kindness to birth parents as they struggled through diminishing contact and respite carers supporting birth parents through their child’s end of life care."
        },
        {
            "text": "I recall sitting with proud foster parents celebrating success events at school, or hearing about their celebrating exam results, getting a new belt in karate, making successful contact with a sibling, university admission, passing their driving test or getting a Saturday job. The important events in the child’s journey stay with us as well as the sad times we have to support them through."
        },
        {
            "text": "Seeing the difference"
        },
        {
            "text": "These are just a few of the stories that stick with me. But my colleagues and I at Ofsted see so many more every time we visit local areas for our inspections. They are often contributions that cannot be captured in a league table or performance data but we do see them in abundance. We hear of it from children, social workers, Independent Reviewing Officers and from rightly proud DCSs and their teams."
        },
        {
            "text": "When our inspectors come back with tales of delight, we take delight in those positive outcomes. We feel a sense of professional pride in being able to report good work – work founded on love and kindness and with enduring conspicuous care and ambition, for children who absolutely deserve the very best from us."
        }
    ]
}