{
    "url": "https://aphascience.blog.gov.uk/2023/05/15/invasive-species-the-silent-threat/",
    "title": "Invasive species: the silent threat to our ecosystems",
    "authors": [
        "Lucy Cornwell",
        "Jenny Stewart"
    ],
    "categories": [
        "Plant health"
    ],
    "pub_date": "2023-05-15T13:07:31+01:00",
    "content": [
        {
            "text": "Invasive non-native species (INNS) are one of the top five threats to global biodiversity, costing the economy nearly £1.9 billion a year, and can even harm our health. Once established, they can be extremely costly and difficult to control."
        },
        {
            "heading": 3,
            "text": "What are invasive non-native species?"
        },
        {
            "text": "Over 2,000 plants and animals have been introduced to Britain from all over the world by people. These are known as non-native species. Most are harmless but around 10-15% spread and become invasive non-native species, which impact the environment, economy or our health and way of life."
        },
        {
            "text": "To reduce the future impact of INNS we need to prevent more species from being introduced and becoming established, which is part of the role of our Borders and Trade teams. As part of Invasive Species Week APHA Director of Science Transformation, Jenny Stewart and Lucy Cornwell from the GB Non-native Species Secretariat are sharing some of the ways that everyone can help."
        },
        {
            "heading": 3,
            "text": "Gardening to support wildlife and prevent the spread of invasive non-native plants"
        },
        {
            "heading": 3,
            "text": "Recording ‘alert’ species"
        },
        {
            "text": " "
        },
        {
            "heading": 3,
            "text": "Invasive Species Week"
        },
        {
            "text": "Find out more about Invasive Species Week and how you can help to prevent the spread of invasive non-native species:"
        },
        {
            "text": " "
        }
    ]
}