{
    "url": "https://dwpdigital.blog.gov.uk/2023/05/15/learn-while-you-earn-through-a-dwp-digital-apprenticeship/",
    "title": "Learn while you earn through a DWP Digital apprenticeship",
    "authors": [
        "Sophie Marrs, DWP Digital Apprentice"
    ],
    "categories": [
        "Apprenticeships",
        "Digital DWP jobs",
        "Learning & Development",
        "Learning at Work",
        "Women in Digital"
    ],
    "pub_date": "2023-05-15T10:14:37+01:00",
    "content": [
        {
            "heading": 2,
            "text": "Sophie’s story "
        },
        {
            "text": "Sophie is an associate portfolio manager apprentice working in the Chief Operating Office. To celebrate the start of Learning at Work Week, we sat down with Sophie to hear how she learns while she earns through our apprenticeship programme.  "
        },
        {
            "text": "She joined DWP Digital in March of this year after having previously completed an apprenticeship outside of the Civil Service.  "
        },
        {
            "heading": 2,
            "text": "Strong support networks "
        },
        {
            "text": "I have a designated learning coach who I have quarterly reviews with, and they’re always available if I need any support or guidance on my apprenticeship work.  "
        },
        {
            "text": "I also have my apprenticeship line manager who I have monthly one-to-ones with and is always available for support or guidance, whether it be on apprenticeship work or work outside of my apprenticeship. Outside of my appointed support, my colleagues have also been really supportive and are always happy to answer any questions I may have. "
        },
        {
            "heading": 2,
            "text": "Learning while I am earning "
        },
        {
            "text": "I’m working towards a Level 4 Associate Project Manager qualification as part of my apprenticeship. My apprenticeship schedule is 4 days working and 1 day studying a week. The study days mainly consist of independent learning of a topic and completing a module on that topic. Each module has advised completion times so modules can take 1 learning day or can span over multiple.  "
        },
        {
            "text": "Once a month, my study day includes a live event hosted online. During the live event, we cover a module as a class through reading and interactive group activities which we then answer exam style questions on. My most recent live event focused on ‘principles of project management’ which I found very valuable and I could apply this right away to my role.  "
        },
        {
            "heading": 2,
            "text": "A unique and valuable experience  "
        },
        {
            "text": "The best thing about my apprenticeship at DWP Digital is the opportunity it has given me to develop knowledge and gain confidence in a field I have had no prior experience in. The structure of my apprenticeship means I will move between 5 departments over an 18-month period. This will give me valuable experience across a range of departments that I’ll be able to apply once my apprenticeship is over. "
        },
        {
            "text": "The apprenticeship gives you great knowledge in your field, but DWP Digital offers so many amazing learning courses on such a wide range of subjects that I would advise anyone (apprentice or not) to take full advantage of these opportunities.  "
        },
        {
            "heading": 2,
            "text": "My advice is just go for it  "
        },
        {
            "text": "My main piece of advice would be just go for it! I find people often think ‘but it’s 18 months as an apprentice’. "
        },
        {
            "text": "But the question for me is, in 18 months-time would you rather be qualified with experience in your career path or still be thinking should I have gone for the opportunity?  "
        },
        {
            "text": "An apprenticeship is hard work and requires you to be self-motivated but the positives to an apprenticeship always outweigh the negatives. "
        }
    ]
}