{
    "url": "https://prisonjobs.blog.gov.uk/2023/05/15/whats-it-really-like-working-as-a-prison-officer/",
    "title": "What’s it really like working as a prison officer?",
    "authors": [
        "Ministry of Justice"
    ],
    "categories": [
        "Prison officer"
    ],
    "pub_date": "2023-05-15T17:41:54+01:00",
    "content": [
        {
            "text": "Thinking of applying to be a prison officer, but not sure if it’s for you? Our interactive online activity will give you more of an insight into the role."
        },
        {
            "text": "What's it like working as a prison officer?\nWorking as a prison officer can be a rewarding, yet sometimes challenging career. Prison officers do an incredibly important job in an environment like no other. But we know it's not easy to get a sense of how you’d feel working in a prison before starting a job application."
        },
        {
            "text": "Our interactive online activity will give you an insight into some of the situations prison officers may experience in their day-to-day work."
        },
        {
            "text": "Featuring real prison officers and ex-offender actors, 8 short videos cover a range of scenarios such as:"
        },
        {
            "text": "Helping you decide if the role is for you\nAfter each video, you’ll be given a multiple-choice question to answer about how you’d feel in that particular situation."
        },
        {
            "text": "At the end, you’ll receive feedback on how closely the prison officer role is suited to you, or if you need to do some more research into the career.\n\nFind out more\nThe online activity isn’t part of our assessment and recruitment process, but it might help you get more of a sense of whether the role is for you or not before you take the first important step and start your application. You’ll find lots more useful information about working as a prison officer on our website."
        },
        {
            "text": "If working as a prison officer isn’t right for you, you might want to explore other jobs in the Prison and Probation Service. "
        }
    ]
}