{
    "url": "https://defrafarming.blog.gov.uk/2023/08/02/further-innovation-grants-coming-soon/",
    "title": "Further innovation grants coming soon ",
    "authors": [
        "Joss Wallace"
    ],
    "categories": [
        "Payments for research and innovation"
    ],
    "pub_date": "2023-08-02T12:01:40+01:00",
    "content": [
        {
            "text": "This month, we will open another round of the Small R&D Partnership Projects competition and, in September, another round of the Feasibility Studies competition will follow.   "
        },
        {
            "text": "Both competitions, representing a total of over £14 million funding, are designed to encourage collaboration between farmers, growers and foresters with agri-businesses and researchers.  "
        },
        {
            "text": "The funding will help to unlock innovation, boost productivity, sustainability and meet our net zero aims.  "
        },
        {
            "text": "In this post, I’ll give you a brief overview of the competitions."
        },
        {
            "text": " I'll also include links to guidance, share details of upcoming webinars and include dates to note. "
        },
        {
            "heading": 2,
            "text": "Small R&D Partnerships Projects "
        },
        {
            "text": "A share of £9.8 million will be available through this competition.  "
        },
        {
            "text": "This competition is designed to support projects that are further along in their research and development journey than the Feasibility Studies below.  "
        },
        {
            "text": "Grants offered through this competition are designed to help businesses develop a new farming product or service and take it towards commercialisation. It can be used to develop a solution once it works in practice.     "
        },
        {
            "text": "The total cost of the project must be between £1 million and £3 million and last up to 36 months.  "
        },
        {
            "text": "Successful projects in the previous 2 rounds include:  "
        },
        {
            "text": "Read the Small R&D Partnerships Projects competition guidance. "
        },
        {
            "heading": 3,
            "text": "Dates to note"
        },
        {
            "text": "14 August: Competition opens "
        },
        {
            "text": "14 August: Webinar - Q&A and consortium building event  "
        },
        {
            "text": "25 October: Competition closes "
        },
        {
            "heading": 2,
            "text": "Feasibility Studies "
        },
        {
            "text": "A share of £4.5 million will be available through this competition.  "
        },
        {
            "text": "For this competition, projects should be at the early stage of their research and development (R&D) journey.  "
        },
        {
            "text": "The grant supports projects through the difficult testing phase to see whether a research idea works in practice and if it is worth further investment.   "
        },
        {
            "text": "The total cost of the project must be between £200,000 and £500,000 and last up to 24 months.  "
        },
        {
            "text": "Successful projects from the previous 2 rounds include:  "
        },
        {
            "text": "Read the Feasibility Studies competition guidance.  "
        },
        {
            "heading": 3,
            "text": "Dates to note  "
        },
        {
            "text": "18 September: Competition opens  "
        },
        {
            "text": "20 September: Webinar - Q&A and consortium building event  "
        },
        {
            "text": "15 November: Competition closes   "
        },
        {
            "heading": 2,
            "text": "Learn more "
        },
        {
            "text": "Together with our partner (UK Research and Innovation) UKRI, it will be the third time we’ve run the competitions which are part of the £270 million Farming Innovation Programme.   "
        },
        {
            "text": "In total, £123 million has been announced so far for industry-led research and development through the Farming Innovation Programme.  As highlighted at the UK Farm to Fork Summit, our future food security and farming sector will be more productive and resilient thanks to British science and innovation."
        },
        {
            "text": "If you have any questions about the Programme, leave a comment below. If you have questions about the competitions, please join one of the webinars linked above."
        },
        {
            "text": "We'll blog again when the competitions open, so subscribe to the Farming blog. Whenever a post is published, you'll get an email."
        }
    ]
}