{
    "url": "https://governmentscienceandengineering.blog.gov.uk/2023/08/02/stem-futures-partner-forum/",
    "title": "STEM Futures Partner Forum",
    "authors": [
        "Sarah Hess"
    ],
    "categories": [
        "Blog Series",
        "Guest Blog",
        "Interchange"
    ],
    "pub_date": "2023-08-02T15:35:25+01:00",
    "content": [
        {
            "text": "STEM Futures is a knowledge exchange scheme which brings together cross-sector partners to develop science skills capability. The Government Science and Engineering Profession have been working to refresh the scheme since taking over its ownership last year.  "
        },
        {
            "text": "In July, we held our first Partner Forum, bringing together our partner organisations to review progress and make plans for the coming year. An overview from our Technical Hubs provided insight into the range of placements and training opportunities being delivered across communities of interest. These being centred around data, reliability and Weapons, Ordnances, Munitions, and Explosives (WOME). New communities of interest are also in development stage, focused on systems thinking and nuclear. Over the next year, we will continue to consolidate and develop the opportunities offered through our communities.  "
        },
        {
            "text": "The Forum also provided an opportunity to reflect on our strategic drivers to ensure we are equipped to deliver increased skills capability. We are excited to explore ways to engage with cross-cutting thematic priorities, such as sustainability, and to develop further mechanisms to support secondments across partner organisations. We look forward to continuing to welcome new organisations to the partnership, drawing together diverse voices to develop innovative knowledge exchange opportunities.  "
        },
        {
            "text": "If you’d like to know more about STEM Futures, you can visit our website or email STEMFutures@gov.science.uk.  "
        }
    ]
}