{
    "url": "https://dfedigital.blog.gov.uk/2022/01/18/design-open-sessions/",
    "title": "Being open about our design community and how we recruit",
    "authors": [
        "Jaskiran Kang, Head of Design"
    ],
    "categories": [
        "Careers",
        "community of practice",
        "design",
        "recruitment"
    ],
    "pub_date": "2022-01-18T15:55:10+00:00",
    "content": [
        {
            "text": "Now more than ever, there are lots of great opportunities to make a difference in a digital or technology role as a member of a community of practice."
        },
        {
            "text": "We're looking for people with the right skills and approach who want to grow and develop. And we are looking for people from a range of backgrounds."
        },
        {
            "heading": 2,
            "text": "What is an open session?"
        },
        {
            "text": "To encourage people to apply for our design roles, we ran our first design open sessions."
        },
        {
            "text": "These were open to everyone – people of all genders, ages, sexual orientations, nationalities, religions, and beliefs."
        },
        {
            "text": "It was an online meet and greet with DfE designers who showed their work and talked about our culture and ways of working."
        },
        {
            "text": "But it wasn’t just about us selling ourselves. We took our guests through the many benefits of working within the Civil Service, and we explained how the application process works."
        },
        {
            "text": "Our guests could ask us anything they wanted, to see if the DfE's design community is the right fit for them."
        },
        {
            "text": "It was also a chance for them to ask for feedback on their portfolios."
        },
        {
            "heading": 2,
            "text": "A format that suits introverts too"
        },
        {
            "text": "Open days are often face to face, and we weren’t 100% sure if doing this online would work. It turns out the online format was more personal, focused, and suited introverts."
        },
        {
            "text": "No one needed to have their camera on or speak, if they didn’t want to."
        },
        {
            "text": "We used Slido for questions. It was our guests’ chance to ask any of the awkward questions they may not dare to ask at an interview."
        },
        {
            "heading": 2,
            "text": "Demystifying the Civil Service"
        },
        {
            "text": "By supporting potential job applicants we can set them up for success."
        },
        {
            "text": "The Civil Service recruitment process differs from other sectors and we explained why this was and what to expect."
        },
        {
            "text": "We shed light on how the Civil Service pay grades and salary structure map across to those in other sectors. We explained that it's ok to use notes in your interview – if candidates feel comfortable, they are more likely to shine. And the reason we ask probing follow-up questions to your answers, is to get the best out of people."
        },
        {
            "heading": 2,
            "text": "Designers' personal insights"
        },
        {
            "text": "Four of our designers shared some fascinating insight into their work as members of the DfE design community."
        },
        {
            "text": "Designer, Chris Hewison, shared 6 things he’s learned from working in government:"
        },
        {
            "heading": 2,
            "text": "Striking the right chord with our guests"
        },
        {
            "text": "The words most commonly used in the feedback from our guests were:"
        },
        {
            "text": "Being transparent and open is one of the UK government’s design principles so we were delighted that this came across loud and clear."
        },
        {
            "text": "Our job descriptions are now on github. Anyone can contribute to these to make them more relevant to designers in different sectors."
        },
        {
            "text": "Here's some feedback from our guests about these sessions, and their impressions of our design community."
        },
        {
            "heading": 2,
            "text": "We're hiring"
        },
        {
            "text": "We're advertising for designers now. Find out more and how to apply."
        },
        {
            "text": "Also, look out for #ServicesWeek. Our designers will be taking part in this cross-government event, showcasing their work and culture."
        },
        {
            "text": "We’ll be blogging more about our design community’s main strands of work (we call these our design imperatives) very soon."
        },
        {
            "heading": 2,
            "text": "Get in touch"
        },
        {
            "text": "If you’d like to ask a question about how we work, the services we design, our culture, or applying for future roles, please get in touch on Twitter or through Linkedin."
        },
        {
            "text": "The DfE Digital and Technology community team hope to run open sessions for our other professional communities this year."
        }
    ]
}