{
    "url": "https://civilservice.blog.gov.uk/2022/01/18/from-serving-customers-to-serving-the-community/",
    "title": "From serving customers to serving the community",
    "authors": [
        "Jay Ali"
    ],
    "categories": [
        "A Modern Civil Service",
        "A Skilled Civil Service",
        "An Ambitious Civil Service",
        "Better policymaking"
    ],
    "pub_date": "2022-01-18T09:07:03+00:00",
    "content": [
        {
            "heading": 3,
            "text": "I knew nothing about the probation service I was joining. I was merely Joe Public from a privileged existence. “What does ‘the social’ mean?” I asked colleagues who looked at me in disbelief. "
        },
        {
            "text": "Sixteen years ago, I began my employment with the then Thames Valley Probation Service, in a split role as a Court Duty and Probation Service Officer. "
        },
        {
            "text": "Prior to joining, I’d been working in a bustling restaurant, enjoying myself alongside great colleagues in physically demanding work, serving food and drinks. "
        },
        {
            "text": "Finding the right career after university, as a graduate with no experience, was much tougher than I imagined. Much as I loved the buzz of busy service, I'd always leave each shift with an empty feeling. I yearned to find a direction and a fulfilling career as I had more to give. I set my heart on pursuing a career in the legal profession, yet it simply didn’t bring me joy.\n\nThankfully, my friend Emma knew of a vacancy and called me, suggesting I apply to work for the Probation Service. I completed the application despite lacking any background knowledge (other than one conversation) and weeks later, was invited to an interview. "
        },
        {
            "text": "Wonderful feeling"
        },
        {
            "text": "As I sat in Starbucks hours later, I got a welcome call saying I was successful. What a wonderful feeling - my caramel latte never tasted better!\n\nAs a member of the public, who hadn’t carried out my own due diligence, I knew nothing about the service I was joining. I was Joe Public from a privileged existence. "
        },
        {
            "text": "“What's ‘the social’?” I asked colleagues, oblivious to the phrase that commonly refers to claimants on job benefits. I believed in a ‘get tough on crime’ and ‘lock ‘em up’ approach. It took only one week to change my outlook, transitioning from private citizen to public servant."
        },
        {
            "text": "Struggling with demons"
        },
        {
            "text": "I felt distraught at the thought of an offender leaving court with nowhere to live, and yet no entitlement to public funds, exacerbated by a long-standing alcohol addiction. It was freezing. He was a lovely guy struggling with demons, and we had a good conversation about his journey. I felt awful for him and wanted to offer up my spare room."
        },
        {
            "text": "Mental safety blanket"
        },
        {
            "text": "Returning to the office, my colleagues placed a mental safety blanket around me, talking me through my conflict. I said, “These people need help,” (like I was the first person to have noticed this injustice, despite my peers working in the service for decades). "
        },
        {
            "text": "“No wonder they’re where they are,” I said. From that point, after only one week, I was indoctrinated into the age-old probation values of ‘advise, assist and befriend.’"
        },
        {
            "text": "Young cocky upstart"
        },
        {
            "text": "In joining Probation, I discovered my natural habitat. As a young man with no positive role models and a lack of parental guidance, my colleagues became my role models. Sylvia Kent was particularly influential (she asked for full credit) and became a surrogate mum who regularly put this young cocky upstart in my place. "
        },
        {
            "text": "Sylvia and my colleagues got me thinking beyond my somewhat narrow life view. My team challenged me to reflect and consider more nuanced alternatives, and look  beyond my knee-jerk ego. And although I’d always cared and looked after people I valued in a personal capacity, this role was what made that naturally extend to my professional life.\n"
        },
        {
            "text": "Visionary leaders"
        },
        {
            "text": "Sixteen years later, Probation is still my work ‘home.’ A job that doesn’t feel like work, people on probation, probation practitioners, colleagues across the board and conversations with them all are the most wonderful thing. All are inspirational managers, committed staff and visionary leaders.\n\nAs a GCSE English student, I remember exploring the concept of vocation and avocation after reading Robert Frost. I always wondered with heavy expectation whether I’d find a job that provided both - a passion, a hobby and livelihood. Well, it did, it does - and I’m still here."
        },
        {
            "text": "Absolutely committed"
        },
        {
            "text": "So what now? I am absolutely committed to HMPPS more than ever. The Civil Service has encouraged me to pursue a variety of career opportunities through experience and academic study. I recently completed the HMPPS Senior Leadership Programme and am currently studying a Senior Leaders MBA with Coventry University. "
        },
        {
            "text": "I’m also involved with the Race Action Programme, working on the ‘progression buddies’ workstream. My aim is to help attract more recruits like myself from diverse backgrounds and working class neighbourhoods, similar to where I grew up."
        },
        {
            "text": "Eclectic mix"
        },
        {
            "text": "If I could help attract the same eclectic mix of backgrounds in my social circle, to the offices I work in, and embody a skilled, ambitious and modern Civil Service, well, what an extraordinary prospect! "
        },
        {
            "text": "That leaves the defining challenge of my career - the ‘dinner party test’: how to convey to a stranger what the Probation Service does in under one minute. I shall forever strive to ensure we become a household name for the right reasons."
        }
    ]
}