{
    "url": "https://educationhub.blog.gov.uk/2022/01/how-we-are-calling-on-universities-to-end-the-use-of-non-disclosure-agreements-ndas-to-silence-abuse-victims/",
    "title": "How we are calling on universities to end the use of Non-Disclosure Agreements (NDAs) to silence abuse victims",
    "authors": [
        "media officer"
    ],
    "categories": [
        "Students",
        "Universities"
    ],
    "pub_date": "2022-01-18T16:30:55+00:00",
    "content": [
        {
            "text": "Victims of sexual harassment in universities should never be silenced by Non-Disclosure Agreements (NDAs), under a new pledge announced today backed by the government, universities, and campaigners."
        },
        {
            "text": "Here’s everything you need to know about our announcement on NDAs."
        },
        {
            "heading": 3,
            "text": "What have you announced? "
        },
        {
            "text": "A number of university vice-chancellors have signed up to a pledge promising not to use NDAs in dealing with complaints of sexual misconduct, bullying, and other forms of harassment."
        },
        {
            "text": "The pledge, backed by campaign groups, commits universities to not use legally binding NDAs against students and staff who come forward to report abuse, amid fears victims are being pressured into signing agreements which stop them from speaking out in order to protect the reputations of universities."
        },
        {
            "heading": 3,
            "text": "What exactly are NDAs?"
        },
        {
            "text": "An NDA is a legally binding contract under which the parties agree that certain information will not be made available to others. But an NDA might wrongly suggest that a person does not have rights, such as whistleblowing or taking a matter to a court or tribunal; or that they cannot discuss the issue with people such as the police, a doctor or a therapist."
        },
        {
            "heading": 3,
            "text": "Why have you made these changes? "
        },
        {
            "text": "Sexual harassment is horrendous, and victims should never be bought or bullied into silence to protect the reputation of their university."
        },
        {
            "text": "A BBC inquiry published in February 2020 found nearly a third of universities have used NDAs in the resolution of student grievances since 2016."
        },
        {
            "text": "Over 300 NDAs were used by universities to resolve student complaints between 2016 and 2020."
        },
        {
            "text": "It is expected that the true scale of their use is likely to be greater, as the BBC investigation focused only on universities and not on all HE providers registered with the Office for Students, the regulator in England."
        },
        {
            "heading": 3,
            "text": "Who else is involved in this pledge? "
        },
        {
            "text": "The pledge has been welcomed by #Can’tBuyMySilence, a global campaign set up by former Harvey Weinstein aide Zelda Perkins and Canadian law professor Julie McFarlane, which aims to end the harmful use of NDAs.  Both Perkins and McFarlane attended the virtual launch of the pledge on Tuesday, alongside Ministers and university leaders, to show their support."
        },
        {
            "heading": 3,
            "text": "Which universities are already on board?"
        },
        {
            "text": "Goldsmiths and the Universities of Exeter, Cambridge and Buckinghamshire are among those pledging not to use NDAs in cases of sexual misconduct, bullying or other forms of harassment."
        },
        {
            "text": "Universities Minister Michelle Donelan will be urging more vice-chancellors to sign the pledge, with universities that sign up to be listed on #Can’tBuyMySilence’s website."
        },
        {
            "text": "A number of universities had already signalled plans to end the use of NDAs in sexual harassment cases, with UCL confirming in 2019 that it would end the practice in any settlement agreements with individuals who complained of sexual misconduct, harassment or bullying."
        }
    ]
}