{
    "url": "https://educationhub.blog.gov.uk/2022/01/i-have-a-vision-of-an-education-system-in-which-every-child-has-the-chance-to-make-the-most-of-their-abilities-and-become-the-best-version-of-themselves/",
    "title": "\"I have a vision of an education system in which every child has the chance to make the most of their abilities and become the best version of themselves\"",
    "authors": [
        "Media Officer"
    ],
    "categories": [
        "Apprenticeships",
        "Exams and qualifications",
        "Further education",
        "Higher Education",
        "Schools",
        "Universities"
    ],
    "pub_date": "2022-01-18T10:44:24+00:00",
    "content": [
        {
            "text": "Education Secretary Nadhim Zahawi has set out his vision to build an education system that gives every child, regardless of their background, the best start in life. Here, he sets out in detail how his own experiences will help him do this. "
        },
        {
            "text": "It was the greatest honour of my career when the Prime Minister gave me the huge privilege of the best brief in Government: running the Department for Education."
        },
        {
            "text": "In my previous role as vaccines minister, overseeing one of the fastest roll outs in Europe, I learnt so much that I am bringing to this position. One is to focus on delivery on the ground and delivering on the priorities that matter to people. Another was that evidence and data are a crucial ally."
        },
        {
            "text": "Now, as we move from pandemic to endemic, we have done our utmost to ensure schools remain open for face-to-face learning."
        },
        {
            "text": "I am so grateful to the amazing teachers and support staff who are keeping the doors of our schools open, despite the challenges that Omicron has posed."
        },
        {
            "text": "Our schools will stay open, and exams will go ahead this summer as planned."
        },
        {
            "text": "But to move beyond the pandemic, I have a vision of an education system in which every child has the chance to make the most of their abilities and become the best version of themselves."
        },
        {
            "text": "As we enter a new decade of reform, we should remember there is already so much to be proud of. I know this better than most, having come to the UK as an 11-year-old Kurdish boy without a word of English."
        },
        {
            "text": "My loving parents and inspiring teachers, such as Miss M’barak back in Iraq and countless others in London, helped me achieve entry to a top university, set up my own company and now represent Shakespeare’s hometown as its Member of Parliament."
        },
        {
            "text": "Driven by my mantra of putting skills, schools and families first, I have a duty to help others on their journey."
        },
        {
            "text": "Upskilling is how we are going to help the economy grow and ensure Britain continues to be a global force in the 21st century."
        },
        {
            "text": "Employers will have access to the talent they need to thrive and our economy to recover from the pandemic, while people will get the training that leads to a great job and a fulfilling career."
        },
        {
            "text": "Involving business in this process will save taxpayers money, help us be more flexible and far more agile in an everchanging world."
        },
        {
            "text": "That is why we are scaling up the roll out of our new T levels, the top-quality technical qualifications for 16-year-olds that will soon be just as famous as A levels, and apprenticeships to flood Britain with amazingly capable young people."
        },
        {
            "text": "Schools are already seeing the benefits of the reforms of my predecessors: 86% of children are now in a good or outstanding school, up from just 68% in 2010."
        },
        {
            "text": "We will build on this by driving forward the Prime Minister’s ambition for school reform, achieving world-class literacy and numeracy in every corner of the country."
        },
        {
            "text": "We will also deliver much more of the kind of excellence you see in our new generation of academies, scaled up across the country so that more children thrive."
        },
        {
            "text": "I will soon be publishing my plans to further ensure that every child can be the author of their own life story."
        },
        {
            "text": "I will be relentless in using the amazing people in schools to drive up standards, behaviour and the pleasure of educating young minds."
        },
        {
            "text": "As a former Children and Families Minister, and as a father to a nine-year-old girl, as well as two grown up boys, I care passionately about giving every child a great start in life."
        },
        {
            "text": "Our families are the most important thing to all of us and I am determined to give them the support they need when they need it, so we are expanding our investment in local family help services and improving childcare provision and early education."
        },
        {
            "text": "There is nothing more worthwhile than realising an individual’s potential, whether that is through our work on skills, schools or families."
        },
        {
            "text": "This country gave me everything and thanks to my early experiences, I never lose sight of why I am doing this job. I am doing it for all those other lost 11-year-olds. Who knows what they could be given the right start in life – the possibilities are endless."
        },
        {
            "text": "The Prime Minister has given me a clear instruction to make education a clear part of the levelling up agenda in the second half of this parliament."
        },
        {
            "text": "We are working together tirelessly to make this happen and transform the lives of the next generation in the process."
        },
        {
            "text": "We will not rest until we have achieved our goal."
        }
    ]
}