{
    "url": "https://food.blog.gov.uk/2022/01/18/join-our-scientific-advisory-committees/",
    "title": "Join our Scientific Advisory Committees",
    "authors": [
        "Azhar Kabli and Bethan Davies: Science, Evidence and Research Division, FSA"
    ],
    "categories": [
        "Our mission",
        "Science"
    ],
    "pub_date": "2022-01-18T15:32:22+00:00",
    "content": [
        {
            "text": "Cymraeg"
        },
        {
            "text": "We have an exciting opportunity for more members to join our Scientific Advisory Committees. "
        },
        {
            "text": "Our Scientific Advisory Committees (SACs) gather scientific information and evaluate its relevance. This is to make sure that our advice is based on the best and most recent scientific evidence."
        },
        {
            "text": "Now that the UK has left the EU, there is a big increase in the science demanded by and from the FSA. We rely on the views of the many independent experts who serve on our network of Scientific Advisory Committees to help us analyse the many different aspects of food safety we must consider so that consumers will have food they can trust."
        },
        {
            "heading": 2,
            "text": "The role of Scientific Advisory Committee members"
        },
        {
            "text": "Membership of SACs includes a wide range of eminent and experienced scientists, practitioners, medics and academics, as well as consumer representatives. With their in-depth knowledge, they can give us assurance that we’re using the right science, drawn from the right sources, and are looking in detail at the scientific questions put to us."
        },
        {
            "text": "These committees have advised us on everything from assessing the toxicological evidence for the safety of CBD (cannabidiol) to looking at new evidence to support updating our advice on runny eggs to vulnerable groups."
        },
        {
            "text": "We spoke to a couple of our current members to find out more about their experiences of being on one of our Scientific Advisory Committees:"
        },
        {
            "text": "Jane Case is a solicitor and a lay member on the Committee for Toxicity (COT). She is one of two lay members on COT who represent the public by looking at things from the perspective of an ordinary person. Jane’s experience of having a child with food allergies inspired her to apply to be part of COT:"
        },
        {
            "text": "She added:"
        },
        {
            "text": "One of those expert scientists is Dr Gauri Godbole, a consultant medical microbiologist and parasitologist at the UK Health Security Agency (UKHSA). Her expertise is in whole-genome sequencing (used to track foodborne illness) and anti-microbial resistance (the resistance to drugs that treat the infections caused by microbes such as virus)."
        },
        {
            "text": "She has been a member of the Advisory Committee on the Microbiological Safety of Food (ACMSF) since 2018. She says the work of the committee is ‘challenging but exciting’, as the work of the ACMSF includes complex risk assessments."
        },
        {
            "text": "Gauri likes working with individuals with various different expert backgrounds, from the veterinary sector and the food sector, and would like to see the committees continue to grow. \"I would definitely encourage members from diverse backgrounds and scientific backgrounds to apply to this expert group.\""
        },
        {
            "text": "Jane agrees: \"Go ahead and apply! It is endlessly fascinating, challenging and thought-provoking and at the same time you are giving something back. Everyone listens to everyone else, and the debates and discussions are so interesting.\""
        },
        {
            "heading": 2,
            "text": "Apply to join a Scientific Advisory Committee"
        },
        {
            "text": "Apply now to join our Scientific Advisory Committees or the Science Council. The deadline to apply is Sunday 13 February 2022."
        },
        {
            "text": "To learn more about each SAC, see the work they do and read what's happened in previous meetings, please head to our Scientific Advisory Committees hub."
        },
        {
            "text": "We are also recruiting new members to our Science Council. The Science Council provides our Chair, Chief Executive and Chief Scientific Adviser with high-level, expert strategic insight, challenge and advice on the use of science to deliver our objectives. Details on how to apply are available on our website. The deadline for applications to the Science Council is midnight on Sunday 30 January 2022."
        },
        {
            "text": "Our Scientific Advisory Committees are:"
        },
        {
            "heading": 2,
            "text": "Ymunwch â’n Pwyllgorau Cynghori Gwyddonol"
        },
        {
            "text": "Mae gennym ni gyfle cyffrous i ragor o aelodau ymuno â’n Pwyllgorau Cynghori Gwyddonol. "
        },
        {
            "text": "Mae ein Pwyllgorau Cynghori Gwyddonol, neu ‘SACs’, yn casglu gwybodaeth wyddonol ac yn gwerthuso ei pherthnasedd. Mae hyn er mwyn sicrhau bod ein cyngor yn seiliedig ar y dystiolaeth wyddonol orau a mwyaf diweddar."
        },
        {
            "text": "Nawr bod y Deyrnas Unedig (DU) wedi ymadael â’r Undeb Ewropeaidd (UE), mae cynnydd mawr o ran angen gwyddoniaeth ar yr ASB a chanddi. Rydym ni’n dibynnu ar farn y llu o arbenigwyr annibynnol sy’n gwasanaethu ar ein rhwydwaith o Bwyllgorau Cynghori Gwyddonol i’n helpu i ddadansoddi’r nifer o wahanol agweddau ar ddiogelwch bwyd y mae’n rhaid i ni eu hystyried fel y bydd gan ddefnyddwyr fwyd y gallant ymddiried ynddo."
        },
        {
            "heading": 2,
            "text": "Rôl aelodau’r pwyllgor"
        },
        {
            "text": "Mae aelodaeth o’r pwyllgorau hyn yn cynnwys ystod eang o wyddonwyr, ymarferwyr, meddygon ac academyddion amlwg a phrofiadol, yn ogystal â chynrychiolwyr defnyddwyr. Gyda'u gwybodaeth fanwl, gallant roi sicrwydd i ni ein bod yn defnyddio'r wyddoniaeth gywir, o'r ffynonellau cywir, ac yn edrych yn fanwl ar y cwestiynau gwyddonol a ofynnir i ni."
        },
        {
            "text": "Mae'r pwyllgorau hyn wedi ein cynghori ar bopeth o asesu'r dystiolaeth wenwyneg ar gyfer diogelwch CBD (canabidiol) i edrych ar dystiolaeth newydd i gefnogi diweddaru ein cyngor ar wyau meddal ar gyfer grwpiau sy’n agored i niwed."
        },
        {
            "text": "Fe wnaethom siarad â rhai o’n haelodau presennol i ddarganfod rhagor am eu profiadau o fod ar un o’n Pwyllgorau Cynghori Gwyddonol:"
        },
        {
            "text": "Mae Jane Case yn gyfreithiwr ac yn aelod lleyg ar y Pwyllgor ar Wenwyndra. Mae hi’n un o ddau aelod lleyg ar y Pwyllgor sy’n cynrychioli’r cyhoedd trwy edrych ar bethau o safbwynt person cyffredin. Fe wnaeth profiad Jane o gael plentyn sydd ag alergeddau bwyd ei hysbrydoli i wneud cais i fod yn rhan o’r Pwyllgor ar Wenwyndra:"
        },
        {
            "text": "Ychwanegodd: ‘Mae gweddill y pwyllgor yn wyddonwyr arbenigol ac yn hynod wybodus am eu meysydd. Wrth gwrs, maen nhw i gyd yn aelodau o’r cyhoedd eu hunain, ond maen nhw yno i gymhwyso eu gwybodaeth wyddonol, felly rydym ni'n dod â phersbectif gwahanol i'r bwrdd.’"
        },
        {
            "text": "Un o’r gwyddonwyr arbenigol hynny yw Dr Gauri Godbole, microbiolegydd meddygol a pharasitolegydd ymgynghorol yn Asiantaeth Diogelwch Iechyd y DU (UKHSA). Mae hi’n arbenigo mewn dilyniant genom cyfan (a ddefnyddir i olrhain salwch a gludir gan fwyd) ac ymwrthedd gwrthficrobaidd (yr ymwrthedd i gyffuriau sy’n trin yr heintiau a achosir gan ficrobau, fel feirws). Mae hi wedi bod yn aelod o'r Pwyllgor Cynghori ar Ddiogelwch Microbiolegol Bwyd (ACMSF) ers 2018. Dywed fod gwaith y pwyllgor yn ‘heriol ond yn gyffrous’, gan fod gwaith yr ACMSF yn cynnwys asesiadau risg cymhleth."
        },
        {
            "text": "Dywedodd Gauri ei bod yn bleser gweithio gydag unigolion sydd â chefndiroedd arbenigol gwahanol o’r sector milfeddygol a’r sector bwyd ac yr hoffai weld y pwyllgorau’n parhau i dyfu: ‘Byddwn yn bendant yn annog aelodau o gefndiroedd amrywiol a chefndiroedd gwyddonol i wneud cais i’r grŵp arbenigol hwn.’"
        },
        {
            "text": "Mae Jane yn cytuno: ‘Ewch ati i wneud cais! Mae’n ddiddorol, heriol ac yn ysgogi’r meddwl ac ar yr un pryd rydych chi’n rhoi rhywbeth yn ôl. Mae pawb yn gwrando ar bawb arall, ac mae’r dadleuon a’r trafodaethau yn hynod ddiddorol.’"
        },
        {
            "heading": 2,
            "text": "A yw hyn yn rhywbeth y gallai fod o ddiddordeb i chi?"
        },
        {
            "text": "I ddysgu rhagor am bob Pwyllgor, gweld y gwaith maen nhw'n ei wneud a darllen yr hyn sydd wedi digwydd mewn cyfarfodydd blaenorol, ewch i'n tudalen Pwyllgorau Cynghori Gwyddonol."
        },
        {
            "text": "Rydym ni hefyd yn recriwtio aelodau newydd i’n Cyngor Gwyddoniaeth. Mae aelodau’r Cyngor Gwyddoniaeth yn cynnig mewnwelediad, her a chyngor strategol lefel uchel, arbenigol i Brif Gynghorydd Gwyddonol yr ASB yn ogystal ag i Fwrdd a thîm gweithredol yr ASB ar ei defnydd o wyddoniaeth i gyflawni ei hamcanion. Mae manylion ar sut i wneud cais ar gael ar ein gwefan. Y dyddiad cau ar gyfer ceisiadau yw hanner nos, dydd Sul 30 Ionawr 2022."
        }
    ]
}