{
    "url": "https://civilservicelocal.blog.gov.uk/2022/01/18/maer-rhwydwaith-iaith-cymraeg-angen-chi-the-welsh-language-network-needs-you/",
    "title": "Mae’r Rhwydwaith Iaith Cymraeg angen chi. The Welsh Language Network Needs You.",
    "authors": [
        "Kim Ann Williamson MBE"
    ],
    "categories": [
        "Cymru Wales"
    ],
    "pub_date": "2022-01-18T15:12:20+00:00",
    "content": [
        {
            "text": "Fel gyda rhwydweithiau trawsadrannol sefydledig eraill, mae’r rhwydwaith iaith Cymraeg ar gyfer pob gwas sifil sydd wedi’u lleoli yng Nghymru gyda’r uchelgais i hwyluso cydweithio, cefnogi ein dysgwyr a siaradwyr brodorol ar bob lefel, a defnyddio’r cyfleoedd sydd yn dod gyda gweithio’n agosach ar draws adrannau gwahanol."
        },
        {
            "text": "Llynedd, ail-lansiwyd ni rhwydwaith Cymraeg trawsadrannol dros Gymru. Mae dros 50 aelod yn y rhwydwaith erbyn hyn. Ategir yr aelodaeth y rhwydwaith gyda staff angerddol am yr iaith Gymraeg a phwy sydd eisiau wneud gwahaniaeth yn y gwasanaeth sifil. Mae ganddyn nhw’r rhyddid i greu syniadau newydd, dylanwadu ar newid a chodi ymwybyddiaeth gyda’u cydweithwyr."
        },
        {
            "heading": 3,
            "text": "Rydym yn edrych am Arweinydd Rhwydwaith"
        },
        {
            "text": "Rydym yn edrych am gyd-gadeirydd newydd ar gyfer y rhwydwaith. Os ydych yn gyfrifol ac yn angerddol am yr iaith Cymraeg a bod gennych brofiad o arwain darnau allweddol, hyrwyddo neu drawsnewid sut mae’r iaith Cymraeg yn cael ei defnyddio yn y Gwasanaeth Sifil, yna dyma gyfle gwych i chi datblygu. Mae’n gyfle i alluogi chi i gryfhau eich dealltwriaeth bresennol yn yr adran hon, ac i gydweithio ag eraill ar draws y Gwasanaeth sifil. Nid yw profiad neu raddau yn elfennau pwysicaf, rydym yn edrych am ymrwymiad, brwdfrydedd a gweithredu cadarnhaol."
        },
        {
            "text": "Dyma gyfle i siapio dyfodol y rhwydwaith."
        },
        {
            "heading": 3,
            "text": "The Welsh Language Network Needs You"
        },
        {
            "text": "As with other established Cross-Departmental Networks, the Welsh Language Network is for all civil servants located across Wales with the ambition to facilitate collaboration, support our learners and native speakers at all levels, and utilise the opportunities that come with closer cross-departmental working."
        },
        {
            "text": "Last year we relaunched a cross-departmental Welsh Language Network across Wales. The network currently has over 50 members. The network membership is complemented with staff who are passionate about Welsh Language and want to make a difference in the Civil Service. They have the freedom to create new ideas, influence change and raise awareness with colleagues."
        },
        {
            "heading": 3,
            "text": "We are looking for a Network Lead"
        },
        {
            "text": "We are looking for a new co-chair for this network. If you are responsible for and passionate about the Welsh Language in your department and have experience of leading on key pieces, promoting or transforming how the Welsh Language is used in the Civil Service then this is a great development opportunity. It would enable you to strengthen your existing understanding in this area and collaborate with others across other civil service departments. Experience or grades are not the most important elements, we are looking for commitment, enthusiasm and positive action."
        },
        {
            "text": "This is an opportunity to shape the future of the network."
        },
        {
            "text": " "
        }
    ]
}