{
    "url": "https://defrafarming.blog.gov.uk/2022/01/18/rolling-application-window-for-farming-in-protected-landscapes/",
    "title": "Rolling application window for Farming in Protected Landscapes",
    "authors": [
        "Kate Corfield"
    ],
    "categories": [
        "Payments to support parks, AONBs and Broads"
    ],
    "pub_date": "2022-01-18T16:22:07+00:00",
    "content": [
        {
            "text": "I’m pleased to say that following feedback, we are moving to a rolling application window for the rest of the Farming in Protected Landscapes programme."
        },
        {
            "text": "The Farming in Protected Landscapes programme encourages farmers and other land managers working in Protected Landscapes to develop and deliver projects around 4 themes:"
        },
        {
            "text": "The programme opened for applications in July last year. We’ve already blogged a couple of times about the programme - I'll share those posts in the box at the bottom of the page.  Most recently, I shared how famers are using their funding. My post highlights some of the good work that the programme is already delivering."
        },
        {
            "text": "As part of our test-and-learn approach to delivery, we will continue to make improvements to the way our schemes work. We’ve been listening to feedback from the farmers delivering projects on the ground. We've also heard from the Protected Landscapes bodies who run the programme locally."
        },
        {
            "text": "One of the points they raised was the need to have a rolling application window for the programme. A rolling application window means the programme can be more inclusive and work flexibly with the farming calendar."
        },
        {
            "text": "So, from now on, there will be a rolling application window for the rest of programme. You can now submit applications up until the programme closes for applications in 2024."
        },
        {
            "text": "We will therefore not close the window for applications on 31 January 2022."
        },
        {
            "text": "We’re excited to pilot this rolling application approach in the programme. We will apply what we've learned from this smaller scale programme to inform Defra’s future farming schemes."
        }
    ]
}