{
    "url": "https://space.blog.gov.uk/2022/01/18/the-night-sky-in-january-2/",
    "title": "The night sky in January",
    "authors": [
        "Derek Smale"
    ],
    "categories": [
        "Astronomy"
    ],
    "pub_date": "2022-01-18T10:39:36+00:00",
    "content": [
        {
            "text": "Happy New Year!"
        },
        {
            "text": "2022 brings a host of exciting astronomical events and the long winter nights provide an excellent chance to spend some time under the stars and get to know our night sky a little better."
        },
        {
            "text": "Join us each month to find out what you’ll be able to see!"
        },
        {
            "heading": 3,
            "text": "\nAstronomy in 2022"
        },
        {
            "text": "There are lots of exciting things to look out for from UK skies this year."
        },
        {
            "text": "In May there’ll be an opportunity to see a full lunar eclipse in the early hours of the morning."
        },
        {
            "text": "June nights will host a spectacular alignment of the brighter planets - Mercury, Venus, Mars, Jupiter and Saturn will all line up in the early morning sky."
        },
        {
            "text": "October brings a partial solar eclipse, and there’s the usual host of spectacular meteor showers scattered throughout the year to watch out for."
        },
        {
            "text": "This month bright Jupiter can still be seen in the south-west in the early evening sky."
        },
        {
            "text": "It will only remain visible for around another month or so now, before passing behind the Sun and reappearing in the morning sky in April."
        },
        {
            "text": "Another bright object to look out for in our night sky is Sirius, the brightest star in our night sky and primary star of the constellation Canis Major (the Great Dog), which can be seen rising in the south-east around 7pm."
        },
        {
            "text": "Sirius, which follows the distinctive stars of Orion across our night sky, is around twice the size of our Sun, and sits just eight light-years away – one of our closer celestial neighbours."
        },
        {
            "text": "As the stars of our galaxy orbit around the super-massive black hole at the centre of our galaxy, Sirius is gradually moving closer to our own solar system, and it will get gradually brighter over the next 50,000 years."
        },
        {
            "text": "The Moon’s orbit around Earth is not completely circular, and as a result of the Moon moving closer and further away from us, its size in our skies appears to change slightly."
        },
        {
            "text": "This month’s full ‘Wolf Moon’ is the smallest full Moon in our night sky this year, due to the Moon being at its greatest distance from Earth when opposite the Sun in our skies."
        },
        {
            "text": "By contrast, June and July will bring ‘Super Moons’.  These occur where the full Moon coincides with the Moon reaching its closest point to Earth in its orbit around our planet."
        },
        {
            "text": "The summer super Moons will appear some 10% larger in our skies than this month’s full Moon."
        },
        {
            "heading": 3,
            "text": "\nThe International Space Station"
        },
        {
            "text": "Did you know you can see the International Space Station as it orbits our planet?"
        },
        {
            "text": "The best times to view it are usually soon after sunset or just before sunrise, when the Sun is just below the horizon."
        },
        {
            "text": "This means it is nearly dark here on the surface, but 400km (250 miles) up, the Space Station is brightly illuminated by the light of the Sun, making it unmistakably bright as it slides across the sky."
        },
        {
            "text": "Only the Moon and the planet Venus appear brighter in our night skies."
        },
        {
            "text": "The last week of January is an excellent time to try and see the Space Station. Even though it is travelling at around 28,000km per hour (17,500 mph), each pass will be visible for several minutes."
        },
        {
            "text": " "
        },
        {
            "heading": 3,
            "text": "Space Exploration"
        },
        {
            "text": "The James Webb Space Telescope, which launched on Christmas Day, has successfully deployed its sunshield and mirror panels.  It is now on its way out to the point in space where it will begin operations, some 1.5 million km (1 million miles) away from Earth – around four times further away than the Moon!"
        },
        {
            "text": "Watch our short film to find out more about the UK's involvement in James Webb!"
        }
    ]
}