{
    "url": "https://hmlandregistry.blog.gov.uk/2022/01/18/view-my-applications-will-soon-include-your-colleagues-work/",
    "title": "View My Applications will soon include your colleagues’ work",
    "authors": [
        "John Taylor, Associate Product Manager"
    ],
    "categories": [
        "Law and practice"
    ],
    "pub_date": "2022-01-18T15:34:33+00:00",
    "content": [
        {
            "text": "View My Applications was launched in August 2020. This enhancement to the HM Land Registry portal has enabled customers to manage applications and correspondence in one central place. Since then it has had more than 127,000 users, with more than 3.5 million page views, and we continue to gather feedback from customers to inform further development. Many customers have stated they would like to be able to see their colleagues’ work as well as their own submissions."
        },
        {
            "text": "We can now share our plans to launch this new feature to all users in early spring. You will be able to search all applications submitted by colleagues within your business unit. Each business unit has at least one dedicated administrator within your company. Ask your team if you need clarity on the scope of your business unit."
        },
        {
            "text": "We understand it will be useful for some of you to see the full list of applications that a colleague is working on. So, we are now developing the option to return all applications being managed by specific colleagues. This means you will be able to review the progress of, or continue working on, your colleagues’ applications when they are away from the office. More news will be shared about this function in the near future."
        },
        {
            "text": "Although these features will enhance the work of many portal users, we understand that a few organisations may not want to share their applications in this way. As a result, we have introduced an ‘opt-out’ feature which can be used at any point. The nominated 'Responsible Person’ for each business unit can manage this from within their account settings.  More details on the ‘opt-out’ feature have been sent to all Responsible Persons, Deputy Responsible Persons and Business Unit Administrators."
        },
        {
            "text": "Recently we added additional features to View My Applications that allow you to manage and prioritise your applications better. The Respond feature allows you to reply to a requisition or other HM Land Registry correspondence, add documents and notes to the application, or request an extension of time in reply to our correspondence, directly from View My Applications."
        },
        {
            "text": "The Export feature allows you to extract information relating to all or a selected sample of applications based on the search and filter options you have used. And the Correspondence section was expanded to included 3 new categories, Review, Resolve and Information, that help give a quick view on which elements of an application still need to be resolved. These enhancements are all designed to work together to optimise the portal further."
        },
        {
            "text": "The enhanced View My Applications tool will be renamed View Applications once the View My Colleagues function is added in the spring."
        },
        {
            "heading": 2,
            "text": "One part of the digital project"
        },
        {
            "text": "This work is just one part of our ongoing move toward paperless systems and processes."
        },
        {
            "text": "View My Applications will soon feature drafts of applications created using the Digital Registration Service. Customers using the Digital Registration have seen a reduction of requisitions on some basic error fall by 25%. Due to upfront error checking, we’ve also been able to cut processing time in half."
        },
        {
            "text": "So, from November 2022 we will no longer accept scanned or PDF copies of AP1s for changes to existing titles via the portal. We are also incorporating automation wherever practical, reducing the administrative burden on our expert caseworkers so they can focus on the details of a case. With a greater adoption of electronic signatures and digital identity checks, along with the improvements we are making to the portal and our Business Gateway experience, we anticipate real efficiency gains for all involved in the conveyancing process."
        },
        {
            "heading": 2,
            "text": "Reminder: HM Land Registry fees increase"
        },
        {
            "text": "From Monday 31 January, some of our land registration fees will increase for the first time since 2009."
        },
        {
            "text": "This will affect applications for first registrations and for the registrations of transfers, leases and mortgages of property (scales 1 and 2). For the majority of affected applications – those submitted electronically – the fee will increase by 11%."
        }
    ]
}