{
    "url": "https://gfie.blog.gov.uk/2022/07/05/a-complete-guide-to-gfie-veterans-military-partners-spouses-and-service-leavers/",
    "title": "A complete guide to GFiE - Veterans, Military Partners/Spouses and Service Leavers",
    "authors": [
        "Andrew Ashworth"
    ],
    "categories": [
        "agreatplacetoworkforveterans",
        "Life Chances",
        "Uncategorized",
        "Veterans"
    ],
    "pub_date": "2022-07-05T08:35:54+01:00",
    "content": [
        {
            "text": "In this blog we provide a full guide to recruitment through Going Forward into Employment for Veterans, Military Partners/Spouses and Service Leavers."
        },
        {
            "heading": 3,
            "text": "What is the scheme?"
        },
        {
            "text": "Going Forward into Employment (GFiE) provides innovative approaches to recruitment, which provides people from a wide range of backgrounds, who face barriers to employment, with Life Chance opportunities within the Civil Service.  Our scheme helps to make the Civil Service more representative of the country it serves. "
        },
        {
            "text": "The Office for Veterans’ Affairs (OVA) published the Veterans’ Strategy Action Plan: 2022 to 2024 on 19th January 2022, setting the direction for how the Civil Service will champion, support and empower our veteran community across government. It is the latest plan to deliver on our ambition of making the United Kingdom the best place in the world to be a veteran by 2028. The Civil Service has committed to employ recruiting 150 individuals that have been associated with the Armed Forces before the end of March 2024 through this scheme."
        },
        {
            "heading": 3,
            "text": "What types of roles are available?"
        },
        {
            "text": "Most roles made available through the schemes opportunities are for entry level and up to first line management grades."
        },
        {
            "text": "Each unique opportunity can offer a Fixed Term Appointment for up to 24 months, which may have a potential to be made permanent."
        },
        {
            "text": "Typical opportunities can include roles which:"
        },
        {
            "text": "The Civil Service has a wide variety of departments which covers , so there is always an interesting role for everyone.  Some roles also provide the opportunity to complete qualifications, with many taking the form of apprenticeships. Further professional learning is available to support your development and career. "
        },
        {
            "heading": 3,
            "text": "Criteria for Veterans & Military Spouses/Partners"
        },
        {
            "text": "In order to be able to apply for a GFiE Life Chance opportunity or to be referred via one of our partners, certain criteria must be met. "
        },
        {
            "text": "Veterans candidates must;"
        },
        {
            "text": "Military Partners/Spouses must;"
        },
        {
            "heading": 3,
            "text": "Recruitment Internships Supporting Employment (RISE)"
        },
        {
            "text": "Our Recruitment Internships Supporting Employment (RISE) scheme offers an internship (Civilian Work Attachment) of one to eight weeks, which could lead to a two-year fixed term appointment.  This scheme is purley aimed at Service Personnel who are due to leave HM Forces"
        },
        {
            "text": "This scheme is designed to ease the transition of leaving the military and provide an opportunity to enter employment within the Civil Service. "
        },
        {
            "text": "During the internship, candidates will continue to be paid by the Ministry of Defence (MoD) as part of the resettlement process. "
        },
        {
            "heading": 3,
            "text": "Criteria"
        },
        {
            "text": "For the Recruitment Internships Supporting Employment (RISE) programme, you must be a service leaver undertaking your resettlement period.  During this period you will still be paid by the MoD. "
        },
        {
            "text": "You will need to have authorisation from your Commanding Officer to undertake a Civilian Work Attachment in accordance with JSP 534 and you must complete MoD Form 1746. "
        },
        {
            "heading": 3,
            "text": "Recruitment for Departments"
        },
        {
            "text": "Once a department has highlighted a vacancy that they wish to fill with a Service Leaver, Veteran or a Military Partner/Spouse,  they bring it to the Going Forward into Employment team.  These are usually entry level roles up to first line manager (EO), but we can still work with you if you have other options."
        },
        {
            "text": "Departments will provide all relevant job descriptions, Internship details or contract lengths (max two year fixed term appointment) and relevant details."
        },
        {
            "text": "We then work with the vacancy holder and relevant professional bodies to fill roles across the country.  "
        },
        {
            "text": "The potential candidate(s) will then normally provide a CV, an expression of interest and undertake an informal interview/meeting with the department contact to ensure suitability and take the opportunity to find out more about each other."
        },
        {
            "heading": 3,
            "text": "Candidate Applications"
        },
        {
            "text": "All of our vacancies will be uploaded onto our main partners (The Career Transition Partnership) RightJob web portal.  They are also shared with our network of contacts from professional organisations - such as those from charities, DWP, Walking with the Wounded as well as onto our very own Facebook page.  This network then shares the roles with any of their suitable candidates, working with them to submit an application to GFIE. "
        },
        {
            "text": "To apply for our roles, we ask all candidates to submit a CV and complete an Expression of Interest (EOI) form which will ask you to write a short 250 word description of why you would like to work for the civil service. (Please feel free to write more than 250 words).   Many of these come through the CTP portal or directly from referring organisations."
        },
        {
            "text": "After receiving your application, the GFIE team will review the application (all 3 documents) to make sure that the candidate fits the criteria. Once signed off, we will then pass the CV and EOI to the vacancy holder on the closing date for review and interview selection. We will notify all candidates about the status of the application once we have the vacancy managers interview list.  "
        },
        {
            "heading": 3,
            "text": "Candidate bank"
        },
        {
            "text": "This year, we opened up the GFIE candidate bank! That means that you can now submit your CV, your candidate's CV and candidate referral form straight into the GFIE inbox without even having to apply for a role.  The GFIE team will contact the candidates directly about any suitable upcoming roles and help them to apply directly with us, this can also be done via the CTP RightJob web portal. "
        },
        {
            "heading": 3,
            "text": "Interview "
        },
        {
            "text": "For those invited to interview, this will either be an in-person meeting or as a call held via a video conferencing tool like MS Teams.  The interview is going to be an opportunity for the department to find out a bit more about candidates and their potential to fit in the role. It's also a good opportunity for candidates to ask any questions they have about the role, including what a day in the job can look like or more information about the team."
        },
        {
            "text": "It's also a great opportunity to discuss any previous background history which might come up in subsequent vetting checks, so the department is fully aware of anything which might later be a surprise to them."
        },
        {
            "heading": 3,
            "text": "Vetting"
        },
        {
            "text": "Once the candidate has accepted a job offer, they will go through the usual Civil Service vetting process, which on average takes between 8-16 weeks. Candidates will be asked to submit a number of ID documents including: Photo ID, 2x Proof of address, National Insurance number, contact details. The GFIE scheme’s use of exception 2 means that during the vetting stage we are able to accept offences that might not otherwise pass the security clearance. This stage requires the department's security team to sign off on the ‘risk level."
        },
        {
            "text": " "
        },
        {
            "heading": 4,
            "text": "“The opportunity to successfully undertake an internship led to me being given a full time / fixed term role. This really helped me to see how the Civil Service would contribute to my personal development and what skills I could use in the future”"
        },
        {
            "heading": 3,
            "text": "How to apply for all of these schemes:"
        },
        {
            "text": "All current job opportunities will be available to see on the Careers Transition Partnership (CTP) website here."
        },
        {
            "heading": 3,
            "text": "How to get involved:"
        },
        {
            "text": "If you are a Civil Servant you can use one of our schemes to fill your vacancy! Contact us for more information.  "
        },
        {
            "text": "If you are looking for work and are a Veteran, Military Partner/Spouse or a Service Leaver and are interested in applying for a role you can contact us for more information - also check out our facebook and CTP pages. "
        },
        {
            "text": "If you are an organisation who works with Veterans, Military Partners/Spouses or Service Leavers and are interested in our work, you can get in touch with us here."
        },
        {
            "text": " "
        },
        {
            "text": "GET IN TOUCH:"
        },
        {
            "text": "For more information on all of our other schemes check out our blog"
        },
        {
            "text": "Or check out our Twitter page and Facebook page for more information"
        },
        {
            "text": "Get in touch with us by emailing us at  GFIE@cabinetoffice.gov.uk "
        }
    ]
}