{
    "url": "https://gfie.blog.gov.uk/2022/07/05/a-complete-guide-to-gfie-carers/",
    "title": "A complete guide to GFiE - Carers",
    "authors": [
        "Andrew Ashworth"
    ],
    "categories": [
        "Carers",
        "Inclusion",
        "levelling up",
        "Life Chances",
        "Uncategorized"
    ],
    "pub_date": "2022-07-05T09:54:36+01:00",
    "content": [
        {
            "text": "Here we provide a full guide to recruitment through Going Forward into Employment (GFiE) for Carers."
        },
        {
            "heading": 3,
            "text": "What is this scheme?"
        },
        {
            "text": "This scheme is a partnership between GFiE and Carers Trust. It is available across the civil service, year round and nationwide.  We match carers into civil service roles, offering 12-24 month fixed term appointments with the possibility of permanency. Alongside the job we also offer support to candidates and line managers."
        },
        {
            "text": "Carers can experience barriers to employment including gaps in their CV because of years spent caring and/or loss in confidence associated with time out of the workplace.   Young Adult Carers can also experience barriers to accessing and fully participating in education and training opportunities because of their caring roles and these barriers can translate into barriers to employment. "
        },
        {
            "heading": 3,
            "text": "Who is this scheme for?"
        },
        {
            "text": "The scheme is open to carers:"
        },
        {
            "text": "Here ‘a carer’ means anyone who is caring, unpaid, for a family member or friend who is frail, disabled or has physical or mental health problems."
        },
        {
            "heading": 3,
            "text": "How does it work? "
        },
        {
            "text": "Step 1 "
        },
        {
            "text": "A Government Department identifies a job vacancy that they want to fill using this scheme. "
        },
        {
            "text": "The details of the role will be set out in a Job Description.   If roles are AO or EO ( or equivalent grades) they have the potential to be made permanent after 12 months subject to performance. Grades above EO can be filled using the scheme but cannot be made permanent via the exception. However candidates at more senior grades can apply for roles through fair and open competition."
        },
        {
            "text": "Step 2"
        },
        {
            "text": "A Government Department gets in touch with the GFiE Team to discuss the role. The GFiE Team will need to know: the grade, the role, the location, the ideal start date/timeframe to fill the role, the location and the clearance level. GFiE will also need to know how flexible the role is in order to determine whether it is appropriate for somebody with an ongoing caring role. "
        },
        {
            "text": "Step 3"
        },
        {
            "text": "The GFiE team will talk to the Recruiting Dept through the process. We will talk the vacancy holder through the approach for expressions of interest and/or CVs. This will be a simplified process to maximise the candidate’s ability to engage positively with the process and to minimise some of the elements of recruitment that can form barriers.   "
        },
        {
            "text": "The GFiE team will work with the vacancy holder to agree the Job Description. We have a standard Job Description, Expression of Interest form and Referral form. The JD will be a simple explanation of the roles and the qualities that the team are looking for and it will explicitly state that the next stage will be an informal conversation rather than a formal interview – recognising that this removes a barrier to those who have lost confidence and/or who have little or no experience of interviews.  "
        },
        {
            "text": "Candidates will be asked to complete a 250 word Expression of Interest (EoI) and submit their CV – and the JD will explicitly state that any gaps in CV due to caring role will be entirely understood and that we understand that caring in itself is an important role with skills and experiences that are transferable including organisation, persistence and communication skills."
        },
        {
            "text": "Step 4"
        },
        {
            "text": "The GFiE Team will share the vacancy details with Carers Trust who will share the vacancy with the network partner nearest to vacancy – this will include a deadline for applications"
        },
        {
            "text": "Carers Trust Network Partners will share the vacancy with the carers they are working with and support people to apply. They will then send GFiE the professional referral, the CVs and EoI forms from suitable candidates to the GFiE Team on or before the agreed deadline. "
        },
        {
            "text": "Step 5"
        },
        {
            "text": "The GFiE Team will share the CV,  EoI and referral with the vacancy holder who will then have a candidate or pool of candidates to have an informal conversation with.   This will not be a formal interview. The vacancy holder will speak to the candidates in an informal conversation, decide who to appoint and provide feedback to all candidates so that they each take something away from the process. "
        },
        {
            "text": "Step 6"
        },
        {
            "text": "Successful candidates will be notified.  Unsuccessful candidates will be notified and provided with feedback.  "
        },
        {
            "text": "Step 7"
        },
        {
            "text": "The new recruit is onboarded in the usual way by the Department they are joining  - as they would for any new starter. This will include a security vetting process. "
        },
        {
            "text": "Step 8 "
        },
        {
            "text": "The GFiE Team is available to provide ongoing support to both candidate and line managers as well as to Network Partners if necessary."
        },
        {
            "text": "Candidates will be offered a buddy as well as a handbook for the scheme that will signpost the Carers Network within their Department and the core offer to carers in place in their Dept and across Government, including a carers passport.  Line managers will have access to a toolkit  - also signposted to them in the handbook for the scheme"
        },
        {
            "text": " "
        },
        {
            "heading": 3,
            "text": "How to get involved:"
        },
        {
            "text": "If you are a Civil Servant you can use one of our schemes to fill your vacancy! Contact us for more information.  "
        },
        {
            "text": "If you are looking for work and are a Carer and are interested in applying for a role you can contact us for more information. "
        },
        {
            "text": "If you are an organisation who works with Carers and are interested in our work, you can get in touch with us here."
        },
        {
            "heading": 3,
            "text": "GET IN TOUCH:"
        },
        {
            "text": "For more information on all of our other schemes check out our blog"
        },
        {
            "text": "Or check out our Twitter page "
        },
        {
            "text": "Get in touch with us by emailing us at  GFIE@cabinetoffice.gov.uk "
        },
        {
            "text": " "
        }
    ]
}