{
    "url": "https://gfie.blog.gov.uk/2022/07/05/a-complete-guide-to-gfie-care-leavers/",
    "title": "A complete guide to GFiE - Care Leavers",
    "authors": [
        "Andrew Ashworth"
    ],
    "categories": [
        "Care Leavers",
        "levelling up",
        "Life Chances"
    ],
    "pub_date": "2022-07-05T13:29:13+01:00",
    "content": [
        {
            "text": "Here we provide a full guide to recruitment through Going Forward into Employment (GFiE) for Care Leavers."
        },
        {
            "heading": 3,
            "text": "What is this scheme?"
        },
        {
            "text": "The GFIE Care Leavers scheme is a pilot working with a small number of Local Authorities to match care experienced young people into Civil Service roles.  It is available across the Civil Service, year round."
        },
        {
            "heading": 3,
            "text": "Who is this scheme for?"
        },
        {
            "text": "The scheme is available in participating locations to care experienced people via their Local Authority contact e.g. post 16 support worker, PA or Social Worker"
        },
        {
            "heading": 3,
            "text": "How does it work? "
        },
        {
            "text": "Step 1"
        },
        {
            "text": "We work with vacancy holders in Government Departments to make their job description as accessible as possible. For example we typically don’t use the standard approach to setting out behaviours, competencies or strengths. We simplify the application process. We ask for a CV and a short expression of interest from candidates."
        },
        {
            "text": "Step 2"
        },
        {
            "text": "We can offer information sessions with potential candidates, the local authority and the recruiting team to encourage young people to make applications and to demystify the Civil Service and the specific role."
        },
        {
            "text": "We work closely with the council to match young people into roles. This approach is intended to get a good match between the young person and the specific role. Social workers and other professionals on Leaving Care Teams in the Council are well placed to look at the job descriptions we share with them and make candidate referrals to us on the basis of their knowledge of the strengths, interests and aspirations of the young people they are working with."
        },
        {
            "text": "Step 3 "
        },
        {
            "text": "We support line managers/recruiting managers to hold informal conversations with candidates rather than formal interviews. We provide all candidates with feedback so that everyone can take some learning away from the experience"
        },
        {
            "text": "Step 4 "
        },
        {
            "text": "The new recruit is onboarded in the usual way by the Department they are joining  - as they would for any new starter. This will include a security vetting process."
        },
        {
            "text": "Step 5"
        },
        {
            "text": "We offer ongoing support to line managers and candidates, who each get the opportunity to work with a GFiE Buddy/Mentor."
        },
        {
            "heading": 3,
            "text": "How to get involved:"
        },
        {
            "text": "If you are a Civil Servant you can use one of our schemes to fill your vacancy! Contact us for more information.  "
        },
        {
            "text": "If you are looking for work and are a Care Leavers and are interested in applying for a role you can contact us for more information. "
        },
        {
            "text": "If you are an organisation who works with Care Leavers and are interested in our work, you can get in touch with us here."
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "heading": 3,
            "text": "GET IN TOUCH:"
        },
        {
            "text": "For more information on all of our other schemes check out our blog"
        },
        {
            "text": "Or check out our Twitter page "
        },
        {
            "text": "Get in touch with us by emailing us at  GFIE@cabinetoffice.gov.uk "
        }
    ]
}