{
    "url": "https://socialcareinspection.blog.gov.uk/2022/07/05/consultation-on-a-judgement-for-care-leavers-in-our-inspections-of-local-authority-childrens-services/",
    "title": "Consultation on a judgement for care leavers in our inspections of local authority children’s services",
    "authors": [
        "Yvette Stanley"
    ],
    "categories": [
        "care leavers",
        "children's services",
        "inspection framework",
        "local authorities"
    ],
    "pub_date": "2022-07-05T15:00:43+01:00",
    "content": [
        {
            "text": "Yvette Stanley, our National Director for Social Care, discusses our proposal to inspect the experiences and progress of care leavers."
        },
        {
            "text": "In June we announced proposals to introduce a separate judgement about the experiences and progress of care leavers in our inspection of local authority children’s services (ILACS)."
        },
        {
            "text": "Our consultation, which runs until 29 July, asks for your views on this proposal, on what ‘good’ looks like for care leavers, and when we should start making this judgement."
        },
        {
            "text": "Since we introduced the ILACS framework in 2018, we have reflected on how we have reported on the experiences of care leavers. Our ILACS currently give a single judgement on ‘the experiences and progress of children in care and care leavers’; however, we think we can now go further to maximise the profile of care leavers."
        },
        {
            "text": "There are almost 45,000 care leavers aged 17 to 21 years in England, and we estimate that local authorities have responsibilities to about a further 30,000 care leavers up to the age of 25 years. We think our proposals will give this significant group of young people a clearer profile in our inspections."
        },
        {
            "text": "Before announcing our proposals, we spoke with care leavers, groups that support care leavers and local authority leaders. Their message was loud and clear, that our inspections could and should ‘shine a brighter light’ on how well care leavers are supported into adulthood. We took all of this on board, and we hope you will agree that our proposals can achieve this."
        },
        {
            "text": "What does ‘good’ look like for care leavers?"
        },
        {
            "text": "We already plan to update the evaluation criteria in the inspection framework to better reflect the responsibilities that local authorities have to care leavers up to the age of 25. We are also mindful of future changes that will arise from the independent review of children’s social care. In this consultation, we want your views on the most important factors we need to consider when setting out what good looks like for care leavers."
        },
        {
            "text": "We already have a good understanding of this from our recent research ‘Ready or not’: care leavers’ views of preparing to leave care. We know that care leavers’ views need to be at the forefront of our evaluation, and inspections need to acknowledge the additional barriers that care-experienced young adults may face. Involving care leavers in the development of plans for their future can make a real difference to them leading happy and fulfilled lives while they are in care and as adults; these must be central pillars of our evaluation."
        },
        {
            "text": "We also need to consider the role of local leaders in meeting their duties to care leavers. We see time and again in our reports that effective leaders with a good line of sight to the frontline of their services make a positive difference to the experiences of children. Our survey invites you to consider how your suggestions about the judgement for care leavers should affect our judgement on ‘the impact of leaders on social work practice with children and families’."
        },
        {
            "text": "When we will introduce the new judgement"
        },
        {
            "text": "I am sure that, like me, many of you will be keen for us to introduce this judgement as soon as possible. We think that January 2023 is the right time for this."
        },
        {
            "text": "By January, we will have inspected all local authorities at least once under the ILACS framework. All local authorities will have had their earlier single inspection framework judgements ‘replaced’ by judgements under the current arrangements and we will have evaluated all local authorities against a consistent framework. That’s why we think this is an opportune moment to make this important change."
        },
        {
            "text": "It is also important that we take the time to get the evaluation criteria right. Implementing from January 2023 means we can carry out a full consultation, properly review your responses and update our published inspection guidance before we introduce the new judgement."
        },
        {
            "text": "If you have a different view about implementation, our online survey includes an opportunity for you to suggest when you think we should introduce the judgement and the reasons for this."
        },
        {
            "text": "Next steps"
        },
        {
            "text": "Our public consultation is open until 29 July. You can find the proposals and a link to our online survey. Please do share this as widely as possible with anyone who you think would have an interest in our proposals, including care leavers."
        },
        {
            "text": "We plan to publish a summary of the consultation responses at the same time as our updates to the ILACS framework in December 2022."
        },
        {
            "text": "We look forward to hearing your views."
        }
    ]
}