{
    "url": "https://food.blog.gov.uk/2022/07/05/genetic-technology-precision-breeding-bill/",
    "title": "Genetic Technology (Precision Breeding) Bill",
    "authors": [
        "Peter Quigley, Deputy Director of Regulatory Services"
    ],
    "categories": [
        "Business guidance"
    ],
    "pub_date": "2022-07-05T09:04:13+01:00",
    "content": [
        {
            "text": "Cymraeg"
        },
        {
            "text": "As an open and responsible regulator, we want to provide as much helpful guidance as we can as the Genetic Technology (Precision Breeding) Bill continues its passage through Parliament to aid understanding for everyone. "
        },
        {
            "text": "The Bill seeks to remove food and feed products produced from Precision Bred Organisms (PBOs) such as gene editing from the regulatory requirements applicable to the environmental release and marketing of GMOs."
        },
        {
            "text": "Precision Bred (PB) products are already authorised to enter the market in some countries, such as USA, Argentina, Australia and Japan."
        },
        {
            "text": "Part 3 of the Bill proposes to introduce powers that will empower the FSA to create a proportionate framework for regulating PBOs. This framework will inform advice to Ministers on which PB food and feed products should be authorised to be placed on the market in England."
        },
        {
            "text": "Whilst the Bill applies to England only, we are committed to UK-wide decision-making that gives the opportunity for any special considerations across the UK to be captured."
        },
        {
            "text": "We have now published information about how a future regulatory framework for PBOs could work in practice and some of the options we are considering."
        },
        {
            "text": "The proposals will be refined in advance of the FSA undertaking a formal consultation on the nature of the regime and following the passage of the Precision Breeding Bill through the scrutiny of both Houses."
        },
        {
            "text": "We welcome any feedback via precisionbreeding@food.gov.uk where it will be carefully considered."
        },
        {
            "heading": 1,
            "text": "\nBil Technoleg Enetig (Bridio Manwl)"
        },
        {
            "text": "Fel rheoleiddiwr agored a chyfrifol, rydym am ddarparu cymaint o ganllawiau defnyddiol ag y gallwn wrth i’r Bil barhau i fynd drwy Senedd Lloegr, er mwyn helpu pawb i’w ddeall yn well. "
        },
        {
            "text": "Mae’r Bil yn ceisio cael gwared ar gynhyrchion bwyd a bwyd anifeiliaid a gynhyrchir o Organebau Bridio Manwl (PBOs), fel golygu genynnau, o’r gofynion rheoleiddio sy’n gymwys i ryddhau amgylcheddol a marchnata organebau a addaswyd yn enetig (GMOs)."
        },
        {
            "text": "Mae cynhyrchion Bridio Manwl eisoes wedi’u hawdurdodi i’w rhoi ar y farchnad mewn rhai gwledydd, fel UDA, yr Ariannin, Awstralia a Japan."
        },
        {
            "text": "Mae Rhan 3 o’r Bil yn cynnig cyflwyno pwerau a fydd yn rhoi grym i’r Asiantaeth Safonau Bwyd (ASB) greu fframwaith cymesur ar gyfer rheoleiddio PBOs. Os caiff ei gymeradwyo gan Weinidogion, bydd y fframwaith hwn yn llywio cyngor i Weinidogion ar ba gynhyrchion bwyd a bwyd anifeiliaid Bridio Manwl y dylid eu hawdurdodi i’w rhoi ar y farchnad yn Lloegr."
        },
        {
            "text": "Er bod y Bil yn berthnasol i Loegr yn unig, rydym wedi ymrwymo i wneud penderfyniadau ledled y Deyrnas Unedig (DU) sy’n rhoi’r cyfle i nodi unrhyw ystyriaethau arbennig ledled y DU."
        },
        {
            "text": "Rydym bellach wedi cyhoeddi gwybodaeth am sut y gallai fframwaith rheoleiddio yn y dyfodol ar gyfer PBOs weithio’n ymarferol a rhai o’r opsiynau yr ydym yn eu hystyried."
        },
        {
            "text": "Bydd y cynigion yn cael eu mireinio cyn i’r ASB gynnal ymgynghoriad ffurfiol ar natur y gyfundrefn ac ar ôl i’r Bil Bridio Manwl gael ei basio drwy waith craffu’r ddau Dŷ."
        },
        {
            "text": "Rydym yn croesawu unrhyw adborth drwy precisionbreeding@food.gov.uk lle cânt eu hystyried yn ofalus."
        }
    ]
}