{
    "url": "https://civilservice.blog.gov.uk/2022/07/05/how-job-sharing-is-going-mainstream/",
    "title": "How Job Sharing is Going Mainstream",
    "authors": [
        "Ruth Hannant",
        "Polly Payne, Director General for Culture Sport and Civil Society in DCMS"
    ],
    "categories": [
        "A great place to work",
        "A Modern Civil Service",
        "A Skilled Civil Service",
        "An Ambitious Civil Service",
        "An Innovative Civil Service"
    ],
    "pub_date": "2022-07-05T05:29:09+00:00",
    "content": [
        {
            "text": "Ruth Hannant and Polly Payne are the first DG-level Civil Service job share "
        },
        {
            "heading": 3,
            "text": "The perception of job-sharing has shifted hugely in recent years from part-time jobs held by junior employees to gradually opening up many more high-powered roles for senior civil servants. We asked four civil servants to share their experiences."
        },
        {
            "heading": 3,
            "text": "DCMS - Ruth Hannant and Polly Payne"
        },
        {
            "text": "We have been job-sharing together for 12 years and were incredibly proud to be the first Director General-level job-share in the Civil Service.  We believe, and hope we have shown, that nearly any role can be done as a job-share."
        },
        {
            "text": "We didn’t really know one another before we started job-sharing. Polly had been job-sharing with someone who went to work in the private sector; she wanted to stay in the Civil Service so we advertised for a job-share partner and got over 40 applicants. Polly met them all - a bit like speed dating - and decided Ruth would be the best fit. This was based on shared values and similar ways of working. Our skills, expertise and experiences were very different - which we think is an advantage. "
        },
        {
            "text": "Promotion"
        },
        {
            "text": "Since starting working together in January 2010, we have worked in five different roles in five different departments. And we managed to secure promotion together, twice. We have done roles involving fast-paced spending negotiations (as Deputy Directors in HM Treasury and then as strategy directors in the then Department for Business, Innovation and Skills (BIS)), legislation and system reform (as directors for higher education in BIS and then the Department for Education), overseen major projects and operational delivery (as Directors General for rail in Department for Transport) and now manage a wide policy and stakeholder portfolio (as Directors General for culture, sport and civil society in the Department for Digital, Culture, Media and Sport)."
        },
        {
            "text": "Shared values"
        },
        {
            "text": "Successful job-sharing is built on teamwork, excellent communication and a shared set of values. We make sure we are aligned on our strategy and priorities, share detailed readouts of all meetings with each other and debate our views on policy and management  questions to ensure we present a shared position to teams. We work hard together to ensure we’re as seamless as possible for those working with us, whilst recognising that we are different people with different characters and so will bring different perspectives.”"
        },
        {
            "text": "“Job-sharing brings massive benefits for the organisation and for each of us. It enables you to do very challenging and interesting roles whilst spending time with family. It’s excellent for resilience, both providing time to decompress and step back, but also - importantly - providing two heads on any challenge and inbuilt moral support on difficult issues. This has been invaluable for us in many of our roles, and also brings real benefits for the organisation as it protects against burn out. The organisation also benefits from the more rounded skill set which two people with complementary attributes can bring to a role.  "
        },
        {
            "text": "One of the amazing things about working in the Civil Service, and which makes us really proud, is the support and encouragement given to job-sharing. There is broad recognition that it works for individuals and departments, so we see successful job-shares across the Civil Service and at all levels. "
        },
        {
            "text": "If you are considering a job-share, take the plunge and do it. We have never looked back!"
        },
        {
            "heading": 3,
            "text": "GCHQ - Emily and Vicky"
        },
        {
            "text": "The Deputy Directors for Counter Terrorism at GCHQ recently topped a list of the most successful people working part-time compiled by flexible-working specialists Timewise. "
        },
        {
            "text": "We applied for the full-time post as a job-share on promotion in May 2020. We were cautious at first because of COVID-19 and Vicky’s maternity leave (Vicky wrote her CV at 3am after a night feed, and Emily held her newborn for the interview) but eagerly grasped the opportunity to lead one of GCHQ’s most important intelligence teams. "
        },
        {
            "text": "Managing terrorism attacks"
        },
        {
            "text": "We always wanted to role-model in a way that supported GCHQ’s values and commitment to flexible working. Our role is responsible for managing terrorism attacks, and strategically planning future models that can respond to a complex and diversifying threat. We are a true partnership; we hold each other to account; we learn from each other and can more generously support our teams with this approach. We remain strong advocates; our job-share is our superpower - it diversifies and doubles our output, efficiency and opportunities, and ultimately makes the UK a safer place by optimising Counter Terrorism outcomes."
        }
    ]
}