{
    "url": "https://governmentscienceandengineering.blog.gov.uk/2022/07/05/improving-the-transparency-of-scientific-evidence/",
    "title": "Improving the transparency of scientific evidence",
    "authors": [
        "Selina Khan"
    ],
    "categories": [
        "Capability & Skills",
        "Guest Blog"
    ],
    "pub_date": "2022-07-05T19:10:11+01:00",
    "content": [
        {
            "text": "Improving the transparency of scientific evidence "
        },
        {
            "text": "Transparency and openness of scientific evidence informing government policy making is of the utmost importance to the Government Office for Science (GOS). By transparent and open, we mean that evidence is fully accessible to the public, easy to find, understandable and published in a timely manner.  "
        },
        {
            "text": "Early in the COVID-19 pandemic, the Government Chief Scientific Advisor made a commitment to make scientific evidence produced by the Scientific Advisory Group for Emergencies (SAGE) publicly available. Since then GOS has released over 1200 papers and minutes from 105 SAGE meetings over the last 2 years on GOV.UK.  "
        },
        {
            "text": "There are huge logistical challenges involved in publishing material at this scale on GOV.UK however there were huge benefits in terms of transparency. "
        },
        {
            "text": "Benefits of publicly available evidence: "
        },
        {
            "text": " "
        },
        {
            "text": "GOS is dedicated to championing the importance of making scientific evidence across government as transparent as possible and we continuously seek to improve processes in our own organisation.  "
        },
        {
            "text": "Over the last year, we have: "
        },
        {
            "text": "Current Transparency Aims for GOS: "
        },
        {
            "text": "Do you work in government and are you interested in improving transparency and openness of government science? We’d like to speak to you! Please email GSE@go-science.gov.uk to get in touch.  "
        }
    ]
}