{
    "url": "https://gfie.blog.gov.uk/2022/07/05/the-recruitment-internship-supporting-employment-rise-scheme-launches-civil-service-wide/",
    "title": "The Recruitment Internship Supporting Employment (RISE) scheme launches Civil Service wide.",
    "authors": [
        "Andrew Ashworth"
    ],
    "categories": [
        "#GFIEsuccessstory",
        "Inclusion",
        "levelling up",
        "Social mobility",
        "Veterans"
    ],
    "pub_date": "2022-07-05T13:50:37+01:00",
    "content": [
        {
            "heading": 2,
            "text": "On the back of Armed Forces week 2022, the Going Forward into Employment (GFiE) team is now able to offer the RISE scheme Civil Service wide."
        },
        {
            "text": "As part of growing its life chance offer, the Recruitment Internship Supporting Employment (RISE) scheme is aimed at HM Forces service leavers, in order to support their transition into a new civilian job.  Originally created by Her Majesty Revenue & Customs (HMRC) colleagues, GFiE is now at the forefront of delivering this initiative on a wider scale."
        },
        {
            "text": "The Civil Service recognises the highly transferable skills and talent that service leavers can bring to an organisation.  The RISE scheme offers an eight week internship, which could result in the offer of a two year fixed term appointment. There is also the potential for that fixed term appointment to be made permanent further down the line."
        },
        {
            "text": "The Civil Service recognises the highly transferable skills and talent that service leavers can bring to an organisation.  The RISE scheme offers an eight week internship, which could result in the offer of a two year fixed term appointment. There is also the potential for the fixed term appointment to be made permanent."
        },
        {
            "text": " "
        },
        {
            "text": "This scheme can offer an opportunity to experience what it’s like to work for the Civil Service, as part of a potential new career option. If you are interested in taking your next steps, please visit the Going Forward into Employment CTP page, where all of our current roles are advertised."
        },
        {
            "text": "Candidates can be offered a wide range of opportunities right across the Civil Service, having the opportunity to learn first hand from experienced colleagues and provided with training and support from their team as well as the GFIE team."
        },
        {
            "text": "GFiE Candidate - \"Just believe in yourself, I had zero qualifications, and was able to push myself through it.\""
        },
        {
            "text": "During the internship, candidates will continue to be paid by the Ministry Of Defence (MOD)."
        },
        {
            "text": "You can see and hear more about the scheme by checking out our short RISE Case Study clip over on our Twitter and Facebook pages."
        },
        {
            "text": "GET IN TOUCH:"
        },
        {
            "text": "For more information on all of our other schemes check out our blog."
        },
        {
            "text": "Or check out our Twitter and Facebook pages for more information."
        },
        {
            "text": "Get in touch with us by emailing us at  GFIE@cabinetoffice.gov.uk "
        },
        {
            "text": " "
        }
    ]
}