{
    "url": "https://openpolicy.blog.gov.uk/2024/10/29/a-role-for-the-creative-sector-in-protecting-environmental-sites/",
    "title": "A role for the creative sector in protecting environmental sites",
    "authors": [
        "brendanarnold",
        "Stephen Bennett"
    ],
    "categories": [
        "Policy Lab",
        "Projects"
    ],
    "pub_date": "2024-10-29T12:53:16+01:00",
    "content": [
        {
            "text": "Policy Lab has a 10-year history of convening diverse voices to contribute to policymaking, including those of creative practitioners. Our ongoing collaboration with the Arts and Humanities Research Council, MANIFEST, evaluates the role that artistic strategies could play in policymaking, from drawing out the human dimensions of policy to generating novel ideas. "
        },
        {
            "text": "Building on MANIFEST, Natural England and Policy Lab partnered to explore a possible use case for creative approaches in policy: whether the activities of early-stage creative researchers could align with Natural England’s goals around Protected Site Strategies, the new, site-specific, approach to managing and protecting natural sites across the country. During this process we spoke to university tutors and students in creative disciplines to find out about existing work relevant to Protected Sites, the level of appetite for long-term collaboration and to explore what forms that could take. "
        },
        {
            "text": "Protected Site Strategies "
        },
        {
            "text": "There are 4000 sites eligible for coverage by Protected Site Strategies in England for ecological or geological reasons, ranging from huge areas such as the Peak District to just a few acres along urban railway sidings. Protected Site Strategies represent long-term thinking on how to balance the varied and unique set of pressures facing each site such as nutrient pollution in air and water, climate change impacts, invasive species, lack of access and the need for recreation in green spaces, food production and energy production. They are tailored to local requirements. The image below shows a selection of Protected Sites in Cornwall. "
        },
        {
            "text": "Although much of the delivery of these strategies rests with the owners and managers on each site, in many cases, key levers sit with external stakeholders and community initiatives beyond the borders. As an example, addressing disturbances to wildlife might need alternative local council provision for dog walkers elsewhere. Similarly, nutrient pollution in a lake may need co-operation from local industry and utility companies. Protected Site Strategies provide the basis for forming holistic local partnerships with these external stakeholders through primary legislation. "
        },
        {
            "text": "Natural England has already had early success in engaging communities around Protected Site Strategies through the Culture Nature scheme which collaborates through library networks. Could a similar approach work with universities? "
        },
        {
            "text": "Higher Education at the nexus of the environment and creative practice "
        },
        {
            "text": "Through a mixed research methodology which included making use of Artificial Intelligence tools, Policy Lab identified university courses around England that combined creative practice with sustainability or ecology. From a shortlist which emphasised geographic spread, pedagogic style and range of disciplines, we engaged course tutors at six universities to conduct in- person research. The goal was to assess appetite for closer collaboration with Natural England, to understand motivations of staff and students and to begin research into ways to encourage better, lasting engagement around the strategic goals that underpin protected natural sites. After initial remote interviews with tutors, we visited institutions to conduct immersive user research with staff and students. "
        },
        {
            "text": "Creative practitioners achieving environmental policy outcomes  "
        },
        {
            "text": "Our user research identified intriguing, novel ways that artists and creative practitioners in Higher Education could help Natural England achieve objectives relating to Protected Site Strategies. Perhaps the most significant finding was that this is a fertile space primed for partnership and alignment with policymaking teams. There was widespread hope that important environmental and climatic challenges can be addressed with the contribution of those with creative skillsets and outlooks. We learnt this is a significant motivation behind course creation in this area. As such, there is a real eagerness in these university departments for expansion, and for collaboration with organisations such as Natural England. "
        },
        {
            "text": "Our research also unearthed important areas to focus. For example, whilst we found that most students had heard of Natural England, many were unclear of their aims which suggests a knowledge gap that needs to be bridged for future collaborative working. Likewise there was broad knowledge of protected environmental sites, but less so of specifics relating to Protected Site Strategies. Excitingly, students and teaching staff suggested a range of ideas to catalyse transformative partnership working. This included student placements with Natural England, course-integrations, summer schools, competitions, on-site workshops and the creation of shared resources such as databases and collaborative maps. Policy Lab is now prototyping some of these ideas in universities in a follow-up to this project and as part of our wider work investigating the role of  innovative practices in policy.  "
        },
        {
            "text": "If you would like to commission, partner with or learn more about Policy Lab please get in touch: team@policylab.gov.uk."
        },
        {
            "text": "Policy Lab and Natural England would like to thank following tutors and their students for their contributions to this project - Simon Andrews and Tanya Griffiths (Falmouth University); Dr Ana Costa (University of Lancaster); Melanie Burton, Nathan Edwards, Anthony Powis and Joanne Phillips (University of Sheffield); Nina Stevenson (London College of Fashion); Dr Ros Gray (Goldsmiths University); and Lucelia Rodrigues (University of Nottingham) "
        }
    ]
}