{
    "url": "https://dcmslibraries.blog.gov.uk/2024/10/29/black-history-month-spotlight-into-the-light-pioneers-of-black-british-ballet-exhibition/",
    "title": "Black History Month Spotlight - Into the light: Pioneers of Black British Ballet exhibition",
    "authors": [
        "Marsha Lowe, Director, Oxygen Arts CIC"
    ],
    "categories": [
        "Uncategorized"
    ],
    "pub_date": "2024-10-29T09:57:05+00:00",
    "content": [
        {
            "text": "The untold stories of Britain’s Black ballet dancers will be put centre stage for the first time in a new touring exhibition in libraries. Funded by a £245,500 grant from The National Lottery Heritage Fund, Into the Light: Pioneers of Black British Ballet is a unique partnership between creative agency Oxygen Arts and Libraries Connected, which will take the exhibition to 25 libraries across the country."
        },
        {
            "text": "The exhibition is part of the wider Black British Ballet project by Oxygen Arts which aims to document the history of Black dancers in British ballet. The project has already brought its Windrush themed ballet show, Island Movements, to 25 libraries in England and Northern Ireland, with a further 15 shows taking place this month."
        },
        {
            "text": "The exhibition tour launched in Stockport and Redbridge at the beginning of October and will run until November 2025. The exhibition aims to celebrate the unique experiences, contributions, and achievements of Black ballet dancers who have historically faced barriers and discrimination within the industry. As a result of this funding, English National Ballet also asked to host the exhibition which will run at their HQ in Canning Town until the end of November. A Royal Ballet centred version of the exhibition is also currently at The Royal Ballet and Opera House."
        },
        {
            "text": "On display in libraries will be archive photography, film, newspaper articles and posters alongside new video and audio interviews that trace the history of black British ballet from the 1940s to the present day. We are also excited to be working with Birmingham based social enterprise, BOM Media, to produce a VR version of the exhibition, including a motion capture dance performance, which will allow it to be taken out on mobile libraries and to more remote library locations."
        },
        {
            "text": "Highlights of the exhibition include:"
        },
        {
            "text": "About Oxygen Arts "
        },
        {
            "text": "Oxygen Arts is a tiny social enterprise, created to share diverse stories. Alone, we could not have had a fraction of the impact that working with public libraries has brought to the project. Library spaces extend across the country, their staff understand the importance of telling these types of stories and immediately grasp the impact on their communities that these could have. They value the arts as an end in itself, and their local knowledge and ability to attract audiences for all types of activities are essential for a small organisation like ours with such limited resources."
        },
        {
            "text": "This activity programme is a vital part of the project, closely aligned with Libraries Connected’s Universal Culture and Creativity Offer, which aims to promote a diverse representation of the arts, widen participation, bring world class artists into local communities and support local creatives to work within their communities."
        },
        {
            "text": "We would like to take this opportunity to thank our funders, Paul Hamlyn Foundation, Arts Council England, Windrush Day Grant Scheme, The National Lottery Heritage Fund and Black Funding Network. "
        }
    ]
}