{
    "url": "https://insidedvla.blog.gov.uk/2024/10/29/dvlas-digital-voices-group-celebrates-ada-lovelace-day/",
    "title": "DVLA’s Digital Voices group celebrates Ada Lovelace Day",
    "authors": [
        "Lucy Whitaker"
    ],
    "categories": [
        "Features"
    ],
    "pub_date": "2024-10-29T16:16:31+00:00",
    "content": [
        {
            "text": "Earlier this month, our Digital Voices advocacy group hosted an event to mark Ada Lovelace Day, an international celebration of the achievements of women in science, technology, engineering and mathematics (STEM)."
        },
        {
            "text": "Colleagues from across the agency joined us at our Richard Ley Development Centre for a half day event of STEM activities. The event also hosted several guest speakers, and its aim was to encourage more women to consider a career in digital."
        },
        {
            "text": "Our Digital Attraction and Engagement Manager, Lucy Whitaker, tells us more…"
        },
        {
            "heading": 2,
            "text": "A generational approach to talent"
        },
        {
            "text": "The day included an inspiring lineup of talks from internal and external speakers, as well as networking activities."
        },
        {
            "text": "To start the event, I had the chance to welcome Amy Taaffe-Evans, member of the IT directorate’s Senior Leadership Team, to the stage. Amy introduced DVLA’s digital and technology team, and discussed the scale of the services we provide. She shared our vision to be recognised as a Centre of Digital Excellence (CoDE) for both the services we build and the learning and development opportunities we offer, which allow us to attract, retain and develop the skills we need for now and in the future."
        },
        {
            "text": "Amy also talked about our evolving services, designed to simplify the process for our customers to interact with DVLA online, ultimately helping them save time and money. She voiced how important it is to have the skills and capability to support our transformation journey, placing our people at the heart of everything we do."
        },
        {
            "text": "As a leading digital and technology employer in the region, Amy emphasised the importance of our generational approach to digital talent at DVLA, which includes promoting digital careers to girls and young women in education, alongside those restarting or changing their careers. Some of the ways we achieve this is through school, college and community outreach, our STEM programme, and our CoDE apprenticeship and development programmes."
        },
        {
            "heading": 2,
            "text": "A look back at pioneering women in STEM"
        },
        {
            "text": "We then had the chance to reflect on the achievements of women who came before. One of my favourite stories of a pioneering woman in STEM was shared by Stacey Harries, Capability Management Lead. She talked about the incredible story of Grace Hopper."
        },
        {
            "text": "Grace Hopper was a computer pioneer and naval officer who made many contributions to computing. She was one of the first women to earn a doctorate in mathematics and the first woman to program a computer in the United States. Despite being initially rejected from joining the US Navy due to her small size and age, she didn't give up. She obtained a waiver to join the US Naval Reserve during World War II to work on the Mark I computer, an early prototype of the electronic computer."
        },
        {
            "text": "One of the attendees, Thirowshie Srijeyaram, shared how she felt inspired by Grace Hopper’s journey:"
        },
        {
            "text": "“Grace Hopper's journey demonstrates that determination and expertise can overcome barriers, such as age, gender, and appearance. Her contributions to computing opened doors for future female technologists and showed the value of diversity within the digital and technology sector. Her story has inspired me to embrace challenges and pursue my passions.”"
        },
        {
            "heading": 2,
            "text": "Exploring digital career opportunities"
        },
        {
            "text": "Next, it was time to shine a spotlight on digital career opportunities! Emily Bollom, Capability and Talent Manager, shared the variety of digital careers at DVLA, how she ended up in digital, and practical advice on starting a digital career. Emily showed that whether you’re aspiring to be a Business Analyst or an Infrastructure Engineer, there’s a career path for you, and resources and support to help you get there."
        },
        {
            "text": "It was then my turn to take the stage. As the lead for the Digital Voices group, it has been a privilege to see our community grow to more than 250 members. I had the chance to highlight the benefits of becoming a Digital Voice, including networking and development opportunities, and access to regular events, training opportunities, and mentoring."
        },
        {
            "text": "Our growing community is made up of like-minded individuals who are interested in, or already working in, digital and technology roles. Interestingly, 74% of our members work in areas outside of our IT department, including some of the attendees. That’s why events like this are so important. They allow our experienced advocates to meet with members across the business and share their knowledge."
        },
        {
            "heading": 2,
            "text": "A different perspective on tech"
        },
        {
            "text": "It was a pleasure to welcome Kerrie Hughes, a Lead Designer at BJSS, a technology and software delivery consultancy. Kerrie uses human-centred design approaches to help organisations understand their customers' needs and align them with their business strategy to create products, services, and experiences that provide real value."
        },
        {
            "text": "During her talk, Kerrie shared her unexpected journey into tech. Despite struggling with maths and science, she found her place in the industry and discovered that there's more to tech than just code and algorithms. She also realised that she had hidden strengths that contributed to her success, such as bringing people together."
        },
        {
            "text": "Kerrie had a great response, and I particularly enjoyed her ‘technology through the decades’ segment where she described her earliest encounter with technology with ‘The Little Professor’ device in the 1970s, right the way through to her love of music and the ‘Roland XP-50’ in the late 1990s."
        },
        {
            "heading": 2,
            "text": "Networking and tips from our digital advocates"
        },
        {
            "text": "The groups then had the chance to network and discuss their insights. Some of the topics included career advice and Civil Service interview tips."
        },
        {
            "text": "We finished the event with a panel discussion featuring our female digital advocates, who all had unique paths into digital roles. We covered important topics such as learning and development opportunities, transferable skills, and maintaining work-life balance."
        },
        {
            "text": "The panellists also shared insights about what they wish they had known before starting their digital careers. One of the panellists, Ffion Fox, spoke of taking note of ‘sunshine moments’, which emphasise the importance of recording your achievements, whether big or small. I thought this was a beautiful way to end the day, inspiring and empowering women to believe in themselves and kickstart their own digital journeys."
        },
        {
            "heading": 2,
            "text": "Reflections"
        },
        {
            "text": "Here’s what some of the attendees had to say about the day:"
        },
        {
            "heading": 2,
            "text": "Pursue a digital career"
        },
        {
            "text": "DVLA’s Digital Voices advocacy group believes strongly in opportunities for all and champions digital diversity at DVLA. We support colleagues who want to build their confidence, knowledge, and skills as well as those seeking a new career path."
        },
        {
            "text": "If a digital career interests you, why not join us at DVLA? Check Civil Service Jobs for all the latest career opportunities. You can also learn more about digital careers at DVLA."
        }
    ]
}