{
    "url": "https://defraenvironment.blog.gov.uk/2024/10/29/englands-vision-and-criteria-for-30by30-on-land-launched-at-cop16/",
    "title": "England’s vision and criteria for 30by30 on land launched at COP16  ",
    "authors": [
        "Danielle Rooke"
    ],
    "categories": [
        "30by30",
        "Climate change",
        "Land use",
        "Nature"
    ],
    "pub_date": "2024-10-29T15:50:38+00:00",
    "content": [
        {
            "text": "This week it’s the UN Biodiversity Summit (CBD COP16) in Colombia. Governments, indigenous communities, businesses, academia, non-governmental organisations, and youth groups are meeting to discuss progress towards international biodiversity targets."
        },
        {
            "text": "One of the important points of discussion is the Global Biodiversity Framework (also known as the Kunming-Montreal Global Biodiversity Framework or the GBF). It was agreed at the previous Biodiversity Summit, COP15, in December 2022. The GBF includes 4 goals and 23 targets, with a central mission of halting and reversing global biodiversity loss by 2030."
        },
        {
            "text": "COP16 is the first opportunity since the GBF was agreed for governments to collectively review progress towards these targets and commitments."
        },
        {
            "text": "30by30 target"
        },
        {
            "text": "Target 3 of the GBF aims to ensure that at least 30% of the Earth’s land and ocean is being effectively conserved and managed by 2030. This is known as the “30by30” target, and it’s vital to achieving the GBF’s mission."
        },
        {
            "text": "I work in the 30by30 on land team at Defra. In my previous blog post, I explained how my team had been working with landowners, land managers and wider stakeholders to develop England’s approach to the vital 30by30 target."
        },
        {
            "text": "The target doesn’t necessarily expect every country to protect 30% of its lands and seas. But, as a leading voice calling for a global 30by30 target, the UK Government committed to deliver this target nationally."
        },
        {
            "text": "Delivering 30by30 on land in England means ensuring that our most important and wildlife-rich habitats are benefiting from effective, long-term conservation and management for nature. Achieving this target is essential to allow nature to recover, while also supporting wider objectives including cleaner rivers, lakes and seas, boosting food security, and protecting communities from the dangers of flooding."
        },
        {
            "text": "I’m delighted that, today, the Government has taken an important step forward, by publishing our vision for 30by30 on land in England and confirming the criteria for land that can count towards the target."
        },
        {
            "text": "This includes confirmation that Sites of Special Scientific Interest will only count towards 30by30 if they are in favourable or recovering condition."
        },
        {
            "text": "The criteria draw on our work with farming groups, conservation organisations and wider partners. Today's announcement should provide a clear foundation for us to focus all our efforts on driving progress and meeting this target."
        },
        {
            "text": "Next steps for 30by30"
        },
        {
            "text": "Work now continues to ensure we meet our target, using the confirmed criteria as our basis, and guided by our ambitious vision."
        },
        {
            "text": "Over the coming weeks, my team will be working with a small number of partners to begin piloting the process for additional land to contribute to 30by30."
        },
        {
            "text": "We’ll also begin developing an ambitious delivery strategy for 30by30 on land in England. This should confirm more detail on how we will achieve this target and will set out our pathway to 2030. We hope to finalise and publish this strategy next year."
        },
        {
            "text": "This work will also help us to develop detailed guidance on how the 30by30 criteria should be interpreted and applied in practice, to provide further clarity for landowners and land managers. We also hope to publish that guidance next year."
        },
        {
            "text": "Across all of this work, we look forward to continuing to work closely with stakeholders and partners across sectors. As our 30by30 vision sets out, achieving this target will require a collaborative approach, and everyone has an important role to play!"
        },
        {
            "text": "We cannot address the nature and climate crises without coordinated global action, so I look forward to following the key updates from COP16.  "
        },
        {
            "text": "We will be issuing a series of posts after COP16 to talk to the outcomes and activities raised at the conference. If you’re interested in hearing about these and more environmental updates, please subscribe to receive an email notification whenever a blog is published."
        }
    ]
}