{
    "url": "https://ruralpayments.blog.gov.uk/2024/10/29/the-regulatory-approach-and-use-of-civil-sanctions-for-the-management-of-hedgerows-england-regulations-2024-public-consultation/",
    "title": "The regulatory approach and use of civil sanctions for the Management of Hedgerows (England) Regulations 2024: public consultation ",
    "authors": [
        "RPA Editor"
    ],
    "categories": [
        "Hedgerows"
    ],
    "pub_date": "2024-10-29T15:22:19+00:00",
    "content": [
        {
            "text": "Have your say on how we implement the new hedgerows regulations. "
        },
        {
            "text": "In May 2024, the Management of Hedgerows (England) Regulations 2024 came into force. The Rural Payments Agency (RPA) has been appointed to act as the Regulator. "
        },
        {
            "text": "We are launching a public consultation today to seek your views on how we propose to approach the implementation of these regulations. The consultation will last for six weeks and will close on 10 December 2024 at 11.45pm."
        },
        {
            "text": "The regulations were introduced to protect hedgerows on agricultural land as they provide essential habitats and act as a wildlife corridor. Our iconic hedgerows also help slow soil erosion and support crop pollinators which benefits the environment and supports farming.  "
        },
        {
            "text": "We want to safeguard these crucial habitats and protect biodiversity through the no cutting period and mandatory buffer strips. You can find more information about the Hedgerow management rules: cutting and trimming and Hedgerow management rules: buffer strips - GOV.UK on GOV.UK. "
        },
        {
            "text": "We are proposing a fair and proportionate regulatory approach when deciding how we implement civil sanctions. We will offer advice and guidance to farmers, land owners and all others covered by the rules to help them to comply but will apply civil and criminal sanctions for more serious breaches.  "
        },
        {
            "text": "This consultation gives you the opportunity to have your say on our approach. Tell us what you think by answering a series of questions in the consultation document on GOV.UK.  Consultation on the regulatory approach and use of civil sanctions for hedgerow management - Defra - Citizen Space"
        },
        {
            "text": "Following the consultation, we will publish a final version of the statutory guidance document and a summary of the consultation responses we receive.  "
        }
    ]
}