{
    "url": "https://grantscommunity.blog.gov.uk/2023/03/07/a-summer-in-government-a-future-career-path-in-mind/",
    "title": "A summer in government. A future career-path in mind",
    "authors": [
        "govtgrantscommunity",
        "alisonlong"
    ],
    "categories": [
        "Civil Service",
        "Find a Grant",
        "Government Communications Service",
        "Government Grants Management Function",
        "Internship",
        "Learning and development",
        "National Careers Week",
        "Spotlight"
    ],
    "pub_date": "2023-03-07T09:30:05+00:00",
    "content": [
        {
            "text": "A keen and fervent passion "
        },
        {
            "text": "I applied for the Government Communications Service Internship as I wanted to gain experience working in a professional environment within the setting of government.  The internship was an ideal opportunity for me to experience this, during the summer, before I started my fourth and final year studying Politics and Sociology at university."
        },
        {
            "text": "I have always had a keen and fervent passion for the mechanisms of government, both locally and nationally, and how decisions are made and policies and legislation implemented. The internship allowed me to get hands-on experience in a real life working setting and find out more about the Civil Service and career options. "
        },
        {
            "text": " "
        },
        {
            "text": "My preconceptions were wrong"
        },
        {
            "text": "I was assigned to the Government Grants Management Function (GGMF) and assumed the function itself would be dealing with and administering the grants. "
        },
        {
            "text": "I thought it would be one department that administered all grants and that it would be a one-stop shop with all information in one place. I was wrong. There are too many grants for one department to manage so different departments administer different schemes. There is a huge variety of grants tackling issues faced by the public and businesses - from insulation and home improvements, winter fuel payments, energy bill relief support for businesses to COVID-19 emergency funding."
        },
        {
            "text": "GGMF itself has a small and multidisciplinary team working to support hundreds of grant administrators across government. The team provides advice and information, develops digital tools to streamline processes and sets the grant administration standards for departments to follow. The team has great connections and knows when to bring in more experts: I sat in on GGMF’s Complex Grants Advice Panel and it was fascinating listening to grants, commercial and legal experts working together to provide analysis and advice to departments managing high-value and complicated grant schemes. "
        },
        {
            "text": "I worked alongside the Find a Grant Programme team in the Glasgow office. This team has built a service that allows individuals, companies and charities - in fact anyone - to apply for grants. The service makes it easier for grant administrators from government departments, agencies and local authorities to advertise schemes in one place. "
        },
        {
            "text": " "
        },
        {
            "text": "What I’ve learnt "
        },
        {
            "text": "I learnt lots about administering grants including:"
        },
        {
            "text": " "
        },
        {
            "text": "Skills to set me up for a future career-path"
        },
        {
            "text": "My main project was to lead on a high-level review of GGMF stakeholder groups. I used the GCS standards and analysis tools to identify appropriate ways to engage stakeholders whilst assessing if the current channels of communication were adequate. "
        },
        {
            "text": "I got to work on the Glasgow Commercial and Grants Network launch. This provided event management experience and I prepared a briefing pack for the GGMF Director who was speaking, wrote social media posts and set up the GGMF market stall so delegates could find out more about the services and support on offer. "
        },
        {
            "text": "As a Government Communications Service intern, I attended an induction event and met interns in my cohort and from previous cohorts who had progressed into permanent government communications roles. I also took part in a communications planning seminar and Parliament tour. "
        },
        {
            "text": "The internship meant I have been able to network and make connections with various people within GGMF and the Government Communications Service. But, more importantly, I worked locally in the Glasgow office and learnt about other areas of the Cabinet Office through the teams based there. "
        },
        {
            "text": " "
        },
        {
            "text": "What now?"
        },
        {
            "text": "My time in GGMF has been highly influential in my look to the future after university and a massive steer in how I want my career to move forward. The willingness of the GGMF team to provide me with all their knowledge has been paramount in providing me with all I needed to be successful in my role as a communications intern."
        },
        {
            "text": "As I focus on getting my degree, I am also focused on what is really out there in the world of work for me - thanks to this experience.  "
        }
    ]
}