{
    "url": "https://prisonjobs.blog.gov.uk/2023/03/07/being-a-prison-officer-isnt-just-a-mans-job/",
    "title": "\"Being a prison officer isn't just a man's job\"",
    "authors": [
        "Ministry of Justice"
    ],
    "categories": [
        "Career progression",
        "Personal stories",
        "Prison officer"
    ],
    "pub_date": "2023-03-07T12:31:01+00:00",
    "content": [
        {
            "heading": 2,
            "text": "What’s it like as a woman working in a prison?"
        },
        {
            "heading": 3,
            "text": " This International Women’s Day, we caught up with 23 year officer Tonkin who’s been a prison officer for the past 5 years. Here’s what she had to say about her role and what she enjoys about it."
        },
        {
            "text": "I decided to become a prison officer because of how much of an active role it is. For me, I didn’t want to be sat doing a 9 to 5 office job."
        },
        {
            "text": "When I first joined the Prison Service, I was just 18 years old so I used to worry about my gender and being so young. But I get a lot of respect."
        },
        {
            "text": "I think a lot of people have the impression that being a prison officer is a man’s job, but it really isn’t. I’m 5ft 5 inches, about 10.5 stone and I have no problem walking around the landings and talking to prisoners. I’ve been working in a men’s prison for the last year."
        },
        {
            "text": "Day-to-day life as a prison officer"
        },
        {
            "text": "Just because women tend to be smaller, it really does not make a difference to the day-to-day job. I also think being a woman can help to diffuse some situations. I’m part of a specialist team that responds when there are challenging situations in the prison. Although these are rare, it shows that being female doesn’t disadvantage you."
        },
        {
            "text": "Having a good sense of humour and good communication skills will get you through anything in this job."
        },
        {
            "text": "Development and progression opportunities "
        },
        {
            "text": "Becoming a prison officer is the best thing I have done and there are loads of opportunities to develop. I have been training to become a Control and Restraint (C&R) Instructor to teach new and existing staff C&R techniques. And, I’ve had a lot of support from management progression-wise. When a position becomes available, I’m moving up to be a supervising officer."
        },
        {
            "text": "I have made some really good friends in the Prison Service, and my colleagues have become like a big family."
        },
        {
            "text": "Working in a prison is really not as scary as you may think! If you’re thinking of applying, I’d say ‘go for it’, it’s a very rewarding job."
        }
    ]
}