{
    "url": "https://environmentagency.blog.gov.uk/2023/03/07/celebrating-environment-agency-science/",
    "title": "Celebrating Environment Agency science",
    "authors": [
        "Dr Robert Bradburne"
    ],
    "categories": [
        "Uncategorized"
    ],
    "pub_date": "2023-03-07T09:23:34+00:00",
    "content": [
        {
            "text": "Today I am delighted to launch the Chief Scientist’s annual review of 2022, celebrating the fantastic work of scientists across the Environment Agency."
        },
        {
            "text": "There are over 1200 members of the science profession in our organisation, with the numbers still rising.  Their passion and professionalism ensures we have access to the highest levels of science, evidence and analysis to underpin so much of what we do. Science enables the Environment Agency to deliver effectively and evaluate that delivery. Science also enables us to look ahead at how we might address our longer-term ambitions set out in the Environment Agency’s five-year action plan (EA2025), and the government’s Environmental Improvement Plan."
        },
        {
            "text": "The annual review is structured around a series of case studies that showcase the role of science and evaluation across the Environment Agency’s remit.  To give a flavour of the breadth of work covered in 2022, among the case studies highlighted in the review are:"
        },
        {
            "text": "The review also has a strong people focus, highlighting the work we’re doing to attract and develop the current and next generation of scientists. This includes working closely with UK Research Councils to shape and deliver research fellowships, as well as growing our summer work placements for academic interns.  We also have an active PhD programme, with students working on a wide range of research areas, from studying antibiotic resistance and persistent chemicals in the environment to analysing satellite data and future rainfall patterns."
        },
        {
            "text": "Whilst this annual review focusses on what we’ve done over the last 12 months, we’re always looking to the future to ensure that we have the right people, skills and knowledge in order rise to the challenge of meeting our ambitious agenda in the face of continuing environmental change. I recognise that the Environment Agency cannot provide all of this evidence alone, so later this year we will be publishing our longer-term strategic approach to science.  This will set out the broad areas of scientific interest to us and highlight our unique scientific capabilities. I hope this will provide an encouragement to many of you to work with the Environment Agency more closely in future to produce vital science and evidence that will help us create better places for people, wildlife and the environment."
        }
    ]
}