{
    "url": "https://dwpdigital.blog.gov.uk/2023/03/07/embracing-equity-at-dwp-digital-this-international-womens-day/",
    "title": "Embracing Equity at DWP Digital this International Women’s Day",
    "authors": [
        "DWP Digital"
    ],
    "categories": [
        "Diversity",
        "Women in Digital",
        "Women in Technology"
    ],
    "pub_date": "2023-03-07T09:00:54+00:00",
    "content": [
        {
            "text": "March 8th marks International Women’s Day, and this year's theme is about embracing equity. The theme focuses on celebrating women's achievements, raising awareness of discrimination and taking action to drive gender parity.  "
        },
        {
            "text": "Throughout the month of March, we’ll be celebrating our colleagues, championing allyship, and holding a range of events to explore this year’s theme.  "
        },
        {
            "heading": 2,
            "text": "Championing women in tech "
        },
        {
            "text": "This International Women’s Day, the mission is to elevate and advance gender parity in technology and celebrate the women forging innovation. At DWP Digital almost 35% of the workforce are women. Compared to the tech sector in general, which is at just 27%, that's a big difference. "
        },
        {
            "text": "Research shows that women rate company culture as number one when looking for a job in tech. DWP’s dedicated Women’s Network provides a community of support for women working across the organisation. Alongside the network, our Women in Digital forum helps women reach their ambitions in digital professions, builds their confidence, and celebrates their achievements so they can inspire others to do the same."
        },
        {
            "text": "Within the Digital Group, we have a range of activities and programme to support women including the Digital Voices Programme, providing women colleagues with the opportunity to build confidence as digital leaders and meet a support network of women in similar technical roles.  "
        },
        {
            "text": "We’re passionate about the work we do to encourage gender parity across the organisation and are proud to be closing the gender gap across DWP Digital. Over the last 5 years, we’ve had an increase in job applications from women across the organisation, with the representation of women at Senior Civil Servant level increasing from 39% to 50%. "
        },
        {
            "text": " We have done great things in increasing our gender balance and are working hard to attract and retain women from different backgrounds.  12% of our women are from an ethnic minority, 6% are LGBT and 14% are disabled.\n"
        },
        {
            "heading": 2,
            "text": "What more can be done to encourage more women in tech? "
        },
        {
            "text": "Encouraging women to consider a career in tech has proven difficult in the past. In the UK, statistics show the number of women who worked in tech in 2015 stood at just 17%. Although this has improved in recent years there are still technical roles that struggle with gender parity. At present, only 16.5% of engineers are women in the UK. But in August 2022, 40% of our new engineering recruits were women, and in September this reached 42.86%.  "
        },
        {
            "text": "We are currently recruiting infrastructure engineers. Visit our careers site to find out more.  "
        }
    ]
}