{
    "url": "https://mhclgdigital.blog.gov.uk/2023/03/07/future-councils-meet-our-8-pilot-councils/",
    "title": "Future Councils: Meet our 8 pilot councils",
    "authors": [
        "The Local Digital team"
    ],
    "categories": [
        "Future Councils",
        "Local Digital Team"
    ],
    "pub_date": "2023-03-07T10:03:56+00:00",
    "content": [
        {
            "text": "We are delighted to announce the councils that will be taking part in the pilot of Future Councils - a new programme to support local authorities across England to become modern and resilient."
        },
        {
            "text": "During the pilot phase, we are funding 8 councils to make digital and cyber improvements across their organisations, reform key services, and influence organisation-wide factors that can unblock change."
        },
        {
            "text": "The pilot will run for six months, and we plan to offer further opportunities for local authorities to join Future Councils later in 2023."
        },
        {
            "text": "You can read more about the programme, and why we decided on this approach, in a blog post coinciding with the launch of Future Councils in October 2022."
        },
        {
            "heading": 2,
            "text": "The successful councils and how we chose them"
        },
        {
            "text": "The 8 councils taking part in the pilot are:"
        },
        {
            "text": "We received 70 applications from councils across England. Following scoring and moderation, we invited the 12 councils with the highest scores to an interview, to help us better understand their applications and suitability for the pilot. "
        },
        {
            "text": "The 8 final councils were chosen because they were able to demonstrate:"
        },
        {
            "heading": 2,
            "text": "What we learnt from the applications"
        },
        {
            "text": "After reviewing the applications, we undertook some high-level thematic analysis to get a sense of where the sector is in terms of digital and cyber transformation. These are some of the top-level themes that emerged from the applications:"
        },
        {
            "heading": 3,
            "text": "Adult social care"
        },
        {
            "text": "Many applications demonstrated either an interest in, or ideas for how, digital and cyber transformation can support the reform of Adult Social Care. In particular, councils mentioned wanting to ensure that data informs decision-making, and understanding how internal processes could be re-designed to become more efficient and user-centred."
        },
        {
            "heading": 3,
            "text": "Robotic Processing Automation"
        },
        {
            "text": "While we anticipated seeing councils’ utilising automation and AI, the widespread use of Robotic Processing Automation across applicants was unexpected. We’re interested to understand how different councils are using this and where its limitations are."
        },
        {
            "heading": 3,
            "text": "Cloud-based solutions"
        },
        {
            "text": "Given that one of the focuses of the pilot is migrating services away from legacy technology, it was perhaps unsurprising that modern cloud-based solutions were mentioned in many applications. Some councils highlighted the opportunities to re-architect or modernise solutions during the move to the cloud, as well as ensure integrity, availability and security and embed cloud-based security principles across the councils’ IT estate."
        },
        {
            "heading": 3,
            "text": "Building capacity"
        },
        {
            "text": "The diverse range of capability building needs was one thing that stood out from the applications. Some councils were already looking for or using more advanced or technical expertise such as automation or secure by design. Others wanted to embed or strengthen fundamental skills, such as user-centred design, cyber awareness and agile working. "
        },
        {
            "text": "During the pilot, we will work with councils to better understand how we can support the range of capability development across the sector."
        },
        {
            "heading": 2,
            "text": "What made a good application"
        },
        {
            "text": "As part of the Future Councils programme, we want to support improvement projects across five themes:"
        },
        {
            "text": "On the application form, we asked councils to provide examples of any activities they were already undertaking that aligned to these themes. "
        },
        {
            "text": "The strongest applications provided fewer examples with clearer connections to the outcomes and learnings connected to each theme."
        },
        {
            "text": "We also asked applicants to describe their strengths, challenges and opportunities. Many applications struggled to clearly set out the challenges within the organisation, beyond needing more resource. Given that the focus of the pilot is to explore how to influence the organisation-wide factors (such as internal processes, leadership and governance) that can unblock change, the case for piloting with those councils felt less strong. "
        },
        {
            "text": "The strongest applicants set out clear examples of how their strengths were relevant to the pilot, and were honest about any challenges they anticipated. They also outlined potential routes to overcoming challenges that could be explored through the pilot, or where they had gaps that they’d like support to find the answers collaboratively."
        },
        {
            "heading": 2,
            "text": "What the councils will be working on during the pilot"
        },
        {
            "text": "We expect our 8 councils to deliver a range of cyber and digital projects across their organisation. All partner councils will:"
        },
        {
            "text": "Beyond the pilot phase, we plan to partner with a broader group of councils to deliver replicable pathways to digital and cyber security reform that others can follow."
        },
        {
            "heading": 2,
            "text": "How to follow the pilot"
        },
        {
            "text": "The Future Councils pilot will start this month and we will share regular progress updates over the course of the pilot, as well as information about the wider rollout, so make sure to follow all our usual channels:"
        }
    ]
}