{
    "url": "https://digitaltrade.blog.gov.uk/2023/03/07/how-dit-evolved-the-capability-framework-to-better-support-career-progression-for-user-researchers/",
    "title": "How DIT evolved the capability framework to better support career progression for User Researchers",
    "authors": [
        "Jonathan Nicholls, Head of User Research",
        "Joanne Granton, Capability Lead"
    ],
    "categories": [
        "Professions"
    ],
    "pub_date": "2023-03-07T11:22:43+00:00",
    "content": [
        {
            "text": "The initiative described in this blog was undertaken by DIT.  Readers should be aware that following a government announcement about changes to some civil service departments, DIT has become the new Department for Business and Trade."
        },
        {
            "text": "Career development, and a clear career development plan, are some of the most important things we can offer to our teams. For team members, it shows our commitment to – and investment in – their progression. For the business, it helps develop a highly skilled workforce, and supports retention. This ensures we develop staff with a deep knowledge of the department’s strategy. These are all reasons why DIT is supporting building a stronger career development culture across Digital Data and Technology (DDaT). This blog outlines some of the things we have been doing in this space in the User Research (UR) Community."
        },
        {
            "text": "One of the most valuable assets supporting career progression for digital professions in government has been the DDaT Capability Framework.  This was produced by the Government Digital Service (GDS) and has more recently been taken over by the Central Digital and Data Office (CDDO). It describes all the different job roles in the DDaT profession, and specifies the skills and capabilities needed for each role.  What makes it important for career progression is that it defines how those skills need to develop as DDaT professionals progress through their career."
        },
        {
            "heading": 2,
            "text": "The Capability Framework at DIT"
        },
        {
            "text": "The Capability Framework was established some years back. At DIT we’ve been keen to keep it under review to make sure it continues to support DDaT career development effectively. So in 2022, DDaT Heads of Profession were asked to look at their frameworks to consider whether they needed refreshing."
        },
        {
            "text": "One of these blogs authors, Jonathan Nicholls, was already aware there were some issues that would be good to look at from a User Research perspective. In his previous role as cross-government Head of UR at GDS, he led a review of the UR framework to look at how well it supported UR development. Jonathan had invaluable support from a cross-government working group of Heads and UR colleagues."
        },
        {
            "text": "So, when we looked at the UR framework in DIT, we decided to focus on two specific issues that had been identified."
        },
        {
            "heading": 2,
            "text": "The issues we wanted to address"
        },
        {
            "text": "The first issue was that the original UR capability framework focused extensively on the craft skills of being a good user researcher. These are the methodological and analytic skills a researcher needs and the knowledge they need about the interaction between individuals and technology."
        },
        {
            "text": "However, the framework placed much less emphasis on the capabilities that user researchers need to be successful particularly in more senior roles.  This included skills like:"
        },
        {
            "text": "This sometimes led to difficult development conversations, particularly around Senior Researcher level. If a Senior Researcher had ticked all the boxes on the old UR capability framework, they felt this signalled they were ready for promotion into Lead roles. Often they were, but not always. Some Senior Researchers were strong on all the craft skills in the framework, but lacked the research leadership and stakeholder management skills needed in a Lead. Then, the researcher could understandably feel aggrieved when they were told they weren’t ready for promotion."
        },
        {
            "text": "At DIT, we felt it was important to include these research leadership and stakeholder management skills in our development conversations as people approached more senior roles. Accordingly, we have built these skills into our refresh of the UR capability framework."
        },
        {
            "text": "The second issue we wanted to look at was that user-centred and agile practice were presented as a single capability in the old UR capability framework. However, these two different skills sets are both central to the user researcher role in a multidisciplinary team, and sometimes there can be a tension between the two. Combining them into a single capability seemed to underplay the importance of both."
        },
        {
            "heading": 2,
            "text": "How we developed the capability framework"
        },
        {
            "text": "This analysis of the challenges led us to make several changes to the DIT capability framework. These include:"
        },
        {
            "text": "We also developed definitions for each of these new capabilities, and defined how these skills should develop (from awareness to working, to practitioner, to expert)."
        },
        {
            "heading": 2,
            "text": "The benefits this is delivering"
        },
        {
            "text": "It is still early days, but already it seems like it’s been a helpful move. First, it means we can talk about a fuller range of the skills needed to be a successful researcher in development conversations, particularly for more senior roles. This means we can really think through the development areas that are going to be helpful for a researcher. It still has the craft skills of conducting research, but now includes the leadership and stakeholder skills that help our user research have greater influence and impact in the department."
        },
        {
            "text": "A second benefit is that it’s making us think much more about how we develop these skills and capabilities in our more junior staff. We wouldn’t expect our newly recruited junior researchers to manage challenging, complex stakeholder relationships for instance. But what skills do we want them to develop? What could set them up for stakeholder success in their later career? Similarly, junior researchers won’t be quality assuring a team’s user research output. But what should we be asking them to do in their early career roles to build their understanding of what good research looks like? Should this include reflection on their own practice and peer crits for example? Even though these new capabilities are particularly relevant for more senior roles, they encourage us to think about skills development across the whole career path."
        },
        {
            "text": "Creating separate capabilities for user-centred and agile working also raises the bar on both these ways of working. There is now a clearer ask on user researchers not just to adopt user-centred practices, but to advocate on our user’s behalf. There is equally a clear expectation to do this in a way that aligns with agile project timelines and to demonstrate how research supports agile product delivery. Importantly, this encourages researchers to think more about how they incorporate both user advocacy and agile delivery into the way they work."
        },
        {
            "heading": 2,
            "text": "Final thoughts"
        },
        {
            "text": "There are a range of questions we would still like to look at going forward. Do we need to get more specific in defining the methodological skills URs need? Do we want to give people the opportunity to progress either into managerial roles or specialist researcher roles? We are also starting to look at the question of how to provide the training and development across researchers’ careers to help them build the breadth of research skills they need."
        },
        {
            "text": "But for now, we are clarifying the skills needed for research management and leadership, and helping researchers reflect more explicitly on the challenges of user advocacy while supporting agile delivery. It allows us to start focusing on developing those skills right from the outset of someone’s UR career. This can only strengthen the capability and influence of the UR profession over time."
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        }
    ]
}