{
    "url": "https://teaching.blog.gov.uk/2023/03/07/improving-wellbeing-support-through-senior-mental-health-lead-training/",
    "title": "Improving wellbeing support through senior mental health lead training",
    "authors": [
        "Karen Marsh"
    ],
    "categories": [
        "Pupil wellbeing and behaviour",
        "Teacher mental health",
        "Teacher wellbeing"
    ],
    "pub_date": "2023-03-07T15:38:19+00:00",
    "content": [
        {
            "text": "Karen Marsh is the mental health lead at Southport College. She tells us about her college’s experience of senior mental health lead training and how it’s helped to further support its staff and students with their wellbeing."
        },
        {
            "text": "Southport College and KGV Sixth Form College have always offered excellent support to students who may be experiencing mental health difficulties. When the opportunity arose to appoint a senior mental health lead to complete a specialist course and embed a whole college approach, it felt like a fantastic opportunity to improve on the good work already taking place."
        },
        {
            "text": "Selecting the right course for our setting"
        },
        {
            "text": "The Department for Education offers a helpful tool to identify the most appropriate course level for our setting, taking into account our mental health lead’s current role and their experience. We selected an intermediate level course delivered through a mixture of online live learning, forum discussions, 1;1 and group coaching sessions and a conference. This gave enough flexibility and capacity for our staff lead to complete the course, while focussing on their day-to-day role."
        },
        {
            "text": "The course covered:"
        },
        {
            "text": "All of which are hugely important to our whole college approach."
        },
        {
            "text": "Supporting staff and student mental health"
        },
        {
            "text": "Following the pandemic, we have seen an increase in students presenting with low mood, anxiety, suicidal ideation, eating disorders and complex mental health issues. Therefore, having a workforce of staff confident and equipped to support these young people’s mental health and wellbeing so that they are able to access learning is vital and support from senior leaders was also a key factor in embedding a whole college approach."
        },
        {
            "text": "We also used the Charlie Waller CMET mental health self-assessment tool and were able to pull together a working group of cross college leaders to consider things like our curriculum, student voice, and support for staff and students. We regularly update this document which helps us map our ongoing journey."
        },
        {
            "text": "We have also signed up to be an Association of College’s (AoC) Mental Health and Wellbeing Charter which re-affirmed our commitment to student and staff mental health and wellbeing.  This includes commitments to promote equality of opportunity and challenge mental health stigma, provide mental health training for staff, and offer targeted individual mental health support where appropriate. We proudly display our Mental Health Charter in our reception areas and enjoyed a wonderful day celebrating the signing of the Charter with our CEO Michell Brabner, Richard Caulfield, AoC’s National Mental Health Lead, and our students."
        },
        {
            "text": "Our new internal mental health policy and procedure also covers referral networks and identifies key members of staff with specialist responsibilities around mental health. This prescriptive guide helps ensure that every member of staff is clear on how to support student mental health, including what to do, who to speak to and when."
        },
        {
            "text": "Through a comprehensive programme of targeted staff development delivered by our newly established mental health support team, staff we have also been able to access training on Vicarious Trauma, Supporting Anxious Learners and Psychoeducation. We also have staff wellbeing days, where staff have access to activities like acupuncture and meditation, as well as opportunities to spend informal time with colleagues."
        },
        {
            "text": "Enrichment activities"
        },
        {
            "text": "There has also been a significant investment in our enrichment programme with all students soon being able to access resilience courses and other sporting activities to promote wellbeing in a supportive environment. We know from listening to our student voice that social anxiety and exam stress are barriers to learning, so being able to access physical education not only as part of the curriculum but as part of co- curricular workshops is essential."
        },
        {
            "text": "Overall, the senior mental health lead course was well worth doing, it considered different aspects of how to embed good practice across our college and most importantly will lead to better support and outcomes for our learners and staff."
        },
        {
            "text": "Like all education, it will evolve. And we have a clear commitment to continue to develop our approach."
        },
        {
            "text": " "
        },
        {
            "text": "Find out more about mental health and wellbeing support for your school or college"
        },
        {
            "text": "Head to gov.uk for more detail on mental health and wellbeing support, including the Senior Mental Health Lead training."
        },
        {
            "text": "Find out more about the Department for Education's Education Staff Wellbeing Charter which sets out shared commitments to promote, protect and enhance the wellbeing of staff"
        }
    ]
}