{
    "url": "https://naturalengland.blog.gov.uk/2023/03/07/international-womens-day-2023-embraceequity/",
    "title": "International Women’s Day 2023 #EmbraceEquity",
    "authors": [
        "Natural England"
    ],
    "categories": [
        "Uncategorized"
    ],
    "pub_date": "2023-03-07T11:04:06+00:00",
    "content": [
        {
            "text": "Teenage girls, compared to their male peers, are one of the groups who tend not to use greenspaces as much, and they experience a significant decrease in physical activity and connection to nature compared to younger children and boys their own age."
        },
        {
            "text": "Natural England’s purpose includes promoting access to the countryside and open spaces and encouraging open-air recreation, and our additional duties from the Equality Act 2010 means that we do that inclusively. Data from Natural England’s Monitor of Engagement with the Natural Environment (MENE) and People And Nature Survey (PANS) and other sources show that women and men have different access to and experience of the outdoors and there are particular groups of women that are less likely to be active outdoors than average."
        },
        {
            "text": "The physical and mental health benefits of regularly getting active outside in green and natural spaces are well documented. As well as the benefits associated with any physical activity, getting active in green places can reduce stress and anxiety levels, improve concentration and focus, improve mood, and support better sleep. And as you might expect, not getting active outdoors has the opposite effect, increased stress and anxiety, reduced concentration and focus, poorer mood, and worse sleep. The UN theme for International Women’s Day 2023 #EmbraceEquity reminds us to consider if there is more work needed to ensure that the outdoors is welcoming to all women. Whilst women in England have equal rights to get outdoors, something which is not the case worldwide, there are other barriers such as not feeling safe in some places, or at some times of the day, or a lack of facilities for activities that women and girls want to do. Women and girls are taught to avoid possible dangers, and that can also result in them avoiding the outdoors."
        },
        {
            "text": "We wanted to know more about what could be done to help teenage girls to get outdoors, so last year we supported the Greenspace and Us partnership project in Oxford. The project included surveys of local teenagers and then throughout March and early April 2022, a group of up to 20 young women between the ages of 10 and 16, participated in a series of exploratory workshops and local visits to greenspaces. The girls observed that environmental activities and facilities are largely targeted at primary age kids, and activity spaces were dominated by boys and men. They want activities and facilities that they could use too, they want some independence from adults, but they also want to be supported and made welcome. Their key points were summarised in a manifesto:"
        },
        {
            "text": "To start the change, the girls designed their own shelter which was made and installed this year with the ongoing support of the project partners. We are really grateful to all the project partners, Oxfordshire County Council, Oxford City Council, The University of Oxford, Oxford Youth Enterprise: Name It Project, Fig, CommonBooks, Toffee Hammer Carpentry and designers at RESOLVE Collective, and of course to the girls themselves, for all their inputs and enthusiasm throughout the project."
        },
        {
            "text": "We are pleased that the girls’ group is also continuing its fantastic work and taking the project onto the next phase, and the partnership that supported this project is also continuing to look at and address barriers to people getting active outdoors. The project team is keen to share our findings from the project, the full evidence report on the Greenspace and Us project is now published if you wish to find out more. Images and information are also available here https://fig.studio/projects/greenspace/"
        },
        {
            "text": "--"
        },
        {
            "text": "Written by Pippa Langford, "
        },
        {
            "text": "Principal Specialist, Recreation & Access at Natural England "
        }
    ]
}