{
    "url": "https://governmentscienceandengineering.blog.gov.uk/2023/03/07/privacy-notice-government-science-and-engineering-profession/",
    "title": "Privacy Notice: Government Science and Engineering Profession",
    "authors": [
        "gseprofession"
    ],
    "categories": [
        "Blog Series"
    ],
    "pub_date": "2023-03-07T11:03:27+00:00",
    "content": [
        {
            "heading": 3,
            "text": "Date of Privacy Notice: February 2023 "
        },
        {
            "text": "This privacy notice sets out how we will use your personal data, and your rights. It is made under Articles 13 and/or 14 of the UK General Data Protection Regulation (UK GDPR). "
        },
        {
            "text": "This notice can be updated at any time and we will inform you if this occurs. "
        },
        {
            "text": "It is important that you read this notice, so that you are aware of how and why we are processing your information. "
        },
        {
            "text": "The Government Office for Science is the Data Controller for the use of personal data in this privacy notice. "
        },
        {
            "heading": 3,
            "text": "Why we are collecting your information "
        },
        {
            "heading": 3,
            "text": "Your information is collected by: "
        },
        {
            "text": "The Government Science and Engineering Team "
        },
        {
            "text": "Contact E-mail: GSE@Go-Science.gov.uk  "
        },
        {
            "text": "The type of personal information we collect  "
        },
        {
            "text": "We collect and process the following information:  "
        },
        {
            "heading": 3,
            "text": "How we get the personal information and what we use it for "
        },
        {
            "text": "We get your information: "
        },
        {
            "text": "We use the information that you have given us to: "
        },
        {
            "heading": 3,
            "text": "Lawful basis for processing "
        },
        {
            "text": "Under the UK General Data Protection Regulation (UK GDPR), the lawful basis we rely on for processing your information is:  "
        },
        {
            "text": "A) Your explicit consent – by providing your personal information you consent to us processing it."
        },
        {
            "text": "B) We need it to perform a public task in the exercise of official authority vested in the data controller. In this case, that the Government Office for Science is responsible for the operation, management and monitoring of Government Science and Engineering Profession members and your data is required to enable Government Office for Science to carry out this task."
        },
        {
            "text": "Sensitive personal data is personal data revealing racial or ethnic origin, political opinions, religious or philosophical beliefs, or trade union membership, and the processing of genetic data, biometric data for the purpose of uniquely identifying a natural person, data concerning health or data concerning a natural person’s sex life or sexual orientation."
        },
        {
            "text": "The legal basis for processing your sensitive personal data is necessary for:"
        },
        {
            "text": "The Government Office for Science is responsible for the operation, management and monitoring of Government Science and Engineering and requires your information at the centre to monitor and report on equality and diversity across this profession."
        },
        {
            "heading": 3,
            "text": "How we store, share and securely destroy your personal information  "
        },
        {
            "text": "Your information is securely stored on BEIS IT (Information Technology) infrastructure, in accordance with government security policies and frameworks.  "
        },
        {
            "text": "Your information will be shared with: "
        },
        {
            "text": "We will not share or transfer to other third parties unless: "
        },
        {
            "text": "Your personal information will be retained for no longer than is necessary for the purpose for which it was collected and will be securely destroyed 5 calendar years after the activity is closed or concluded.  "
        },
        {
            "text": "Your personal data will be retained for the duration that you are a member of the profession and retained for a further 5 years, before being securely destroyed, to allow for trend analysis over a period of time.  "
        },
        {
            "heading": 3,
            "text": "Your data protection rights "
        },
        {
            "text": "Under data protection law, you have rights including: "
        },
        {
            "text": "Your right of access - You have the right to ask us for copies of your personal information.  "
        },
        {
            "text": "Your right to rectification - You have the right to ask us to rectify personal information you think is inaccurate. You also have the right to ask us to complete information you think is incomplete. You have the right to ask us to delete any information that is not necessary for our outlined purpose. "
        },
        {
            "text": "Your right to erasure - You have the right to ask us to erase your personal information in certain circumstances.  "
        },
        {
            "text": "Your right to restriction of processing - You have the right to ask us to restrict the processing of your personal information in certain circumstances.  "
        },
        {
            "text": "Your right to object to processing - You have the the right to object to the processing of your personal information in certain circumstances. "
        },
        {
            "text": "Your right to data portability - You have the right to ask that we transfer the personal information you gave us to another organisation, or to you, in certain circumstances. "
        },
        {
            "text": "You have the right to withdraw consent to the processing of your personal data at any time. "
        },
        {
            "text": "You have the right to request a copy of any personal data you have provided, and for this to be provided in a structured, commonly used and machine-readable format. "
        },
        {
            "text": "You are not required to pay any charge for exercising your rights.  "
        },
        {
            "heading": 3,
            "text": "Contact details - How to get in touch "
        },
        {
            "text": "If you have any concerns about our use of your personal information, you can contact us at: "
        },
        {
            "text": "Data Protection Team "
        },
        {
            "text": "Government Office for Science  "
        },
        {
            "text": "8th Floor "
        },
        {
            "text": "10 Victoria Street "
        },
        {
            "text": "London  "
        },
        {
            "text": "SW1H 0NN "
        },
        {
            "text": "Email: contact@go-science.gov.uk "
        },
        {
            "heading": 3,
            "text": "Complaints "
        },
        {
            "text": "You can also complain to the ICO (Information Commissioner) if you are unhappy with how we have used your data. "
        },
        {
            "text": "The ICO’s address:             "
        },
        {
            "text": "Information Commissioner’s Office "
        },
        {
            "text": "Wycliffe House "
        },
        {
            "text": "Water Lane "
        },
        {
            "text": "Wilmslow "
        },
        {
            "text": "Cheshire "
        },
        {
            "text": "SK9 5AF "
        },
        {
            "text": "Helpline number: 0303 123 1113 "
        },
        {
            "text": "ICO website: https://www.ico.org.uk "
        }
    ]
}