{
    "url": "https://companieshouse.blog.gov.uk/2023/03/07/register-of-overseas-entities-the-story-so-far/",
    "title": "Register of Overseas Entities: the story so far",
    "authors": [
        "Rachael Watts - Companies House (ROE implementation lead)"
    ],
    "categories": [
        "Companies House transformation",
        "Legislative reform",
        "Register of Overseas Entities"
    ],
    "pub_date": "2023-03-07T11:59:47+00:00",
    "content": [
        {
            "text": "It’s been just over a year since the Economic Crime (Transparency and Enforcement) Act was introduced in Parliament and it’s been an incredibly busy year for us at Companies House."
        },
        {
            "text": "The Register of Overseas Entities came into force on 1 August 2022 following the rapid passage of the legislation through Parliament because of the Russian invasion of Ukraine."
        },
        {
            "text": "The new register forms a key part of the government’s strategy to tackle global economic crime. It requires overseas entities that own UK property or land to declare their beneficial owners or managing officers. Overseas entities cannot buy, sell, transfer or lease land, or create a charge against the land in the UK unless they’ve registered with Companies House."
        },
        {
            "text": "Overseas entities in scope who already owned property or land in the UK needed to register within a 6-month transition period, by 31 January 2023."
        },
        {
            "heading": 2,
            "text": "The scale of the challenge for Companies House"
        },
        {
            "text": "Because of the urgency of the legislation, we needed to launch the register in a matter of months. The policy intent behind the register had been consulted on previously, but none of the development work had taken place. This meant we had a lot of work to do in a short space of time."
        },
        {
            "text": "I’m proud to say that we developed, built and launched the Register of Overseas Entities in 109 working days."
        },
        {
            "text": "I feel very privileged to have had the opportunity to lead this incredibly important piece of work. I’ve worked at Companies House for many years, in a range of different areas across the organisation and experienced multiple large-scale changes. I’m passionate about the value we bring to the UK economy and how we can keep improving what we do. The people-focused culture at Companies House has allowed me to learn new things, get out of my comfort zone and broaden my horizons, and I’ll always be grateful for that."
        },
        {
            "text": "Leading the implementation of the Register of Overseas Entities has been my biggest and most rewarding challenge yet. So, how did we make it happen?"
        },
        {
            "heading": 2,
            "text": "Launching the Register of Overseas Entities "
        },
        {
            "text": "This was a hugely complex piece of work, which needed expertise and input from right across the organisation. We were committed to delivering an entirely digital service, which meant we needed to build the register and all its component parts from scratch. We also needed to develop new operational processes and make sure the data on the register was easily searchable and available to the public."
        },
        {
            "text": "We worked extensively with cross-government partners and key stakeholders. We built new relationships with the UK land registries and HMRC to share data and to make sure our new processes worked seamlessly with theirs. We worked closely with our colleagues at BEIS/DBT  to make sure the register and our policies and processes met the legislative intent."
        },
        {
            "text": "Under the new legislation, UK-regulated agents supervised under the Money Laundering, Terrorist Financing and Transfer of Funds Regulations 2017 must complete verification checks on all beneficial owners and managing officers before they can be registered. It was important that we engaged with this audience group to make sure they understood the scope of their responsibilities and received timely answers to any concerns or queries."
        },
        {
            "text": "We embarked on a robust stakeholder engagement programme including roundtables, forums, conferences, webinars and individual discussions. As well as engaging with UK-based stakeholders, we also worked with stakeholders in other jurisdictions such as Jersey, the Isle of Man and the British Virgin Islands."
        },
        {
            "text": "We did not leave any stone unturned in making sure the need to register was as widely known as possible before the end of the transition period - and beyond."
        },
        {
            "heading": 2,
            "text": "The outcome so far "
        },
        {
            "text": "As you can see from the video, we’ve achieved a lot together so far."
        },
        {
            "text": "More than 26,000 overseas entities have registered to date, and law enforcement organisations, journalists and the general public can now access this data on our Find and update company information service. Until the launch of the new register, that information would not have been available. There have already been more than 220,000 searches of the data, which shows the register is meeting the policy intent of increasing transparency about who owns UK property and land."
        },
        {
            "text": "We’re already seeing reports about the data on the new register in the media, and we welcome the scrutiny of the information on the register."
        },
        {
            "heading": 2,
            "text": "Next steps "
        },
        {
            "text": "We’re not complacent, and our work on the Register of Overseas Entities does not stop now that the transition period has come to an end. Restrictions have already been placed on land titles, which means those that have not complied cannot freely lease, charge or dispose of their land. This is a significant and effective sanction for non-compliance."
        },
        {
            "text": "We’re also writing to those who have not yet registered to remind them what the consequences are if they do not comply. Those who continue to fail to register may also be subject to financial penalties or criminal prosecution."
        },
        {
            "text": "Overseas entities will need to update their information on the register every year, so we’re currently building the digital functionality for them to be able to do that. We’re also working on an email reminder service to make sure overseas entities are given plenty of notice before they need to file their annual update."
        },
        {
            "text": "As the Economic Crime and Corporate Transparency Bill moves through Parliament, we’re also mapping out how the measures in the Bill will apply to the Register of Overseas Entities."
        },
        {
            "text": "More than 140 Companies House colleagues worked on delivering the new register, and it’s been amazing to see everyone collaborating to achieve this significant milestone."
        },
        {
            "text": "This is a brilliant example of how Companies House colleagues seized an opportunity to deliver changes that will make a real-world difference, and I'm so proud to have led the successful delivery of the Register of Overseas Entities. I’m looking forward to building on this success, helping to drive confidence in the UK economy."
        }
    ]
}