{
    "url": "https://mhclgdigital.blog.gov.uk/2023/03/07/round-6-projects-announced/",
    "title": "Transforming digital services for councils through our Round 6 projects ",
    "authors": [
        "The Local Digital team"
    ],
    "categories": [
        "Local Digital",
        "Local Digital Fund"
    ],
    "pub_date": "2023-03-07T10:07:11+00:00",
    "content": [
        {
            "text": "We’re pleased to announce the 17 council-led digital projects that will be awarded funding through Round 6 of the Local Digital Fund. "
        },
        {
            "text": "The projects were carefully selected from 50 applications representing 118 councils between 13 October and 24 November 2022. They join the 44 collaborative projects we have already funded since the Local Digital Fund launched in 2018 and bring the total funding we have awarded to over £16 million."
        },
        {
            "heading": 2,
            "text": "Our ambition for the Round 6 projects"
        },
        {
            "text": "The aim of the Local Digital Fund is to make local government services safer, resilient, and cost effective."
        },
        {
            "text": "Through Round 6, we are awarding £2,016,325 to council-led agile projects at varying stages of maturity. "
        },
        {
            "text": "These projects will help us to create the next generation of local public services, where technology is an enabler rather than a barrier to service improvements, and services are user-centred."
        },
        {
            "heading": 2,
            "text": "How we selected the projects"
        },
        {
            "text": "Once applications had been sifted against the criteria outlined in the Local Digital Fund Prospectus, we invited several projects to attend a virtual panel interview with members of Local Digital and the wider Department for Levelling Up, Housing and Communities (DLUHC) for clarification and discussion. "
        },
        {
            "text": "After deliberation, the projects were chosen based on their:"
        },
        {
            "heading": 2,
            "text": "The selected projects"
        },
        {
            "text": "Please note, some of the project names may change once work begins."
        },
        {
            "heading": 3,
            "text": "Round 6 discovery projects"
        },
        {
            "heading": 4,
            "text": "User journeys into adult social care"
        },
        {
            "text": "Led by: London Borough of Redbridge\nFunding awarded: £100,000\nAim: This project will identify opportunities to deliver more preventative interventions and effective triaging."
        },
        {
            "heading": 4,
            "text": "Exploring Automated Health and Social Care Assessments"
        },
        {
            "text": "Led by: Royal Borough of Kingston Upon Thames\nFunding awarded: £100,000\nAim: This project will investigate the automation of the social care triage, assessment and prescription process."
        },
        {
            "heading": 4,
            "text": "Safeguarding adults who go missing"
        },
        {
            "text": "Led by: Greater Manchester Combined Authority \nFunding awarded: £100,000\nAim: This project will develop processes and patterns for the capturing and sharing of data to alert local authorities and care professionals when vulnerable adults go missing."
        },
        {
            "heading": 4,
            "text": "Improving Local Authority Building Control Services"
        },
        {
            "text": "Led by: London Borough of Lambeth \nFunding awarded: £100,000\nAim: This project will look into developing and streamlining specialised building control software."
        },
        {
            "heading": 4,
            "text": "Improving social care hospital discharges"
        },
        {
            "text": "Led by: Stockport Metropolitan Borough Council\nFunding awarded: £82,000\nAim: This project will explore how to overcome the blockages to hospital discharges by developing an Adult Social Care Digital Patient Journey Management System."
        },
        {
            "heading": 4,
            "text": "Improving housing advice services to prevent homelessness"
        },
        {
            "text": "Led by: London Borough of Newham \nFunding awarded: £100,000\nAim: This project will inspect data factors that can better identify people at risk of homelessness."
        },
        {
            "heading": 4,
            "text": "Digital support for carers"
        },
        {
            "text": "Led by: London Borough of Southwark \nFunding awarded: £99,300\nAim: This project will seek to develop a digital support tool to help carers navigate the complex information and service landscape."
        },
        {
            "heading": 4,
            "text": "Helping children out of long waits for adoption"
        },
        {
            "text": "Led by: Nottinghamshire County Council \nFunding awarded: £95,000\nAim: This project will develop data science methods to identify the characteristics of parents who are willing to adopt sibling groups, children older than five, are of minority ethnic background or have complex needs."
        },
        {
            "heading": 4,
            "text": "Exploring barriers to online engagement with council services"
        },
        {
            "text": "Led by: South Ribble Borough Council\nFunding awarded: £35,175\nAim: This project will explore the requirements needed for citizens to access council services with the aim of streamlining or removing unnecessary sign-in requirements."
        },
        {
            "heading": 4,
            "text": "Digital surface flood warning system"
        },
        {
            "text": "Led by: Wakefield Metropolitan Borough Council \nFunding awarded: £97,000  \nAim: This project will develop connected places technology to develop a real time surface water flood warning system."
        },
        {
            "heading": 4,
            "text": "Digitising bulk waste collections"
        },
        {
            "text": "Led by: North Tyneside Council\nFunding awarded: £93,500\nAim: This project will explore the use of machine learning to assess the variables of bulk waste collection."
        },
        {
            "heading": 4,
            "text": "Sharing planning data across council boundaries"
        },
        {
            "text": "Led by: Epping Forest District Council\nFunding awarded: £69,000\nAim: This project will assess how planning consultation data for the proposed Harlow & Gilston Garden Town, which will be developed across five council boundaries, can be shared and used."
        },
        {
            "heading": 4,
            "text": "Better value technology for housing services"
        },
        {
            "text": "Led by: Hackney London Borough Council\nFunding awarded: £100,000\nAim: This project will explore how current housing technology products and procurement processes are stifling innovation and reducing flexibility to policy changes. They will then identify ways to help councils improve how they work with technology providers."
        },
        {
            "heading": 3,
            "text": "Round 6 alpha projects"
        },
        {
            "heading": 4,
            "text": "Rapid identification of vulnerable households in an emergency or crisis"
        },
        {
            "text": "Led by: Cumbria County Council \nFunding awarded: £139,000\nAim: This project will scale a digital tool to be used by regional partners for the rapid identification of vulnerable households by emergency teams during a crisis."
        },
        {
            "heading": 4,
            "text": "Digital taxi licensing service"
        },
        {
            "text": "Led by: Rushmoor Borough Council\nFunding awarded: £138,150 \nAim: This project will test a prototype licensing service, to see if it meets user needs and is scalable."
        },
        {
            "heading": 3,
            "text": "Round 6 beta projects"
        },
        {
            "heading": 4,
            "text": "Planning an infrastructure mapping platform"
        },
        {
            "text": "Led by: Kent County Council\nFunding awarded: £218,200\nAim: This project will develop a data platform to improve strategic planning and provision of infrastructure."
        },
        {
            "heading": 4,
            "text": "Automating HR Appointment processes"
        },
        {
            "text": "Led by: Southampton City Council\nFunding awarded: £350,000\nAim: This project will develop and implement automation tools in councils to improve their starters, movers and leavers processes."
        },
        {
            "heading": 2,
            "text": "How to follow the projects"
        },
        {
            "text": "We will share regular progress updates on our funded projects via the DLUHC Digital blog and the Local Digital website, as well as our other channels:"
        }
    ]
}