{
    "url": "https://educationhub.blog.gov.uk/2023/03/07/secondary-school-offer-appeals-everything-you-need-to-know/",
    "title": "Secondary school offer appeals: Everything you need to know",
    "authors": [
        "mediaofficer"
    ],
    "categories": [
        "school admissions",
        "Schools",
        "Secondary schools"
    ],
    "pub_date": "2023-03-07T11:30:44+00:00",
    "content": [
        {
            "text": "On 1 March, families of Year 6 pupils found out which secondary school offered them a place for September 2023. But what happens if your child wasn’t offered a place at their top choice school?"
        },
        {
            "text": "Here we talk you through everything you need to know about appealing a secondary school’s offer decision."
        },
        {
            "heading": 3,
            "text": "When can I appeal a decision? "
        },
        {
            "text": "You have the right to appeal a decision if you applied to a school and it didn’t offer your child a place."
        },
        {
            "text": "Local authorities set their own deadlines for appeals, but they must allow you at least 20 school days from the day the offer was given to prepare and submit an appeal."
        },
        {
            "text": "Visit your local council’s website to find out how long you have to submit an appeal. Find your local council - GOV.UK (www.gov.uk)."
        },
        {
            "heading": 3,
            "text": "How do I appeal a school admission decision? "
        },
        {
            "text": "If your child is refused a place at one of their three top choice schools, you can appeal against the decision."
        },
        {
            "text": "However, even if you're appealing a decision, we recommend accepting the offer your child did receive so that they have a school place if the appeal is unsuccessful. Accepting another offer won’t affect your appeal or limit other options available to you."
        },
        {
            "text": "The letter which contains the decision about your child’s school place will tell you why your application was refused, where to send your appeal, how to appeal, and the appeal deadline."
        },
        {
            "text": "You’ll usually need to complete an appeal form and submit it by the deadline."
        },
        {
            "text": "You’ll then be invited to an appeal hearing with an admissions panel. The panel is independent and will look at the case presented by both the school’s admission authority and the parent, before deciding whether the school should admit the child. The panel will have seen the form you completed before the hearing."
        },
        {
            "text": "Admission authorities and appeal panels must comply with the statutory School Admission Appeals Code, available here."
        },
        {
            "heading": 3,
            "text": "What information do I need to include in my appeal letter? "
        },
        {
            "text": "The appeal letter is an opportunity for you to show why you think your child should attend the school in question. If you think your application has been treated incorrectly, you should explain why."
        },
        {
            "text": "You can make an appeal because you want your child to attend a particular school, but the stronger your reasons, the better chance you have of your appeal being successful."
        },
        {
            "text": "For example, wanting your child to go to a particular school because it’s the best in the area is not likely to convince the panel that your child should get one place over another."
        },
        {
            "text": "Instead, you should focus on how the school meets your child’s needs, stating what this school can offer that the other can’t, and what the impact will be on your child if they don’t attend the school of your choice."
        },
        {
            "text": "Where possible, you should include other documents that support your appeal, such as letters or written reports. For example, if there are medical or social factors that contribute to your reason for appealing, these should be supported by a letter from a professional like a doctor or social worker."
        },
        {
            "text": "Coram Children’s Legal Centre may be able to give you advice about appeals."
        },
        {
            "heading": 3,
            "text": "When will the hearing take place?"
        },
        {
            "text": "The admission authority must give you at least 10 school days’ notice of the hearing."
        },
        {
            "text": "Appeals must be heard within 40 school days of the deadline for making an appeal."
        },
        {
            "heading": 3,
            "text": "What can I expect from a hearing?"
        },
        {
            "text": "First, the clerk or the chair of the panel will introduce everyone to the hearing. They will explain everything that will happen during and after your hearing. Your appeal may take place in person, remotely by video call, or via a hybrid of the two, and the chair will explain the process depending on how the appeal is taking place."
        },
        {
            "text": "The panel will then usually hear the appeal in two stages."
        },
        {
            "text": "First, the presenting officer will explain the admission authority’s reasons for refusing to admit another child at the school. Then, the panel will ask you to present your reasons as to why you believe the school should admit your child."
        },
        {
            "text": "When the panel believes it has enough information to make a decision, the hearing will end. The panel will then discuss and decide to either uphold or dismiss your appeal in private. If the panel finds that the negative impact on your child of not attending your preferred school is stronger than the case put forward by the school, it will uphold your appeal."
        },
        {
            "text": "Your appeal will also be upheld if it finds that the admission arrangements weren’t properly applied when taking a decision on whether your child should be offered a place."
        },
        {
            "heading": 3,
            "text": "When will I find out whether my appeal has been successful?"
        },
        {
            "text": "After an appeal, you will usually find out in writing whether you have been successful within 5 school days. There may be a delay if the panel has received lots of appeals."
        },
        {
            "text": "If you are making an appeal, we recommend you visit the full guidance at this link."
        }
    ]
}