{
    "url": "https://socialworkwithadults.blog.gov.uk/2023/03/07/shared-lives-and-better-mental-health/",
    "title": "Shared Lives and better mental health",
    "authors": [
        "Ewan King",
        "Lyn Romeo"
    ],
    "categories": [
        "Care and support",
        "Communities",
        "Mental health"
    ],
    "pub_date": "2023-03-07T11:54:15+00:00",
    "content": [
        {
            "heading": 2,
            "text": "The need for mental health support"
        },
        {
            "text": "Of the many challenges we face as a society, there is no doubt mental health has become one of the most pressing. Between 2016 to 2021, statistics show there was a 44% increase in referrals to NHS mental health services. The national charity, Rethink Mental Illness, reported a 175% increase in demand for advice and information on their website in the year following the lockdown."
        },
        {
            "text": "In some ways, I don’t find these figures surprising. As someone who has at times struggled with mental health issues, I know first hand how the last two years have made things more difficult. I also know, from talking to friends and family, I am not alone."
        },
        {
            "text": "Unsurprisingly, the NHS and other forms of support are finding responding to this rising demand challenging. A big problem is the lack of community-based alternatives to bed-based care, where people can go if they need support."
        },
        {
            "text": "In the worst cases, people get “trapped” in hospital or enter totally unsuitable accommodation. This is where Shared Lives can play a role. Best known for the support it provides to adults with learning disabilities, it’s a model of care which involves a Shared Lives carer sharing their home with a person who needs support. It is a model proving increasingly effective in supporting people with mental health conditions."
        },
        {
            "text": "Why? Because Shared Lives offers a person a loving home to live in, companionship and a wider network of support, which can help them recover and regain their wellbeing. This is, sadly, not always the experience of people who spend a long time in hospital, or live in impersonal supported housing."
        },
        {
            "heading": 2,
            "text": "Shared Lives: a personal view"
        },
        {
            "text": "Andy, who has recently drawn on Shared Lives, told me that, before he joined Shared Lives, his life was bleak:"
        },
        {
            "text": "But this all changed when he met with a Shared Lives carer and decided he wanted to live with him:"
        },
        {
            "text": "Andy has seen his life transformed. Importantly, Shared Lives, which is very much a strengths-based approach to support (meaning it seeks to build on what you are good at rather than simply focusing on your problems), addresses your whole life and what you want to achieve."
        },
        {
            "text": "He told me:"
        },
        {
            "heading": 2,
            "text": "Sharing the benefit"
        },
        {
            "text": "There are a small but growing number of areas offering Shared Lives as an option for people experiencing mental ill-health."
        },
        {
            "text": "In South Wales, for instance, there is an award-winning mental health crisis team, which supports people into Shared Lives schemes. In South London, the South London and Maudsley NHS Foundation Trust, is setting up a new Shared Lives service in Southwark."
        },
        {
            "text": "But given we know it works – it delivers outstanding support and is far more cost effective than bed-based alternatives – it is not widely available. This needs to change."
        },
        {
            "text": "It will require commitment from senior leaders in both the NHS and local government, a commitment to invest, and a concerted effort to recruit Shared Lives carers, which also means making sure they are well compensated."
        },
        {
            "text": "Andy wants more people to benefit in the way he did:"
        },
        {
            "heading": 2,
            "text": "Find out more about Shared Lives"
        }
    ]
}