{
    "url": "https://marinedevelopments.blog.gov.uk/2023/03/07/species-spotlight-sea-pen-and-burrowing-megafauna-communities/",
    "title": "Species spotlight - sea-pen and burrowing megafauna communities",
    "authors": [
        "Dan Cutler, Communications & Engagement Manager"
    ],
    "categories": [
        "Uncategorized"
    ],
    "pub_date": "2023-03-07T14:44:46+00:00",
    "content": [
        {
            "text": "This week we’re putting the spotlight on some of the interesting species found within our coastal waters and marine protected areas (MPAs). In particular, we’d like to share more information about sea-pen and burrowing megafauna communities, including what they are and why they may need protection.  "
        },
        {
            "text": "What are they? "
        },
        {
            "text": "Sea-pen and burrowing megafauna communities are found in soft, muddy seabed sediment and form their own burrows and mounds. These communities can be found both in sheltered waters and in deeper offshore waters.  "
        },
        {
            "text": "A sea-pen is not a singular animal but rather a collection of many smaller animals called polyps. Types of sea-pen found in English waters include the slender sea-pen and the phosphorescent sea pen. "
        },
        {
            "text": " "
        },
        {
            "text": "Burrowing megafauna includes crustaceans like the Norway lobster (also known as Dublin Bay prawn, scampi or Nephrops norvegicus) as well as burrowing anemones. In finer mud, burrowing megafauna might also include worms, burrowing sea urchins, sea cucumbers, bivalves, brittlestars, crabs and starfish.  "
        },
        {
            "text": " "
        },
        {
            "text": "What impact can fishing have? "
        },
        {
            "text": "Specific types of fishing activity such as bottom trawling can cause physical damage to the seafloor and impact habitats and species, including sea-pen and burrowing megafauna communities.  "
        },
        {
            "text": "Being fragile, long lived and slow growing, sea-pens are particularly vulnerable. Burrowing megafauna can also have long recovery times.  "
        },
        {
            "text": "What is being done to protect them? "
        },
        {
            "text": "We’re currently asking for your evidence and views on the impacts of fishing on habitats and species found within MPAs, through a call for evidence. Sea-pen and burrowing megafauna communities are some of the species considered as part of this work. This evidence gathering will inform management decisions for the MPAs in consideration. "
        },
        {
            "text": "Both our formal consultation on the proposed byelaw to manage bottom towed fishing in 13 MPAs and call for evidence will close on 28 March 2023. "
        },
        {
            "text": "Please also see our in-depth information sheet on sea-pen and burrowing megafauna communities. "
        }
    ]
}