{
    "url": "https://educationhub.blog.gov.uk/2023/03/07/transforming-student-finance-lifelong-loan-entitlement/",
    "title": "How we are transforming student finance",
    "authors": [
        "media officer"
    ],
    "categories": [
        "Careers",
        "Funding",
        "Students"
    ],
    "pub_date": "2023-03-07T16:13:57+00:00",
    "content": [
        {
            "text": "Getting an education doesn’t stop when you leave school. We want to make sure people have the opportunity to learn, upskill and retrain over the course of their lifetime with our Lifelong Loan Entitlement (LLE) plan."
        },
        {
            "text": "Under the plans, people looking to retrain will be able to apply for a flexible student loan throughout their working lifetime to help upskill and progress in their careers."
        },
        {
            "text": "Earlier this year, we asked for feedback on the plans from the public. We’ve now published the results. Here’s everything you need to know about LLE."
        },
        {
            "heading": 3,
            "text": "What is a Lifelong Loan Entitlement (LLE)? "
        },
        {
            "text": "People will be able to apply for a loan under LLE, worth the equivalent of four years of post-18 education (£37,000 in today’s tuition fees)."
        },
        {
            "text": "The loan can be used flexibly over people’s working lives to pay for full or part-time study, for a variety of courses, from degrees to Higher Technical Qualifications, including modules."
        },
        {
            "text": "The plans will come into effect from 2025."
        },
        {
            "heading": 3,
            "text": "How will an LLE help students? "
        },
        {
            "text": "The LLE will encourage more people to study in a way that works for them, opening up opportunities for those that might have never considered it."
        },
        {
            "text": "This could help them balance training or studies alongside other commitments such as childcare or financial commitments."
        },
        {
            "heading": 3,
            "text": "How will the LLE work?"
        },
        {
            "text": "Students will be able to manage their loans in a personal account where they will be able to keep track of their studies and stay on top of how much funding they have left."
        },
        {
            "text": "Maintenance loans will also be available for those studying multiple technical and part-time courses, including modules, for the first time."
        },
        {
            "text": "This will set the system on a par with traditional full-time study and open up new study and training opportunities for people from all backgrounds."
        },
        {
            "heading": 3,
            "text": "Will students who have already finished university be able to access LLE funds?"
        },
        {
            "text": "Yes. People up to the age of 60 will be entitled to the LLE, including returning students, giving them access to any remaining funding once previous government-funded study has been considered."
        },
        {
            "text": "For instance, this means that people who previously received government funding for a three-year degree will still be entitled to one year’s worth of funding. This could be used to fund another short course or module."
        },
        {
            "text": "Under the new system, returning students will be able to study at an equivalent or lower level than they previously studied – something that the current system doesn’t allow."
        },
        {
            "text": "For example, from 2025, someone who previously had taken out a student loan to study a history degree will then be entitled to finance for a Higher Technical Qualification in Software Development."
        }
    ]
}