{
    "url": "https://deframedia.blog.gov.uk/2023/03/07/uk-proposes-measures-to-protect-englands-much-loved-seabirds/",
    "title": "UK proposes measures to protect England’s much loved seabirds",
    "authors": [
        "Defra Press Office"
    ],
    "categories": [
        "Fisheries",
        "marine",
        "seabirds"
    ],
    "pub_date": "2023-03-07T11:57:59+00:00",
    "content": [
        {
            "text": " "
        },
        {
            "text": "There has been both national and regional coverage of Defra’s announcement yesterday on the government’s plans to consult on proposed measures to ban industrial sandeel fishing within English waters, with aims to protect some of Britain’s much-loved seabirds including puffins and kittiwakes."
        },
        {
            "text": "Sandeels are small, eel like fish that are a vital food source to vulnerable seabirds, commercially important fish species such as haddock and whiting, and sea mammals including seals and whales."
        },
        {
            "text": "Yet sandeel numbers are under pressure from industrial fishing in the North Sea. Without effective management measures, this threatens marine ecosystems and poses a risk to the breeding success and population resilience of UK seabirds - most notably, kittiwakes."
        },
        {
            "text": "According to experts at Natural England, the Joint Nature Conservation Committee and Centre for Environment, Fisheries and Aquaculture Science, seabird abundance could increase within 10 years as a result of the full banning of industrial sandeel fishing in UK waters."
        },
        {
            "text": "Nationally, the announcement was covered by the Daily Express who mentioned the consultation alongside the upcoming BBC documentary ‘Wild Isles’ presented by David Attenborough. The Independent and the Evening Standard called the proposed measures a potential “lifeline” for threatened seabirds, and the announcement was also covered in the Yorkshire Post, the Gazette & Herald and Chard and Ilminster News."
        },
        {
            "text": "Environment Secretary Thérèse Coffey said:"
        },
        {
            "text": "“Britain’s seabirds are beautiful to observe and a treasured part of our coastal environment and their existence and ways of life are crucial to the wider health of our marine ecosystems."
        },
        {
            "text": "This consultation is an important step in securing their protection and delivering our commitment in the Environment Improvement Plan to halt the decline of nature and allow wildlife to thrive”."
        },
        {
            "text": "Katie-jo Luxton, Director for Conservation at the RSPB said:"
        },
        {
            "text": "“This is huge news for the UK’s efforts to save our iconic seabirds. Decades of increasing ‘human-induced’ pressures in our busy seas have left our seabirds in a precarious state, and a ban on industrial trawling for sandeels would throw our most threatened seabirds a lifeline in the face of mounting pressures in our seas."
        },
        {
            "text": "This is a crucial moment; after last year’s devastating outbreak of Highly Pathogenic Avian Flu and with major new offshore energy developments planned, there is an urgent need to build the resilience of our seabird colonies as well as helping to rebuild the overall health of the North Sea for all marine wildlife. Defra are to be congratulated in coming forward with this consultation, which is a vital first step in securing the UK-wide ban our seabirds need.”"
        },
        {
            "text": " "
        }
    ]
}