{
    "url": "https://cddo.blog.gov.uk/2024/09/16/activating-data-for-national-benefit-and-transformed-public-services/",
    "title": "Activating data for national benefit and transformed public services",
    "authors": [
        "Craig Suckling, Chief Data Officer for UK Government, CDDO"
    ],
    "categories": [
        "CDDO",
        "Cross-government strategy",
        "Data",
        "Government Digital and Data",
        "Uncategorized"
    ],
    "pub_date": "2024-09-16T12:09:39+01:00",
    "content": [
        {
            "text": "We have huge untapped potential in our public sector data. Data is one of HMG’s most underutilised and highly valued assets with the power to transform our public services, unlock cross government efficiencies, and boost the UK economy."
        },
        {
            "text": "As the UK Government Chief Data Officer, I am excited to be leading our efforts to deliver on transformational outcomes for the public and the UK with data. There is strong opportunity to now accelerate how we deliver on real change, building on the foundations that have been laid through the National Data Strategy and work on transformation to date. As part of the new digital centre for government in the Department for Science, Innovation and Technology (DSIT), we will continue the journey to improve quality, use and reuse of data across government in a responsible and ethical way. We will also turbo charge innovation, productivity, and resilience with data across the public sector, and transform the public experience of interacting with government."
        },
        {
            "heading": 3,
            "text": "A mission-led data strategy"
        },
        {
            "text": "Data is imperative to the success of our five national missions. For example, cross-government sharing of property registration and geospatial data will reduce fuel poverty and create warmer homes, and help to make Britain a clean energy superpower. Increased sharing of health data will reduce NHS wait times for critical care, reduce fraud, and increase speed and accuracy in diagnostic services. Safe, open data on education will break down barriers to opportunity, and deliver improved learning to all children with personalised AI educational services in schools. Linking data like the HMRC, Department for Work and Pensions, and the Home Office will identify areas of high risk crime, and support police forces in creating safer streets."
        },
        {
            "text": "To create change we need to move fast to deliver on mission outcomes, but must also ensure sustained scale with a focus on transformed culture, policy and standards, legislation, technology, skills and talent. We need to collaborate across government to make this possible. This requires strong vision and commitment, staying focused on the users of government's priorities, and coordinated investment and execution of work."
        },
        {
            "heading": 3,
            "text": "Our areas of strategic focus"
        },
        {
            "text": "Data is right at the heart of our transformation, and is the driving force to deliver optimal cross governmental working, and seamless citizen experiences. To accelerate change we are focused on five themes."
        },
        {
            "heading": 3,
            "text": "Coming together as one data community"
        },
        {
            "text": "A strong and vibrant data community across government and the wider public sector is critical. Healthy community allows us all to grow, share best practice, and build our skills. I am excited that DataConnect24 is now around the corner, running from 23 - 27 September. DataConnect is government's biggest data conference, and I will be launching, and hosting several sessions this year. Presentations and panel discussions at the event will showcase the innovative services we deliver for UK citizens, businesses, and society. "
        },
        {
            "text": "This year our programme is aligned to three themes - The role of data in AI and digital transformation; data sharing: Unlocking access across the system; and data governance: Building trust and transparency in data. This is a space for professional collaboration between data leaders, innovative thinkers, data scientists, data engineers, and AI specialists to share best practice. I encourage all public sector data professionals to join and participate in this week-long event. You can read more in a recent CDDO blog."
        },
        {
            "text": "To attend DataConnect, please:"
        },
        {
            "heading": 3,
            "text": "Looking ahead to an exciting, data driven future for all"
        },
        {
            "text": "We are at a period of exponential and discontinuous change in technology. Data is imperative to achieving the ambition for seamless cross-governmental working. It is a driving force to transform our public services, it powers the AI solutions that will augment, and automates decision making across government. It will expand how we collaborate into industry and internationally, and it will shift government to become proactive and adaptable in a fast-changing world. We all have a role to play as the agents of change, and I encourage everyone to lean into what is sure to be an exciting future, driven by data."
        }
    ]
}