{
    "url": "https://planninginspectorate.blog.gov.uk/2024/09/16/appeals-service-london-borough-of-barnet-pilots-new-householder-appeals-system/",
    "title": "Appeals Service: London Borough of Barnet pilots new Householder Appeals system",
    "authors": [
        "Oliver Blower",
        "Tom Sedgman"
    ],
    "categories": [
        "Appeals",
        "Digital",
        "Service improvement"
    ],
    "pub_date": "2024-09-16T15:17:06+01:00",
    "content": [
        {
            "text": "Oliver Blower and Tom Sedgman are leading the improvements to the Planning Inspectorate's Applications and Appeals Service. In this post, they are announcing an exciting milestone in our ongoing efforts to modernise the appeals process."
        },
        {
            "heading": 2,
            "text": "London Borough of Barnet leads the way"
        },
        {
            "text": "We are pleased to announce that the London Borough of Barnet are the first to trial our new Beta service for Householder Appeals. This pilot, which started last week, marks a crucial step forward in enhancing our Appeals service, bringing us closer to a more efficient and user-friendly process for all stakeholders."
        },
        {
            "heading": 2,
            "text": "Why this matters"
        },
        {
            "text": "This pilot represents the culmination of our efforts to replace the outdated Appeals Casework Portal (ACP) with a modern, user-friendly GOV.UK service. It's designed to guide users more effectively through the entire appeals process, making it easier for all parties involved - from appellants to local planning authorities."
        },
        {
            "heading": 2,
            "text": "What's new?"
        },
        {
            "heading": 2,
            "text": "The road ahead"
        },
        {
            "text": "Following this pilot with the London Borough of Barnet, we plan to:"
        },
        {
            "text": "We're excited about this new chapter in our digital transformation journey and look forward to working with you to create a more efficient, user-friendly appeals process for everyone involved in the planning system."
        },
        {
            "heading": 2,
            "text": "Stay informed"
        },
        {
            "text": "Stay informed about the latest developments and news from the Planning Inspectorate by following our official blog and LinkedIn page. These channels provide regular updates on our services and projects."
        },
        {
            "text": "For more background on this project, please see our previous blog posts:"
        }
    ]
}