{
    "url": "https://educationhub.blog.gov.uk/2024/09/before-and-after-school-childcare-what-is-wraparound-childcare/",
    "title": "Wraparound childcare: Everything you need to know about before and after school childcare",
    "authors": [
        "mediaofficer"
    ],
    "categories": [
        "Childcare",
        "Schools"
    ],
    "pub_date": "2024-09-16T15:46:50+01:00",
    "content": [
        {
            "text": "We’re expanding wraparound care for primary school children across England by increasing the number of places available, to support working families."
        },
        {
            "text": "But what exactly is wraparound childcare? We explain everything you need to know, from what it is to how you can access it."
        },
        {
            "heading": 3,
            "text": "What is wraparound childcare?"
        },
        {
            "text": "Wraparound childcare is before and after school care for primary school aged children in England during term time, such as regular afterschool provision that runs until 6pm or later."
        },
        {
            "text": "The childcare should be available every school day outside of regular school hours and is aimed at helping parents access more childcare and work the hours they want to."
        },
        {
            "text": "This is different from out-of-school activities, or school clubs, which are less frequent and can be a one-off activity."
        },
        {
            "text": "Around 60% of primary schools across England offer wraparound childcare, both before and after school."
        },
        {
            "text": "Private, voluntary, and independent providers, including childminders and early years settings, are also able to offer wraparound childcare. Often, it’s run on a school site or another setting in the local area."
        },
        {
            "heading": 3,
            "text": "How do I find wraparound childcare near me?"
        },
        {
            "text": "Parents looking for childcare options for their primary school child should speak to their child’s school or the Family Information Service run by their local authority to find out what wraparound childcare is currently available in the area."
        },
        {
            "text": "Parents should now see an increase in the number of wraparound childcare places available across the country."
        },
        {
            "text": "There are no eligibility criteria for accessing new wraparound childcare places."
        },
        {
            "text": "We encourage parents to talk to their child’s school or the Family Information Service in their local authority about their need for wraparound childcare, even if it’s not currently available."
        },
        {
            "heading": 3,
            "text": "How much will it cost providers and is financial support available?"
        },
        {
            "text": "Providers will set their own fees for wraparound places, so prices will vary."
        },
        {
            "text": "Parents and guardians will pay their wraparound childcare provider directly for their child’s place."
        },
        {
            "text": "Households eligible for Tax-Free Childcare or Universal Credit Childcare will be able to use the support to help pay for wraparound care."
        },
        {
            "text": "Tax-Free Childcare could save eligible parents up to £2,000 per year for children aged up to 11, or £4,000 per year for children aged up to 17 with disabilities."
        },
        {
            "text": "Universal Credit Childcare could save eligible parents up to 85% of their childcare costs for children aged up to 16. Parents may also be able to get help with their initial upfront childcare costs."
        },
        {
            "text": "To check if you are eligible for Tax-Free Childcare or Universal Credit Childcare, visit  Childcare Choices."
        },
        {
            "heading": 3,
            "text": "What if wraparound childcare is not available in my area?"
        },
        {
            "text": "All parents in England have the right to request that the school their child attends, or is due to attend, consider setting up wraparound or holiday childcare if they don’t already have it."
        },
        {
            "text": "This applies to childcare for children up to the age of 14, or 18 for children with SEND."
        },
        {
            "text": "The right to request only applies to childcare and doesn’t include activities such as after-school sports clubs, which are less frequent and can be a one-off activity."
        },
        {
            "text": "You should write to your child’s school by letter or e-mail and include when you most need wraparound childcare, detailing the days and times you need it."
        },
        {
            "text": "The responsibility for securing sufficient childcare in an area ultimately lies with your local authority, so the school will liaise with them, and then get back to you with a decision within a school-term."
        },
        {
            "text": "For more information on the right to request guidance, visit  Childcare Choices."
        },
        {
            "heading": 3,
            "text": "What else are we doing to improve access to childcare for under 5s for working parents?"
        },
        {
            "text": "Hundreds of thousands of eligible working parents can now access 15 hours government-funded early education for children aged 9-months-old and older after new rules kicked in from 1 September 2024."
        },
        {
            "text": "More information on how to apply can be found on the Education Hub."
        }
    ]
}