{
    "url": "https://naturalengland.blog.gov.uk/2024/09/16/drop-in-numbers-of-nesting-hen-harriers-in-2024/",
    "title": "Drop in numbers of nesting hen harriers in 2024 ",
    "authors": [
        "Stephanie Bird-Halton"
    ],
    "categories": [
        "Hen Harriers",
        "Natural England"
    ],
    "pub_date": "2024-09-16T17:57:15+01:00",
    "content": [
        {
            "text": "Hen harriers are very rare birds of prey found in moorland landscapes. They are rare because of illegal killing and disturbance, and Natural England monitors their numbers closely, tags individual birds to track their whereabouts, and supports efforts to tackle wildlife crime.  "
        },
        {
            "text": "In recent years, numbers of nesting hen harriers in England had been steadily increasing, but the numbers this season are lower than the last two years. "
        },
        {
            "text": "Breeding figures and regional breakdown "
        },
        {
            "text": "In 2024, Natural England and partners recorded a total of 34 breeding attempts in England (down from 54 in 2023) of which 25 were successful (36 in 2023), fledging 80 chicks (141 in 2023). This gives an average of 3.2 chicks per successful nest (3.9 in 2023).  "
        },
        {
            "text": "We did not record any second breeding attempts in 2024. Therefore, it is estimated that there were a minimum of 34 breeding females in England (50 in 2023). One satellite tagged female and two tagged males attempted to breed in Scotland and Wales. "
        },
        {
            "text": "The English hen harrier population is small, and numbers may naturally fluctuate year-to-year. Possible explanations for the decline in numbers this year include poor weather in spring 2024, and low numbers of small mammals and birds, which the harriers feed on. The numbers of chicks fledged per successful nest was down on last year (3.2 compared to 3.9), suggesting that parent birds may have been finding it harder to feed their chicks.  "
        },
        {
            "text": "Despite the poor weather, numbers of nesting hen harriers remained steady in Bowland and Northumberland, and declines were most noticeable in parts of the North Pennines and the Yorkshire Dales, regions where hen harriers tend to nest in areas managed for grouse shooting.  "
        },
        {
            "text": "Hen Harrier Action Plan and illegal killing of harriers.  "
        },
        {
            "text": "In 2016, Defra published the Hen Harrier Action Plan. This set out actions to increase Hen Harrier numbers, mostly designed to reduce illegal killing, through improved police enforcement of wildlife crime, and finding ways to promote the coexistence of hen harriers and grouse shooting, such as providing alternative food to nesting harriers (diversionary feeding) and trialling ‘brood management’ (see below). Another part of the action plan is the Southern England Hen Harrier Reintroduction Project. "
        },
        {
            "text": "One of NE’s responsibilities under the Hen Harrier Action Plan is tagging and tracking individual birds, to identify important sites for Hen Harriers and to monitor survival rates. Natural England tagged eight chicks in 2024, out of the 80 that fledged this year, and the status of all tagged birds is periodically reported on our Hen Harrier Tracking Update page. In January this year we reported that losses of tagged Hen Harriers were higher than normal, heightening concerns of illegal killing. "
        },
        {
            "text": "We had been encouraged by the increased numbers of hen harriers breeding in recent years, so the drop in numbers this year, together with the losses of tagged birds last winter, is concerning. We will continue to direct our efforts towards science, monitoring, enforcement, and conservation management to support the recovery of these at-risk birds. "
        },
        {
            "text": " Brood management  "
        },
        {
            "text": "The brood management trial, which ran between 2018 and 2024, aimed to test whether the availability of this technique would lead to changes in the attitudes of grouse moor managers towards Hen Harriers, reduced levels of illegal killing, and a sustained increase/recovery in the number of Hen Harriers nesting successfully in the uplands of Northern England. The trial has been run by a partnership that included Natural England. "
        },
        {
            "text": "The research licences that Natural England issued for the Hen Harrier brood management trial between 2018 and 2024 have now expired. No nests were brood managed in 2024.  "
        },
        {
            "text": "The Hen Harrier Action Plan states: “If the trial…is successful, [brood management] would be available as an ongoing tool for grouse moors to conserve hen harriers, to be used under licence from Natural England.” Natural England is currently reviewing and analysing the data gathered under the trial, a process which will be concluded later this year. These findings will play a critical role in informing Natural England’s judgement as to the effectiveness of brood management as a conservation technique. "
        },
        {
            "text": "Our monitoring partners "
        },
        {
            "text": "We are grateful for the efforts of all of our partners to monitor, protect and manage hen harrier nests and breeding habitats. We work closely with RSPB staff who record the nesting attempts on RSPB reserves, and on the United Utilities Estate in Bowland. We are also grateful for the contributions of volunteer Raptor Study Groups and Natural England volunteers to nest monitoring, and to landowners and agencies including Forestry England, National Parks, National Landscapes, the National Trust, NatureScot and Natural Resources Wales.  "
        },
        {
            "text": "Natural England field staff lead on liaison with privately-owned grouse shooting estates, and, alongside the Moorland Association, with those land managers that are encouraging hen harriers to nest successfully alongside their wider estate management for grouse and other wildlife. Natural England staff oversee the monitoring and tagging of these nests, and provide support and guidance on diversionary feeding, aided by funding from the British Association for Shooting and Conservation (BASC) legacy fund. We recognise the efforts put in by all these organisations, estates and their staff.  "
        }
    ]
}