{
    "url": "https://environmentagency.blog.gov.uk/2024/09/16/getting-winter-ready-a-case-study/",
    "title": "Getting winter ready: a case study",
    "authors": [
        "Environment Agency"
    ],
    "categories": [
        "agriculture",
        "Environment Agency"
    ],
    "pub_date": "2024-09-16T09:44:14+00:00",
    "content": [
        {
            "text": "We recently met up with Tom, a dairy farmer in Cornwall, who had made some major changes to his farm infrastructure. Tom acted to bring his slurry storage into compliance with the Silage, Slurry and Fuel Oil regulations and to help meet the requirements for Farming Rules for Water. This meant that he had enough storage to see him through winter and could comply with the requirements for spreading manures and fertilisers to meet soil and crop need only.  "
        },
        {
            "text": "Tom’s slurry situation "
        },
        {
            "text": "Tom found himself in a situation many farmers will be familiar with. Too much slurry and too little storage. Ultimately, what this ends up with is having to venture out and spread slurry on fields when it is not required by soil or crop. In general terms, there is no soil or crop need for nutrients during the autumn and winter months (though there are some exceptions). There are a lot of issues with spreading at this time of year: "
        },
        {
            "text": "What Tom did  "
        },
        {
            "text": "Tom took a range of different measures but for many farmers, they may not all be necessary.  "
        },
        {
            "text": "We would encourage all farmers to look at the more straightforward (relatively speaking) steps first – specifically for clean and contaminated water separation, which you can find out more about here. Understanding how much rainfall you receive and rectifying issues with drainage and guttering can go a long way to reducing the volume of slurry you collect. As Tom notes, he was able to roof existing buildings with grant funding, meaning a lot of improvements made for little or no outlay, and a great deal of benefit to his storage capacity.  "
        },
        {
            "text": "By working with us and getting his own independent advice, Tom has built a slurry lagoon that gives him six months storage for 500 cows. This is a significant buffer for his current requirements and assurance that he won’t have to revisit slurry storage on his farm for many years to come. Tom’s slurry lagoon was a more significant financial investment but he is now reaping the benefits by buying in much less bagged fertiliser. As he mentions in the video, he is growing a lot more grass by applying slurry to his land at the right time.  "
        },
        {
            "text": "Finally, he isn’t having to worry about his storage filling up and needing to spread when he shouldn’t. This gives peace of mind that he is compliant with Farming Rules for Water and the Silage, Slurry and Fuel Oil regulations.  "
        },
        {
            "text": "How to get your farm Winter Ready "
        },
        {
            "text": "There is help available if you need to improve your slurry storage capacity. At the Environment Agency, we will always be happy to discuss your situation. We appreciate that, as a regulator, you may be hesitant about speaking to us, but if you contact us our first step will be to offer advice and guidance. We will work with you to make sure your plans are compliant and direct you to other sources of guidance and information.   "
        },
        {
            "text": "Catchment Sensitive Farming provide advice on possible sources of funding for bigger changes to farm infrastructure and what changes are likely to have the biggest impact for your farm. The Farming Advice Service also provide free technical and business advice on regulatory compliance.   "
        },
        {
            "text": "With thanks to Tom and our officer Rob for their time and effort in making this video.  "
        },
        {
            "text": " "
        }
    ]
}