{
    "url": "https://ukhsa.blog.gov.uk/2024/09/16/how-are-we-tracking-mpox-in-the-uk/",
    "title": "How are we tracking mpox in the UK?",
    "authors": [
        "Blog Editor"
    ],
    "categories": [
        "Mpox"
    ],
    "pub_date": "2024-09-16T13:58:41+01:00",
    "content": [
        {
            "text": "Surveillance is the ability to identify potential threats as quickly as possible and share the resulting data widely. It is one of the tools in our defence against infections like mpox. We are currently seeing mpox clade I spreading in some African countries."
        },
        {
            "text": "In this blog post, we will explore the methods used by our teams which help us to monitor the spread of mpox and determine the counter measures needed if we see cases of clade I mpox in the UK."
        },
        {
            "heading": 2,
            "text": "Surveillance can give us an early warning"
        },
        {
            "text": "Back in 2022, an outbreak of mpox clade II started circulating in communities in the UK, and while cases have substantially reduced since, surveillance has remained active in the UK."
        },
        {
            "text": "When a possible mpox case has been identified, swabs are taken and sent for testing.  Depending on the NHS Trust, testing to see if the patient has mpox or not may be done at either the local laboratory or samples sent to UKHSA’s Rare and Imported Pathogens Laboratory (RIPL). "
        },
        {
            "text": "All mpox positive samples should be sent to RIPL for clade testing, providing vital information on the spread of the current clade II within the UK and an early warning should any clade I cases of mpox be identified."
        },
        {
            "text": "If clinicians suspect that the patient has a clade I infection due to recent travel or severe symptoms, they must discuss with the UKHSA Imported Fever Service (IFS) to make sure samples are taken as soon as possible and that the patient is safely managed."
        },
        {
            "text": "All of these services link up and as an organisation, we can work quickly following testing and confirmation of cases to get the right information to the public and tell affected individuals as well as the general population about the risk and any actions they should take."
        },
        {
            "heading": 2,
            "text": "Testing potential cases"
        },
        {
            "text": "We use something called a polymerase chain reaction (PCR) test for mpox, which detects genetic material in swabs or blood samples."
        },
        {
            "text": "There are many mutations across the viral genome which causes mpox. Typically, a PCR test is used to detect a small number of these mutations to differentiate between clades, such as Clade I and Clade II mpox. Whole Genome Sequencing (WGS) can provide more genetic information to use to distinguish between the sub-clades, and as WGS is not impacted by small changes and so continues to work. Additionally, publicly sharing genome data can help to understand the transmission and spread of the virus in affected areas, as well as help research into transmissibility, severity, or vaccine efficacy."
        },
        {
            "text": "Scientists at UKHSA’s Porton Down site quickly developed a PCR test, based on a test developed in Europe, which is now being used to provide same day results for clade I testing."
        },
        {
            "text": "Rapid testing helps inform public health response for Health Protection Teams (HPTs) who will need to step in rapidly if there is a clade I case."
        },
        {
            "heading": 2,
            "text": "Tracing the spread"
        },
        {
            "text": "If testing confirms infection with clade I mpox, the High Consequence Infectious Disease (HCID) network will be activated to ensure a case receives appropriate care and is isolated."
        },
        {
            "text": "This is where we begin contact tracing. This means we get in touch with anyone the person has been in contact with, throughout a certain time period, informing them about the case and checking if they have symptoms. The contacts are individually risk assessed by UKHSA’s HPTs, and appropriate advice and support to cases and contacts will be provided. The HPTs work closely with NHS and other public health services."
        },
        {
            "text": "In some instances, close contacts may be monitored over a number of days in case they develop symptoms and need to receive treatment. All of this work helps to avoid the infection spreading to others."
        },
        {
            "text": "Surveillance, testing and contact tracing are three powerful tools which help contain the spread of a virus."
        }
    ]
}