{
    "url": "https://ruralpayments.blog.gov.uk/2024/09/16/inside-the-rpa-emily-edwards/",
    "title": "Inside the RPA: Emily Edwards",
    "authors": [
        "RPA Editor"
    ],
    "categories": [
        "Inside the RPA"
    ],
    "pub_date": "2024-09-16T12:10:37+01:00",
    "content": [
        {
            "text": "In a series from the Rural Payments Agency’s customer team, we are featuring video interviews and blogs from some of the key people whose roles are focussed on delivering and improving the services provided to customers. In the fourth video and blog of the series, Head of Customer Insight Emily Edwards talks about her role and the importance of customer service within RPA. "
        },
        {
            "text": "Hi, I’m Emily and I’m the Head of Customer Insight at RPA based in Bristol. I started my role in April this year, so I’ve been busy getting to know the teams across RPA and Defra. I’ve also been learning about the processes and services we offer to our customers. Part of my role has been establishing the customer insight team which has included recruitment, training and future planning.  "
        },
        {
            "text": "My team and I are dedicated to capturing the voice of our customers. We’ll play a crucial role in helping RPA understand our customers better, as well as identifying new opportunities to enhance our customers’ experience and satisfaction. We’ve already implemented several initiatives, such as a customer satisfaction survey and other surveys that measure some of the specific interactions that customers have with us.  "
        },
        {
            "text": "Going forward, through research, we’ll identify more improvement actions that can be integrated into RPA’s decision-making. Through that continuous engagement we will continue to build RPA as a transparent, responsive, and customer-focused organisation. "
        },
        {
            "text": "No two days in my role are the same. On one day I could be working from my desk looking at survey results and analysing information, then attending agricultural shows and farms the next, stepping into their shoes and learning about the fantastic work they do. I absolutely love hearing from and speaking with customers. I don’t have a farming or agricultural background, so hearing from the experts and really seeing their passion for what they do is the best part of my role.   "
        },
        {
            "text": "Previously, I worked in the Civil Service for eight years in various departments such as HMRC and DWP. My last role was at Companies House - the UK’s Register of Companies and the Register of Overseas entities - as the Head of Customer Service. I was responsible for leading the customer service strategy, ensuring it reflected customer needs, best practice and was embedded across all services. Before joining the Civil Service, I worked in the private sector and my whole career has been working with and serving customers.   "
        },
        {
            "text": "Outside of work I love going for long walks and exploring new places- seeing how beautiful the UK is. I also love a bit of DIY – there isn’t much I won’t try (I made my own coffee table during lockdown). I enjoy anything creative – I paint quite a lot and enjoy finding new projects to complete. I also love attending concerts which comes from a passion for music and dance. I grew up learning Latin American dancing and competed on various stages across the world."
        },
        {
            "text": "I was born in Newport, South Wales and grew up in a small village called Oakdale in the Caerphilly Borough - there’s a lovely castle in Caerphilly! I spent most of my life there until I moved back to Newport seven years ago. It makes commuting across the bridge much easier as I’m very close to the border. Although I’m Welsh, most of my family are English, so rugby days can be very interesting!  "
        },
        {
            "text": "We’ll be publishing more blogs soon in this series to introduce you to the people that lead on key customer areas - Kath Illidge, Head of Customer Engagement and Support and Alison Chapman, National Customer Operation Lead, so keep an eye out for those and read more about what they do and how they work together to support those who use our services. "
        },
        {
            "text": "You can watch the first three videos and read the blogs in this series - an interview with Customer Director Marie Hardeman and her thoughts on customer service here, a video with Marie, Gareth and Emily here and a video with Gareth here.  "
        }
    ]
}