{
    "url": "https://governmentscienceandengineering.blog.gov.uk/2024/09/16/national-coding-week-2024/",
    "title": "National Coding Week 2024",
    "authors": [
        "gseprofession"
    ],
    "categories": [
        "Blog Series",
        "Our People & Deep Dives"
    ],
    "pub_date": "2024-09-16T09:52:38+01:00",
    "content": [
        {
            "text": "Meet Chrissie Hopson, a Senior Developer at the Student Loans Company and GSE member"
        },
        {
            "text": "This week is National Coding Week and this year the focus is on celebrating working on projects and products that improve lives. "
        },
        {
            "text": "One such person is Chrissie Hopson, a Senior Developer at the Student Loans Company. We caught up with Chrissie to chat about her role to discover more about her career journey in tech."
        },
        {
            "text": "Hi Chrissie, can you tell us about your current role? What do you do?"
        },
        {
            "text": "Absolutely! I’m a Senior Software Engineer at the Student Loans Company (SLC), and my main focus is on developing systems that allow students to apply for student finance online. I also work on systems that help our staff process these applications efficiently. It’s really rewarding work as you are helping people realise their dream of furthering their education."
        },
        {
            "text": "That sounds interesting. Can you share a bit about your career journey and how you ended up at the SLC?"
        },
        {
            "text": "Of course! My journey with SLC began while I was still at university. I worked night shifts at SLC doing data entry and studied for a Foundation Degree in Computer Science during the day. After completing my degree, I joined the Desktop Support Team and continued my studies part-time at the Open University, eventually earning a BSc (Hons) . A turning point for me was completing a module on Java Development, which I really enjoyed. This experience steered me towards programming and software engineering, leading me to apply for a Software Engineering position within the company after my graduation. The SLC was the ideal place to work while I gained my education and was a great environment for gaining work experience."
        },
        {
            "text": "Fantastic. As its National Coding Week, can you tell us why you enjoy coding?  "
        },
        {
            "text": "I love working in technology because it’s such a fast-moving industry. There’s always something new to learn—new languages, frameworks, and ways of thinking about problem-solving. Coding allows me to be creative when problem solving, and I feel a great sense of accomplishment when a project is finished, and I see it being used and making a difference."
        },
        {
            "text": "Is that the best thing about your current role?"
        },
        {
            "text": "It’s great to see my work being used in real life and making a difference, butI also really enjoy working with a team of experienced developers. Our team is very collaborative, and we are always learning new skills and technologies from each other. I would say my team is the best thing about my current role! Also, the industry can be very male dominated, but SLC is a fantastic equal opportunities employer. There are many women in senior and management positions within the Technology Group where I work, which gives me confidence in my own career progression."
        },
        {
            "text": "Finally, this year’s National Coding Week theme is AI. What do you think about AI?"
        },
        {
            "text": "That’s a good question. Personally, I think AI will revolutionise the coding landscape through helping with things like automated code generation, bug detection and fixes, and testing security. This will assist developers, creating efficiencies and increasing capability. It’s exciting to see where this technology will go.  "
        },
        {
            "text": "Sounds like the future is going to be exciting. Thank you for speaking to us, Chrissie. To find out more about National Coding Week, please visit the website."
        }
    ]
}