{
    "url": "https://ofsi.blog.gov.uk/2026/02/16/call-for-evidence-on-ownership-and-control-in-financial-sanctions-regulations/",
    "title": "Call for evidence on ownership and control in financial sanctions regulations",
    "authors": [
        "OFSI"
    ],
    "categories": [
        "OFSI Blog"
    ],
    "pub_date": "2026-02-16T11:33:41+00:00",
    "content": [
        {
            "text": "OFSI has launched a call for evidence to seek industry’s views on how UK financial sanctions regulations on ownership and control are applied in practice, including how firms implement the regulations and where they face challenges.   "
        },
        {
            "text": "The ownership and control test is designed to stop sanctioned individuals and entities from sidestepping UK sanctions by hiding behind complex company structures, trusts or proxies. However, industry representatives report to OFSI that assessing the ability of a designated person (DP) to control an entity - even if they are not actively doing so – can be difficult in practice and may create additional costs and legal risk. "
        },
        {
            "text": "This information will help us understand whether the current approach is as clear, effective and proportionate as it should be, so that sanctions remain tough on those they target while being workable for legitimate businesses. "
        },
        {
            "text": "Background  "
        },
        {
            "text": "The policy intention of the UK government’s approach to ownership and control (O&C) in UK sanctions regulations is to ensure that sanctions cannot be easily circumvented. The two-condition O&C test set out in legislation (e.g. Regulation 7(4) of The Russia (Sanctions) (EU Exit) Regulations 2019) serves as a critical safeguard against sanctions circumvention, by ensuring that entities owned or controlled by a DP are subject to financial sanctions, even if not explicitly named on the UK Sanctions List. In particular, the second condition of that test (also referred to as ‘the control test’) is broadly drafted to capture as much activity as possible. "
        },
        {
            "text": " We have repeatedly heard from financial and legal representatives that they face challenges when implementing O&C provisions, with particular emphasis on the degree of uncertainty of the control test and the potential for multiple and sometimes conflicting interpretations. Firms have told OFSI that determining when these situations constitute control for sanctions purposes can be challenging and that it is not always clear what evidence should be reasonably sought to support these assessments. "
        },
        {
            "text": "In response to industry feedback, HM Government committed to delivering measures to provide further clarity on ownership and control as part of the Review of Sanctions Implementation and Enforcement, published in May 2025. We are therefore launching a call for evidence on how the UK’s O&C test is applied during financial sanctions compliance. We want to hear from those who apply the test about where it works well, where challenges arise and the practical impacts of these assessments. Formal evidence across these areas, in addition to anecdotal evidence already held by OFSI, will help form a comprehensive picture of how implementation works in practice.  "
        },
        {
            "text": "The call for evidence focuses on control as a direct response to industry feedback, which has highlighted greater implementation challenges associated with the control element of the O&C test rather than the ownership element. On ownership, HMG continues to actively explore options to respond to calls for greater alignment with international partners, including adopting an aggregation model and amending the 50% ownership rule to “50% or more,” in line with the EU and US sanctions frameworks.   "
        },
        {
            "text": "Why we are calling for evidence "
        },
        {
            "text": "Under UK financial sanctions, a DP is subject to an asset freeze. The regulations also apply to entities that designated persons own or control.  "
        },
        {
            "text": "An entity is owned or controlled directly or indirectly by another person in any of the following circumstances:  "
        },
        {
            "text": "Evidence presented that the DP has not exercised control does not mean they do not have the ability to do so and therefore does not necessarily refute a DP’s control over an entity. This may be referred to as a DP’s hypothetical ability to exercise control, or simply ‘hypothetical control.’  If a DP can continue to move money or operate through others, the impact of sanctions is weakened. The O&C test helps ensure that sanctions bite on the real economic interests of DP. "
        },
        {
            "text": "At the same time, firms need regulations they can apply in a clear and proportionate way. Uncertainty can mean operational delays while investigations are conducted, higher costs to ensure compliance and de-risking behaviour, where firms may exit contracts or avoid new business relationships to avoid breaching sanctions. "
        },
        {
            "text": "This call for evidence will help us understand those pressures by gathering evidence on these issues in a structured way. It will build a picture of how firms and practitioners are currently interpreting and applying the test, which aspects of the ownership and control test cause the most difficulty and the practical impacts - including on costs, timing and business decisions. Our aim is to build a concrete, evidence-based picture of practice, rather than relying on anecdote.  "
        },
        {
            "text": "Scope of the call for evidence "
        },
        {
            "text": "It is important to be clear about scope. The call for evidence does not invite comment on whether ownership and control rules are desirable as a matter of policy. Instead, we are asking for evidence across the following areas: "
        },
        {
            "text": "We are particularly interested in concrete examples (anonymised where necessary) that show the realities of sanctions compliance and welcome evidence from any organisation or individual involved in sanctions implementation.  "
        },
        {
            "text": "How to respond "
        },
        {
            "text": "The call for evidence is open until 13th April 2026.  "
        },
        {
            "text": "Read the full call for evidence and how to respond here: https://www.gov.uk/government/calls-for-evidence/ownership-and-control-test-in-uk-financial-sanctions-regulations  "
        }
    ]
}