{
    "url": "https://forestrycommission.blog.gov.uk/2026/02/16/unearthing-the-leisure-and-tourism-potential-of-our-woodlands/",
    "title": "Unearthing the leisure and tourism potential of our woodlands",
    "authors": [
        "Nik Evans"
    ],
    "categories": [
        "Access",
        "Health"
    ],
    "pub_date": "2026-02-16T09:00:00+00:00",
    "content": [
        {
            "text": "Woodlands are well known for their rich and varied wildlife, as well as the vital role they play in supporting people’s mental and physical wellbeing. They also offer a source of timber, capture carbon and provide many other benefits. Yet their potential for leisure, tourism and local economic opportunities are not always as obvious."
        },
        {
            "text": "When you pause to consider the many activities that draw people to forests, the scale of the opportunity becomes clear. From traditional country sports and adventure activities such as paintballing, high ropes courses and downhill mountain biking, as well as wellness retreats, yoga classes and forest bathing – there’s something for everyone."
        },
        {
            "text": "These activities, among many others, offer woodland owners a chance to generate income while continuing to care for woodlands as vital habitats for wildlife – a genuine win-win for nature and the economy."
        },
        {
            "text": "In 2022, according to the Office for National Statistics (ONS), the UK’s forests generated £515 million from timber and wood fuel (£126 million in England).1 By contrast, the value of woodland leisure and tourism has been harder to quantify, meaning its contribution can often be overlooked. We know people made an estimated 748 million visits to UK woodlands in 20222 for recreation and tourism, with those visitors spending an estimated £907 million during those trips (£685 million in England)3 – but this is only part of the picture."
        },
        {
            "heading": 2,
            "text": "Woodland leisure and tourism contributions to the economy"
        },
        {
            "text": "We have published new experimental research that expands on the previous estimates by the ONS and sheds a fresh light on the contribution woodland leisure and tourism makes to the UK economy."
        },
        {
            "text": "It suggests that between 2018 and 2022, woodland visits across the UK generated almost £1.1 billion (£0.8 billion in England) of direct annual expenditure for a range of businesses, both inside woodlands and out, supporting over 10,000 direct full-time equivalent jobs (FTEs)."
        },
        {
            "text": "This rises to £2.2 billion annually (£1.7 billion in England) and 25,000 FTEs, when including indirect and induced expenditure – for example spending by those businesses replenishing their supplies or spending by their employees."
        },
        {
            "heading": 2,
            "text": "Opportunities for the nation’s forests"
        },
        {
            "text": "The nation’s public forest estate, managed by Forestry England, covers approximately 214,000 hectares of woodland. It includes some of the country’s most popular outdoor destinations, welcoming 285 million visits a year from people who come to walk, cycle, horse-ride and enjoy a wide range of other outdoor activities."
        },
        {
            "text": "The estate provides a strong example of how leisure and tourism can sit alongside woodland management for wildlife, timber and public enjoyment."
        },
        {
            "text": "Forestry England works with a wide range of national partners, including Go-Ape and Forest Holidays – as well as local businesses such as cafes, bike hire and other services. These partnerships generate valuable income that helps support the long-term care and expansion of the public forest estate and supports hundreds of jobs within Forestry England."
        },
        {
            "heading": 2,
            "text": "Striking the right balance"
        },
        {
            "text": "The estate hosts many public events throughout the year, from running events to live music, employing a robust permissions system to balance the needs and safety of visitors with wildlife conservation and sustainable timber production."
        },
        {
            "text": "Forestry England is consistently exploring new opportunities that bring people closer to nature. A new partnership with Unyoked, for example, is bringing off-grid cabins to selected forests, offering guests a secluded experience in the heart of the forest. This partnership supports our mission to connect people with nature while protecting the nation’s much-loved public forests."
        },
        {
            "text": "Our new research indicates that the largest sources of private sector revenue from Forestry England’s long-term leases include businesses providing camping and accommodation, cafés and outdoor activities.4 For temporary permissions, the highest value activities include sporting events, for example organised runs, art and music events such as Luna Cinema, and adventurous activities."
        },
        {
            "text": "Combined, our research indicates that Forestry England’s private-sector partners earned an estimated £78-£100 million in 2022/23 from permanent leases, and £13.4 million from temporary permissions.5 Together, these businesses are estimated to employ around 2,500 FTEs."
        },
        {
            "heading": 2,
            "text": "The potential for privately owned woodlands"
        },
        {
            "text": "England has approximately 1.1 million hectares of privately owned woodland. These may be managed for wildlife, timber, carbon capture, personal enjoyment, public access or a combination of objectives. However, many are currently under-managed or not managed at all, which is not just a missed economic opportunity, but can lead to declining ecological condition."
        },
        {
            "text": "There is huge potential to generate income from activities that complement the nature of the woodland and the owner’s objectives to create a vital source of income and employment."
        },
        {
            "heading": 2,
            "text": "Estimating the value of woodland businesses"
        },
        {
            "text": "Our new exploratory research aims to better understand the types of leisure and tourism businesses currently operating in privately owned woodlands. We found the most common sectors operating in woodlands included outdoor leisure and sport, accommodation and camping, and food and drink businesses."
        },
        {
            "text": "While it can be challenging to establish how dependent each business is on its woodland setting, our research has begun to develop new ways of estimating their economic value."
        },
        {
            "heading": 2,
            "text": "Research insights"
        },
        {
            "text": "By combining multiple spatial datasets with Companies House records, we estimate that approximately 8,400 leisure and tourism businesses are located directly inside woodland areas across Great Britain."
        },
        {
            "text": "Together, these businesses generate an estimated £1.8 billion in annual revenue and provide jobs for an estimated 29,000 FTEs. In England alone, this includes roughly 6,000 businesses, £1.3 billion in revenue and 21,000 FTEs. Future research will work to fill the remaining gaps and improve the robustness of our initial findings."
        },
        {
            "heading": 2,
            "text": "Looking forward"
        },
        {
            "text": "Although this research is at an early stage, it clearly demonstrates how leisure and tourism in woodlands already make a significant contribution to the UK economy. Far from being absent from economic activity, our woodlands are vibrant places where nature, people, timber production and a diverse range of businesses can thrive side by side."
        },
        {
            "text": "We look forward to building on this preliminary work and refining our methodologies to provide a more accurate picture of this important and growing sector. We want to ensure that our forests continue to support nature, local communities and the wider economy for generations to come."
        }
    ]
}