{
    "url": "https://nationalscreening.blog.gov.uk/2025/06/26/300-plus-stakeholders-attend-uk-nsc-seminar-on-breast-screening-and-breast-density/",
    "title": "300-plus stakeholders attend UK NSC seminar on breast screening and breast density",
    "authors": [
        "TJ Day"
    ],
    "categories": [
        "Breast Screening"
    ],
    "pub_date": "2025-06-26T14:33:49+01:00",
    "content": [
        {
            "text": "The most recent UK National Screening Committee online seminar on 9 June attracted more than 300 attendees, making it our biggest event yet. The seminar covered the issue of breast screening for women with dense breasts and discussions on the potential use of additional imaging."
        },
        {
            "text": "As with our previous seminars, we had a diverse range of people dialling in, including screening practitioners, academics, charity representatives, radiologists, industry representatives, clinicians and members of the public."
        },
        {
            "text": "Dr Rosalind Given-Wilson (Consultant Radiologist/Honorary Professor, University of Warwick/Warwick Medical School) provided an overview of the issue, describing current practice in the UK and abroad. She also outlined the UK NSC recommendation process, and discussed the benefits and harms of screening."
        },
        {
            "text": "Dr Louise Wilkinson (Consultant Radiologist, Oxford University Hospitals NHS Foundation Trust) discussed the current NHS Breast Screening Programme, and outlined the difficulties inherent in screening women with dense breast tissue. "
        },
        {
            "text": "Professor Miriam Brazzelli (Professor of Health Services Research, University of Aberdeen) presented information from 3 systematic reviews conducted by the Aberdeen Belfast Evidence Collaboration and funded by the National Institute for Health and Care Research (NIHR) Evidence Synthesis Programme. These reviews focused on the:"
        },
        {
            "text": "The presentations were followed by a fascinating question and answer session, which illustrated the depth of interest in the topics and the comprehensive knowledge of our stakeholders."
        },
        {
            "heading": 2,
            "text": "Catch up on the presentations"
        },
        {
            "heading": 2,
            "text": "Keep up to date"
        },
        {
            "text": "We’ll post details of new screening seminars on this blog. You can register to receive updates direct to your inbox, so there’s no need to keep checking for new articles."
        }
    ]
}