{
    "url": "https://defrafarming.blog.gov.uk/2025/06/26/animal-health-and-welfare-pathway-multiple-herds-now-eligible-for-vet-visit-funding/",
    "title": "Animal Health and Welfare Pathway: multiple herds and flocks now eligible for vet visit funding  ",
    "authors": [
        "Chris Maxwell"
    ],
    "categories": [
        "Payments to improve animal health and welfare"
    ],
    "pub_date": "2025-06-26T12:03:19+01:00",
    "content": [
        {
            "text": "From today, farmers in England can get a funded vet visit (also called the Animal Health and Welfare Review) for each of their herds or flocks of the same species. "
        },
        {
            "text": "This means that farmers managing several groups of cattle, pigs or sheep can now get support across their business – not just for a single herd or flock. "
        },
        {
            "text": "For example, if you have 3 herds of dairy cows, you can now apply for funding for all 3.  "
        },
        {
            "heading": 2,
            "text": "Background "
        },
        {
            "text": "Many farmers in England manage more than one group of the same species, such as separate sheep flocks with different lambing cycles, or cattle herds in different parts of a holding.  "
        },
        {
            "text": "Until now, farmers could only get one funded vet visit per species. That meant tough choices and could represent a missed opportunity to spot and prevent issues early.  "
        },
        {
            "text": "This expanded support provides farmers with the opportunity to work with their vet to catch problems early, get tailored advice to each group’s needs, and improve farm productivity. "
        },
        {
            "heading": 2,
            "text": "What each funded vet visit includes "
        },
        {
            "text": "With a vet of your choice, each visit includes: "
        },
        {
            "text": "You can also choose to have a follow-up visit focused on deeper sampling, biosecurity planning and action on priority diseases. "
        },
        {
            "text": "Both the initial vet visit and the follow-up are part of the Animal Health and Welfare Pathway, which is designed to help farmers build healthier, more resilient livestock systems. "
        },
        {
            "text": "The funding available for each eligible herd or flock is: "
        },
        {
            "text": "For the optional follow-up visit: "
        },
        {
            "text": "You can access a review and follow-up roughly once a year for each eligible herd or flock. "
        },
        {
            "heading": 2,
            "text": "How to get a funded vet visit "
        },
        {
            "text": "It takes only a few minutes to apply. "
        },
        {
            "heading": 3,
            "text": "If you have an existing vet visits agreement "
        },
        {
            "heading": 3,
            "text": "If you don’t have an agreement "
        },
        {
            "text": "If you've applied for an animal health and welfare review since 19 June 2024, you’re already in the system. Just contact your vet to arrange a visit. "
        },
        {
            "text": "Once you’ve had your visit and the vet has sent you a report on the visit and a summary sheet, you can claim the funding. "
        },
        {
            "text": "Claims take less than 3 minutes on average to submit. "
        },
        {
            "heading": 2,
            "text": "How multi-species support will benefit a Devon farm "
        },
        {
            "text": "Brian and Liz Griffiths in North Devon manage cattle and two sheep flocks. Each flock requires different management approaches and faces different health challenges.  Their February lambing (Mule x Suffolk) flock produces finishing lambs, while their March lambing (North Country Mule) flock delivers breeding animals and autumn lambs. "
        },
        {
            "text": "The expansion of the vet visits scheme means the Griffiths can now receive funded support for all of their eligible animals, both sheep flocks rather than just one, as well as their cattle. This allows them to select different Sheep Health Packages with tailored disease testing, improving animal health with expert veterinary support. "
        },
        {
            "heading": 2,
            "text": "Watch: a vet and farmer on the vet visit offer"
        },
        {
            "heading": 2,
            "text": "Wider grant support for animal health and welfare "
        },
        {
            "text": "We recently opened another round of the Farming Equipment and Technology Fund (FETF)."
        },
        {
            "text": "Farmers can apply for grants between £1,000 and £25,000 for kit that improves the health and welfare of their animals.  "
        },
        {
            "text": "We hosted a webinar recently to explain how FETF works and how to apply. Watch the ‘FETF 2025’ webinar.  "
        },
        {
            "text": "There’s still time to apply before the fund closes on 10 July."
        },
        {
            "heading": 2,
            "text": "Subscribe to the Farming blog "
        },
        {
            "text": "Subscribe to the Farming blog for updates from Defra’s Farming and Countryside Programme."
        },
        {
            "text": "By subscribing, you’ll be notified whenever we publish a new post on this site – from funding opportunities and scheme updates to events."
        }
    ]
}