{
    "url": "https://defrafmp.blog.gov.uk/2025/06/26/bass-management-group-progress-priorities-and-transparency/",
    "title": "Bass Management Group: progress, priorities and transparency",
    "authors": [
        "Peter Elliott – Policy Advisor, Defra"
    ],
    "categories": [
        "- Defra led FMPs",
        "Implementation"
    ],
    "pub_date": "2025-06-26T09:35:18+01:00",
    "content": [
        {
            "text": "Since our first post on the Bass Management Group (BMG), the second and third meetings have taken place. "
        },
        {
            "text": "In that time, we have been working on the fisheries management plan (FMP) actions we are pleased to share that the group now has its own GOV.UK page, improving transparency to help stakeholders stay up to date on progress. Find it here - Bass Management Group meeting minutes - GOV.UK "
        },
        {
            "text": "The minutes for the first and second meetings are there now, along with a presentation on the shore-based netting review. The third meeting minutes will be there soon, but in this post, we will give you an update on the discussions.  "
        },
        {
            "heading": 2,
            "text": "Third meeting of the BMG "
        },
        {
            "text": "The meeting took place in May 2025 with discussions covering progress on actions in the FMP and priorities for filling evidence gaps and FMP objectives.  "
        },
        {
            "heading": 2,
            "text": "Progress updates "
        },
        {
            "text": "Defra updated the group on the shore-based netting review, a key part of goal seven in the FMP.  This review is looking at whether additional regional or national protections are needed to prevent migratory fish bycatch and is due to be published this year.   "
        },
        {
            "text": "The Marine Management Organisation (MMO) are leading the first task-and-finish group in a review of the bass authorisation system in place for commercial vessels within England as part of work addressing goal two of the bass FMP. The group have met over the course of seven months as well as the MMO conducting roadshow consultations around the coast and online with both commercial and recreational sectors. Findings from the review will be shared in September’s meeting. "
        },
        {
            "text": "The Angling Trust will lead on the development of bass handling and best practice guidance amongst recreational anglers. They aim to provide member pack updates, tackle box stickers that signpost to regulations, and short form informational video guidance.  "
        },
        {
            "heading": 2,
            "text": "Evidence discussions "
        },
        {
            "text": "Cefas (Centre for Environment, Fisheries and Aquaculture Science) led discussions on the evidence gaps within the bass FMP with members identifying priorities, based on shared resourcing and funding.  "
        },
        {
            "text": "Bass Angling Conservation (BAC) also presented its “Bass Rebuilding Plan”, which set out its view on the best future management of the stock. BAC suggested that the advice provided by the International Council for the Exploration of the Seas (ICES) encourages the shrinking of the bass stock, and that this should be considered.  "
        },
        {
            "heading": 2,
            "text": "Setting priorities  "
        },
        {
            "text": "Defra also invited members to give further views on which delivery objectives are the most important to help us decide the order of work over the coming months and years, discussing previously prioritised work areas: "
        },
        {
            "text": "Members also highlighted the need to look ahead to future goals in the FMP with a review of the current Minimum Conservation Reference Sizes (MCRS) as a first step. "
        },
        {
            "heading": 2,
            "text": "Planning ahead "
        },
        {
            "text": "The group will discuss the authorisation and shore-based netting reviews and establishing further task-and-finish groups to help deliver other short-term FMP goals.  "
        },
        {
            "text": "-- "
        },
        {
            "text": "Please use the comment section below for any feedback or questions about this meeting of the Bass Management Group - following the blog guidelines. "
        },
        {
            "text": "If you have specific queries and comments about details of the bass FMP, please contact the policy team directly at BassFMP@defra.gov.uk  "
        }
    ]
}