{
    "url": "https://space.blog.gov.uk/2025/06/26/space-businesses-react-as-uk-government-unveils-industrial-strategy/",
    "title": "Space businesses react as UK government unveils Industrial Strategy",
    "authors": [
        "UK Space Conference"
    ],
    "categories": [
        "Championing Space",
        "Events"
    ],
    "pub_date": "2025-06-26T16:28:11+01:00",
    "content": [
        {
            "text": "Space business leaders say the UK’s Modern Industrial Strategy ‘sets the stage for timely and meaningful discussion at next month’s UK Space Conference’."
        },
        {
            "text": "As UK Space Conference prepares to convene on 16–17 July in Manchester, UK space business leaders have voiced broad support for the UK government’s new industrial strategy."
        },
        {
            "text": "The Industrial Strategy names space as a ‘frontier’ industry alongside 10 others “where investment supports both economic growth and security”. The space sector sits across two of the detailed sector plans, ‘Advanced Manufacturing’ and ‘Digital and Technologies’."
        },
        {
            "text": "On that basis, UK space businesses now sit squarely in two flagship sector programmes, potentially opening a broader pool of innovation grants, facilities, and cluster support."
        },
        {
            "heading": 2,
            "text": "Space Business Leader Reaction"
        },
        {
            "text": "UK Space Conference in Manchester on 16-17 July will be the first chance for space sector leaders to convene and discuss the implications of this announcement.  "
        },
        {
            "heading": 2,
            "text": "What does the UK’s Modern Industrial Strategy say about space?"
        },
        {
            "text": "In the ‘Advanced Manufacturing’ sector plan, the government recognises that supporting too many space ‘areas’ has limited growth; a tighter focus on core capabilities and better access to capital is required."
        },
        {
            "text": "Priority areas for space include:"
        },
        {
            "heading": 3,
            "text": "Investment and funding"
        },
        {
            "heading": 3,
            "text": "Regulatory and Policy Support"
        },
        {
            "heading": 3,
            "text": "International Collaboration"
        },
        {
            "heading": 3,
            "text": "Workforce Development"
        },
        {
            "text": "Space Education and Future Workforce Programme: Developing technical and non-technical talent to meet the sector’s evolving needs."
        },
        {
            "text": "Skills England Partnership: Ensuring a sustainable pipeline of skilled professionals through targeted training and development initiatives."
        },
        {
            "heading": 3,
            "text": "The Approach"
        },
        {
            "text": "In addition, the Digital Technologies Sector Plan also identifiesAdvanced connectivity technologies (ACT)as a priority sector, which will concentrate on defence, transport and future telecoms networks including satellites."
        },
        {
            "heading": 2,
            "text": "Notes"
        },
        {
            "heading": 3,
            "text": "About UK Space Conference"
        },
        {
            "text": "UK Space Conference is the UK space sector’s official forum for growth, held biennially in partnership with the UK Space Agency. It brings together industry, government, academia from across the global space ecosystem to explore opportunities and challenges shaping the future of the UK in space."
        },
        {
            "text": "UK Space Conference 2025 lands at Manchester Central on 16–17 July under the theme ‘Space for Growth’, with a programme focused on commercial opportunity, science and innovation, defence and resilience, and the role of space in wider economic and societal transformation."
        },
        {
            "text": "Join us in Manchester on 16–17 July 2025.www.spaceconference.co.uk"
        },
        {
            "text": "For media questions or to arrange press accreditation at UK Space Conference, please contact: commsteam@UKspaceconference.co.uk"
        }
    ]
}