{
    "url": "https://icsdigital.blog.gov.uk/2025/06/26/the-road-to-modern-digital-government-we-are-already-walking-it/",
    "title": "The road to modern digital government? We are already walking it. ",
    "authors": [
        "Mark Merifield"
    ],
    "categories": [
        "How we work"
    ],
    "pub_date": "2025-06-26T11:45:53+01:00",
    "content": [
        {
            "text": "The roadmap to deliver the blueprint for modern digital government will outline the work GDS will be doing to drive digital reform. But like many other digital teams, ICS Digital are already working towards this."
        },
        {
            "text": "We help build better services based on user-centred approaches and strong technology choices, replacing legacy tech. We support users to grow their digital skills (such as AI) and encourage teams to plan for the future. We’re working to improve processes to help speed up delivery and make savings."
        },
        {
            "text": "Where we are now"
        },
        {
            "text": "ICS Digital was a year and a half old when DSIT published the state of digital government review. Our approach was noted as showing"
        },
        {
            "text": "\"... the potential for departmental-led initiatives to be built and scaled to provide value across the public sector.\""
        },
        {
            "text": "The review highlighted our end-user compute service which we now provide across 13 organisations. It is built on the principle that we transform services through making core, trusted, secure, scalable, common technology components the heart of our offer."
        },
        {
            "text": "\"The recent state of digital government review was a good summary of the challenges facing digital delivery across government; we are really pleased that ICS Digital and our approach was called out as an example for how things can be done in the future.\" Karl Hoods CBE, Director ICS Digital, Group Chief Digital and Information Officer for DESNZ and DSIT"
        },
        {
            "text": "Creating scalable common components"
        },
        {
            "text": "Our principal activity in ICS Digital is to keep our departments running and all 17,500 civil servants connected and able to work. We provide the desktop services and devices, tools and connections they need, and keep the departments safe from cyber-threats."
        },
        {
            "text": "We're focusing on growing and strengthening our offer by supplying and supporting core common commodity components. This offer gives staff more opportunities to work innovatively at a lower cost per head as the service grows."
        },
        {
            "text": "Helping to build services"
        },
        {
            "text": "Perhaps the most significant change, however, is in expanding our platform offer. A platform is the software or infrastructure we build on, that we have designed to meet common needs. This can be things like building and hosting web sites, managing data, or grant management. "
        },
        {
            "text": "Reusing components allows us to build services much faster and at a fraction of the cost. Where we do need to do bespoke work, we make it available to future services."
        },
        {
            "text": "We’re also updating our governance processes. We’re balancing the need to assure projects and meet standards with the flexibility and agility required of modern service delivery teams."
        },
        {
            "text": "This approach allows us to focus on building technology capability within the team, reducing the need for third parties and contractors. Allowing us to use specialists to support more innovative use of AI and other new technologies when they’re needed to support our departments."
        },
        {
            "text": "Helping users adopt digital first approaches"
        },
        {
            "text": "The third stage of our transformation efforts is to help teams to adopt user-focused approaches. By demonstrating the value of embedding user-centred approaches from the start of a policy being developed, we will shape the way policy teams think about their users. So, we’ll be more agile and collaborative when we deliver services together."
        },
        {
            "text": "What next?"
        },
        {
            "text": "\"We've organised ourselves as a team in a way that aligns to delivering these outcomes and we continue to improve our processes. The next stage will be to keep moving forward, working with colleagues across policy teams and wider corporate services to embed that product and platform approach in everything that we do.\" Karl Hoods CBE"
        },
        {
            "text": "We are pleased to see that the work we have been doing since we formed is reflected in the outcomes of modern digital government and we look forward to sharing more with you about our journey soon."
        }
    ]
}