{
    "url": "https://naturalengland.blog.gov.uk/2023/08/08/a-promising-first-year-of-the-hen-harrier-conservation-breeding-programme-and-reintroduction/",
    "title": "A promising first year of the hen harrier conservation breeding programme and reintroduction",
    "authors": [
        "John Holmes"
    ],
    "categories": [
        "Biodiversity",
        "Hen Harriers",
        "Licensing",
        "Natural England",
        "Species re-introductions",
        "Species recovery",
        "Wildlife"
    ],
    "pub_date": "2023-08-08T12:46:34+01:00",
    "content": [
        {
            "text": " A recap  "
        },
        {
            "text": "In Autumn of 2022, ten captive  hen harriers were transported to the UK from a rescue centre  in France for Natural England’s conservation breeding programme (Hen harrier Reintroduction NE Blog). This forms an important step in the Southern England Hen Harrier Reintroduction Project which is part of the Defra six-point plan for hen harrier recovery . The purpose of the breeding programme is to produce juvenile hen harriers for release into the arable landscape of Wiltshire, with the aim of creating a sustainable population in southern England. In continental Europe, hen harriers now largely nest in cereals which provide the tall dense structure that is necessary for concealing and protecting the nest. Similarly, Southern England could provide hen harriers with suitable nesting sites in cereal or other dense vegetation and vast areas to forage for food.  "
        },
        {
            "text": "The reintroduction is underpinned by national ambitions for improving England’s nature recovery, to  achieve a growing and resilient network of land, water and sea that is richer in plants and wildlife In particular,  the new Environmental Improvement Plan (EIP) includes a statutory target to Improve the Red List Index for England for species extinction by 2042 compared to 2022 levels.   "
        },
        {
            "text": "Hen harrier breeding programme  "
        },
        {
            "text": "This conservation breeding programme is the first recorded attempt at breeding hen harriers in captivity and is being undertaken by experts at the International Centre for Birds of Prey (ICBP). Breeding programmes are used globally for conservation projects to produce many individuals over a short period of time which helps success and minimises impacts on founder populations, an important factor in translocation best practice.  "
        },
        {
            "text": "The birds in the conservation breeding programme are at the age now where breeding is possible. Female hen harriers can breed in their first year whereas males are more likely to attempt breeding in the second. This young breeding ability is advantageous to population viability as the population can increase much faster than species that breed later in life.  "
        },
        {
            "text": "Hen harrier breeding behaviour in the wild  "
        },
        {
            "text": "The hen harrier breeding season begins in March, as harriers move into their breeding grounds within open landscapes. Breeding behaviour gets into full swing in April, when male hen harriers show off their agility and fitness by ‘sky dancing’ and begin providing food to the females near to the breeding site. A successful pair will mate often following food provisioning and begin building their nest on the ground. The male will then continue to provide food to the female and chicks.  "
        },
        {
            "text": "Signs of possible breeding this year amongst our captive birds"
        },
        {
            "text": "The matchmaking began at the start of the year when the birds were paired together at the ICBP in purpose-built breeding aviaries. Like in other birds of prey, the hen harriers need time to adapt to each other and their new surroundings. This period of adaptation can delay their breeding success.  "
        },
        {
            "text": "Knowing the probability of breeding this year was low, project staff were delighted to see early courtship and breeding behaviours taking place. Some females began nest creation, and several food passes were witnessed. However, following a long period of bad weather, the behaviour decreased and ceased by June, and no eggs were laid.  "
        },
        {
            "text": "Observing these behaviours in the first year is an encouraging sign for the possibility of successful breeding next year. Jemima Parry-Jones, who is leading the conservation breeding programme at the ICBP, said: "
        },
        {
            "text": "\"To a certain extent we are working in the dark as no one has bred hen harriers in captivity, so we do not know what might encourage them to breed. Working with the pairs we have at the moment has been a learning curve and we are making some changes to the programme this autumn to see if they help and encourage the Hen Harriers to feel more settled and give them the confidence to move forward and breed. It's exciting, challenging, and fascinating work, but we hope to succeed in the end as they are amazing birds to work with”. "
        },
        {
            "text": "What’s next  "
        },
        {
            "text": "The ten hen harriers can now spend the remainder of the year getting to know each other before the next breeding season. The bird care staff at the ICBP will be keeping a close eye on which birds seem interested in each other and the project staff will continue with preparations for next year’s breeding season. If enough juveniles are produced next year, they will be released, and satellite tagged to monitor their progress overtime.  "
        },
        {
            "text": "Collaboration and partnerships are key to achieving nature recovery, and the Hen Harrier Southern Reintroduction has generated national and international collaboration and research opportunities. "
        },
        {
            "text": "Reintroductions are often emotive as they are driven by human interventions and may have real or perceived effects on humans and wildlife. A recent paper by a researcher at the University of Exeter (Marino et al 2023) highlighted the importance of understanding social science within reintroduction projects. The project team can use this knowledge to facilitate opportunities for communication and collaboration between stakeholders.  "
        },
        {
            "text": "The project team are keen to build upon existing relationships with the local community and engage with new people in and around Wiltshire. Though guided walks, visits and one to one conversations project staff can work with local people to inform them about the reintroduction. By understanding the thoughts and feelings of local farmers, landowners, game keepers and conservation groups the project can work to alleviate concerns and encourage support for hen harrier recovery. "
        },
        {
            "text": "The Southern Reintroduction complements the other actions set out in the hen harrier action plan which aim to support hen harriers in the northern uplands and tackle persecution. These include tagging and nest monitoring, diversionary feeding, and trialling brood management of birds nesting on grouse moors.  "
        },
        {
            "text": "Acknowledgements  "
        },
        {
            "text": "We are grateful to our UK and international partners, collaborators, funders and supporters, including but not exclusively the ICBP, the Zoological Society of London, the University of Exeter and the British Association for Shooting and Conservation, as well as the French and Spanish rescue centres and conservation organisations, and Wiltshire landowners, land managers, local groups and residents. "
        },
        {
            "heading": 5,
            "text": "---"
        },
        {
            "heading": 5,
            "text": "By John Holmes"
        },
        {
            "heading": 5,
            "text": "Strategy Director, Natural England"
        }
    ]
}