{
    "url": "https://mojdigital.blog.gov.uk/2023/08/08/accelerating-transformation-and-securing-the-future-diso-one-year-on/",
    "title": "Accelerating Transformation and Securing the Future - DISO One Year On",
    "authors": [
        "Nava Ramanan"
    ],
    "categories": [
        "Network Services Transformation"
    ],
    "pub_date": "2023-08-08T14:35:19+01:00",
    "content": [
        {
            "text": "Where shall I start, we as a team have achieved so much in so little time! "
        },
        {
            "text": "In an era of rapid technological advancements, organisations must continuously evolve to meet the ever-growing demands of their customers. Justice Digital is no different. "
        },
        {
            "text": "Our team has been at the forefront of the Ministry of Justice network services transformation, working diligently to enhance our operational capacity and capability. The fact that you are unaware, is an enormous success, as transformation and upgrades have been completed seamlessly and silently, ensuring our customers have a 21st-century service."
        },
        {
            "text": "In my previous blog, I detailed how we as a team were working on multiple initiatives, including updating the WIFI at 92 prisons, the deployment of network access controls, reviewing and renegotiating our communication supplier contracts, and delivering the best possible value for money for all our customers. "
        },
        {
            "text": "To do this, we actively evaluated modern technologies within the marketplace and explored their capabilities to allow us to continuously improve the service that we deliver and realise our strategic goal of making the experience of our users: simpler, faster, and better!"
        },
        {
            "text": " So, what have we been up to since then? "
        },
        {
            "text": "As a team, we remain focussed on upgrading our systems to future-proof working models that support users going forward.  "
        },
        {
            "text": "In the coming year, we also have several large-scale initiatives to continue our journey:"
        },
        {
            "text": "It has also made sense to bring our Security Operations Centre (SOC) into the team fold, enabling closer collaboration with the network and infrastructure teams – highlighting and sharing threat detection; identifying and mitigating any vulnerabilities; strengthening the security posture of the MoJ while maintaining business continuity. "
        },
        {
            "text": "And finally, what’s in a name?  Well, after some consideration, our current moniker of Network, Voice, and Video no longer represents the breadth of services we offer and support for our users, or skills within the product teams today – so with this in mind, the team is now known as ‘Digital Infrastructure and Security Operations’ (DISO). "
        },
        {
            "text": "We are looking forward to continuing our journey and sharing the next exciting installment with you soon!"
        }
    ]
}