{
    "url": "https://socialcare.blog.gov.uk/2023/08/08/celebrating-co-production/",
    "title": "Celebrating co-production",
    "authors": [
        "Kathryn Smith"
    ],
    "categories": [
        "Care and support",
        "Carers",
        "Events",
        "Workforce"
    ],
    "pub_date": "2023-08-08T15:41:11+00:00",
    "content": [
        {
            "heading": 2,
            "text": "Looking back at Co-production Week"
        },
        {
            "text": "At SCIE, we recently marked the eighth year of our annual Co-production Week, a five day national festival of co-production in action, in which we celebrated and shared good practice in coproduction in social care."
        },
        {
            "text": "Working with SCIE’s co-production steering group, Think Local Act Personal (TLAP) and other colleagues from around the country, we held a range of events and launched ideas and insights from co-production research and practice. Together, we are keen to promote the contributions of people with lived experience, and their carers, in developing better public services."
        },
        {
            "text": "The week began with the launch of findings from SCIE’s Co-Production Survey. With nearly 1000 responses, the survey shed light on people’s experiences and understandings of co-production, from the perspective of those who draw on care and support, and those working in the sector. From the findings, we identified four key policy recommendations for making sure co-production is embedded meaningfully in adult social care."
        },
        {
            "text": "The survey found people with lived experience were less likely to be familiar with the term ‘co-production’ than those working in the adult social care sector: 72% of staff working in adult social care reported previous familiarity with the term ‘co-production’, whilst this figure stood at 56% of individuals with lived experience."
        },
        {
            "text": "Respondents also raised concerns over the inclusiveness and representativeness of co-production. Our first call for action is for diversity in practice, broadening the voices heard and extending participation."
        },
        {
            "heading": 2,
            "text": "Diving deeper into the data"
        },
        {
            "text": "The survey found that the closer one’s job was to direct care, the less likely those workers were to have in-depth knowledge of co-production. Senior leaders with the least exposure to frontline working had a much better knowledge of co-production (95% familiarity) than those working in direct care delivery (41%) at the time of taking the survey."
        },
        {
            "text": "We are calling for embedding co-production principles and good practice in the training and qualifications of all roles in the adult social care workforce. This is especially relevant for the development of the new social care workforce pathway."
        },
        {
            "text": "Another key finding was confusion around the definition of co-production as well as who should be involved in it and for what purpose:  59% of people with lived experience reported previous opportunities to be involved in co-producing their own care and support, whilst only 37% had been involved in co-producing services or policies."
        },
        {
            "text": "We are calling for a standard and consistent way of explaining co-production and promoting practical examples that bring the skills, values and behaviours of co-production to life."
        },
        {
            "text": "Time, organisational culture, cost and communication were reported as the top barriers and challenges to co-production. To tackle these barriers, we also calling for a robust business case that demonstrates the value of co-production and support for further research on its impact."
        },
        {
            "heading": 2,
            "text": "What next for co-production?"
        },
        {
            "text": "It is crucial that sufficient resources are allocated towards co-production, making sure staff have protected time to carry this out. Investment in such areas will equip staff working in adult social care with the necessary tools and resources to engage in co-production effectively and meaningfully, and ensure services are fit for purpose."
        },
        {
            "text": "At SCIE, we are committed to recognising and valuing people’s lived experiences and to working in equal partnership with them. Some recent co-production experiences offer both insights and inspiration. For example, we have learned about the experiences of people with learning disabilities and autism during the COVID pandemic, drawing out lessons for policymakers, commissioners and care practitioners."
        },
        {
            "text": "The co-production group produced learning materials and a brilliant video, where they reflect on their experiences and remind us of the essence of social care practice – about relationships, community and supporting people to live independent and fulfilling lives. You can also view a set of newly produced videos about best practices in co-production, put together by SCIE’s Co-production Steering Group."
        },
        {
            "text": "As a final reflection on Co-production Week, we have much to celebrate about co-production practice. We are continuing to grow the body of knowledge about co-production's benefits, whether for public services or people with lived experience."
        },
        {
            "text": "To fully realise these benefits, however, we will continue raising awareness of co-production, forge ahead with developing more inclusive practices and work with sector leaders to ensure that co-production is integral to all future policy making in social care.    "
        },
        {
            "heading": 2,
            "text": "Find out more"
        }
    ]
}