{
    "url": "https://healthmedia.blog.gov.uk/2023/08/08/covid-autumn-booster-vaccine-2023-everything-you-need-to-know/",
    "title": "Covid autumn booster vaccine 2023: Everything you need to know",
    "authors": [
        "DHSC Media Team"
    ],
    "categories": [
        "Coronavirus (COVID-19)",
        "Vaccinations and Immunisations"
    ],
    "pub_date": "2023-08-08T11:28:37+01:00",
    "content": [
        {
            "text": "People at greatest risk of serious illness from Covid, including care home residents, over 65s and frontline health and social care workers, are eligible for an autumn vaccine booster."
        },
        {
            "text": "Here’s everything you need to know."
        },
        {
            "heading": 2,
            "text": "Am I eligible for an autumn Covid booster?"
        },
        {
            "text": "The following people are eligible for an autumn Covid booster:"
        },
        {
            "text": "This is because the risk of severe Covid continues to be strongly associated with increasing age and underlying health conditions."
        },
        {
            "heading": 2,
            "text": "When is the booster available and how do I book an appointment?"
        },
        {
            "text": "NHS England will confirm details on how and when eligible people can access the autumn booster vaccine soon."
        },
        {
            "text": "The Joint Committee on Vaccination and Immunisation (JCVI) has advised the autumn programme should aim to complete vaccinations by early December 2023."
        },
        {
            "heading": 2,
            "text": "How does the JCVI define a clinical risk group? "
        },
        {
            "text": "Tables 3 and 4 of the Covid-19 chapter of UKHSA the Green Book defines who is in a clinical risk group."
        },
        {
            "text": "Clinical risk groups for individuals aged 16 years and over include:"
        },
        {
            "text": "Clinical risk groups for those aged under 16 years include:"
        },
        {
            "heading": 2,
            "text": "What about people who’ve not had a Covid vaccine?"
        },
        {
            "text": "The JCVI advises that people who have not yet received their first Covid jab should be offered a single vaccine dose as their primary course."
        },
        {
            "text": "The criteria for eligibility for a first Covid vaccine is the same as the autumn 2023 booster."
        },
        {
            "heading": 2,
            "text": "Why should I get an autumn booster?"
        }
    ]
}