{
    "url": "https://ukhsa.blog.gov.uk/2023/08/08/how-the-team-monitoring-new-and-emerging-infectious-diseases-could-help-prevent-the-next-pandemic/",
    "title": "How the team monitoring new and emerging infectious diseases could help prevent the next pandemic",
    "authors": [
        "Dr Mike Reynolds"
    ],
    "categories": [
        "Health Protection"
    ],
    "pub_date": "2023-08-08T14:23:17+01:00",
    "content": [
        {
            "text": "With the COVID-19 pandemic bringing public health science into the forefront of national consciousness, you might be mistaken in thinking that pandemic preparedness and scanning for diseases is new. In this blog post, Dr Mike Reynolds, Principal Scientist within the Emerging Infections and Zoonoses team, dives into the daily work he and his colleagues do to keep you safe."
        },
        {
            "text": "As a scientist within the UK Health Security Agency’s (UKHSA) Emerging Infections and Zoonoses (EIZ) team, my role is to ensure that there is a robust system in place to detect and assess new and emerging infectious diseases occurring globally."
        },
        {
            "text": "I’ve been a part of the EIZ team at UKHSA since 2021, and would describe my role as a mixture of threat detection, and investigation and outbreak response."
        },
        {
            "text": "As we’ve seen with the COVID-19 pandemic, new and emerging diseases can have devastating effects on individuals and our communities. As well as impacting our health, infectious diseases can shape the way we live our lives by impacting our economies, our cultures and daily habits."
        },
        {
            "text": "Identifying and assessing diseases which might make their way to the UK is part of the role that UKHSA plays in the daily defence of wider health of the UK."
        },
        {
            "text": "Our team’s work focuses on the early detection assessment and communication of outbreaks of diseases occurring globally, to ensure that government, health protection teams and the NHS can take action to safeguard UK public health."
        },
        {
            "text": "And what is one of the key components to averting the next pandemic or ensuring that diseases like mpox do not establish a foothold in the UK? Daily surveillance activities."
        },
        {
            "heading": 2,
            "text": "What do we monitor?"
        },
        {
            "text": "Information about outbreaks and incidents of new and emerging infectious diseases is gathered through Epidemic Intelligence (EI) processes. The aim of the EI process is to identify any new or updated information about outbreaks and incidents involving emerging infectious diseases which might pose a threat to the UK population."
        },
        {
            "text": "We’ll be looking for:"
        },
        {
            "heading": 2,
            "text": "How do we pull all these resources together?"
        },
        {
            "text": "Each morning, our team of trained epidemiologists gather intelligence from open-source platforms including social media, reports from international media, government publications from other nations, publications from ministries of health and the WHO’s Epidemic Intelligence from Open Sources platform (EIOS)."
        },
        {
            "text": "Within the EIOS platform, thousands of official and unofficial articles are brought together and organised into disease-specific categories. This makes it more efficient for our scientists to analyse thousands of sources of information daily in search of new signals of disease."
        },
        {
            "text": "Once detected, these signals are verified, risk assessed and reported to colleagues across UKHSA, public health, the NHS and government so that any necessary public health action can begin."
        },
        {
            "text": "Our team doesn’t work in its own bubble, and an important factor in our early warning systems is close collaboration with other public health bodies."
        },
        {
            "text": "We collaborate as part of the Global Health Security Initiative Early Alerting and Reporting network, an international network of epidemiologists from the G7 countries, Mexico and the European Centre for Disease Control (ECDC). As part of this international network, we can collectively detect, share, interpret and verify signals much more quickly than any country would be able to do so alone."
        },
        {
            "heading": 2,
            "text": "What is involved?"
        },
        {
            "text": "Data is only one aspect of surveillance, and by far the most useful tool in our surveillance system is the knowledge and skill employed by our highly trained epidemiologists whose investigations will determine whether an incident is an unusual or unexpected event."
        },
        {
            "text": "Being able to interpret a signal and identify whether it is unusual is complex and essential. Further investigation might be prompted if there are higher rates of severe illness or death, an increase in transmissibility of an infection, the infection has been detected outside of an area it is commonly found, or whether there is potential to interfere with international travel or trade."
        },
        {
            "text": "All signals are thoroughly investigated and confirmed through official sources, which may involve directly contacting counterparts in other countries where the signal has been reported."
        },
        {
            "text": "The intelligence our team gathers is used to assess direct risks to the UK, but we continue to monitor diseases and outbreaks in other countries so that we remain alert to threats that may be imported to the UK at a later date."
        },
        {
            "heading": 2,
            "text": "How does infectious disease surveillance keep you safe?"
        },
        {
            "text": "Our epidemic intelligence work helps to identify outbreaks or cases of a new or emerging disease early, meaning that we can prepare guidance for the public and the NHS on what symptoms they need to look out for, when to seek care and what treatment is advised so that the best possible care can be given. We can isolate people with higher risk infections to help slow or stop a disease spreading through our communities and develop effective prevention and control strategies (for example, vaccination in an affected community)."
        },
        {
            "text": "Read our report on the latest global high consequence infectious disease events."
        }
    ]
}