{
    "url": "https://digitaltrade.blog.gov.uk/2023/08/08/meeting-potential-colleagues-at-silicon-milkroundabout/",
    "title": "Meeting potential colleagues at Silicon Milkroundabout",
    "authors": [
        "Georgina Prvulovich, DDaT Recruitment Lead",
        "Liz Catherall, Delivery Manager",
        "Amad Ahmed, Content Designer",
        "Luisella Strona, Senior Developer",
        "Kelly Thompson, Resourcing Advisor"
    ],
    "categories": [
        "People",
        "Professions"
    ],
    "pub_date": "2023-08-08T10:15:24+01:00",
    "content": [
        {
            "heading": 2,
            "text": "What is Silicon Milkroundabout and why did we attend?"
        },
        {
            "text": "Silicon Milkroundabout (SMR) is a careers event, held in London twice a year, and tailored to digital, data and technology jobseekers. This was a perfect event for the DDaT recruitment team to attend! They have attended twice before and have made a hire from attending each time.  "
        },
        {
            "text": "Our aim of attending SMR is to speak to interested candidates and promote DDAT vacancies at the Department for Business and Trade (DBT). We operate in such a challenging market that we need to spread the word about the department and our work as widely as possible. The DBT branding generated a lot of interest as many attendees hadn’t heard about the formation of a new government department. "
        },
        {
            "heading": 2,
            "text": "What did we do there?"
        },
        {
            "text": "The event was held on both Saturday and Sunday, with focuses on different professions each day. The days were split up into 3 sessions and there were 1,500 skilled professionals in attendance. Past attendees may remember the large space the event was held in previously and how challenging it was to hear candidates and have a conversation with them. This time SMR held the event in a smaller space - this made it a lot easier to engage with people, although it was still fairly loud. "
        },
        {
            "text": " The recruitment team visited on Friday to set up our stand. Saturday and Sunday both began with a Women in Tech ‘brunch’ with pastries. It was noticeable how many more female candidates there were in the first sessions. This gave us a great opportunity to talk about our majority female senior leadership team and our back-to-back shortlisting for the Women in Tech ‘Best Public Sector Employer’ award.  "
        },
        {
            "text": "All the sessions were very busy and there was a near constant queue of candidates to talk to. The SMR team made sure we were fed and watered in the breaks.   "
        },
        {
            "heading": 2,
            "text": "How did our volunteers find it?"
        },
        {
            "text": "Liz, Delivery - 'Like User Research, recruitment is a team sport. It’s up to us to understand what people are looking for and show a bit of how we work. The only way we can succeed in getting people in is to show ourselves. I really welcomed the opportunity to speak to many people that I would not ordinarily have had a chance to and to speak to the competition. Great event, well run and worth going along to.' "
        },
        {
            "text": " "
        },
        {
            "text": "Amad, Content Design - 'I’m fairly new to the Civil Service and it wasn’t so long ago that I was at events like SMR as a jobseeker! However, attending the event as an exhibitor meant that I was on the other side of the booth for the first time. The way the event was organised meant I could discuss the roles we’re recruiting for in detail and field questions from jobseekers. There was a lot of curiosity about the application process, flexible working arrangements and career progression."
        },
        {
            "text": "It was great to share my insight and correct some of the misconceptions that were out there. The day was a great way to bond with colleagues that were also volunteering, connect with private sector people and have an experience to share with my LinkedIn network.'"
        },
        {
            "text": "Luisella, Software Developer - 'Before volunteering, I was rather anxious, because I’d never been to a similar event. However, Georgia from the recruitment team was really reassuring. On the day itself I caught up with colleagues and had a quick breakfast, before starting to talk to people interested in DBT. I was the only developer, and I ended up being in high demand. I spoke almost non-stop for the whole time I was there. It was really rewarding being able to explain how we work and what we do and find out what they were looking for. I tried to encourage several of the people I spoke with to apply for DDaT roles. I hope to see some of them as colleagues in the future."
        },
        {
            "text": "Overall, Silicon Milkroundabout was a really good experience that I am planning to repeat in the future. I even had the chance to speak my native language (Italian) with 3 different people.'"
        },
        {
            "text": "Kelly, Recruitment Advisor - 'I attended for the first time, and was a bit nervous. I had only been in the recruitment team for about 2 months and wasn’t sure what to expect. However, my opinion changed straight away. I was made to feel at ease by the organisers and the event was set up well. The atmosphere was fantastic, and it was so great to speak to candidates face to face rather than through an email or application form."
        },
        {
            "text": "I was really surprised at how busy it was. I spoke to a range of people who were all looking for different roles and were enthusiastic to hear about DBT. I highly recommend that colleagues attend and get involved in the next Silicon Milkroundabout. It was a really great experience for me and I will definitely be attending the next one.'"
        },
        {
            "heading": 2,
            "text": "What were the outcomes?"
        },
        {
            "text": "By the end of the weekend, we had close to 100 people registering their interest in our roles and spoke to many more. This is more people than we have had sign up than ever before at this event. This is a fantastic testament to the amazing culture at DBT and the hard work our volunteers put in over the weekend to sell this culture. "
        },
        {
            "text": "In the recruitment team we have been keeping an eye on live campaigns, and there have already been applications from people we met at SMR. We hope to make at least one more hire from this round and to attend again in the future. Thank you again to everyone who volunteered and helped make the event so successful. "
        }
    ]
}