{
    "url": "https://socialworkwithadults.blog.gov.uk/2023/08/08/proportionate-and-person-centred/",
    "title": "Proportionate and person-centred",
    "authors": [
        "Lyn Romeo"
    ],
    "categories": [
        "Knowledge and skills",
        "Our profession",
        "Personalisation"
    ],
    "pub_date": "2023-08-08T10:27:01+00:00",
    "content": [
        {
            "heading": 2,
            "text": "Enhancing our ability to help"
        },
        {
            "text": "In my role as Chief Social Worker for Adults, I spend valuable time visiting social care teams in local authorities, NHS trusts and provider services as well as meeting with people and family carers and friends who support them."
        },
        {
            "text": "It is a privilege to meet those for whom social care is so central to their lives, as it is to mine. I am always keen to hear about innovative and creative approaches to engaging with and understanding people’s stories, the things that matter to them and how best to make sure they access responsive and timely support to live better lives."
        },
        {
            "text": "Practitioners are always keen to reduce bureaucracy and streamline ways of getting things done to allow more time to talk with people, listen deeply with empathy and apply their extensive knowledge of available resources. They need the space to consider how best to garner those resources to support people to live well in their communities for as long as possible."
        },
        {
            "text": "Many more of us complete information online now and professionals have been empowered though these opportunities to virtually engage with people. They can complement home visits, but of course can't replace the richness and depth of assessment seeing someone in their home environment brings."
        },
        {
            "heading": 2,
            "text": "Informed choices"
        },
        {
            "text": "Social work and social care approaches are all about putting the person 'in the driving seat' when it comes to choices about the support they need, balanced with our nuanced judgment as social care professionals to steer and direct those choices. People rely on receiving good quality, reliable information and advice, including roadmaps and the opportunity to input in relation to their options. In addition, professionals take responsibility for identifying risks and ways in which they can be mitigated."
        },
        {
            "text": "Many local authorities are finding ways to work better and smarter. This publication is designed to encourage and support the development of these approaches. These more creative methods make the care journey easier for people in need of support. That’s why I’m pleased to endorse the principles of proportionate assessments, which have been developed with Adult Principal Social Workers and people with lived experience."
        },
        {
            "text": "I believe they will help shape a better experience for those we are here to serve – please do have a look and further enhance the empathic, compassionate and insightful support you already provide to those in need."
        }
    ]
}