{
    "url": "https://valuationoffice.blog.gov.uk/2023/08/08/understanding-business-rates/",
    "title": "Understanding business rates",
    "authors": [
        "John Berry - Director of Property Professional Services"
    ],
    "categories": [
        "Business Rates",
        "Valuation"
    ],
    "pub_date": "2023-08-08T12:15:08+01:00",
    "content": [
        {
            "text": "At the Valuation Office Agency, we value commercial properties so councils can calculate business rates bills."
        },
        {
            "text": "We carry out our valuations independently and impartially."
        },
        {
            "text": "Here you can find an overview of how properties are valued and what this means for your business rates. "
        },
        {
            "text": "Who pays business rates?"
        },
        {
            "text": "Business rates are charged on most non-domestic properties."
        },
        {
            "text": "Properties like:"
        },
        {
            "text": "You’ll probably have to pay business rates if you use a building, part of a building or land for non-domestic purposes."
        },
        {
            "text": "How is my bill worked out?"
        },
        {
            "text": "Business rates are worked out based on your property’s ‘rateable value’."
        },
        {
            "text": "We are responsible for calculating the rateable value."
        },
        {
            "text": "For most valuations we use rental values as the basis. In this method, rateable values are the open market annual rental value a property could have been let for at a certain date."
        },
        {
            "text": "This means what could be achieved in rent, rather than what is actually being paid."
        },
        {
            "text": "A property’s rateable value is not the same as its business rates bill. Local councils use the rateable value to calculate the business rates bill."
        },
        {
            "text": "Business rates bills are worked out when the local council multiplies the rateable value by a ‘multiplier’ then applies any rates relief."
        },
        {
            "text": "For example, in England, if an individual’s property had a rateable value of £10,000, the council would work out their business rates this way:"
        },
        {
            "text": "£10,000 (rateable value) x 49.9 pence (multiplier) = £4,990 (basic business rates)"
        },
        {
            "text": "In this example, the 2023 to 2024 small business multiplier is 49.9 pence. The multiplier depends on your rateable value."
        },
        {
            "text": "There are also different multipliers if your property is in Wales or the City of London. The multiplier is set by central government. You can read more about estimating your business rates."
        },
        {
            "text": "Can I get help with my bill?"
        },
        {
            "text": "Not all business properties pay business rates. You may be able to get business rates relief from your local council to reduce your bill. Reliefs include one for small businesses."
        },
        {
            "text": "Some reliefs are applied automatically and some you need to apply for. Contact your council to find out more. You should never have to pay anyone to apply for a relief."
        },
        {
            "text": "How can I find out more?"
        },
        {
            "text": "Set up a business rates valuation account to find out more about how your rateable value has been calculated."
        },
        {
            "text": "If you want to find out more about what we’ve covered here, watch our webinar on understanding business rates on our YouTube channel."
        },
        {
            "text": " "
        }
    ]
}