{
    "url": "https://nationalscreening.blog.gov.uk/2023/08/08/were-looking-for-an-experienced-screening-midwife-whod-like-to-help-the-work-of-the-uk-nsc/",
    "title": "We’re looking for an experienced screening midwife who’d like to help the work of the UK NSC",
    "authors": [
        "Tsitsi Muchayingeyi",
        "Jo Harcombe"
    ],
    "categories": [
        "General"
    ],
    "pub_date": "2023-08-08T08:51:52+01:00",
    "content": [
        {
            "text": "The UK NSC is looking to add dedicated midwifery expertise to its pool of expert professional clinical advisers (PCAs)."
        },
        {
            "text": "Our PCAs provide valuable advice and support to the committee, which in turn advises ministers and the NHS in the 4 UK countries about all aspects of screening."
        },
        {
            "text": "We are looking for an experienced antenatal and newborn (ANNB) screening coordinator or an experienced screening midwife who helps deliver the NHS ANNB screening programmes."
        },
        {
            "text": "Ideally, we are looking for someone who has specialist knowledge in screening and a keen interest in the development of future screening innovations."
        },
        {
            "text": "The PCA midwife’s expertise, and that of other stakeholders, will be crucial in helping to inform screening policy, pathway requirements and evidence-based training and competencies for midwives and other health care professionals."
        },
        {
            "text": "If you are a clinical, registered midwife with expertise in screening and maternity clinical pathways and are interested in supporting the work of the UK NSC team then we would like to hear from you."
        },
        {
            "heading": 2,
            "text": "UK NSC blog"
        },
        {
            "text": "The UK NSC blog provides up to date news from the UK NSC. You can register to receive updates direct to your inbox, so there’s no need to keep checking for new articles. If you have any questions about this blog article, or about the work of the UK NSC, please email screeninginformation@dhsc.gov.uk."
        }
    ]
}