{
    "url": "https://defrafarming.blog.gov.uk/2024/04/22/apply-now-for-a-water-screening-study/",
    "title": "Apply now for a water screening study ",
    "authors": [
        "Andy Turner"
    ],
    "categories": [
        "Farming and Countryside Programme"
    ],
    "pub_date": "2024-04-22T12:29:17+01:00",
    "content": [
        {
            "text": "Climate change affects the amount and timing of water availability, as well as demand. We want to support farmers and growers to plan for and secure a more resilient water supply."
        },
        {
            "text": "So, from today, small groups of farmers in England can apply for a Local Resource Option (LRO) screening study. "
        },
        {
            "text": "An LRO is a water resources scheme that improves the resilience or supply of water in a local area. "
        },
        {
            "text": "LRO screening studies are one way farmers and growers can better understand their options to improve the supply or resilience of water. "
        },
        {
            "text": "They complement the other actions that support water quality and resilience offered through the Sustainable Farming Incentive (SFI)."
        },
        {
            "text": "In this post, I’ll share the background, explain how the studies work and include links to learn more and apply. "
        },
        {
            "heading": 2,
            "text": "Background "
        },
        {
            "text": "The reliability of water for agriculture and horticulture is just as affected by heavy rainfall as it is periods of dry weather and drought."
        },
        {
            "text": "Earlier this month, we launched the Water Restoration Grants for those suffering from the worst effects of flooding."
        },
        {
            "text": "Although irrigation prospects for this summer are currently 'good', in the longer term, we expect to see more variability in water availability."
        },
        {
            "text": "This pressure is only going to grow."
        },
        {
            "text": "We want to help farmers and growers plan for this volatility."
        },
        {
            "text": " The Environment Agency has developed a methodology to identify what types of LRO could be possible in a given area and what scale of development and investment would be required to improve resilience. "
        },
        {
            "text": "Water resources consultants will work with you to identify, screen, and rank local water resource options. "
        },
        {
            "heading": 2,
            "text": "About the study "
        },
        {
            "text": "The studies can be used to identify, screen, and rank local water resource options for farmers/growers in a given area.  "
        },
        {
            "text": "Types of LROs include: "
        },
        {
            "text": "The studies can be applied in areas across England. These studies will provide location-specific, tailored results wherever it is applied. "
        },
        {
            "heading": 2,
            "text": "How the process works "
        },
        {
            "text": "The steps are broadly as follows:"
        },
        {
            "heading": 3,
            "text": "Read the guidance "
        },
        {
            "text": "On GOV.UK, you'll find the official LRO screening study guidance which explains what it is for, who is eligible and the application process. "
        },
        {
            "heading": 3,
            "text": "Form a group "
        },
        {
            "text": "Groups of farmers can apply to the Environment Agency to have a LRO screening study in their area. These groups are informal. It could be a case of simply joining forces with a neighbouring farmer or grower. "
        },
        {
            "heading": 3,
            "text": "Submit the application "
        },
        {
            "text": "One person in the group should take the lead and fill out the application form. "
        },
        {
            "text": "Once you're ready, email your application to the Environment Agency. The deadline to apply is 16 June 2024. "
        },
        {
            "text": "After reviewing your application, the Environment Agency will let you know the outcome. If your application is successful, an initial meeting with the Environment Agency team will be agreed."
        },
        {
            "text": " In the meeting, your application will be discussed and agreements will be put in place. The process to find a water resources consultant to complete the work will begin."
        },
        {
            "heading": 3,
            "text": "Consultant visit "
        },
        {
            "text": "The water resources consultants will undertake a site visit and learn more about your current water use, what your plans are for the future and what you'd like to achieve."
        },
        {
            "heading": 3,
            "text": "Screening  "
        },
        {
            "text": "The consultants will then run the screening and ranking methodology."
        },
        {
            "text": "There will be some input required from you and your farming neighbours during the screening process. "
        },
        {
            "text": "We expect projects to take 2-3 months to complete in full once the consultant has been appointed. "
        },
        {
            "text": "After the screening, you’ll receive report with suggestions."
        },
        {
            "text": "This will include high level cost and yield estimates and routes to implementation. The information will help you to make informed decisions on how to improve agricultural water resilience for you and neighbouring businesses."
        },
        {
            "text": "The report will not affect your current abstraction licence status, or the status of any applications. "
        },
        {
            "text": "We want farmers and growers to work together to identify the options and to assess which ones will maximise resilience, reduce risk and optimise cost. "
        },
        {
            "text": "Planning permission or permits (including any required abstraction licences) related to the suggested solutions won’t automatically be granted. The normal application processes still need to be completed."
        },
        {
            "text": "You can apply for a screening study and have a Sustainable Farming Incentive agreement. Take a look at the actions for soils in particular. They can  provide environmental benefits, such as better water quality, improved climate resilience and increased biodiversity."
        }
    ]
}