{
    "url": "https://defraenvironment.blog.gov.uk/2024/04/22/conservation-covenants-putting-environmental-commitments-into-law/",
    "title": "Conservation covenants: putting environmental commitments into law",
    "authors": [
        "Tim Andrews"
    ],
    "categories": [
        "Biodiversity net gain",
        "Green finance",
        "Land use",
        "Nature"
    ],
    "pub_date": "2024-04-22T14:43:43+01:00",
    "content": [
        {
            "text": "A conservation covenant is an agreement to conserve the natural or heritage features of some land. They are voluntary, private and legally binding."
        },
        {
            "text": "The agreement is made between a landowner and designated responsible body, which might be a:"
        },
        {
            "text": "A conversation covenant must include actions the landowner or responsible body will or won’t take. For example, they might include commitments to maintain woodland or to avoid using certain pesticides."
        },
        {
            "text": "Conservation covenants offer a flexible way to achieve environmental outcomes"
        },
        {
            "text": "A conservation covenant can be used for a variety of reasons. For example, one can be used to agree how land is managed to conserve habitat for rare species, or to contribute towards biodiversity net gain."
        },
        {
            "text": "Conservation covenants secure long-term outcomes because they bind present and future owners of the land. This means that the conservation commitments are passed onto future landowners."
        },
        {
            "text": "The agreements are particularly helpful because they offer flexibility. They provide a means of securing land for nature or heritage conservation, without needing to purchase the land."
        },
        {
            "text": "They can also help a landowner to secure payments for environmentally friendly actions. For example, through a conservation covenant, a water company might pay a landowner to manage woodland upstream from a section of the river that tends to flood."
        },
        {
            "text": "They expand the offsite market for biodiversity net gain"
        },
        {
            "text": "As I mentioned above, conversation covenants are a helpful tool for biodiversity net gain."
        },
        {
            "text": "The biodiversity net gain policy allows developers to, where required, buy ‘ biodiversity units’ from pockets of protected land that sit outside of the development area."
        },
        {
            "text": "Conservation covenants present an opportunity to facilitate and enable the biodiversity net gain offsite market."
        },
        {
            "text": "This is because they provide a flexible alternative to section 106 agreements, which must be made through local authorities, normally as part of a planning application."
        },
        {
            "text": "While local authorities can become designated responsible bodies, importantly so can public sector bodies, eNGOs and other organisations from the private sector."
        },
        {
            "text": "Becoming a designated responsible body has multiple benefits"
        },
        {
            "text": "Conservation covenants present an opportunity for public companies and charities to benefit from emerging markets for biodiversity and ecosystem services."
        },
        {
            "text": "Organisations that become responsible bodies will also help conserve important nature and heritage features of our landscape."
        },
        {
            "text": "If you are a designated responsible body, your details will be publicly available to landowners who are looking to create a conservation covenant."
        },
        {
            "text": "We would like more eligible organisations to apply to become designated responsible bodies."
        },
        {
            "text": "So far, we have designated 5 organisations. We are currently considering a further 20 applications – but there is no limit on the number of responsible bodies Defra can designate."
        },
        {
            "text": "If you are interested in becoming a designated responsible body, please read the criteria and application guidance."
        },
        {
            "text": "\nKeep informed by subscribing to the blog"
        },
        {
            "text": "Please subscribe to this blog to receive an email notification when we publish a new post."
        },
        {
            "text": "If you are only interested in seeing posts related to biodiversity net gain, bookmark the biodiversity net gain category page."
        }
    ]
}