{
    "url": "https://moderncivilservice.blog.gov.uk/2024/04/22/environmental-principles-putting-nature-at-the-heart-of-our-policy-making/",
    "title": "Environmental principles: putting nature at the heart of our policy making",
    "authors": [
        "Government Reform"
    ],
    "categories": [
        "A Modern Civil Service",
        "Ambitious",
        "Data science",
        "Government Reform",
        "Modernisation and Reform",
        "Policy",
        "Proud Civil Servant"
    ],
    "pub_date": "2024-04-22T11:00:35+01:00",
    "content": [
        {
            "text": "Environmental principles — how does it fit into the vision for a Modern Civil Service? A Modern Civil Service is about being skilled, innovative and ambitious – and equipped for the future.  The environmental principles duty is an excellent example of an ambitious Civil Service working together to leave the environment in a better state for future generations. "
        },
        {
            "text": "Almost everyone has heard of the Public Sector Equality Duty (PSED) which came into force on the 5 April 2011, 13 years ago. Equality must be considered when developing policy and delivering for the public. The Environmental Principles Duty which came into force on November 1st 2023, similarly requires us to consider the environment when developing policy.  "
        },
        {
            "text": "Environmental principles duty – what’s it all about? "
        },
        {
            "text": "Having witnessed the persistent trend in the decline of nature and listened to the communities we serve, we have delivered a system that places environmental considerations at the heart of policymaking across government. To make this happen the environmental principles were introduced as part of Environment Act 2021. As a legal duty, Ministers of the Crown must have due regard to the environmental principles policy statement when making policy. "
        },
        {
            "text": "The principles are designed to guide policymakers towards opportunities to prevent environmental damage and enhance the environment. These are internationally recognised as successful benchmarks for environmental protection and enhancement. "
        },
        {
            "text": "How are we supporting you?   "
        },
        {
            "text": "The Department for Environment, Food and Rural Affairs (DEFRA) are at the forefront of improving protection for the environment and are leading work to make all those potentially affected by the new duty aware of its requirement and the action that they need to take. DEFRA is firmly in delivery mode and has already done a lot of work to support government departments. For example, we have: "
        },
        {
            "text": "What’s on the horizon? "
        },
        {
            "text": "Policymakers across government are asked to consider environmental effects of policies, and then proportionately apply five environmental principles:"
        },
        {
            "text": "What should I do now? "
        },
        {
            "text": " "
        }
    ]
}