{
    "url": "https://dluhcdigital.blog.gov.uk/2024/04/22/join-the-funding-service-design-team/",
    "title": "Join the Funding Service Design team",
    "authors": [
        "Ruth Keeling, Service Owner, Funding Service Design"
    ],
    "categories": [
        "Careers",
        "Funding service design"
    ],
    "pub_date": "2024-04-22T09:56:33+01:00",
    "content": [
        {
            "text": "DLUHC’s Funding Service Design team is improving DLUHC’s funding service – we are redesigning key elements to improve the user experience and reduce the administrative burden and costs of distributing funding. "
        },
        {
            "text": "To do this, we need to grow our team and so we are recruiting developers, user researchers and interaction designers. "
        },
        {
            "text": "On Thursday, 25 April, and Friday, 26 April, we are holding our first virtual Digital Recruitment Days.  "
        },
        {
            "text": "Our goal is to meet people who are interested in the roles we are looking to fill and give them a chance to find out more about us and our work. For the right people, we’re looking to make job offers immediately after the event. Find out more and apply to attend:  "
        },
        {
            "heading": 2,
            "text": "What our colleagues like about their jobs "
        },
        {
            "text": "To help potential candidates decide whether one of our roles is right for them, we asked our teammates what they liked about their job and their team. They had loads of feedback and we have grouped it into 4 buckets: our mission, the products and tech, the work, and the team. "
        },
        {
            "heading": 3,
            "text": "The mission "
        },
        {
            "text": "Our colleagues said they value: "
        },
        {
            "heading": 3,
            "text": "The products and the technology "
        },
        {
            "text": "Our colleagues said they like: "
        },
        {
            "heading": 3,
            "text": "The work "
        },
        {
            "text": "Our colleagues said they value: "
        },
        {
            "heading": 3,
            "text": "The team "
        },
        {
            "text": "Our colleagues said they like: "
        },
        {
            "heading": 2,
            "text": "Meet us at our virtual recruitment days "
        },
        {
            "text": "If it sounds like something you’d like to be part of, join us and let’s chat.  "
        },
        {
            "text": "Use the links at the top of this post to apply and attend. "
        },
        {
            "text": "If you have any questions, contact our recruitment team: digitaldatajobs@levellingup.gov.uk.  "
        }
    ]
}