{
    "url": "https://governmentscienceandengineering.blog.gov.uk/2024/04/22/many-happy-returns-for-earth-day-2024/",
    "title": "Many Happy Returns for Earth Day 2024",
    "authors": [
        "gseprofession"
    ],
    "categories": [
        "Blog Series",
        "Guest Blog"
    ],
    "pub_date": "2024-04-22T15:54:10+01:00",
    "content": [
        {
            "text": "For Earth Day 2024, we caught up with world renowned chemist, Professor Anthony Ryan, OBE, from the University of Sheffield to find out about an innovative project on plastic reuse funded by UKRI.  "
        },
        {
            "text": "The Grantham Centre at the University of Sheffield is fully engaged in the Earth Day 2024 ambition of ending plastics pollution, but how are we achieving this? Through a UKRI-funded project called Many Happy Returns, we are working on reusable- packaging systems to reduce the need for single-use plastic.  "
        },
        {
            "text": "Recycling has become the norm for addressing plastic waste, but recycling can be challenging – and it can encourage a throwaway culture. Instead of recycling, the Many Happy Returns project explores reusable-packaging systems as part of a plastics circular economy. This goes beyond recycling, as we believe by keeping packaging material in circulation for as long as possible, reuse systems reduce leakage into the environment and the resultant environmental damage. "
        },
        {
            "text": "Even though the focus is on reusable-packaging systems, the Many Happy Returns team is not just comprised of the usual suspects. As well as scientists and engineers, we also have researchers from the University of Sheffield’s English and Psychology Departments in the multidisciplinary team involved in the initiative.  But what role does a linguist have in reducing plastic waste? And why are insights from psychology useful?  "
        },
        {
            "text": "Well, a reuse system is no good if people won't use it. So, we explored the language that is used by people and organisations to describe plastics and identified how language can be used as a tool to change behaviour. Psychologists used packaging that had been manipulated by mechanical engineers to help us to identify what people are willing to reuse, what factors influence these decisions, and at what point reuse becomes unacceptable for the consumer, for example when a bowl is too stained or scratched.  "
        },
        {
            "text": "Our chemical engineers conducted life cycle analyses to study reuse systems and identify which types of products had the most potential for reuse.  Our chemists and mechanical engineers developed criteria to select the best materials for reuse systems. They answered the specific question ‘how many times do you have to reuse to get ahead on sustainability?’ The answer to this question depends on many things; the materials used, their relative weights, the collection and washing processes, and is typically between 10 and 100 uses.   "
        },
        {
            "text": "We have also studied consumer reactions to reusable packaging and the role of language in encouraging reuse as well, as the technical and scientific basis for making reusable packaging work. Together with manufacturers, designers, brand owners, retailers and policy makers, we have developed design and use guidelines for takeaway packaging based on a pilot study in the living laboratory of the University of Sheffield cafes. "
        },
        {
            "text": "Just like Earth Day 2024, the Many Happy Returns team is committed to end plastic pollution for the sake of human and planetary health.  But the team also recognises that plastics are completely embedded in our lives; ending plastics by replacing them with other materials could do even more damage to planetary health, because in most cases, the paper, metal or glass that replaces them can have a damaging effect.  Many Happy Returns seeks to provide a solution to end plastic pollution and create a plastics circular economy.  "
        },
        {
            "text": " "
        },
        {
            "text": "By Professor Anthony J. Ryan, OBE, Department of Chemistry, University of Sheffield"
        }
    ]
}