{
    "url": "https://forestrycommission.blog.gov.uk/2024/04/22/tackling-plastics-in-woodland-creation/",
    "title": "Tackling plastics in woodland creation",
    "authors": [
        "Katie Goldsbrough"
    ],
    "categories": [
        "Climate change and resilience",
        "Tree Planting",
        "Woodland creation"
    ],
    "pub_date": "2024-04-22T11:10:37+01:00",
    "content": [
        {
            "text": "Earth Day 2024 has a theme of Planet vs. Plastics, aiming to raise awareness about the problem of plastics and inspire change. It seems like a good time to share with you what we are doing to try to reduce plastic pollution in woodlands. We’ve been supporting recycling schemes, and creating and sharing guidance in collaboration with a variety of partners on projects across England. But what are the main problems we're attempting to tackle?"
        },
        {
            "heading": 3,
            "text": "Tree guards"
        },
        {
            "text": "Tree guards, also called tree tubes or shelters, were originally used in forestry to encourage straight growth to produce good-quality timber. Plastic tree protection was first created back in 1979 for this purpose but since then has also been used as a protection method from being eaten by large populations of mammals such as deer, squirrels and voles.  Tree guards as a way of protecting trees has become standard practice in forestry across the UK."
        },
        {
            "heading": 3,
            "text": "The problem of plastic"
        },
        {
            "text": "Using plastic as a material for creating tree guards has allowed for cheap, effective, durable protection for trees over the decades. It is recommended that tree guards are removed from the trees after around 7 to 10 years. By this point the tree should be strong and tall enough to no longer need protection. However, we know that removing them during this timeframe has not often been the case over the last four decades, which has led to a problem of plastic pollution in woodlands."
        },
        {
            "heading": 3,
            "text": "What are we doing?"
        },
        {
            "text": "In recent years, plastic pollution has been highlighted as a large-scale environmental issue and studies have shown a variety of problems that plastics of all types, shapes and sizes can cause in different environments and to different species. Before the hazards of plastic were understood as fully as they are today, plastic tree guards were once sold as being able to be left out in the environment. We now know this is not the right thing to do and we need to action 2 main priorities."
        },
        {
            "text": "Here at the Forestry Commission, we are part of a variety of partnerships to help reduce single-use and temporary plastics in woodlands. Here are some of the projects and activities we are involved in."
        },
        {
            "heading": 3,
            "text": "Forest Plastics Working Group"
        },
        {
            "text": "We are members of this working group that focuses solely on plastics in the forestry sector. By sitting on the committee, we can stay up to date with the latest research and knowledge, and be able to influence and help this movement go forward and grow. Find out more about the Forest Plastics Working Group."
        },
        {
            "heading": 3,
            "text": "Tree guard recycling hubs"
        },
        {
            "text": "We support recycling opportunities across England for the sustainable disposal of tree guards. We directly supported a free Tubex recycling hub in Essex in 2023 which recycled more than 5,000 polypropylene tree guards. This is the equivalent of more than four hectares of woodland creation!"
        },
        {
            "text": "This year, we will be supporting the Essex hub for the second year and a new free hub based in Suffolk."
        },
        {
            "text": "Find more information locate other hubs,"
        },
        {
            "heading": 3,
            "text": "Plot That Plastic App"
        },
        {
            "text": "We have supported the Forest Plastics Working Group in the creation of a citizen science app to map where plastic tree guards are in the environment across the UK. This will help to build a data set to plan their removal in the future and facilitate new recycling hub locations. This project is for everyone to participate in so please submit your sightings to start plotting that plastic."
        },
        {
            "heading": 3,
            "text": "Managing deer populations"
        },
        {
            "text": "It is difficult to reduce the need for plastic tree protection whilst the pressures we need to protect the trees from are increasing year-on-year. The large boom in the population of deer over the decades has led to a significant negative impact on our woodlands and trees. We need to reduce the pressures that our trees are facing to more sustainable levels to begin to extensively phase out the need for tree protection. You can find out more about reducing the impact of deer in this blog."
        },
        {
            "heading": 3,
            "text": "More guidance & information:"
        },
        {
            "text": "You can take a look at the UK Forestry Standard to find out more about the government's approach to sustainable forestry. This document states what is expected within the forestry sector, and offers specific guidance on plastic tree shelters and guards."
        },
        {
            "text": "Establishing trees and woodlands is incredibly important, not only to reaching our target of 16.5% tree cover by 2050, but also doing something now to tackle climate change, the biodiversity crisis, and to bring about a greener and healthier country. Tree guards have played a vital role in this but should not be contributing to the wider environmental issue of plastic pollution. We’ll continue to work hard with our partners to find sustainable ways of planting trees whilst reducing the long-term plastic impact."
        }
    ]
}