{
    "url": "https://naturalengland.blog.gov.uk/2022/03/16/green-paper-can-herald-nature-recovery/",
    "title": "Green Paper can herald Nature recovery",
    "authors": [
        "Tony Juniper"
    ],
    "categories": [
        "Biodiversity",
        "Climate change",
        "Environment Act",
        "Nature Recovery Network",
        "Protected sites and species",
        "Wildlife"
    ],
    "pub_date": "2022-03-16T14:29:34+00:00",
    "content": [
        {
            "text": "The Nature Recovery Green Paper starts a critical debate about how we can recover the health of the natural world upon which we all depend."
        },
        {
            "text": "Its sweep is such that the ways in which we have conserved Nature for more than seven decades could be radically transformed, including the historic step of going beyond protecting the remnants of habitats and rare species to additionally setting the scene for recovery, through expanding wild areas and halting and reversing the decline in wildlife abundance."
        },
        {
            "text": "The official approach to conservation that we use today dates back to the 1949 National Parks and Access to the Countryside Act, a ground-breaking piece of law that introduced long-standing protections such as Sites of Special Scientific Interest and National Nature Reserves. Over the years it has been refined and supplemented by many further pieces of domestic and international legislation, notably the European Community Directives for the management and protection of habitats and species of European importance."
        },
        {
            "text": "The world today is very different from 1949, however. Our population’s demand for housing, transport and resources such as food, water and energy has placed a strain on Nature. At the same time, people’s relationship with the natural world has been deepened by their experiences during the COVID pandemic and justifiable concern at the climate and biodiversity emergency. The calls for something better and more sustainable come not just from the public, but from government too. If we are going to manage these pressures, while facilitating Nature’s recovery, it seems clear to me that we need a new approach."
        },
        {
            "text": "That new approach already has a potentially powerful new policy tool kit, including new farming policies, our national programme for peatland recovery, targets for woodland expansion, Nature-based flood management, plans for improving water quality, the new spatial planning tool of Local Nature Recovery Strategies, Biodiversity Net Gain and what I hope will be alignment between Nature recovery and any reforms to the planning system. In addition to this are many private rewilding projects, the work of conservation groups and the contribution of private sector companies, including water and minerals companies."
        },
        {
            "text": "All of this can help us to fulfil our pledge to have 30 per cent of land and sea protected by 2030, and to halt the decline in the abundance of wildlife by then too – just eight years away. On top of these official goals (which are now also being consulted upon) will be other legally-binding, long-term targets under the Environment Act. The Government must set at least one target in each priority area (water, air quality, biodiversity and waste/resource efficiency), as well as on species abundance. Meeting these targets, however, also needs us to review the regulatory framework for Nature, including the way we protect sites and species and how we drive Nature recovery, as well as Nature protection. When all of this is put together, it could be transformative, so long as it is plugged into an overarching framework that can integrate these different plans."
        },
        {
            "text": "That framework is a nationwide Nature Recovery Network, based on the building blocks of protected sites that we already have, but going beyond those to create the more, bigger, better and connected areas of habitat that the science tells us we must have if we are to meet our targets."
        },
        {
            "text": "The Green Paper offers opportunities to lay the foundations for this: through streamlining and modernising the existing protected area regime, while at the same time creating a new spatial designation for Nature recovery, thereby generating the template to use all the tools I mentioned above to deliver the Nature Recovery Network."
        },
        {
            "text": "The regime we have now has done a sterling job of protecting the most threatened, and we need to retain those hard-won victories at all costs. But in itself it is not now sufficient to maintain the quality of these sites and certainly not enough to drive Nature recovery everywhere."
        },
        {
            "text": "One challenge will be to embrace all of the complexity that this entails in a revised approach that also makes the process transparent and useable to a wide range of different interests. This is an aim of the Green Paper, and will require us all to invest in some thoughtful reflection on how best to maintain or enhance the protections we already have, and going beyond that into recovery, while making it easier for the many different interests who own or manage land and sea to play their part in as smooth a manner as possible."
        },
        {
            "text": "On the important subject of how we actually deliver all of this for Nature recovery, the Government is also taking the opportunity to invite views on whether the Defra Group structures and responsibilities could be changed for the better, not only on land but in the marine environment too."
        },
        {
            "text": "On both land and sea, it seems to me that a major determination of our overall success for Nature recovery will be down to the effective delivery of the multiplicity of policies and targets in particular places, and to do that in common cause with the many interests working and living in those places. My logic follows the simple observation that if we don’t do Nature recovery in particular places, then we won’t do Nature recovery, so having that place-making capability to bring all the tools together is vital. This is why, in 2019, Natural England adopted its new mission of ‘building partnerships for Nature’s recovery’, to recognise the need for action at landscape scale with multiple partners working together. I hope that what we have already set out in our action planning and are already doing on the ground can help to inform the future thinking about delivery models."
        },
        {
            "text": "The Green Paper comes of course at a very tense time. As the country was beginning to return from the dreadful effects of the pandemic, a European war has broken out, bringing in its wake unprecedented threats to peace and security beyond the appalling events unfolding in Ukraine. This is leading some to suggest that environmental targets can no longer occupy the priority that they have increasingly had, with a need to shift emphasis toward increasing food production and holding back on net zero ambitions. This would, though, be a grave mistake."
        },
        {
            "text": "Environmental security is every bit as vital as energy and food security and failing to take steps now, while there is still a window of opportunity to avoid the worst impacts of the Nature and climate change emergencies, will ramp up huge costs later on."
        },
        {
            "text": "We might take some inspiration from those who put in place the building blocks of safeguards for our natural environment back in the 1940s. During the depths of the Second World War plans were laid here for what became that ground-breaking post-war Act of Parliament in 1949, the one that meant that today we actually have some natural assets left from which we can plan Nature’s recovery."
        },
        {
            "text": "It was no accident that those plans were set out then, in a period of misery, stress and destruction. They were planning for a better post-war world, one in which people would enjoy the benefits of Nature. Today the stakes are considerably higher, not only in relation to the potential horrors of where a modern war might take us, but also in relation to the perilous state of the natural environment."
        },
        {
            "text": "This Green Paper comes at a pivotal moment, when the evidence pointing to the state our environment has never been stronger, nor more troubling. It is a moment for positive engagement in helping to define a system of Nature recovery that will serve us well for the next 70 years – building on the foundations of the work started 70 years ago, moving to the next stage, adding recovery to the task of protection."
        },
        {
            "text": "Natural England will be working with Defra to set out the changes we think are necessary to reverse the declines in Nature and put us firmly on the path to a Nature-positive future. Pursuing change is not without risk, but perhaps the greater risk is that we fail to acknowledge that we can and must do better for Nature."
        },
        {
            "text": "Tony Juniper CBE, Chair of Natural England"
        }
    ]
}