{
    "url": "https://ukhsa.blog.gov.uk/2022/03/16/health-security-labs-keeping-us-on-the-front-foot-in-the-fight-against-health-hazards/",
    "title": "Health security labs: Keeping us on the front foot in the fight against health hazards",
    "authors": [
        "Blog Editor"
    ],
    "categories": [
        "UKHSA science"
    ],
    "pub_date": "2022-03-16T12:31:24+01:00",
    "content": [
        {
            "text": "The scientific capabilities and technologies at our health security laboratories, including those in our science campuses at Porton Down, Chilton and Colindale and our regional labs, are at the core of our mission to protect people from all health hazards."
        },
        {
            "text": "Our network includes reference laboratories, labs studying hazards in food, water and the environment, labs carrying out assessment of exposures to toxic substances or radiation and high containment facilities where we work with the most dangerous pathogens like Ebola."
        },
        {
            "text": "Some of these capabilities are highly specialised, and either rare or unique in the country, and we maintain them ready to respond to any emergency."
        },
        {
            "text": "In this blog, published for British Science Week, we are looking at one of our largest sites at Porton Down, near Salisbury, in the south of England."
        },
        {
            "text": "Since the start of the pandemic, it has paved the way in our understanding of COVID-19 and played a vital role in the development and evaluation of vaccines that have saved countless lives."
        },
        {
            "text": "But the importance of our laboratories at Porton stretches far beyond the work the pandemic. Its work over many decades has impacted the lives of nearly every person in the UK, and many others in countries around the world."
        },
        {
            "text": "Since its inception in 1940, when microbiological research began under the UKHSA’s predecessor organisations, the site has played a critical role in protecting people from serious biological threats, from Ebola and Lassa Fever to anthrax."
        },
        {
            "text": "But what goes on at one of the world’s foremost scientific locations? We spoke to one of UKHSA Porton Down’s Scientific leaders, Dr Bassam Hallis, to find out."
        },
        {
            "text": "“UKHSA really is at the forefront in terms of analysing infectious diseases,” he said. “We are lucky enough to have world leading research technology at our fingertips, and the scale of our facilities means we can comfortably handle and analyse the highest grades of infectious diseases in the world."
        },
        {
            "text": "“The quality of our work means we are able to satisfy the strict requirements of global regulatory bodies, such as the MHRA in the UK, the FDA in the USA and the EMA, across the European Union."
        },
        {
            "text": "“This enables us to play a vital role in providing reliable evidence on infectious diseases and how they can be prevented. So, our work is robust, reputable and recognised around the world.”"
        },
        {
            "heading": 2,
            "text": "Emergency response"
        },
        {
            "text": "The scale and diversity of expertise on-site at Porton Down enables speed and agility in its testing capabilities - two vital components in times of emergency."
        },
        {
            "text": "This was no more apparent than in early 2020, when the emergence of COVID-19 triggered the rapid establishment and scaling up of key services, including extensive microbiological containment facilities to handle and test this new and unknown virus."
        },
        {
            "text": "One of the site’s largest contributions through the pandemic has been in vaccine development, testing effectiveness of different vaccines against the original strain of the virus (known as wild-type) and subsequent variants ever since. This work has informed the vaccination programme in the UK and elsewhere."
        },
        {
            "text": "Other research has included seroepidemiology studies (screening blood for past exposure to infection) to understand the population’s immune status from natural infection and vaccination, and quality testing of lateral flow devices to ensure the rapid tests we use in the UK are able to detect emerging variants."
        },
        {
            "text": "Studies on viral transmission (how easily the virus is passed from person to person) and environmental survival (how long it stays on surfaces) have also contributed evidence to guide our day-to-day behaviours during the pandemic, such as wearing masks."
        },
        {
            "text": "And the site’s ability to isolate and grow strains of COVID-19, and run multiple complex tests simultaneously, has helped accelerate learning on how we can stop the virus."
        },
        {
            "text": "But COVID-19 is just one of many infectious diseases dealt with at Porton. Most recently, scientists at the labs diagnosed what was the first known case of Lassa Fever in the UK since 2009."
        },
        {
            "text": "Their work to quickly identify the disease triggered important contact tracing of others who may have been exposed."
        },
        {
            "text": "It has been a similar story in the identification of rare cases of Monkeypox and other infectious diseases over many years, as Dr Hallis explained:"
        },
        {
            "text": "“When someone falls seriously unwell with a rare infectious disease, it is not always obvious what is causing it. The GP or whoever has assessed the patient will gather important information like their travel history and the known symptoms. Once these have been identified, we can test the samples, hopefully identify the disease quickly, and then work with other colleagues to track all of that person’s contacts, take samples from all of them and test to make sure we are on top of any potential spread."
        },
        {
            "text": "“These are really important interventions and without the clinical confirmation of what we are dealing with, our public health teams would really be working in the dark.”"
        },
        {
            "heading": 2,
            "text": "Vaccine development"
        },
        {
            "text": "Scientists at Porton Down carry out regular detailed analyses of a variety of infectious diseases. This work helps identify characteristics of the viruses which help inform the development of the vaccines and medicines used to combat them."
        },
        {
            "text": "This has been particularly important since the emergence of COVID-19, and the information provided by UKHSA scientists enabled the UK to be one of the first countries in the world to roll out a licensed vaccine."
        },
        {
            "text": "Dr Hallis said: “All viruses evolve and mutate over time, so it’s important we continually review the medical response. We work with other organisations and test samples of variants as they arise so we can monitor the vaccine’s effectiveness. This helps us decide whether we need a new vaccine or a new combination to provide the best protection.”"
        },
        {
            "text": "This insight into the behaviour of viruses is vital for vaccine manufacturers looking to ensure their products provide the best level of response. This is true in both the development of new vaccines, such as with COVID-19, but also new types of vaccines tackling well-known illnesses."
        },
        {
            "text": "Research conducted at Porton Down was instrumental in the licensing of a flu vaccine for children, administered via a nose spray, rather than injection."
        },
        {
            "text": "“We are constantly looking to push the boundaries and make sure we are at the forefront of what is possible,” said Dr Hallis. “We did all the testing for the nose spray vaccine and pioneering work like this ensures we can increase accessibility for people to these important medicines.”"
        },
        {
            "text": "Early assessments of the COVID-19 virus also provided vital information that could be fed to manufacturers via collaborative working groups. This information helped develop effective vaccines in record time."
        },
        {
            "heading": 2,
            "text": "Global knowledge sharing"
        },
        {
            "text": "UKHSA’s status as a globally recognised institution is achieved in part for the knowledge, data and information it shares with science and policy colleagues around the world."
        },
        {
            "text": "This has proved vital during the recent pandemic, during which Porton has led the way in testing the effectiveness of the COVID-19 vaccines. This data has been shared with countries around the world to inform their own public health responses and vaccine rollouts."
        },
        {
            "text": "Scientists at Porton Down have also been instrumental in training global colleagues in how to effectively handle outbreaks of infectious disease."
        },
        {
            "text": "During the Ebola outbreak in 2013, scientists from the UKHSA facility were sent to Guinea to provide their expertise."
        },
        {
            "text": "Dr Hallis explained: “Usually our teams are training NHS staff but during that time we were working with medics, the Army and many others who were going to be deployed in Western Africa on a number of aspects. Firstly, we were training them in the basics of how to wear their PPE, how to safely take it off and dispose of it, and general good practice to prevent the spread."
        },
        {
            "text": "“Secondly, we sent people to the region to help with running diagnostic tests on the samples and training local scientists in the assessment of this particular virus. And thirdly, we set up a lab in Guinea where we could carry out clinical trials to help develop a vaccine. So, we were able to bring our expertise and ensure everything was in place to produce an effective response.”"
        },
        {
            "text": "The Ebola work is just one example of the kind of global support scientists at Porton Down provide. There has been similar knowledge-sharing during the Covid response, and multiple countries have had their own vaccines tested at Porton to assess their effectiveness."
        },
        {
            "text": "Moving forward, with the recent opening of a new laboratory dedicated to testing new COVID-19 vaccines and variants, Porton Down will continue to play a vital role in the UK’s biosecurity."
        },
        {
            "text": "Dr Hallis said: “Our role now is as important as it has ever been, and we don’t yet know what we will face from COVID-19 in the future. Our job is to ensure our research continues to provide reliable data and analysis to help inform our response to the pandemic and other biological threats. We want to remain on the front foot as far as we can and facilities like Porton Down are vital if we are to achieve that.\""
        }
    ]
}