{
    "url": "https://grantscommunity.blog.gov.uk/2022/03/16/helping-uk-businesses-to-grow-through-exporting/",
    "title": "Helping UK businesses to grow through exporting",
    "authors": [
        "andrewsayer"
    ],
    "categories": [
        "Digital transformation",
        "Grants Applicant Programme",
        "User research"
    ],
    "pub_date": "2022-03-16T08:47:38+00:00",
    "content": [
        {
            "text": "Are you a beauty or fashion professional looking to broaden your international network and discover the latest trends?"
        },
        {
            "text": "Are you trying to break into the global maritime industry and want to forge partnerships and find new business opportunities?"
        },
        {
            "text": "Are you thinking about exhibiting at an international tradeshow but not sure how to go about it?"
        },
        {
            "text": "Then my team and I might be able to help you and many other small to medium-sized business leaders - across a range of industries - to learn about international tradeshows and help you build your business overseas."
        },
        {
            "text": "We want to help you reach your full potential by joining you up with experts to give you support, help you attend or exhibit at tradeshows and offer some grant funding for those who need it."
        },
        {
            "text": "In short, businesses from every part of the United Kingdom can get in touch with us to start a conversation about learning about the benefits of international tradeshows overseas."
        },
        {
            "heading": 2,
            "text": "UK Tradeshow Programme"
        },
        {
            "text": "Entrepreneurs told us that taking those first steps towards international trading for a young or small company could be nurtured with some training and support."
        },
        {
            "text": "That support is available now to help eligible businesses to explore how the Department for International Trade can help you learn about international trade events."
        },
        {
            "text": "For those thinking about exporting for the first time or growing their existing market, the benefits of building connections with potential new clients, customers and new alliances and partnerships can be transformational."
        },
        {
            "heading": 2,
            "text": "What's on offer"
        },
        {
            "text": "You can get support to learn about tradeshows in general and also specifically about the tradeshow that we are providing support for and that you want to attend. This will ensure that you arrive at the event in the best position to get the most out of it. Some financial support may also be available."
        },
        {
            "text": "The tradeshows for which you can get support are updated regularly. If you want to exhibit we have a number of supported events that you can apply for right now. The deadlines to apply for some of these are looming so don’t delay, as applications to DIT must be made at least 6 weeks before the start of the event. To find out which events are supported please click here."
        },
        {
            "text": "If you are not geared up for exhibiting yet and you want to simply attend an event to see if it might be right for you in the future, we also have a wide range of events that you can apply for support to attend - check out our web page. But to whet your appetite, we cover a range of diverse industries including fashion to defence, from food and drink, to environmental water treatment."
        },
        {
            "text": "If you want to put your business in the international shop window, we can help."
        },
        {
            "heading": 2,
            "text": "Looking for more information on other grants?"
        },
        {
            "text": "If these grants aren’t for you, there are others provided by the government, which you may not have heard about."
        },
        {
            "text": "We want to change that.  That is why we are working with colleagues in the Grants Applicant Programme, who are creating a pilot service to make it simpler, faster and fairer to find and apply for grants."
        },
        {
            "text": "UKTP is part of the pilot, with a small but growing number of other grants administrators, to trail a single online place for government grants. If it is successful, we will make the case for it to be rolled out across all government grants"
        },
        {
            "text": "If you want to find out more, sign up to the Government Grants Community - where you will get more information on how you can work with us to co-create a forthcoming grants service."
        },
        {
            "heading": 2,
            "text": "And finally..."
        },
        {
            "text": "Exports support millions of jobs, enable small businesses to increase their productivity, and extend the UK’s economic ties across the globe."
        },
        {
            "text": "So what are you waiting for!"
        },
        {
            "text": "Andy Sayer"
        },
        {
            "text": "Department for International Trade"
        }
    ]
}