{
    "url": "https://educationhub.blog.gov.uk/2022/03/how-we-help-schools-and-colleges-support-pupils-with-dyslexia/",
    "title": "How we help schools and colleges support pupils with dyslexia",
    "authors": [
        "Media Officer"
    ],
    "categories": [
        "dyslexia",
        "Schools",
        "SEND"
    ],
    "pub_date": "2022-03-16T16:53:38+00:00",
    "content": [
        {
            "text": "It is critical that children experiencing Special Educational Needs and Disabilities (SEND), get the right support – so their needs are identified and met at an early stage."
        },
        {
            "text": "Here we look at how we support schools to help students with dyslexia."
        },
        {
            "heading": 3,
            "text": "We help schools identify and meet the needs of pupils with dyslexia"
        },
        {
            "text": "Dyslexia is a Specific Learning Difficulty that primarily affects the skills involved in accurate and fluent reading and spelling."
        },
        {
            "text": "We have put measures in place to identify pupils who are facing challenges with reading and literacy, and to help teachers understand how to support them. Our SEND Code of Practice is clear that meeting the needs of a pupils with dyslexia does not require a diagnostic label or test. Instead, we expect teachers to monitor the progress of pupils and put support in place where needed."
        },
        {
            "text": "Schools carry out a number of standardised assessments to measure progress and help teachers identify where additional support with literacy may be required through the Phonics Screening Check and End of Key Stage 1 and Key Stage 2 assessments."
        },
        {
            "text": "Systematic phonics is the best-evidenced way to teach children to decode the English alphabetic code and is most effective when combined with a language-rich curriculum."
        },
        {
            "text": "By ensuring high quality phonics teaching, the Government wants to improve literacy levels and give all children a solid base to build on as they progress through school."
        },
        {
            "text": "We are updating a published list of high-quality systematic synthetic phonics programmes aimed at Reception and Year 1. Programmes offer robust guidance on the effective assessment and monitoring of pupil progress, and support teachers to meet the needs of pupils who are struggling with early reading."
        },
        {
            "text": "Parents and carers can also discuss their child’s needs with their school’s Special Educational Needs Co-ordinator (SENCO). All mainstream schools should have a SENCO who can offer advice."
        },
        {
            "text": "They have day-to-day responsibility for the operation of SEN policy in the school and co-ordination of specific provision made to support individual pupils with SEN, such as dyslexia."
        },
        {
            "heading": 3,
            "text": "We provide support to teachers"
        },
        {
            "text": "All teachers are teachers of SEND and high-quality teaching is central to ensuring those with SEND are given the best possible opportunity to achieve at school and in later life."
        },
        {
            "text": "We are committed to ensuring the development of teachers' and educational professionals' skills, and promoting evidence-based, effective practice within schools and other education settings."
        },
        {
            "text": "The revised Initial Teacher Training Core Content Framework and Early Careers Framework, which all new entrants to the profession benefit from, have been designed around how to support all pupils to succeed, including those with SEND."
        },
        {
            "text": "Once qualified, teachers have access to DfE-funded training which provides resources to promote high-quality teaching for pupils with neurodiverse conditions."
        },
        {
            "text": "This includes an offer for training in using assistive technology, which can reduce or remove barriers to learning for children with SEND."
        },
        {
            "text": "In February 2022, we announced more than £45 million of continued targeted support for families and parents of children with SEND and SEND services."
        },
        {
            "text": "This includes funding that will directly support schools and colleges to work with pupils with SEND."
        },
        {
            "heading": 3,
            "text": "We are working hard to improve support for pupils and teachers"
        },
        {
            "text": "We recognise that there is more that can be done and are committed to ensuring that all children and young people receive a world-class education that sets them up for life."
        },
        {
            "text": "A key priority for the Department is delivering the Government’s Levelling Up ambitions, including that 90% of children leaving primary school in England are reach the expected standard in reading, writing, and maths by 2030. We recognise that this is an ambitious target which will require schools to support all pupils if this is to be achieved."
        },
        {
            "text": "Our strategy to improve literacy and numeracy outcomes for all children carefully considers how we do this for vulnerable or disadvantaged groups, including children on Free School Meals or those with SEND."
        },
        {
            "text": "The upcoming Schools White Paper will set out our plans to better identify children at risk of falling behind and provide them with the support they need."
        },
        {
            "text": "The White Paper sets the foundations to support the ambitions of the SEND Review, which aims to ensure that all children and young people with SEND get the educational, health and care support they need, identified promptly, delivered in a setting that can support them. This is due to be published as a Green Paper by end of March."
        }
    ]
}