{
    "url": "https://educationhub.blog.gov.uk/2022/03/16/i-will-continue-to-listen-to-young-people-and-their-parents-so-we-can-get-this-right-children-and-families-minister-will-quince-on-support-for-pupils-with-dyslexia-and-other-special-educational-n/",
    "title": "\"I will continue to listen to young people and their parents so we can get this right\": Children and families Minister Will Quince on support for pupils with dyslexia and other special educational needs",
    "authors": [
        "Media Officer"
    ],
    "categories": [
        "dyslexia",
        "Schools",
        "SEND"
    ],
    "pub_date": "2022-03-16T11:06:46+00:00",
    "content": [
        {
            "text": "Our ambition is for every child and young person, no matter what challenges they face, to have access to a world-class education that sets them up for life."
        },
        {
            "text": "It is therefore critical that children with Special Educational Needs and Disabilities (SEND) get the support they need."
        },
        {
            "text": "But we know currently this isn’t happening consistently; the SEND system doesn’t always deliver the outcomes we want, and expect, for children and young people, their families or the people and services who support them. This why we are undertaking a comprehensive review of the SEND system – due to be published as a Green Paper by the end of March – alongside the Schools White Paper. I have been working closely with parents, children, teachers, leading experts and parliamentarians ahead of publishing both papers, and I urge you to provide your feedback on the proposals during the consultation period."
        },
        {
            "text": "This is particularly pertinent as we approach Neurodiversity Celebration Week (21 – 27 March 2022). Having recently met with Matt Hancock MP to discuss the Private Members’ Bill he introduced and what more we can do to support pupils with dyslexia, I confirmed that I am committed to the early identification of needs, including dyslexia, and ensuring that every young person receives the support they need to flourish. This is key to delivering the Government’s ambitions on levelling up, and I am confident that through the Levelling Up White Paper, the Schools White Paper and the SEND Review, we can and will achieve this."
        },
        {
            "text": "In the Levelling Up White Paper, published last month, we announced that we are setting the bar higher for schools: we want 90 per cent of children in England to reach the expected standard in reading, writing and maths by 2030, making sure pupils leave primary school with knowledge and skills needed to excel at secondary school and beyond."
        },
        {
            "text": "The Schools White Paper will set out our plans to better identify children at risk of falling behind and provide them with the support they need. It sets the foundations to support the ambitions of the SEND Review."
        },
        {
            "text": "We want to equip education providers, wherever they are, with the resources they need to provide high quality support for children and young people with SEND in their settings. To deliver a more inclusive system, we need to strengthen mainstream provision to ensure that needs are identified and supported early, while also ensuring there is sufficient, high quality specialist capacity to provide support to those children who require it."
        },
        {
            "text": "This important reform agenda builds on measures already in place to identify pupils who are facing challenges with reading and literacy, and to help teachers understand how to support them."
        },
        {
            "text": "In February 2022, we announced more than £45 million of continued targeted support for families and parents of children with SEND and SEND services. This includes funding that will directly support schools and colleges to work with pupils with SEND."
        },
        {
            "text": "We’re supporting teachers too. It’s important to remember that while we do have specialists, every single teacher in this country is a SEND teacher. We are determined to keep developing teachers’ skills and confidence and promote evidence-based, effective practice within schools and other education settings. The revised Initial Teacher Training Core Content Framework and Early Career Framework, which all new entrants to the profession benefit from, have been designed around how to support all pupils to succeed, including those with SEND. The school workforce also has access to DfE-funded CPD, which provides resources to promote high-quality teaching for pupils with neurodiverse conditions. This has recently included piloting training to increase school staff confidence and capability in using assistive technology which can reduce or remove barriers for SEND learners."
        },
        {
            "text": "We also have guidance in place for how schools must support children and young people with SEND. Our SEND Code of Practice is clear that meeting the needs of pupils with dyslexia does not require a diagnostic label or test. Instead, we expect teachers to monitor the progress of all pupils, and put support in place where needed, for instance through statutory assessments that identify where pupils may be struggling with literacy."
        },
        {
            "text": "Through this work we will make sure that the education system does more to support all pupils with SEND, including those with dyslexia, so that they feel the true benefits of levelling up and are able to meet their full potential."
        },
        {
            "text": "I will continue to listen to young people and their parents so we can get this right."
        }
    ]
}