{
    "url": "https://space.blog.gov.uk/2022/03/16/on-the-ground-with-space-hub-sutherland-and-orbex/",
    "title": "On the ground with Space Hub Sutherland and Orbex",
    "authors": [
        "Paul Bate"
    ],
    "categories": [
        "LaunchUK"
    ],
    "pub_date": "2022-03-16T14:06:38+00:00",
    "content": [
        {
            "text": "As the tell-tale signs of spring start to appear, my visit to Space Hub Sutherland and Orbex has given me a timely boost of excitement and optimism for what’s to come.  "
        },
        {
            "heading": 2,
            "text": "Gearing up for UK launch"
        },
        {
            "text": "The passion and professionalism of all those at the forefront of making UK launch a reality is inspiring. I felt it when visiting Spaceport Cornwall and Saxavord Spaceport on Unst, and it was there in spades during this week’s trip to Sutherland, Forres and Kinloss."
        },
        {
            "text": "Launching small satellites from UK soil encapsulates the value we seek to bring as an Agency: catalysing investment, delivering space capabilities, and championing space. "
        },
        {
            "text": "Over two days with the Space Hub Sutherland and Orbex teams, I’ve seen how UK Space Agency funding, coupled with private and other public investment, is enabling the space industry to develop and grow – delivering benefits to the surrounding area, region and UK as a whole. The enthusiasm of all those I’ve met has been contagious. "
        },
        {
            "text": "Space Hub Sutherland was the first spaceport in the UK to receive planning permission and will include a launch pad and control centre designed to cater for the needs of multiple launch companies and vehicles. This is a key project in our wider programme of work to bring launch capability to UK shores for the first time. "
        },
        {
            "text": "The economic and community development agency, Highlands and Islands Enterprise, really understands the positive role that space plays to our economy both locally and nationally and has involved the local community on every step of the spaceport journey. Space Hub Sutherland is expected to create around 60 highly skilled jobs in Caithness and Sutherland, including 44 on site at Melness.    "
        },
        {
            "text": "Up to 12 launches per year will take place from Sutherland, including Orbex’s Prime launch vehicle - designed and manufactured at the company’s facility, which we also visited. This facility, and the neighbouring test site, already provides more than 50 jobs in Moray, with many more anticipated as the company continues to grow.  "
        },
        {
            "text": "The spaceport is based on a 10-acre site in the middle of the Melness Crofters’ Estate on the very northernmost part of mainland Scotland. The crofters I met, who manage the land, are excited about the impact of the spaceport on the current generation and generations to come. "
        },
        {
            "text": "As one crofter put it, the spaceport will reverse the decline in numbers of children attending the local school that she’s witnessed over generations, from 60 pupils when she was there, 30 for her children, and down to 15 for her grandchildren. The emerging space industry provides highly skilled jobs so young adults can stay in the place they love, raise families and help their community thrive in a sustainable way.  "
        },
        {
            "text": "Speaking to people involved I could hear the care that has gone into understanding and mitigating the environmental impact of Space Hub Sutherland, with an impressive range of protection measures including peat restoration. Construction, which is due to begin later this year, will be considerate of bird nesting seasons, as will the launches themselves.    "
        },
        {
            "text": "Since our Spaceflight Programme launched in 2018, the UK Space Agency has provided over £40 million in industry funding to grow the UK’s spaceflight capabilities and put in place the conditions to enable launch.   "
        },
        {
            "text": "Orbex and Space Hub Sutherland are a key part of our ambition to create a thriving small satellite launch market in the UK and it was a pleasure to see first-hand the great work they are doing. I hope to return to each of the spaceports I have visited soon, and to see others for the first time. "
        },
        {
            "text": " "
        },
        {
            "text": "Paul Bate is the CEO of the UK Space Agency"
        }
    ]
}