{
    "url": "https://educationhub.blog.gov.uk/2022/03/social-workers-are-without-a-doubt-unsung-heroes-and-we-must-all-strive-to-champion-and-celebrate-their-important-work/",
    "title": "\"Social workers are without a doubt unsung heroes, and we must all strive to champion and celebrate their important work\"",
    "authors": [
        "Media Officer"
    ],
    "categories": [
        "Social work"
    ],
    "pub_date": "2022-03-16T17:02:32+00:00",
    "content": [
        {
            "text": "Children and Families Minister Will Quince has written about the vital work of social workers - who he says are unsung heroes."
        },
        {
            "text": "The tragic deaths of Arthur Labinjo-Hughes, Star Hobson and others have rightly left the country appalled, struggling to imagine how any adult could commit such evil acts against a child. In these devastating cases, we must learn lessons."
        },
        {
            "text": "Yet there are few professions that can claim to transform lives as much as child and family social workers, in what are persistently highly challenging circumstances."
        },
        {
            "text": "Sadly, most people in the country still do not fully understand what a social worker does. Despite there being nearly 40,000 child and family social workers in England, with around 20% of children having had the support of a social worker before their 16th birthday, all too often the actions of social workers go unnoticed, their worth remains unrecognised."
        },
        {
            "text": "Most of the time social workers do not have the complete picture – the one that we have by the time these cases reach the national media. Instead, they work under copious amounts of pressure, trying to piece together snippets of information and make effective decisions quickly enough to keep children safe and prevent further harm. In some of the most harrowing cases, they face deceitful and manipulative parents too, doing all they can to hide or disguise their wicked actions."
        },
        {
            "text": "Perhaps more shocking is the fact that many social workers I have met are too embarrassed to tell people that they are, in fact, social workers – instead they provide a sufficiently vague response to the question ‘what do you do’ that prevents further probing. They feel that their work is undervalued, overlooked, disregarded – and often outright villainised. What does it say about our society, when those working to protect and support the most vulnerable children in society are stigmatised in such a way? The wider public only seems to hear about social workers when something goes terribly wrong."
        },
        {
            "text": "As a result, we do not get to hear about the hundreds of thousands of cases where children and parents have been empowered and supported to create a better life for themselves. These are the stories that we should be hearing on repeat, to continually remind us of the crucial role social workers play day in, day out to protect the lives – and improve the life chances - of vulnerable children up and down the country. Unfortunately, it is precisely because social workers do their jobs so well that we are able to overlook them on a daily basis."
        },
        {
            "text": "This is a national scandal because dedicated social workers are essential to keeping children safe."
        },
        {
            "text": "It is impossible to put a figure on the number of children’s lives that social workers have saved, the number of families that they have helped keep together, or the harm that they have prevented from taking place."
        },
        {
            "text": "When children are in need of help or protection, social workers are working hard on their behalf to ensure that they receive the love and care they deserve."
        },
        {
            "text": "When families are in awful situations and children are in danger, social workers are there, helping to make things better. When a family is able to stay together, a social worker is behind the scenes helping to make it happen. They listen to children and advise parents to help them deal with issues that are causing problems and conflict at home."
        },
        {
            "text": "Throughout this pandemic, an army of social workers has continued meeting with families and children in person, to help turn lives around."
        },
        {
            "text": "That is why this government has invested heavily in training and support for child and family social workers, and will continue to do so. We recognise the vital role social workers play whilst eagerly awaiting the Independent Review of Children’s Social Care which will be published in the coming months. This will provide a critical opportunity to further support social workers to receive the recognition they rightly deserve – and indeed thrive in such a profession."
        },
        {
            "text": "Social workers are without a doubt unsung heroes, and we must all strive to champion and celebrate their important work not just on World Social Work Day, but every day."
        }
    ]
}