{
    "url": "https://digitalpeople.blog.gov.uk/2022/03/16/supporting-cross-profession-senior-civil-servants-with-their-ddat-skills/",
    "title": "Supporting cross profession senior civil servants with their DDaT skills",
    "authors": [
        "Barbra Webber"
    ],
    "categories": [
        "Digital data and technology",
        "People and Skills",
        "Skills and Learning",
        "Training and progression"
    ],
    "pub_date": "2022-03-16T10:00:48+00:00",
    "content": [
        {
            "text": "Back in October 2021, we explained how we were supporting Digital Data and Technology (DDaT) professionals to progress, now I want to share how we are supporting our non-DDaT senior civil servants (SCS) colleagues to progress their digital and data skills and how you can get involved."
        },
        {
            "text": "The declaration on government reform states that people leading and working in government will:"
        },
        {
            "text": "“keep pace in areas of growing importance, including digital and technology; invest in training to equip our people with the skills and knowledge they need to tackle the challenges of the future; support and encourage multidisciplinary teams”"
        },
        {
            "text": "And talking with our cross profession colleagues we have noted that this is something on a lot of peoples’ minds at present. So how can we help and what can you do?"
        },
        {
            "heading": 2,
            "text": "Sometimes it’s not obvious what we mean by “Digital''?"
        },
        {
            "text": "There are many interpretations for this and we will aim to consolidate understanding of what is required. I used to ask this question when running GDS Academy courses and we always got a range of answers, but mostly they focused on the technology (a laptop, smartphone etc). And we see many things in the press which talk about the digital skills of people being able to communicate or use internet based services via digital devices. But in the DDaT profession we see technology as the enabler: it really is all about people. First it is about the users who will use the services provided and many of us understand this well, but also it is about the individuals applying the culture, processes, business models and technologies of the internet era to respond to people’s raised expectations (as Tom Loosemore put it in the early days of transformation). And what is at the core of a digital culture? We try things, we take carefully calculated risks, we fail fast and learn so we can innovate."
        },
        {
            "heading": 2,
            "text": "DDaT Essentials (DDE) for senior civil servants (SCS)"
        },
        {
            "text": "With that in mind, we have been working on a DDaT Essentials standard for non-DDaT SCS. This will provide a benchmark for SCS to assess and upskill across a number of DDaT skills right up to digital transformation. The DDE is being iterated at present, but currently covers 5 areas:"
        },
        {
            "text": "We will be publishing the full content in the near future after we have feedback from cross profession colleagues. If you would like to get involved, we are starting a working group to contribute to and discuss DDaT capability in the non-DDaT area, especially for SCS, and so please give us your details here if you would like to be involved."
        },
        {
            "heading": 2,
            "text": "What next?"
        },
        {
            "text": "We know that there is strong appetite for improving digital data and technology skills in SCS across the civil service and so we aim to gather together a number of expert and authoritative providers to deliver learning across the DDaT Essentials. This will enable ease of access to pertinent learning for SCS to upskill in these areas."
        },
        {
            "text": "We are committed to supporting SCS across professions to be equipped and ready to address the challenges of the future. "
        },
        {
            "heading": 2,
            "text": "Get involved"
        },
        {
            "text": "This is all work in progress. If you would like to get involved you can:"
        }
    ]
}