{
    "url": "https://civilservice.blog.gov.uk/2022/03/16/young-carers-in-the-civil-service/",
    "title": "Young carers in the Civil Service",
    "authors": [
        "Rebecca Sudworth, Director of Policy, Food Standards Agency"
    ],
    "categories": [
        "A Modern Civil Service",
        "A Skilled Civil Service",
        "An Ambitious Civil Service"
    ],
    "pub_date": "2022-03-16T09:06:58+00:00",
    "content": [
        {
            "heading": 3,
            "text": "Rebecca Sudworth, Deputy Civil Service Carers’ Champion, highlights the key issues young carers face."
        },
        {
            "text": "Today is Young Carers Action Day. This is a nationwide event organised by the Carers Trust aimed at raising awareness of young carers across the country. "
        },
        {
            "text": "Here in the Civil Service, we have many carers aged between 16 and 29. These are people who are looking after a friend or family member who, due to illness or disability, cannot cope without their support. Sometimes they have been caring for someone through part or all of their childhood."
        },
        {
            "heading": 4,
            "text": "Young Carers Network"
        },
        {
            "text": "I am delighted that a Young Carers Network has been set up in the Civil Service to bring them together and offer them support. The network is also working to raise awareness of the issues our young carers face."
        },
        {
            "heading": 4,
            "text": "Issues young adult carers face"
        },
        {
            "text": "Identity is a key issue for young carers. They may not recognise that they’re a carer and they may find it difficult to fit in with assumptions that younger members of the workplace are “care-free”."
        },
        {
            "text": "Young adult carers face many of the challenges other carers experience, but"
        },
        {
            "text": "it can feel a little different. They may know few - if any - other people in their age group in a similar situation. They’re often at the start of their careers and can struggle when colleagues and managers don’t understand the level of responsibility they carry outside work."
        },
        {
            "heading": 4,
            "text": "Wealth of experience "
        },
        {
            "text": "Young carers can shoulder heavy responsibilities as part of their caring role and, at times, balancing work and caring can feel like walking on a tightrope. It can be stressful and it’s important we look after the wellbeing of all our young carers. We should also value the skills and experience which caring gives them. They bring a wealth of experience to the Civil Service and we need to take a pragmatic and empathetic approach to making the best use of their skills, including supporting their development and ongoing career progression."
        },
        {
            "text": "Sarah is one of our young carers who tells her story below."
        },
        {
            "heading": 4,
            "text": "Support for carers"
        },
        {
            "text": "The Civil Service provides lots of support for our carers. If you’re a young carer, I encourage you to fill out a carer’s passport in discussion with your manager. I have one myself and I know how helpful they can be in terms of enabling you to give of your best in both your work and caring roles."
        },
        {
            "heading": 4,
            "text": "Employee Assistance Programme "
        },
        {
            "text": "Your department will also have an Employee Assistance Programme and the option for special leave to help you when you need them."
        },
        {
            "text": "Please also join the Civil Service Young Carers Network. They are there to help you. For more information, please email COCarers@cabinetoffice.gov.uk."
        }
    ]
}