{
    "url": "https://sustainableict.blog.gov.uk/2025/05/13/defra-leads-the-way-with-esim-adoption-to-drive-sustainability-in-government-ict/",
    "title": "Defra leads the way with eSIM adoption to drive sustainability in Government ICT ",
    "authors": [
        "Lydia Tabbron"
    ],
    "categories": [
        "Sustainable ICT",
        "Sustainable procurement",
        "Uncategorized"
    ],
    "pub_date": "2025-05-13T10:56:33+01:00",
    "content": [
        {
            "heading": 2,
            "text": "Overview"
        },
        {
            "text": "The Department for Environment, Food & Rural Affairs (Defra) has become an early adopter in Government of eSIM technology (embedded SIM) across its mobile estate, setting a benchmark for sustainable digital transformation in the public sector. This initiative is part of Defra’s broader commitment to embedding sustainability and social value into its procurement and operational practices. "
        },
        {
            "heading": 2,
            "text": "Environmental impact"
        },
        {
            "text": "Transitioning from traditional SIM cards to digital eSIMs significantly reduces carbon emissions. Life cycle assessments show that eSIM emits 46% less CO2 than a physical SIM card. eSIMs also have a potential lower environmental impact, including lower energy consumption and longer life span of devices.  "
        },
        {
            "text": "The new supplier, BT, has committed to hold “Welcome Days” so old SIM cards can be collected and recycled free of charge. Additionally, secure collection bins have been deployed at buyer premises to responsibly dispose of legacy SIMs. "
        },
        {
            "heading": 2,
            "text": "Sustainable procurement approach "
        },
        {
            "text": "Sustainability and social value were embedded into the procurement process, with a 15% weighting allocated to these areas. Tender responses were evaluated on commitments exceeding business-as-usual practices, and successful bidders had their pledges formalised within the contract deliverables. A comprehensive set of sustainability and social value questions were used as part of the tender evaluation, covering the following themes:   "
        },
        {
            "heading": 2,
            "text": "Contractual commitments and governance"
        },
        {
            "text": "A major accomplishment for Defra was BT providing a \"Digital Carbon Calculator\". This offers unprecedented visibility over emissions at the contract and services level—an area that has historically been difficult to report on. The tool will support ongoing tracking, management, and reduction of emissions throughout the contract duration. "
        },
        {
            "heading": 2,
            "text": "Ongoing oversight and reporting "
        },
        {
            "text": "To ensure consistent delivery of sustainability commitments, the supplier will provide annual progress reports and presents updates at monthly Service Management Boards. These reports cover carbon reduction, data efficiency, supply chain impact, and climate resilience, ensuring a structured governance model that holds suppliers accountable. "
        },
        {
            "heading": 2,
            "text": "Conclusion: a major step forward for Defra and Government sustainability  "
        },
        {
            "text": "“Defra’s adoption of eSIM technology is more than just a digital upgrade—it marks a strategic milestone in our journey towards net zero and responsible procurement. This initiative sends a powerful signal to the wider supplier market: sustainability is no longer optional—it’s a core expectation. It has been a true team effort, with collaboration from a range of colleagues to ensure sustainability was central to our requirements, and I’m grateful to our like-minded supplier, BT, who fully understood these requirements and committed to delivering them.” — Lydia Tabbron, Defra Digital Sustainability Lead "
        },
        {
            "text": "“In a highly commoditised mobility market, Defra’s clear sustainability priorities shaped a tender process that balanced cost, quality, and environmental responsibility. Through robust pre-market engagement and strategic use of  social value criteria, Defra attracted suppliers with the capability and ambition to meet its expectations. Defra’s appetite to consume sustainable services and BT’s market-leading approach on eSIM, circularity, and renewable energy made a perfect match.” — Andy Rowe, Director of Central Government, BT "
        },
        {
            "text": "As an early adopter of eSIM technology within government we’re setting a clear precedent for how public sector innovation can align with environmental and social priorities. Through meaningful contract requirements, robust governance, and tangible reporting Defra is demonstrating how government contracts can drive real-world impact, beyond business as usual. "
        },
        {
            "text": "By embedding sustainability into procurement and holding suppliers accountable, Defra is not only reducing its own environmental footprint but also helping to reshape industry standards. This approach paves the way for other departments to follow, reinforcing the message that the UK Government is serious about delivering on its climate and social value commitments. "
        }
    ]
}