{
    "url": "https://cspl.blog.gov.uk/2025/05/13/from-tap-on-the-shoulder-to-transparency-30-years-of-public-appointments/",
    "title": "From “tap on the shoulder” to transparency - 30 years of public appointments",
    "authors": [
        "Sir William Shawcross CVO"
    ],
    "categories": [
        "30th Anniversary",
        "Nolan Principles",
        "openness",
        "Public appointments",
        "Regulators"
    ],
    "pub_date": "2025-05-13T12:49:49+01:00",
    "content": [
        {
            "text": "To mark the 30th anniversary of the Nolan Principles, the Committee will be publishing a new series of blogs about the work of a range of standards bodies in England. Our fifth blog is from Sir William Shawcross CVO, the Commissioner for Public Appointments. "
        },
        {
            "text": "A major focus of the first report from the Committee on Standards in Public Life, chaired by Lord Nolan, was how appointments to ‘quangos’ were made. At the time, ministerial appointments to the boards of public bodies were made behind closed doors. The system lacked transparency, fairness, and accountability, raising concerns that appointments were made solely on personal or political bias rather than merit."
        },
        {
            "text": "Alongside setting out the Seven (Nolan) Principles of Public Life – selflessness, integrity, objectivity, accountability, openness, honesty, and leadership - the 1995 report recommended the establishment of ‘an independent regulator to monitor, regulate and approve departmental processes for public appointments’, leading to the creation of the Commissioner for Public Appointments in 1995. I am proud to be the sixth Commissioner."
        },
        {
            "text": "Ministers currently make around 1000 appointments each year to the boards of public bodies covering all areas of our national life - the arts, justice, education, health and sport. As a regulator, the Commissioner’s role is to provide public assurance that these appointments are made through a fair and open process, based on merit. So when ministers appoint someone to a public body, the post must be openly advertised and they must select from a group of candidates whose experience and skills have been assessed by a panel, which includes an independent member. The independent panel member plays a crucial role in ensuring that the process is fair to all candidates and in line with the Governance Code and Principles of Public Appointments. "
        },
        {
            "text": "While this system has introduced more structure in the making of ministerial appointments, ministerial choice remains at the core of the appointments process, as recommended by Lord Nolan. Ministers are accountable to Parliament for the decisions they make and the individuals they appoint. They are responsible for ensuring that public bodies are led by capable and effective people able to deliver on the government’s goals. "
        },
        {
            "text": "The system is balanced to ensure both fairness and ministerial accountability, and to maintain public confidence in these important appointments. Transparency and openness are vital parts of that. Vacancies must be published, including job descriptions, person specifications and the names of those on the panel, while a tracker sets out the stages of a competition. If an appointment is made by exception to the Code, this requires consultation with my office and must be published. Since 2008, pre-appointment scrutiny by select committees of specific roles has added a further safeguard to ensure appointments are on merit and live up to the Nolan principles."
        },
        {
            "text": "The review conducted by Lord Grimstone in 2016 agreed that Lord Nolan’s principles had stood the test of time. He recommended a new Governance Code and other changes intended to make the process of appointment more timely and result in more ‘good people coming forward for these roles’."
        },
        {
            "text": "Despite the changes of the past thirty years, challenges remain. Successive Commissioners have repeatedly highlighted the need to improve diversity in public appointments. While progress has been made in increasing the number of women and people from ethnic minority backgrounds, more must be done to encourage those with disabilities, individuals from different socio-economic backgrounds and those with varied professional experiences to step forward. We also need to do more to reach talented candidates from outside London and the South East and ensure that there is diversity of thought across public boards."
        },
        {
            "text": "Another concern is the length of the appointments process. Despite the changes recommended in 2016, the latest figures in my annual report show that only 13% of appointments last year met the 3 month aim set out in the Governance Code. Many competitions take far too long, often lasting six months or more. This not only frustrates candidates but can also lead to the loss of strong applicants who choose to take up other opportunities in the meantime. Delays also mean leaving key public bodies without leadership for extended periods, reducing the effectiveness of those bodies and the services they deliver to the taxpayer. Improving efficiency and candidate care in the appointments system is critical to ensuring that talented individuals remain engaged and willing to serve."
        },
        {
            "text": "Looking ahead, Lord Nolan’s careful balance between ministerial discretion and independent oversight remains key. The reforms of the last three decades have transformed public appointments into a more open, fair and merit-based system.  Ensuring that these roles attract the widest possible pool of talent – while still allowing ministers the freedom to make informed choices on the basis of merit – is essential in shaping the leadership of our public services."
        }
    ]
}