{
    "url": "https://environmentagency.blog.gov.uk/2025/05/13/how-to-prepare-for-an-inspection-from-the-environment-agency-ea-a-farmers-guide/",
    "title": "How to Prepare for an Inspection from the Environment Agency (EA): A Farmer’s Guide ",
    "authors": [
        "Environment Agency"
    ],
    "categories": [
        "agriculture"
    ],
    "pub_date": "2025-05-13T10:16:30+00:00",
    "content": [
        {
            "text": "We play a key role in ensuring that farming practices comply with environmental regulations. "
        },
        {
            "text": "Agriculture is the biggest sector we regulate. We deliver at least 4000 farm inspections per year. These are targeted to farms and parts of the country at greatest risk of harm to the water environment. "
        },
        {
            "text": "Farmers and the agriculture sector feed the nation and are the cornerstone of food security. The sector is integral to protecting and delivering improvements to the environment.  "
        },
        {
            "text": "We understand that receiving an unexpected letter from us can raise some fears, especially for farmers who may not know what to expect during an inspection, but we are here to help.  "
        },
        {
            "text": "The aim of this blog and new video is to demystify the inspection process and provide clarity on what you can expect when our officers visit your farm. "
        },
        {
            "text": "Let’s examine what you need to know about an upcoming inspection and how to prepare for it. "
        },
        {
            "text": "What to Expect During an EA Inspection "
        },
        {
            "text": "Our primary goal is to protect and improve the environment. This includes ensuring that farming activities do not harm water quality, soil health, biodiversity, or air quality. Inspections are not about catching you as farmers out but helping you to comply with regulations and adopt sustainable practices that benefit both the farm and the environment.   "
        },
        {
            "text": "When you’re selected for an inspection, it’s natural to feel anxious. However, it’s important to know that being chosen does not mean you've done something wrong. We frequently conduct inspections based on a range of factors, with water quality in local rivers being one of the primary concerns. Many inspections are based on data that we collect from major watercourses, particularly those with high or rising levels of pollutants like nitrates and phosphates. "
        },
        {
            "text": "We aim to help farmers comply with environmental regulations and improve their farming practices. The focus on advice and guidance led regulation ensures that farmers have the resources they need to maintain compliance while protecting the environment. "
        },
        {
            "text": "We also work in collaboration with partners such as Catchment Sensitive Farming to offer advice and practical support to farmers. In a rapidly changing world, our commitment to innovation and effectiveness is crucial to advancing environmental protection and sustainable development, while our regulation underpins economic growth by ensuring there is a level playing field for you. "
        },
        {
            "text": "Senior Environment Agency Officer Karen Price explains:  "
        },
        {
            "text": "“We understand farming is complicated, a number of us officers here at the EA have a farming background and we are here to help. "
        },
        {
            "text": "“We’re not here to catch you out. Our goal is to help you understand the regulations, assess your compliance, and, if needed, work with you to make the necessary changes to protect the environment. "
        },
        {
            "text": "\"Our helpful video  can help you get a feel for what happens on an inspection and help you prepare.” "
        },
        {
            "text": " Rob Kynaston, a Dairy Farmer, following an inspection with the EA said:"
        },
        {
            "text": "“Walking around with the Environment Agency, I think it's that fresh pair of eyes looking at it. We see things every day and you perhaps don't take them seriously, but you just don't really see them or don't see the problems. "
        },
        {
            "text": "\"It was good to have someone coming around and saying you need to do something about this and not in a you've got to do this or I'm going to throw the book at you, but you’ve got a problem here if you do this it will stop the problem, which was fantastic”. "
        },
        {
            "text": "Farms may be selected for inspections in areas where water quality is at risk, or where pollution issues have been identified. The inspection could focus on a range of key areas such as slurry, silage, nitrate management, and diffuse pollution. "
        },
        {
            "text": "How to Prepare for the Inspection "
        },
        {
            "text": "We will contact you via phone, email, or post to arrange a convenient time for the inspection. We also send you a confirmation letter with details of the inspection and a list of the documents and areas we need to review. To help streamline the inspection and reduce time spent on your farm, consider providing relevant documents in advance. Some of the documents that may be helpful include: "
        },
        {
            "text": "Providing these documents ahead of time will allow our officer to focus on the farm inspection itself, making the process more efficient. "
        },
        {
            "text": "What Will Be Inspected? "
        },
        {
            "text": "Expect the inspection to last between one and three hours, depending on the size of your farm and the amount of advice required. Our officers will review several key areas: "
        },
        {
            "text": "Addressing non-compliances "
        },
        {
            "text": "If any non-compliances are identified during the inspection, our officer will discuss the issue with you. They will agree on an action plan and a reasonable timeframe for addressing the concerns and we will give you contacts and information for advice and grant funding from other sources if applicable. The goal is to ensure compliance and protect the environment while minimising disruption to your operations. "
        },
        {
            "text": "What Happens After the Inspection? "
        },
        {
            "text": "Once the inspection is complete, you will receive a post-inspection report, usually within two weeks. This report will outline any necessary actions you need to take, along with deadlines for completing them. If you are unable to meet these deadlines, it’s important to contact our officer as soon as possible to discuss potential extensions. "
        },
        {
            "text": "Although our approach is focused on providing advice, enforcement actions may still be necessary in certain cases as a last resort. The report will clearly specify if enforcement is required and what steps will need to be taken. "
        },
        {
            "text": "Conclusion: Turning Inspections into Opportunities "
        },
        {
            "text": "The focus on advice and guidance led regulation ensures that farmers have the resources they need to maintain compliance while protecting the environment. By being proactive in preparing for the inspection, you can help make the process smoother and ensure your farm is operating in line with environmental regulations. "
        },
        {
            "text": "Ultimately, while the Environment Agency's inspections are to assess regulatory compliance, they are also designed to benefit both farmers and the environment, many farmers often find investments they make on farm turn into cost savings in the long run and so creating a sustainable future for agriculture. "
        },
        {
            "text": "Useful links: "
        },
        {
            "text": "Rules for farmers and land managers to prevent water pollution - GOV.UK "
        },
        {
            "text": "Rules for farmers and land managers - GOV.UK "
        },
        {
            "text": "Protecting our water, soil and air - GOV.UK "
        },
        {
            "text": "https://www.farmingadviceservice.org.uk/technical-article/harvesting-success-pollution-prevention-rules-farmers"
        },
        {
            "text": "For general enquires or to talk to your local Environment Agency officer please contact the Environment Agency National Customer Contact Centre: "
        },
        {
            "text": "03708 506 506 "
        },
        {
            "text": "Enquiries@environment-agency.gov.uk "
        }
    ]
}