{
    "url": "https://marinescience.blog.gov.uk/2025/05/13/integrated-marine-monitoring-to-protect-the-irish-sea/",
    "title": "Integrated marine monitoring to protect the Irish Sea",
    "authors": [
        "Michelle Devlin"
    ],
    "categories": [
        "biodiversity",
        "Climate Change",
        "marine protected areas",
        "mNCEA",
        "natural capital",
        "Policy",
        "Pollution",
        "Science",
        "Socio Economics",
        "Technology"
    ],
    "pub_date": "2025-05-13T10:54:36+01:00",
    "content": [
        {
            "text": "By Michelle Devlin, Naomi Greenwood, Carolyn Graves, Robert Brookes (Cefas), Mike Best (EA), Eugene O’Kane, Adam Mellor (AFBI), Mark Charlesworth (NRW), David Johns (MBA)"
        },
        {
            "text": "Monitoring water quality and plankton in the Irish sea involves the joint effort and expertise of several government agencies, including Cefas, the Environment Agency, the Agri-Food and Biosciences Institute and National Resources Wales. This monitoring is further enhanced by plankton monitoring provided by Marine Biological Association and the Isle of Mann marine monitoring programme."
        },
        {
            "text": "A collaborative approach to monitoring can achieve multiple benefits that are much harder to achieve by each agency on their own.  In this blog, scientists from Cefas, the Environment Agency, Agri-Food and Biosciences Institute, Natural Resources Wales and the Marine Biological Association discuss how collaboration and improved coordination have been key to successful monitoring across the Irish Sea and coastal waters, helping to provide the vital data needed to better protect our seas.  "
        },
        {
            "heading": 3,
            "text": "Understanding the impacts of pollution on the Irish Sea"
        },
        {
            "text": "The Irish Sea is a 46,007 km2 (17,763 square miles) body of water that separates the islands of Ireland and Great Britain. The Irish Sea itself is an important area for biodiversity, industry shipping and offshore wind, however its many estuaries and coastal waters also provide benefits to the environment and local communities. These areas include the Dee Estuary, the Mersey Estuary, the Ribble Estuary, Morecambe Bay, the Solway Firth, the Firth of Clyde, Belfast Lough, Strangford Lough, Carlingford Lough, Dundalk Bay, Dublin Bay and Wexford Harbour.  "
        },
        {
            "text": "Liverpool Bay is an important coastal area, with a surrounding population of nearly 7 million people. It has seen many changes in its catchment, including increasing population and intensification of agriculture. The total farmed area of the catchment is 940,000hectares, of which 62% is permanent pasture and 21% is arable land. The remainder is used for dairy herds, pigs and poultry. Sewage, agricultural run-off and road pollution is impacting water quality in these coastal waters.  "
        },
        {
            "text": "Liverpool Bay, like many coastal areas and estuaries, serve as crucial 'marine natural capital'; providing numerous ecosystem services that benefit both the environment and human populations. They act as nurseries for fish and other marine species, support diverse habitats, and offer protection from coastal erosion. Moreover, they contribute to carbon sequestration, and recreational opportunities, which are all vital for the wellbeing of surrounding communities."
        },
        {
            "text": "Like many areas around the UK, Liverpool Bay is also facing several pressures including impacts of marine pollution and climate change. Recent assessments of Liverpool Bay and its coastal waters as experiencing high nutrient concentrations, imbalanced nutrient ratios, and a changing pelagic community. However, it remains a complex system facing numerous challenges."
        },
        {
            "text": "Effective marine monitoring plays a key role in maintaining and enhancing these benefits. It is also essential to tackling the challenges posed by pollution, climate change, and human activities. Long-term monitoring across the catchment to the coast is essential to fully understand how changing pressures impact coastal and marine environmental, social, and economic assets. By understanding the health of these waters through a collaborative approach, we can develop strategies to mitigate pollution and protect the unique biodiversity of the Irish Sea."
        },
        {
            "heading": 3,
            "text": "National and international water quality assessments"
        },
        {
            "text": "In the UK, several environmental directives and frameworks exist for assessing the health of freshwater, coastal and marine environments. These include:"
        },
        {
            "text": "These frameworks cover multiple assessment areas within the estuarine and coastal area of Liverpool Bay and Irish Sea. Agreements on eutrophication assessments have also been made under the Oslo and Paris Conventions for the Protection of the Marine Environment of the North-East Atlantic. A recent eutrophication assessment was made for the whole North-East Atlantic under the OSPAR Quality Status Reporting which included the coastal and offshore waters of the Irish Sea."
        },
        {
            "text": "The UK’s national monitoring programmes have been in place for many years, and the data collected under our regulatory monitoring programmes are the key data source for our water quality and eutrophication assessments."
        },
        {
            "heading": 3,
            "text": "Collaboration in monitoring water quality"
        },
        {
            "text": "Cefas, Environment Agency (EA), Agri-Food and Biosciences Institute (AFBI) and the Natural Resources Wales (NRW) share responsibility for monitoring these coastal and marine waters. Data collected by the EA and NRW in the transitional and coastal waters contributes to the Water Environment Regulation assessment. Data collected by Cefas and AFBI in the plume, coastal and offshore waters contribute to our OSPAR and UK Marine Strategy assessments. The pelagic data collected by the four agencies also contributes to biodiversity assessments required under OSPAR and the UK Marine Strategy (UK MS)."
        },
        {
            "text": "Environment Agency and Natural Resources Wales – monitoring estuaries to coasts"
        },
        {
            "text": "Since the inception of the Water Framework Directive (WFD) monitoring from late 2006, the EA and NRW have collected water quality and plankton samples from sites in WFD waterbodies from a combination of Coastal Survey Vessels and rigid hulled inflatable boats (RIBs). Typically, one sample from 3 to 5 sites per water body are collected each month. Samples are collected for salinity, dissolved inorganic nutrients, dissolved oxygen, suspended particulate matter, chlorophyll-a and salinity, plankton community and other chemical measurements (for EQS directive)."
        },
        {
            "text": "Cefas and AFBI monitoring inshore to offshore"
        },
        {
            "text": "Cefas and AFBI have been monitoring Liverpool Bay and the Irish Sea for many years and data is collected regularly in several ways. Cefas monitor from the shore and out past the edge of the riverine influence. Between 2006 and 2011, research cruises, mostly on the RV Endeavour, collected samples on average eight times per year and on average four times per year from 2012 onwards. Samples are collected for dissolved inorganic nutrients, dissolved oxygen, suspended particulate matter, chlorophyll-a and salinity, plankton community and optical measurements. All samples are brought back to Cefas  laboratories and analysed."
        },
        {
            "text": "Instrumented moorings (“SmartBuoy”) have been deployed by Cefas Liverpool Bay since 2003. Daily average values for salinity, suspended particulate matter (SPM), chlorophyll-a and dissolved oxygen are calculated every 10-mins and measurements made every half an hour over a 24-hour period. Total oxidized nitrogen (TOxN) can be measured between every 2 hours and autonomously sampled every 4 days depending on the instruments deployed.  This represents a vital source of data for our coastal and offshore waters."
        },
        {
            "text": "With a home port in Belfast, AFBI’s RV Corystes is perfectly located for carrying out monitoring in the Irish Sea.  The science team takes water quality samples from numerous stations as well as surface phytoplankton samples and vertical zooplankton hauls at certain fixed stations including at the CEFAS SmartBuoy site. Plankton monitoring at these stations is now in its 10th year, with new samples and stations having been added over the last two years. The RV Corystes provides vital maintenance to CEFAS’ SmartBuoy located in Liverpool Bay four times a year, ensuring the integrity of the mooring components as well as recovering samples and sensors."
        },
        {
            "heading": 3,
            "text": "Enhancing offshore monitoring - the CPR Survey"
        },
        {
            "text": "The Marine Biological Association manages the running of the Continuous Plankton Recorder Survey, a global plankton monitoring programme using Ships of Opportunity since the 1940s. The Survey operates continuous plankton recorders, devices which collect plankton (phyto- and zooplankton, almost 700 taxa routinely identified) from surface waters, using a consistent methodology, throughout the North Atlantic, Arctic and Pacific Oceans. The ‘IN’ route has been operated from Liverpool to Dublin, running since 1970 and collecting over 4000 samples in that time. Plankton in each sample are then counted and identified as precisely as possible, often down to the species level. The resulting dataset is open access and has been used in a large number of research projects, as well as more applied work within the marine policy realm. Data from the CPR Survey, from both the IN route and surrounding North Sea / north-eastern Atlantic, can be used to put other plankton sampling results into a wider context, adding large spatial and temporal scales to look at changes in the community."
        },
        {
            "heading": 3,
            "text": "Understanding marine natural capital"
        },
        {
            "text": "Through the marine Natural Capital and Ecosystem Assessment programme (mNCEA), we have been able to build on this work under the “PELCAP” programme by increasing the number of sample sites within plume and coastal waters and widening the suite of parameters measured to include biological parameters such as tiny plankton and zooplankton, providing vital information on how pollution impacts pelagic communities. Under the Seascapes programme, we collected data to understand plume dynamics, asses high risk areas and understand the impacts of pollution on seagrass communities and oyster beds. Our data also helps validate the analysis of water quality, including the colour of the ocean and coloured dissolved organic matter (CDOM) data.  A collaborative effort, which integrates data from multiple sources, can achieve a more comprehensive and accurate picture of ocean health, covering the full source to sea system. It also helps to improve our knowledge on coastal and marine assets that are contained within these important systems."
        },
        {
            "text": "Work under mNCEA and support from Defra and the UK government has provided funding for ongoing monitoring, recognising the value of integrated and collaborative monitoring for the assessment of our coastal and marine areas. Liverpool Bay provides a great example of what can be achieved when we bring our resources and technology together, aided by data sharing and harmonised data flows, to fully assess our coastal and marine waters."
        }
    ]
}