{
    "url": "https://governmentscienceandengineering.blog.gov.uk/2025/05/13/learning-at-work-week-discover-the-gse-awareness-courses/",
    "title": "Learning at Work Week: Discover the GSE awareness courses",
    "authors": [
        "gseprofession"
    ],
    "categories": [
        "Blog Series",
        "Capability & Skills",
        "Learning & Development"
    ],
    "pub_date": "2025-05-13T16:59:59+01:00",
    "content": [
        {
            "text": "This week is Learning at Work Week, and it provides a great opportunity to take some time for learning and development. The Government Science and Engineering (GSE) awareness courses are here to support civil, crown, and public servants with the knowledge and tools needed to use science and engineering advice effectively in their work. Whether you're new to government or an experienced technical expert, there's something for everyone."
        },
        {
            "heading": 2,
            "text": "Understanding and accessing science and engineering advice"
        },
        {
            "text": "The course, Understanding and Accessing Science and Engineering Advice, is perfect for those who are not from a technical background or are new to the government. It offers a beginner-friendly overview of accessing and applying science and engineering advice in government. The course is divided into three engaging one-hour modules, covering:"
        },
        {
            "text": "No prior knowledge is needed for the course, making it ideal for policy professionals who are new to science and engineering concepts as well as those in non-technical roles seeking to better integrate science and engineering advice. It is also offers a comprehensive introduction to new starters across government."
        },
        {
            "heading": 2,
            "text": "Communicating science and engineering advice"
        },
        {
            "text": "Communicating Science and Engineering Advice is designed for science and engineering experts who frequently communicate technical advice. It focuses on effective communication strategies for diverse audiences. It includes:"
        },
        {
            "text": "The course is ideal for experts aiming to translate technical knowledge into actionable advice for policymakers, ministers, stakeholders, and individuals keen to develop skills in data visualisation."
        },
        {
            "text": "This course offers three key benefits:"
        },
        {
            "heading": 2,
            "text": "Testimonials from course participants"
        },
        {
            "heading": 2,
            "text": "Want to learn more?"
        },
        {
            "text": "Civil servants can access the courses using these links: "
        },
        {
            "text": "Civil Service Learning: Understanding and Accessing Science and Engineering Advice  "
        },
        {
            "text": "Civil Service Learning: Communicating Science and Engineering Advice"
        },
        {
            "text": "If you do not have access to Civil Service Learning, please complete our short GSE Courses Future Learn Sign Up form, using your work email address, and we will send you enrolment details within three working days."
        },
        {
            "text": "Join us in shaping a future where science and engineering are at the heart of government decisions. Whether you're embedding technical principles in policy or simplifying data for key stakeholders, the GSE awareness courses are your gateway to professional growth. If you are interested in hearing how the GSE Awareness Courses or any of our other Learning and Development Offers can support your team or department, contact the GSE Profession team."
        }
    ]
}