{
    "url": "https://food.blog.gov.uk/2021/10/15/emily-miles-stakeholder-update-help-for-millions-with-food-allergies/",
    "title": "Emily Miles' stakeholder update - Help for millions with food allergies",
    "authors": [
        "Emily Miles, Chief Executive"
    ],
    "categories": [
        "Allergy",
        "Our mission"
    ],
    "pub_date": "2021-10-15T12:34:05+01:00",
    "content": [
        {
            "text": "Cymraeg"
        },
        {
            "text": "FSA Chief Executive Emily Miles discusses Natasha's Law and the UK Anaphylaxis Registry."
        },
        {
            "text": " "
        },
        {
            "text": "A new allergen labelling law, known as Natasha’s Law, came into force at the beginning of October. It will boost protection for the two million people who live with food allergies in this country. Since 1 October, all food that’s wrapped or packed before it is ordered has to have full ingredients labelling, with any of the 14 allergens emphasised."
        },
        {
            "text": "We’ve been supporting businesses to prepare for these changes. Around 125,000 people have taken part in our online training and there have been almost half a million visits to the prepacked for direct sale guidance on the FSA’s website. I was very pleased to speak to the media about these important changes. Their interest helped spread the message to businesses and consumers."
        },
        {
            "text": "Last week, the FSA also launched the UK Anaphylaxis Registry to improve our understanding of trends in severe food-induced allergic reactions. Funded by us, with a contribution from Food Standards Scotland, and led by Imperial College London, the registry will serve as a platform for healthcare providers to record details of anaphylaxis incidents, and collate data from across the UK to provide a better picture of the type of reactions, their frequency and their geographic spread."
        },
        {
            "text": "Both of these initiatives required enormous input from many others. It’s hoped that the change in the law and the registry will prevent further unnecessary anaphylactic reactions, hospital admissions and deaths."
        },
        {
            "text": "For more information about our work on food allergies do visit our website where there is guidance for businesses and advice for consumers."
        },
        {
            "text": " "
        },
        {
            "text": "I hope you’ve found this latest message useful. If you’d like to get future editions direct to your inbox, sign up for the updates. You can also sign up to be notified of all FSA posts, not just this message."
        },
        {
            "heading": 1,
            "text": "Diweddariad i randdeiliaid gan Emily Miles – Cymorth i filiynau o bobl ag alergeddau bwyd."
        },
        {
            "text": " "
        },
        {
            "text": "Daeth cyfraith labelu alergenau newydd, a elwir yn Gyfraith Natasha, i rym ddechrau mis Hydref a fydd yn helpu i ddiogelu’r ddwy filiwn o bobl sy'n byw gydag alergeddau bwyd yn y wlad hon. Ers 1 Hydref, mae'n rhaid i bob bwyd sy'n cael ei lapio neu ei becynnu cyn ei archebu ddangos rhestr lawn o gynhwysion ar y label, gan bwysleisio unrhyw un o'r 14 prif alergen."
        },
        {
            "text": "Rydym ni wedi bod yn cefnogi busnesau i baratoi ar gyfer y newidiadau hyn. Mae tuag 125,000 o bobl wedi cymryd rhan yn ein hyfforddiant ar-lein ac mae bron i hanner miliwn o bobl wedi agor y canllawiau ar wefan yr ASB. Roeddwn yn falch iawn o’r cyfle i siarad â'r cyfryngau am y newidiadau pwysig hyn. Roedd diddordeb y cyfryngau yn helpu i ledaenu'r neges i fusnesau a defnyddwyr."
        },
        {
            "text": "Yr wythnos ddiwethaf, lansiodd yr Asiantaeth Safonau Bwyd (ASB) Gofrestrfa Anaffylacsis y Deyrnas Unedig i wella ein dealltwriaeth o dueddiadau o ran adweithiau alergaidd difrifol a achosir gan fwyd. Wedi'i hariannu gennym ni, gyda chyfraniad gan Safonau Bwyd yr Alban, ac wedi'i harwain gan Goleg Imperial Llundain, bydd y gofrestrfa yn blatfform i ddarparwyr gofal iechyd gofnodi manylion digwyddiadau anaffylacsis, a chasglu data o’r Deyrnas Unedig yn ei chyfanrwydd er mwyn cael darlun gwell o’r mathau o adweithiau alergaidd, eu hamlder, a’u dosbarthiad daearyddol."
        },
        {
            "text": "Roedd angen mewnbwn enfawr gan nifer o bobl ar gyfer y ddwy fenter hyn. Y gobaith yw y bydd y gofrestrfa a’r newid yn y gyfraith yn atal adweithiau anaffylactig, derbyniadau i'r ysbyty a marwolaethau diangen pellach."
        },
        {
            "text": "I gael rhagor o wybodaeth am ein gwaith ar alergeddau bwyd, ewch i'n gwefan lle mae canllawiau i fusnesau a defnyddwyr."
        },
        {
            "text": " "
        },
        {
            "text": "Rwy’n gobeithio i chi gael y neges ddiweddaraf hon yn ddefnyddiol. Os hoffech gael rhifynnau’r dyfodol yn uniongyrchol i’ch mewnflwch, cofrestrwch am y diweddariadau. Gallwch hefyd gofrestru i gael eich hysbysu am bob blog gan yr ASB, ac nid y neges hon yn unig."
        }
    ]
}