{
    "url": "https://deframedia.blog.gov.uk/2021/10/15/package-of-measures-announced-to-support-pig-sector/",
    "title": "Package of measures announced to support pig sector",
    "authors": [
        "Defra Press Office"
    ],
    "categories": [
        "Weekly stories"
    ],
    "pub_date": "2021-10-15T11:20:13+01:00",
    "content": [
        {
            "text": "There has been widespread coverage of the announcement of a package of measures to support the pig industry. This was widely covered in national, regional and trade media, including The Times, The Financial Times, Daily Mail, The Guardian, the I (p.7), the Independent, The Daily Express, The Sun, Metro, BBC News Online, ITV News and Sky News."
        },
        {
            "text": "These measures come in recognition of the unique temporary circumstances farmers are facing, brought about by the global economy responding to the impacts of the pandemic and the global pressures facing supply chains worldwide. They include:"
        },
        {
            "text": "In support of pig producers in England and Scotland, the 2 meat levy bodies have also announced a pork levy holiday – suspending payments of the levy pig farmers and producers are required to pay for November 2021. This will amount to savings for the sector of just under £1 million. The Agriculture and Horticulture Development Board (AHDB) and Quality Meat Scotland (QMS) took the decision in response to the continued build-up of pigs on farm, falling prices and high production costs."
        },
        {
            "text": "The Government will work with the AHDB to support the establishments that have been delisted by China and to identify other export markets for pork. In addition, Defra will engage with retailers and food service sectors to support processors and the consumption of a variety of cuts of domestically produced pork."
        },
        {
            "text": "Environment Secretary, George Eustice, said:"
        }
    ]
}