{
    "url": "https://governmentscienceandengineering.blog.gov.uk/2021/10/15/proud-to-be-black-history-month-2021/",
    "title": "Proud to be – Black History Month 2021",
    "authors": [
        "Leon Kennedy"
    ],
    "categories": [
        "Blog Series",
        "Diversity & Inclusion"
    ],
    "pub_date": "2021-10-15T10:30:16+01:00",
    "content": [
        {
            "text": "October marks the month-long recognition of Black History Month and this year the theme is “proud to be”.  As we focus on recognising the many important contributions that have been made by members of the black community, we also seek to inspire others by encouraging you to share with us your sense of pride."
        },
        {
            "text": "To kick things off from the GSE Profession Team, we thought we would share this powerful message which we hope will resonate with many people, from all backgrounds:"
        },
        {
            "text": "We are proud to be part of a diverse Profession which celebrates science and engineering talent regardless of who you are or where you’ve come from. Here are thoughts from some of our members which resonate with Black History Month."
        },
        {
            "text": "Marie shared: “I’m proud to be black because I love the diversity of cultures, music and languages in the black community and our joyful spirit despite setbacks.”"
        },
        {
            "text": "Akosua added: “The older I get the more grateful I am of the diverse culture I belong to.  I am proud of being black and celebrate who I am.”"
        },
        {
            "text": "Andrea says: “I am proud to be a black woman who knows my worth as a resilient, supportive and nurturing individual.” "
        },
        {
            "text": "We invite our members to find out more about some of the leading black engineers that you may not be aware of, or become more familiar with inspirational scientists with minority ethnic heritage."
        },
        {
            "text": "You can find more information about Black History Month, and prominent figures in the following resources:"
        },
        {
            "text": "https://www.blackhistorymonth.org.uk/"
        },
        {
            "text": "https://www.awarenessdays.com/awareness-days-calendar/black-history-month-2021/"
        },
        {
            "text": "https://www.enei.org.uk/celebrating-british-black-history-2021"
        },
        {
            "text": "https://pearnkandola.com/webinars/register-now-for-our-black-history-month-series-"
        },
        {
            "text": "https://www.100greatblackbritons.co.uk/resources.html"
        },
        {
            "text": "We would love to hear from our members, so please send your messages of pride to gse@go-science.gov.uk and if you are comfortable we will add to this blog in recognition of Black History Month."
        },
        {
            "text": "Sign up to the GSE blog to receive an email when a new blog is published and keep up to date with the work of the GSE profession."
        }
    ]
}