{
    "url": "https://ipo.blog.gov.uk/2021/10/15/the-photography-show-qa/",
    "title": "The Photography Show: your questions answered",
    "authors": [
        "Oliver Downey"
    ],
    "categories": [
        "Copyright",
        "Digital",
        "Licensing"
    ],
    "pub_date": "2021-10-15T11:55:51+01:00",
    "content": [
        {
            "text": "The IPO Business Engagement team frequently attends trade shows and business events across the UK to support sectors and advise on different aspects of intellectual property."
        },
        {
            "text": "IPO Digital Communications Officer, Oliver Downey, recently attended The Photography Show at the NEC Birmingham alongside the team, where copyright was centre stage."
        },
        {
            "text": "It was remarkable to see the incredible new technology on display and how intellectual property was being used to protect inventions and works. We received lots of questions about photography, copyright, and the ways in which you can protect your creative labours."
        },
        {
            "text": "In this blog, I will endeavour to answer the most frequently asked questions from the show, to provide you with the tools to protect your works and alleviate any concerns you may have."
        },
        {
            "heading": 3,
            "text": "Question: How do I protect my images?"
        },
        {
            "text": "Answer: Copyright gives you (the copyright owner) the right to exclusively control and exploit your creative works. Copyright exists automatically – there is no formal registration. You can mark your work with the copyright symbol (©), your name and the year of creation. Whether you mark the work or not doesn’t affect the level of protection you have. If you create digital images, you should also think about completing the metadata in the file."
        },
        {
            "text": "Photographs will generally be protected by copyright as artistic works. This means that a user will usually need your permission if they want to perform certain acts, such as copying your image or sharing it on the internet. In the UK, copyright in photographs/images lasts for the life of the creator plus 70 years from the end of the calendar year of their death."
        },
        {
            "heading": 3,
            "text": "Question: What should I do if somebody is using my images/photographical works without my permission? "
        },
        {
            "text": "Answer: If somebody is making use of your images without your permission, there are several options available to you as the copyright owner. How much the challenge will cost will depend on the approach you take."
        },
        {
            "heading": 3,
            "text": "Question: When uploading images to social media, do I automatically transfer my copyright to the platform? "
        },
        {
            "text": "Answer: No. However, when you join a social media website you should check that website’s terms and conditions to ensure that they are not allowing the website operator to do something with your photographs that you do not want. Their terms and conditions may allow them to use your images for commercial purposes or make your images available for others to use, without your prior permission or notice. This is usually a license to use your works than a transfer of copyright, but it’s a good idea to check."
        },
        {
            "heading": 4,
            "text": "Question: I unsuccessfully tendered for a project, but the company used my ideas with another photographer. "
        },
        {
            "text": "Answer: Copyright does not protect ideas or concepts, but only the expression of those ideas. If you put your project tender in writing or produce visuals to illustrate it, they may qualify for protection by copyright."
        },
        {
            "text": "The distinction between ideas and expression is not always clear-cut. Although taking general or commonplace ideas is unlikely to qualify as an infringement of copyright, taking ideas which are sufficiently well-developed/detailed may infringe. This is because these elements would usually form an integral part of the author’s creative expression. If you believe your rights have been infringed, you could raise this with the company."
        },
        {
            "heading": 4,
            "text": "Question: If I copy and digitally repair old postcards / photos – do I hold the copyright can I sell copies commercially?"
        },
        {
            "text": "Answer: If an artistic work like an old postcard or photograph is out of copyright, if that work is digitally repaired or digitised, it is unlikely that it would attract a new copyright. This is because copyright in artistic works including digitised works must be original and reflect the author’s ‘own intellectual creation’. If you had a dispute with someone about whether a work was protected by copyright, only a court would have the authority to determine this."
        },
        {
            "text": "Even if you could not license or sell copies of digitised or digitally repaired works using a copyright licence, this would not prevent commercial use. For example, providing a high resolution version of the image could have a fee attached, just not make copyright restrictions."
        },
        {
            "heading": 4,
            "text": "Question: If I take a picture of street art, can I share and use this image without permission?"
        },
        {
            "text": "Answer: Generally, copying or dissemination to the public of a substantial part of a copyright-protected work without permission is copyright infringement."
        },
        {
            "text": "There are some exceptions to copyright – circumstances in which use of a copyright-protected work does not require permission. For example, you can take a photograph of a building or sculpture, provided it is permanently situated in a public place or in premises open to the public. However, this particular exception does not apply to two-dimensional works like graffiti. More information about exceptions is here."
        },
        {
            "heading": 4,
            "text": "Question: How can I protect myself internationally?"
        },
        {
            "text": "Answer: The first thing to be aware of is that it is the law of the country where an act occurs which usually applies. Usually, the protection of your work abroad will be automatic in the same way as it is in the UK."
        },
        {
            "text": "As a result of a number of international agreements, including the Berne Convention, the UK generally provides reciprocal protection to works created in most other countries. The Berne Convention provides that works will receive automatic protection without formality. You may still choose to mark your work with the copyright symbol (©), your name and the year of creation. More information is available here."
        },
        {
            "text": "To learn more about the different areas of intellectual property, including copyright, check out our free interactive learning tool IP Equip here."
        }
    ]
}