{
    "url": "https://food.blog.gov.uk/2021/10/15/the-impact-of-the-covid-19-pandemic-on-handwashing/",
    "title": "The impact of the COVID-19 pandemic on handwashing",
    "authors": [
        "Helen Heard, Senior Social Science Research Officer"
    ],
    "categories": [
        "Foodborne disease",
        "Hygiene"
    ],
    "pub_date": "2021-10-15T09:21:09+01:00",
    "content": [
        {
            "text": "Cymraeg"
        },
        {
            "text": "On Global Handwashing Day, we have published a report into the impact of the COVID-19 pandemic on handwashing behaviour. Here, Helen Heard, Senior Social Science Research Officer, looks at the key findings from the report and how they can help us better understand hand hygiene."
        },
        {
            "text": " "
        },
        {
            "text": "Global Handwashing Day is an annual advocacy day dedicated to increasing awareness and understanding about the importance of handwashing as an effective and affordable way to prevent diseases and save lives."
        },
        {
            "text": "This year, to accompany the initiative, we have published research on consumer hand hygiene during the COVID-19 pandemic. Conducted with Ipsos MORI, the report combines qualitative and quantitative research to understand how and why people wash their hands, the implications for food safety, and whether attitudes and behaviour towards handwashing have significantly changed as a result of the pandemic."
        },
        {
            "heading": 2,
            "text": "A moment of change for attitudes towards handwashing"
        },
        {
            "text": "The report found that the COVID-19 pandemic was a ‘moment of change’ for consumer handwashing."
        },
        {
            "text": "The pandemic was cited as a direct cause of participants washing their hands for longer, more thoroughly and in new situations. This was particularly pronounced outside the home, compared to the routines many had before the pandemic."
        },
        {
            "text": "The pandemic also led to increased consumer knowledge and awareness about good hand hygiene practices. Most participants knew that the most effective method for handwashing was to use soap, warm water, and a thorough technique for approximately 20 seconds."
        },
        {
            "heading": 2,
            "text": "The social pressure of handwashing"
        },
        {
            "text": "This research found that consumer handwashing is complex and influenced by a variety of different social and personal factors.\nParticipants had a desire to ‘do the right thing’ by washing their hands during the pandemic and experienced a social pressure to wash their hands correctly in public places to avoid being judged as ‘unclean’ or ‘irresponsible’ by others."
        },
        {
            "text": "Handwashing was influenced by friends, family, education, and cultural background, making it clear that handwashing is a socially influenced activity."
        },
        {
            "text": "Handwashing is also emotionally weighted for many participants, as they often associated handwashing with a sense of comfort and reassurance, feeling anxious or distressed when they were unable to wash their hands."
        },
        {
            "heading": 2,
            "text": "Handwashing at home"
        },
        {
            "text": "The research shows that settings outside the home, once considered ‘safe’, such as supermarkets, restaurants, cafes, and the workplace, had become places where people felt at increased risk of contracting COVID-19."
        },
        {
            "text": "While behaviour outside of home changed for a significant number of respondents, in contrast many of our participants considered their home to be a ‘safe space’ during the pandemic. This led them to believe that it was not necessary to wash their hands as regularly when at home."
        },
        {
            "text": "However, we also found out that consumers are good at washing their hands in some situations, particularly to avoid cross-contamination from raw meat, fish, and eggs. This was in connection to a fear of food poisoning."
        },
        {
            "heading": 2,
            "text": "Barriers to good hand hygiene"
        },
        {
            "text": "Inaccessible, unhygienic, and crowded facilities were all cited by participants as barriers to good hand hygiene."
        },
        {
            "text": "Whilst the presence of hand sanitiser stations improved hand hygiene by acting as a prompt for consumers to wash their hands or to use hand sanitiser, participants preferred to use soap and warm water to wash their hands."
        },
        {
            "text": "When no handwashing facilities were available, many resorted to using hand sanitiser, although many disliked the sensation on their skin."
        },
        {
            "heading": 2,
            "text": "Improving handwashing practices"
        },
        {
            "text": "Although the pandemic has led to increased handwashing practices and improved consumer knowledge, there are still some situations where consumers could improve their hand hygiene."
        },
        {
            "text": "This is particularly pronounced:"
        },
        {
            "text": "Typically, participants did not consider these situations to be ‘high risk’, which resulted in less thorough handwashing and an increased risk of spreading disease."
        },
        {
            "text": "We’ll continue to monitor consumer handwashing behaviour through our quarterly handwashing tracker."
        },
        {
            "text": "This will help us to determine if any observed changes in handwashing behaviours continue as consumers adjust to life beyond the pandemic. This data will be published and inform our advice."
        },
        {
            "heading": 1,
            "text": "Effaith y pandemig COVID-19 ar olchi dwylo"
        },
        {
            "text": "A hithau’n Ddiwrnod Golchi Dwylo Byd-eang, rydym ni wedi cyhoeddi adroddiad ar effaith y pandemig COVID-19 ar ymddygiad golchi dwylo. Yma, mae Helen Heard, Uwch Swyddog Ymchwil Gwyddor Gymdeithasol, yn edrych ar ganlyniadau allweddol yr adroddiad, a sut gallant ein helpu i ddeall hylendid dwylo yn well."
        },
        {
            "text": " "
        },
        {
            "text": "Mae Diwrnod Golchi Dwylo Byd-eang yn ddiwrnod eirioli blynyddol, a’i nod yw cynyddu ymwybyddiaeth a dealltwriaeth o bwysigrwydd golchi dwylo fel ffordd effeithiol a fforddiadwy i atal afiechydon ac achub bywydau."
        },
        {
            "text": "Eleni, i gyd-fynd â’r fenter, rydym ni wedi cyhoeddi ymchwil i hylendid dwylo defnyddwyr yn ystod y pandemig COVID-19. Cynhaliwyd yr adroddiad ar y cyd ag Ipsos MORI, gan gyfuno ymchwil ansoddol a meintiol i ddeall sut a pham mae pobl yn golchi eu dwylo, goblygiadau hyn i ddiogelwch bwyd, ac a yw agweddau ac ymddygiad tuag at olchi dwylo wedi newid yn sylweddol o ganlyniad i’r pandemig."
        },
        {
            "heading": 2,
            "text": "Adeg o newid i agweddau tuag at olchi dwylo"
        },
        {
            "text": "Canfu'r adroddiad fod y pandemig COVID-19 yn ‘adeg o newid’ i ddefnyddwyr o ran golchi dwylo."
        },
        {
            "text": "Cyfeiriwyd at y pandemig fel yr hyn a wnaeth beri yn uniongyrchol i gyfranogwyr olchi eu dwylo am gyfnod hirach, yn fwy trylwyr, ac mewn sefyllfaoedd newydd. Roedd hyn yn arbennig o amlwg y tu allan i’r cartref, o gymharu ag arferion pobl cyn y pandemig."
        },
        {
            "text": "Mae’r pandemig hefyd wedi arwain at gynnydd mewn ymwybyddiaeth a gwybodaeth am arferion hylendid dwylo da ymysg defnyddwyr. Roedd y mwyafrif o gyfranogwyr yn gwybod taw’r dull golchi dwylo mwyaf effeithiol yw defnyddio sebon, dŵr cynnes, a thechneg drylwyr am oddeutu 20 eiliad."
        },
        {
            "heading": 2,
            "text": "Pwysau cymdeithasol o ran golchi dwylo"
        },
        {
            "text": "Canfu'r ymchwil hon fod arferion golchi dwylo defnyddwyr yn gymhleth, ac y dylanwedir arnynt gan ystod o wahanol ffactorau cymdeithasol a phersonol."
        },
        {
            "text": "Roedd cyfranogwyr yn awyddus i ‘wneud y peth iawn’ trwy olchi eu dwylo yn ystod y pandemig, ac fe wnaethant brofi pwysau cymdeithasol i olchi eu dwylo’n gywir mewn mannau cyhoeddus i osgoi cael eu gweld yn ‘aflan’ neu’n ‘anghyfrifol’ gan eraill."
        },
        {
            "text": "Dylanwadwyd ar olchi dwylo gan ffrindiau, teulu, addysg, a chefndir cymdeithasol, gan ei gwneud yn glir bod golchi dwylo yn weithgaredd y dylanwedir arno’n gymdeithasol."
        },
        {
            "text": "Mae golchi dwylo hefyd yn dwyn pwysau emosiynol i lawer o gyfranogwyr, am eu bod yn aml yn ei gysylltu ag ymdeimlad o gysur a sicrwydd, gan deimlo’n bryderus neu’n ofidus pan nad ydynt yn gallu golchi eu dwylo."
        },
        {
            "heading": 2,
            "text": "Golchi dwylo gartref"
        },
        {
            "text": "Mae’r ymchwil yn dangos bod rhai lleoliadau y tu allan i’r cartref a ystyrid gynt yn ‘ddiogel’, fel archfarchnadoedd, bwytai, caffis, a’r gweithle, bellach yn lleoedd sy’n peri i bobl deimlo eu bod yn fwy tebygol o gael COVID-19."
        },
        {
            "text": "Er bod ymddygiad y tu allan i’r cartref wedi newid ar gyfer nifer sylweddol o ymatebwyr, fe wnaeth nifer o gyfranogwyr, ar y llaw arall, ystyried bod eu cartref yn ‘ofod diogel’ yn ystod y pandemig. Parodd hyn iddynt gredu nad oedd angen iddynt olchi eu dwylo mor rheolaidd gartref."
        },
        {
            "text": "Fodd bynnag, fe wnaethom hefyd ddarganfod bod defnyddwyr yn dda am olchi eu dwylo mewn rhai sefyllfaoedd, yn enwedig er mwyn osgoi croeshalogi gan gig, pysgod ac wyau amrwd. Roedd hyn mewn perthynas ag ofn gwenwyn bwyd."
        },
        {
            "heading": 2,
            "text": "Rhwystrau i hylendid dwylo da"
        },
        {
            "text": "Cyfeiriodd cyfranogwyr at gyfleusterau anhygyrch, anhylan a gorlawn fel rhwystrau i hylendid dwylo da."
        },
        {
            "text": "Er bod presenoldeb cyfleusterau glanweithydd dwylo wedi gwella hylendid dwylo da trwy ysgogi pobl i olchi eu dwylo neu ddefnyddio glanweithydd dwylo, roedd yn well gan gyfranogwyr ddefnyddio sebon a dŵr cynnes i olchi eu dwylo."
        },
        {
            "text": "Pan nad oedd cyfleusterau ar gael, fe wnaeth llawer droi at lanweithydd dwylo, er nad oeddent yn hoffi’r teimlad ar eu croen."
        },
        {
            "heading": 2,
            "text": "Gwella arferion golchi dwylo"
        },
        {
            "text": "Er bod y pandemig wedi arwain at gynnydd mewn arferion golchi dwylo a gwell gwybodaeth ymysg defnyddwyr, mae yna rai sefyllfaoedd eto i gyd lle y gallai defnyddwyr wella eu hylendid dwylo."
        },
        {
            "text": "Mae hyn yn arbennig o amlwg:"
        },
        {
            "text": "Yn nodweddiadol, nid oedd cyfranogwyr yn credu bod y sefyllfaoedd hyn yn rhai ‘risg uchel’, a barodd eu bod yn llai trylwyr wrth olchi eu dwylo gan gynyddu’r risg o ledaenu afiechyd."
        },
        {
            "text": "Byddwn yn parhau i fonitro arferion golchi dwylo defnyddwyr trwy ein traciwr golchi dwylo chwarterol."
        },
        {
            "text": "Bydd hyn yn ein helpu i bennu a oes unrhyw newidiadau i arferion golchi dwylo o hyd wrth i ddefnyddwyr addasu i fywyd wedi’r pandemig. Caiff y data hwn ei gyhoeddi, gan lywio ein cyngor."
        }
    ]
}