{
    "url": "https://defrafarming.blog.gov.uk/2021/10/15/update-on-the-sustainable-farming-incentive-pilot/",
    "title": "Update on the Sustainable Farming Incentive pilot ",
    "authors": [
        "Lisa Applin",
        "Tom Lewis"
    ],
    "categories": [
        "Conversations we're having",
        "environmental land management schemes",
        "Sustainable Farming Incentive pilot",
        "Things we're doing",
        "Things we've learned"
    ],
    "pub_date": "2021-10-15T14:19:17+01:00",
    "content": [
        {
            "text": "In July, we opened the applications window for farmers to join our Sustainable Farming Incentive pilot.  "
        },
        {
            "text": "The Sustainable Farming Incentive is 1 of the 3 new environmental land management schemes. It sits alongside the future Local Nature Recovery and Landscape Recovery schemes. "
        },
        {
            "text": "Through the Sustainable Farming Incentive, farmers will be paid for environmentally sustainable actions – ones that are simple to do and do not require previous agri-environment scheme experience.   "
        },
        {
            "text": "We are piloting the scheme to learn about the best way to deliver the Sustainable Farming Incentive. Putting farmers at the heart of that learning is important to us. "
        },
        {
            "heading": 2,
            "text": "The response  "
        },
        {
            "text": "In this post, we would like to share the results of the application process, what we learned and what we will do next. "
        },
        {
            "text": "As we mentioned, the applications window opened in July and closed at the end of September. "
        },
        {
            "text": "In total, 938 farmers completed an application. We wanted several hundred and had been aiming for 1,000 so this number of applications is pretty much bang on our target for a meaningful and useful pilot.  "
        },
        {
            "text": "We are very pleased at the amount of interest shown and the willingness of those who’ve applied to work with us to shape the new scheme. "
        },
        {
            "text": "We set out to achieve a representative sample of farmers in England, we wanted to try and ensure that what we learnt in the pilot was representative of farming in England.   "
        },
        {
            "text": "We are crunching through lots of information about who has applied, but here is what we know so far. "
        },
        {
            "heading": 3,
            "text": "Farm types "
        },
        {
            "text": "We used the 2021 agricultural census to help us set a proportional target and the proportions in the pilot are just about right. The smaller groups are just as important – our schemes need to work for everyone. "
        },
        {
            "heading": 3,
            "text": "Farm tenure "
        },
        {
            "text": "Of our applicants, 22% rent all or most of their land, this is close to the census figure of 26%. We’re encouraged that we have good take up from tenant farmers to help us make sure the new scheme works well for tenant farmers. "
        },
        {
            "heading": 3,
            "text": "Land and farm size "
        },
        {
            "text": "21,265 land parcels (fields) were included representing 109,477 hectares of land.  "
        },
        {
            "text": "Farm size is important and we have a good mix of farm sizes: "
        },
        {
            "heading": 2,
            "text": "Next steps "
        },
        {
            "text": "Now that the application stage is over, we are starting to issue the legal agreements for them to be put in place from 1 November. "
        },
        {
            "text": "Some agreements might start later in the year but we need the agreements signed up to and returned by our participants in good time, so we’ll be sure to factor that in.  "
        },
        {
            "text": "Payments will start in the spring. We will start off by paying quarterly, with our intention to pay 3 months after the agreements start, so the sooner they are agreed, the sooner the money will be paid out. "
        },
        {
            "text": "The pilot agreements will last for 3 years. We hope the farmers who have applied will stay with us all the way through to 2024. "
        },
        {
            "heading": 2,
            "text": "What we’ve learned so far and what we’re doing with this information "
        },
        {
            "heading": 3,
            "text": "Application guidance "
        },
        {
            "text": "What we heard: Some farmers struggled to use guidance online and would have preferred printable versions. "
        },
        {
            "text": "What we're doing about it:  We’re taking all of that feedback and using it to improve and simplify our technical guidance for the standards we’ll be taking into early rollout of the scheme next year. "
        },
        {
            "heading": 3,
            "text": "Application process"
        },
        {
            "text": "What we heard: Those who attended a Defra pre-recorded webinar better understood how to apply. The Rural Payments Agency produced a video tutorial and this made a positive difference to the farmer experience. "
        },
        {
            "text": "What we're doing about it: We’d like people to be able to complete applications without needing guidance or support so we have further work to do on the process to make it as simple as possible.  "
        },
        {
            "heading": 3,
            "text": "Support  "
        },
        {
            "text": "What we learned: We designed the standards to be simple and not require too much support or advice, however around 700 farmers and their agents sought help from RPA. "
        },
        {
            "text": "What we’re doing about it:  This feedback has led to changes and clarification to the online guidance as well as an ongoing review to the way the standards are designed and developed.   We want our Sustainable Farming Incentive standards to be as straightforward as possible – and the pilot is helping us learn the best way to do this.  "
        },
        {
            "heading": 3,
            "text": "Data  "
        },
        {
            "text": "What we heard: Several farmers spotted out-of-date information online and they found the process to update data complex and difficult to navigate "
        },
        {
            "text": "What we’re doing about it: This feedback will be rolled into our content improvement plans. We will look to make these improvements ahead of early rollout of the Sustainable Farming Incentive next year. "
        },
        {
            "heading": 3,
            "text": "Usability of the pilot application service  "
        },
        {
            "text": "What we heard: There were challenges with the online application portal including small windows on screens, tricky to use text fields and button placement. Various bugs and gremlins also arose, many of which the Rural Payments Agency responded quickly to resolve while the service was live.   "
        },
        {
            "text": "What we’re doing about it: We’re reviewing all the feedback and data about the service and using that to make improvements to the user experience.  "
        },
        {
            "heading": 3,
            "text": "Standard fit"
        },
        {
            "text": "What we heard: Some farmers struggled to fit the standards to their farm. They tended to choose standards and ambition levels to coincide with their current activities or plans. They reported that the description of the standards felt too inflexible. For example, the inability to apply different ambition levels on different land parcels. "
        },
        {
            "text": "What we’re doing about it: We will take this into our thinking as we continue to develop the standards. "
        },
        {
            "heading": 3,
            "text": "Payments  "
        },
        {
            "text": "What we heard: Some people were put off from doing more because the payment rates were considered an insufficient incentive. "
        },
        {
            "text": "What we’re doing about it: Our payment rates are under review. We’ll publish more information about this before the end of this year "
        },
        {
            "heading": 2,
            "text": "Final thoughts and future announcements "
        },
        {
            "text": "Getting to this point required lots of hard work and collaboration. We’re grateful to the farmers who have so enthusiastically engaged with us. Our partners and stakeholder organisations have been amazing at guiding and supporting our work. Our colleagues across Defra and its delivery bodies have worked hard to make this all happen. "
        },
        {
            "text": "We will soon publish an update to the Agricultural Transition Plan. It will include details of what’s coming up next year. It will also give us an opportunity to reflect on the findings of the pilot. "
        },
        {
            "text": "We will continue to use the Future Farming blog to update you, so don’t forget to subscribe. "
        }
    ]
}