{
    "url": "https://healthcareleaders.blog.gov.uk/2021/10/15/what-does-the-health-and-care-bill-mean-for-nhs-staff/",
    "title": "What does the Health and Care Bill mean for NHS staff?",
    "authors": [
        "Sajid Javid - Secretary of State for Health and Social Care, Department of Health and Social Care"
    ],
    "categories": [
        "Health and Care Bill",
        "Healthcare regulation",
        "Supporting NHS staff"
    ],
    "pub_date": "2021-10-15T12:23:15+01:00",
    "content": [
        {
            "text": "The Covid-19 pandemic has tested our country like never before – and nowhere more so than our health and care system."
        },
        {
            "text": "You all rose to meet this test in remarkable new ways, through bold new ways of working, casting aside bureaucracy, and working seamlessly across traditional boundaries."
        },
        {
            "text": "We must hold on to the remarkable spirit of integration and innovation that we’ve seen, but we must also remove the obstacles that are holding you back, and this is what our new Health and Care Bill will deliver."
        },
        {
            "heading": 3,
            "text": "First, it will support the entire NHS workforce by throwing aside the restrictive and bureaucratic legal barriers that get in the way of you doing your job."
        },
        {
            "text": "Because after our shared experience of the pandemic, we’ve looked at rules and regulations through new eyes, and it’s become increasingly clear which ones are the cornerstone of safe high-quality care, and which are stifling innovation and damaging morale."
        },
        {
            "text": "It’s this second group of rules and regulations that this Bill strips away, for example removing the existing procurement regime and improving the way healthcare services are arranged."
        },
        {
            "heading": 3,
            "text": "Second, the Bill will make the system more integrated."
        },
        {
            "text": "Integrated Care Systems (ICSs) will remove existing bureaucratic barriers by bringing together GPs, hospitals and community services and providing joined-up care which best serves the needs of patients."
        },
        {
            "text": "Across the country, we’re already seeing the benefits of this joined up approach. In West Yorkshire, they’re bringing together colleagues across health and care to effectively triage patient referrals. The means less pressure on primary care services in the area, and patients being seen in the right place at the right time."
        },
        {
            "heading": 3,
            "text": "Third, the Bill will also improve how the NHS uses data, meaning better treatment for patients and better support for those on the front line."
        },
        {
            "text": "Earlier in the year, we published our strategy ‘Data saves lives: reshaping health and social care with data’. This showed how we would bust barriers to the best use of data in health and care, for example by implementing the shared care records that can reduce the time it takes to access a record from approximately 15 minutes to just 30 seconds. This means a better experience for patients and freeing up colleagues’ time to focus on frontline care."
        },
        {
            "text": "Of course, the Bill is not the limit to our ambition for the nation’s health."
        },
        {
            "text": "As we recover from this pandemic, there are so many challenges ahead, like the elective backlog, an ageing population, and an increase in people with multiple health conditions."
        },
        {
            "text": "So we’re transforming public health, we’ve announced a record £36 billion investment in the health and care system over the next three years, and we’ve set out our plans to put adult social care on a sustainable footing for the future."
        },
        {
            "text": "This work, and our Health and Care Bill, will help us build on the incredible work you’ve done during the pandemic, so we can shape a system that’s well equipped for the future."
        }
    ]
}