{
    "url": "https://civilservice.blog.gov.uk/2025/09/10/a-day-in-the-life-of-a-grants-professional/",
    "title": "A Day in the Life of a… Grants Professional",
    "authors": [
        "Civil Service"
    ],
    "categories": [
        "Professions"
    ],
    "pub_date": "2025-09-10T15:36:55+00:00",
    "content": [
        {
            "text": "We caught up with Suzanne Anderson, Commercial Grants Lead in the Department for Science, Innovation and Technology, to learn more about what being a Grants Manager really entails."
        },
        {
            "text": "All across the Civil Service, talented colleagues in specialised roles are working hard to deliver for the British public. But have you ever wondered what a day in the life of someone doing these jobs actually looks like? We sure have."
        },
        {
            "text": "To mark the recent launch of the Grants Profession, we caught up with Suzanne Anderson, Commercial Grants Lead in the Department for Science, Innovation and Technology:"
        },
        {
            "text": "Tell us about a typical day in your role."
        },
        {
            "text": "No two days are ever the same when you work in grants. That’s not just a cliché, it’s the reality of life in the DSIT Grants Hub, where I work as part of a centralised team of grant specialists in the department’s Commercial function. Our job is to help policy colleagues design and deliver grant schemes that are robust, compliant, and ultimately deliver real value for public money."
        },
        {
            "text": "My role gives me a front-row seat to a wide range of programmes, from Cyber and AI to Regulatory and Health to name just a few. It’s not just the breadth that keeps things interesting, but the depth too. I often find myself deep in the details of grant functional standards such as assessing if a grant is considered a subsidy using the Subsidy Control guidance to diving into eligible funding assessments on grant claims."
        },
        {
            "text": "We offer different levels of support depending on the needs of each scheme. Sometimes that means providing core advice on business case development and award processes. Other times, we’re more hands on. It’s a flexible model that allows us to tailor our involvement to what’s needed most."
        },
        {
            "text": "So yes, no day is ever the same. And that’s exactly why I love it."
        },
        {
            "text": "Best bit about your job?"
        },
        {
            "text": "Working in grants might not be glamorous, but it’s deeply rewarding. You get to see the direct link between your work and the outcomes it enables, whether that’s supporting cutting-edge research, helping small businesses grow, or driving forward national priorities. And you do it all while navigating the complexities of public sector governance, which keeps you sharp and grounded."
        },
        {
            "text": "Recently, I wrapped up moderating a grant competition which was the first of its kind to be run entirely in-house by the DSIT Grants Hub. It was a milestone moment for us and a great example of how we’re building capability within the department."
        },
        {
            "text": "It’s a role that combines technical rigour with creative problem-solving. We’re constantly asking: How can we add value? How do we ensure compliance without stifling innovation? And how do we make sure every pound of government funding delivers impact?"
        },
        {
            "text": "Most stressful moment you've experienced in the job? "
        },
        {
            "text": "The most stressful moments tend to come when you're trying to anticipate the volume of applications ahead of a major funding deadline. We need to make sure we're prepared, while also managing team resources efficiently. It’s always encouraging when interest is high, but that also means a last-minute scramble to ensure we have enough assessors in place to manage the workload. "
        },
        {
            "text": "How do you handle the pressure when millions of pounds ride on your recommendations? Is it stressful? How do you switch off?"
        },
        {
            "text": "When managing a particularly complex funding round the pressure is definitely real, but I’m fortunate to be part of a fantastic team where we fully support one another. That collaboration makes a huge difference!"
        },
        {
            "text": "I also make sure to get involved early in the design of grant schemes and seek input from experts where needed, such as the Complex Grants Advice Panel (CGAP). Having a clearly defined and consistently followed assessment process helps maintain confidence in our recommendations, especially when significant funding is at stake."
        },
        {
            "text": "As for switching off at the end of the day, I've recently moved house, so evenings are currently filled with wallpaper stripping and other hands-on tasks. It’s a great way to decompress and shift gears from the structured, analytical nature of my day job."
        },
        {
            "text": "How do you spot when an application looks too good to be true? What red flags make you dig deeper into someone's proposal?"
        },
        {
            "text": "Spotting an application that seems too good to be true often comes down to the detail or lack thereof. Vague statements without supporting evidence or a clear rationale for the project's expected outcomes are a major red flag. I also look closely at how the grant will be managed and reported on, particularly around stakeholder engagement or risk management. If there’s ambiguity in those areas, it prompts further scrutiny."
        },
        {
            "text": "Who should join the Grants Profession?"
        },
        {
            "text": "The Grants Profession is a diverse community that brings together grant-making practitioners from across government, arm's length bodies and the wider public sector. It is open to all practitioners, from policy design to management and administration. I’d encourage people to join the Grants Profession; together we are a united force committed to improving grant outcomes for citizens and communities."
        },
        {
            "text": "Interested in joining a different profession? There are 32 government professions available to help boost your career - join a profession today. "
        }
    ]
}