{
    "url": "https://defrafarming.blog.gov.uk/2025/09/10/an-update-on-csht-and-our-annual-report/",
    "title": "An update on CSHT and our annual report  ",
    "authors": [
        "The Team"
    ],
    "categories": [
        "Countryside Stewardship",
        "Farming and Countryside Programme"
    ],
    "pub_date": "2025-09-10T14:31:25+01:00",
    "content": [
        {
            "text": "Today we published the Farming and Countryside Programme’s (FCP) annual report. It sets out how funding has been used over the past year and the progress we’ve made with our environmental land management schemes. "
        },
        {
            "text": "We’re also publishing guidance to help eligible farmers, foresters and land managers prepare and submit Countryside Stewardship Higher Tier (CSHT) applications. The online service will open next week for those who have been invited and completed the pre-application process. "
        },
        {
            "text": "In this post, we share a summary. "
        },
        {
            "heading": 2,
            "text": "FCP annual report "
        },
        {
            "text": "Each year, the Secretary of State must publish a report showing how government funding has been used to support farmers and land managers across England.  "
        },
        {
            "text": "Publishing the report lets farmers, stakeholders, and the public see clearly how funding and policies are being used to support farms, the environment, and sustainable food production. "
        },
        {
            "text": "Over the past year, we’ve invested: "
        },
        {
            "text": "And the support isn’t stopping there. Funding for ELM schemes paid to farmers will grow by 150%, rising from £800 million in 2023/24 to £2 billion by 2028/29. That’s more money to invest in the land, wildlife, and sustainable practices that make farming thrive for the long term. "
        },
        {
            "text": "Read the full FCP annual report on GOV.UK. "
        },
        {
            "heading": 2,
            "text": "Countryside Stewardship Higher Tier (CSHT) "
        },
        {
            "text": "Next week, the online CSHT service will open for applications from farmers, foresters, and land managers who have been invited and completed pre-application advice. We'll blog again when it opens. "
        },
        {
            "text": "Since January, Natural England and the Forestry Commission have been supporting farmers and land managers to develop their CSHT applications. Over 1,500 people have been invited to receive pre-application support to date. "
        },
        {
            "text": "On the CSHT landing page, you will find:"
        },
        {
            "heading": 3,
            "text": "The improved CSHT "
        },
        {
            "text": "The new CSHT offer includes: "
        },
        {
            "heading": 3,
            "text": "Guidance to help you apply for CSHT "
        },
        {
            "text": "We’ve published guidance to help you prepare and submit a CSHT application using the online service, when you’re invited to do so.  "
        },
        {
            "text": "We understand that the CSHT process is new and works differently to other schemes, so we’ve included an optional checklist to guide you through each step – from preparing your application to submitting it.   "
        },
        {
            "heading": 3,
            "text": "Using the FIND tool to explore CSHT actions "
        },
        {
            "text": "All CSHT actions are now available in the FIND tool. You can use it to: "
        },
        {
            "text": "Each action includes optional advice to support farmers, foresters and land managers. This advice is there to help, but it’s not a requirement of the action.  "
        },
        {
            "heading": 3,
            "text": "Printable version of CSHT actions "
        },
        {
            "text": "You’ve told us that having a printable version of the CSHT actions is helpful. "
        },
        {
            "text": "We’ve created a print-friendly version that includes all the actions."
        },
        {
            "text": "It doesn’t include the optional advice as that would make each action too long and less straightforward to use. Instead, the printable version provides a direct link to the advice in the FIND tool.   "
        },
        {
            "heading": 2,
            "text": "Learn more "
        },
        {
            "text": "Back British Farming Day is an opportunity to celebrate the great work already happening across the country."
        },
        {
            "text": "Across England, farmers are already making a real difference for nature and sustainable food production. Right now, over 77,000 live agri-environment scheme agreements are supporting them to do just that. It is the highest number ever accepted."
        },
        {
            "text": "Farmers are innovating through inspiring projects supported by the Farming Innovation Programme, while Landscape Recovery has just entered an exciting new phase. "
        },
        {
            "text": "Subscribe to the Farming Blog to read these stories and keep up with our progress. You can also meet the team at agricultural shows or get involved in shaping our work through initiatives including our user research panel. "
        }
    ]
}