{
    "url": "https://environmentagency.blog.gov.uk/2025/09/10/protecting-atlantic-salmon-collaborating-to-conserve-threatened-stocks/",
    "title": "Protecting Atlantic salmon: collaborating to conserve threatened stocks",
    "authors": [
        "Environment Agency"
    ],
    "categories": [
        "Fisheries and biodiversity",
        "Nature",
        "Rivers"
    ],
    "pub_date": "2025-09-10T09:09:12+00:00",
    "content": [
        {
            "text": "The Environment Agency has published the latest Atlantic salmon stock assessment for England, providing insights into the health of our salmon populations. The results, based on 2024 data, confirm that salmon stocks remain at critically low levels, underscoring the urgent need for continued and coordinated conservation action. "
        },
        {
            "text": "Current Status "
        },
        {
            "text": "The 2024 assessment data reveals that 88% of England's principal salmon rivers are classified as 'at risk' or 'probably at risk' - a figure that remains largely unchanged from previous years. "
        },
        {
            "text": "Only a small number of rivers achieved the conservation egg deposition targets necessary for healthy salmon populations, highlighting the urgent need for continued conservation action. Encouraging signs emerge from the angling community's commitment to conservation, with catch and release practices helping to protect returning spawners and contribute to future breeding populations. "
        },
        {
            "text": "Understanding the Challenge "
        },
        {
            "text": "Atlantic salmon are remarkable fish that spend their early years in freshwater before migrating to the ocean to mature, eventually returning to their birth rivers to spawn. This complex lifecycle, spanning both freshwater and marine environments, makes them particularly vulnerable to environmental pressures. "
        },
        {
            "text": "The decline in salmon populations, from around 1.4 million adult fish returning in the 1970s-1980s to fewer than 500,000 today across the UK, reflects multiple interconnected challenges. These include reduced marine survival, poor water quality, climate change impacts, migration barriers from historic infrastructure, and habitat degradation. "
        },
        {
            "text": "Salmon serve as vital indicators of river and marine ecosystem health. Their decline signals broader environmental challenges that affect not just this species, but entire aquatic ecosystems and the communities that depend on them. "
        },
        {
            "text": "The Environment Agency’s Response "
        },
        {
            "text": "As the statutory body responsible for maintaining and improving salmon fisheries, the Environment Agency is taking comprehensive action across multiple fronts. "
        },
        {
            "text": "We're scaling up our regulatory work, increasing farm inspections from 4,000 to 6,000 annually to tackle agricultural pollution – the biggest cause of poor water quality in England. We’re also increasing water company inspections from 1,409 in 2022/23 to over 4,000 in 2024/25, with a target of 10,000 by March 2026. We're working with farmers and water companies providing guidance and support whilst taking enforcement action where necessary. "
        },
        {
            "text": "Physical barriers to fish migration are being systematically removed through collaborative partnerships. The 'Unlocking the Severn' project reopened 158 miles of river, while decades of partnership work across Yorkshire has achieved a remarkable milestone - the first Atlantic salmon parr recorded in the River Don in over 200 years. These successes demonstrate the effectiveness of long-term collaborative conservation efforts and support the Great Yorkshire Rivers partnership's ambitious aim of addressing artificial barriers negatively impacting fish populations in Yorkshire. "
        },
        {
            "text": "We're also investigating innovative solutions, such as our current study on the River Itchen to improve juvenile salmon migration past water control structures. "
        },
        {
            "text": "A Collaborative Effort "
        },
        {
            "text": "Salmon conservation cannot succeed through the efforts of any single organisation. It requires extensive collaboration across sectors and stakeholders. "
        },
        {
            "text": "We continue to work with water companies to reduce pollution incidents and improve compliance with environmental standards. The angling community has embraced catch and release practices, helping protect returning spawners. Agricultural stakeholders are working with us to implement better environmental practices. "
        },
        {
            "text": "Internationally, we collaborate through the North Atlantic Salmon Conservation Organisation (NASCO) to address challenges in marine environments, recognising that salmon conservation is a transnational issue requiring coordinated responses. "
        },
        {
            "text": "Local communities, conservation groups, and volunteers contribute through habitat restoration projects, citizen science initiatives, and advocacy for stronger environmental protections. "
        },
        {
            "text": "Looking Forward "
        },
        {
            "text": "While salmon stocks remain at concerning levels, there are examples of progress. The River Don's story shows that even rivers long considered lost can support breeding salmon populations again. "
        },
        {
            "text": "Recovery will take time. Salmon's complex lifecycle means improvements may take years to reflect in population data. But every successful spawning event, every barrier removed, and every partnership forged contributes to the long-term goal of restoring sustainable salmon populations. "
        },
        {
            "text": "The 2024 assessment reinforces that protecting salmon requires sustained commitment from all sectors of society. As we continue this vital work, we remain focused on transparency, collaboration, and delivering meaningful environmental improvements. "
        },
        {
            "text": "The Environment Agency continues to monitor salmon populations closely and welcomes partnerships with organisations committed to salmon conservation. For more detailed data and findings from our monitoring work, read the Assessment of Salmon Stocks and Fisheries in England and Wales 2024. "
        }
    ]
}