{
    "url": "https://naturalengland.blog.gov.uk/2025/09/10/reaching-the-global-final-what-a-thiess-riverprize-nomination-means-for-nature-recovery/",
    "title": "Reaching the global final – what a Thiess Riverprize nomination means for nature recovery ",
    "authors": [
        "Helen Kirkby"
    ],
    "categories": [
        "Landscapes",
        "Natural England",
        "Nature",
        "Nature Recovery",
        "Nature-based solutions",
        "Parks, trails and nature reserves",
        "Uncategorized"
    ],
    "pub_date": "2025-09-10T18:35:39+01:00",
    "content": [
        {
            "text": "By Helen Kirkby, NE Deputy Director for Cumbria "
        },
        {
            "text": "Last night in Brisbane, the Cumbrian River Restoration Partnership Programme didn't win the Thiess International Riverprize, but reaching the final alongside projects from Chicago, Albania and the western USA represents something extraordinary – recognition that our collaborative approach to river restoration is among the very best in the world. "
        },
        {
            "text": "My name is Helen Kirkby, and as Natural England's Deputy Director for Cumbria, I've been privileged to lead the team that has developed this programme alongside our key partners. "
        },
        {
            "text": "While we're naturally disappointed not to have won, being selected as one of just four global finalists for the world's most prestigious river restoration award is a remarkable achievement that reflects fifteen years of dedicated partnership working. "
        },
        {
            "text": "What started as a modest collaboration between Natural England, the Environment Agency and Cumbria's three Rivers Trusts has evolved into something unique – a partnership that now includes the National Trust, RSPB, United Utilities, Ullswater CIC, Cumbria Connect and many others, all united by a shared commitment to giving our rivers the space they need to thrive. "
        },
        {
            "text": "The scale of what we've accomplished together speaks for itself: nearly 100 kilometres of rivers restored, over 150 hectares of floodplain reconnected, and more than 100 individual projects completed across the Eden, Derwent and Kent catchments. But numbers alone don't capture the transformation I've witnessed – from salmon returning to spawn in Swindale Beck after 150 years to communities that are more resilient to flooding because we've allowed rivers to flow naturally again. "
        },
        {
            "text": "This international recognition, following our 2022 European Riverprize win, validates our approach to partnership working. Rather than working in isolation, we've demonstrated that bringing together diverse expertise creates solutions that work for both people and nature. "
        },
        {
            "text": "The resilience of our restored river sections during Storm Desmond in 2015 provided powerful evidence of why this work matters. While the extreme flooding caused devastation across Cumbria, our restoration projects proved remarkably resilient, with waters returning to normal levels much faster than in unrestored areas and allowing farming to resume more quickly. This taught us that nature-based solutions deliver benefits far beyond wildlife – they build climate resilience for the communities we serve. "
        },
        {
            "text": "Central to our success has been working hand-in-hand with farmers and landowners. Rather than imposing solutions, we've developed them together, proving that environmental improvement and sustainable farming can thrive side by side when restoration is designed with both people and nature in mind. "
        },
        {
            "text": "Karen Slater, one of our Senior Officers who has been integral to the programme's delivery, reflects on the collaborative approach: "
        },
        {
            "text": "“It is amazing what can be achieved with many partners working together, developing relationships with farmers and landowners across the protected Cumbrian Rivers to deliver river restoration at a landscape scale.  It is great that the success of this approach has been recognised internationally.”  "
        },
        {
            "text": "The partnership model we've pioneered in Cumbria demonstrates what Natural England can achieve when we work as genuine collaborators rather than regulators. By combining our ecological expertise with the Rivers Trusts' practical experience, United Utilities' water management knowledge, and the National Trust's land stewardship skills, we've created something greater than any single organisation could achieve alone. "
        },
        {
            "text": "Caroline Godden, one of our Higher Officers who has worked on countless projects, emphasises the flood management benefits that make this work so vital: "
        },
        {
            "text": "“Alongside the benefits to our wildlife and wild spaces, restoration of our Cumbrian rivers and floodplains is already storing and slowing water to protect downstream communities from flooding. As well as the reduction to flood risk that has already been delivered by working with nature, these projects leave a crucial legacy that will help Cumbria to be more resilient to future climate change impacts of increased river flows and drought.” "
        },
        {
            "text": "This global recognition comes at a crucial time. As we face the twin crises of climate change and biodiversity loss, the Cumbrian model provides a blueprint for landscape-scale nature recovery that works."
        },
        {
            "text": "Our approach of reconnecting rivers to their floodplains, removing obsolete weirs, and reintroducing natural meanders isn't just helping nature recover – it's providing natural flood management and drought resilience, improving water quality, storing carbon, and creating stronger communities.  "
        },
        {
            "text": "This recognition on the world stage validates Natural England's collaborative approach to environmental improvement. We've shown that when government agencies, charities, businesses and communities pool their expertise and resources, we can deliver the scale of change that nature needs. "
        },
        {
            "text": "While we didn't win the top prize, being among the final four globally provides powerful momentum for expanding our approach. The partnerships we've forged and techniques we've developed are already being shared across England and internationally. Our LIFE R4ever Kent project applies these lessons to protect critically endangered freshwater pearl mussels, while programmes like Cumbria Connect are taking our partnership model to even greater scale. "
        },
        {
            "text": "Perhaps most importantly, this global recognition belongs not just to the partner organisations, but to every farmer who welcomed us onto their land, every volunteer who helped with restoration work, and every community member who supported our vision. It represents validation of an approach that puts partnership at the heart of nature recovery. "
        },
        {
            "text": "The Thiess International Riverprize celebrates the world's best river restoration work, and to be among the final four puts England's nature recovery efforts firmly on the global map. More significantly, it demonstrates that our belief in collaborative, long-term partnership working can deliver transformational environmental change. "
        },
        {
            "text": "As we look to the future, this international recognition provides a platform to share our approach even more widely. Every restored river, every reconnected floodplain, every returned salmon represents progress towards a future where people and nature thrive together. That vision – and the partnerships that make it possible – matter far more than any prize. "
        },
        {
            "text": "Helen Kirkby is Deputy Director for Natural England in Cumbria. Follow our work on social media @NaturalEngland and learn more about river restoration at naturalengland.gov.uk "
        }
    ]
}