{
    "url": "https://ruralpayments.blog.gov.uk/2025/09/10/sustainable-farming-incentive-sfi-expanded-offer-for-2024-understanding-the-rotational-actions-declaration/",
    "title": "Sustainable Farming Incentive (SFI) Expanded Offer for 2024: understanding the rotational actions declaration ",
    "authors": [
        "RPA Editor"
    ],
    "categories": [
        "Sustainable Farming Incentive"
    ],
    "pub_date": "2025-09-10T14:07:54+01:00",
    "content": [
        {
            "text": "There are some actions in the SFI 2024 which are ‘rotational’. "
        },
        {
            "text": "As explained in the SFI scheme information, in the second or third year of an SFI agreement, you can: "
        },
        {
            "text": "*Some customers of the SFI re-opened offer will not be able to increase their area. If this applies to you, we will have contacted you already to confirm this.  "
        },
        {
            "text": "Rotational actions declaration "
        },
        {
            "text": "If your SFI agreement includes rotational actions, you will have told us in your application about their location and area for the first year of your agreement. "
        },
        {
            "text": "You need to complete a rotational actions declaration to tell us about the location and area of your rotational actions for the second and third years of your SFI agreement. You need to do this even if you’re not making any changes to the location or area of these actions. "
        },
        {
            "text": "Locating your rotational actions "
        },
        {
            "text": "You can move the location of a rotational action to an eligible land parcel that’s linked to your Single Business Identifier (SBI). This can be land that’s not already in your SFI agreement. "
        },
        {
            "text": "In the second and third years of your agreement, you’ll be able to do the action on: "
        },
        {
            "text": "If you have actions on Site of Special Scientific Interest (SSSI) land, you must get consent from Natural England for any changes you make to your actions on this land. You need consent in place before you do the affected actions on this land, unless the SFI action is exempt. If you do not have consent from Natural England on affected actions, your Year 2 or Year 3 payments may be delayed or reduced. You can read how to get SSSI consent in section 10.3 of the SFI expanded offer for 2024: agreement holder’s information - GOV.UK "
        },
        {
            "text": "Rotational actions in SFI 2024 agreements  You’ll need to complete a rotational actions declaration if your SFI 2024 agreement includes any of the following SFI actions: "
        },
        {
            "text": "Actions for farmland wildlife on arable and horticultural land "
        },
        {
            "text": "AHW1 - Bumblebird mix "
        },
        {
            "text": "AHW10 - Low input harvested cereal crop "
        },
        {
            "text": "AHW11 - Cultivated areas for arable plants "
        },
        {
            "text": "AHW4 - Skylark plots "
        },
        {
            "text": "AHW5 - Nesting plots for lapwing "
        },
        {
            "text": "AHW6 - Basic overwinter stubble "
        },
        {
            "text": "AHW7- Enhanced overwinter stubble "
        },
        {
            "text": "AHW8 - Wholecrop spring cereals and over winter stubble "
        },
        {
            "text": "AHW9 - Unharvested cereal headland "
        },
        {
            "text": "CAHL1 - Pollen and nectar flower mix "
        },
        {
            "text": "CAHL2 - Winter bird food on arable and horticultural land "
        },
        {
            "text": "Actions for integrated pest management "
        },
        {
            "text": "CIPM2 - Flower rich grass margins, blocks or in-field strips "
        },
        {
            "text": "CIPM3 - Companion crop on arable and horticultural land "
        },
        {
            "text": "CIPM4 - No use of insecticide on arable crops and permanent crops.  "
        },
        {
            "text": "Actions for nutrient management "
        },
        {
            "text": "CNUM2 - Legumes on improved grassland "
        },
        {
            "text": "CNUM3 - Legume fallow  "
        },
        {
            "text": "Actions for soil health "
        },
        {
            "text": "CSAM2 - Multi-species winter cover crop "
        },
        {
            "text": "CSAM3 - Herbal Lays "
        },
        {
            "text": "SOH2 - Muti-species spring-sown cover crop "
        },
        {
            "text": "SOH3 - Muti-species summer-sown cover crop "
        },
        {
            "text": "SPH4 - Winter cover following maize crops "
        },
        {
            "text": "Actions for farmland wildlife on habitats and grassland "
        },
        {
            "text": "GRH11 - Cattle grazing supplement (non-moorland) "
        },
        {
            "text": "GRH7 - Haymaking supplement "
        },
        {
            "text": "GRH8 - Haymaking supplement (late cut) "
        },
        {
            "text": "CIGL2 - Winter bird food on improved grassland  "
        },
        {
            "text": "Actions for organic farming "
        },
        {
            "text": "OFA1 - Overwinter stubble (organic land) "
        },
        {
            "text": "OFA6 - Undersown cereal crop (organic land) "
        },
        {
            "text": "OFC3 - Organic conversation - rotational land "
        },
        {
            "text": "OFC4 - Organic conversation - horticultural land "
        },
        {
            "text": "OFM4 - Organic land management - rotational land "
        },
        {
            "text": "OFM5 - Organic land management - horticultural land "
        },
        {
            "text": "Actions for precision farming "
        },
        {
            "text": "PRF1 - Variable rate application of nutrient "
        },
        {
            "text": "PRF2 - Camera or remote sensor guided herbicide spraying "
        },
        {
            "text": "PRF3 - Non-mechanical robotic weeding "
        },
        {
            "text": "PRF4 - Mechanical robotic weeding "
        },
        {
            "text": "When to complete your rotational actions declaration "
        },
        {
            "text": "You need to complete your rotational actions declaration towards the end of the first and second years of your SFI agreement. "
        },
        {
            "text": "Your rotational actions declaration will be available in the Rural Payments service once you’ve submitted your annual declaration. You can find out more information in our blog - Sustainable Farming Incentive Expanded Offer for 2024 (SFI 2024): understanding the annual declaration – Rural payments. We will remind you to submit your rotational actions declaration when it is due.  "
        },
        {
            "text": "It’s important that you complete and submit your rotational actions declaration as soon as it’s available. We can’t pay you for the relevant agreement year until you submit it. "
        },
        {
            "text": "How to complete your rotational actions declaration "
        },
        {
            "text": "After you’ve submitted your annual declaration, you need to sign in to the Rural Payments service and complete your rotational actions declaration as soon as possible. "
        },
        {
            "text": "If you want to make changes to any of your rotational actions, complete: "
        },
        {
            "text": "If you do not want to change the area or location of your rotational SFI actions, complete: "
        },
        {
            "text": "Helpful tips "
        },
        {
            "text": "If you submit your declaration and realise you made a mistake, you must contact us within 10 working days with the amendments you want us to make. "
        },
        {
            "text": "Check your details are up to date "
        },
        {
            "text": "To make sure we can deal with any queries quickly, it’s important that your personal and business details are up to date in the Rural Payments service. Sign in to the Rural Payments service to check and update them if necessary. "
        },
        {
            "text": "Where to find more information "
        },
        {
            "text": "Read more about your SFI agreement terms and conditions. It provides information about what to do if your circumstances change or if you cannot deliver your agreement. "
        },
        {
            "text": "If you have any questions, you can contact us in one for the following ways: "
        },
        {
            "text": "Please add your Single Business Identifier (SBI) and agreement number on your email. "
        },
        {
            "text": "Thank you for your ongoing commitment to the Sustainable Farming Incentive and the environmental improvements it brings. "
        }
    ]
}