{
    "url": "https://aphascience.blog.gov.uk/2023/10/20/biology-week-2023/",
    "title": "Shining a light on our brilliant biologists",
    "authors": [
        "Heather O'Sullivan"
    ],
    "categories": [
        "Careers"
    ],
    "pub_date": "2023-10-20T11:00:56+01:00",
    "content": [
        {
            "text": "From the tiniest organisms that inhabit our planet to the intricate ecosystems that sustain life, biology is all around us!"
        },
        {
            "text": "Biology Week provides a great opportunity to promote the advances being made in the biosciences. This progress is relevant to everyone, especially as we live in a time of climate and disease changes, where biological research is vital. The week also highlights the diverse range of biological careers available."
        },
        {
            "text": "For this year’s Biology Week, we are shining a spotlight on the work of some of our brilliant biologists at APHA, who carry out work in a wide range of scientific areas."
        },
        {
            "heading": 3,
            "text": "Find out more"
        },
        {
            "text": "On their website, the Royal Society of Biology is hosting a calendar of events to show what is happening during Biology Week. Why not have a look and see if there is something you can take part in."
        },
        {
            "text": "If reading this blog has inspired you to become part of the team at APHA, our jobs are advertised on Civil Service Jobs – click on ‘advanced search’ and select Animal and Plant Health Agency from the department drop-down menu."
        },
        {
            "text": "Additionally, be sure to follow our Facebook page as we regularly post about new job opportunities."
        },
        {
            "text": "You may also be interested in reading some of these blogs about other roles at the Agency:"
        },
        {
            "text": " "
        },
        {
            "text": " "
        }
    ]
}