{
    "url": "https://cddo.blog.gov.uk/2023/10/20/digital-leaders-download-with-sir-ian-diamond-the-uks-national-statistician/",
    "title": "Digital Leaders’ Download with Sir Ian Diamond, the UK's National Statistician",
    "authors": [
        "Megan Lee Devlin, Chief Executive, CDDO"
    ],
    "categories": [
        "CDDO",
        "Cross-government strategy",
        "Data",
        "Digital strategy"
    ],
    "pub_date": "2023-10-20T16:03:41+01:00",
    "content": [
        {
            "text": "As part of my Digital Leaders' Download series with Public Technology, I recently interviewed Professor Sir Ian Diamond, the UK’s National Statistician."
        },
        {
            "text": "Sir Ian was knighted in 2013 for his services to social science and higher education and is currently the principal adviser on official statistics to the UK Statistics Authority and the Government."
        },
        {
            "text": "Professor Sir Ian shares the importance of data to enable the digital agenda in government and how technology has changed the pace and delivery at the Office for National Statistics. Here's a snapshot of the interview and the link to the full article at the end of this post."
        },
        {
            "text": "Megan Lee Devlin: Ian, what does being a ‘digital leader’ mean to you?"
        },
        {
            "text": "Professor Sir Ian Diamond:  Well, I come really from the data end of things and so my first answer is that data are a central enabler for the whole digital agenda. And, as such, being a digital leader for me is about being an ambassador for data. "
        },
        {
            "text": "But too often, in my view, we spend too much time talking about data as data rather than the use cases. So being a digital leader, for me, is going much further than simply thinking about data themselves, but actually how they are going to improve the lives of all of our fellow citizens, and indeed, citizens across the world, and how we can enable that. We must as leaders be tireless in advocating and giving the reasons why this is important."
        },
        {
            "text": "Megan: It sounds like what leadership in a digital era means to you is about advocacy and understanding and unlocking the business benefit. And indeed you’ve been a brilliant advocate for the work we’re doing to drive delivery against the Transforming for a Digital Future Roadmap. What would be your tips for senior civil servants on how they can practically advocate for better use of data in their departments and teams?"
        },
        {
            "text": "Sir Ian: From a data perspective, advocacy is about ensuring you’re role modelling using data, and demonstrating your interest and awareness, for example, ensuring that every decision that is made within your department is evidence-based, and being very, very catholic about what data are. Data aren't just the numbers and surveys, but textual data, visual data, all kinds of data. Leaders need to have that understanding and the understanding of how to make sure that the evidence that is coming to them is data-informed and has methodological rigour."
        },
        {
            "text": "Megan: What excites you most about the role of digital and data in transforming government?"
        },
        {
            "text": "Sir Ian: The opportunities! I have been a statistician for a very, very long time, and the sorts of questions we can find answers to now I could only have dreamed about, even 20 years ago. Data can help us to understand the ways in which we can improve the lives of our fellow citizens, to improve the way they go about things, to improve the productivity of our economy, and to improve the entire well-being of our society. "
        },
        {
            "text": "Megan: What's your favourite new or emerging technology?"
        },
        {
            "text": "Sir Ian: Data linkage, no question. The fact that now, you can link data very smoothly, very easily, so long as of course you've got something to link it with is, to me, a marvel. "
        },
        {
            "text": "The second thing is the technology to be able to estimate statistical models much more quickly. Much of what we do is through a systems diagram, because we work in multivariate, multidimensional, multidisciplinary teams. When I used to work out how to estimate systems diagrams in the mid-1990s, it took us months to estimate one diagram, but you can do it now in an afternoon. Technology means that we really can undertake the statistics quite quickly to impact on policy and that means that we can be ever more relevant."
        },
        {
            "text": "Megan: What are your views on the power of generative AI?"
        },
        {
            "text": "Sir Ian: I think the power of generative AI to support government is unlimited. It's absolutely a fantastic opportunity. For example, in the ONS we've already developed something called StatsChat. It's brilliant and absolutely groundbreaking stuff, but I think we're only just scratching the surface of what can be done. "
        },
        {
            "text": "But at the same time, I believe there will always be a real need for top-class digital people and top-class statisticians. Top-class digital people are needed to make sure that what you are asking the computer to do is grounded in good theory, and a good understanding of what data can do, and that what comes from AI is sensible and interpretable."
        },
        {
            "text": "Generative AI has unlimited potential, but we need to make sure that the questions that are being asked can be answered in the right way."
        },
        {
            "text": "Megan: Yes, it's important that we understand the limitations of generative AI in order to be intelligent users of it."
        },
        {
            "text": "Sir Ian: It's incredibly important that all senior civil servants have that understanding and confidence to ask questions of their Director of Analysis or their Chief Data Officer who can speak to the quality of evidence created by AI."
        },
        {
            "text": "Megan: What's your department achieved in the last six to 12 months that you are especially proud of when it comes to digital and data?"
        },
        {
            "text": "Sir Ian: We will in November, for the first time, present research demonstrating how net migration can be disaggregated by the reasons for people coming so that we will be able to see the number of people who've come as students, against all other net migration."
        },
        {
            "text": "So we will be able to do that. And being able, on a really regular basis, to use digital techniques to understand the number of people in different parts of the country, in a much more reliable and a much more timely way is, I think is absolutely brilliant. "
        },
        {
            "text": "We will then over the next year or so explore the use of mobility data to be able to answer for local authorities a question they're always asking us, which is not just how many usual residents they have, but how many citizens they have to serve, shall we say, on a Wednesday at lunchtime? Those kinds of estimates, I think, are absolutely brilliant."
        },
        {
            "text": "Read the interview in full on Public Technology."
        }
    ]
}