{
    "url": "https://educationhub.blog.gov.uk/2023/10/20/how-were-protecting-schools-and-colleges-from-disruptive-strike-action/",
    "title": "How we’re protecting schools and colleges from disruptive strike action",
    "authors": [
        "mediaofficer"
    ],
    "categories": [
        "strikes"
    ],
    "pub_date": "2023-10-20T10:58:14+01:00",
    "content": [
        {
            "text": "We’re working to introduce minimum service levels in schools and colleges to protect children, young people and parents from the damaging impact of future strike action."
        },
        {
            "text": "The follows the disruption during industrial action last academic year, which resulted in over 10 days of action in schools, leading to 25 million school days that were lost cumulatively, impacting children and families across the country."
        },
        {
            "text": "Here’s what you need to know about our plans to keep disruption from industrial action to a minimum."
        },
        {
            "heading": 3,
            "text": "What are minimum service levels?"
        },
        {
            "text": "Minimum service levels (MSLs) aim to balance the ability of workers to strike with the rights of the public, who expect the essential services they pay for, like schools and colleges, to be there when they need them."
        },
        {
            "text": "This would mean protections for children, young people and parents would be put in place to ensure they get the education they need and deserve."
        },
        {
            "heading": 3,
            "text": "When will the minimum service levels be introduced in schools and colleges?"
        },
        {
            "text": "The Education Secretary has written to education union leaders, inviting them to discuss what MSLs could look like on a voluntary basis so that children’s education can be safeguarded, and put first and above any dispute."
        },
        {
            "text": "At the same time, we are also looking to introduce MSLs in universities, to limit the impact of industrial action on students."
        },
        {
            "heading": 3,
            "text": "What happens if an agreement between the unions and government isn’t reached on a voluntary basis?"
        },
        {
            "text": "If an agreement on MSLs is not reached between education unions and the government, the government will look to launch a consultation on MSLs which will ask for the views of parents, teachers, and other people who are affected."
        },
        {
            "text": "This will use powers granted through the Strikes Act to ensure education can continue during periods of strike action."
        },
        {
            "heading": 3,
            "text": "Does this mean teachers won’t be allowed to strike?"
        },
        {
            "text": "No. However, MSLs ensure there will be a number of teachers working during strike action."
        },
        {
            "text": "The introduction of MSLs will bring education in line with other key public services such as healthcare and transport, providing a better balance between the right of workers to strike, and the importance of education."
        },
        {
            "heading": 3,
            "text": "What are you doing to support teachers?"
        },
        {
            "text": "Earlier this year, schoolteachers in England accepted a fully funded 6.5% pay award, taking teacher pay to its highest level for 30 years."
        },
        {
            "text": "We’re also organising a Workload Reduction Taskforce to explore how we can go further to support school and trust leaders to minimise workload. On top of this, we’ve set an ambition to reduce teacher and leader workload by five hours per week."
        },
        {
            "text": "We’re also looking at ways to introduce flexible working for teachers, by appointing Flexible Working Ambassadors to multi-academy trusts and schools who will offer practical advice to school leaders on implementing flexible working. This is part of a wider programme, funded by the department, to help introduce flexible working in schools and trusts."
        },
        {
            "text": "We have also announced investment of £470 million across 2023-24 and 2024-25 to help colleges and other FE providers address key priorities, including tackling teacher recruitment and retention issues."
        }
    ]
}