{
    "url": "https://rpc.blog.gov.uk/2023/10/20/regulatory-policy-committee-issues-2023-corporate-report/",
    "title": "Regulatory Policy Committee issues 2023 Corporate Report",
    "authors": [
        "Stephen Gibson"
    ],
    "categories": [
        "Uncategorized"
    ],
    "pub_date": "2023-10-20T17:56:17+01:00",
    "content": [
        {
            "text": "We have today published the 2023 RPC Corporate Report which summarises our activities and performance over the year to March 2023. We reviewed 109 submissions from 23 different departments, agencies and public bodies. This is in line with previous years."
        },
        {
            "text": "There has been a concerning increase in the number of red-rated IAs that are ‘Not Fit For Purpose’, as well as an increase in IAs submitted late by departments (in some cases where the legislation was already before Parliament). We will continue to engage with departments to try to ensure that they submit high quality assessments on time and hope that the new Better Regulation Framework (BRF), which requires scrutiny at an earlier point in the policy-making process makes this less of an issue in future."
        },
        {
            "text": "Another disappointing trend has been the failure of departments to complete post-implementation reviews of their regulations despite it being a statutory requirement. Again we hope that the increased focus on evaluation in the new BRF will improve departmental performance in this area."
        },
        {
            "text": "The RPC has been working with the Better Regulation Executive on their reforms of the BRF. These were formally announced in May and launched in September. The RPC welcomes these reforms which include a number of changes that we have advocated including: earlier independent scrutiny of IAs to allow us to comment effectively on the evidence supporting different policy options; consideration of a wider range of impacts (including the impacts on households and the environment); and a greater emphasis on monitoring and evaluating regulations after they have been introduced together with a commitment for Post Implementation Reviews to be carried out more comprehensively."
        },
        {
            "text": "If you have any comments on our work and how we might be more effective in future, we would be pleased to hear them. Please either comment below or email: regulatoryenquiries@rpc.gov.uk"
        },
        {
            "text": " "
        }
    ]
}