{
    "url": "https://dwpdigital.blog.gov.uk/2023/10/20/success-at-the-techwomen100-awards/",
    "title": "Success at the TechWomen100 Awards",
    "authors": [
        "DWP Digital"
    ],
    "categories": [
        "Digital With Purpose",
        "Diversity",
        "Women in Digital",
        "Women in Technology"
    ],
    "pub_date": "2023-10-20T11:25:22+01:00",
    "content": [
        {
            "text": "We are proud to announce DWP Digital have won Company of the Year at this year’s TechWomen100 awards. "
        },
        {
            "text": "The TechWomen100 awards recognise and celebrate achievements of women, networks and companies striving to make a difference in the technology sector.  "
        },
        {
            "heading": 2,
            "text": "Company of the Year "
        },
        {
            "text": "Company of the Year is awarded to an organisation who has successfully designed and implemented initiatives and programs to develop their female talent pipeline, recognising how much we have progressed as a diverse and inclusive employer. "
        },
        {
            "text": "We strongly believe that a diverse workforce brings greater experience, innovation, and creativity through valuing our differences and working collaboratively. Our nomination was supported by statistics, almost 35% of our workforce are women compared to the tech sector in general which is at 27%. Our senior team are nearly 40% women.  "
        },
        {
            "text": "Rich Corbridge, Chief Digital and Information Officer and Gender Champion for DWP said, “DWP is committed to redressing the gender balance. We are working hard to create an inclusive workplace that is attractive to women. Digital across the UK is missing 34% of a representative workforce by not appealing to women in digital roles; only 16% of the workforce is made up of women, we need to find every lever to correct this and quickly! This means having visible role models and helping women develop a broad skillset – not just technical but also engagement, leadership, confidence and the right support in the workplace at all times are essential.  "
        },
        {
            "text": "“We are constantly striving to create a workplace that is diverse and inclusive, with equality at its heart. In doing so we will always be able to be the best we can at everything we try to achieve.” "
        },
        {
            "text": "Working in DWP Digital has many benefits that positively impact women, we pride ourselves on being family-friendly, offering flexible and agile working.  "
        },
        {
            "text": "Initiatives we highlighted in our nomination include changes to our recruitment process, including how we have set up a senior diversity task force to test new ways of hiring and promoting. We also have a colleague challenge group to critique their work, providing real accountability and transparency.  "
        },
        {
            "heading": 2,
            "text": "Celebrating our supportive networks "
        },
        {
            "text": "Our internal colleague networks ‘Women in Digital’ and ‘Women in Data’ provide a supportive environment, and we’re passionate about celebrating awareness days like International Women’s Day, providing opportunities such as speed mentoring. "
        },
        {
            "text": "This award is another example of how we are working towards gender parity, having won Employer of the Year at the Women in IT awards in February this year and our DWP Digital careers website winning Women in Tech Best Employer Careers Website award in June. The judges were impressed with the focus on female role models in tech illustrated through the website. "
        },
        {
            "text": "The award-winning Digital Marketing team write the award nominations for the organisation to promote the exceptional work done telling stories that demonstrate how we are ‘Digital with Purpose.’  "
        },
        {
            "text": "The organisation relies on a highly skilled, diverse, and inclusive workforce that represents the customers we build and maintain digital services for. Being an award-winning employer helps attract this talent into DWP Digital. "
        },
        {
            "text": "Head of External Engagement and Digital Marketing Nicola said, “We are proud to be part of an organisation that values diversity, equality, and inclusion, and actively encourages and supports women into our digital roles. Writing submissions for awards like these only comes from the continued efforts of our people to provide a diverse and inclusive environment.” "
        },
        {
            "heading": 2,
            "text": "Providing positive role models "
        },
        {
            "text": "A recent study by CW jobs found that 64% of women in tech are inspired to pursue their career by a role model. From 1300 entries, Jane Kenny, Lead Delivery, and IT service manager was successful at the TechWomen100 awards in the Individual category alongside a list of 100 outstanding women.  "
        },
        {
            "text": "As a positive role model, Jane believes we could encourage more women into tech by continuing to tell our story, and support, motivate and inspire others. Jane fell into a career in tech by accident, joining the Civil Service over 30 years ago as an admin assistant. Jane was recently interviewed for a Women in Tech case study, sharing advice and her career journey.   "
        },
        {
            "text": "Following her win, Jane was happy to share the news: "
        },
        {
            "text": "“Thank you so much to everyone that supported me. It means so much. I really am so proud of this. To all the other winners – congratulations to you too.” "
        },
        {
            "text": "The TechWomen100 awards are run by WeAreTechWomen, one of DWP Digital’s established partner organisations. "
        }
    ]
}