{
    "url": "https://mhclgmedia.blog.gov.uk/2025/11/21/speculative-reporting-of-council-tax-rises/",
    "title": "Speculative reporting of council tax rises",
    "authors": [
        "mhclgpress"
    ],
    "categories": [
        "Council finance"
    ],
    "pub_date": "2025-11-21T12:13:42+00:00",
    "content": [
        {
            "text": "There has been reporting in the media that the government will allow ‘limitless’ council tax rises – this is not true or accurate."
        },
        {
            "text": "There has been no change in the governments approach to council tax. Council tax has always been, and remains, a decision for local leaders and the government expects all councils to consider their residents when setting rates and ensure support is in place for vulnerable households."
        },
        {
            "text": "The core referendum threshold level, set by the previous government, of 3%, and a 2%, adult social care precept until 2028/29, remains. "
        },
        {
            "text": "Yesterday, the Department announced reforms to the outdated local government funding system to make the system fairer, update decades-old data used to distribute money and tackle deprivation across the country. There were no changes to council tax policy."
        },
        {
            "text": "The Local Government Finance Policy Statement, as in previous years, set out that the government will continue to consider requests from a small number of councils facing significant financial pressures for temporary, bespoke arrangements to go above the threshold – but it will not agree to any flexibility where taxpayers are already paying more than the average.  Taxpayers will remain at the heart of the government’s decision making."
        },
        {
            "text": "An MHCLG spokesperson said:"
        },
        {
            "text": "“Council tax rises are limited to 5% without a local referendum, and we have not made any decision to change that."
        },
        {
            "text": "“We made £69 billion available for council finances this year and we are fixing the outdated and unfair funding system we inherited, so funding finally matches local people’s needs and councils can deliver better public services.”"
        }
    ]
}