{
    "url": "https://space.blog.gov.uk/2025/11/21/uk-space-agency-funds-studies-to-tackle-space-debris-challenges/",
    "title": "UK Space Agency funds studies to tackle space debris challenges",
    "authors": [
        "UK Space Agency"
    ],
    "categories": [
        "Space sustainability"
    ],
    "pub_date": "2025-11-21T10:33:42+00:00",
    "content": [
        {
            "text": "The UK Space Agency has awarded more than £380,000 across 10 technical studies to support international research into space debris through the Inter-Agency Space Debris Coordination Committee (IADC)."
        },
        {
            "text": "The studies will contribute to the work of the IADC's 4 working groups covering measurements, environment and database, modelling, and mitigation. The committee brings together 13-member space agencies and 3 associate members to coordinate research into space debris challenges."
        },
        {
            "heading": 2,
            "text": "Supporting international space sustainability"
        },
        {
            "text": "The IADC, established over 30 years ago, conducts research on critical topics including innovative shielding techniques to protect spacecraft from debris and modelling the long-term evolution of the space debris environment."
        },
        {
            "text": "The committee's research has informed the development of the IADC Space Debris Mitigation Guidelines, which are widely recognised as a foundational framework that has shaped regulatory approaches to debris mitigation globally."
        },
        {
            "text": "Andrew Ratcliffe, Chief Engineer at the UK Space Agency and current Chair of the IADC, said:"
        },
        {
            "text": "Dr Mamatha Maheshwarappa, Head of Research and Development at the UK Space Agency, said:"
        },
        {
            "heading": 2,
            "text": "UK leadership in space sustainability"
        },
        {
            "text": "The UK Space Agency’s leading role within the IADC and other international forums such as the UNCOPUOS (United Nations Committee on the Peaceful Uses of Outer Space) forms part of broader space sustainability and In-orbit Servicing, Assembly and Manufacturing (ISAM) activities."
        },
        {
            "text": "These activities are led by the UK Space Agency and the Space Directorate within the Department for Science, Innovation and Technology and include regulation and standards, research, space observation and monitoring capabilities, and technology development for Active Debris Removal and ISAM."
        },
        {
            "heading": 2,
            "text": "Funded studies"
        },
        {
            "text": "The studies supported under this phase of IADC funding include:"
        },
        {
            "text": "Lot 1.1 – Analysis of data from EISCAT Beampark campaign (Digantara Research and Technologies Private Ltd)"
        },
        {
            "text": "Lot 2.1 – Assess the utility of existing metrics and develop new metrics for space environment (Two parallel studies)"
        },
        {
            "text": "Lot 2.2 – Develop software and tools to assess the environment (Two parallel studies)"
        },
        {
            "text": "Lot 2.3 – Timeliness for End of Life (EOL) proposal (Two parallel studies)"
        },
        {
            "text": "Lot 3.1 – Critical space debris threshold vulnerability (The Aerospace Corporation UK, Ltd)"
        },
        {
            "text": "Lot 4.1 – Lunar debris mitigation guidelines: further work on disposal options (Space Professionals Partnership Ltd)"
        },
        {
            "text": "Lot 4.2 – Assessment of technologies driving post-mission disposal reliability (3S Northumbria Ltd)"
        }
    ]
}