{
    "url": "https://cspl.blog.gov.uk/2024/03/21/a-new-code-of-ethics-for-policing/",
    "title": "A new Code of Ethics for Policing",
    "authors": [
        "CC Andy Marsh"
    ],
    "categories": [
        "Ethical standards",
        "Policing"
    ],
    "pub_date": "2024-03-21T15:53:41+00:00",
    "content": [
        {
            "text": "Chief Constable Andy Marsh QMP is the current Chief Executive of the National College of Policing. He recently talked to the Committee about the development of the new Code of Ethics providing ethical principles to support decision making and behaviour in policing. In this blog, he talks about the extensive work that went on to develop the guidance and supporting statutory code of practice."
        },
        {
            "text": "With the events of the past three years, it’s hard to think of a time when trust and confidence in policing has been under such scrutiny.  Lady Angiolini’s part one report is a further illustration of policing’s need to change for the better."
        },
        {
            "text": "While undoubtedly an unprecedented time in policing, it does seem that each decade brings its own tragedies and horrors."
        },
        {
            "text": "1993 – McPherson Report – Inquiry into the murder of Stephen Lawrence"
        },
        {
            "text": "2003 – The Secret Policeman – Documentary into racism at the Bruche Police Training Centre, Warrington"
        },
        {
            "text": "2014 – Plebgate – The Police Federation going head-to-head with the government Chief Whip"
        },
        {
            "text": "2023/4 – The Casey and Angiolini reports"
        },
        {
            "text": "(We could go even further back to Hillsborough, or the miners’ strikes, such as the ‘battle of Orgreave’ in 1984)."
        },
        {
            "text": "The College of Policing’s original code of ethics was produced in 2014, based on the Nolan Principles and incorporating the standards of professional behaviour."
        },
        {
            "text": "The original code had a familiar backdrop, the Leveson enquiry – police officers’ murky involvement with journalists, and the aforementioned Plebgate."
        },
        {
            "text": "While there has never been a greater need for a new Code of Ethics, initiation of work for our new ethical code pre-dates this decade’s most terrible tragedies and failings with discussions beginning in early 2020."
        },
        {
            "text": "The aims for a new code were to:"
        },
        {
            "text": "The nearly four-year project was given time and space, looking beyond policing to other sectors such as Health and Social Care, the Law, Civil Service and Accountancy.  In fact, over 50 codes of practice were reviewed from the public sectors of the UK, Australia, United States and Canada to best inform the practice review."
        },
        {
            "text": "Following this, 4899 academic studies were screened with 56 studies used in a Rapid Evidence Assessment (REA).  The REA looked at ethical decision making, whistleblowing procedures, active bystandership and more.  This work also incorporated IOPC investigations going back to 2016, and numerous HMICFRS recommendations."
        },
        {
            "text": "The above work and insight from two expert panels resulted in three separate but complementary products providing a framework for ethical behaviour:"
        },
        {
            "text": "A set of ethical policing principles to help those in policing do the right things, in the right way, for the right reasons.  These are:"
        },
        {
            "text": "Guidance on ethical and professional behaviour putting the ethical principles into practice."
        },
        {
            "text": "A Code of Practice for Ethical Policing, providing guidance to Chief Officers on how to set the organisational environment to deliver ethical policing.  Chief Constables must have due regard in discharging any functions to which it relates.  This includes:"
        },
        {
            "text": "Last year’s public consultation resulted in an unprecedented 540 pieces of individual feedback received by the College, which helped shape the final product.  The statutory code was laid before parliament on the 4 December 2023 with the remainder of the products launched to the service in January 2024 during a year of implementation."
        },
        {
            "text": "The new code of ethics will form the bedrock on which the Police Service serves the public, develops its workforce and learns from its failings."
        },
        {
            "text": " "
        },
        {
            "text": "Find out about the College of Policing Code of Ethics"
        },
        {
            "text": "Seven Principles of Public Life"
        }
    ]
}