{
    "url": "https://dfedigital.blog.gov.uk/2024/03/21/better-together-co-designing-with-local-authorities/",
    "title": "Better Together: Co-Designing with Local Authorities",
    "authors": [
        "Sarah Thew, Senior User Researcher",
        "Pablo Benvenutto, Herfordshire Local Authority",
        "Thomas Fowler, Dorset Local Authority"
    ],
    "categories": [
        "Content design",
        "culture",
        "design",
        "digital inclusion",
        "multidisciplinary teams",
        "professions",
        "research operations",
        "Service design",
        "strategy",
        "user research"
    ],
    "pub_date": "2024-03-21T14:02:11+00:00",
    "content": [
        {
            "heading": 2,
            "text": "Our family hubs digital project is complex - we knew we would need sustained involvement. "
        },
        {
            "text": "The DfE’s family hubs digital team are developing services to help families and the local authority professionals who work with them. As local authorities open family hubs, it is important that each community can access and connect to information about services."
        },
        {
            "text": "There are approximately 153 upper tier local authorities in England. Each area is different, with a unique configuration of staff, services, and residents. We needed to involve more of their perspectives to make sure we design services that are useful to a wide range of local authorities. To do this, we are working with a number of partner local authorities."
        },
        {
            "text": "We set up our co-design group with local authority family hubs staff to:"
        },
        {
            "text": "We now have a group of 15 local authority members who meet with the DfE team every month. Everyone brings different experiences and skills, from front line service delivery to digital expertise and service planning."
        },
        {
            "text": "The co-design group has been meeting for about 18 months. The meetings involve a mix of discussion and design work. They also include presentations from local authority members sharing their own projects. On occasion, guest speakers join us to share their projects and insights that interest the group."
        },
        {
            "text": " "
        },
        {
            "heading": 2,
            "text": "Learning to work together"
        },
        {
            "text": "We knew when setting up the group there would be challenges for DfE and local authority members. It's a new way of working for the team and understanding the challenges of each partner can be difficult."
        },
        {
            "text": "We hoped that regular meetings would help build trust and understanding. We also discussed how the group operates by:"
        },
        {
            "text": "We have found that ensuring everyone can contribute is hard, because we cover a wide variety of topics across strategy, service delivery, and technology. We have worked together to address this. As a result, we share agendas early and try to avoid jargon in our meetings."
        },
        {
            "text": "Local authority members have found it can be challenging to deal with the uncertainty of working with DfE in the early stages of design. It can be unclear what the outcome will be, or how widely a product will be adopted. We’re trying to address this by being as open and clear as possible when we are looking at early ideas, using different mediums and mechanisms to explain and explore concepts together."
        },
        {
            "text": "From a local authority point of view, it is useful to get early insight into government work. It helps local authorities in planning our own innovation. Working together has enabled us to improve the offer to families at a local and national level. It’s also always interesting to hear from other areas and find out what they are doing. Having the time and space to share and reflect on each other's practice has been beneficial for all of us."
        },
        {
            "heading": 2,
            "text": "The group’s impact"
        },
        {
            "text": "The co-design group has a significant impact on DfE’s family hubs work. It has complemented our user research and helped the team on ‘big picture’ thinking.  Together we have:"
        },
        {
            "text": "The group also get involved in the design details, for example:"
        },
        {
            "text": "This involvement makes our work more inclusive and transparent. The group has supported better understanding and relationships between DfE and local authority members."
        },
        {
            "text": "If you are considering setting up a co-design group, it is a long-term commitment that needs buy-in from your team. You must invest time and create an open and trustworthy space for all participants. It is important to be upfront about expectations, the scope of the group and the time commitment."
        },
        {
            "text": "Our group brings together a range of expertise and experience to develop solutions to complex problems. While that has its own challenges, it is also the strength of the group. We believe that more collaboration like this will likely lead to valuable advancements in DfE projects, in which local authorities are more invested in their development and success."
        }
    ]
}