{
    "url": "https://dragonsden.blog.gov.uk/2024/03/21/dragons-den-the-ip-blog-series-21-episode-12/",
    "title": "Dragons' Den IP Blog - Series 21 Episode 12",
    "authors": [
        "Kayleigh Enticknap"
    ],
    "categories": [
        "Copyright",
        "Designs",
        "Licensing",
        "Patents",
        "Trade marks"
    ],
    "pub_date": "2024-03-21T21:00:16+00:00",
    "content": [
        {
            "text": "We’ve reached episode 12 of series 21 of Dragons’ Den and the hunt is on to find the next money-making idea."
        },
        {
            "text": "This week, Dragons’ Den featured an automatic shower cleaner that could have you ditching traditional bathroom cleaning products, and one entrepreneur making it her mission to make beans the stars of the show and not just the side dish!"
        },
        {
            "heading": 2,
            "text": "Squeaky Clean "
        },
        {
            "text": "We all know the importance of cleaning our bathrooms, but scrubbing our showers is one of those chores many of us might leave until last."
        },
        {
            "text": "Father and Son duo, Nodar and Nik Babuadze, entered the Den with a solution to this tedious task with their automatic shower cleaner, asking for £50,000 in return for 10% of their company."
        },
        {
            "text": "Son Nik demonstrated the invention with how it prevents the build-up of limescale and mould by cleaning and disinfecting the shower. I do agree with Nik, this warm damp spot is prone to the growth of bacteria and mould. Two things I wouldn’t want to be showering with."
        },
        {
            "text": "I was pleased to hear that they have a granted UK and European patent as well as a patent pending in Canada. The pair felt their invention was the solution to dirty and stained shower screens."
        },
        {
            "text": "After doing a quick search on patent search service, Espacenet, I found that their patent was published in 2018. You can view the patent through this link"
        },
        {
            "text": "Back in the Den, Peter Jones recommended the pair look at the commercial market and contact manufacturers to licence their patent and have the cleaning device preinstalled before customers purchase them."
        },
        {
            "text": "Despite a confident pitch with IP, and a product that caught my eye, there was no deal for Nodar and Nik Babuadze today."
        },
        {
            "heading": 2,
            "text": "Bean Queen "
        },
        {
            "text": "Next in the Den was London born, Amelia Christie Miller, who was seeking £50,000 in return for a 2.5% equity stake in her business, ‘Bold Bean Co’."
        },
        {
            "text": "Amelia is on a mission to make beans the star of the show, and not just a side dish. Hoping to bag her favourite Dragon, Deborah Meaden, due to her being plant-based and standing for so many of their company values."
        },
        {
            "text": "The entrepreneur launched the brand in 2021 in a bid to improve the health of the UK food system by encouraging reduced meat consumption and making beans centre stage."
        },
        {
            "text": "Hoping to get the Dragons’ pulses racing by sampling her products, Amelia stated she was looking for their insight, experience, and expertise."
        },
        {
            "text": "Green Queen Deborah Meaden was quick to ask the entrepreneur how her beans fared against their competitors..."
        },
        {
            "text": "Amelia proudly explained her slow cook method does cost more but retains the taste and texture to make them taste differently. Together with a Bold Beans recipe book that allows people to use beans in their everyday cooking."
        },
        {
            "text": "A search on our trade mark register shows that she registered a trade mark for ‘Bold Beans Co’. You can view the trade mark through this link "
        },
        {
            "text": "Keen to add to her sustainability portfolio Deborah made Amelia an offer for all of the money for 7.5% of the business."
        },
        {
            "text": "An amazing outcome for the queen of the bean, leaving the Den with a £50,000 investment."
        },
        {
            "text": "Next in the Den we had the arrival of Guest Dragon, Emma Crede, who joined the panel for the rest of the evening."
        },
        {
            "text": "Emma is the CEO and co-founder of the denim company ‘Good American’, a founding partner of Kim Kardashian’s clothing brand ‘Skims’."
        },
        {
            "heading": 2,
            "text": "Savvy Shopping "
        },
        {
            "text": "Flinty Bane and Ben Barter pitched their business ‘Skin’, a price-comparison app seeking to change the way beauty consumers discover, shop, and share products."
        },
        {
            "text": "They asked for an investment of £50,000 for a 5% share of their business."
        },
        {
            "text": "With an impressive catalogue of over 250,000 products from more than 3000 brands, the duo earns a commission on every affiliated purchase."
        },
        {
            "text": "One unique aspect was being able to upload the products you use individually to a shelf which can also be shared with friends to see what they are using."
        },
        {
            "text": "As a busy working mum, I find it difficult to get out and spend a day hunting for bargains, so I often shop online. I have a newfound appreciation for any app that can save me money, and like most I want it to be quick and convenient."
        },
        {
            "text": "So, when I saw ‘Skin’ I immediately had the urge to download the app to see what offers I could bag for myself."
        },
        {
            "text": "Sara Davies demanded double the stake that was originally on offer, but after Flinty and Ben had quick chat to the wall, they agreed to accept Sara’s offer for all the money for 10% of their business."
        },
        {
            "text": "I’m really pleased that Flinty and Ben managed to secure a strong investment with their newest customer, and now business partner, Sara Davies."
        },
        {
            "text": "Congratulations to all of tonight’s entrepreneurs, especially those who secured an investment."
        },
        {
            "text": "Have you enjoyed exploring the IP in tonight's episode? Don’t miss out, subscribe to our Dragons' Den IPO blog to get the latest updates sent straight to your inbox! Sign up (link): Subscribe - Dragons' Den: the Intellectual Property blog"
        },
        {
            "text": " "
        },
        {
            "text": "Disclaimer:"
        },
        {
            "text": "The purpose of the IPO's Dragons' Den IP blog is to help identify the IP in entrepreneurs’ pitches and highlight how IP works, or could work, in the real-life examples featured. IPO’s authorship of this blog does not constitute its endorsement or sponsorship of any products, individuals or businesses referenced within it."
        },
        {
            "text": " "
        }
    ]
}