{
    "url": "https://defrafarming.blog.gov.uk/2024/03/21/farming-podcast-improving-animal-health-and-welfare-on-your-farm/",
    "title": "Farming Podcast: improving animal health and welfare on your farm  ",
    "authors": [
        "Martin Jenkins",
        "Graham Higgins"
    ],
    "categories": [
        "Future Farming Podcast",
        "Payments to improve animal health and welfare"
    ],
    "pub_date": "2024-03-21T17:52:06+00:00",
    "content": [
        {
            "text": "In this episode of the Farming podcast, our lead for healthier animals, Martin Jenkins, talks to dairy farmer Karen Halton. They are joined by infectious disease expert and vet James Russell.  "
        },
        {
            "text": "Karen has 500 ProCROSS cows and 260 followers on her farm in Congleton, Cheshire. She recently accessed the SFI annual health and welfare review which is part of the wide range of support offered through the Animal Health and Welfare Pathway.  "
        },
        {
            "text": "James is a vet who worked for 16 years in rural practice in Staffordshire and Derbyshire. He’s a champion of infectious disease control. "
        },
        {
            "text": "James also served as president of the British Veterinary Association and sits on the Animal Health and Welfare Board for England. He now teaches at the University of Nottingham."
        },
        {
            "text": "In the podcast, Karen shares how she found the process of applying for the review. Together, Karen and James set out what farmers can expect during the vet visit and its benefits.  "
        },
        {
            "text": "James explains: \"The farmer and the vet know best what it is that they need to talk about and how best they need to set some priorities for the farm for the year that is ahead of them.\"   "
        },
        {
            "text": "Karen adds: “I couldn't believe how easy that process was. It probably took about 5 minutes. The vets had done their report, they put their report in and literally that money went into my bank account...For me, it’s been brilliant, and who wouldn’t want to do it? Health is wealth...If your animals are healthy, so is your bank account.”  "
        },
        {
            "text": "Thanks to Karen and James for their generosity in being guests on our podcast. "
        },
        {
            "heading": 2,
            "text": "Learn more"
        },
        {
            "text": "To be eligible to apply for an SFI annual health and welfare review, you must have one of the following:"
        },
        {
            "text": "You’ll be paid:"
        },
        {
            "text": "Read the official guidance on GOV.UK and apply today. "
        }
    ]
}