{
    "url": "https://teaching.blog.gov.uk/2024/03/21/how-schools-are-using-data-to-improve-school-attendance/",
    "title": "How schools are using data to improve school attendance",
    "authors": [
        "Kate, headteacher",
        "Sam, executive leader"
    ],
    "categories": [
        "Attendance"
    ],
    "pub_date": "2024-03-21T09:30:59+00:00",
    "content": [
        {
            "text": "The Monitor Your School Attendance (MYSA) Service is a free, secure tool that helps schools to monitor pupil attendance. Schools, their local authority and trust can use the service."
        },
        {
            "text": "In this blog, we hear from attendance leads from a school and a trust explain how they are using the service to improve strategies to attendance and have more meaningful conversations with families, head teachers and local authorities."
        },
        {
            "heading": 3,
            "text": "Sam, a multi academy trust executive leader shares how they use MYSA data to improve school policy"
        },
        {
            "text": "I’m Sam, an executive leader of a trust with 10 urban primary schools, some in areas of high deprivation. I've been using the MYSA service to track and compare attendance my schools. I've found that the data we can get helps to engage the head teachers to have meaningful conversations."
        },
        {
            "text": "Our approach"
        },
        {
            "text": "I use the MYSA service to analyse attendance across the trust and the impact of programmes, to find out what's working."
        },
        {
            "text": "Across our schools, we have ongoing attendance issues with younger year groups. As we work with individual schools to tackle these issues and put help in place, I keep an eye on the data to monitor the impact."
        },
        {
            "text": "How we use the service in practise"
        },
        {
            "text": "Being able to access and compare data from several schools is easy with this system. It’s all in one place so we can identify issues that might not be obvious to the school within their single view of data."
        },
        {
            "text": "The school comparison tool is also really valuable to us because it gives us. For example, when the trust has only one school in a local authority area, I find it helpful to see if attendance is an issue for the area or just the school. Having this information to hand helps us have conversations with head teachers. That’s the biggest draw for us. We can get quite a bit of demographic data from our MIS but not meaningful comparator data."
        },
        {
            "text": "The service also has a couple of useful features that aren’t available in our MIS. I can quickly and easily find key pieces of information and I haven’t got to cut it or change it."
        },
        {
            "heading": 3,
            "text": "Kate, a primary school headteacher tells us how they are using MYSA data to tackle persistent absence"
        },
        {
            "text": "I’m Kate, headteacher of a large, urban primary school with a high proportion of pupil premium children. We’ve had challenges with effectively monitoring pupil attendance in the past, so we’re putting a significant focus on this now."
        },
        {
            "text": "Our approach"
        },
        {
            "text": "I've worked at the school for 10 years and have good relationships with families. Our attendance strategy is a combination of working with individuals and their families, and data. To analyse daily attendance, I use MYSA data, our MIS and some manual tasks."
        },
        {
            "text": "Tackling persistent absence is high on the agenda for our school. We are completing daily lists of absent pupils and looking at their reason for not attending school. I use this information alongside data to identify any emerging patterns or pupils who are at risk of becoming persistently absent."
        },
        {
            "text": "We know we can’t solve every attendance issue on our own, so put the context we have alongside DfE data to help us have strategic conversations with the local authority, senior leadership and our partners."
        },
        {
            "text": "How I use the service in practise"
        },
        {
            "text": "Our MIS is quite limited and complicated to use. To get meaningful information, we have to count rows of data, which can take up a lot of time. Now we’re using MYSA service, we can get the information we need quickly and easily. This saves time and helps us prepare for meetings with families, partners and the local authority."
        },
        {
            "text": "What's even better is that the local authority also has access to the same data, so we know we’re all looking at the same information. This has really improved our conversations with them."
        },
        {
            "text": "Further reading"
        },
        {
            "text": "Share your daily school attendance data"
        },
        {
            "text": "Access your attendance data"
        }
    ]
}