{
    "url": "https://valuationoffice.blog.gov.uk/2024/03/21/how-we-value-new-properties-for-council-tax/",
    "title": "How we value new properties for Council Tax",
    "authors": [
        "Diane Thomson - CT and Rent Officer Functions Unit Head"
    ],
    "categories": [
        "Council Tax"
    ],
    "pub_date": "2024-03-21T13:45:24+00:00",
    "content": [
        {
            "text": "The Valuation Office Agency (VOA) is responsible for setting your Council Tax band."
        },
        {
            "text": "Your Council Tax band is based on the price your property could have been sold for on a fixed date. This date is called the antecedent valuation date (AVD)."
        },
        {
            "text": "The AVD is set in law, and it’s different in England and Wales."
        },
        {
            "text": "So you might be wondering, how could we know what the right Council Tax should be for a home that didn’t exist on this date?"
        },
        {
            "text": "In this blog, we explain how we value properties built after the AVD."
        },
        {
            "text": "Sales evidence"
        },
        {
            "text": "When we band a property for Council Tax, our starting point is to look for sales of the property that took place on or around the AVD."
        },
        {
            "text": "But with properties built after 1991 in England or 2003 in Wales, there will be no sales evidence available, so we need to look for data on properties that we can use for comparison. There are different ways we can do this."
        },
        {
            "text": "First, we look for sales of similar properties that were new around the time of the AVD. This is the most reliable form of evidence as it gives the closest estimate of the price a property could have sold for if it had been built by the AVD."
        },
        {
            "text": "If this is not available, we then look at sales of properties of a similar size in the same area. We consider any differences between the properties when looking at comparable sales."
        },
        {
            "text": "Some areas have changed a lot since the Council Tax valuation date. For example, what is now a residential area or a new housing estate may well have been a brownfield or industrial site around the time of the AVD."
        },
        {
            "text": "If an area was significantly different around the time of the AVD, we consider the closest similar residential area."
        },
        {
            "text": "Banding and settlement evidence"
        },
        {
            "text": "If we cannot find sales evidence, we then consider what’s known as banding and settlement evidence."
        },
        {
            "text": "This involves looking at the Council Tax bands already allocated to similar properties, paying most attention to bands that have been challenged or confirmed at a Valuation Tribunal hearing."
        },
        {
            "text": "There’s an ever-increasing number of post-AVD properties, many of which have similar attributes. So we have that comparable data to use to make sure we take a consistent approach"
        },
        {
            "text": "Local area changes"
        },
        {
            "text": "Once we’ve collected all the available evidence, we look at any changes to the local area between the AVD and the date the property was built."
        },
        {
            "text": "Physical changes, such as new roads or better transport links, can affect the value of properties in an area."
        },
        {
            "text": "Once we have settled on a suitable band for the property, we add it to the Council Tax list and notify the local council who are responsible for billing and collection of Council Tax."
        },
        {
            "text": "Read more about how we value properties for Council Tax, including more information about banding and settlement evidence."
        }
    ]
}