{
    "url": "https://defraenvironment.blog.gov.uk/2024/03/21/in-conversation-with-westerfield-station-adopters-2023-bees-needs-champion/",
    "title": "In conversation with Westerfield Station Adopters, 2023 Bees Needs Champion",
    "authors": [
        "Sarah Galley"
    ],
    "categories": [
        "Bee's Needs",
        "Community",
        "Gardening",
        "Nature",
        "plants",
        "Pollinators"
    ],
    "pub_date": "2024-03-21T08:58:34+00:00",
    "content": [
        {
            "text": "Pollinators, including bees, are essential to our environment. They play a crucial role in food production by pollinating crops. They also support wild plants, which other species rely on to survive.  "
        },
        {
            "text": "My name is Sarah. I’m a policy advisor in the Biodiversity Targets Delivery team in Defra.  "
        },
        {
            "text": "Part of our work includes looking after pollinator policy. We want to raise awareness of the importance of pollinators and help gardeners and land managers understand what they need to thrive.  "
        },
        {
            "text": "Our annual Bees’ Needs Champions awards is one way in which we are doing this. "
        },
        {
            "text": "Bees’ Needs Champions awards "
        },
        {
            "text": "Every year we celebrate people and organisations who have taken inspiring action to benefit pollinators through our Bees Needs Champion awards. "
        },
        {
            "text": "For example:  "
        },
        {
            "text": "The final deadline for applying for a Bees Needs Champion award this year is 12 May. "
        },
        {
            "text": "Catching up with Westerfield Station Adopters "
        },
        {
            "text": "I sat down with 2023 Bees Needs Champion award winner, Westerfield Station Adopters, to find out more about their work. "
        },
        {
            "text": "Westerfield Station Adopters are a group of 4 volunteers who have developed a large wildlife-friendly garden at Westerfield station. Working with Greater Anglia’s ‘adopt a station’ scheme, the team have transformed 228 square meters of unused strip of land into a wildlife haven.  "
        },
        {
            "text": "What activities has your organisation delivered to support bees’ needs?  "
        },
        {
            "text": "We’ve created a floral corridor alongside a railway platform. This provides a visual and memorable experience for all who visit the station, whilst also providing a wildlife haven.  "
        },
        {
            "text": "Three gardens have been planted in stages, as adopters increased from one to four. Each garden is planted with ornamental grasses interspersed with large blocks of flowering plants to help attract pollinators and reduce the energy demands flying between food sources. Catmint is a magnet for bees and lamb’s ear is often frequented by wool carder bees, which collect the hairs from the leaves as nesting material.  "
        },
        {
            "text": "We have left areas of bare ground. Dead wood provides nesting sites for solitary bees, and we have built bumblebee nests inspired by the Bumblebee Conservation Trust. In addition, seed heads and hollow stems are left over winter, and water is provided by a shallow dish and pebbles.  "
        },
        {
            "text": "How is your organisation engaging with local communities to support bees’ needs?  "
        },
        {
            "text": "We installed interpretation boards to help visitors identify the bees and butterflies they spot in the garden. This was done in partnership with the Suffolk Butterfly Conservation Trust, Friends of the Earth, Westerfield Parish Council, Greater Anglia, the East Suffolk Lines Community Rail Partnership and Community Rail Network. "
        },
        {
            "text": "In summer 2022, we held a ‘buzzing bee’ fete to raise awareness of Bees’ Needs Week and raise money for the Bees for Development Trust. Along with the usual fete stalls, we had environmental stands from the Friends of the Earth, East Suffolk Greenprint Forum and a local beekeeper with an observational hive.  "
        },
        {
            "text": "To raise awareness of the importance of protecting and conserving nature, we invited local schools to enter a writing competition: ‘A Day in the life of a Westerfield Station Bee’. The winning essay shared experiences of a bee watching the trains go by, as it visited the station’s expansive wildlife and bee friendly garden.  "
        },
        {
            "text": "Sponsorship from the local Railway Inn allowed the first Westerfield Cub Scouts to plant herbs in a hexagonal planter as part of their Gardener activity and Community impact badges. The herb flowers provide a nectar source, and passersby can take a sprig. "
        },
        {
            "text": "Similarly, two local children who were being home-schooled came to plant peas they had grown at home in our raised bed. They netted the area to protect from pigeons and applied mulch to plants in the borders. This allowed them to obtain their RHS level 5 certificate.  "
        },
        {
            "text": "As part of the Great Garden Rail Trail, 51 paying guests stopped off at Westerfield station gardens on route to Lowestoft, where the adopters explained the work they do to nurture the garden for wildlife. The event raised £250.00 for the local St Elizabeth Hospice. "
        },
        {
            "text": "What is your advice to someone who wants to learn more about pollinators and bees’ needs?  "
        },
        {
            "text": "What would you say to someone considering applying for a Bees’ Needs Champions award?  "
        },
        {
            "text": "Do it! Celebrate all the amazing things you’ve done to enhance pollinators. "
        },
        {
            "text": "How you can get involved "
        },
        {
            "text": "If you’re feeling inspired and would like to nominate yourself or someone else for a Bees Needs Champion award, apply for an award by 12 May 2024. "
        },
        {
            "text": "There is more detail about pollinators and how to help them in the National Pollinator Strategy and Pollinator Action Plan 2021-2024. "
        },
        {
            "text": "To receive an email notification when we publish new blog posts, please subscribe to the Environment blog. "
        }
    ]
}