{
    "url": "https://environmentagency.blog.gov.uk/2024/03/21/meeting-our-water-needs-for-the-next-25-years/",
    "title": "Meeting our Water Needs for the Next 25 Years",
    "authors": [
        "Environment Agency"
    ],
    "categories": [
        "Climate change",
        "Environment Agency",
        "Sustainability",
        "Water"
    ],
    "pub_date": "2024-03-21T09:06:42+00:00",
    "content": [
        {
            "text": "When we make a cup of tea, coffee, or get a cold drink from the tap, we sometimes take for granted the huge journey that the water has been on. We may not be aware of the amount of work and planning that has gone into ensuring its quality and availability. We turn on the tap, and there it is.   "
        },
        {
            "text": "But with climate change and population growth, the demand for water is ever increasing. Many areas of England are already experiencing water shortages. In parts of Sussex, Cambridgeshire, Suffolk, and Norfolk, additional demands on water supply from businesses, and new housing developments, are putting huge pressure on water resources.   "
        },
        {
            "text": "Our current water provision is not enough to see us into the future. We will need alternative options, and we are working with others to implement them. At the Environment Agency we work closely with water companies and organisations to help them manage their water supplies to enable businesses, the environment, the economy, and the population to thrive.  "
        },
        {
            "text": "Reviewing water companies Water Resource Management Plans (WRMPs) is one of the most important ways we are ensuring there is enough water to meet future demands. These plans set out how water companies will govern our water security and protection of the environment for the next 25 years. They include a range of schemes that are key to ensuring sufficient supply of water both now and in the future.  "
        },
        {
            "text": "How much extra water will we need? "
        },
        {
            "text": "By 2050, in order to support a growing population, the economy, food production and protect the environment, we are going to need a lot more water. Almost 5 billion litres a day, in fact*. That’s over two million wheelie bins full of water every day, on top of the water we already use.  "
        },
        {
            "text": "This daunting challenge can only be met by combining a number of different approaches. We need to use the water we have now as efficiently as possible while enabling new technology to help us to capture, store and utilise more water. As our climate changes and we experience more extreme weather, we will need to invest so our future water supplies become independent of rainfall. This won’t be overnight, but it is a future we will need to work towards. We are tackling this challenge head-on.  "
        },
        {
            "text": "Saving water "
        },
        {
            "text": "In the immediate future, our focus is on saving water. There are huge opportunities to use water more efficiently and stop the millions of litres of water being lost per day in our homes and businesses through leaking pipes, toilets, taps and urinals. Water companies are already running campaigns focused on ways we can save water, but this alone isn’t enough. We all need to do our bit by taking responsibility and tackling water wastage. Water companies need to repair infrastructure, install smart meters and engage with their customers, to help them save water too. This will mean that less water will be taken from the environment, less water and wastewater needs to be pumped and treated, and fewer new supplies will be needed.  "
        },
        {
            "text": "Alternative ways of generating water "
        },
        {
            "text": "Water companies are now able to choose from a greater range of options including traditional and newer methods. Our current supply of water comes from rivers, reservoirs, lakes, and underground systems that store and transport water. Reservoirs and water transfers will continue to play a significant role in water supply. We will need new water transfer and storage infrastructure and there are several new proposals in the pipeline. But in a changing climate and with an increased population these will need to work in tandem with options that are less reliant on rainfall.    "
        },
        {
            "text": "Desalination and water recycling as water supply options   "
        },
        {
            "text": "Desalination is the treatment of brackish (slightly salty) or seawater to remove dissolved salts and other organic chemicals. This provides a source of fresh water, that after treatment, is suitable for drinking. Water recycling is another method used around the world. This involves taking water from wastewater, cleaning and treating it to the highest standards. Water recycling can supply water back indirectly or directly, so homes and businesses can have a safe and reliable source of water.  "
        },
        {
            "text": "What’s the benefit of using these additional schemes?  "
        },
        {
            "text": "Desalination and Recycling both contribute to a secure supply of water into the future, and they can provide additional water in areas where demand exceeds supply.  During drought they can relieve pressure on existing supplies and provide an additional option to developments such as reservoirs.  "
        },
        {
            "text": "Water Resources Management Plans "
        },
        {
            "text": "By law, water companies must produce a Water Resources Management Plan (WRMP) every five years. Water companies are nearing the end of the latest round. "
        },
        {
            "text": "As a statutory consultee for WRMPs from all water companies, the Environment Agency has a key role in reviewing all draft WRMPs and providing feedback to the companies. The latest WRMPs produced by water companies are extremely important for society and once finalised, their effective delivery will be critical to ensuring sustainable growth, resilient supplies and protecting the environment.    "
        },
        {
            "text": "Our latest summary report of the water companies’ Water Resources Management Plans includes significant ambitions to reduce water demand and leakage and shows that collectively the plans would meet the statutory Water Demand target if successful. "
        },
        {
            "text": "Key factors are: "
        },
        {
            "text": "  You can read the full summary report here: https://www.gov.uk/government/publications/a-review-of-englands-draft-regional-and-water-resources-management-plans. "
        },
        {
            "text": "*Please note, this deficit has risen in the revised draft plans due to updated demand forecasts, additional reductions associated with protecting and improving the environment, and better representation of the baseline supply position without drought measures included.   "
        },
        {
            "text": " "
        }
    ]
}