{
    "url": "https://ruralpayments.blog.gov.uk/2024/03/21/my-experience-as-an-rpa-ambassador-2/",
    "title": "My experience as an RPA Ambassador",
    "authors": [
        "RPA Editor"
    ],
    "categories": [
        "External engagement"
    ],
    "pub_date": "2024-03-21T14:30:27+00:00",
    "content": [
        {
            "text": "Last summer we launched our RPA Ambassador programme, aimed at getting our people out and about engaging with external audiences. As we explain in our 5 year strategy, we’re keen to grow our presence in rural communities to ensure the interests of farmers are understood. This is so that we can help them through agricultural transition, demonstrating that we will listen, learn and do better."
        },
        {
            "text": "The Ambassadors represent RPA by engaging with a wide variety of external audiences including farmers, and stakeholders, and the Ambassadors get the chance to gain an increased appreciation of the farming industry. The Ambassadors help support RPA by developing links to the communities we serve, and demonstrating our commitment to our customers through the authentic interactions we have with them. "
        },
        {
            "text": "In this blog, Rakhee Sharma, who works on Countryside Stewardship applications talks about her experience as an RPA Ambassador attending the National Farm Management Conference."
        },
        {
            "text": "Hello, I’m Rakhee, an RPA Ambassador and I had the privilege to represent RPA in the annual National Farm Management Conference, organised by The Institute of Agricultural Management (IAgrM)."
        },
        {
            "text": "The conference debated how agriculture should embrace disruption, with the intriguing theme: ‘What is the farm for? Technology v Tradition: The Future of Agricultural & Environmental Management'."
        },
        {
            "text": "Key topics discussed included climate change and biodiversity and regenerative farming: transforming agriculture and supply chains."
        },
        {
            "text": "At the conference I engaged in very meaningful conversations with farmers and stakeholders and representatives of different organisations who are working closely for community-wide “Journey to NET ZERO” targets."
        },
        {
            "text": "As an RPA ambassador I shared our ongoing effort to build a robust relationship with our farming community and emphasised our role in helping them by listening, learning, and improving our services to build trust with them. I shared some of thrpae key steps we have taken to achieve this vision which are:"
        },
        {
            "text": "I also had a great conversation with a farmer from Ipsden (between Reading and Wallingford) who offered to open her farm up for organised visits for RPA Ambassadors. The role of an Ambassador is very important as we’re at the forefront of the organisation, creating a bridge between our dedicated farming community and RPA. Building a strong bond with farmers helps us to improve our processes and services resulting in a robust system to achieve optimum environmental benefits."
        },
        {
            "text": "Our presence was really appreciated by the members of IAgrM and various farmers and delegates. It was an insightful event that I really enjoyed attending and I look forward to attending more events as an RPA Ambassador."
        }
    ]
}