{
    "url": "https://openpolicy.blog.gov.uk/2024/03/21/reflecting-on-10-years-of-design-innovation-and-people-centred-approaches-in-policy/",
    "title": "Reflecting on 10 years of design, innovation and people-centred approaches in policy",
    "authors": [
        "policylab"
    ],
    "categories": [
        "Policy Lab"
    ],
    "pub_date": "2024-03-21T13:02:07+01:00",
    "content": [
        {
            "text": "Policy Lab is turning 10! In this special anniversary blog we reflect on: 10 years of dedicated work to bring the best of innovation, experimentation, and alternative methods to policymaking; 10 years of listening to, learning from and collaborating with thousands of members of the public to bring their voices and experiences into policy development; and, 10 years of running a multidisciplinary, cost-recovery unit at the heart of government. "
        },
        {
            "heading": 2,
            "text": "Our journey "
        },
        {
            "text": "In the decade since 2014, our team has matured from a passionate start-up into an established force in innovative policymaking. We have trained thousands of policy professionals in multidisciplinary approaches. We have run more than 250 innovation projects in some of the UK’s most challenging and high-profile areas of policy. We have worked in almost every government department in the UK and beyond, for organisations such as universities and local authorities, and for international bodies including the United Nations. We have also engaged with many thousands of people outside government to understand how policies affect their daily lives.  "
        },
        {
            "text": "Back in 2014, when Policy Lab was established, we were a pioneering team of just three people. Early work focused on building new skills such as data and design with policy professionals and running training alongside policy innovation projects. Our hand-drawn logo from that time - still used today - captures the practical, creative and can-do spirit on which the Lab was founded. "
        },
        {
            "text": "Today, Policy Lab is multi-award winning with an international following, and our mission is ‘to radically improving policymaking through design, innovation and people-centred approaches’. Our team comprises around thirty experts with experience in ethnography, technology, research, design, systems thinking, art, science, futures and - of course - policymaking.  "
        },
        {
            "heading": 2,
            "text": "Bringing design, innovation and people-centred approaches to policy professionals "
        },
        {
            "text": "Policy Lab has been at the forefront of identifying and testing the tools and methods that hold most potential for improving policymaking. We have introduced new approaches to the Civil Service, which are now part of the policy mainstream, and developed bespoke capabilities for specific groups.  "
        },
        {
            "text": "In 2017 we hired the UK government’s first ever policy designer. User-centred design, service design and systems thinking are now part of the latest Policy Profession Standards. Our novel work to develop film ethnography in government, initiated in 2015, has been used on around 30 policy issues in 10 departments including No.10, Home Office, Department for Work and Pensions, Department for Education, Department for Health and Social Care and Department for Transport. We have also established highly-innovative methods for specific applications, such as our Collective Intelligence work which engages large audiences in policy debates using machine learning.  "
        },
        {
            "text": "Importantly, we are now part of a community. There are dozens of department-specific policy labs - where ten years ago we were the only one in the UK central government – and there are 500+ people from 75 UK public sector organisations in the policy design community. There are also many government innovation labs around the world.  "
        },
        {
            "heading": 2,
            "text": "Our commissioners and projects "
        },
        {
            "text": "None of our work would have been possible without the hundreds of individuals across government who have chosen to partner with Policy Lab. Thanks to our commissioners, we have been able to bring empathic and novel approaches to more than 250 policy areas. These include: "
        },
        {
            "text": "You can read more of our current case studies and our offer to policy professionals in our latest prospectus document.   "
        },
        {
            "heading": 2,
            "text": "Our new programmatic work and close partners "
        },
        {
            "text": "More recently we have launched new types of programmes based on our assessments of how to build future resilience and new skills for policy professionals. In 2022, we developed 11 Experimental Methods for Policymaking, designed to support people to reach for the next generation of innovation approaches – six of the methods have now been used in live policy development. Our MANIFEST programme, launched in 2022, evaluates the potential role for artistic approaches in policymaking – to date, we have placed eight artists in policy teams. In 2023, we published People-Centred Policy Design, a free-to-access, five-week course enabling participants to explore a range of participatory and innovation methods. This year we also soft-launched RegBox, a toolkit using serious games, which enables policy professionals to convene stakeholders and work together to make decisions affecting regulation. "
        },
        {
            "text": "These initiatives would not be possible without our partners across government and beyond. Many of the programmes above have been directly enabled by the Policy Profession Unit, who we collaborate with to test and mainstream new approaches across the 33,000 members of the profession. Our partners also enable us to amplify innovation in new areas; in 2023, we launched the National Security Policy & Research CoLab, a three-year partnership with the Chief Scientific Advisor for National Security.  "
        },
        {
            "heading": 2,
            "text": "A multidisciplinary team in the heart of government "
        },
        {
            "text": "From the outset Policy Lab has had a culture of openness and worked on the principle that mixed teams do better work. Hundreds of people have now been part of the effort to develop, sustain and grow the Lab. From long-term employees to colleagues on loan, academics, care leavers, and those on specialist placements. The commitment, passion and plurality of thought of our diverse team – right from its founding members to the Lab of today – has enabled us to do a better job for the public.  "
        },
        {
            "text": "In the coming months we will be celebrating our 10th Anniversary in various ways. Look out for dedicated content on our blog and social media. As ever, if you want to learn more about our work, our placement opportunities or how you can partner with us, please just get in touch: team@policylab.gov.uk "
        }
    ]
}