{
    "url": "https://rpc.blog.gov.uk/2024/03/21/regulatory-policy-committee-welcomes-two-new-members/",
    "title": "Regulatory Policy Committee welcomes two new members",
    "authors": [
        "Stephen Gibson"
    ],
    "categories": [
        "Better regulation",
        "Evaluation",
        "Independent scrutiny"
    ],
    "pub_date": "2024-03-21T13:34:14+00:00",
    "content": [
        {
            "text": "The RPC committee and secretariat are very pleased to welcome two new committee members who joined the RPC on 18 March 2024."
        },
        {
            "text": "Stephen Gibson, RPC Chair said: “Caroline and Ryan bring a wealth of highly relevant experience to the RPC committee. This is an exciting time for the RPC with the changes to our role arising from the introduction of the new Better Regulation Framework. I look forward to working with the new and existing members as the committee implements the changes required from the framework review and to continue the RPC’s important independent scrutiny role to improve the quality of evidence and analysis underpinning regulatory decisions.”"
        },
        {
            "text": " "
        },
        {
            "text": "Our new members are:"
        },
        {
            "text": "Professor Caroline Elliott"
        },
        {
            "text": "Caroline is a Professor in the Economics Department at the University of Warwick. She has previously worked at the universities of Aston, Huddersfield, Lancaster and Manchester."
        },
        {
            "text": "Her research spans applied industrial economics with published research looking at firms' advertising, quality signalling and pricing decisions, and firms' responses to regulation and competition policy investigations. She has also published in the fields of applied education economics and pedagogy."
        },
        {
            "text": " "
        },
        {
            "text": "Dr Ryan Williams"
        },
        {
            "text": "Ryan Williams is the Chief Economist at Enoda, an electricity grid technology company based in Edinburgh. He was previously a Director at Grant Thornton UK, specialising in energy economics. Ryan was also a Principal at Oxera, where he managed regulatory initiatives across industries like electricity, gas, telecoms, water, and transport."
        },
        {
            "text": "As an academic, Ryan lectures in finance at Université Paris Dauphine, and was previously a tenured professor at the University of Arizona in the United States."
        }
    ]
}