{
    "url": "https://cyberandspecialistoperationscommand.blog.gov.uk/2024/03/21/rg-and-gfa-training/",
    "title": "Royal Gibraltar Regiment and Gibraltar Football Association U19's leadership training",
    "authors": [
        "abievans"
    ],
    "categories": [
        "Gibraltar",
        "Health and Wellbeing",
        "Overseas Bases",
        "Training"
    ],
    "pub_date": "2024-03-21T15:07:54+00:00",
    "content": [
        {
            "text": "Over the last few weeks, the Royal Gibraltar Regiment (RG) and Gibraltar Football Association’s (GFA) U19’s Women’s Squad have been collaborating in a series of leadership and training sessions in preparation for the team’s upcoming European U19 qualifiers in April."
        },
        {
            "text": "Nineteen players are participating in six sessions where they take part in Introduction sessions, Army Leadership Training, Individual Physical Training (PT), Team sessions, Task sessions and Group PT."
        },
        {
            "text": "GFA’s Women’s Football Development Manager, Scott Wiseman, contacted the RG at the beginning of the year as he believes the leadership training that the soldiers are providing the players with is vital to enhance their game and will help the team work together ahead of their European qualifiers next month."
        },
        {
            "text": "Wiseman said: “Leadership training empowers athletes to make strategic decisions under pressure, enabling them to adapt to changing game situations and exploit opponents' weaknesses effectively."
        },
        {
            "text": "Well-prepared leaders are more likely to maintain a cool head and make wise choices that maximise their team's chances of success.”"
        },
        {
            "text": "The first session, which began on Tuesday 12 March, saw the team receive an introductory brief from members of the RG, before taking part in a strength training session, performing sprints on the football pitch, and running laps around Devil’s Tower Camp (DTC)."
        },
        {
            "text": "The remaining sessions are being held between DTC, Buffadero Training Camp and HM Naval Base."
        },
        {
            "text": "Players continue to participate in team sessions, performed task sessions, and physical training whilst been closely monitored by the RG’s B Company and HQBF’s Joint Physical Development Unit."
        },
        {
            "text": "Royal Gibraltar Regiment’s Quartermaster Sergeant Instructor, Warrant Officer Class 2 Darren Hunt, said: “The players took the training seriously and were fully engaged in both the briefing and physical aspect of the session."
        },
        {
            "text": "The skills that they will take away from these sessions will help improve their games and enable them to work together as a team."
        },
        {
            "text": "We wish the players the best of luck with their upcoming qualifiers and hope they put into practice what they have learned in these sessions.”"
        }
    ]
}