{
    "url": "https://ukhsa.blog.gov.uk/2024/03/21/what-is-lyme-disease-and-why-do-we-need-to-be-tick-aware/",
    "title": "What is Lyme disease and why do we need to be tick-aware?",
    "authors": [
        "Blog Editor"
    ],
    "categories": [
        "Health Protection"
    ],
    "pub_date": "2024-03-21T14:04:21+01:00",
    "content": [
        {
            "text": "Ticks in England can carry infections, including Lyme disease and — very rarely — tick-borne encephalitis (TBE)."
        },
        {
            "text": "Ticks can be active all year round, but they are most active in the months April to July, and sometimes later in the autumn. Activity continues over the winter months but at a significantly reduced level. So, we are reminding people to be ‘tick aware’ as they enjoy the great outdoors at any time of the year."
        },
        {
            "text": "To help you stay safe, we've compiled a guide to protecting yourself from tick-borne infections. In this blog post, you'll learn how to avoid tick bites, how to recognise the signs and symptoms of Lyme disease and TBE, and when to seek medical assistance."
        },
        {
            "heading": 2,
            "text": "Where are ticks found?"
        },
        {
            "text": "Ticks live in many different outdoor environments but they are particularly common in grassy and wooded areas. You are therefore more at risk of being bitten if you take part in activities such as hiking, cycling or camping. You might also be exposed to ticks while on a walk in some urban parks and gardens."
        },
        {
            "heading": 2,
            "text": "How to avoid tick-borne infections"
        },
        {
            "text": "While walking in green spaces, stick to clearly defined paths and try to avoid brushing against vegetation where ticks might be present. Also consider wearing clothing that covers your skin to make it more difficult for ticks to access a suitable place to bite."
        },
        {
            "text": "Use insect repellent (for example DEET) and regularly check clothing or exposed skin so that you can spot any crawling ticks and brush them off."
        },
        {
            "text": "After spending time outside, it’s very important to check yourself, your clothing, your pets and others for ticks. Remove any attached tick as soon as you find it using a tick-removal tool or fine-tipped tweezers. Fine-tipped tweezers are different from regular tweezers that might be used to remove eyebrow hair. They are very narrow and pointed at the tip and ensure that ticks are not squashed during removal."
        },
        {
            "heading": 2,
            "text": "What is Lyme disease?"
        },
        {
            "text": "Lyme disease is an infection that can be transmitted by ticks found in the UK, though it should be remembered that not all ticks carry the bacteria which causes Lyme disease and not all bites from an infected tick will result in human infection. The disease can be acquired when someone is bitten by an infected tick, usually outdoors in green spaces where ticks might be present. Lyme disease should not deter you from enjoying the outdoors because you can reduce your chance of infection by following the precautions above."
        },
        {
            "heading": 2,
            "text": "What are the symptoms of Lyme disease?"
        },
        {
            "text": "One of the most common symptoms is a spreading, ‘bullseye’ rash at the site of the tick bite which typically develops 3 to 30 days after being bitten. This rash does not occur in all cases. Other symptoms include mild flu-like symptoms such as fever, headache and fatigue, a facial droop, nerve pains and numbness or tingling in the hands or feet."
        },
        {
            "heading": 2,
            "text": "Where can you catch it?"
        },
        {
            "text": "People are most likely to encounter ticks when doing activities in the countryside, particularly in woodlands and grasslands where wild animals (including deer) and livestock are also abundant. Other green spaces such as urban parks or gardens can also provide opportunities for contact between people and ticks."
        },
        {
            "text": "While ticks are most active in the spring and summer months, they can be found all year round. The majority of tick bites will not cause Lyme disease. There are around 1,500 laboratory-confirmed cases of Lyme disease in England and Wales each year, although an estimated 1,000 to 2,000 more people are diagnosed each year based on clinical assessment rather than laboratory tests."
        },
        {
            "heading": 2,
            "text": "Can Lyme disease be treated?"
        },
        {
            "text": "In the UK, Lyme disease is an uncommon infection and can be successfully treated with antibiotics as per National Institute for Health and Care Excellence (NICE) guidelines. If untreated, it can cause a wider range of symptoms in some people such as multiple rashes on other parts of the body, facial droop, shooting nerve pain and, rarely, palpitations or joint swelling. Most patients treated in the later stages of infection also respond very well to antibiotics, although some may have long-term damage to their joints or the nervous system."
        },
        {
            "text": "Looking out for symptoms of Lyme disease and checking yourself for ticks after you go to green spaces where they may be present is very important. Prompt correct tick removal can reduce your chances of acquiring Lyme disease."
        },
        {
            "text": "Early symptoms typically develop around 1 to 4 weeks after being bitten, however, they can appear anything between 3 to 30 days after exposure to an infected tick. Rapid recognition of symptoms can ensure that you receive the earliest diagnosis and treatment from your GP."
        },
        {
            "heading": 2,
            "text": "What to do if you have symptoms of Lyme disease"
        },
        {
            "text": "If you become unwell (for example with a spreading circular rash, flu-like symptoms, nerve pain or a droop on one or both sides of the face) within a few weeks of being bitten by a tick, contact your GP or dial NHS 111 promptly. Not everyone will realise that they were bitten by a tick, so you may still develop Lyme disease symptoms without remembering a tick bite. There are national guidelines for doctors, providing advice on diagnosis and management of Lyme disease."
        },
        {
            "heading": 2,
            "text": "How are cases of Lyme disease monitored across the country?"
        },
        {
            "text": "Surveillance tools for Lyme disease use information from ticks collected in locations across the country and laboratory data from patient samples. Previously, however, as the laboratory data was typically linked to where someone lived, there was a gap in understanding about where an infection was acquired."
        },
        {
            "text": "We now gather additional information on people who test positive for recently acquired Lyme disease, including where they may have picked up the infection."
        },
        {
            "text": "This enhanced surveillance allows us to better understand the epidemiology and risk factors for Lyme disease in England, so people can take steps to reduce their risk when they are enjoying the outdoors."
        },
        {
            "heading": 2,
            "text": "Are cases of Lyme disease increasing?"
        },
        {
            "text": "Studies in Europe estimate that 1% to 5% of tick bites can lead to Lyme disease. On average, approximately 4% of ticks are infected in England and Wales, although this range can fluctuate in different areas and across years, and can be on average as high as 8-10% in some areas."
        },
        {
            "text": "Since data collection began in 2005, there has been a gradual increasing trend in cases of Lyme disease, although yearly fluctuations have been observed, particularly since 2018. You can access regular reports on the UKHSA website."
        },
        {
            "text": "The rise in total cases may be due to a combination of increased awareness of Lyme disease as well as improved surveillance, better access to diagnostics, increased potential for encounters with ticks due to changes in wildlife populations and habitat modification that may have resulted in changes in tick distribution across the country, and human behaviour changes."
        },
        {
            "heading": 2,
            "text": "What is ‘chronic Lyme disease'?"
        },
        {
            "text": "There is no agreed definition of the term ‘chronic Lyme disease’ among doctors so it can mean different things to different people. Some people use the term chronic Lyme disease to describe a range of non-specific symptoms including chronic tiredness and unexplained neurological symptoms, even when there is no evidence of past or current Lyme disease infection."
        },
        {
            "text": "The non-specific symptoms overlap with those of several other conditions including fibromyalgia and chronic fatigue syndrome, which can be triggered by common infections such as the glandular fever virus, and - more recently - COVID-19."
        },
        {
            "text": "Although most people with Lyme disease recover from the infection quickly and completely, it is not unusual to feel some lingering fatigue or muscle pain at the time you finish your course of antibiotics. These symptoms generally resolve on their own over time although very rarely can persist for over 6 months and are not improved with longer or repeated courses of antibiotics."
        },
        {
            "heading": 2,
            "text": "Should I get tested by the NHS or a privately funded laboratory? Is there a difference?"
        },
        {
            "text": "If you have a classic bullseye rash, then you should be treated for Lyme disease without the need for a test. If you have a recent tick exposure and symptoms of Lyme disease (but no bullseye rash), guidance to NHS doctors in England is to take a blood sample and send it for testing at an NHS or UKHSA laboratory."
        },
        {
            "text": "The tests work by looking for antibodies that a person infected with Lyme disease would produce."
        },
        {
            "text": "The antibodies take some time to reach levels that can be detected, therefore, tests carried out within the first 4 weeks of infection may be negative and may need to be repeated on a fresh blood sample taken 4 to 6 weeks after the first test."
        },
        {
            "text": "We recommend people exercise caution with private tests and speak to their NHS doctor for advice before spending money on private tests or treatments, as some private laboratories and clinics offer unreliable tests and treatments that are not supported by the scientific community."
        },
        {
            "text": "Diagnostic tests done outside the NHS may also produce false positives where the test shows positive for Lyme disease when the patient doesn’t actually have it. Our advice is to seek help through the NHS."
        },
        {
            "heading": 2,
            "text": "What is tick-borne encephalitis virus (TBEV)?"
        },
        {
            "text": "TBEV is a viral infection that spreads through tick bites. Although it is prevalent in many parts of the world, including several European countries, in the last few years, ticks carrying TBEV have been found in a few areas in England. A very small number of human TBE cases have been diagnosed that are thought to have been acquired in the UK."
        },
        {
            "heading": 2,
            "text": "What are its symptoms?"
        },
        {
            "text": "TBEV causes a range of presentations, from completely asymptomatic infection to mild flu-like illness, all the way to severe infection in the central nervous system such as meningitis or encephalitis (swelling of the brain)."
        },
        {
            "text": "Symptoms of encephalitis and meningitis can include a high fever with a headache, neck stiffness, confusion, seizures or fits, reduced or loss of consciousness."
        },
        {
            "text": "Seek urgent medical attention if you or anyone you know experiences:"
        },
        {
            "text": "More information can be found on the NHS website."
        },
        {
            "text": "Remember that advice and treatment is readily available through the NHS. So, if you think you have been bitten by a tick and have symptoms, contact your GP practice and accept the treatment that is offered to you."
        }
    ]
}