{
    "url": "https://dwpdigital.blog.gov.uk/2024/03/21/writing-a-great-product-strategy-for-great-services/",
    "title": "Writing a great product strategy for great services",
    "authors": [
        "James Brown, Lead Product Manager, DWP Digital"
    ],
    "categories": [
        "Digital With Purpose",
        "Product Manager",
        "Services Week"
    ],
    "pub_date": "2024-03-21T14:31:02+00:00",
    "content": [
        {
            "text": "James Brown, Lead Product Manager, DWP Digital"
        },
        {
            "text": "There are many approaches to creating a product strategy. We’re using this framework to transform DWP’s Retirement Digital Services, and it’s enabling us to work together toward a shared vision of great services for people in later life. "
        },
        {
            "text": "In Retirement Digital Services, we ensure people over state pension age can plan for and secure all the support they need to live without unnecessary hardship. Every year we pay over £120 billion to 18 million DWP customers, including 1 million overseas customers living in 229 countries. "
        },
        {
            "heading": 2,
            "text": "Your product strategy is a business strategy "
        },
        {
            "text": "There are many frameworks to help articulate and structure business strategies. They each include different elements, such as purpose, vision, mission statements, objectives, outcomes, strategic pillars, goals, key features, values and more.  "
        },
        {
            "text": "Which of these elements to include in your product strategy depends on the organisational context of the service you’re creating.  "
        },
        {
            "text": "We reviewed each of them, and created the following pragmatic list of the minimum elements we believed would align everyone behind a shared vision and plan for success. "
        },
        {
            "heading": 2,
            "text": "Work collaboratively throughout "
        },
        {
            "text": "Start by bringing the right people together – both teams and stakeholders – to discuss and agree each of the following elements. We wrote up the strategy as a presentation, but you could also write it as an internal written document or public blog post. "
        },
        {
            "heading": 3,
            "text": "Background "
        },
        {
            "text": "What’s the policy and organisational context behind this work? What led us to where we are today? For us, this included the complex ecosystem of benefits that government provides to people in later life. "
        },
        {
            "heading": 3,
            "text": "Vision "
        },
        {
            "text": "This is the big picture, future ideal state of the world that we and our users want to live in. It’s aspirational and requires a leap of faith. "
        },
        {
            "text": "For example, Oxfam’s vision is “a just world without poverty.”  "
        },
        {
            "text": "Our vision is that “everyone in later life gets the money they’re entitled to and the support they need.\" "
        },
        {
            "heading": 3,
            "text": "Mission(s) "
        },
        {
            "text": "This is what we’re doing to reach that vision. There can be multiple missions that multiple teams are working on simultaneously. "
        },
        {
            "text": "We have a mission for each service we’re creating: “Across State Pension and Pension Credit we will deliver a simple, intuitive service which enables timely, accurate and joined up outcomes for customers and colleagues.” "
        },
        {
            "text": "We also have a mission to ensure we’re designing with and for data. "
        },
        {
            "heading": 3,
            "text": "Immediate case for change "
        },
        {
            "text": "This describes why the work can’t wait. It’s usually driven by urgent business or policy needs. For us it includes things like ensuring we can continue to pay customers and claimants and delivering on DWP’s broader strategy. "
        },
        {
            "heading": 3,
            "text": "Epic user needs "
        },
        {
            "text": "Alongside the key findings from relevant discoveries and research, you can include your high-level user needs. These are essential for ensuring your strategy remains user centred. Ours include:  "
        },
        {
            "heading": 3,
            "text": "Value "
        },
        {
            "text": "Your defined value brings together the business, policy, and user needs into a summary of what the work will achieve.  "
        },
        {
            "text": "We used our retirement value framework, which describes four dimensions of value:  "
        },
        {
            "heading": 3,
            "text": "Guiding principles "
        },
        {
            "text": "Beyond our commitment to the Government Service Standard and Design Principles, these are some additional key techniques we believe are necessary to achieve our goals. They include challenging the status quo, and our belief that inclusive teams create the best work. "
        },
        {
            "heading": 3,
            "text": "Delivery strategy "
        },
        {
            "text": "Bringing everything together, this explains the high-level sequence we intend to take to deliver the mission, where major outcomes are achieved, and value is realised.  "
        },
        {
            "text": "For a shorter-term piece of work, this might just be your current product roadmap. But for a service and set of teams working over multiple years, an explanation of the intended major steps is a useful bookend to the strategy. "
        },
        {
            "heading": 2,
            "text": "Precise, prosaic, profound "
        },
        {
            "text": "These three words are taken from an old advertising strategy framework – yet another kind of strategy. I find them to be an excellent set of criteria for reviewing any product strategy. "
        },
        {
            "text": "If your strategy is not precise enough, then it is hard to challenge and difficult to measure. Check that you have been single-minded and specific. "
        },
        {
            "text": "Strategies provide clarity, so use plain language. Ask people to read it and play back their understanding – does it match what you intended? "
        },
        {
            "text": "Each element of the strategy should have implications for the following one, so that the overall story is coherent. Profound means the strategy has clear consequences for teams’ actions and priorities. "
        },
        {
            "text": "Our product strategy is a living document that we’re continuously checking and updating.  "
        },
        {
            "text": "Hopefully, this step-by-step example will inspire you to confirm your own product strategy framework for the great services you’re working on too. "
        }
    ]
}