{
    "url": "https://environmentagency.blog.gov.uk/2024/02/07/chasing-down-the-money-to-stop-waste-crime/",
    "title": "Chasing down the money to stop waste crime",
    "authors": [
        "Environment Agency"
    ],
    "categories": [
        "Waste"
    ],
    "pub_date": "2024-02-07T09:14:30+00:00",
    "content": [
        {
            "text": "There is an old saying – ‘where there’s muck there’s brass’ and criminals have worked that out."
        },
        {
            "text": "We know organised criminals who make their money through serious and organised crimes, such as drugs and firearms, are using the waste management sector to launder money. Before long they start to commit waste crimes, establishing themselves as bogus waste businesses, collecting waste from unsuspecting people, stealing business away from waste businesses that are working legally."
        },
        {
            "text": "Their blatant disregard for the law, and the damage their actions cause to people’s health and to the environment have consequences for us all."
        },
        {
            "text": "Waste crime is costing our economy an estimated £1 billion a year; that is money being spent dealing with the damage these criminals cause, that could be better spent on essential services."
        },
        {
            "text": "Economic Crime Unit"
        },
        {
            "text": "We know criminals are financially motivated, which is why we have set up a new Economic Crime Unit, specifically designed to take away the monetary benefits from the criminals using the waste industry to make a fast buck."
        },
        {
            "text": "Our new unit is made up of highly skilled people, including Accredited Financial Investigators, Accredited Financial Intelligence Officers, and a Financial Crime Analyst."
        },
        {
            "text": "The unit is focusing on:"
        },
        {
            "text": "Hunt down and stop waste criminals"
        },
        {
            "text": "Our aim is to eliminate waste crime completely."
        },
        {
            "text": "By inhibiting the ability of criminals to operate in the waste industry and stripping them of the financial gains, we will make the waste industry a more difficult and less appealing place for criminals to operate."
        },
        {
            "text": "We are determined in our mission, constantly reviewing, and developing our approach to stop waste criminals for the benefit of the environment and people."
        },
        {
            "text": "You can help too"
        },
        {
            "text": "If you have waste to get rid of, find out the right way to do so and if you get others to take it away for you, check they are a legal business. Find out more: Dispose of household waste - GOV.UK (www.gov.uk)"
        },
        {
            "text": "If you think you’ve come across anyone committing a waste crime, you can report them to our partner Crimestoppers 100% anonymous. Always. Give information | Crimestoppers (crimestoppers-uk.org)  or call 0800 555 111"
        }
    ]
}