{
    "url": "https://healthmedia.blog.gov.uk/2024/02/07/dental-recovery-plan-everything-you-need-to-know/",
    "title": "Dental recovery plan: everything you need to know.",
    "authors": [
        "DHSC Media Team"
    ],
    "categories": [
        "Uncategorized"
    ],
    "pub_date": "2024-02-07T13:35:34+00:00",
    "content": [
        {
            "text": "Dentists are going to be supported to take on new NHS patients in the new dental recovery plan."
        },
        {
            "text": "The plan aims to make sure everyone who needs to see a dentist, particularly those who have been unable to access care in the past two years, will be able to do so, making access to care faster and fairer."
        },
        {
            "text": "We will also drive a major new focus on prevention and good oral health in young children and deliver an expanded NHS dental workforce."
        },
        {
            "text": "But how will this affect those currently waiting for a dentist? Here’s everything you need to know."
        },
        {
            "text": "How will this plan increase the number of NHS dental appointments? "
        },
        {
            "text": "Dentists will be offered a ‘bonus’ to take on more NHS patients which will create more than 2.5 million new appointments in the next year."
        },
        {
            "text": "We’ll also be offering ‘golden hello’ cash incentives for dentists to come and work in areas that are under-served."
        },
        {
            "text": "This will allow around 1 million new patients access to NHS dental treatment, who may previously have been unable to access the dental care they need."
        },
        {
            "text": "How much funding are you providing to implement this plan?"
        },
        {
            "text": "The government already invests £3 billion in dentistry each year."
        },
        {
            "text": "This plan is supported with £200 million to ensure everyone has fast and fair access to a dentist when they need one."
        },
        {
            "text": "How will I know if my local dentist is involved in the plan? "
        },
        {
            "text": "Patients will be able to see which practices in their area are accepting new patients via the NHS website."
        },
        {
            "text": "How do I register to access one of these appointments? "
        },
        {
            "text": "You can find a dental surgery that is convenient for you and contact them to see if there are any NHS appointments available."
        },
        {
            "text": "How will this plan improve access to dentists across the country? "
        },
        {
            "text": "An incentive ‘golden hello’ payment will be offered to dentists to encourage them to work in more remote areas."
        },
        {
            "text": "From later this year, up to 240 dentists will be offered £20,000 to stay and deliver NHS care for at least three years in areas where recruitment and retention of dentists is difficult."
        },
        {
            "text": "I live in a rural area with no local dentist practice – how will I access treatment? "
        },
        {
            "text": "A new dental vans service will be available for targeted rural and coastal communities in underserved areas, with the first vans up and running later this year."
        },
        {
            "text": "Will I have to pay for treatment?"
        },
        {
            "text": "Usual charges for NHS dental care apply. Patients that were already exempt from charges will still be exempt."
        },
        {
            "text": "Does this plan apply to emergency care? "
        },
        {
            "text": "If you think you need urgent care, contact your usual dentist, if you have one, as some surgeries offer emergency dental appointments."
        },
        {
            "text": "You can also contact NHS 111, who can put you in touch with an urgent dental service."
        },
        {
            "text": "Do not contact a GP, as they cannot offer urgent or emergency dental care."
        },
        {
            "text": "How will the new plan improve my child’s oral health? "
        },
        {
            "text": "As part of the plan, we will launch the ‘Smile for Life’ initiative which will offer reception age children vital prevention measures to reduce dental decay and give them a healthier smile."
        },
        {
            "text": "Nurseries and other early years settings will be supported to help children ‘Smile for Life.’ By the time they reach primary school, the government aim to have every child viewing daily toothbrushing and good oral hygiene as part of their daily routine."
        },
        {
            "text": "Mobile dental teams will be going into schools of under-served areas to provide advice and deliver fluoride varnish treatments to more than 165,000 children, strengthening their teeth and preventing tooth decay."
        },
        {
            "text": "Family Hubs will provide advice and support for pregnant mums to improve their oral health and advise parents on protecting baby gums and milk teeth from decay."
        },
        {
            "text": "What else are you doing to prevent tooth decay? "
        },
        {
            "text": "We will shortly be consulting on the expansion of water fluoridation across the North East."
        },
        {
            "text": "Water fluoridation is a safe and effective way to increase the concentration of fluoride in water – a treatment which is known to prevent tooth decay and other oral health issues."
        },
        {
            "text": "Millions of people across England already receive fluoridated water."
        },
        {
            "text": "How are you expanding the dental workforce? "
        },
        {
            "text": "A key part of improving access to dental treatment is growing the dental workforce and supporting and developing all dentists."
        },
        {
            "text": "The NHS Long Term Workforce Plan will expand dental undergraduate training places by 40% to more than 1,100 by 2031/32. This dental plan will soon publish a consultation to look at a ‘tie-in’ so more dentist graduates work in NHS dental care."
        },
        {
            "text": "Recruitment will also focus on dental therapists and other dental care professionals, including a 40% increase of 500 more training places by 2031/32."
        },
        {
            "text": "We will make it easier for NHS practices to recruit dentists from overseas by reducing bureaucracy and increasing exam capacity for overseas qualified dentists."
        },
        {
            "text": "How are you going to tackle 'dental deserts' – areas of the country where there are no dentists taking on new patients or offering NHS care?"
        },
        {
            "text": "We will be offering ‘golden hello’ cash incentives to encourage dentists to come and work in areas that are underserved. Those who do will be rewarded with payments amounting to up to £20,000 over three years."
        },
        {
            "text": "New dental vans will also bring dental care to our most isolated communities."
        },
        {
            "text": " "
        }
    ]
}