{
    "url": "https://minimumwage.blog.gov.uk/2024/02/07/experiences-and-perceived-impacts-of-the-apprenticeship-minimum-wage-a-qualitative-scoping-study/",
    "title": "Experiences and Perceived Impacts of the Apprenticeship Minimum Wage: A Qualitative Scoping Study",
    "authors": [
        "laituanloh"
    ],
    "categories": [
        "Compliance and enforcement",
        "Young workers"
    ],
    "pub_date": "2024-02-07T16:31:56+00:00",
    "content": [
        {
            "text": "This week (5-11 February) marks National Apprenticeship Week. While attention is often on the LPC’s work recommending the National Living Wage rate, we also make recommendations on the minimum wage for apprentices (the Apprentice Rate). This is the minimum hourly rate an employer can pay their apprentice if they are aged 16-18 or in the first year of their apprenticeship if older.[1]"
        },
        {
            "text": "Since it was introduced in 2010, the Apprentice Rate has gone up faster than any of the other minimum wage rates. On 1 April 2024 it will increase again to £6.40."
        },
        {
            "text": "The face of apprenticeships has changed over the lifetime of the rate, with an increasing share of older apprentices pursuing higher-level qualifications, including degree-level apprenticeships. The vast majority of apprentices are paid more than the Apprentice Rate (LPC Report, 2022). However, the rate remains the standard for some apprenticeships and sectors."
        },
        {
            "text": "We want to make sure we hear evidence from all those affected by the minimum wage rates, including apprentices. So, as part of our ongoing research programme, we commissioned researchers from Sheffield Hallam University to carry out in-depth interviews with current and former apprentices. This complements our wider programme of evidence gathering, where we have heard from apprentice employers and organisations representing apprentices, as well as those working closely with apprentices and young people."
        },
        {
            "text": "The resulting report is published today  and gives a rich insight into the experiences of the apprentices interviewed. As the researchers highlight, the voices in the report reflect just some of the possible apprentice experiences – the research was not designed to be representative of all apprentices. Nevertheless it is an important contribution to our understanding of the workings and impacts of the Apprentice Rate."
        },
        {
            "text": "For the remainder of this blog, we hand over to Charlynne Pullen, Bob Jeffery and Teri-Lisa Griffiths – the researchers who carried out the project – to tell us what they found."
        },
        {
            "text": "***"
        },
        {
            "text": "Our research is based on 10 in-depth interviews either individually or paired, with current or former apprentices who were paid the apprenticeship minimum wage at some point during their apprenticeship. It was a significant challenge to find participants, and this group is only representative of certain kinds of apprenticeship minimum wage experiences. Nonetheless, they do offer some striking insights."
        },
        {
            "text": "Some of these were unsurprising - none had been given a positive view of apprenticeships by their schools, and as a result most had found their apprenticeships through an online advert, directly through the apprenticeship employer, or for one young person, at a college open day. As a result, the idea that individuals systematically review a series of options and then select the most appropriate apprenticeship for them would appear to be misleading."
        },
        {
            "text": "The most important thing for all the interviewees was that their apprenticeship would lead to a stable and secure job and for most a clear career path requiring additional training – “a foot in the door”.  This concept of prospects meant many accepted the low wages at the beginning of the apprenticeship. However, for those living independently, typically those over 18 or in care, the reality of trying to pay rent and bills on the apprenticeship minimum wage meant claiming benefits where possible, asking for family support, and in one case, accessing food banks."
        },
        {
            "text": "Most apprenticeship experiences with employers and training providers were positive, particularly with individual trainers and tutors. However, some apprentices experienced employers who exploited them, either failing to provide training, or by asking apprentices to undertake roles that were inappropriate, and training providers delivering poor training, or in one case closing during an apprenticeship. Places where apprentices could come together, either for in-person training for hairdressing or beauty therapy, or cohorts of apprentices meeting in larger employers, were important to create a community and keep apprentices engaged."
        },
        {
            "text": "Progression was key for most apprentices, with some committed to a particular job role at the start – for example accountancy or hairdressing – while others chose Business Administration (or more recently Customer Service) as a way of learning about a range of different career options before specialising. All of the apprentices could see a future career pathway that involved at least a Level 3 apprenticeship, and some of the former apprentices were already on higher level apprenticeships, with one having completed a degree."
        },
        {
            "text": "The clearest message from this research is that a Level 2 apprenticeship on the apprenticeship minimum wage, at its best, can be an effective stepping stone into a career pathway. It can suit individuals with a range of prior experiences, qualifications and ages, but pay needs to be set high enough to ensure that individuals can provide for themselves and have an incentive to stay the course."
        },
        {
            "text": "[1] All apprentices aged 19+ must be paid the relevant minimum wage rate for their age from the second year of their apprenticeship onwards. Throughout an apprenticeship, the relevant minimum wage must be paid for all hours worked, including off-the-job training time. For further information, visit [https://www.gov.uk/become-apprentice/pay-and-conditions]"
        }
    ]
}