{
    "url": "https://defrafarming.blog.gov.uk/2024/02/07/farming-podcast-making-sfi-work-on-our-upland-beef-and-sheep-farm/",
    "title": "Farming Podcast: making SFI work on our upland beef and sheep farm",
    "authors": [
        "Michael Sturla",
        "Graham Higgins",
        "Kate Ward"
    ],
    "categories": [
        "Future Farming Podcast"
    ],
    "pub_date": "2024-02-07T10:16:00+00:00",
    "content": [
        {
            "text": "In this episode of Defra's Farming podcast, our regional engagement lead Michael Sturla talks to Robin and Christopher Milton."
        },
        {
            "text": "Robin and Christopher (also known as 'Buster') are a father and son team. They farm beef and sheep on the Exmoor uplands and, after participating in the pilot, now have a Sustainable Farming Incentive (SFI) agreement."
        },
        {
            "text": "In the podcast, they share how they found the process to apply for their agreement and talk through the actions they’ve included."
        },
        {
            "text": " These include the actions for herbal leys, hedgerows , nutrient management, integrated pest management and the Annual Health and Welfare Review. "
        },
        {
            "text": "Robin explains: \"We feel we're heading towards covering what was our BPS. Now, there is some cost attached to that, but it's coming up to substantially more money and more support for the sort of actions than we expected initially.\""
        },
        {
            "text": "Christopher adds: \"It is workable. If it wasn't, we wouldn't want to be doing it.\""
        },
        {
            "text": "Thanks to Robin and Christopher for sharing their experience. "
        },
        {
            "text": "Read the transcript."
        },
        {
            "heading": 2,
            "text": "Learn more "
        },
        {
            "text": "We recently published a post  which summarised the recent Agricultural Transition Plan update. The update includes the full range of new and updated actions for SFI as well as payment rates available in 2024. We also hosted a webinar to set out the offer which you can watch. "
        },
        {
            "text": "You can apply for an SFI agreement now and choose from the actions currently on offer. By waiting for the 2024 actions, you could be losing out on funding."
        },
        {
            "text": " As Robin says in the podcast, if you apply now, you'll be able to add actions to your agreement annually —  or have multiple agreements —  if you'd like to carry out further actions. "
        },
        {
            "text": "SFI is not competitive. Anyone who applies and is eligible will get an agreement. You can enter as much land as you like: there is no minimum or maximum area. You can choose how many actions you do and, once you’re in SFI, you can add more land and actions to your agreement each year."
        },
        {
            "text": " You will receive your first payment 4 months after your SFI agreement starts. After that you’ll be paid every 3 months, so you have a regular, reliable income. "
        },
        {
            "text": "Robin and Christopher mention animal health and welfare. If you are a livestock farmer, even if you aren’t eligible for BPS, you can also apply now for the Annual Health and Welfare Review, a yearly vet visit funded by Defra."
        },
        {
            "text": "Our dedicated SFI site is a good place to start your journey.  "
        },
        {
            "text": "If you want to talk to someone about your application, the RPA has a dedicated team in place to help. You can also get free business advice for your farm. "
        },
        {
            "text": "Finally, we'll publish a post which sets out the upcoming actions for livestock farmers shortly, so do subscribe to the Farming blog."
        }
    ]
}