{
    "url": "https://nationalscreening.blog.gov.uk/2024/02/07/fascinating-insight-into-potential-benefits-and-limitations-of-using-polygenic-scores/",
    "title": "Fascinating insight into potential benefits and limitations of using polygenic scores",
    "authors": [
        "TJ Day"
    ],
    "categories": [
        "General"
    ],
    "pub_date": "2024-02-07T14:20:06+00:00",
    "content": [
        {
            "text": "Professor Anneke Lucassen gave a fascinating and engaging insight into the use of polygenic scores at the third UK National Screening Committee (UK NSC) online seminar."
        },
        {
            "text": "Polygenic scores are calculated by looking at genetic variants across the genome to determine an overall risk of developing a disease."
        },
        {
            "text": "Prof Lucassen, Director of the Centre for Personalised Medicine, University of Oxford, and a member of the UK NSC, presented a discussion on the potential benefits and limitations of using polygenic scores to calculate the overall chance of developing a disease or condition."
        },
        {
            "text": "Her presentation, ‘Utility of polygenic scores in healthcare’, was based on the paper Realistic expectations are key to realising the benefits of polygenic scores (BMJ, March 2023)."
        },
        {
            "text": "The presentation was followed by a wide ranging question-and-answer session, where Prof Lucassen drew from her extensive knowledge to engage with the audience, who came from a wide variety of backgrounds."
        },
        {
            "text": "Delegates were full of praise for Prof Lucassen’s talk, posting comments that included: “Brilliant stuff! Thanks so much”, “Great insight and loads of thanks”, “Superb presentation Anneke ” and “Thank you. Really engaging session”."
        },
        {
            "heading": 2,
            "text": "Catch up on the presentation"
        },
        {
            "heading": 2,
            "text": "Keep up to date"
        },
        {
            "text": "The UK NSC blog provides up to date news from the UK NSC. You can register to receive updates direct to your inbox, so there is no need to keep checking for new articles. If you have any questions about this blog article, or about the work of the UK NSC, please email uknsc@dhsc.gov.uk."
        }
    ]
}