{
    "url": "https://nda.blog.gov.uk/five-tips-for-a-successful-sellafield-apprenticeship-application/",
    "title": "Five tips for a successful Sellafield apprenticeship application",
    "authors": [
        "Micha Kirkbride"
    ],
    "categories": [
        "Recruitment",
        "Skills"
    ],
    "pub_date": "2024-02-07T13:38:25+00:00",
    "content": [
        {
            "text": "Whether you’re a school leaver or interested in a change of career, we have an apprenticeship scheme for you, and the good news is there’s still time to apply for either a degree apprenticeship or level 2 to 4 apprenticeship."
        },
        {
            "text": "The first step is to write an application that sells you and your skills - here are our 5 top tips:"
        },
        {
            "heading": 3,
            "text": "1. Research, research, research"
        },
        {
            "text": "Do your research – use our Sellafield Ltd careers website and our Sellafield Ltd GOV website to read through our range of apprenticeship schemes, and to learn more about Sellafield Ltd and our work on the Sellafield site."
        },
        {
            "text": "This tip always seems like a common-sense thing to do when filling out any application form, but it often gets overlooked when a deadline for applications is close. Trust us, it does help you to focus and makes every application you make individual to you."
        },
        {
            "text": "Well-researched answers show initiative and enthusiasm and could help you when it comes to your interview."
        },
        {
            "heading": 3,
            "text": "2. Leave enough time"
        },
        {
            "text": "Make sure you leave enough time to sit down and complete your form – seems an easy one but a deadline can creep up on you, and it always takes longer than you think to complete. We need a lot of information from you that you might not have to hand straight away."
        },
        {
            "heading": 3,
            "text": "3. Tailor your application to your preferred scheme(s)"
        },
        {
            "text": "Make your application specific to the apprenticeship scheme you're applying for. Don’t be tempted to copy and paste the same answers for every application."
        },
        {
            "text": "A lot of our schemes require different personal strengths, tell us about what yours are – this could be something you’re good at and enjoy doing.  What strengths can you bring to the scheme(s) you’re applying for?"
        },
        {
            "heading": 3,
            "text": "4. Pay attention to detail and review"
        },
        {
            "text": "It's all in the details!"
        },
        {
            "text": "Firstly, give us as much relevant detail as you can in your application so that we can get to know you better."
        },
        {
            "text": "Secondly, if the closing deadline is fast approaching, rushing your application can lead to mistakes and errors."
        },
        {
            "text": "Our biggest tips to submitting an application that sells you and is error free is to draft your application offline in a programme like Microsoft word. Then have a trusted friend or family member to read it for you. They might be able to suggest other details you can include about yourself and could pick up any spelling mistakes that spellcheck missed."
        },
        {
            "text": "Before you press submit, check, double check and triple check your application."
        },
        {
            "heading": 3,
            "text": "5. Stand out from the crowd"
        },
        {
            "text": "A lot of our schemes are very popular and can attract hundreds of applicants."
        },
        {
            "text": "To help your application stand out, think about how you can tell us about how your skills and experience relate to the specific scheme you're applying for. This might include work experience, school projects etc. But also consider all of the projects and activities you've been involved with (inside and outside of education), every experience will have helped you develop skills so tell us about them."
        },
        {
            "text": " "
        }
    ]
}