{
    "url": "https://buyingforschools.blog.gov.uk/2024/02/07/get-help-buying-for-schools-turns-2-and-celebrates-supporting-over-2000-schools-and-trusts/",
    "title": "Get help buying for schools turns 2 and celebrates supporting over 2,000 schools and trusts",
    "authors": [
        "Jane Davies, Head of Schools Commercial Operations, DfE"
    ],
    "categories": [
        "Services"
    ],
    "pub_date": "2024-02-07T11:05:21+00:00",
    "content": [
        {
            "text": "As Get help buying for schools celebrates its second birthday, Jane Davies, Head of Schools Commercial Operations at the Department for Education, reflects on what has been achieved so far and the future aims of the service."
        },
        {
            "text": "Has it really been two years since we launched Get help buying for schools?! I can’t believe our second birthday has come around so quickly, but I am so proud of what we have achieved since we launched back in February 2022."
        },
        {
            "text": "Get help buying for schools is a free and impartial procurement service for people who buy goods and services for schools and multi-academy trusts. We’re here to support schools and trusts to buy everything they need to operate, from cleaning and catering, ICT and utilities, to transport and professional services."
        },
        {
            "text": "Our vision is that all schools and trusts plan and buy efficiently and get best value, so that every pound benefits pupils. We know we have a way to go to get there. We understand that not many schools or trusts are able to employ a procurement specialist, and that buying is often undertaken by someone who is wearing many hats. Buying high cost and high risk goods and services is a complex and resource intensive process and we’re here to help."
        },
        {
            "text": "Over the past two years, we have provided schools with advice and guidance, and access to DfE approved frameworks, alongside hands-on support from a procurement expert for complex buying such as catering and cleaning contracts."
        },
        {
            "text": "We have supported schools and trusts on a wide variety of procurements, energy to transport, ICT to furniture, and worked closely with our public sector buying partners to find the right solution."
        },
        {
            "text": "I’m thrilled to share that we’ve helped over 2,000 schools and trusts since the service launched. Here’s what some of our happy customers had to say about their experience of using Get help buying for schools."
        },
        {
            "text": "Jason Murgatroyd, Executive Head, Grangetown Primary School:"
        },
        {
            "text": "Zoe Allcott, Business Manager, Thrive Education Partnership:"
        },
        {
            "text": "Kieren Done, School Business Manager, St Ambrose College:"
        },
        {
            "text": "Emma Foulkes, Chief Finance Officer, Holy Family of Nazareth Catholic Academy Trust:"
        },
        {
            "text": "As we look to the future, we want to build on our successes and deliver more value to schools and trusts. We will do this by continuing to provide an impartial service, providing procurement advice and guidance, supporting schools and trusts to deliver procurements, and by leading procurement activity on behalf of schools and trusts. We also want to support the sector through the changes that the new Transforming Public Procurement Act will bring."
        },
        {
            "text": "There is a lot to look forward to. I want to take this opportunity to thank everyone who has worked so hard to get the service up and running. I look forward to continuing to work with you as we continue to evolve and develop the service to better meet the needs of our customers."
        },
        {
            "text": "If you've found this article useful and want to learn more about how we’re supporting schools, click ‘sign up and manage updates’ to subscribe to our blog and receive notifications when we next post."
        }
    ]
}