{
    "url": "https://educationhub.blog.gov.uk/2024/02/how-to-find-apply-apprenticeship/",
    "title": "How to find and apply for an apprenticeship",
    "authors": [
        "mediaofficer"
    ],
    "categories": [
        "Apprenticeships"
    ],
    "pub_date": "2024-02-07T09:56:49+00:00",
    "content": [
        {
            "text": "Apprenticeships are a brilliant option for people of all ages to launch their careers, upskill, or retrain in a huge range of exciting industries - from space engineering to healthcare to advertising and beyond."
        },
        {
            "text": "There are thousands of apprenticeship vacancies on offer, with more than 690 high-quality apprenticeships approved for use by employers."
        },
        {
            "text": "Here’s what you need to know."
        },
        {
            "heading": 3,
            "text": "What are apprenticeships? "
        },
        {
            "text": "An apprenticeship is an excellent training route that gives apprentices high-quality, hands-on training and the chance to put the skills you develop into practice every day in the workplace. You’ll also be paid a wage while you train."
        },
        {
            "text": "Apprenticeships are available at all levels, from Level 2 – equivalent to GCSEs – all the way up to Levels 6 and 7 – equivalent to undergraduate and master’s degrees."
        },
        {
            "heading": 3,
            "text": "Where can I find an apprenticeship?"
        },
        {
            "text": "There are a few ways to search for apprenticeship vacancies."
        },
        {
            "text": "You can browse apprenticeships on the find an apprenticeship service. If you create an account, you can also save any apprenticeships you like and then apply for them later."
        },
        {
            "text": "You can also find apprenticeships via UCAS. You can easily compare job openings with other education opportunities, and later this year you will be able to apply for apprenticeships through UCAS."
        },
        {
            "text": "Some employers advertise apprenticeship vacancies directly on their own websites."
        },
        {
            "heading": 3,
            "text": "How do I apply for an apprenticeship?"
        },
        {
            "text": "Applying for an apprenticeship is similar to applying for a regular job, and, unlike college or university, places are advertised throughout the year."
        },
        {
            "text": "Applications will differ depending on the apprenticeship, but it’s likely that you’ll have to submit a CV and do an interview."
        },
        {
            "text": "Find out more about how to write a CV on the National Careers Service."
        },
        {
            "heading": 3,
            "text": "What qualifications do I need to do an apprenticeship?"
        },
        {
            "text": "The grades and qualifications you need depend on the apprenticeship level."
        },
        {
            "text": "Each vacancy will explain what you need to apply."
        },
        {
            "heading": 3,
            "text": "What age group are apprenticeships for?"
        },
        {
            "text": "Apprenticeships are open to anybody aged 16 and over. There is no upper age limit."
        },
        {
            "text": "They’re a great option whatever your age, especially if you’re thinking of changing careers."
        },
        {
            "heading": 3,
            "text": "Where can I get career advice?"
        },
        {
            "text": "To get personalised advice on your application, you can talk to a careers adviser for free via the National Careers Service."
        },
        {
            "text": "There are lots of ways to get in touch including by phone, on 0800 100 900 or webchat."
        }
    ]
}