{
    "url": "https://apprenticeships.blog.gov.uk/2024/02/07/josie-rothera-reflects-on-her-time-working-with-ifate-on-the-construction-and-built-environment-route-panel/",
    "title": "Josie Rothera reflects on her time working with IfATE on the Construction and Built Environment Route Panel.",
    "authors": [
        "Institute for Apprenticeships"
    ],
    "categories": [
        "Construction and the Built Environment",
        "National Apprenticeship Week",
        "Route Panel"
    ],
    "pub_date": "2024-02-07T11:18:37+00:00",
    "content": [
        {
            "text": "Josie Rothera reflects on her time working with IfATE on the Construction and Built Environment Route Panel."
        },
        {
            "heading": 2,
            "text": "What did I do?"
        },
        {
            "text": "I contributed to guidance and decisions regarding new and existing apprenticeships in England – Level 3 to Level 6, from thatched roofer to low carbon heating technician."
        },
        {
            "heading": 2,
            "text": "How did I feel?"
        },
        {
            "text": "It’s the first time that I have taken a strategic role, appointed for my experience both in industry and higher education. It was daunting to think that my contributions could change the direction of an apprenticeship, and I was mindful of other people on the panel that seemed to have better understanding and more experience than me."
        },
        {
            "heading": 2,
            "text": "How did I get support?"
        },
        {
            "text": "The Panel were great – they were welcoming and once I got into the rhythm of the meeting agendas and structures, I began to vocalise any thoughts I had – even if it was outside my own technical understanding. The IfATE employees were equally supportive with the administration aspect, especially when Covid-19 meant the meeting had to be switched online."
        },
        {
            "heading": 2,
            "text": "What were the benefits to the Panel and me?"
        },
        {
            "text": "My role in project management meant that I often thought more of the interpersonal nature of the learning, any client facing opportunities and how digital skills need to support communications. Each Panel member was able to bring their own experience to discussions and this meant that broader skills development was considered and incorporated."
        },
        {
            "heading": 2,
            "text": "What does the Panel need now?"
        },
        {
            "text": "It is important that the Panel is made up of diverse and inclusive representation. Our most recent panel members represent SMEs and trade. However, there is also room for more. The Panel would be stronger with more facilities management and building services representation."
        },
        {
            "heading": 2,
            "text": "What advice would I give to someone wanting to join?"
        },
        {
            "text": "Its part of our make up to give back, and this is one fantastic way that you can. Not only will you see the effort that goes into apprenticeship design and delivery, but you can shape this too. Take your passion, and put it to good use!"
        },
        {
            "text": " "
        }
    ]
}