{
    "url": "https://deframedia.blog.gov.uk/2024/02/07/judicial-review-on-nutrient-regulations-for-farmers/",
    "title": "Judicial review on nutrient regulations for farmers",
    "authors": [
        "defrablogs"
    ],
    "categories": [
        "Environment Agency",
        "water"
    ],
    "pub_date": "2024-02-07T16:05:40+00:00",
    "content": [
        {
            "text": "Preview Changes (opens in a new tab)"
        },
        {
            "text": "Today there has been media coverage on a Judicial Review by River Action on the Farming Rules for Water (FRfW)."
        },
        {
            "text": "Farming Rules for Water (2018) is one of the frameworks for the Environment Agency’s farming and agriculture regulation and sets out that farmers are responsible for minimising the risk of pollution from applications of nutrients to land and livestock management. The Environment Agency is using funding and regulatory powers to work with farmers to reduce water pollution, ensure they comply with the rules and tackle inadequate infrastructure, poor soil, and nutrient management."
        },
        {
            "text": "The Environment Agency does not hesitate to take appropriate action, up to and including enforcement, when breaches of regulations are identified. Anyone who has a concern about pollution should notify the Agency immediately using the 24-hour incident hotline: 0800807060."
        },
        {
            "text": "Last year the Environment Agency carried out more than 4,000 farm inspections across England, including 493 in the Wye catchment. This resulted in more than 5,000 improvement actions across England, and 285 improvement actions in the Wye, being undertaken to improve farm practices. This ranges from improving storage of slurry to better management of nutrients and soils."
        },
        {
            "text": "There were 11 other prosecutions against farmers last year for causing pollution under the Environment Permitting Regulations."
        },
        {
            "text": "The Farming Rules for Water are one of many regulatory tools used by the Environment Agency to manage the nutrient load in the Wye Catchment. Furthermore, the impact of farming is not the only source of nutrient levels. Phosphorus has accumulated over a number of years and is affected by climate change, flow levels in the Wye, increased housing development as well as industrial discharges from industry on the Wye."
        },
        {
            "text": "An Environment Agency spokesperson said:"
        },
        {
            "text": "A Defra spokesperson said:"
        },
        {
            "text": " "
        },
        {
            "text": "Follow Defra on Twitter, and sign up for email alerts here."
        }
    ]
}