{
    "url": "https://mojdigital.blog.gov.uk/2024/02/07/national-apprenticeship-week-our-teams-journey/",
    "title": "National Apprenticeship Week - Our Team's Journey",
    "authors": [
        "Damien Hall"
    ],
    "categories": [
        "a great place to work",
        "National Apprenticeship Week"
    ],
    "pub_date": "2024-02-07T11:25:36+01:00",
    "content": [
        {
            "text": "To coincide with National Apprenticeship Week, I'm delighted to share the experience of my team's apprenticeship journey."
        },
        {
            "text": "Rewind to my school days, when the notion of apprenticeships was confined to specific trades and the belief that university was the ultimate path to success. Fast forward (I'll spare you the exact number of years, as it still sends shivers down my spine), and here I am as a Lead Engineer for the Prison Onsite Support team at the Ministry of Justice."
        },
        {
            "text": "Within Justice Digital, there is a strong emphasis on continuous improvement and personal development. As leaders, It’s our responsibility to give everyone opportunities to upskill and to help them achieve their aspirations. This involves exploring pathways for learning and development, enabling them to progress both within and beyond their current roles.   "
        },
        {
            "text": "While researching available learning, I found the Microsoft Azure Cloud Support Specialist L3 apprenticeship. Exploration of this apprenticeship gave me insight into how such a route of learning could offer a structured way to deliver training whilst allowing staff to support each other through the process, demonstrating and developing their existing skill set.  "
        },
        {
            "text": "The course includes a range of subjects, including Networking Principles, Microsoft Azure, and M365. Undertaking such learning seeks to give learners a broader knowledge and understanding of the tools at their disposal to deliver effective services whilst learning on the job and gaining a recognised qualification (quite different from my experiences at school). "
        },
        {
            "text": "Our first cohort is now fully enrolled. Their enthusiasm and commitment to personal and professional growth have been nothing short of exceptional. We are excited to see how the team grows and develops throughout the course and into their careers moving forward. Future enrolments are scheduled throughout the year with a view to the whole team engaging in the process within the next 12 months. There is a level of commitment and enthusiasm being demonstrated towards professional development, which is great to see, and I’m pleased to be able to have the opportunity to offer such prospects.  "
        },
        {
            "text": "Apprenticeships offer a dynamic blend of hands-on experience and tailored content. To those thinking about an apprenticeship journey, take this week to see what is out there. I encourage you all to take the leap - we did! "
        }
    ]
}