{
    "url": "https://environmentagency.blog.gov.uk/2024/02/07/national-apprenticeship-week-natalies-experience-on-the-environmental-practitioner-degree-apprenticeship/",
    "title": "National Apprenticeship Week: Natalie’s experience on the Environmental Practitioner Degree",
    "authors": [
        "Environment Agency"
    ],
    "categories": [
        "Climate change",
        "Environment Agency",
        "Invasive species",
        "Our staff",
        "Sustainability"
    ],
    "pub_date": "2024-02-07T15:34:15+00:00",
    "content": [
        {
            "text": "Natalie Parkinson is a 19-year-old student from Stoke-On-Trent. A year ago, she moved to Ely in Cambridgeshire to do a five-year Environmental Practitioner Degree Apprenticeship with the Environment Agency. It’s a full-time, paid job with a finite end but, assuming all goes well, a degree at the end of it and the prospect of a permanent role with the Environment Agency. It seems like the perfect scenario for an eager-to-learn undergraduate determined to forge a career protecting the environment."
        },
        {
            "text": "“Climate change has always been the topic I’m most interested in,” says Natalie, “but I also have an interest in natural hazards, hazard management around floods and storms. I wanted a degree, but I didn’t want to go to university in the traditional way. I looked at jobs, but they all missed the educational side of things and I couldn’t find anything I wanted to do."
        },
        {
            "text": "“However, the apprenticeship scheme is everything combined and encapsulates everything I wanted to do. I get five years’ work experience and a degree. I couldn’t think of a better scenario. It’s a pretty good deal!”"
        },
        {
            "text": "The course doesn’t specialise in one key area. Instead, the student employees are exposed to all areas of Environment Agency business. The approach ensures that at the end of it, there’s a well-rounded appreciation and an opportunity to specialise with the help of practically accrued knowledge."
        },
        {
            "text": "“Every six months, I’m with a different team. My first team was in regulated industry and now I’m in a data mapping and modelling team where we look at flood data. As for the next team, I’m not sure yet! The university element is really broad. I’m currently looking at ecology and habitat and we’ll soon be moving onto geo-science, organic chemistry and extinction and survival."
        },
        {
            "text": "Natalie’s Team Leader at the Environment Agency’s East Anglian team Dale Gutsell says:"
        },
        {
            "text": "“The degree element is run through Keele University and our responsibility is to ensure the students build up practical skills and knowledge while still doing their academic studies. It’s four days of practical application and one day of university work. The idea is that because it’s an Environmental Practitioner course, they should be putting into practice with us, what they learn during their university work. We also have associate Project Management and Data Analyst apprentices who are on a shorter course of up to two years and these are people who want to work in those specific disciplines and so stay in those teams rather than move around the organisation.”"
        },
        {
            "text": "The Environment Agency offers its career-entry apprenticeships through the DEFRA apprenticeship programme. They’re not necessarily offered every year and not all the Environment Agency areas currently offer the opportunity, although, as Natalie has proved, location isn’t necessarily a restriction."
        },
        {
            "text": "“All the apprenticeships are advertised through our usual job recruitment systems,” says Dale. “So, when they’re posted, they’ll sit there with all the other jobs on the Environment Agency’s external jobs page. The adverts have all the information around location and what the job and programmes consist of.  We make decisions on course availability based on capacity within teams and the ability to provide the experience and support to the apprentices. There’s no fixed programme and no automatic enrolment every year, it really is dependent on all the usual stuff around resource and budgets.”"
        },
        {
            "text": "So the advice for anyone interested in a vocational degree with the Environment Agency is to keep looking and make the EA’s job board work for you."
        },
        {
            "text": "“What you can do is set up an account on our jobs board and create alerts from the options. If you want"
        },
        {
            "text": "opportunities for example, you can set it so you’re not bombarded with everything else."
        },
        {
            "text": "“A five-year course rather than the usual three, might put some people off because it seems like a long time but when you weigh everything up it really isn’t. You will gain a level of practical experience and a salary throughout the process. The practical experience will mean you’re able to start at a higher level, compared with those who did a three-year degree. It’s such a good opportunity for young people to get into the sector and the organisation.”"
        },
        {
            "text": "Natalie regards herself as fortunate to have found the opportunity. She’s one of only 13 people currently on this course in the Anglian region and intends to ensure it serves her long-term goal of working with - and for - the future of our natural world."
        },
        {
            "text": "“Degree apprenticeships on their own are hard to find, especially in the environment sector.” Says Natalie. “Those of us here all consider ourselves incredibly lucky. At the moment, I definitely feel like I’d like to stay with the Environment Agency after graduation and apply for a permanent role but I’m not sure in what area just yet. It’s so varied and the jobs are all very different, so I’ll have to wait and see what’s available and see what I enjoy."
        },
        {
            "text": "“I couldn’t think of a better outcome. If I’d gone to university, I wouldn’t have had the work experience, however, if I’d gone into a full-time job I’d have missed the educational side. With the Environment Agency I get it all and every day is different. I couldn’t ask for more.”"
        },
        {
            "text": "The Environment Agency is dedicated to developing talent in people of all ages and career stages. To find out more about apprenticeships at the Environment Agency, visit: Early careers - Environment Agency (environmentagencycareers.co.uk)"
        },
        {
            "text": " "
        }
    ]
}