{
    "url": "https://naturalengland.blog.gov.uk/2024/02/07/the-pathway-to-seabird-recovery-in-england/",
    "title": "The pathway to seabird recovery in England",
    "authors": [
        "Dr Alex Banks",
        "Nick Williams"
    ],
    "categories": [
        "Biodiversity",
        "Marine environment",
        "Natural England",
        "Seabirds",
        "Wildlife"
    ],
    "pub_date": "2024-02-07T12:21:09+00:00",
    "content": [
        {
            "text": "Dr Alex Banks – Principal Specialist, Ornithology & Nick Williams – Principal Adviser, Marine Strategy"
        },
        {
            "text": "England is a special place for seabirds. Our cliffs, beaches, marshes and offshore islands provide nest sites for around 20 species, including charismatic and iconic birds such as Atlantic puffins and northern gannets. The nutrient-rich seas contain various small fish which seabirds can prey upon. And the shallow, often sandy, nearshore waters support over-wintering ‘marine waterbirds’ including seaducks like common eiders, and various species of divers (also known as loons). Seabirds are important - not only in themselves but as an indication of the health of the marine environment."
        },
        {
            "text": "The results of the recent UK and Ireland seabird census, Seabirds Count, present a mixed picture for England’s seabirds. Whilst several appear to show positive trends over the past 20 years, often in response to careful conservation attention, some show worrying declines."
        },
        {
            "text": "Roosting cormorant, shags and greater black-backed gull. Image: Josh ParkerSpecies for which England is especially important, such as little terns, black-headed gulls and European shags, are decreasing; others, such as black-legged kittiwakes and roseate terns, are apparently more stable, but at much lower levels than in the past."
        },
        {
            "text": "And these results pre-date the recent outbreak of Highly Pathogenic Avian Influenza (HPAI), which has badly impacted sites with significant populations of seabirds, especially perhaps terns and gulls."
        },
        {
            "text": "In recognition of pressures affecting seabird populations, including diseases such as HPAI, Defra commissioned Natural England to investigate the most likely causes of decline in seabirds in England. The resulting report forms the English Seabird Conservation and Recovery Pathway – or ESCaRP for short."
        },
        {
            "text": "What is ESCaRP?"
        },
        {
            "text": "ESCaRP is a set of 74 actions designed to bring about seabird recovery, grouped into 19 recommendations across four themes. Each action stems from an evidence-led analysis process that factored in seabird distribution, the distribution of ‘pressures’ resulting from human activities, and the sensitivity of seabirds to those pressures (i.e. how likely they are to be negatively impacted). ESCaRP is part of the Government’s Environmental Improvement Plan."
        },
        {
            "text": "Theme 1: Feeding"
        },
        {
            "text": "Recommendations in this theme relate to ensuring seabird populations have sufficient prey available to feed themselves and their young. Seaducks may rely upon shellfish and other invertebrates on the seabed, but for most seabirds prey means small fish like sandeels."
        },
        {
            "text": "A huge step towards achieving these recommendations in England has recently been taken by the Government, who have announced the closure of all sandeel fisheries in English waters. This measure should allow seabirds and other marine predators to benefit from increased availability of fish prey. (Nature recovery to be accelerated as the government delivers on measures to protect land and sea - GOV.UK (www.gov.uk))"
        },
        {
            "text": "Theme 2: Breeding"
        },
        {
            "text": "Safe, undisturbed and productive nest sites are crucial to enable seabirds to recover, as they tend to reproduce very slowly – many species do not breed until they are several years old, typically then lay just a few eggs each year, and in some years may decide not to breed at all."
        },
        {
            "text": "Recommendations in this theme focus on reducing pressures that can impact seabird breeding success. This ranges from a lack of suitable nesting areas (for instance where climate-related processes have changed habitat type or quality) to management of human disturbance, mitigating disease outbreak and spread, and minimising predation impacts. The latter has been very successful on some seabird islands with non-native invasive mammalian predators; biosecurity measures then become the focus of maintaining predator-free status."
        },
        {
            "text": "Theme 3: Surviving"
        },
        {
            "text": "Seabirds spend substantial amounts of time away from their nests. When breeding, they forage at sea, also using marine areas for various other behaviours. In the non-breeding (winter) season, when the breeding sites are largely empty, England’s seas can host both breeders from English colonies as well as migrant birds from other countries."
        },
        {
            "text": "Within the marine environment seabirds can be exposed to a host of pressures that recommendations in this theme aim to address. These may be lethal, such as drowning in fishing nets or colliding with wind turbines, or sub-lethal but detrimental to health over a longer period."
        },
        {
            "text": "ESCaRP includes recommendations to mitigate and monitor the risk of seabird bycatch in fishing gears, and to promote recovery through strategic sustainable development of marine industries. It touches upon marine habitat quality for seabirds, and highlights the continued need to address risks presented from plastic pollution and the introduction of contaminants, for example crude oil spills."
        },
        {
            "text": "Theme 4: Knowledge"
        },
        {
            "text": "We will only be able to measure the effectiveness of actions introduced to drive seabird recovery if we improve our knowledge of their ecological processes and changes. Most fundamentally, ESCaRP recommends that key breeding colonies in England have secure funding for monitoring so that future changes can be swiftly identified and addressed. Other monitoring, for instance surveying seabirds at sea and around offshore wind farms, is also recommended."
        },
        {
            "text": "The remaining knowledge gaps relate to pressures potentially impacting seabirds, and addressing these would mean management decisions and conservation actions can be better driven by evidence. These recommendations span the recording of mass-mortality events (so-called ‘seabird wrecks’); causes, prevalence and impact of disease; quantifying bycatch; assessment of seabird prey resources; and finally drawing these together to understand key anthropogenic drivers of change (and management needs) in more depth."
        },
        {
            "text": "ESCaRP: next steps"
        },
        {
            "text": "Natural England is proud of the work that has informed ESCaRP. It was a multi-disciplinary body of work that drew upon a range of skills and specialisms within the organisation. Having developed our recommendations, we are now looking forward to supporting Defra and other partners to translate these into positive actions for seabirds. We have the recovery pathway – it is now time to walk it!"
        },
        {
            "text": " "
        }
    ]
}