{
    "url": "https://openpolicy.blog.gov.uk/2024/02/07/using-experimental-methods-to-reimagine-decision-making-for-the-freshwater-system-post-2043/",
    "title": "Using experimental methods to reimagine decision-making for the freshwater system, post 2043",
    "authors": [
        "nehasharma",
        "Sanjan Sabherwal",
        "benpeppiatt",
        "Nina Cutler",
        "amyramdehal"
    ],
    "categories": [
        "Examples and findings",
        "Policy Lab",
        "Projects"
    ],
    "pub_date": "2024-02-07T14:30:32+01:00",
    "content": [
        {
            "text": "How can we find and develop ideas that are truly different to the status quo? It’s a question that many policymakers ask themselves, either to seek new ways to improve policy outcomes or to plan for the unexpected. Typically, we find that the answer lies in stretching imaginations and widening perspectives. This blog looks at how we used three experimental methods to broaden horizons in a recent project, including trialling, for the first time in UK government, a more-than-human perspective in policy development. "
        },
        {
            "heading": 3,
            "text": "Water Post 2043 - Exploring divergent futures "
        },
        {
            "text": "Last year, we worked with Defra Futures to explore what decision-making in relation to the freshwater system could look like post 2043, if transformed. This meant significantly reimagining who might be involved in managing our waterways, and the alternative ways decisions could be made twenty years from now and beyond. "
        },
        {
            "text": "Our task was not to predict the future but to spark new conversations and provoke thinking by bringing different possibilities to life. Looking ahead to a 20-year horizon gave us the space to step away from the current day and consider unconventional ideas that could be applied in the future (see figure below). Whilst we have allowed ourselves to expand and shift the Overton Window for this investigation, these ideas may or may not help shape decision making processes in the long term. "
        },
        {
            "text": "We drew upon varied methods including, collective intelligence, moral imaginings and speculative design to invite new ideas and provide a taste of what these imagined futures could look like. "
        },
        {
            "text": " Below we introduce each method and explain why using it was so important to achieving the project’s objectives. "
        },
        {
            "heading": 3,
            "text": " Collective Intelligence "
        },
        {
            "text": "The first step in widening the lens was to draw on the collective wisdom of policymakers, academics, industry stakeholders, creatives, and the public. To do this, we ran a Collective Intelligence debate over the course of a week using the open source Pol.is platform, which enables large numbers of people to come together and comment on a specific issue. This approach brings in voices from different viewpoints, increases the likelihood of unexpected ideas emerging and can provide weak signals of activities and attitudes that may become more established in the future. Policy Lab has run about a dozen Collective Intelligence debates and this one had high engagement with nearly 200 participants. The Pol.is platform enabled participants to vote on whether they agreed or disagreed with statements spanning a range of ideas that explored how, what, who for and by whom decisions could be made in the future. Participants were also able to suggest their own statements, adding potential ideas and perspectives to the mix.  "
        },
        {
            "text": "The results surfaced areas of divergence and convergence around themes such as the impact of decisions on future generations or the role of technology to support the use of evidence. The approach helped us to gauge appetite for different concepts amongst our stakeholders. "
        },
        {
            "heading": 3,
            "text": "Moral Imaginings – Experimenting with a new method "
        },
        {
            "text": "Experimentation is another vital ingredient when exploring new possibilities and for this project, we looked to experiment with one of our most valuable tools: our imagination.  "
        },
        {
            "text": "We asked ourselves, what if, in the future, we used our imaginations to represent more-than-human perspectives in decision-making?  "
        },
        {
            "text": "To explore this question, we worked with Phoebe Tickell, founder of Moral Imaginations, who has developed an approach that seeks to embed three pillars into decision-making: nature and the more-than-human world, future unborn generations and ancestors and the past. These three pillars are known collectively as Moral Imagining and is an approach that is gathering momentum among social innovators and in local government. "
        },
        {
            "text": "In the Water Post 2043 project, we considered the more-than-human perspective by running the UK’s government’s first ever Interspecies Council. This is a practice, developed by Phoebe Tickell, Joanna Macy and the team at Moral Imaginations, which uses semi-improvisational, participatory techniques to bring the voice of nature into organisational decision-making. It is an adaptation of the Council of All Beings, an exercise created by Joanna Macy.  "
        },
        {
            "text": "The River Roding Interspecies Council took place in a location next to the River Roding in Barking. We brought together 24 participants, including stakeholders with a professional or community interest in the local area, to imagine and empathise with the needs of some of the species living in and around the river Roding. We asked questions such as: What concerns does the bee have? Or a local reed warbler? "
        },
        {
            "text": "While we can’t truly know the answers to these questions, the process of stepping out of our own shoes can help to deepen empathy and create new perspectives. More-than-human thinking asks us to engage with the needs of both humans and other species in decision-making, recognising that our actions often have an impact beyond people-centred considerations.  "
        },
        {
            "text": "Phoebe Tickell, founder of Moral Imaginations "
        },
        {
            "text": "You can watch this short overview of the River Roding Interspecies Council, including reflections from some of the participants. "
        },
        {
            "text": "Using such a novel form of engagement can feel daunting but experimentation allows us to learn lessons, see what works and identify what can be explored further. This is particularly valuable for policy issues that require thinking far into the future. Experiencing the Interspecies Council approach for the first time, we observed how the format acted as a levelling tool, bringing people with different roles and experiences together and allowing them to find common goals. Rather than achieving an easy consensus, however, the discussions amongst the group highlighted areas of tension which then prompted reflection about potential solutions and compromises. Whilst tracking the impact of this work, we saw an appetite for people to keep engaging, both with each other and the river Roding, weeks after the Council had taken place. Feedback also suggests that a legacy effect of more-than-human empathy has developed for some; almost all participants reported a noticeable, lasting change within their perception or feelings towards nature, the world or themselves in the week after the Council. "
        },
        {
            "text": "Interspecies Council participant"
        },
        {
            "heading": 3,
            "text": " Speculative Design  "
        },
        {
            "text": "The third way in which we looked to reimagine what is possible was by using speculative design. This practice allows us to imagine new possibilities by creating fictions and scenarios of possible futures, manifested through the design of artefacts and stories to provoke discussion.  "
        },
        {
            "text": "Towards the end of the project, Policy Lab and the Catchment Based Approach (CaBA) co-hosted a specially designed exhibition at Somerset House called the Changing Course Forum. The exhibit curated newly commissioned and existing works that portrayed possible ways in which future decision-making for the water system might be transformed.  "
        },
        {
            "text": "Over two days 80 stakeholders, including academics, policymakers, and social innovators, viewed and experienced a range of physical and digital speculations that presented different versions of what the future could look like. We partnered with award-winning studio Superflux, who created the Ecological Intelligence Agency, an installation that invited the audience to experience the role AI might have in future policy decision-making. See their website for a deep dive into their work developing this speculation. Policy Lab’s designers also created two speculations. One, led by Ben Peppiatt, imagines a future with a ‘national civic service’ which encourages members of the community to take part in local river stewardship to build long-term resilience of the water system. The other Policy Lab speculation, led by Nina Cutler, presents a fictional scenario in which communities gather at a local festival to participate in decision-making, aided by combining citizen science and the arts. "
        },
        {
            "text": "Watch this short film of the Changing Course forum to learn more about the event, including hearing from some of the stakeholders on their experiences of engaging with speculative design. "
        },
        {
            "text": "Participants at the Changing Course Forum were also able to contribute their own future visions of their local waterways, with narratives woven together in an immersive soundtrack created by Uninvited Guests and Duncan Speakman. You can listen to the piece here.  "
        },
        {
            "text": "The concepts presented during the event have roots in activities occurring today as well as some technological promises that have yet to be realised. By combining physical artefacts with rich narratives, stakeholders were able to see, hear and feel possible transformations. Speculations act as probes to provoke conversation, sharing visions for futures that may or may not be desirable rather than providing predictions or solutions.  "
        },
        {
            "text": "Phil Tovey, Head of Defra Futures, reflected: "
        },
        {
            "text": "The post 2043 horizon set for this project invited us to take a long-term perspective. Whilst the combination of methods used may seem beyond the realm of conventional policymaking, these creative, tactile and imaginative approaches enabled us to engage wider audiences more readily and offer policy colleagues an expanded set of concepts to inform their existing data and analysis. Together, these three methods allowed us to stretch thinking and bring new ideas into the fold. Although the concepts may or may not develop further, using collective intelligence, moral imaginings and speculative design played a vital role in inspiring new conversations and activities to inform and expand future thinking.  "
        },
        {
            "text": " If you are interested in using these experimental methods in your work, contact the team at team@policylab.gov.uk.   "
        },
        {
            "text": " "
        }
    ]
}