{
    "url": "https://cyberandspecialistoperationscommand.blog.gov.uk/2024/02/07/we-are-strategic-command-with-jonathan-corke/",
    "title": "We Are Strategic Command with Jonathan Corke",
    "authors": [
        "bobsendall"
    ],
    "categories": [
        "Uncategorized"
    ],
    "pub_date": "2024-02-07T11:14:10+00:00",
    "content": [
        {
            "text": "Jonathan Corke, Graduate Enterprise Architect at Defence Digital. talks about his role and how the supportive environment has enriched his experience."
        },
        {
            "text": "Interviewer: What is the role of Defence Digital within Strategic Command?"
        },
        {
            "text": "Jonathan Corke: Defence Digital is a crucial organisation supporting the entire Defence sector in the digital sphere, both in the UK and globally. Its responsibilities range from managing networks and modnet to our laptops and mobile phones, essentially serving as the communications organisation for Defence."
        },
        {
            "text": " "
        },
        {
            "text": "Interviewer: What do you do within Defence Digital?"
        },
        {
            "text": "Jonathan Corke:  I work as an Enterprise Architect as part of the Defence Digital graduate scheme. My focus for the past year has been on improving meeting room environments, examining the technology within those spaces and enhancing our capabilities for hybrid meeting scenarios."
        },
        {
            "text": " "
        },
        {
            "text": "Interviewer: What’s does the graduate scheme entail?"
        },
        {
            "text": "Jonathan Corke: The programme spans three years and involves pursuing a Master’s degree in a specialised area, like Enterprise Architecture.  As part of the scheme, we have different placements across the organisation and wider-Defence, with my current secondment being to the Army Information Design Authority."
        },
        {
            "text": " "
        },
        {
            "text": "Interviewer: How have you been supported as part of the programme?"
        },
        {
            "text": "Jonathan Corke: There’s a robust support structure, including cohort managers and HR managers. There’s also a network of participants which really helps foster a collaborative environment."
        }
    ]
}