{
    "url": "https://defrafarming.blog.gov.uk/2023/04/12/countryside-stewardship-delivering-for-farmers-and-the-environment/",
    "title": "Countryside Stewardship: delivering for farmers and the environment",
    "authors": [
        "The Team"
    ],
    "categories": [
        "Countryside Stewardship",
        "environmental land management schemes"
    ],
    "pub_date": "2023-04-12T12:33:44+01:00",
    "content": [
        {
            "text": "As part of our transition to environmental land management, we announced that we would evolve Countryside Stewardship."
        },
        {
            "text": "Countryside Stewardship (CS) provides financial incentives for farmers, foresters and land managers to look after and improve the environment. Through the scheme, thousands of farmers are being paid for the valuable work they do. "
        },
        {
            "text": "In this post, we’ll give you a refresher, share some facts and figures and explain how you can get involved.  "
        },
        {
            "heading": 2,
            "text": "Countryside Stewardship: an overview "
        },
        {
            "text": "The main offers in CS are:  "
        },
        {
            "heading": 3,
            "text": "CS Higher Tier"
        },
        {
            "text": "Higher Tier grants are offered for multi-year management options and capital items for the most environmentally important sites. These include commons and woodlands. They are usually in places that need complex management. For example, creating or restoring habitats and improving woodland. "
        },
        {
            "text": "There’s still time to apply for a CS Higher Tier agreement for 2024. We'll accept applications until 28 April 2023. "
        },
        {
            "heading": 3,
            "text": "CS Mid Tier and Wildlife Offers"
        },
        {
            "text": "The aim of Mid Tier is to protect and enhance the natural environment through multi-year management and capital grants. They are improve the diversity of wildlife, water quality, air quality and natural flood management. Wildlife Offers are part of Mid Tier and provide a simpler set of options to help improve wildlife in 4 different farming types."
        },
        {
            "text": "The application window for CS Mid Tier and Wildlife Offer agreements, to start from 1 January 2024, is open until 18 August 2023."
        },
        {
            "heading": 3,
            "text": "CS Capital Grants"
        },
        {
            "text": "Capital Grants are 3-year agreements offering capital items to achieve specific environmental benefits. We've introduced Higher Tier Capital Grants which offer capital items to achieve additional environmental benefits alongside existing Higher Tier agreements."
        },
        {
            "text": "Applications for capital grants are open all year round. "
        },
        {
            "heading": 3,
            "text": "CS Facilitation Fund"
        },
        {
            "text": "The Facilitation Fund brings together groups of people who collaborate to improve environmental outcomes in their local area.  "
        },
        {
            "text": "The application period closed 25 January 2023. June 1 is the start date for CS Facilitation Fund 2023 agreements applied for in 2022/23."
        },
        {
            "heading": 2,
            "text": "The popularity of Countryside Stewardship"
        },
        {
            "text": "Participation in Countryside Stewardship has grown in recent years. In January 2023, there were around 32,000 CS agreements, a 94% increase from 2020.  "
        },
        {
            "text": "The most popular element of CS is Mid Tier which, including the Wildlife Offers, accounts for around 87% of all CS agreements. "
        },
        {
            "text": "There are also 2,700 Higher Tier and 1,500 Higher Tier Woodland agreements, which deliver on the most environmentally significant sites. "
        },
        {
            "text": "The graph below shows the number of CS agreements from 2018."
        },
        {
            "text": " "
        },
        {
            "text": "There is good uptake across England. The highest number of agreements are found in Devon, East Anglia and North Yorkshire. "
        },
        {
            "text": "CS provides annual payments for a wide range of activities on different land types, supporting the conservation and restoration of habitat and protecting the historic environment, as well as improving air and water quality. "
        },
        {
            "text": "Many of the most popular revenue options focus on improving biodiversity. The following options appear in over 5,000 live agreements: "
        },
        {
            "text": "Capital grants are also an important element of CS. 64% of Mid Tier and Higher Tier revenue agreements contain at least one capital item. Popular capital items include:  "
        },
        {
            "text": "There are also currently 1,500 capital-only agreements. The majority of these are for Woodland Management Plans.  "
        },
        {
            "text": "You can search for options, supplements and capital items to include in your Countryside Stewardship application using the Countryside Stewardship grant finder on GOV.UK"
        },
        {
            "heading": 2,
            "text": "Delivering for the environment  "
        },
        {
            "text": "Countryside Stewardship supports the government's 25 Year Environment Plan. It also supports Defra’s strategic objective of ‘a cleaner, healthier environment, benefitting people and the economy’. "
        },
        {
            "text": "There are 2,307,258ha of mapped priority habitats in England, with around 46% of mapped priority habitats in an agri-environment or woodland scheme. For example: "
        },
        {
            "text": "The Natural England-led Agri-Environment Evidence Programme seeks to monitor and evaluate existing agri-environment schemes, including CS. The majority of CS scheme options are well-located and well-implemented. Under the following themes, we also found:"
        },
        {
            "heading": 3,
            "text": "Biodiversity"
        },
        {
            "text": "The placement and choice of options were generally aligned with appropriate habitats and features. There’s opportunity to further target Mid Tier agreements to provide additional benefit to biodiversity."
        },
        {
            "heading": 3,
            "text": "Climate change adaptation and mitigation"
        },
        {
            "text": "CS appears to perform well in identifying and managing highly climate-vulnerable features.  As a whole, Mid Tier and Higher Tier schemes resulted in reductions in GHG (greenhouse gas emissions), with the majority of emission reductions arising from a few options with high coverage. There’s further scope for CS options to contribute to climate change adaptation through restoration or the creation of priority habitats."
        },
        {
            "heading": 3,
            "text": "Protection of resources (for example, water and soil)"
        },
        {
            "text": "Appropriate selection of options and capital items was identified in approximately half of agreements. There is scope for greater use of capital items supporting water quality and mitigating flood risk."
        },
        {
            "heading": 3,
            "text": "Historic Environment"
        },
        {
            "text": "Historic Environment (HE) options were considered to be implemented well. Options were more likely to be conserving or maintaining historic features, with only 6% assessed as enhancing feature condition. Non-HE specific options, for example, those for grasslands, and buffer strips, generally had a neutral or positive impact on historic features."
        },
        {
            "heading": 3,
            "text": "Landscape character"
        },
        {
            "text": "Generally, options were assessed to be having a positive impact —enhancing, conserving, maintaining — on landscape character."
        },
        {
            "heading": 3,
            "text": "Countryside Stewardship Facilitation Fund (CSFF)"
        },
        {
            "text": "Groups were found to positively contribute to maintaining, enhancing and creating Natural Capital through the application of CS options, delivering additional positive effects beyond that which would be achieved by individual holdings. CSFFs also promoted trust between members and improving social connection between the people taking part."
        },
        {
            "text": "To find out more about these and other findings, visit the Natural England Access to Evidence site"
        },
        {
            "heading": 2,
            "text": "Learn more and apply  "
        },
        {
            "text": "If you’re interested in applying, you can find out more in the Countryside Stewardship guidance on GOV.UK."
        },
        {
            "text": "As mentioned, applications for Mid Tier and Wildlife Offers, Higher Tier and Capital Only grants are all now open.  "
        },
        {
            "text": "Do take a look at Rural payments and grants and Funding for Farmers and Land Mangers on GOV.UK"
        },
        {
            "heading": 2,
            "text": "Evolving our environmental land management offer"
        },
        {
            "text": "We’ll evolve our land management schemes in the coming years to improve how they work for farmers and to deliver more for the environment. "
        },
        {
            "text": "This will include introducing additional actions, improved access for tenant farmers and increased access to Higher Tier options. "
        },
        {
            "text": "We’ll also introduce Countryside Stewardship Plus to encourage the right things to happen in the right places, enable local join-up to deliver bigger and better results and facilitate testing of innovative payment mechanisms, including payment by results.   "
        },
        {
            "text": "If you have any questions for the team, comment below."
        },
        {
            "heading": 4,
            "text": "The data used in this post was taken at 23 January 2023. "
        }
    ]
}