{
    "url": "https://nda.blog.gov.uk/environmental-graduate-louise-moysan-is-shaping-the-future-at-sellafield/",
    "title": "Environmental graduate Louise Moysan is shaping the future at Sellafield",
    "authors": [
        "Louise Moysan"
    ],
    "categories": [
        "Uncategorized"
    ],
    "pub_date": "2023-04-12T13:13:45+01:00",
    "content": [
        {
            "text": "In less than 2 years, graduate environmental advisor Louise Moysan has supported an environmental permit for a new nuclear facility at Sellafield, worked to ensure our discharges from our most hazardous facilities are within permitted levels, and is about to embark on a secondment with the Environment Agency."
        },
        {
            "text": "Here she shares her career highlights so far, as well as her advice for joining the environmental team at Sellafield."
        },
        {
            "text": "Highlight 1 – being able to make a real difference from the start"
        },
        {
            "text": "I joined Sellafield Ltd in 2021 as a graduate environmental advisor after studying Environmental Science at University."
        },
        {
            "text": "I am passionate about protecting the environment, and I always knew that I needed a job that would help me make a real difference."
        },
        {
            "text": "At University, I studied a module on radioactivity in the environment and I was instantly hooked. Sellafield was mentioned and I ended up writing my master’s dissertation on the fate of Sellafield radionuclides."
        },
        {
            "text": "When I heard about the Sellafield Graduate Programme and the opportunity to join the environmental capability, I instantly knew that this would be a perfect opportunity to put my skillset into practice."
        },
        {
            "text": "What I didn’t expect was to have the opportunity to make a difference from the very start of my career."
        },
        {
            "text": "I’ve been with the company for less than 2 years and have already supported a permit application for one of the new construction projects at Sellafield and conducted a research exercise across the company to understand the status of lifecycle analysis to determine a way forward."
        },
        {
            "text": "Highlight 2 – no 2 days are the same"
        },
        {
            "text": "There is no such thing as a typical day at Sellafield."
        },
        {
            "text": "A large part of my role is to liaise with different people, such as engineers, operators, safety case team members and colleagues across the environmental teams to provide environmental advice."
        },
        {
            "text": "Some days I will be visiting plants, meeting with stakeholders and carrying out audits."
        },
        {
            "text": "I also spend a significant amount of time writing technical reports and collecting and analysing data."
        },
        {
            "text": "As part of the Graduate Scheme, I also undertake different training courses to develop my behavioural and professional skills."
        },
        {
            "text": "Highlight 3 – you can inspire the next generation"
        },
        {
            "text": "I have signed up to be a Science Technology Engineering and Mathematics (STEM) ambassador which means I go into schools and attend events across West Cumbria to work with children and hopefully inspire the next generation of environmental professionals."
        },
        {
            "text": "Highlight 4 – working in the environmental team can take you anywhere you want to go"
        },
        {
            "text": "The different roles available across the environmental capability are very varied, from front-line environmental teams to the environmental management team, working in permitting or discharge controls."
        },
        {
            "text": "It can even take you outside of Sellafield Ltd. For example, I am about to join the Environment Agency as an assistant nuclear regulator for the next 6 months."
        },
        {
            "text": "I will be working on varied work packages related to nuclear regulation, incident management and research and development, as well as wider work with the local land and water team on metal mines monitoring and bathing water quality."
        },
        {
            "text": "The secondment will help me broaden my skillset and develop positive, collaborative relationships with our regulators, ultimately making me a better environment professional."
        },
        {
            "text": "What advice would you give to somebody considering this role as a career?"
        },
        {
            "text": "Get as much experience as you can, and that doesn’t have to be employment experience."
        },
        {
            "text": "Before joining Sellafield Ltd, I held multiple leadership positions in university societies, worked part-time as a student ambassador, undertook an internship in an environmental and chemicals consulting company and volunteered as a corporate sustainability analyst."
        },
        {
            "text": "Work at Sellafield can be very varied and challenging, and that wealth of diverse experiences has helped prepare me for my future career by helping me become a more adaptable and resilient person."
        },
        {
            "text": "Make sure that you are aware of the different competences you have acquired throughout your career so that you can highlight them during your interview."
        },
        {
            "text": "Also, do not be afraid to ask questions! No one will expect you to know everything from day one."
        },
        {
            "text": "If you’re ready to help shape the future at Sellafield, click on the link below for more information about our environmental vacancies, to apply for the roles, or just to express an interest in talking to us about the roles."
        }
    ]
}