{
    "url": "https://environmentagency.blog.gov.uk/2023/04/12/little-stour-chalk-stream-restoration-blog/",
    "title": "LITTLE STOUR CHALK STREAM RESTORATION BLOG",
    "authors": [
        "Environment Agency"
    ],
    "categories": [
        "Environment Agency"
    ],
    "pub_date": "2023-04-12T11:04:17+00:00",
    "content": [
        {
            "text": "Tom Reid, Biodiversity Technical Specialist in the Environment Agency’s Kent, South London and East Sussex Area, explains how the future of the Little Stour, a chalk stream in Kent, is being safeguarded through partnership working on an innovative restoration project."
        },
        {
            "text": "Chalk streams are often referred to as the equivalent of England’s rain forests or Great Barrier Reef. 85% of the world’s chalk streams are found in England, mainly in the south and east of the country."
        },
        {
            "text": "However, they face unique challenges in the 21st century because of complex problems exacerbated by climate change and population growth. They flow through some of the most urbanised, industrialised, and intensively farmed parts of the country. Over-abstraction, pollution and habitat degradation are serious concerns for environmental groups and other stakeholders."
        },
        {
            "text": "To help address some of these issues, the Little Stour at Seaton, near Canterbury, is now reaping the many environmental benefits of a partnership makeover project that has restored over 300 metres of this rare chalk stream habitat."
        },
        {
            "text": "The Kentish Stour Countryside Partnership and the Environment Agency carried out the improvement work that has transformed part of the much-loved Little Stour downstream of Wickhambreaux Village."
        },
        {
            "text": "Our partnership project, with assistance from the three landowners, was originally completed in 2016 but a recent drone survey of the river has revealed how the scheme is benefitting the river following the restoration works."
        },
        {
            "text": "The collaborative £28k scheme, funded by the Environment Agency, involved narrowing the over-widened river to restore this valuable stretch of chalk stream by changing the profile of the river bed and banks."
        },
        {
            "text": "Using a mechanical excavator, a series of pools were dug into the river bed and the excavated gravel was placed onto the sides of the watercourse to form ledges. This created a narrower, deeper, winding channel which, during summer when the water level is low, will be more likely to retain water. Deeper water in the pools will also be cooler in the warmer temperatures expected with climate change over the coming decades."
        },
        {
            "text": "As a result of this enhancement work, fish life has now become more abundant and a more varied habitat has developed for all aquatic and riverside wildlife to thrive. The riverbanks were also fenced and trees were planted along the river and in the adjacent fields."
        },
        {
            "text": "Since the project was completed, fish recorded in the restored stretch include eels, bullheads and brook lamprey – all of which are rare and priority species. There have also been reports of kingfishers, otter just upstream of the site too."
        },
        {
            "text": "The project also provided additional flood protection benefits with one river bank being raised slightly with clay to further reduce flood risk to residents in Seaton."
        },
        {
            "text": "Other enhancement work included in the project was the provision of a crossing that allows cattle to reach the adjacent fields for grazing. The crossing also acts as a cattle drink at one short section of river. It is fitted with gates that prevent cattle from accessing the rest of the watercourse. This stops them grazing on the river vegetation, allowing wild plants to grow and thrive in the water and on the banks, providing ideal habitat for local wildlife."
        },
        {
            "text": "This project contributes to the recent chalk stream strategy Chalk Stream Strategy, published by Catchment Based Approach’s (CaBA) Chalk Stream Restoration Group (CSRG), that sets the future direction needed to protect and enhance England’s chalk streams."
        },
        {
            "text": "Recommendations in the strategy include enhanced status of chalk streams to drive investment in water resources – to help reduce pollution and eliminate over-abstraction – and restoring physical habitat and biodiversity. The plan has bought together partners including the Environment Agency, Natural England, Defra, water companies and environmental organisations."
        },
        {
            "text": "The Little Stour project takes us a step closer to meeting the government’s Environmental Improvement Plan to support the implementation of the Chalk Stream Strategy. We will develop plans to outline actions to improve each chalk catchment, including £1 million investment in partnership projects each year."
        },
        {
            "text": "Further information can be found on the following link:"
        }
    ]
}