{
    "url": "https://childrenssocialcare.blog.gov.uk/2022/12/20/a-message-for-the-festive-season-from-minister-for-children-families-and-wellbeing-claire-coutinho/",
    "title": "A message for the festive season from Minister for Children, Families and Wellbeing, Claire Coutinho",
    "authors": [
        "Minister Claire Coutinho"
    ],
    "categories": [
        "Celebrating social work",
        "Independent Review of Children's Social Care",
        "Uncategorized"
    ],
    "pub_date": "2022-12-20T16:13:11+00:00",
    "content": [
        {
            "text": "I am writing to personally thank you for your continued commitment to the vital work you do every day to support the most vulnerable children and families. I am grateful for your unwavering resolve to transform lives in what continues to be challenging circumstances."
        },
        {
            "text": "As you will know, in May 2022 Josh MacAlister’s independent review of children’s social care published its final report. The review highlighted that the greatest strength of the children’s social care system lies in its workforce and made a number of recommendations to fully realise that potential."
        },
        {
            "text": "Therefore, we are taking steps to improve stability and ensure social workers are able to thrive in a system that supports and enables them to work effectively for our most vulnerable children and families in the long-term. This includes helping to reduce unnecessary bureaucracy to support social workers to spend more time directly with children and families."
        },
        {
            "text": "We will be saying more in the Implementation Strategy early in the new year. We are keen to engage with you closely to ensure our reforms allow you to continue to deliver vital work in helping to improve the lives of children and families."
        },
        {
            "text": "I hope everyone has a chance to have a rest over the festive period. Seasons greetings and a happy new year."
        }
    ]
}