{
    "url": "https://cyberandspecialistoperationscommand.blog.gov.uk/2022/12/20/cyber-insiders-being-app-aware/",
    "title": "Cyber Insiders: Being App Aware",
    "authors": [
        "calumjenkins"
    ],
    "categories": [
        "Cyber",
        "Personnel",
        "Technology"
    ],
    "pub_date": "2022-12-20T15:02:54+00:00",
    "content": [
        {
            "text": "There’s an ‘app’ for everything these days and whether it’s social media, online banking, or gaming, digital applications are a part of daily life for the majority of us. Downloadable from both official and third-party app stores, as well as from online websites, access to these applications has also never been easier. Some of us may receive electronics for Christmas and whether it’s a new phone, laptop, or tablet, we’ll head almost immediately to one of these stores to download our favourites. But is it safe to do so? This virtual marketplace may seem secure on the surface but dig a little a deeper and you’ll discover a whole host of threats associated with digital applications. The government has recently published a new Code of Practice which will strengthen app security and privacy for consumers, but in the meantime you should follow the advice of our cyber experts. But first we're going to explore this by first looking at data tracking before discussing some common risks associated with applications and sharing some useful tips on how you can become ‘App Aware.’"
        },
        {
            "text": "Why Track: "
        },
        {
            "text": "Many users are unaware of the extent to which their data and information is harvested away and used. The question is why, and how, are apps doing it in the first place?"
        },
        {
            "text": "In 2018, the Financial Times published an article exploring the extent to which apps were collecting data and providing it to third-party organisations. Alphabet, the conglomerate famous for Google as well as Facebook and Twitter, were found to be the top three recipients of user information. Now, you may be sitting there picturing your personal data from match three games being packaged up and parcelled off to the folks running social media. However, the majority of mobile apps actually contain utilities from these large organisations that enable them to track and collect user data straight from the application itself."
        },
        {
            "text": "Whether its names, gender, age, or your user preferences, all data is fair game for collection and can then be used for a number of reasons. It may be cultivated and used to push out targeted messaging, such as advertisements or it may be used in business reports on performance, user preferences, or customer experiences. For example, if you download a fitness app, or a new game from the ‘App Store,’ Google can show you adverts for similar or related products."
        },
        {
            "text": "What are the risks involved:"
        },
        {
            "text": "You would probably classify everything we’ve discussed so far as being harmless. What’s the big deal if third-party organisations are tracking the apps I use or the data I upload to them? In some circumstances it can be incredibly useful. You may be shown a product or service you were previously unaware of that could have a positive impact on your day-to-day life. However, with our personal information and data stored away, we’re at risk of potential cyber threats from within the apps themselves. Let’s have a look at a few of these below:"
        },
        {
            "text": "What can you do to protect yourself?"
        },
        {
            "text": "It is incredibly hard to know about an applications level of security and there is very little you can do to control the information, or data, that third party organisations gather. But there are some things you can do to make sure you’re ‘App Aware’:"
        },
        {
            "text": "Conclusion "
        },
        {
            "text": "At the end of the day, it is incredibly difficult to control what information is being collected about you via your favourite apps. The best thing you can do is make sure your aware of the risks we’ve discussed in this article and understand the best practices to minimise the cyber threats data tracking presents. Always be ‘App Aware.’"
        }
    ]
}