{
    "url": "https://insidehmcts.blog.gov.uk/2022/12/20/developing-a-user-research-community-to-improve-our-digital-services/",
    "title": "Developing a user research community to improve our digital services",
    "authors": [
        "Sarah Wickstead - Senior user researcher"
    ],
    "categories": [
        "Customer experience and research",
        "Digital services",
        "Working at HMCTS"
    ],
    "pub_date": "2022-12-20T17:58:12+00:00",
    "content": [
        {
            "text": "Our services are diverse and so are our users. When our users come into contact with the justice system, it can often be at highly stressful moments, such as:"
        },
        {
            "text": "Each touchpoint in our users’ journeys can be life changing, which is why it’s so important for us to learn about our users and create services that meet their needs."
        },
        {
            "text": "The better we understand our users, the more likely we are to design and build services that work well for them."
        },
        {
            "heading": 2,
            "text": "Improving our research skills and practice"
        },
        {
            "text": "As a user research team, the research we do is varied. While one of us is testing new designs for a service in its alpha stage, another is understanding the in-court experience. One of us might be working on a cross-cutting discovery to improve how we capture reasonable adjustments, another might be doing research to understand and improve a new digital service."
        },
        {
            "text": "Our user-centred design community meets every month.  We’ve found our community sessions over the past year have helped us identify common user needs across our services and helped us to share best practice."
        },
        {
            "text": "We have a monthly user research community of practice hour, and dedicated personal development time, to make sure we’re constantly improving our skills and providing the best outcomes for our users."
        },
        {
            "heading": 2,
            "text": "Our first user research crit"
        },
        {
            "text": "We recently held our first user research ‘crit’, inspired by our content design colleagues. The aim was to share user research from different projects, reflect on our own practice and get feedback and advice, in a timebound and structured session:"
        },
        {
            "text": "Here are our main takeaways from the session:"
        },
        {
            "heading": 3,
            "text": "Context is everything"
        },
        {
            "text": "Each piece of work shared in the session was different. Understanding the context for the research and the problem the team was trying to solve is an important part of the puzzle."
        },
        {
            "heading": 3,
            "text": "Be format agnostic"
        },
        {
            "text": "Format agnostic means we share research in a variety of formats, and we found that this worked well. Sometimes we want feedback on recruitment briefs and research plans. Sometimes we want to discuss research outputs."
        },
        {
            "text": "Our team plays back research findings in a range of ways, including:"
        },
        {
            "heading": 3,
            "text": "Make collaborative recommendations"
        },
        {
            "text": "Our work helps teams to make the right design decisions to meet user needs. It was great to share some success stories and learn how user researchers are involving different teams to improve services."
        }
    ]
}