{
    "url": "https://deframedia.blog.gov.uk/2022/12/20/landmark-deal-for-nature-reached-at-cop15/",
    "title": "Landmark deal for nature reached at COP15",
    "authors": [
        "Defra Press Office"
    ],
    "categories": [
        "Weekly stories",
        "Wildlife"
    ],
    "pub_date": "2022-12-20T12:32:20+00:00",
    "content": [
        {
            "text": "There has been widespread coverage following the conclusion of the COP15 biodiversity conference in Montreal, Canada."
        },
        {
            "text": "The conference ended as the international community agreed a new deal, signed by 195 countries, to protect 30% of our land and ocean by 2030. Other measures include ending human-induced extinctions of known threatened species, such as rhinos and gorillas and further ambitious to support the rights of indigenous peoples. Crucially, the framework is also supported by a finance mechanism to ensure that public and private investment is aligned with nature."
        },
        {
            "text": "Environment Secretary Thérèse Coffey said:"
        },
        {
            "text": "The UK has played a key role in brokering these commitments on the world stage and we will continue to drive forward action on tackling biodiversity loss."
        },
        {
            "text": "The Environment Secretary Thérèse Coffey was interviewed by the BBC News for a piece which ran as the lead item on the 6pm and 10pm evening news programmes. The story also ran prominently across Channel 4 and ITV News, carrying comments from the Environment Secretary and Tony Juniper, Chair of Natural England."
        },
        {
            "text": "The Times, Guardian and the i note the importance of the landmark deal in agreeing international action to further protections for the land, sea and wildlife which puts nature firmly on the road to recovery."
        },
        {
            "text": "For further information, visit: New deal to protect nature agreed at COP15 - GOV.UK (www.gov.uk)"
        }
    ]
}