{
    "url": "https://civilservice.blog.gov.uk/2022/12/20/lessons-in-leadership-with-luis-von-ahn/",
    "title": "Lessons in Leadership with Luis Von Ahn",
    "authors": [
        "Matt Brown"
    ],
    "categories": [
        "A Modern Civil Service",
        "A Skilled Civil Service",
        "An Ambitious Civil Service",
        "An Innovative Civil Service"
    ],
    "pub_date": "2022-12-20T13:34:27+00:00",
    "content": [
        {
            "heading": 3,
            "text": "When the co-founder of the Civil Service Languages Network (CSLN), Matt Brown, met CEO of Duolingo, Luis Von Ahn, he received a masterclass in leadership and in the importance of having a strong mission to deliver results. "
        },
        {
            "text": "Duolingo has become one of the most well-known language-learning apps available: you may well have used Duolingo and progressed in a language you’re learning. Von Ahn’s goal in creating Duolingo stems from observing that in his native Guatemala, language learning was the preserve of the wealthy and that language barriers increased poverty and conflict. In 2010, Duolingo was thus born to open up access to language learning, regardless of your wealth or walk of life. "
        },
        {
            "text": "As CSLN’s founders, we’ve been fascinated by this mission-focused approach, and are now considering how we can apply it to CSLN to build the linguistic capability of the UK Civil Service and support policy delivery. "
        },
        {
            "heading": 4,
            "text": "Birth of CSLN"
        },
        {
            "text": "The question you may ask is: How did we get into a position of having coffee with the CEO of Duolingo? Back in 2020, the COVID-19 lockdown made it tricky for colleagues to meet up and practice Spanish, so like everyone else, we adapted to online interactions. Two years later, we have grown into a network of 42 language groups including a Bilingual Parenting group, with more than 9,500 members participating across government, the UK and overseas. "
        },
        {
            "text": "Members have the chance to develop their language skills through online tandems, and conversations sessions, as well as tune into online talks from guest speakers. We have had speakers from all over the world: from ambassadors and academics, to war reporters, and even the BBC’s very own Huw Edwards, all of whom has their own story to tell about languages and intercultural communication. CSLN members had the chance to hear more about Duolingo’s story in early December at our event with Luis Von Ahn – it went down a treat with more than 850 people tuning in."
        },
        {
            "text": "Long-term view"
        },
        {
            "text": "To make our network self-sustaining and to achieve our objectives, we identify with Von Ahn’s belief that success is based on decision making with a long-term view."
        },
        {
            "text": "This has meant having a clear understanding of what we want to achieve, both in terms of scale of the network and how we support government to make better use of Civil Servants’ linguistic capability. In practice, this has involved:"
        },
        {
            "heading": 4,
            "text": "Championing diversity"
        },
        {
            "text": "From a co-founder perspective, this network has shown us just how important it is to champion diversity. Managing a team of 150 language leads makes you reflect on how differently people tick and how to adapt your messaging. It offers us a unique opportunity to learn daily about how others think, act and perceive the world. "
        },
        {
            "text": "Von Ahn has built a workforce upon the mission of democratising access to education: Duolingo is now launching subsidised English tests and Duo Maths. I just goes to show what is possible when you inspire colleagues to back an idea, however bold it may be, and emphasises just how important it is to champion diversity in learning. "
        },
        {
            "text": "We would like to think that, two years in, we have built a community of language learners that can now practise a language, from Arabic to Scots; learn more about the world; and share expertise as bilingual parents, BSL learners or even as speakers of English as a second language. This has only been possible with the work of our committee who are share CSLN’s core belief that language skills and intercultural understanding are essential skills and can be better utilised in the government. "
        },
        {
            "heading": 4,
            "text": "Join us"
        },
        {
            "text": "If you would like to be part of a 9,500-strong staff network with regular talks and language activities, sign up to the Network via this link."
        },
        {
            "text": "If you have any questions, please email us at languages.network@faststream.civilservice.gov.uk "
        }
    ]
}