{
    "url": "https://mhclgdigital.blog.gov.uk/2022/12/20/local-digital-2022-in-review/",
    "title": "Local Digital: 2022 in review",
    "authors": [
        "The Local Digital team"
    ],
    "categories": [
        "Local Digital"
    ],
    "pub_date": "2022-12-20T13:46:38+00:00",
    "content": [
        {
            "text": "Local Digital is on a mission to bring together everyone required to make excellent local public services through the Local Digital movement."
        },
        {
            "text": "The community was drawn together around the Local Digital Declaration, a shared ambition for the future of local public services. Co-authored in 2018 by 45 organisations, the declaration now has a total of 302 signatories in England. "
        },
        {
            "text": "In this blog post, we want to celebrate some of our highlights from 2022 and provide an insight of what's to come in 2023."
        },
        {
            "heading": 2,
            "text": "Our highlights from 2022"
        },
        {
            "text": "The last 12 months have been filled with exciting changes, challenges and growth for the Local Digital team."
        },
        {
            "heading": 3,
            "text": "Spring "
        },
        {
            "text": "We set out our ambition for a new strategic direction in March. Our multi-year funding enabled us to scale up our support and start to tackle the key challenges facing the sector head-on. As a result, we launched a range of new pilot opportunities throughout the year."
        },
        {
            "text": "Within the same month, we teamed up with the Amazon Web Services (AWS) Institute to deliver a free virtual programme for local government. The Executive Education Programme in Digital Transformation for UK Local Government was designed to equip senior local government officers with the confidence and expertise they need to lead the successful digital transformation of public services. We were joined by 98 attendees from 70 local authorities across the country, and feedback from attendees was so positive that we’re running the course again in February and March 2023 - register via the AWS website by 21 January 2023."
        },
        {
            "heading": 3,
            "text": "Summer"
        },
        {
            "text": "As spring turned to summer, we were joined by 119 people from 64 councils at six Local Digital Roadshow events across England. It was fantastic to meet so many local government colleagues in person, and the roadshows provided the ideal opportunity for us to introduce councils to our exciting three-year plans, gather feedback, and gain a better understanding of the cyber and digital challenges."
        },
        {
            "text": "In July, we celebrated four years of the Local Digital Declaration by sharing some of our highlights from the past year whilst signatories featured their stories on social media and blog posts. Since then, we've been undertaking research to help us ensure the Declaration is as relevant today as it was at its launch in 2018. We'll continue to work on this next year ahead of the fifth anniversary in July."
        },
        {
            "text": "We also attended and spoke at a range of valuable sector events hosted by iNetwork, Socitm, techUK, LGA, UKAuthority and more. It was great to present our plans for the future and gather insight to inform our approach."
        },
        {
            "heading": 3,
            "text": "Autumn"
        },
        {
            "text": "In September, we launched the Cyber Assessment Framework for Local Government pilot with a cohort of 10 councils. The pilot builds on Local Digital’s work to improve cyber security in councils by exploring how the NCSC’s Cyber Assessment Framework (CAF) could be used to help assess and manage cyber risks across local government in England. "
        },
        {
            "text": "The first phase of the pilot has come to an end, and you can now read some of our initial insights. What we’ve learnt so far suggests that a CAF for local government is the right approach, and in the new year we plan to look at what reporting and assurance models may need to sit around it. You can also register for the virtual Show and Tell on Wednesday 25 January, where we’ll be sharing more findings from this phase."
        },
        {
            "text": "Meanwhile, Local Digital has continued to deliver cyber support to councils. A total of 186 councils have received technical remediation and support to date, and DLUHC has provided over £19 million to carry out this vital work. While the cyber support programme is now coming to an end, we’ll continue to work through the remediation plans with the councils that are already enrolled, and turn our attention to how we can support all councils through the Cyber Assessment Framework."
        },
        {
            "text": "October was a month full of opportunities. We not only opened applications for Round 6 of the Local Digital Fund, we were also excited to open applications for the pilot of Future Councils, our latest programme."
        },
        {
            "text": "In the latest round of the Local Digital Fund, we invited local authorities to submit proposals that make local government services safer, more resilient and cheaper to run. This is our most ambitious round of funding yet, and we are looking to award approximately £2million to council-led agile projects. "
        },
        {
            "text": "We were delighted with the interest from local authorities in the Future Councils pilot, a partnership between Local Digital and a group of councils to deliver replicable pathways to digital and cyber security reform that other councils can follow. We’ll be announcing the successful councils for both Future Councils and Local Digital Fund in early 2023, so keep an eye on our channels to find out more."
        },
        {
            "text": "To support our expanding programme, we welcomed new team members to continue our growth and started the Meet the Local Digital Team blog to provide transparent insights to our team and ways of working."
        },
        {
            "heading": 3,
            "text": "Winter"
        },
        {
            "text": "In the Local Digital Declaration, we outline our commitment to ‘creating the conditions for genuine organisational transformation to happen’. To support this commitment, we delivered the first of many Digital and Agile for Local Government training courses in late November and mid-December. The two-day virtual training course, facilitated by NobleProg (UK) Ltd, provides a deeper understanding of agile and digital in a local government context through interactive sessions and exercises. Due to the high interest we received, further courses will take place between January and June 2023. "
        },
        {
            "text": "As the year comes to an end, we’re delighted to have concluded many successful projects from the Local Digital Fund Round 5 during 2022. These include:"
        },
        {
            "text": "Continue to read our fortnightly Sprint Notes to hear how the remaining projects are progressing. "
        },
        {
            "heading": 2,
            "text": "What’s next for Local Digital in 2023"
        },
        {
            "text": "During 2023 we will continue our dedication to deliver more user-centred, cost-effective local public services through open, collaborative and reusable work. There will be a range of partnership and funding opportunities, including further opportunities to join Future Councils in 2023, as well as increased training offers and events."
        },
        {
            "text": "You can follow our progress, be the first to hear about new opportunities and stay in touch with our plans via the DLUHC Digital Blog, as well as our other channels:"
        }
    ]
}