{
    "url": "https://companieshouse.blog.gov.uk/2022/12/20/preparing-for-the-festive-season-with-your-accountant/",
    "title": "Preparing for the festive season with your accountant",
    "authors": [
        "David Tattersall - Handpicked Accountants"
    ],
    "categories": [
        "Company guidance"
    ],
    "pub_date": "2022-12-20T11:07:54+00:00",
    "content": [
        {
            "text": "It’s easy to put your directorial responsibilities on the backburner now that festive preparations are in full steam."
        },
        {
            "text": "The peak December filing period is here, and as a company director it’s your responsibility to file your company’s accounts by your deadline if they are due this month. This is shortly followed by your self assessment tax return deadline with HM Revenue & Customs (HMRC) on 31 January."
        },
        {
            "text": "If you’re a new company director, you may not be familiar with your separate filing responsibilities with both Companies House and HMRC, and how to balance them between yourself and your accountant. In this blog post, we’ll provide a brief rundown of what your accountant expects of you, and your legal responsibilities as a limited company director."
        },
        {
            "heading": 2,
            "text": "Filing responsibilities for new company directors "
        },
        {
            "text": "As a starting point, it’s your legal responsibility to keep company records and report any changes to Companies House throughout the accounting period."
        },
        {
            "text": "You may choose to pay an accountant to manage the financial affairs of your business and act as an agent for your company when dealing with HMRC, but you remain legally responsible for submitting statutory information."
        },
        {
            "text": "When running a limited company, your filing responsibilities as a company director include:"
        },
        {
            "text": "If you fail to keep on top of your duties as a company director, you could be fined, prosecuted, and disqualified from being a company director."
        },
        {
            "heading": 2,
            "text": "Filing responsibilities for dormant companies"
        },
        {
            "text": "At Companies House, a dormant company means it’s had no ‘significant accounting transactions’ during the accounting period. Even if your company is dormant or is currently not trading, you must still comply with certain statutory filing requirements."
        },
        {
            "text": "Although HMRC may not require a company tax return once it is listed as dormant, the filing requirements with Companies House are different. All companies must deliver annual accounts and a confirmation statement to Companies House each year - even if the company is dormant, has received no income, and the directors have no immediate intentions of resuming trading with the company."
        },
        {
            "text": "As long as dormant accounts are filed on time, there is no cost to the company. It is only once the deadline is breached that late filing penalties are charged. Repeated failure to file accounts can be seen as a serious breach of the legal duties of a company director and the company could be struck off the Companies House register."
        },
        {
            "heading": 2,
            "text": "Appointing an accountant "
        },
        {
            "text": "Many company directors may excel in the day-to-day running and operating of their business, but filing their accounts and other statutory information with Companies House is not their forte. This is why many directors will outsource these duties to a trusted third party, such as an accountant."
        },
        {
            "text": "You can appoint an accountant to manage the financial affairs of your business and act as a tax agent for your company to deal with HMRC on your behalf."
        },
        {
            "text": "It's important to remember that even if you appoint an accountant in this way, it is you as company director who will remain legally responsible for submitting statutory information accurately and on time. If an accountant fails to meet the deadline, or submits inaccurate information, it's the company director who will be held ultimately responsible for this breach."
        },
        {
            "text": "To help your accountant prepare your company tax return, you’ll need to provide them access to up to date information about your company, such as:"
        },
        {
            "text": "If you fail to provide additional information when requested, your tax return may be filed late, which could result in a penalty from HMRC. You must retain records for 6 years from the end of the last company financial year that they relate to."
        }
    ]
}