{
    "url": "https://defrafarming.blog.gov.uk/2022/12/20/the-next-steps-for-the-sfi-annual-health-and-welfare-review/",
    "title": "The next steps for the SFI annual health and welfare review",
    "authors": [
        "Martin Jenkins"
    ],
    "categories": [
        "A view from the farm",
        "environmental land management schemes",
        "Payments to improve animal health and welfare"
    ],
    "pub_date": "2022-12-20T09:15:45+00:00",
    "content": [
        {
            "text": "The SFI annual health and welfare review is a fully funded vet visit which farmers can receive each year."
        },
        {
            "text": "Together with co-design colleagues, I recently blogged about the co-design process behind the vet visits. "
        },
        {
            "text": "With the help of volunteer farmers and vets, we started testing the review in September. "
        },
        {
            "text": "In this post, I’ll share what we learned from the testing. I’ll also share our plans to launch the scheme in January 2023. "
        },
        {
            "heading": 2,
            "text": "Review recap "
        },
        {
            "text": "The SFI annual health and welfare review is the first step of the Animal Health and Welfare Pathway. "
        },
        {
            "text": "Through the review, farmers who keep cattle, sheep and pigs can get funding to pay for a yearly vet visit. "
        },
        {
            "text": "During the review, a vet of the farmer's choice, will carry out diagnostic testing and provide bespoke advice to improve the health and welfare of their animals."
        },
        {
            "text": "The review is designed to:"
        },
        {
            "text": "Vets will also signpost farmers to other financial support to improve the health and welfare of their animals. "
        },
        {
            "text": "GOV.UK is the best place to find out more details on:"
        },
        {
            "heading": 2,
            "text": "Testing the experience "
        },
        {
            "text": "In July this year, we asked farmers and vets to help us understand what the experience of participating in a review was like in practice. As with all our schemes, we want to make sure that our ideas work on farms and genuinely support farmers. "
        },
        {
            "text": "In September, they began to test the application process."
        },
        {
            "text": "They told us that a simple but tailored approach for each farm is the best way to help busy vets and farmers to make the yearly vet visit a part of their routine."
        },
        {
            "text": "One of our testers was Edward. Edward is a tenant farmer on 800 acres of land in the south-east, where he keeps a mix of cattle, sheep and pigs."
        },
        {
            "text": "While running a busy business supplying directly to farm shops, he is committed to maintaining a high standard of health and welfare on his farm."
        },
        {
            "text": "However, in a challenging environment for farm business, sometimes farmers have to make difficult decisions about how to spend their money."
        },
        {
            "text": "Edward keeps a small herd of pigs. Compared to other parts of his business it can be a struggle to make them profitable. That makes it hard to prioritise spending on his animals, which is a source of real frustration. "
        },
        {
            "text": "By applying for the SFI annual health and welfare review, he was able to access £684 to fund a vet visit to review the health and welfare of his pigs."
        },
        {
            "text": "Edward chose his regular vet for the review. They spent a couple of hours walking around the farm, observing the herd and discussing aspects of their health and welfare to prioritise."
        },
        {
            "text": "Edward and his vet didn’t work to a tick-list because maintaining flexibility was identified as an important feature in the design of the visits."
        },
        {
            "text": "They decided between themselves where to focus the discussion. They carried out sampling to test for the presence of Porcine Reproductive and Respiratory Syndrome in the herd. "
        },
        {
            "text": "After the visit, Edward received a report that set out the health and welfare priorities to focus on with his pigs, and advice on the steps to take."
        },
        {
            "text": "He told us: “I found this vet visit invaluable because it gave me an opportunity to write a health plan for the herds that aren’t as profitable for me”."
        },
        {
            "text": "The review is an opportunity for eligible livestock farmers to access funding to overcome these kinds of barriers."
        },
        {
            "text": "We asked the farmers who participated in our first round of testing if they would recommend the review to others. 83% said they would. This is a really encouraging start. "
        },
        {
            "text": "We'll continue to develop the reviews based on the experiences of farmers and vets. "
        },
        {
            "heading": 2,
            "text": "The vet perspective"
        },
        {
            "text": "Tom is a vet who works in Yorkshire. With a farmer, he carried out a review of a sheep flock."
        },
        {
            "text": "He told us that by participating in a review, he’d been able to visit that particular farm for the first time. "
        },
        {
            "text": "By having that time to have an open conversation with the farmer, he learnt about their business and what they would like to achieve with the health and welfare of their animals."
        },
        {
            "text": "He said would recommend the review to other vets, particularly as an opportunity to build these new relationships and start conversations with farmers in the local area."
        },
        {
            "heading": 2,
            "text": "Learn more"
        },
        {
            "text": "In this video, Stewart Houston CBE, gives an overview of the Animal Health and Welfare Pathway."
        },
        {
            "text": "In this video, James Russell, Senior Vice President of the British Veterinary Association and I explain what the Animal Health and Welfare Pathway is and what it will mean for vets in England."
        },
        {
            "text": "Read the transcript."
        },
        {
            "heading": 2,
            "text": "Expansion in 2023 "
        },
        {
            "text": "We're preparing to open the review up to all eligible keepers in January 2023."
        },
        {
            "text": "With the help of people like Edward and Tom, we’re learning what works well and we can improve. This means the service will continue to develop over time. "
        },
        {
            "text": "We'll keep you updated on our progress, so subscribe to the Future Farming blog for updates."
        },
        {
            "text": "If you have any questions about our approach, do comment below."
        }
    ]
}