{
    "url": "https://insidehmcts.blog.gov.uk/2024/10/01/bridging-gaps-how-mediation-supports-parties-in-small-claims-cases/",
    "title": "Bridging gaps – how mediation supports parties in small claims cases ",
    "authors": [
        "Julia Hopkins"
    ],
    "categories": [
        "Civil",
        "General",
        "User experience and research"
    ],
    "pub_date": "2024-10-01T11:38:22+01:00",
    "content": [
        {
            "text": "[English] - [Cymraeg]"
        },
        {
            "text": "Getting into a dispute with another person or an organisation can be stressful and it may be difficult to see a way forward.  "
        },
        {
            "text": "Our Small Claims Mediation Service has been running for 15 years and we help parties to reach an agreement in a wide variety of cases without the need for a court hearing. "
        },
        {
            "text": "We have seen more cases than ever before being solved away from court through our free, one-hour mediation session so we have recruited more mediators to match the demand for telephone appointments. "
        },
        {
            "heading": 2,
            "text": "Making a difference "
        },
        {
            "text": "I have recently sat with some of our mediators and, with permission, listened in to a few of the cases they have helped to resolve over the phone. I was impressed with their empathy and understanding and it’s clear to me that mediation appointments are having a positive impact on peoples’ lives while freeing up valuable court time. "
        },
        {
            "text": "While every resolution is important, there are certain cases which stand out for our mediators, who take great pride in making a real difference to the lives of those using the service. "
        },
        {
            "text": "For example, one of our mediators told me about a case where an elderly female motorist was in dispute over a parking fine and was concerned about paying a large lump sum, or having to face going to court to settle the matter. After speaking to both parties, the mediator helped the driver and parking company come to an agreement which would see her pay in manageable installments. Her relief, he remembers, was palpable.  "
        },
        {
            "text": "In another case, a woman had employed a builder to carry out work on her roof but he was unable to finish the project due to illness and bereavement. Both parties were happy to take part in mediation and were pleasantly surprised to resolve their dispute in this way, as they had been prepared to go to court and had made it clear that they would not have been prepared to speak to each other before the hearing date. "
        },
        {
            "text": "Mediation is now an integral part of the small claims process for cases involving a money dispute under £10,000 for those who have made a new civil court claim on paper or through our traditional online systems.   "
        },
        {
            "heading": 2,
            "text": "Extending the service "
        },
        {
            "text": "By the end of the year, the requirement to mediate will be extended to include claims made via our new Online Civil Money Claims Service. "
        },
        {
            "text": "We have made preparations to ensure the Small Claims Mediation Service is ready for the increase in appointments. We have recruited and trained an extra 10 administrative staff to manage the increased referrals and 39 mediators, who have undergone specialised training in negotiation and listening, spending time working alongside experienced mediators to hone their skills before conducting appointments alone. "
        },
        {
            "text": "We also consider reasonable adjustments, such as arranging a text-to-speech service for users with hearing difficulties, with the mediation team happy to discuss ways to make appointments as accessible as possible for those taking part. "
        },
        {
            "text": "Feedback we have received from users is a testament to how well the service is going, with many people getting in touch to tell us they found the process easy and stress-free. I know the team is proud to receive feedback such as;"
        },
        {
            "text": "Between April and June 2024, almost 50 people got in touch to share positive feedback of using the service. "
        },
        {
            "text": "Our Smalls Claims Mediation Service has been formally recognised for its success, recently scooping the Operational Delivery Award at our 2024 HMCTS award ceremony. The accolade acknowledges staff who support frontline services and who have achieved exceptional performance, customer focus, collaborative teamwork and exemplary leadership. "
        },
        {
            "text": "By the end of 2024, mediation will be more accessible than ever before for those involved in small claims money cases and I look forward to our mediators helping to resolve a record number of cases. "
        },
        {
            "heading": 2,
            "text": "Further information "
        },
        {
            "text": "You can find out more about the Small Claims Mediation Service by listening to our podcast, watching our video about what to expect from an appointment, or reading our recent blog. "
        },
        {
            "text": "[English] - [Cymraeg]"
        },
        {
            "heading": 1,
            "text": "Llenwi bylchau – sut mae cyfryngu yn cefnogi partïon mewn achosion hawliadau bychain"
        },
        {
            "text": "Gall mynd i anghydfod ag unigolyn arall neu sefydliad fod yn straen a gall fod yn anodd gweld ffordd ymlaen."
        },
        {
            "text": "Mae ein Gwasanaeth Cyfryngu Hawliadau Bychain wedi bod yn mynd rhagddo ers 15 mlynedd ac rydym yn helpu partïon i ddod i gytundeb mewn amrywiaeth eang o achosion heb fod angen gwrandawiad llys."
        },
        {
            "text": "Rydym wedi gweld mwy o achosion nag erioed o'r blaen yn cael eu datrys y tu allan i'r llys drwy ein sesiwn gyfryngu am ddim sy’n para awr, felly rydym wedi recriwtio mwy o gyfryngwyr i gyfateb i'r galw am apwyntiadau dros y ffôn. "
        },
        {
            "heading": 2,
            "text": "Gwneud gwahaniaeth"
        },
        {
            "text": "Rwyf wedi eistedd gyda rhai o'n cyfryngwyr yn ddiweddar a, gyda chaniatâd, wedi gwrando ar rai o'r achosion y maent wedi helpu i'w datrys dros y ffôn. Gwnaeth eu hempathi a'u dealltwriaeth argraff arnaf ac mae'n amlwg i mi fod apwyntiadau cyfryngu yn cael effaith gadarnhaol ar fywydau pobl wrth ryddhau amser gwerthfawr yn y llys."
        },
        {
            "text": "Er bod pob penderfyniad yn bwysig, mae rhai achosion sy'n sefyll allan i’n cyfryngwyr, sy'n ymfalchïo'n fawr mewn gwneud gwahaniaeth gwirioneddol i fywydau'r rhai sy'n defnyddio'r gwasanaeth."
        },
        {
            "text": "Er enghraifft, dywedodd un o'n cyfryngwyr wrthyf am achos lle'r oedd modurwr benywaidd oedrannus mewn anghydfod ynghylch dirwy parcio a'i bod yn poeni am dalu cyfandaliad mawr, neu orfod wynebu mynd i'r llys i setlo'r mater. Ar ôl siarad â'r ddwy ochr, helpodd y cyfryngwr y gyrrwr a'r cwmni parcio i ddod i gytundeb a fyddai'n golygu ei bod yn talu mewn rhandaliadau y gellir eu rheoli. Roedd ei rhyddhad, mae'n cofio, yn amlwg."
        },
        {
            "text": "Mewn achos arall, roedd menyw wedi cyflogi adeiladwr i wneud gwaith ar ei tho ond nid oedd yn gallu gorffen y prosiect oherwydd salwch a phrofedigaeth. Roedd y ddwy ochr yn hapus i gymryd rhan mewn cyfryngu ac roeddent wedi’u synnu eu bod wedi gallu datrys eu hanghydfod fel hyn, gan eu bod wedi bod yn barod i fynd i'r llys ac wedi ei gwneud yn glir na fyddent wedi bod yn barod i siarad â'i gilydd cyn dyddiad y gwrandawiad."
        },
        {
            "text": "Mae cyfryngu bellach yn rhan annatod o'r broses hawliadau bychain ar gyfer achosion sy'n ymwneud ag anghydfod ariannol o dan £10,000 i'r rhai sydd wedi gwneud hawliad newydd yn y llys sifil ar bapur neu drwy ein systemau ar-lein traddodiadol."
        },
        {
            "heading": 2,
            "text": "Ehangu'r gwasanaeth"
        },
        {
            "text": "Erbyn diwedd y flwyddyn, bydd y gofyniad i gyfryngu yn cael ei ymestyn i gynnwys hawliadau a wneir drwy ein gwasanaeth Hawliadau am Arian yn y Llys Sifil Ar-lein newydd."
        },
        {
            "text": "Rydym wedi gwneud paratoadau i sicrhau bod y Gwasanaeth Cyfryngu Hawliadau Bychain yn barod ar gyfer y cynnydd mewn apwyntiadau. Rydym wedi recriwtio a hyfforddi 10 o staff gweinyddol ychwanegol i reoli'r atgyfeiriadau cynyddol a 39 o gyfryngwyr, sydd wedi cael hyfforddiant arbenigol mewn cynnal trafodaethau a gwrando, gan dreulio amser yn gweithio ochr yn ochr â chyfryngwyr profiadol i ddatblygu eu sgiliau cyn cynnal apwyntiadau ar eu pennau eu hunain."
        },
        {
            "text": "Rydym hefyd yn ystyried addasiadau rhesymol, megis trefnu gwasanaeth cofnodwr iaith lafar i destun i ddefnyddwyr ag anawsterau clyw, gyda'r tîm cyfryngu yn hapus i drafod ffyrdd o wneud apwyntiadau mor hygyrch â phosibl i'r rhai sy'n cymryd rhan. Mae’r adborth a gawsom gan ddefnyddwyr yn dyst i ba mor dda y mae'r gwasanaeth yn mynd, gyda llawer o bobl yn cysylltu i ddweud wrthym eu bod yn teimlo bod y broses yn hawdd ac yn ddi-straen. Rwy'n gwybod bod y tîm yn falch o dderbyn adborth fel;"
        },
        {
            "text": "Rhwng mis Ebrill a mis Mehefin 2024, cysylltodd bron i 50 o bobl i rannu adborth cadarnhaol o ddefnyddio'r gwasanaeth."
        },
        {
            "text": "Mae ein Gwasanaeth Cyfryngu Hawliadau Bychain wedi cael ei gydnabod yn ffurfiol am ei lwyddiant, gan gipio'r Wobr Cyflawni Gweithredol yn ddiweddar yn ein seremoni wobrwyo GLlTEF 2024. Mae'r wobr yn cydnabod staff sy'n cefnogi gwasanaethau rheng flaen ac sydd wedi cyflawni perfformiad eithriadol, ffocws ar gwsmeriaid, gwaith tîm cydweithredol ac arweinyddiaeth rhagorol."
        },
        {
            "text": "Erbyn diwedd 2024, bydd cyfryngu yn fwy hygyrch nag erioed o'r blaen i'r rhai sy'n ymwneud ag achosion arian hawliadau bychain ac edrychaf ymlaen at weld ein cyfryngwyr yn helpu i ddatrys y nifer uchaf erioed o achosion."
        },
        {
            "heading": 2,
            "text": "Rhagor o wybodaeth"
        },
        {
            "text": "Gallwch ddarganfod mwy am y Gwasanaeth Cyfryngu Hawliadau Bychain trwy wrando ar ein podlediad, gwylio ein fideo am beth i'w ddisgwyl yn yr apwyntiad, neu ddarllen ein blog diweddaraf. "
        }
    ]
}