{
    "url": "https://mhclgdigital.blog.gov.uk/2024/10/01/design-delivery-and-determinism-reflections-on-the-sdingov-conference-2024/",
    "title": "Design, delivery, and determinism: reflections on the SDinGov conference 2024 ",
    "authors": [
        "Dominic Berry, Senior User Researcher, Common Tools as a Service team"
    ],
    "categories": [
        "Design",
        "Innovation"
    ],
    "pub_date": "2024-10-01T12:55:53+01:00",
    "content": [
        {
            "text": "I have written this post with two audiences in mind. First, fellow travellers in the world of service design who might want to know more about this conference, in case they are considering going in future. Second, colleagues in the Ministry of Housing, Communities and Local Government (MHCLG) who are perhaps not too connected with service design, but who want to know what those people do all day.  "
        },
        {
            "text": "My own background has focused on research rather than design, so I entered the conference as a curious insider-outsider, and my thoughts will reflect that position.  "
        },
        {
            "heading": 2,
            "text": "The participants "
        },
        {
            "text": "Speakers included public servants and civil servants working in service or policy design, representatives of service design consultancies with experience working in or for government, and in some cases also the ‘clients’ of service design – product owners or departmental heads who commissioned a service design project.  "
        },
        {
            "heading": 3,
            "text": "Services as a journey "
        },
        {
            "text": "The 3 keynotes served a nice range of interests. Rachel Coldicutt, a technology strategist and researcher, explained why we might need to think about services as a journey. This meant services should be designed to go and meet potential users wherever they are at, rather than sitting at a centre-point and waiting for users to come to them.  "
        },
        {
            "heading": 3,
            "text": "Preserving co-design "
        },
        {
            "text": "KA McKercher, a co-design expert and teacher working in Australia, provided a guide to ensuring your co-design efforts do not fail, particularly by not thinking co-design means only one thing, or that co-design cannot exist alongside other participatory methods.  "
        },
        {
            "heading": 3,
            "text": "Designing democracy "
        },
        {
            "text": "Finally, Whitney Quesenbery gave a rapid run-through of the 25 years of service design work she has been doing in the United States to ensure that voters can actually vote. This ranged across everything from the design of ballot papers, to voting booths, to possible futures of electronic voting, and much more besides.   In-between sessions I spoke with: Anne-Louise, head of a new service design team working for local authorities in Yorkshire; Sophie, a designer working on health services at a university hospital in London; Joe, a student in Scotland completing a User Experience (UX) Masters degree; and Ian, Head of Department for Service Design at a nearby university. I also of course got to meet some of my MHCLG colleagues for the first time (I only joined in September) and even hear about some of the design work that has taken place in the department in recent years.  "
        },
        {
            "heading": 2,
            "text": "Designing a modern planning system "
        },
        {
            "text": "If I wasn’t so new to MHCLG, I probably would not have attended Matt Wood-Hill’s talk, on the grounds that you don’t go all the way to Edinburgh to learn about something happening where you work! It was a great opportunity to hear from Matt, who is Head of Digital Planning Software, about what service design looks like at the department in a high-profile policy area such as planning.  "
        },
        {
            "text": "The talk was about activities currently intended to reform the planning system. There are lots of things that were impressive about this presentation on the Open Digital Planning (ODP) community (which is funded by MHCLG’s Digital Planning programme), but what stood out for me was the use of government resources to:  "
        },
        {
            "text": "The new software packages (PlanX) created by members of the ODP community are already being used by some local planning authorities, with others gearing up to launch their services soon. The ambition is to make the work of planners and planning teams much easier, speeding up planning decisions.  "
        },
        {
            "text": "On the second day, I was also able to hear from a consultancy working on the Back Office Planning System (BOPS) within ODP. The BOPS case study allowed us to evaluate ODP from the other side, to understand how third-party designers, government designers, and local government can all work together to solve large complex problems. It would have been great to hear from one of the collaborating local authorities themselves, to pick up on any differences in their own perspective, but we can’t have everything!  I am informed that there are regular public show and tell sessions so we can all follow the progress there. "
        },
        {
            "heading": 2,
            "text": "Artificial intelligence "
        },
        {
            "text": "From start to finish artificial intelligence (AI) was a very prominent feature throughout the 3 days. While Coldicutt struck a cautious tone in her keynote (one of her slides contained the slogan ‘FOMO is not a strategy’, coined with AI hype in mind), for most speakers AI was presented as a natural part of their design interests.  "
        },
        {
            "text": "Some took a worryingly deterministic attitude – the phrase “AI is not on the horizon, it is already here” was uttered by more than a couple of participants. I was not very keen on this framing, as to me it suggested these speakers wanted to divest themselves of responsibility for understanding AI and its limitations or risks, preferring to become a strong ally to this… what should we call it? Tool? Technology? Service solution? Alternative to service design? Perhaps all of the above.  "
        },
        {
            "text": "It was definitely interesting to see what ChatGPT could do to existing government content provided it was instructed to follow GOV.UK design and formatting, though again for myself this became a way to advocate for the use of content designers more widely throughout government rather than a reason to filter everything in GOV.UK through a Large Language Model.  "
        },
        {
            "text": "It appears that chat bots and AI search engines might become an increasingly visible part of the services we all engage in, at least for the next few years. I will be giving particular attention to user experiences with such technologies for the Managing Local Conversations project within the Common Tools as a Service team. The conference has inevitably helped shape how I think about AI’s strengths and limitations.  "
        },
        {
            "text": "That’s all I can squeeze in. If you would like to know more about anything in this post, or receive a list of the literature recommendations that I collected, please get in touch: Dominic.Berry@communities.gov.uk."
        }
    ]
}