{
    "url": "https://socialcare.blog.gov.uk/2024/10/01/empowering-diversity-in-the-social-care-celebrating-black-history-month/",
    "title": "Empowering diversity in social care: celebrating Black History Month",
    "authors": [
        "Olu Ogunbuyide"
    ],
    "categories": [
        "Carers",
        "Communities",
        "Diversity",
        "Innovation",
        "Technology and data",
        "Uncategorised"
    ],
    "pub_date": "2024-10-01T07:00:00+00:00",
    "content": [
        {
            "text": "As we celebrate Black History Month, it’s important to reflect on the rich history and achievements of black professionals across health and social care. It also gives us time to reflect on the ongoing need to create more inclusive and equitable opportunities within organisations, teams, spaces and communities - particularly in the rapidly evolving field of digital in social care."
        },
        {
            "heading": 2,
            "text": "Diversity and digital transformation"
        },
        {
            "text": "Social care is currently undergoing a digital revolution. Technologies such as digital social care records, data analytics and artificial intelligence have revolutionised how care is delivered, making it more person-centred, efficient, responsive and timely."
        },
        {
            "text": "However, these changes demand a skilled digital workforce capable of prescribing, using and leveraging tech to improve outcomes for those who draw on care. These needs also highlight gaps in representation, particularly for black professionals and women of colour."
        },
        {
            "text": "Ensuring diversity in the digital workforce is crucial for stimulating innovation and ensuring equitable care for our diverse communities."
        },
        {
            "heading": 2,
            "text": "Addressing barriers to inclusion"
        },
        {
            "text": "Data from Skills for Care (2023) reveals that 14% of sector employees are black, 9% Asian and 2% of mixed ethnicity. These figures roundup to a quarter of the workforce being from an ethnic minority background. Likewise, international employees make up 19% of the adult social care workforce, meaning one in five workers in England are non-UK citizens. ."
        },
        {
            "text": "Despite being in a diverse industry, black professionals (especially women) continue to face barriers in entering and advancing in the digital space. Examples include underrepresentation in leadership roles and limited access to mentorship and development opportunities. These obstacles must be dismantled to create a more inclusive workforce that reflects the diversity of the population it serves."
        },
        {
            "text": "The Shuri Network, established in 2019, is the first NHS and care network of women from minority ethnic groups in digital health and social care. It provides networking, mentorship, coaching, and professional development opportunities. It also provides the Digital Fellowship which equips women of colour with tools, training, and support needed for leadership roles."
        },
        {
            "text": "This initiative builds our skills and offers a sense of belonging and representation in an industry that has long lacked diversity. Thanks to the network, I received a bursary to attend the Digital Health Summer School and became one of the first cohort of Social Care Digital Fellows."
        },
        {
            "heading": 2,
            "text": "Looking ahead - building an inclusive future"
        },
        {
            "text": "Part of Black History Month is the celebration of those who have broken barriers in the past. However, we must also look to the future and acknowledge the work that remains to be done. I would like to encourage you to join initiatives like the Shuri Network either as a member or an ally because itis crucial in building a digital workforce that is not only skilled, diverse and dynamic but also representative of the communities it serves.By supporting diversity and inclusion in social care, we can ensure that the digital transformation and revolution benefits everyone. We must ensure that future generations of black professionals and women of colour have the opportunities they deserve to lead, transform and innovate in our organisations."
        }
    ]
}