{
    "url": "https://gott.blog.gov.uk/2024/10/01/whats-next-for-the-government-office-for-technology-transfer/",
    "title": "What’s next for the Government Office for Technology Transfer?",
    "authors": [
        "riannastone1"
    ],
    "categories": [
        "Uncategorized"
    ],
    "pub_date": "2024-10-01T08:38:16+01:00",
    "content": [
        {
            "text": "Blog by Dr Alison Campbell, CEO of GOTT"
        },
        {
            "text": "Looking back on the last 2 and a half years that I’ve been leading the organisation, I am really proud of how far GOTT has come and most importantly, the impact we have had supporting the public sector to identify, protect and exploit its Knowledge Assets. At the time, the term “Knowledge Assets” was quite novel, covering intellectual property and other intangible assets such as data and know-how. I quickly found that it resonated well with many in the public sector who feel that their stock in trade is the creation of new knowledge. It’s encouraging to see this language is now beginning to be recognised more broadly."
        },
        {
            "text": "As GOTT, we’ve gone from a small unit focused on building the foundations and establishing a team to a confident and maturing one that is getting good traction across our public sector client base. We’ve developed our support services to help identify and develop promising Knowledge Assets and to upskill potential innovators, offering advice, hands-on support and access to a developing suite of guidance documents. We now have a catalogue of over 200 Knowledge Assets and we’ve funded over 130 proof of concept projects in more than 40 organisations in areas as diverse as health, defence, museums and the environment. "
        },
        {
            "text": "We’re helping leading public sector organisations to develop a joined-up Knowledge Asset Management Strategy and have created a cross-government “Knowledge Asset Network” which has grown to over 200 members. But don’t just take my word for it. I am pleased to share an independent report published today that provides good evidence of how GOTT is helping to drive innovation in the public sector for the benefit of the citizen and economy. The findings underline the value of Knowledge Asset exploitation and confirms GOTT’s important role in driving change in the way in which the government’s Knowledge Assets are managed. Looking at the design and delivery of GOTT, the report shows the progress made towards realising early outcomes. It recognises that it’s still early days and that the task is long-term and gives confidence that we can build on a really good start."
        },
        {
            "text": "So, what's next for GOTT? Firstly, more of the same. We know how well our grant funding and tech transfer support has been received. There’s been great interest in learning through our recently launched skills programmes and through peer-to-peer support through the Knowledge Asset Network and our events. Our guidance has been co-developed with valued stakeholders and we have more in the pipeline, responding to where the greatest demand lies."
        },
        {
            "text": "Knowledge Asset management is an important contributor to the government’s economic growth mission. Getting Knowledge Assets created in the public sector developed and out to the market helps stimulate productivity and growth, creating and retaining high quality jobs and enabling more people to benefit from the fantastic innovations coming out of government. To support this objective, our work will have a greater focus on the commercialisation of Knowledge Assets. We’re looking at additional ways that we can enhance the support we offer, helping to increase Knowledge Assets. To learn more as we move forward, you can stay in touch with news by subscribing to our newsletter."
        },
        {
            "heading": 4,
            "text": "Get in touch"
        },
        {
            "text": "If you work in the public sector and would like to speak to our team about how we can help you harness your Knowledge Assets, get in touch."
        }
    ]
}