{
    "url": "https://insidedio.blog.gov.uk/2015/06/01/introducing-david-mitchard-dios-chief-executive/",
    "title": "Introducing David Mitchard, DIO's Chief Executive",
    "authors": [
        "David Mitchard"
    ],
    "categories": [
        "Communications"
    ],
    "pub_date": "2015-06-01T15:16:40+00:00",
    "content": [
        {
            "text": "I’m David Mitchard and I’m DIO’s new Chief Executive. I’ve been here for about four weeks now and I’m really enjoying getting to grips with the wide range of DIO’s responsibilities and activities."
        },
        {
            "text": "DIO Chief Executive, David Mitchard.[Crown Copyright/MOD2015]I’ve spent my time meeting colleagues, customers and ministers, including hosting a visit to our Sutton Coldfield HQ today by Mark Lancaster MP, the new minister for Defence Personnel and Veterans. I have also been receiving briefings and visiting some of our key sites, but of course there’s always more to learn."
        },
        {
            "text": "Background"
        },
        {
            "text": "I do have a background of working with the military, which means I’m not coming from a standing start. I spent seven years as Managing Director of AirTanker Services, which owns, maintains and operates the RAF’s Voyager aircraft. Voyager is a multifunctional plane which can be used for air-to-air refuelling, transport of personnel and equipment, medical evacuation and more. Prior to that I spent six years as managing director of Flagship Training which had a partnering arrangement with the Royal Navy to help run its training estate. This involved training, delivery, construction projects and facilities management."
        },
        {
            "text": "My first impressions of DIO are that it is a large and complex business which is integral to supporting the delivery of core defence outputs. The Strategic Business Partner approach appears to be settling in well and delivering improvements. I’m delighted to have been given the opportunity to lead such a strategically important operation."
        },
        {
            "text": "DIO's Major Projects"
        },
        {
            "text": "As we’re now nearly halfway through the year, it is a good time to provide an update on some of DIO’s major projects. Project WINFRA, which is working to prepare RNAS Yeovilton to be the base of the Royal Navy and the Army’s Wildcat helicopter fleet, recently marked a milestone with the completion of the first new building. Other ongoing work under the project includes a new mess building, a fitness suite, dental centre, Quartermaster’s stores and refurbishing the existing medical building."
        },
        {
            "text": "Work at Beacon Barracks in Stafford continues apace. Two Royal Signals regiments are on track to relocate to the site in the autumn. The new facilities being prepared for them, including garaging, a gym, accommodation, office blocks and a Regimental HQ, are well on track."
        },
        {
            "text": "The Regimental HQ at Beacon Barracks nearing completion. [Crown Copyright/MOD2015]The first tranche of work at the Defence College of Technical Training in Lyneham is scheduled to be completed at about the same time."
        },
        {
            "text": "Of course this is the tip of the iceberg in terms of the amount of work going on across the estate but it’s good to be able to report positive progress."
        },
        {
            "text": "Priorities"
        },
        {
            "text": "My priorities for the coming weeks and months are to continue to build by understanding of all the dynamics of DIO’s operations and to use this and any previous experiences to implement initiatives to further improve operational performances. In parallel, I intend to engage positively with the customer community to ensure their requirements are understood and that we’re working collaboratively together to meet them"
        },
        {
            "text": "I look forward to reporting back in the coming months on the progress we are making."
        }
    ]
}