{
    "url": "https://ipo.blog.gov.uk/2025/04/04/24-carrot-genius-young-inventors-take-the-wheel/",
    "title": "24 Carrot genius: young inventors take the wheel",
    "authors": [
        "Christina Watts",
        "Lauren Brobin"
    ],
    "categories": [
        "Innovation",
        "Patents",
        "Schools",
        "Trade secrets",
        "Uncategorized"
    ],
    "pub_date": "2025-04-04T10:00:00+01:00",
    "content": [
        {
            "text": "Hold onto your gardening gloves! It's not just National Carrot Day, it's a celebration of one of nature's most underrated geniuses! We all know these vibrant orange wonders are delicious (crunchy, sweet, versatile, need I say more?), but prepare to be amazed at the carrot's secret identity as a catalyst for creativity and innovation!"
        },
        {
            "text": "Our IPO Education Campaign Team has been working with the extraordinary YouTube channel team, Kids Invent Stuff (KIS), to bring children's imaginative inventions to life. If you haven’t guessed it already, one of those inventions is a remarkable Seed-firing Carrot Car. "
        },
        {
            "heading": 3,
            "text": "Nurturing Young Inventors "
        },
        {
            "text": "Since 2020, our IPO Education team has joined forces with these dynamic educational influencers to spark imagination through various invention challenges, each one nurturing the seedlings of creativity in young innovators across the UK. "
        },
        {
            "text": "KIS is hosted by engineers Ruth and Shawn who, in fun-packed programmes, demonstrate how they can turn 4-11 year olds' invention ideas into reality. This creative platform not only inspires children to think like inventors but also introduces them to fundamental concepts of intellectual property (IP) in a fun and accessible way, through competition worksheets and IP segments in their YouTube build videos. "
        },
        {
            "heading": 3,
            "text": "Innovation takes root "
        },
        {
            "text": "Perhaps the most appropriate invention to highlight on National Carrot Day is Alia's \"Seed-firing Carrot Car,\" which came to life in May 2022. This remarkable creation was designed by 10-year-old Alia for our IPO's Cracking Ideas competition in partnership with Aardman Animations and Kids Invent Stuff. The 2021/2022 competition challenged children aged 4-11 to help Wallace and Gromit get from place to place during their UK tour of innovation. They used creative product design and explored some important parts of the design process to create transportation that’s both fun and kind to the environment.  "
        },
        {
            "text": "The bright orange vehicle wasn't just visually striking – it was functional too! The car could fire seeds while driving, combining environmental awareness with creative engineering. It demonstrated how children's imagination can lead to solutions that address real-world problems like environmental conservation. You can see Alia’s invention in action here [link]: Seed-firing Carrot Car."
        },
        {
            "text": "During the project, KIS introduced young viewers to Dr Mark Lewney, an IPO Senior Patent Examiner, who explained the importance of protecting innovative ideas. Dr Lewney clarified the process of patenting in child-friendly terms, noting that inventors must consider the technical advantage of their invention and think about what makes it truly unique. Check out our full IP chat with Dr Lewney here [link]: Talk with Dr Mark Lewney (Extended Edition) - YouTube."
        },
        {
            "heading": 3,
            "text": "Growing an understanding of IP "
        },
        {
            "text": "The Carrot Car project served as an excellent educational tool, helping children understand that while Alia retained copyright of her original idea, there are different forms of IP protection available to inventors. "
        },
        {
            "text": "Each of these projects has helped children understand concepts like patents, copyright, design registration, and trade marks – all essential components of the intellectual property landscape. "
        },
        {
            "heading": 3,
            "text": "A harvest of creative projects "
        },
        {
            "text": "The Carrot Car is just one example in a fruitful partnership between IPO and Kids Invent Stuff. Other notable inventions have included: "
        },
        {
            "heading": 3,
            "text": "Harvesting the benefits "
        },
        {
            "text": "National Carrot Day reminds us that great ideas can spring from unexpected sources. Just as carrots grow from tiny seeds into nutritious vegetables, children's ideas can develop into meaningful innovations when given the right support and guidance. "
        },
        {
            "text": "Through our work with Kids Invent Stuff, the IPO continues to plant the seeds of creativity, helping young people understand that their ideas have value and can be protected. As we look toward the future, we're excited to see what incredible inventions these young innovators will bring to life next – perhaps inspired by carrots, or by any of the countless everyday objects that spark their boundless imagination!  Make sure to follow our Education Teams on Facebook, Instagram, X, YouTube & sign up to the ‘IP in Education’ newsletter topic to keep up to date with the latest competitions, free teaching resources and events.  "
        }
    ]
}