{
    "url": "https://dcmslibraries.blog.gov.uk/2025/04/04/barnsley-libraries-impact-of-the-libraries-improvement-fund/",
    "title": "Barnsley Libraries - Impact of The Libraries Improvement Fund",
    "authors": [
        "Stephen Miller, Transformation Officer, Barnsley Libraries"
    ],
    "categories": [
        "Case study"
    ],
    "pub_date": "2025-04-04T14:12:07+01:00",
    "content": [
        {
            "text": "The Government has announced that public libraries will soon be able to apply for a share of a share of the £5.5 million Libraries Improvement Fund as part of the Government’s commitment to ensure libraries are able to upgrade their physical and digital infrastructure to adapt to changing user needs and can be enjoyed by future generations."
        },
        {
            "text": "The Libraries Improvement Fund (LIF) will open for expressions of interest on Tuesday 6 May 2025. Full guidance, including eligibility criteria and details of how to apply can be found on Arts Council England’s website. "
        },
        {
            "text": "To mark the publication of the guidance for Round 4, we’re shining a spotlight on some of the completed projects from earlier rounds starting with Barnsley Libraries who were able to upgrade their libraries with the support of LIF funding."
        },
        {
            "text": "Barnsley Libraries"
        },
        {
            "text": "Barnsley Library @ the Lightbox opened in 2019, a state-of-the-art, 4-storey library at the heart of a £180M town centre regeneration project. Building on the success of the launch, Barnsley Council committed £1M to refurbish community libraries across the borough."
        },
        {
            "text": "Following Covid-19 delays the timing and aims of the Libraries Improvement Fund Round One aligned perfectly with Barnsley Libraries ambition. A successful application for the refurbishment of Dodworth Library enabled the transformation of a tired, inflexible, 1960s library into a bright, modern, flexible space with enlarged children’s area and improved energy efficiency. This project demonstrated perfectly the transformation that could be done with a relatively modest investment."
        },
        {
            "text": "When LIF Round Two was announced the Barnsley Libraries Refurbishment Board decided to maximise impact across our libraries by developing an application aimed at boosting the digital infrastructure at all. The successful application enabled the installation of new self-service kiosks and digital noticeboards as well as increasing the amount of ereaders and makerspace equipment for library users."
        },
        {
            "text": "For LIF Round Three an application was developed for the refurbishment of Wombwell Children’s Library, Barnsley’s only Carnegie Library still operating as a library. The space was transformed into a local destination for children, families and schools. Features include a sensory story wall, cosy hideaways, bespoke furniture, tiered soft seating and new shelving. All the new additions were installed whilst preserving the historic character of the building."
        },
        {
            "text": "Anna Hartley, Barnsley Council Cabinet Spokesperson for Public Health and Communities, said, ‘We’re really proud of our local libraries in Barnsley, which act as welcoming hubs that connect our communities. Over the past two years, we’ve been hard at work breathing new life into our branches, improving our library spaces so you can enjoy them for many years to come."
        },
        {
            "text": "‘It is great to see all of Barnsley Libraries’ hard work being recognised with another successful application to the Libraries Improvement Fund. I’m excited to see what’s next for Wombwell Children’s Library thanks to this funding, creating more opportunities for children and young people to fall in love with their local library.’"
        },
        {
            "text": "Barnsley Libraries has utilised LIF and other funding to refurbish nine community libraries since November 2022. Plans for 2025-2026 are in place for three more libraries. LIF has provided the external impetus to match the councils’ ambitions and demonstrate the impact improved libraries can have on visitor numbers, book borrowing and accessing community and digital services."
        }
    ]
}