{
    "url": "https://ofsi.blog.gov.uk/2025/04/04/hsf-moscow-penalty-key-lessons-for-industry/",
    "title": "HSF Moscow Penalty: Key Lessons for Industry ",
    "authors": [
        "OFSI"
    ],
    "categories": [
        "OFSI Blog"
    ],
    "pub_date": "2025-04-04T14:42:08+01:00",
    "content": [
        {
            "text": "On 20 March 2025, OFSI announced a monetary penalty of £465,000 against Herbert Smith Freehills CIS LLP (“HSF Moscow”) for breaches of UK financial sanctions on Russia, linked to its illegal invasion of Ukraine.  "
        },
        {
            "text": "The penalty relates to six payments made by HSF Moscow, with a collective value of £3,932,392.10, to designated persons subject to an asset freeze. The payments, which took place over a period of seven days as the firm wound down its Russian offices, demonstrated a pattern of failings brought about primarily by inadequate due diligence and sanctions screening, and errors caused by the hasty closure of the HSF Moscow office. HSF London, on behalf of HSF Moscow, voluntarily disclosed the breaches to OFSI, and therefore a 50% reduction has been applied to the final penalty amount. "
        },
        {
            "text": "The HSF Moscow penalty carries a number of important compliance messages for industry - not only the legal sector. Below, we have highlighted three key lessons that businesses can draw from this case: "
        },
        {
            "text": "It is essential for firms to understand their exposure to sanctions risks and take appropriate action to address them. Firms operating in higher risk environments, should educate themselves fully on the risks, including by engaging with OFSI’s published guidance, and seeking professional advice on their sanctions obligations where necessary. In particular, parent companies with subsidiaries in areas that pose a heightened sanctions risk (such as offices overseas) should make sure they are providing suitable advice and assurance to their subsidiaries. A prior OFSI penalty against Tracerco in May 2022 also highlighted this risk. "
        },
        {
            "text": "Firms should follow all relevant sanctions screening and due diligence measures they have in place. This applies to everyone in an organisation, regardless of seniority. Whilst OFSI usually considers the existence of appropriate sanctions policies and procedures as a mitigating factor, failure to comply with them is likely to negate the mitigating factor of having them in place. This is unless there was a good reason for not following said measures, and the decision not to follow them was taken at the appropriate level . Further, the HSF Moscow case demonstrates the significant risks that can emerge when payments are made in haste and procedures are not adequately followed by senior figures.  "
        },
        {
            "text": "Firms need to carefully consider ownership and control, beyond just whether an entity is directly subject to sanctions. OFSI views failure to properly consider and identify clear ownership more poorly than an incorrect but good faith assessment of control. Firms should therefore take sufficient time and care to properly assess the applicability of sanctions to the specific legal entities they are dealing with. Ownership and control is considered under case factor F within OFSI’s Enforcement and Monetary Penalties guidance, with examples of areas of enquiry OFSI may expect to be undertaken by persons seeking to establish whether an entity is owned or controlled by a designated person. "
        },
        {
            "text": "Further information and guidance on UK financial sanctions can be found on OFSI’s website."
        }
    ]
}