{
    "url": "https://food.blog.gov.uk/2025/04/04/the-fsa-at-25/",
    "title": "The FSA at 25",
    "authors": [
        "Katie Pettifer, Chief Executive",
        "Professor Susan Jebb, FSA Chair"
    ],
    "categories": [
        "Our mission"
    ],
    "pub_date": "2025-04-04T10:39:27+01:00",
    "content": [
        {
            "text": "Cymraeg"
        },
        {
            "text": "This month marks the 25th anniversary of the FSA and we would like to take this opportunity to thank our partners across the food system for their continuing support and for all they do to uphold trust in food system."
        },
        {
            "text": "Protecting consumers, driving high standards in food safety, and ensuring the authenticity of food have been the FSA’s priorities from the start. In the late nineties, a series of scandals including the BSE crisis, had shaken confidence in UK food. This led the government to establish the FSA as an independent food regulator that would put consumers’ interests first. Since then, we’ve worked closely with the food industry to support them in restoring consumer confidence, ensuring everyone has food we can trust."
        },
        {
            "text": "We’re proud of the impact that the FSA has had in protecting consumers. Our meat inspectors and official veterinarians inspect a billion animals each year, making sure meat is safe in the UK. With our local authority partners, we inspect and assure around 600,000 food businesses across the country. The green and black food hygiene rating stickers now displayed in restaurant and café windows, which we introduced in 2010, enable people to make informed decisions when they eat out, and support businesses who are doing the right thing."
        },
        {
            "text": "We worked closely with industry to implement Natasha's Law in 2021, groundbreaking legislation to protect people with people with food allergies. These rules provide extra protection for the two million people living with allergies, while providing important clarity for businesses about their responsibilities."
        },
        {
            "text": "We’re also supporting innovation in the food industry, making sure that regulation keeps pace with new technology. Precision bred organisms, precision fermentation, and cell cultivated products, like lab grown meat, have the potential to make our food supply healthier and more sustainable. We are building our capability and capacity to regulate these products, so that we support businesses to grow and bring these products safely to market for consumers."
        },
        {
            "text": "The food system has changed radically in the last 25 years, and faces more challenges ahead, from climate change to geopolitical events and the food industry will need to adapt to meet these challenges. The FSA must keep evolving the way we regulate too, but we must never forget that our job, first and foremost, is to protect public health and to uphold the interests of consumers. We look forward to working with businesses, regulatory partners and all of our stakeholders to keep ensuring that everyone has food we can trust."
        },
        {
            "heading": 1,
            "text": "Yr ASB yn 25 oed"
        },
        {
            "text": "Mae’n 25 mlynedd ers sefydlu’r Asiantaeth Safonau Bwyd (ASB) ac rydym am achub ar y cyfle hwn i ddiolch i’n partneriaid ym mhob rhan o’r system fwyd am eu cefnogaeth barhaus ac am bopeth y maen nhw’n ei wneud i gynnal ymddiriedaeth yn y system fwyd."
        },
        {
            "text": "Mae diogelu defnyddwyr, gosod safonau uchel o ran diogelwch bwyd, a sicrhau dilysrwydd bwyd wedi bod yn flaenoriaethau i’r ASB ers y cychwyn cyntaf. Ddiwedd y nawdegau, digwyddodd sawl sgandal, gan gynnwys yr argyfwng BSE, a danseiliodd hyder mewn bwyd yn y DU. Yn sgil hyn, aeth y llywodraeth ati i sefydlu’r ASB i fod yn rheoleiddiwr bwyd annibynnol a fyddai’n rhoi buddiannau defnyddwyr yn gyntaf. Ers hynny, rydym wedi gweithio’n agos gyda’r diwydiant bwyd i’w gefnogi i feithrin hyder defnyddwyr, gan sicrhau bod gan bob un ohonom fwyd y gallwn ymddiried ynddo."
        },
        {
            "text": "Rydym yn falch o’r effaith y mae’r ASB wedi’i chael wrth ddiogelu defnyddwyr. Mae ein harolygwyr cig a’n milfeddygon swyddogol yn archwilio biliwn o anifeiliaid bob blwyddyn, gan sicrhau bod cig yn ddiogel yn y DU. Gyda’n partneriaid yn yr awdurdodau lleol, rydym yn arolygu tua 600,000 o fusnesau bwyd ledled y DU ac yn darparu sicrwydd yn eu cylch. Yn 2010, gwnaethom gyflwyno’r sticeri sgôr hylendid bwyd gwyrdd a du sydd bellach i’w gweld mewn ffenestri bwytai a chaffis. Mae’r sticeri hyn yn galluogi pobl i wneud penderfyniadau gwybodus pan fyddant yn bwyta allan, ac i gefnogi busnesau sy’n gwneud y peth iawn."
        },
        {
            "text": "Gwnaethom weithio'n agos gyda’r diwydiant i weithredu Cyfraith Natasha yn 2021, sef deddfwriaeth arloesol i ddiogelu pobl ag alergeddau bwyd. Mae’r rheolau hyn yn rhoi diogelwch ychwanegol i’r ddwy filiwn o bobl sy’n byw ag alergeddau, ac, ar yr un pryd, yn cynnig eglurder hollbwysig i fusnesau am eu cyfrifoldebau."
        },
        {
            "text": "Rydym hefyd yn cefnogi arloesedd yn y diwydiant bwyd, gan wneud yn siŵr bod rheoleiddio yn gyson â thechnoleg newydd. Mae potensial i organebau wedi’u bridio’n fanwl, eplesu manwl, a chynhyrchion a wneir drwy feithrin celloedd, fel cig a dyfir mewn labordy, wneud ein cyflenwad bwyd yn iachach ac yn fwy cynaliadwy. Rydym yn meithrin ein gallu i reoleiddio’r cynhyrchion hyn, fel ein bod yn cefnogi busnesau i dyfu ac i ddod â’r cynhyrchion hyn i’r farchnad yn ddiogel i ddefnyddwyr."
        },
        {
            "text": "Mae’r system fwyd wedi newid yn sylweddol yn ystod y 25 mlynedd diwethaf, ac mae’n wynebu mwy o heriau yn y dyfodol, o newid yn yr hinsawdd i ddigwyddiadau geowleidyddol, a bydd angen i’r diwydiant bwyd addasu i ateb yr heriau hyn. Rhaid i ni yn yr ASB barhau i ddatblygu ein dull o reoleiddio hefyd, ond ni ddylem byth anghofio mai ein gwaith ni, yn anad dim, yw diogelu iechyd y cyhoedd a hybu buddiannau defnyddwyr. Edrychwn ymlaen at weithio gyda busnesau, partneriaid rheoleiddio a’n holl randdeiliaid eraill i barhau i sicrhau bod gan bob un ohonom fwyd y gallwn ymddiried ynddo."
        }
    ]
}