{
    "url": "https://accessibility.blog.gov.uk/2025/04/04/top-tips-for-hosting-accessible-and-inclusive-online-events/",
    "title": "Top tips for hosting accessible and inclusive online events",
    "authors": [
        "Samantha Merrett, Senior Accessibility Specialist, Ministry of Justice"
    ],
    "categories": [
        "Accessibility",
        "Accessibility tips",
        "Events"
    ],
    "pub_date": "2025-04-04T10:00:30+01:00",
    "content": [
        {
            "text": "As we approach Global Accessibility Awareness Day (GAAD) on Thursday 15th May 2025, you may be considering hosting meetings and webinars to mark the occasion. However, in today's diverse and inclusive society, it is crucial to ensure that meetings, events, and conferences are accessible to everyone."
        },
        {
            "text": "Accessibility fosters inclusivity, allowing all participants to engage fully, regardless of their abilities. In this post we share some top tips on how you can plan, design and host accessible and inclusive online meetings. "
        },
        {
            "heading": 2,
            "text": "1. Planning and preparation"
        },
        {
            "text": "Understand your audience: Before planning your event, take the time to understand the needs of your audience. Send pre-event surveys to gather information about accessibility requirements."
        },
        {
            "text": "Create accessible agendas: Create meeting agendas with multiple breaks and be mindful of break times. For some participants a 10-minute break time might not be enough time to take adequate rest. "
        },
        {
            "text": "Record and share sessions: Ensure all meetings are recorded and made available afterward, allowing attendees to catch up on missed content and review sections at their own pace. "
        },
        {
            "text": "Evaluate platform accessibility: Consider the accessibility features of the platform that you intend to use, and make sure all participants are familiar with the tool. It’s helpful to review these features at the start of the session so everyone knows what’s available ."
        },
        {
            "text": "Test all accessibility features before a live webinar: Check that the captions work, that screen readers can properly read the slides and that all interactive features (for example, polls, chat, and navigation) are fully accessible using just the keyboard. "
        },
        {
            "text": "Offer alternative dial-in options: Make sure you provide an alternative dial-in method, such as a phone number, for participants with no computer or internet access. This also provides a backup option for those with poor connectivity. "
        },
        {
            "heading": 2,
            "text": "2. Communication and promotion"
        },
        {
            "text": "Clear communication: Provide clear,detailed, and easy-to-understand information about the event, including its accessibility features. Use simple language and avoid jargon."
        },
        {
            "text": "Accessible materials: Ensure all promotional materials and event resources are accessible to all participants. Remember to check for appropriate colour contrast and check that font and text size is appropriate for use. "
        },
        {
            "text": "Multiple formats: Offer information in various formats, such as braille, large print, and audio, to meet different needs."
        },
        {
            "text": "Event details: Make sure your event invitations and pre-event communications include information about the venue (if applicable), agenda, timings and any required resources. Share this information as early as possible to allow participants to plan accordingly. Also, provide advanced notice of any group work or exercises. "
        },
        {
            "heading": 2,
            "text": "3. During the event"
        },
        {
            "text": "Sign language interpretation: If possible, provide sign language interpreters for participants who are deaf or hard of hearing, ensuring they are visible to the audience."
        },
        {
            "text": "Clear presentation setup: If you are presenting, make sure you have clear lighting on your face and you have a headset so you can be heard clearly. "
        },
        {
            "text": "Live captioning: Provide live captioning for all spoken content. This benefits not only those with hearing impairments but also non-native speakers and those in noisy environments."
        },
        {
            "text": "Monitor feedback: Keep an eye on the chat for accessibility-related issues and be responsive to requests for assistance. "
        },
        {
            "heading": 2,
            "text": "4. Post-event follow-up"
        },
        {
            "text": "Feedback: Gather feedback from participants on the event’s accessibility to help  improve future events. It’s also a good idea to follow up with participants who requested accommodations to ensure their needs were met, providing another opportunity to gather feedback to improve future meetings. "
        },
        {
            "text": "Recordings and transcripts: Provide recordings and transcripts of the event for those who could not attend or need to review the content."
        },
        {
            "heading": 2,
            "text": "Conclusion"
        },
        {
            "text": "Hosting accessible meetings, events, and conferences is essential for fostering an inclusive environment. By considering the needs of all participants and implementing these best practices, you can ensure that everyone has the opportunity to engage fully and meaningfully. Remember, accessibility benefits everyone and is an important step towards a more inclusive and equitable world."
        },
        {
            "text": "Any images in this blog post are courtesy of GDS."
        }
    ]
}