{
    "url": "https://companieshouse.blog.gov.uk/2020/11/17/freehold-management-companies-making-decisions-and-managing-disputes/",
    "title": "Freehold management companies: making decisions and managing disputes",
    "authors": [
        "Harry Birmingham - General Counsel and Company Secretary at Sparqa Legal"
    ],
    "categories": [
        "Running a company",
        "Starting a company"
    ],
    "pub_date": "2020-11-17T11:25:34+00:00",
    "content": [
        {
            "text": "In our introductory blog post on management companies, we explained the key legal concepts to get to grips with when you own a leasehold property and become a director or shareholder of the freehold management company."
        },
        {
            "text": "In this follow-up blog post on freehold management companies, we will look in more detail about how your management company should go about making decisions, and how disputes should be managed."
        },
        {
            "heading": 2,
            "text": "How to make decisions in freehold management companies"
        },
        {
            "heading": 3,
            "text": "Making board decisions"
        },
        {
            "text": "Decisions of the board of directors should be taken collectively, most commonly at meetings. As with any company, your freehold management company must keep proper records of all its board decisions. The best way to do this is to keep minutes of all board meetings."
        },
        {
            "heading": 3,
            "text": "Making members' decisions"
        },
        {
            "text": "Unless required by a law or agreement, the members will not usually need to be consulted on by the board on most day-to-day decisions. Where a decision of the members is needed, it should be taken either at a general meeting, or by circulating a written resolution."
        },
        {
            "text": "Leaseholders who are not members or directors of the management company have no right to participate in the decision-making of the company."
        },
        {
            "heading": 2,
            "text": "How to manage disputes in freehold management companies"
        },
        {
            "text": "Even if you follow all the best decision-making practices above and familiarise yourself with lease provisions, disputes will inevitably arise."
        },
        {
            "text": "Below we set out some of the common disputes that freehold management companies might come across, and how the relevant stakeholders might go about managing and resolving them."
        },
        {
            "heading": 3,
            "text": "What should freehold management company directors do if they cannot agree?"
        },
        {
            "text": "In discussions about expenditure, directors often disagree about what repair work is necessary and how it should be prioritised."
        },
        {
            "text": "Remember that if your company has default Table A or model articles, only a majority vote is required, so there is no need for all directors to unanimously approve all company business."
        },
        {
            "text": "Check if your chair has a casting vote which they can use to break a deadlock."
        },
        {
            "text": "If you believe a director is putting their own personal interests ahead of those of the wider company, for instance by pushing for repair or improvement works which disproportionately benefit their own property, it may be helpful to remind that director of their duties."
        },
        {
            "text": "If you find yourself in a deadlock at board level, and still cannot reach agreement, you might consider getting independent advice, or asking an expert to help you decide the best way forward."
        },
        {
            "text": "Be very wary of any solution involving removal or appointment of directors to break the deadlock – it can cause a lot of bad feeling and make it difficult to get anything done in the future."
        },
        {
            "heading": 3,
            "text": "What should the directors do if a leaseholder reports a leak in the roof?"
        },
        {
            "text": "It’s best practice for the directors to convene a board meeting (and keep minutes of that meeting), where the leaseholder’s complaint can be properly investigated and considered."
        },
        {
            "text": "For repair matters, the first port of call should generally be the lease, as it will set out the legal obligations of the management company. In most cases the roof, and the exterior of the building, will be the responsibility of the management company."
        },
        {
            "text": "If the management company is responsible for the work, you should promptly arrange for the roof to be inspected so that any necessary work can be carried out."
        },
        {
            "text": "Delaying the work is likely to increase the bill and may leave the management company liable for additional costs if the leaseholder suffers damage to their property as a result."
        },
        {
            "heading": 3,
            "text": "What should the directors do about noisy neighbour complaints?"
        },
        {
            "text": "Check the lease for the obligations of each leaseholder about nuisance and noise. In most cases, there will be a covenant from each leaseholder to not cause a disturbance."
        },
        {
            "text": "Read the terms carefully to ensure you understand the extent of it, and whether the freehold management company is obliged to enforce any breach. If you need help interpreting the lease, seek separate professional advice."
        },
        {
            "text": "If the management company has the power to enforce the terms of the lease, first be sure that the lease has been breached."
        },
        {
            "text": "You might consider holding a board meeting (and keeping minutes), so that the merits of the leaseholder’s noise complaint can be properly considered and recorded."
        },
        {
            "text": "If practical, it might be prudent to consult with other occupants of the building to confirm the merits of the noise complaint, and/or to ask the leaseholder for any evidence they have."
        },
        {
            "text": "If you are satisfied the lease has been breached, you should always obtain separate professional advice before taking any further steps to enforce the terms of the lease. At every stage you should encourage the leaseholders to reach an amicable solution."
        },
        {
            "text": "Negotiation or mediation through a neutral third party can be helpful here. Noise problems are common and can usually be dealt with more promptly and appropriately by private action between the affected leaseholders, rather than enforcement by the management company."
        },
        {
            "heading": 3,
            "text": "What should the directors do if a leaseholder fails to pay their service charge?"
        },
        {
            "text": "Start by checking what the lease says about the service charge."
        },
        {
            "text": "If the service charge is due under the lease, in the first instance you might simply remind the leaseholder of their obligation to pay. Sometimes, a leaseholder may have forgotten, or may just need more time to pay."
        },
        {
            "text": "On other occasions, a leaseholder may withhold their service charge in circumstances where they believe there has been a breach of the lease by the freehold management company. There are only limited circumstances where a leaseholder is legally entitled to withhold."
        },
        {
            "text": "In any event, it’s advisable to obtain separate professional advice before deciding how best to make any formal demands for a service charge or take more drastic action. There are strict legal rules about levying service charges."
        },
        {
            "heading": 3,
            "text": "What can members do if they disagree with a decision of the board?"
        },
        {
            "text": "It’s difficult for members to dispute a decision of the board, as they generally have no right to be involved in the day-to-day management of the company."
        },
        {
            "text": "If you disagree with a decision of the board, you can write to the board clearly setting out your reasons. The board will then have a duty to, at the very least, properly consider any valid concerns you raise."
        },
        {
            "text": "If you find yourself in a position where you would like to be more involved in the day-to-day running of the company, you could also consider asking to join the board of directors. Management company directors are not usually paid and will often welcome anyone willing to assist them or offer relevant expertise."
        },
        {
            "text": "If you are still unhappy with a decision of the board, as a last resort there are various legal claims you might make against the company in your capacity as a member, or steps you might take to attempt to remove directors from their post."
        },
        {
            "text": "You should obtain separate professional advice before embarking on any such course of action."
        },
        {
            "heading": 3,
            "text": "Are freehold management companies responsible for resolving private disputes between leaseholders?"
        },
        {
            "text": "Private disputes between leaseholders, often relating to noise or nuisance, have the scope to take up a great deal of time. Such disputes are usually passionately disputed by the affected parties, who may have an expectation that the management company is responsible for resolution."
        },
        {
            "text": "In most cases, these disputes are best resolved through private discussion to achieve an amicable resolution."
        },
        {
            "text": "The lines can become blurred where the leaseholders involved in a private dispute are also directors of the company. In such circumstances, you should avoid using a board meeting as an arena for airing a private dispute."
        },
        {
            "text": "You should also avoid using your status as a director to infer that any private action you are taking to resolve the dispute is supported or endorsed by the company."
        },
        {
            "text": "It’s important to remember that when you are acting in your capacity as a director, you must always act with the best interests of the company and its members in mind."
        },
        {
            "text": "It will rarely be in the best interests of the company to become involved in a private dispute between neighbours, unless and until there is a clear and uncontested breach of the lease which requires action."
        },
        {
            "text": "At that point, you should report this to the company in your capacity as a leaseholder, for the board as a whole to discuss and action as they deem appropriate."
        }
    ]
}