{
    "url": "https://forestrycommission.blog.gov.uk/2025/06/12/a-greener-future-how-tree-planting-initiatives-are-transforming-englands-landscape/",
    "title": "A greener future: how tree planting initiatives are transforming England's landscape",
    "authors": [
        "Richard Chapman"
    ],
    "categories": [
        "Climate change and resilience",
        "Tree planting"
    ],
    "pub_date": "2025-06-12T09:00:00+01:00",
    "content": [
        {
            "text": "The Department for Environment, Food and Rural Affairs (Defra), the Forestry Commission and our partners are committed to planting millions more trees across the country every year. Planting brings green spaces closer to where people live and work, creates new green jobs for local communities and supports sustainable growth all while tackling climate change."
        },
        {
            "text": "The government have recently announced the creation of the first new National Forest in 30 years, the Western Forest."
        },
        {
            "heading": 2,
            "text": "The value of tree planting"
        },
        {
            "text": "There are a variety of ways that farmers and landowners can plant trees in a way that increases the output and resilience of their farm, business or land management plan. Increasing biodiversity, reducing the risk of flooding and capturing carbon are just a few of the ways trees add value."
        },
        {
            "text": "Over the 2023/24 tree planting season, we’ve funded the planting of 5,500 hectares of trees across England. This is the highest tree planting rate for over 20 years. Our goal is to have planted even more trees this past winter when we see the official statistics published later this year."
        },
        {
            "text": "Here are some of the inspiring examples of tree planting initiatives delivered across the country by the Forestry Commission and our network of delivery partners."
        },
        {
            "heading": 3,
            "text": "Forestry Commission"
        },
        {
            "text": "The Forestry Commission’s flagship tree planting grant, the England Woodland Creation Offer, supports farmers and landowners across England to create and establish new woodland from as little as 1 hectare. The grant covers standard costs for the capital activities and items required to create woodland, payments to maintain the young trees, as well as stackable payments for woodland that offers wider environmental and social benefits."
        },
        {
            "text": "Terry and Tracy Featherstone run a woodland farm in south west Durham. After inheriting the farm, they modernised with green energy systems and spent five years raising sheep. Seeking an environmentally impactful path, they were inspired to transform 14 hectares of their farm into a woodland."
        },
        {
            "text": "Despite having no prior experience in forestry, they went through the Woodland Creation Planning Grant and England Woodland Creation Offer to make this dream a reality. They began planting trees in January 2021, now around 25,000 make up High Meadows. Over the past five years, the transformation has not only enriched local biodiversity but also delivered tangible environmental gains."
        },
        {
            "text": "Strategic planting of species like willow, alder and birch has reduced flooding on previously waterlogged land and the trees are projected to capture over 4,000 tonnes of carbon over the next century. Community involvement has been integral, with local residents participating in planting days and enjoying newly created walkways and ponds that support wildlife. By selling carbon credits to nearby industrial units, the Featherstones have also created a model for sustainable rural enterprise."
        },
        {
            "text": "Their message is clear: planting trees is a vital legacy for future generations and a practical step toward a healthier planet."
        },
        {
            "heading": 3,
            "text": "England Community Forests"
        },
        {
            "text": "In addition, Defra funds 15 Community Forests to deliver tree planting schemes across a range of areas. Community Forests have specialist local teams which work closely with private and public landowners to design, fund and plant woodland for the benefit of farm businesses, communities and the environment.   "
        },
        {
            "text": "Snugbury’s farm, near Nantwich in Cheshire, has embraced agroforestry (where trees are integrated into farming systems) by planting over 2,300 fruit, walnut and hazelnut trees."
        },
        {
            "text": "This initiative, funded by Defra through Mersey Forest’s 'Trees for Climate’ scheme, not only enhances the farm’s ice cream production, it also boosts biodiversity and soil quality. The trees act as windbreaks, manage moisture levels and provide food for wildlife and pollinators."
        },
        {
            "text": "Meanwhile, at Normanton on Soar in Nottinghamshire, landowners Tom and Debra Willoughby have integrated apple and walnut trees into pasture where they graze cattle, with help from Greenwood Community Forest,"
        },
        {
            "text": "Planting in-field trees on productive areas of a farm can allow farmers to reap multiple benefits, such as providing shade and shelter to crops or livestock. This can improve the overall resilience of farm businesses while maintaining or enhancing productivity."
        },
        {
            "text": "This year the Willoughbys have extended the scheme to 99 hectares over two years and saw nearly 17,000 trees planted, with just over 11 hectares of woodland in the mix over and above the agroforestry."
        },
        {
            "text": "There are now two crops in that field – trees and beef – and biodiversity is thriving."
        },
        {
            "text": "The White Rose Forest has helped the Leatham family to embrace agroforestry at Telfit Farm by planting 54,000 trees in North Yorkshire. This includes establishing wood pastures and meadows and 3.5km of native hedgerows to support rotational grazing for their cattle, pigs and a new flock of sheep."
        },
        {
            "heading": 3,
            "text": "Forests for Cornwall"
        },
        {
            "text": "Down in Cornwall, Rose Barnecutt at Boddinick Farm has enhanced biodiversity by planting trees to create thicker hedges and wildlife corridors with support from Forest for Cornwall."
        },
        {
            "text": "At Rosuick Organic Farm, Forest for Cornwall has funded 25 hectares of tree planting, including agroforestry, to complement the farming system. Farmer Dave Oates and his family produce beef from 80 pedigree Welsh Black suckler cows. Through support from Defra grants and Forest for Cornwall, they have established silvo-pasture, integrating trees and livestock on parts of the farm where the herd grazes."
        },
        {
            "heading": 3,
            "text": "Great Northumberland Forest"
        },
        {
            "text": "The Great Northumberland Forest has been supporting landowners to manage and develop agroforestry schemes. Danny Goodall from Northumberland County Council, has released cattle into council-owned woodland planted 30 years ago. This has provided the animals with shade, shelter and enrichment; improving their welfare and productivity and showing how cattle and trees go really well together."
        },
        {
            "text": "The organic farm Thistleyhaugh is also planting 3 hectares of agroforestry for cattle and sheep as part of a planned expansion in tree cover on the farm. Great Northumberland Forest is supporting the farm with applications to multiple funding streams, delivering a bespoke solution for the mid-Northumberland holding."
        },
        {
            "text": "Over 220 hectares of woodland has been restored through Great Northumberland Forest's Storm Arwen grant, creating increased resilience and diversity across the county."
        },
        {
            "heading": 3,
            "text": "National Forest Company"
        },
        {
            "text": "In the Midlands, the National Forest now spans 200 square miles, with farmers like the Ludlam family at Cattows Farm in Leicestershire playing a vital part in its growth."
        },
        {
            "text": "Back in 2004, they planted 100 acres of trees, transforming their farm into a thriving hub for endurance runs, a forest school and more."
        },
        {
            "text": "Today, Cattows is not just a farm but a destination, with a popular farm shop and café offering locally sourced produce. Rob Cleaver, Forest Creation Manager at the National Forest Company, has supported Cattows Farm and many other local landowners as they take a more diverse approach, integrating trees into tourism and accommodation ventures."
        },
        {
            "heading": 3,
            "text": "Northern Forest"
        },
        {
            "text": "In North Yorkshire, William Hunter Bell at Thirsk Hall Estates has integrated trees into his 2,000-acre arable farm with support from the White Rose Forest, one of the Northern Forest partners working towards a collective goal of establishing 50 million new trees across the north of England."
        },
        {
            "text": "This project will transform unproductive land into a thriving woodland, that supports the farm’s sustainability goals and future business plan. Watch how the White Rose Forest team supported North Yorkshire farm Thirsk Hall Estates to plant woodland."
        },
        {
            "heading": 3,
            "text": "Woodlands for Water"
        },
        {
            "text": "In Cumbria, Simon Peet, landowner at Langwathby Hall Farm is creating a native broadleaf woodland with the help of Eden Rivers Trust. This project, funded by the Forestry Commission’s England Woodland Creation Offer, includes installing leaky dams to manage water flow and reduce flood risk."
        },
        {
            "text": "Anna Holliday from Eden Rivers Trust helped Simon with the application and highlighted to him the multiple benefits of woodland creation, from improving water quality to providing wildlife habitats."
        },
        {
            "text": "These are just a few examples of the incredible work being facilitated by our partners across England. They have helped make significant strides in creating a greener, more sustainable future. It is truly a collaborative venture, with huge commitment, determination and impact up and down the country."
        }
    ]
}