{
    "url": "https://defrafarming.blog.gov.uk/2025/06/12/call-for-evidence-expanding-the-role-of-the-private-sector-in-nature-recovery/",
    "title": "Call for evidence: expanding the role of the private sector in nature recovery",
    "authors": [
        "The Team"
    ],
    "categories": [
        "Ways to get involved"
    ],
    "pub_date": "2025-06-12T12:32:03+01:00",
    "content": [
        {
            "text": "Nature and the services it provides are the foundation for a healthy economy. "
        },
        {
            "text": "Businesses rely on clean air and water, fertile soils, pollination, flood protection and carbon storage, all of which come from a thriving natural environment."
        },
        {
            "text": "There are significant opportunities for businesses investing in nature recovery: for growth, innovation and resilience, as well as helping to respond to growing expectations from customers, shareholders and investors."
        },
        {
            "text": "There are already opportunities for investors to support high-integrity nature restoration projects that deliver both environmental outcomes and financial returns."
        },
        {
            "text": "These include biodiversity credits like Biodiversity Net Gain, and nature-based carbon credits like the Woodland Carbon Code and the Peatland Code."
        },
        {
            "text": "We're working with stakeholders to increase transparency, integrity and confidence in these growing markets."
        },
        {
            "text": "However, we need to go much further with nature services to help meet our environmental targets and ensure that they are reliable for farmers and land managers. "
        },
        {
            "text": "That’s why we've launched a call for evidence on expanding the role of the private sector in nature recovery."
        },
        {
            "heading": 2,
            "text": "Call for evidence"
        },
        {
            "text": "This call for evidence asks for your views on how to fairly and effectively increase the incentives for businesses to invest in nature, in line with the benefits they draw from the natural environment and the impacts they have on it."
        },
        {
            "text": "Responses to the call for evidence will support the further development of policies to increase private sector investment in protecting and improving nature."
        },
        {
            "text": "We are seeking your views and evidence on how to increase investment in the following 6 outcomes, while managing any risks for businesses, communities or consumers:"
        },
        {
            "text": "This is your opportunity to help influence how government and business work together to build a thriving nature services market with integrity, credibility and scale."
        },
        {
            "text": "We want to hear from farmers and land managers, as well as other corporates, investors, financial institutions and non-governmental organisations."
        },
        {
            "text": "Your insights will help us scale up private investment in nature, enabling nature-positive business models that deliver both environmental and economic returns."
        },
        {
            "text": "The call for evidence opens today (12 June) and closes 7 August 2025. "
        },
        {
            "text": "We will share outcomes here on the blog."
        },
        {
            "heading": 2,
            "text": "Supporting roundtable"
        },
        {
            "text": "Earlier today a roundtable brought together participants from business, finance, farming and the environmental sectors."
        },
        {
            "text": "It was hosted by the Secretary of State, Steve Reed, who was joined by the Green Finance Institute, Lloyds, and leading figures from a range of economic sectors, including the agri-food industry."
        },
        {
            "text": "The discussion focused on:"
        },
        {
            "text": "This is one part of a broader, long-term effort to scale up private investment in nature. "
        },
        {
            "text": "Delivering our environmental goals will depend on continued collaboration between government, business and the financial sector."
        },
        {
            "text": "Subscribe to the Farming blog for the latest updates."
        }
    ]
}