{
    "url": "https://naturalengland.blog.gov.uk/2025/06/12/getting-water-wise-shared-standards-in-water-efficiency-for-local-plans-in-east-anglia/",
    "title": "Getting water wise – Shared Standards in Water Efficiency for Local Plans in East Anglia ",
    "authors": [
        "Dr Louise Bardsley"
    ],
    "categories": [
        "Biodiversity",
        "Development",
        "Growth",
        "Natural England",
        "Site of Special Scientific Interest",
        "Species recovery"
    ],
    "pub_date": "2025-06-12T11:31:59+01:00",
    "content": [
        {
            "text": "By Dr. Louise Bardsley, Principal Adviser Strategic Solutions, Natural England"
        },
        {
            "text": "The East of England is the fastest growing region in England. It’s also the driest. Communities, businesses, farming and nature all need enough water to thrive. But without a fundamental rethink of how we use and share water in the East, there will not be enough to meet current demands as the climate changes , let alone the growth planned for this area.  "
        },
        {
            "text": "Natural England, the Environment Agency and water companies in the region have been working together on a joined up, strategic approach, so that new homes and businesses will use water more efficiently, allowing scarce supplies to be shared between the needs of nature, people and the economy. Louise Bardsley looks at how this new water wise guidance will work. "
        },
        {
            "heading": 4,
            "text": "What’s the issue? "
        },
        {
            "text": "Water is getting scarcer across England. There is a growing demand for water but at the same time long term patterns of climate and rainfall are becoming unpredictable with greater extremes of drought and flood. "
        },
        {
            "text": "Water scarcity is an issue for both people and nature. We turn on the tap and expect water to flow as much as we want, when we want. It’s easy to forget that our water supplies are entirely dependent on healthy natural landscapes and ecosystems that capture and store rainfall across rivers, wetlands and aquifers, to be processed into drinking water. "
        },
        {
            "text": "Nature needs water, but nature is also key to the resilience of our water supply, a reminder that healthy nature is essential for growth. Natural England has a role in advising and developing solutions so that both people and nature have enough water to thrive. "
        },
        {
            "text": "And nowhere in England is water scarcity more acute than in East Anglia, which only receives about 600 millimetres of rain each year. The region is also a focus for housing growth with ambitions to build around 25% more homes, further increasing pressure on water supplies and the shortfall of water for nature. "
        },
        {
            "text": "By 2050, there will be a daily shortage of about 730 million litres of water for public use across East of England. To fix this, we need to use less water, improve efficiency for homes and businesses, and repair leaks. The remaining shortage will be addressed by finding new water sources. "
        },
        {
            "heading": 4,
            "text": "It should be wet and wild... "
        },
        {
            "text": "Paradoxically in a region of low rainfall, many of East Anglia’s most precious nature sites and landscapes are wetlands. Not only are they key repositories for rare habitats and species but their peat soils store carbon and they are key to retaining water in the landscape. Across the region wetland habitats are threatened by our overuse and poor management of freshwater. "
        },
        {
            "text": "Of the 239 Sites of Special Scientific Interest across the East of England which are nationally important for freshwater wildlife, at least 96 currently are impacted by water scarcity.  "
        },
        {
            "text": "Perhaps the best known wetland habitat is The Broads, the vast area of rivers and lakes spanning Norfolk and Suffolk which is protected for its special habitats and species and also much loved by locals and visitors as a landscape for enjoyment and recreation. "
        },
        {
            "text": "The Broads form a complex mosaic of interconnected habitat including open water, reedbeds, wet woodland, grazing marsh, fen and mire. Together with natural hydrological variation, this habitat variability supports an exceptional diversity of plant and animal wildlife. "
        },
        {
            "text": "In 2024 the Broads Authority declared a biodiversity emergency because they have lost 6 species per decade for more than 50 years.  "
        },
        {
            "text": "Similar situations are playing out in the wonderful, nature rich wetlands of the Cambridgeshire Fens and other wet nature sites large and small across the East of England where over abstraction is preventing nature recovery. Reducing water demand from homes and businesses is part of the solution and this is where the shared standards come in. "
        },
        {
            "heading": 4,
            "text": "What are the Shared Standards? "
        },
        {
            "text": "The Shared Standards in Water Efficiency for Local Plans is a joint initiative developed by Natural England, the Environment Agency, and water companies endorsed by Water Resources East to support Local Planning Authorities (LPAs) to deliver sustainable growth. "
        },
        {
            "text": "The water company partners are Anglian Water, Cambridge Water, Essex and Suffolk Water and Affinity Water. The Shared Standards provide advice and evidence to Local Planning Authorities (LPAs) on how they can secure higher water efficiency standards for new homes and for commercial developments.   "
        },
        {
            "text": "The Shared standards provide recommendations for LPAs to develop local plan policies that: "
        },
        {
            "heading": 4,
            "text": "How Natural England is working with partners "
        },
        {
            "text": "Natural England is working to ensure that protected sites recover from the effects of water abstraction by advising water companies on their Water Resources Management Plans (WRMPs). WRMPs are statutory documents that water companies are required to create and update every five years, which outline how the company will ensure a secure water supply for its customers while also protecting and enhancing the environment."
        },
        {
            "text": "In parallel we are working with the Environment Agency to make changes to abstraction licences, so LPAs can be confident that growth does not add to known or likely existing abstraction impacts on protected sites. "
        },
        {
            "text": "The Shared Standards are part of this approach and will help to unlock development and growth while also supporting nature recovery and climate resilience. "
        },
        {
            "text": "The East of England is the test bed for this new approach and if it proves successful this model can be rolled out to other water scare regions in future. "
        },
        {
            "text": "The shared standards can be found here: "
        },
        {
            "text": "shared-standards-in-water-efficiency-for-local-plans.pdf "
        }
    ]
}