{
    "url": "https://environmentagency.blog.gov.uk/2025/06/12/how-can-i-report-water-pollution-and-odour-problems-online-new-service-puts-environmental-action-at-your-fingertips/",
    "title": "How can I report water pollution and odour problems online? New service puts environmental action at your fingertips.",
    "authors": [
        "defrablogs"
    ],
    "categories": [
        "Environment Agency",
        "Water"
    ],
    "pub_date": "2025-06-12T08:24:09+00:00",
    "content": [
        {
            "text": "The new ‘Report an environmental problem' service is now live on GOV.UK, making it easier than ever to report water and odour pollution to the Environment Agency (EA) across England."
        },
        {
            "text": "The new online service enhances our existing telephone incident hotline by providing a quick and accessible way to report environmental problems. It enables people to flag concerns as soon as they notice them, benefiting regular river users such as anglers, kayakers, and wild swimmers. It also offers a straightforward way for people affected by unpleasant odours to report these problems quickly."
        },
        {
            "text": "Over the next year, the EA will expand the service to include additional environmental problems beyond water pollution and odour problems such as illegal fishing. When reporting online, the new service will record important information about the environmental problem, including the precise location with map functionality, details of what people have witnessed, and soon there will be the option to upload photos or videos of the problem that they have encountered."
        },
        {
            "text": "“The new ‘Report an environmental problem’ digital service is one of many changes the Environment Agency is working on to help protect England’s natural environment” says Pete Connolly, Deputy Director of Digital Services in Incident Management and Resilience at the Environment Agency.  “The new GOV.UK service provides people with another route to report environmental problems, making it easier, faster and more accessible to do so.  We know people care about the environment and this enables us all to get involved in protecting and preventing environmental harm. Whether you're out walking along a river, fishing or concerned about a smell in your community, you can now report directly from your device. The intelligence you provide is invaluable, helping us spot emerging patterns and respond efficiently to safeguard our waterways, land, air quality and local environments.”"
        },
        {
            "text": "Every report submitted to the Environment Agency, whether online or by phone, contributes to our broader understanding of environmental problems, helping us to assess and prioritise our regulation and incident response efforts to better protect people, the environment, and the economy. "
        },
        {
            "text": "We are encouraging people to visit  Report an environmental problem on GOV.UK to access the new service and report any water pollution or odour related problems they encounter in their communities."
        }
    ]
}