{
    "url": "https://mhclgmedia.blog.gov.uk/2025/06/12/spending-review-council-tax-reporting/",
    "title": "Spending Review Council Tax reporting",
    "authors": [
        "mhclgpress"
    ],
    "categories": [
        "Council finance",
        "Local government"
    ],
    "pub_date": "2025-06-12T18:16:52+01:00",
    "content": [
        {
            "text": "There has been reporting that councils will increase council tax by 5% in coming years as a result of the Spending Review."
        },
        {
            "text": "To safeguard residents against excessive hikes, the Spending Review confirmed the government intends to maintain the referendum threshold at 3%, with 2% for the adult social care precept."
        },
        {
            "text": "This is in line with the threshold set up by the previous government."
        },
        {
            "text": "Individual councils remain responsible for setting their own council tax levels each year and the government is clear that they should put taxpayers first. "
        },
        {
            "text": "The Chancellor also announced that councils will receive an additional £3.4bn of new grant funding over the next three years. This is alongside our wider reforms to fix the foundations of local government, reduce pressure on the sector, achieve better value for money and support local authorities to deliver the public services that their communities rely on."
        },
        {
            "text": "The government will also be consulting shortly on improving the council tax collection system to make it fairer, more efficient and offer better support for people who need it."
        },
        {
            "text": "Anyone currently experiencing difficulty paying their council tax bill should contact their council as a range discounts and exemptions are available. Councils are required to put in place council tax reduction schemes to support those on low incomes, and 3.7million households currently receive this support. In addition, support for pensioners is prescribed by government and provides a reduction of up to 100% for those on the lowest incomes.  "
        },
        {
            "text": "Final decisions on council tax referendum principles will be made following consultation as part of the Local Government Finance Settlement, in the usual way."
        }
    ]
}