{
    "url": "https://gfie.blog.gov.uk/2025/06/12/this-opportunity-is-helping-me-grow-personally-and-professionally-every-day/",
    "title": "This opportunity is helping me grow personally and professionally every day",
    "authors": [
        "karlharvey1"
    ],
    "categories": [
        "#GFIEsuccessstory",
        "Breaking down barriers",
        "Life Chance Recruitment",
        "Social mobility"
    ],
    "pub_date": "2025-06-12T10:00:00+01:00",
    "content": [
        {
            "text": "\n"
        },
        {
            "text": "Hello Friends of GFiE"
        },
        {
            "text": "This month the UK celebrates Social Mobility Day on 12th June."
        },
        {
            "text": "GFiE is all about breaking down barriers to opportunity and this month we celebrate our ongoing commitment to social mobility through our Life Chance Recruitment Pathway."
        },
        {
            "text": "Through targeted recruitment and working with delivery partners we bring talented people into government who might never have considered pursuing a career with us. The civil service is committed to looking like the society we serve, and enabling individuals from all backgrounds to access meaningful career opportunities within government."
        },
        {
            "text": "\nThere are a variety of GFiE pathways on offer across the Civil Service providing opportunities for people from areas of low social mobility, to find out more about how you can use these schemes please visit the Civil Service Careers GFiE page at  https://www.civil-service-careers.gov.uk/gfie-schemes/#social-mobility.\n \n"
        },
        {
            "text": "In celebration of Social Mobility day 2025, we hear from GFiE Head of Operations Lisa, and Jennifer, a candidate of the DWP Social Mobility apprenticeship Pathway about their personal experiences and the impact an opportunity in the Civil Service has had for them."
        },
        {
            "text": "\n\n\nIf you have ever spent time with me, you’ll most likely have discovered that I’m a proud Barrovian (the proper term for someone who comes from a Cumbrian town called Barrow-in-Furness). Although these days there’s more than just a trace of Yorkshire in my accent, I am still very proud of my hometown and make regular visits back to see family and friends. However, growing up in an area in which 12 communities are ranked amongst the 10% most deprived in England (source: Deprivation Analysis Cumbria) means that I have seen the effects of deprivation and how it can impact the life chances of people who are affected by it. \nFor me, Social Mobility means breaking down the barriers that make people think or feel ‘that’s not for the likes of me’ so that aspirations can be raised across generations.. Whether it’s the school you went to, the way you speak or the life experiences that you have had to date, there are many things that can cast doubt in our minds about what we can aspire to be. \nI didn’t grow up thinking I’d be a Civil Servant. When I applied for the Fast Stream after some encouragement from a colleague at the Trade Union where I worked, I didn’t have a clue what the Civil Service was. In many ways that may have been helpful, as I didn’t know of some of the stereotypes that existed, many of which are described in the Navigating the Labyrinth report. However, feeling out of place, particularly in Westminster, was a common theme particularly throughout my first 3 years in the Civil Service. That’s not to say that my colleagues weren’t welcoming or supportive - they were - but a little part of me regularly said ‘Who do you think you are? You’re from Barrow - you don’t belong here’.\nAs I’ve gone through the last decade of my career, my confidence has grown and as it did, so did the ability to challenge that doubting voice - I know what I can bring to the workplace and I’m proud to represent the town that I came from. My role leading the delivery of GFIE schemes brings me huge satisfaction every day, as I know that it contributes to bringing new voices into the Civil Service, many of whom would have never seen themselves in the jobs or careers that they are thriving in now. On that note I’d like to share a couple of tips if any of this rings true for you too:\nTips\n\nFind a cheerleader, and listen to them - Sometimes we all need to borrow a bit of self-belief, especially when we’re not sure whether to go for something like a job opportunity. If your inner voice is telling you all the reasons why you can’t or shouldn’t do something then find someone you trust and tell them about it - sometimes hearing things from a different perspective can give you the push that you need\nKnow your strengths - in the workplace, it’s not all about the education that you had or even the amount of experience you’ve gained. Every single person has strengths, whether you’ve had one job or ten - the key thing is to know what they are and to use them at every opportunity. There are plenty of articles like this one designed to help you identify them\nDo your research - We all know the saying ‘knowledge is power’, and for me this rings true when thinking about how you can open up opportunities for yourself, regardless of whether you’re at the start of your career or thinking about developing it. If you’ve thoroughly researched a sector, organisation or Department, you’ll start to understand more about how to navigate through the different career pathways. Networking can be daunting for some, but you also never know where a new connection might take you, so keep an eye on LinkedIn and local events for anything relevant to your interests\nSet your aspirations high, and don’t give up at the first hurdle - try not to limit yourself or your ambition. Taking risks in your career or aiming for big things can feel scary but try not to be completely discouraged by setbacks or rejections. Your past experiences do not need to define you or your future, and you always have choices about what you want to do and how you want to do it going forward. \n\nLisa, Head of Operations Going Forward into Employment \n\n\n\n\n\nThe DWP Social Mobility Apprenticeship in Customer Service has offered my team and I an incredible opportunity to not only choose an alternative path to qualification, but to develop personally; each day I learn about new systems, processes and building communication. The role of being an Administrative Officer is flexible, and you can balance both your role and coursework! \nThe connections I have made have revealed to me that progression is enjoyable and accessible in the Civil Service. From staff at entry level AO to senior leaders Grade 6, I have had enthusiastic conversations about what departments I am interested in, projects, and opportunities.  \nWe started in a group of apprentices the same age, this meant that we had a support network and learned together more effectively as a team.  I would recommend the apprenticeship to others. The Civil Service career ladder is endless! You can apply to do a degree with the Civil Service, talent programmes, national and international jobs! For those that consider applying, I would recommend working with your careers advisors or trusted teachers on your application. \nThere are over 24 ministerial departments in the Civil Service. Think not only what you can bring to the entry role, but what you can do long term - Engineer? Lawyer? Marketer? I didn’t realise how expansive the Civil Service was! \nAs I began my apprenticeship, I reflected on my time at sixth form, I knew that the opportunity had personally affected me. I had a difficult experience at sixth form, and I wanted to go beyond my comfort zone, such as not going straight back into traditional education. I wanted to combat shyness, self-doubt and the question - where do I go from sixth form? For many finishing school, going into a job can be daunting. You don’t exactly know where your path lies, and that is where the apprenticeship stepped in. I realised it could give me a chance to take a step back, think outside the box and start building a skill set that sets you apart. I have had cheer from so many on my endeavours and who want the best for apprentices’ careers. Even outside the role, the flexibility of the role has meant I can be there more for my family and friends! \nThis role has opened me up to a plethora of places to go, but that wasn’t always the case... Following my poor experience of sixth form, I realised this role offered me freedom. Freedom from barriers I perceived for myself, financial independence which has even helped my family, but more than anything this opportunity is helping me grow personally and professionally every day.  \nJennifer, Department for Work and Pensions\n\n\nOur focus is not only on attracting candidates from underrepresented groups, but also on providing them with the necessary support to thrive in their roles. Right now we are developing some GFiE week 1 and month 10 training which we plan to share for use across all of the GFiE pathways across government. \nThank you for your continued support of GFiE, together, we can ensure that opportunities are accessible to all.\nAll the best - from the GFiE Team.\n \n"
        },
        {
            "text": "\n"
        }
    ]
}