{
    "url": "https://environmentagency.blog.gov.uk/2025/06/12/why-do-we-have-hosepipe-bans-during-a-drought/",
    "title": "Why do we have hosepipe bans during a drought?  ",
    "authors": [
        "defrablogs"
    ],
    "categories": [
        "Drought",
        "Water"
    ],
    "pub_date": "2025-06-12T14:58:19+00:00",
    "content": [
        {
            "text": "Whenever we get a period of dry weather, the inevitable question is ‘Will there be a hosepipe ban?’ "
        },
        {
            "text": "For most years it rains and the answer is no. However, after the driest spring in 132 years in England, and the Environment Agency declaring drought in the North West and Yorkshire, the answer is not so clear. Some water companies may need to follow their drought plans and implement hosepipe bans this year. The decision to implement a ban is with water companies and will depend a lot on the weather and their water resources position.  "
        },
        {
            "text": "So, what are Hosepipe Bans?  The official name is Temporary Use Bans – TUBs as short hand. The rules are set out in  the Water Industry Act 1991, Section 76. Activities that can be banned by TUBs: "
        },
        {
            "text": "*A ‘garden’ includes: a park; gardens open to the public; a lawn; a grass verge; an area of grass used for sport or recreation; an allotment garden; any area of an allotment used for non-commercial purposes; any other green space.   A garden does not include: agricultural land; land used commercially (i.e. for growing); a temporary garden or flower display; plants that are in an outdoor pot or in the ground, under cover. "
        },
        {
            "text": "Why do they matter?  TUBs are an important tool to help manage a drought. Their purpose is to reduce demand for water which helps when supplies are low, by:  "
        },
        {
            "text": "Each drop saved leaves that water in the environment which will  help to protect fish and other wildlife. We know people want to see clean and plentiful water and this is a simple way to help do that.   "
        },
        {
            "text": "Do TUBs work?  Yes – TUBs  reduce demand and conserve supplies. Research following droughts where hosepipe bans and TUBs have been used found they can reduce the amount of water companies put in their distribution network by 3 to 5%. This all helps supplies last longer.  "
        },
        {
            "text": "For example, a company supplying around 1900 million litres of water to customers each day, could save enough water to fill Wembley stadium! "
        },
        {
            "text": "Who makes the decision to introduce TUBs?  Only water companies can make the decision on introducing TUBs. The company has to notify its customers ahead of a ban and will need to publish details on its website and in two newspapers that circulate in that area.  "
        },
        {
            "text": "A water company will have a drought plan that will outline how they implement TUBs. The water industry has a code of practice that provides details on how to implement restrictions – ‘UKWIR Managing through drought: Code of Practice and Guidance for water companies on water use restrictions 2023’ "
        },
        {
            "text": "What do people think of TUBs? Hosepipe bans have been widely talked about and there is good awareness of them. During the 2022 drought, when TUBs were last implemented the water efficiency charity, Waterwise, surveyed over 2000 UK residents. The results showed that 76 % thought implementing a hosepipe ban when it was hot, dry and sunny was justifiable while 9 % disagreed and 15 % were unsure. "
        },
        {
            "text": "Water companies can have a big influence on the acceptability of TUBs, They need to   communicate clearly, in good time  and seek support from  neighbouring water companies and interested local groups, such as angling clubs. "
        },
        {
            "text": "When did we last have TUBs? The last water company to use TUBs was South West Water, who lifted the ban in September 2023.  "
        },
        {
            "text": "Water company areas affected by Temporary Use Bans (TUBs) in England in drought years 1975 to 2023.  "
        },
        {
            "text": "Want to find out more about TUBs"
        },
        {
            "text": "What you can do"
        },
        {
            "text": "You don’t have to wait for Temporary Use Bans to make a difference. Actions you could take now include the following:"
        },
        {
            "text": "Finally, if you have a water meter, saving water will also save you money."
        }
    ]
}