{
    "url": "https://mhclgmedia.blog.gov.uk/2024/11/01/budget-boost-for-housing-local-growth-and-remediation/",
    "title": "Budget boost for housing, local growth and remediation",
    "authors": [
        "mhclgpress"
    ],
    "categories": [
        "Affordable housing",
        "Building safety",
        "Council finance",
        "Devolution",
        "Homelessness",
        "Housing",
        "Local government"
    ],
    "pub_date": "2024-11-01T12:57:43+00:00",
    "content": [
        {
            "text": "The Chancellor has set out a Budget to fix the foundations by providing a significant boost for housebuilding, backing projects to support local growth and supporting devolution. "
        },
        {
            "text": "This week’s budget invests in local government and reaffirmed the government’s commitment to improving building safety and accelerating remediation. "
        },
        {
            "text": "These announcements form part of the wider Budget decisions on tax, spending and welfare to restore economic and fiscal stability so the government can invest in the country’s future and achieve its mission for growth.  "
        },
        {
            "text": "They include:  "
        },
        {
            "text": "Housing and homelessness "
        },
        {
            "text": "Within the Budget there was a significant boost for housing investment to kickstart the biggest increase in social and affordable housebuilding in a generation, help build 1.5 million homes over this Parliament and tackle homelessness. "
        },
        {
            "text": "To boost supply, the Government will invest £5 billion in housing in 2025-26, an increase of £1 billion on the previous year, which includes £500 million additional funding for the Affordable Homes Programme and an additional £50 million to turbocharge planning reform. "
        },
        {
            "text": "Taking decisive action to get more homes built now, £56 million has been confirmed to deliver over 2,000 homes at Liverpool Central Docks, while £47 million has been allocated through the Local Nutrient Mitigation Fund to support the delivery of up to 28,000 homes that would otherwise be stalled due to nutrient neutrality requirements. Alongside this, the government is providing an additional £3 billion of support for SMEs and the Build to Rent sector, in the form of housing guarantee schemes, allowing developers to access low-cost loans and support the delivery of tens of thousands of new homes. "
        },
        {
            "text": "To further support regeneration in the Euston area, the government has appointed Bek Seeley as the Chair to the Euston Housing Delivery Group, to understand the opportunities for new homes in the Euston area, while £10 million of funding has been allocated to the Cambridge Growth company to unlock future economic growth in the area. "
        },
        {
            "text": "Meanwhile, the stock of social housing will be increased through a new 5-year commitment for a social housing rent settlement that will give the sector more long-term certainty on funding and allow them to invest in tens of thousands of new homes. The existing stock will also be protected by reducing Right to Buy discounts so that thousands more council homes remain in the sector. "
        },
        {
            "text": "To tackle homelessness, the government is providing £233 million of additional spending in 2025-26, taking total spending to £1 billion. This will help to prevent rises in the number of families in temporary accommodation and help to prevent rough sleeping.  "
        },
        {
            "text": "Building Safety: "
        },
        {
            "text": "The Budget reaffirmed the government’s commitment to improving building safety and accelerating remediation of unsafe housing, with investment in remediation to rise to over £1 billion in 2025-26. This includes new investment to speed up remediation of social housing. The government will set out further steps on remediation later this autumn. "
        },
        {
            "text": "Freeports: "
        },
        {
            "text": "The Budget confirmed funding for Freeports across the UK, confirming that five new customs sites will be designated in existing Freeports shortly. Designating tax sites in Celtic Freeport in South Wales, means businesses will be able to start to benefit from tax reliefs on new investment and employment in those sites in November, supporting the Freeport to create good, highly skilled jobs in an area that needs them. The government will also work to ensure the Freeports policy model aligns with the national Industrial Strategy. "
        },
        {
            "text": "Local Growth: "
        },
        {
            "text": "The Budget confirmed funding for the Investment Zones programme across the UK and announced the approval of the East Midlands Investment Zone to support advanced manufacturing and green industries. "
        },
        {
            "text": "The UK Shared Prosperity Fund will continue at a reduced level for a transition year by providing £900 million in 2025-26 for local authorities to invest in local growth, in advance of wider funding reforms.  "
        },
        {
            "text": "Levelling Up Fund projects across all three rounds, which will provide £1 billion in 2025/2026 to revitalise high streets, town centres and communities, will continue.  "
        },
        {
            "text": "The government will continue to invest in other local programmes, including Levelling Up Partnerships and City & Growth Deals. The Long-Term Plan for Towns will be retained and reformed into a new regeneration programme.  "
        },
        {
            "text": "Devolution: "
        },
        {
            "text": "The Budget introduces the first integrated settlements for the West Midlands and Greater Manchester from 2025-26. The integrated settlements will deliver a single flexible pot of funding to support Mayoral Combined Authorities (MCAs) to deliver growth. The government wants more regions to benefit from integrated settlements and has published a new eligibility process to provide a clear path for future areas to access the benefits of an integrated settlement.  "
        },
        {
            "text": "From the start of the 2026-27 financial year, we will launch integrated settlements for an additional four MCAs: the North East, South Yorkshire, West Yorkshire Mayoral Combined Authorities, and Liverpool City Region Combined Authority. The government will also explore how an integrated settlement could apply to the Greater London Authority from 2026-27. "
        },
        {
            "text": "Local Government: "
        },
        {
            "text": "The Budget confirmed £1.3 billion of new grant funding for local authority services including at least £600 million in new grant funding for social care. Together with council tax flexibilities and locally-retained business rates, this will provide a real-terms increase in total core spending power in 2025-26 of around 3.2%. "
        },
        {
            "text": "In addition, local authorities are expected to receive around £1.1 billion of new funding in 2025-26 through the implementation of the Extended Producer Responsibility scheme to improve recycling outcomes from January 2025, equivalent to a further c.1.6% real-terms increase in local government resources.  "
        }
    ]
}