{
    "url": "https://vets.blog.gov.uk/2024/11/01/celebrating-the-9th-annual-one-health-day/",
    "title": "Celebrating the 9th Annual One Health Day",
    "authors": [
        "Government Vets Blog Team"
    ],
    "categories": [
        "Government Veterinary Services"
    ],
    "pub_date": "2024-11-01T16:32:56+00:00",
    "content": [
        {
            "text": "[Christine Middlemiss, Chief Veterinary Officer]"
        },
        {
            "text": "What does One Health Day mean for me?"
        },
        {
            "text": "For me, at the very core of taking a \"One Health Approach\" is collaboration. As vets, we have a vital role to play in ensuring that all the talk of One Health becomes actual practical delivery of a clear interdependence between the animal, human and environmental health sectors. Vets, farmers, and government are core parts of the equation – our position is unique with our practical, scientific and innovative approaches to maintaining and improving animal health and welfare. We must continue to shout about how these roles are also critical to human and environmental health."
        },
        {
            "text": "I am proud to say that the last 12 months is full of examples of collaboration across government and specifically in the Defra group, it definitely feels that we are consciously working together to ensure the protection of human, animal and environmental health!"
        },
        {
            "text": "[In March 2024, APHA took a range of precautionary measures to check for HPAI H5N1 cases in UK cattle]"
        },
        {
            "text": "This year we have remained vigilant to the threat from Highly Pathogenic Avian Influenza (HPAI) through our continued surveillance in wild birds and mammals so we’re ready to react to any developing situation.  The surprise detection of HPAI in cattle in the US saw us working with our human health colleagues and undertaking a surveillance programme appropriate to the UK situation. We did this of course with the dairy industry using in place food safety surveillance programmes to monitor bulk milk samples, providing assurance that our cattle were not affected. The US situation again reminded us of the zoonotic potential of HPAI and the key importance of monitoring such viruses as they mutate and develop their potential in different species. A One Health approach was essential in assessing risks to provide the appropriate reaction, advice and support."
        },
        {
            "text": "I am not surprised our reaction to HPAI in cattle in the US was efficient and effective as we have for some years benefitted from cross-government, multi-disciplinary capability and zoonotic disease incidents are routinely managed through the Human Animal Infections and Risk Surveillance (HAIRS) Group. With 32 members representing food, animal and public health agencies from across the UK, it truly demonstrates the power of openness and cooperation. For British cattle, HAIRS conducted a risk assessment that interrogated the possible pathways of disease entry and the likelihood of human exposure to HPAI H5N1. Their assessment is that the risk is currently very low, thanks in part to our high standards of national biosecurity and proactive cross-sector measures which enable us to prevent, detect, and swiftly respond to emerging threats."
        },
        {
            "text": "[Christine Middlemiss, Chief Veterinary Officer, at the AMR Multi-stakeholder Partnership Platform Steering Committee.]"
        },
        {
            "text": "AMR this year has had many stand-out moments as the UK works to reduce and prevent AMR. It is crucial all of us vets continue to work with farmers and industry and our counterparts internationally on this One Health risk. Last November I was appointed onto the AMR Multi-stakeholder Partnership Platform Steering Committee as Chair of the Government Cluster Group. It has been wonderful to join this groundbreaking initiative, and represent my veterinary, science and human health Government colleagues, working alongside stakeholders across sectors to act on AMR."
        },
        {
            "text": "In May, the UK launched our second 5-year AMR National Action Plan, supporting our 20-year vision to contain, control and mitigate AMR. We have already come a long way. The UK’s success in reducing antimicrobial use in food producing animals by 59% between 2014-22 makes us one of the lowest users of antibiotics across Europe. I am confident that through this second NAP we can lead the way on reducing antimicrobial use in all settings including hospitals, farms and in the community."
        },
        {
            "text": "A highlight for me this year was attending the Royal Society event for ‘The World Together Solving the Antibiotic Emergency’ in May, hosted by the UK Special Envoy for AMR, Dame Sally Davies. The energy and engagement in the room was fantastic, buoyed by several commitments to fund initiatives. I had the privilege of hosting a fabulous international animal focused panel session in this meeting to highlight the challenges of tackling AMR in animals globally."
        },
        {
            "text": "The World Organisation for Animal Health (WOAH), this year celebrated its 100th year. At the General Session in May, with the Swedish CVO my good friend Dr Lena Bjornerot, we held an 'AMR breakfast of Champions'. This event focused on ensuring veterinary and agriculture voices were part of negotiations and discussions leading up to the United Nations General Assembly High Level Meeting on AMR(known as the UNGA HLM). We welcomed CVOs, primarily from the Global South to the event, with the CVOs from India and Botswana sharing their experiences, perspectives and ambitions for the UNGA HLM."
        },
        {
            "text": "[Christine Middlemiss, Chief Veterinary Officer, at September’s United Nations General Assembly High Level Meeting on AMR in New Year]"
        },
        {
            "text": "The growing momentum throughout the year led to the pivotal moment in AMR - the UNGA HLM in September. Thanks to excellent cross government and international collaboration there was a strong recognition of the role of animals and agriculture in AMR with an action focused and ambitious One Health political declaration. The political declaration is just the first step – implementing the commitments must happen to stem the AMR tide."
        },
        {
            "text": "Every year One Health Day is a check-point to consider what I, and we, have done and what more we can do to continue to make collaboration a priority and strive for efficient, joined-up global solutions, ensuring a healthier, better future for both people and planet. "
        },
        {
            "text": "So this year I’ll continue being a voice and an ambassador for One Health in the Veterinary and Animal Health world. As a WOAH Council member, I am up for actively supporting WOAH in being the leading organisation for promoting the equal and science-based voice of animal health globally. The importance of WOAH's input to the WHO Pandemic Accord cannot be underestimated. When agreed, the Accord will lead to a better global position to respond to future pandemics and will reflect the important role of vets and agriculture in agreed preventative measures."
        },
        {
            "text": "The Fourth Ministerial Conference on AMR and the second Plenary of the AMR Multistakeholder partnership platform in Jeddah in November, are focusing on the implementation of the political declaration agreed at UNGA – a fantastic and important opportunity to turn intention into. There will be focus on ensuring one of the UK’s top priorities, the Independent Panel for Evidence for Action on AMR, is established in 2025.  "
        },
        {
            "text": "We know the disease challenges we face are becoming ever more complex. We know climate change will bring new hurdles for our farmers, veterinarians and ecologists. Our innovative, science-led, and united vet approach is vital. It is how we can effectively and sustainably tackle these challenges – and any unknowns they may bring."
        }
    ]
}