{
    "url": "https://defraenvironment.blog.gov.uk/2024/11/01/commonwealth-leaders-champion-global-ocean-action-in-samoa/",
    "title": "Commonwealth leaders champion global ocean action in Samoa",
    "authors": [
        "Tom Pye"
    ],
    "categories": [
        "Community",
        "Marine",
        "Nature"
    ],
    "pub_date": "2024-11-01T11:04:00+00:00",
    "content": [
        {
            "text": "The importance of nature has been propelled onto the international stage in recent weeks with many events taking place like The United Nations General Assembly and the Convention on Biological Diversity COP16."
        },
        {
            "text": "I’m Tom, head of the Ocean Climate and Science policy team at Defra."
        },
        {
            "text": "Last week, the 2024 Commonwealth Heads of Government Meeting (also known as CHOGM) took place in Apia, Samoa."
        },
        {
            "text": "This meeting is a chance for leaders from all 56 member countries to come together. This was His Majesty the King’s first CHOGM as Head of the Commonwealth and the first hosted by a Pacific Island Country. The Queen, Prime Minister, the Foreign Secretary and Lord Collins also attended."
        },
        {
            "text": "The central theme Samoa chose for this CHOGM was resilience: encompassing economic, environmental, societal and democratic resilience, with a particular emphasis on the needs of Small Island Developing States."
        },
        {
            "text": "Ocean issues such as marine pollution and biodiversity loss are prominent within the Commonwealth – which covers 36% of national marine waters globally and accounts for two thirds of the world’s Small Island Developing States."
        },
        {
            "text": "The meeting was a unique opportunity to champion ocean issues and drive forward action on ocean governance and protection."
        },
        {
            "text": "This is particularly relevant now, as we are in a critical period in which global action is needed to reverse the decline in ocean health and, as a result, its ability to support lives and livelihoods all over the world."
        },
        {
            "text": "The Ocean Declaration"
        },
        {
            "text": "An important outcome from this CHOGM was the Apia Ocean Declaration, which all the Commonwealth countries adopted."
        },
        {
            "text": "The declaration states the near-term Commonwealth shared priorities for the ocean’s protection and sustainable management."
        },
        {
            "text": "This includes the need to agree an ambitious, legally binding instrument to end plastic pollution at the final UN negotiating session in November."
        },
        {
            "text": "It also reiterates the urgency of implementing measures agreed at the World Trade Organisation prohibiting some harmful fisheries subsidies and concluding outstanding negotiations on subsidies relating to overcapacity and overfishing."
        },
        {
            "text": "The statement stresses the importance of protecting our ocean to bolster global efforts to address climate change and biodiversity loss, delivering on the goals of Kunming-Montreal Global Biodiversity Framework and the Paris Agreement."
        },
        {
            "text": "These actions would help protect our ocean, its biodiversity and the livelihoods of people all over the world who depend on it."
        },
        {
            "text": "Next steps"
        },
        {
            "text": "The UK is committed to working in partnership with other Commonwealth states to implement and champion the shared priorities in the declaration."
        },
        {
            "text": "We will do this both beyond the Commonwealth, in global forums and negotiations, and within it, through our role as co-chair of the Commonwealth Clean Ocean Alliance under the Commonwealth Blue Charter."
        }
    ]
}