{
    "url": "https://medregs.blog.gov.uk/2024/11/01/emerging-roadmap-and-transition-provisions/",
    "title": "Emerging Roadmap and transition provisions",
    "authors": [
        "Laura Squire"
    ],
    "categories": [
        "Diagnostics",
        "Med Tech Regulations"
    ],
    "pub_date": "2024-11-01T14:44:49+00:00",
    "content": [
        {
            "text": "A lot has happened in the month since my last blog, including the launch of the national conversation about the NHS and Budget announcement of additional funding for Life Sciences. This has highlighted the vital role of diagnostics and Med Tech in achieving the NHS shifts of hospital to community, analogue to digital and treatment to prevention. Those bigger picture issues are led elsewhere but they are important for us to have in mind. Our focus, as we develop our regulations, is always that the ultimate goal is to get safe devices to patients when they need them."
        },
        {
            "text": "Our vision is for innovators to choose the UK first. That is not something regulators alone can achieve but we can help. We want the UK to be first choice for clinical trials and investigational studies  but also for market access, building real world evidence here to support market access elsewhere.  That requires a UK regulatory framework which is robust and safe, so patients and other jurisdictions will trust it, but also one which provides innovators, particularly those of products that meet NHS needs, with clear paths to market access."
        },
        {
            "text": "We are still working on developing a revised roadmap for publication, which I hope to do before the end of the year, but ahead of that, delivery is continuing as set out below. There are also some future dates you might be interested in noting. I must stress that the legislative process is rightly, quite involved. As I have said before, there are checks and balances outside the control of the Agency, so many of these are indicative dates only."
        },
        {
            "text": "On 7 October we closed the call for applications for taking part in our AI Airlock, a regulatory sandbox which will enable us to work with partners, including the NHS, academia and developers, to inform future policy and guidance on how we regulate AI medical devices. We have had nearly 40 applications and are working through them to identify around 6 to take part in the pilot."
        },
        {
            "text": "On 21 October we took another step forwards in our roadmap, laying a statutory instrument to give greater clarity to manufacturers on the surveillance, vigilance and reporting requirements to ensure devices on the market in the UK continue to be safe and perform as expected. This is an important first step as it is a fundamental basis of regulation for us to know what is happening with products already on the market."
        },
        {
            "text": "We are progressing plans to offer abridged approvals for certain medical devices already approved by US FDA, Health Canada, TGA Australia and in Europe. We aim to launch a consultation on this, building on the statement we published in May. We also intend to consult on a more pragmatic approach to IVD regulation, taking into account lessons learned from the EU IVDR, and on whether we can offer more flexibility on the UK specific labelling requirements. To ensure we make the most of the 6 week consultation period we have begun pre-consultation meetings this week, starting with patient groups. We look forward to hearing your views when the consultation opens in mid-November."
        },
        {
            "text": "These provisions would be part of a statutory instrument which we aim to put before Parliament in 2025, which will also include Pre- Market measures to improve patient safety and the traceability of medical devices, such as Unique Device Identifiers (UDI) and Implant Cards for patients.  The timetable for the Pre-Market SI being laid in Parliament and becoming law is dependent on a number of external factors; the responses from WTO members on the draft, final drafting and legal checks, parliamentary timetables and how the parliamentary debates go."
        },
        {
            "text": "In the coming weeks we will be setting up a Guidance Working Group of stakeholders to review emerging guidance to support all our regulatory changes."
        },
        {
            "text": "By the end of 2024 we expect to have begun sharing an early draft of the legal text for the Pre-Market SI. This will be done through trusted advisor groups. The purpose of this is not to seek edits to the legal text – this early draft has been drafted by expert government lawyers based on policy instructions given by my team. Lawyers and MHRA will continue to review the draft to make sure it works from a policy and operational perspective.  Starting to share exactly what is in the legislation and the policy it is seeking to clarify will help with that and enable us to see what needs to be done to prepare for implementation."
        },
        {
            "text": "In the first couple of months of 2025 we aim to publish the results of our consultation on common specifications and CTDA  "
        },
        {
            "text": "By Spring 2025, we aim to publish the full text of the Pre-Market statutory instrument on the WTO website. By sharing legal text ahead of that, we hope to avoid what happened with PMS, where the publication on the WTO website attracted substantial comment which resulted in changes and delay."
        },
        {
            "text": "In parallel we have already started work to identify future continued evolution of the regulations to reflect a rapidly evolving technological and regulatory landscape including learning from IDAP about what innovators find useful and looking at options for controlled and safe early access."
        },
        {
            "text": "We continue to deliver our software roadmap and by the end of March 2025, we expect to have published draft guidance on Digital Mental Health Technologies, and AI Development and Deployment."
        },
        {
            "text": "We recognise that our IVD Roadmap has been long awaited. We have a draft in place but given the priority of diagnostics from the Darzi review and the Budget, we would like to take the opportunity of reviewing that with a view to publishing a revised roadmap in Spring 2025."
        },
        {
            "text": "A clear message from industry stakeholders in particular, is that they need to know asap what will be in the legislation, then have a reasonable runway for complying. Because of that I would like to finish off this blog by saying something about the emerging transition timelines we are developing. We alluded to these in the 2021 consultation, but a lot has happened since then and I have detected some anxiety that 2025 brings with it a ‘cliff edge’. It does not."
        },
        {
            "text": "Finally, I wanted to say something about the EU review of MDR and IVDR. Thank you to people who have passed on information and intelligence about that, including publications from EU trade bodies. I can assure you that we are keeping a close eye on the review, including through our IMDRF links."
        },
        {
            "text": "The scale of what the EU attempted was enormous. We are already taking a more step wise approach, more in line with the approaches of other IMDRF partners who are continuously improving their regulations in bite size chunks. When we finalise the new roadmap, it will include some policy development areas which may mean regulatory change in the future. These include areas such as early access for innovative products, and how we have a workable regime for Health Institutions which is compatible with the move from hospital to community. I look forward to working with you on those."
        }
    ]
}