{
    "url": "https://naturalengland.blog.gov.uk/2024/11/01/seabed-saviours-the-eu-life-recreation-remedies-project-comes-to-an-end/",
    "title": "Seabed Saviours - the EU Life Recreation ReMEDIES project comes to an end",
    "authors": [
        "Fiona Tibbitt"
    ],
    "categories": [
        "Biodiversity",
        "Climate change",
        "Marine environment",
        "Natural Capital",
        "Natural England",
        "Science and evidence"
    ],
    "pub_date": "2024-11-01T08:00:06+00:00",
    "content": [
        {
            "text": "By Fiona Tibbitt, Project Manager on the EU Life Recreation ReMEDIES "
        },
        {
            "text": "I have had the privilege of being Project Manager on the EU Life Recreation ReMEDIES project for the last one and half years. I’ll admit it was a daunting prospect and it took a long time to get my head round the complexity of the project, the multitude of wonderful people working on it and the nuances of all those relationships. The weight of responsibility was terrifying as I hadn’t done anything as big as this before. It was a lesson in doing things that scared me, and a big leap out of my comfort zone."
        },
        {
            "text": "Fortunately those wonderful people I mentioned earlier gave me a huge amount of support and encouragement and we marched on as a team. It has not been without its peaks and troughs, but we have made it to the end of the project, still smiling and feeling proud."
        },
        {
            "text": "The work has been innovative and challenging with many factors out of our control, so we couldn’t expect it to be anything else. I’m a big believer in the more you put in the more you get out, and that was certainly the case with this project."
        },
        {
            "text": "The influence of ReMEDIES has been wide-reaching, with much ‘added value’ where others have contributed, and we are hugely grateful. This has extended our reach and led to other projects which have incorporated ReMEDIES evidence or activity, creating a lasting ReMEDIES legacy."
        },
        {
            "text": "It is evident that the appetite and momentum for this work has expanded massively since the project started in 2019. Similar projects in the Solent (Solent Seascape), Essex Estuaries (Transforming the Thames), and Plymouth Sound (Plymouth National Marine Park) will take ReMEDIES work forward. This is hugely reassuring, as it was evident from the ReMEDIES educational work that sustained engagement has a much greater impact on learning."
        },
        {
            "text": "Measuring behaviour change is very difficult, let alone attributing it to any specific interventions, but it is evident that to reduce impacts on sensitive habitats, removal of pressures is the first and foremost action to consider. To do that effectively we need to take communities with us through comprehensive engagement with them - the people on the ground - helping find solutions. That can only be done in partnership, and Natural England is uniquely placed to do that through our area and national teams. However, if Natural England are to take a project-based approach to nature recovery, there is much to be learnt from externally funded projects to reduce risk."
        },
        {
            "text": "I have enjoyed my time on ReMEDIES and met some amazing, committed and determined people and really feel the marine nature recovery agenda is a greater priority now than it was when we started. However, until marine nature recovery is seen as an equal to terrestrial nature recovery and resourced proportionately, there’s still much more to do and I look forward to taking what I’ve learnt into new projects as part of the ReMEDIES legacy."
        },
        {
            "text": " "
        },
        {
            "text": "Leading up to the end-of-project conference, I wrote the poem below and dedicate it to all the wonderful people who’ve worked on ReMEDIES from 2019-2024."
        },
        {
            "text": "Seabed Saviours."
        },
        {
            "text": "Sacred seabed underwater, out of sight and out of mind."
        },
        {
            "text": "Harbours carbon and marine life, most people thought it was ‘fine’."
        },
        {
            "text": "But fragile habitats like maerl and meadows of seagrass,"
        },
        {
            "text": "Are struggling under human pressures and if continued they won’t last."
        },
        {
            "text": "Pollution, coastal development, commercial fishing and climate change,"
        },
        {
            "text": "May affect resilience, this is nothing strange."
        },
        {
            "text": "With more recreation and leisure activities too."
        },
        {
            "text": "Increased risk on sensitive habitats, what are we to do?"
        },
        {
            "text": "Recreational ReMEDIES is a Call for Action."
        },
        {
            "text": "Focus on reducing pressures is a key attraction."
        },
        {
            "text": "Education, research and seagrass restoration,"
        },
        {
            "text": "Must create behaviour change, awaken inspiration."
        },
        {
            "text": "Install advanced moorings and voluntary no anchor zones."
        },
        {
            "text": "Use of new technology, includes satellites and drones."
        },
        {
            "text": "Marine nature recovery with others in partnership."
        },
        {
            "text": "Creates bonds from shared goals, that turn into friendship."
        },
        {
            "text": "Share our learning and hopeful message for others to further take."
        },
        {
            "text": "Our resources and reporting, further impact they will make."
        },
        {
            "text": "Monitor and assess our efforts, create lasting legacy,"
        },
        {
            "text": "Save our Seabed for the future, enduring ReMEDIES."
        }
    ]
}