{
    "url": "https://educationhub.blog.gov.uk/2024/11/vat-private-schools-everything-you-need-to-know/",
    "title": "VAT on private schools: Everything you need to know",
    "authors": [
        "mediaofficer"
    ],
    "categories": [
        "Independent schools",
        "Schools"
    ],
    "pub_date": "2024-11-01T15:19:07+00:00",
    "content": [
        {
            "text": "Tax breaks for private schools will end from 2025 to enable better investment in state education, the Chancellor confirmed in the Budget 2024."
        },
        {
            "text": "We’re removing the exemption so that 20% VAT will be added to education and boarding fees charged by private schools from January and, from April, removing charitable business rate relief."
        },
        {
            "text": "We explain everything you need to know."
        },
        {
            "heading": 3,
            "text": "Why are you introducing VAT on private school fees?"
        },
        {
            "text": "We have ended tax breaks on private schools to improve standards and opportunities for the nine out of 10 children who attend state schools."
        },
        {
            "text": "The money raised from VAT will fund public services, including education priorities for the next academic year."
        },
        {
            "heading": 3,
            "text": "How much money will this raise?"
        },
        {
            "text": "The tax is expected to raise £1.725billion a year, according to the Treasury, to go towards the public finances and help improve education and outcomes for young people."
        },
        {
            "heading": 3,
            "text": "When will this come into effect?"
        },
        {
            "text": "The standard 20% VAT rate will be added to private school fees from 1 January 2025. Any fees paid from 29 July 2024 relating to the term starting in January 2025 and onwards will be subject to VAT."
        },
        {
            "text": "Private schools that are charities will lose charitable business rates relief – which provides an 80% discount on the rates they pay on their premises – from April 2025."
        },
        {
            "text": "Private schools are now able to register for VAT for education and boarding fees."
        },
        {
            "text": "Please check when you need to register for VAT because of these changes, using our new interactive guidance tool."
        },
        {
            "text": "HMRC will be hosting webinars on how to register for VAT, which you can sign up to here, or watch a recording."
        },
        {
            "heading": 3,
            "text": "Does this mean private school fees will go up by 20%?"
        },
        {
            "text": "We don’t expect that raising VAT will cause private school fees to go up by 20%."
        },
        {
            "text": "This is because private schools, like other businesses, don’t have to reflect the VAT increase in the amount fee payers are charged."
        },
        {
            "text": "On average, we predict the measures are likely to see fees rise by around 10%."
        },
        {
            "heading": 3,
            "text": "Will this put more pressure on state schools?"
        },
        {
            "text": "Evidence from the IFS shows that raising VAT on private schools will have limited impact on the state school sector."
        },
        {
            "text": "Over the last few years, the number of pupils enrolled at independent schools has remained largely the same, even when fees have increased by more than inflation."
        },
        {
            "text": "Because of this, we expect that around 35,000 pupils – less than 0.5% of the pupil population – across the UK will change schools to a state school from private schools."
        },
        {
            "text": "There is also lots of evidence to suggest that there are more than enough state school places for pupils who may move from a private school."
        },
        {
            "text": "As of last year, 83% of primary schools had one or more unfilled places - the highest rate in a decade. This is reflected in secondary schools too, with 77% having one or more unfilled places."
        },
        {
            "text": "We also work with local authorities to make sure there are enough school places for pupils living in the area."
        },
        {
            "heading": 3,
            "text": "How will this affect pupils with SEND?"
        },
        {
            "text": "How VAT affects private school fees for children with special educational needs and disabilities (SEND) depends on whether they have a local authority funded Education, Health and Care Plan (EHCP) and what it advises."
        },
        {
            "text": "Where Local Authorities fund pupils’ places in private schools (for instance, because the school is named in the pupil’s Education, Health and Care Plan), Local Authorities will be able to reclaim the VAT they are charged on these pupils’ fees."
        },
        {
            "text": "However, where parents and guardians choose to send their child with SEND to a private school, VAT will be applied to their fees. "
        },
        {
            "text": "This applies where they have an EHCP, but the local authority has decided that a private school place is not necessary to meet their needs."
        },
        {
            "text": "We are committed to making sure high-quality education is available for every child and will make sure there is earlier intervention in mainstream schools so that children with less complex needs can get the help they need."
        },
        {
            "heading": 3,
            "text": "Will fees that have been paid in advance also be taxed?"
        },
        {
            "text": "Any private school fees paid after 29 July 2024 for tuition and boarding fees covering a period on or after 1 January 2025 will be subject to 20% VAT."
        },
        {
            "text": "Any fees pre-paid before 29 July 2024 for tuition and boarding from 1 January 2025 may also be subject to 20% VAT depending on the arrangements that the pre-payment scheme made. "
        },
        {
            "text": "Your school will be able to provide more information on its pre-payment arrangements."
        },
        {
            "heading": 3,
            "text": "Does this mean private schools will end bursaries and scholarships in order to fund the additional costs?"
        },
        {
            "text": "How to fund new tax liabilities will be a commercial decision for individual schools, but there are a number of ways in which schools could choose to make cost savings."
        },
        {
            "text": "We’re not expecting these changes to have a significant effect on bursaries across the private school sector in general."
        },
        {
            "heading": 3,
            "text": "What does this mean for military families who send their children to boarding schools?"
        },
        {
            "text": "Recognising the enormous sacrifices our military families make, the Ministry of Defence and the Foreign and Commonwealth Office provide the Continuity of Education Allowance (CEA) to eligible Officials and Service Personnel."
        },
        {
            "text": "Ahead of the VAT policy coming into effect, the Ministry of Defence (MoD) and the Foreign, Commonwealth and Development Office (FCDO) will increase the funding allocated to the CEA, to account for the impact of any private school fee increases on the proportion of fees covered by the CEA, in line with how the allowance normally operates."
        },
        {
            "text": "The MoD and FCDO will set out further details shortly. "
        }
    ]
}