{
    "url": "https://defrafmp.blog.gov.uk/2025/08/21/dive-into-fmps-who-are-the-experts-delivering-defras-plans/",
    "title": "Dive into FMPs: who are the experts delivering Defra’s plans",
    "authors": [
        "Nicola Lewellen - FMP Engagement and Communications",
        "Claire Dyer - Policy Advisor, Defra"
    ],
    "categories": [
        "- Defra led FMPs",
        "Development and drafting"
    ],
    "pub_date": "2025-08-21T15:32:57+01:00",
    "content": [
        {
            "text": "As we progress with our fisheries management plans (FMP) journey we want to help you understand how the plans are delivered. "
        },
        {
            "text": "This is the second post in a three-part series to dive into FMPs. We hope that it helps you understand who does what, and how and when the valuable information, views, and opinions from experts and stakeholders are brought in. "
        },
        {
            "text": "Part one looked at our governance and part three will explore stakeholder engagement and some of the groups and forums that we lead or collaborate with. "
        },
        {
            "text": "In this post, we'll look at the experts that are delivering FMPs. "
        },
        {
            "text": "Collaboration is at the heart of these plans, and a range of individuals and organisations play crucial roles. Importantly, FMPs are co-designed with a range of stakeholders (more on this in our next blog post). "
        },
        {
            "text": "First, we’ll look at the teams and organisations that are directly involved in delivering the plans, from development to implementation, or putting them into action.  "
        },
        {
            "heading": 2,
            "text": "Defra  "
        },
        {
            "text": "Policy teams leading on FMPs also feed into, and sometimes lead, wider fisheries policies. They use evidence and expertise from within, and outside, Government to help guide decisions about how policies are developed and delivered. They coordinate FMP delivery partners (read about them below) and engage with stakeholder groups and experts. "
        },
        {
            "text": "Defra sets the strategic direction for English-led FMPs, making sure they align with the Fisheries Act, the Joint Fisheries Statement (JFS) and wider government objectives. Policy teams also support Ministers to develop and propose appropriate courses of action to help meet key government priorities.  "
        },
        {
            "text": "The expertise of teams across Defra is brought in to make sure FMPs work alongside other policies. These include legal as well as policy teams working on Remote Electronic Monitoring (REM), bycatch, discards and marine litter. As FMPs are evidence-based plans, the evidence team plays a vital role in sourcing available scientific and stakeholder information related to FMPs. "
        },
        {
            "heading": 2,
            "text": "Delivery partners "
        },
        {
            "text": "With 15 FMPs to draft and deliver, Defra engaged experts to help develop the plans.  "
        },
        {
            "text": "These partners play a key role during the development phase, gathering evidence, working closely with stakeholders and drafting the plans ready for public consultations. "
        },
        {
            "text": "They also share knowledge across all of Defra’s 15 FMPs, collaborate with devolved administrations, and contribute to our wider governance.  "
        },
        {
            "text": "Once an FMP is published, our delivery partners also help to implement the actions. "
        },
        {
            "text": "So far, six plans have been published, and their measures are already being introduced. By the end of 2025, a further five plans will be published, and a further four will be published by the end of 2026. More details on the plans can be found on GOV.UK. "
        },
        {
            "heading": 3,
            "text": "Marine Management Organisation (MMO)  "
        },
        {
            "text": "The MMO has developed the Channel demersal non quota species FMP (published in 2023), and is in the process of developing a further five, two due to be published by the end of 2025: Southern North Sea non-quota demersal, Southern North Sea skates and rays, and three to be published by the end of 2026: Celtic Sea and Western Channel demersal non quota species (in partnership with the Welsh government), seabream and wrasses complex. "
        },
        {
            "text": "As England’s marine manager and regulator for fishing activity, monitoring compliance, and managing marine space, MMO plays a key role in meeting the goals across all of Defra’s FMPs. This includes supporting key actions such as developing the Cuttlefish Action Plan from the Channel demersal non-quota species FMP and leading a task-and-finish group for the bass FMP. "
        },
        {
            "text": "🔗MMO website "
        },
        {
            "heading": 3,
            "text": "Seafish "
        },
        {
            "text": "The crab and lobster, and whelk FMPs were developed by Seafish in collaboration with the industry-led Crab & Lobster and Whelk Management Groups respectively. The plans were published in December 2023. "
        },
        {
            "text": "They are supporting MMO and Defra with the implementation of the shellfish plans and are also supporting the Scottish Government to lead development on two nephrops FMPs, covering the North Sea and the West Coast of Scotland.  "
        },
        {
            "text": "🔗Seafish website "
        },
        {
            "heading": 3,
            "text": "Scallop Industry Consultation Group Working Group (SICGWG)  "
        },
        {
            "text": "The group brings together industry, regulators, policy makers and researchers and they developed the King scallop FMP on behalf of Defra and the Welsh government. This was published in December 2023.  "
        },
        {
            "heading": 3,
            "text": "The Association of Inshore Fisheries and Conservation Authorities (AIFCA)  "
        },
        {
            "text": "AIFCA is the national body that represents, supports and collaborates with England’s 10 Inshore Fisheries and Conservation Authorities (IFCA)- more on them below.  "
        },
        {
            "text": "They draw on their member’ local knowledge and expertise in the development of FMPs, ensuring that the proposed measures are realistic and will work properly, and provide policy advice to integrate FMPs and regional inshore management. "
        },
        {
            "text": " The cockle FMP was developed with AIFCA. "
        },
        {
            "text": "🔗AIFCA website "
        },
        {
            "heading": 3,
            "text": "Centre for Environment, Fisheries, and Aquaculture Science (Cefas)  "
        },
        {
            "text": "Scientific research and evidence play a key role in shaping FMPs, and Cefas, the government’s marine and freshwater science organisation, is a key partner.  "
        },
        {
            "text": "They provide evidence-based advice for existing fisheries management and technical measures which inform development across all FMPs. "
        },
        {
            "text": "The North Sea and Channel sprat FMP was developed with Cefas in partnership with the Scottish Government.  "
        },
        {
            "text": "🔗Cefas website "
        },
        {
            "text": "Find out more about evidence in our post: Introduction to the role of evidence in fisheries management plans.   "
        },
        {
            "heading": 2,
            "text": "Other experts  "
        },
        {
            "text": "Alongside delivery partners, other experts have been involved across the FMPs. Bringing in their expertise is an important part of FMP development and key to making sure FMPs can deliver.  "
        },
        {
            "text": "Here are some of them. "
        },
        {
            "heading": 3,
            "text": "Inshore Fisheries and Conservation Authorities (IFCAs)  "
        },
        {
            "text": "There are 10 regional IFCAs in England that are responsible for managing inshore fisheries in English waters out to six nautical miles (nm).   "
        },
        {
            "text": "They lend their local knowledge and expertise to the development of FMPs, ensuring that the proposed measures are realistic and will work properly, and then oversee and enforce them once active. "
        },
        {
            "text": "🔗 IFCAs "
        },
        {
            "heading": 3,
            "text": "Statutory Nature Conservation Bodies (SNCBs) "
        },
        {
            "text": "As UK government agencies responsible for nature conservation and protection, these also play an important role. "
        },
        {
            "text": "Natural England is the government's adviser for the natural environment in England, helping to protect the marine environment out to 12nm.  "
        },
        {
            "text": "JNCC (Joint Nature Conservation Committee) advises the UK government and devolved administrations on the natural environment beyond the 12nm limit offshore to the continental shelf.  "
        },
        {
            "text": "Both organisations provide nature conservation advice to support the development of FMPs. For example, they assessed potential risks from fisheries activities to protected features in Marine Protected Areas and UK Marine Strategy Descriptors to ensure sustainable fisheries are underpinned by resilient ecosystems for the Southern North Sea and Channel skates and rays FMP.  "
        },
        {
            "text": "Other experts are also brought in through working groups or where a need is identified. For example, stakeholder engagement was facilitated by Policy Lab to jointly develop potential solutions for managing bass to inform the goals and actions of the FMP.   "
        },
        {
            "text": "Once the draft plans go to public consultation, all stakeholders are given the opportunity to share their thoughts to further shape the plans, bringing in expertise and knowledge from those who are interested, before the plans are finalised and published. "
        },
        {
            "heading": 2,
            "text": "Dive into FMPs- what’s next "
        },
        {
            "text": "We have now talked about our FMP governance and the experts, but an important part is missing and that’s engagement with our stakeholders- you!  "
        },
        {
            "text": "The next in this blog series will cover stakeholder engagement and groups and forums, how they input into the delivery of FMPs and how you can get involved. "
        }
    ]
}