{
    "url": "https://marinescience.blog.gov.uk/2025/08/21/tackling-the-silent-pandemic-uks-fao-antimicrobial-resistance-reference-centre-leads-singapore-workshop/",
    "title": "Tackling the “Silent Pandemic” – UK’s FAO Antimicrobial Resistance Reference Centre leads Singapore workshop",
    "authors": [
        "Athina Papadopoulou"
    ],
    "categories": [
        "Animal Health",
        "Aquaculture",
        "International",
        "Science"
    ],
    "pub_date": "2025-08-21T15:59:05+01:00",
    "content": [
        {
            "text": "As part of the UK’s FAO Reference Centre for Antimicrobial Resistance (AMR), Cefas recently co-delivered a five-day workshop on Antimicrobial Susceptibility Testing (AST) for bacterial pathogens relevant to aquatic organisms, together with the UK’s Animal Plant Health Agency (APHA), the United Nation’s Food and Agriculture Organisation Regional Office for Asia and the Pacific (FAO RAP) team and Singapore’s National Parks (NParks),"
        },
        {
            "text": "Three UK government organisations (Cefas, the Animal and Plant Health Agency and Veterinary Medicines Directorate (VMD)) jointly hold the UK Food and Agriculture Organisation of the United Nations (FAO) AMR Reference Centre, which is funded by the Fleming Fund, a UK Aid programme managed by the UK’s Department of Health and Social Care (DHSC)."
        },
        {
            "text": "The Reference Centre provides independent technical and scientific advice to safeguard animal and human health from the threat of antimicrobial resistance. Our mission is to provide world leading scientific and policy expertise within the global community to tackle antimicrobial resistance in terrestrial and aquatic animals and their environments."
        },
        {
            "text": "Representatives from aquatic animal AMR National Reference Laboratories, or equivalent, participated from 11 countries in South Asia and Southeast Asia including Bangladesh, China, India, Indonesia, Malaysia, Nepal, Papua New Guinea, Philippines, Sri Lanka, Thailand, and Vietnam. The participants were supported by the EU-funded Regional Tripartite AMR Project and the UK’s DHSC Fleming Fund. The workshop took place in the state-of-the art facilities at NParks Singapore."
        },
        {
            "text": "The workshop aimed to enhance participating countries’ ability to detect AMR in aquatic animals, to produce quality data which can be used for antimicrobial stewardship and contribute to sustainable agrifood systems transformation. The objectives of the training were to:"
        },
        {
            "text": "These objectives were achieved through theoretical and practical hands-on laboratory sessions."
        },
        {
            "text": "Participants found the workshop to be very useful and will share the knowledge with colleagues in their own laboratories to enhance capabilities used to tackle this global challenge."
        },
        {
            "text": "Pu Channapha, Thailand, said “The knowledge and practical insights gained from the workshop are highly valuable and will certainly contribute to the ongoing efforts in AMR surveillance and capacity building in my country.”"
        },
        {
            "text": "Mattew Agive, Papua New Guinea, said “Indeed, I have learnt a lot from this training workshop. This training was more technical with hands on bench training, and I must admit such training is what a Lab testing officer must be exposed to. The Bacteriology Lab capacity and the set up was very conducive and well prepared for the training. At this juncture, I would also like to acknowledge the effort of the trainers, the level of knowledge with respect to AMR/AST you have imparted to us is commendable. Also, I would like to thank all the staff of NParks Animal & Plant Health Center who have assisted in one way or the other. ”"
        },
        {
            "text": "Andy Powell on behalf of the UK team said \"The training event was truly humbling, seeing the interaction and engagement of experts from so many different countries, and we learnt a lot from each other. The delegates’ commitment and dedication were evident and I hope that the sense of unity continues after the event, through the AMR community of practice and collaboration. We received excellent support from the host laboratory, Singapore NParks, making the event a great success. From the initiation of the project, they have been very professional and proactive, and we are very appreciative of their contribution.”"
        }
    ]
}