{
    "url": "https://companieshouse.blog.gov.uk/2025/08/21/understanding-how-the-financial-technology-industry-uses-companies-house-data/",
    "title": "Understanding how the financial technology industry uses Companies House data ",
    "authors": [
        "Corporate Research and Evaluation team"
    ],
    "categories": [
        "Changes to UK company law",
        "User research"
    ],
    "pub_date": "2025-08-21T13:13:16+01:00",
    "content": [
        {
            "text": "As the financial technology (fintech) landscape rapidly changes, data is an increasingly critical asset. Fintech companies are businesses that use innovative digital technologies to deliver financial services and products. These can include:"
        },
        {
            "text": "Companies House is working with PUBLIC to carry out research into how fintech companies use and value the data on our register. This research follows the introduction of the Economic Crime and Corporate Transparency Act 2023."
        },
        {
            "heading": 2,
            "text": "Our new powers"
        },
        {
            "text": "Under the act, Companies House has stronger powers to tackle economic crime and support economic growth."
        },
        {
            "text": "Changes we’ve made as a result of our new powers include:"
        },
        {
            "text": "These powers represent a fundamental shift in the role of Companies House, from being a collector of information to becoming an active gatekeeper of the accuracy and integrity of information on our registers."
        },
        {
            "heading": 2,
            "text": "Companies House fintech survey"
        },
        {
            "text": "We’re inviting fintech organisations to take part in our latest survey, which will play an important role in shaping the future of Companies House.Our research aims to understand the current and future value of the data on our registers specifically for fintech businesses."
        },
        {
            "text": "By completing the survey, you’ll have the opportunity to provide direct feedback on the relevance and use of our data, helping us to refine our approach and deliver more targeted, effective support to the fintech sector."
        },
        {
            "heading": 2,
            "text": "Take part in the research  "
        }
    ]
}