{
    "url": "https://defradigital.blog.gov.uk/2025/08/21/why-we-built-a-user-research-manual-and-why-it-matters-more-than-you-think/",
    "title": "Why we built a user research manual (and why it matters more than you think)",
    "authors": [
        "Jason Stockwell"
    ],
    "categories": [
        "Defra digital",
        "User centred design",
        "User research"
    ],
    "pub_date": "2025-08-21T15:13:45+01:00",
    "content": [
        {
            "text": "Jason Stockwell, Research Operations, reflects on the work done to develop a user research manual for Defra and the importance of consistency across user research."
        },
        {
            "text": "When designing digital services, we need to test them to make sure they meet user needs. Where these services are incredibly complex, with a lot of dependencies and assumptions, a lot can get lost. In Defra, we have a dedicated research operations team to take these user research practices and scale them to have greater impact across the organisation."
        },
        {
            "text": "Research operations is becoming increasingly fundamental to the way digital delivery functions in government. There is a need for a department to standardise the way research is approached to support user researchers to do their job well, understand the intricacies of the department, and hit research deadlines"
        },
        {
            "text": "This need highlights a real problem. Inconsistency."
        },
        {
            "text": "There’s inconsistency across user research in how we recruit participants. In how we handle consent. In how we store data. In how we talk about research."
        },
        {
            "text": "When these things vary wildly between teams or projects, it doesn’t just slow us down, it risks undermining the quality and credibility of our work."
        },
        {
            "text": "Operationally, inconsistent approaches can lead to:"
        },
        {
            "heading": 2,
            "text": "What do we mean by consistency?"
        },
        {
            "text": "Consistency doesn’t mean uniformity or rigidity. It means having a shared understanding about the way to do things."
        },
        {
            "text": "Research operations isn’t the flashiest part of user research, but it’s the foundation everything else rests on. Without clear processes, guidance and tools, even the best researchers can struggle."
        },
        {
            "text": "That’s where the manual comes in. It helps us:"
        },
        {
            "text": "These aren’t just nice-to-haves. They’re benchmarks laid out for what good research ops looks like. And we’re getting there."
        },
        {
            "heading": 2,
            "text": "Why we needed a manual"
        },
        {
            "text": "The user research manual was born out of a shared need. Across Defra, researchers were asking the same questions, facing the same challenges, and often turning to user research leads or the research operations teams for guidance. We needed a place to bring that knowledge together, not as a rulebook, but as a living, evolving guide."
        },
        {
            "text": "This user research manual is a:"
        },
        {
            "text": "It doesn’t replace conversations or critical thinking. It’s not 'the only way' of doing all user research. It’s a way to bring us closer together in how we work."
        },
        {
            "heading": 2,
            "text": "More than a manual"
        },
        {
            "text": "This isn’t just about processes. It’s about culture. About making user research more accessible, more inclusive and more consistent across Defra."
        },
        {
            "text": "It’s about showing that we take our craft seriously and that we’re building something that supports everyone."
        },
        {
            "text": "The user research manual isn’t a finished product, and it’s not meant to be. As our practices evolve, as new challenges emerge and as we learn from each other, the manual should reflect that."
        },
        {
            "text": "Keeping it alive means:"
        },
        {
            "heading": 2,
            "text": "The value of a team"
        },
        {
            "text": "To keep the manual useful and trustworthy, we need people who can steward it. The research operations team aren’t there to control or restrict, they’re there to protect the integrity of the resource, ensure quality and help guide its evolution."
        },
        {
            "text": "Having a team responsible for this content helps give:"
        },
        {
            "text": "Having gatekeepers means the manual stays coherent, credible and genuinely helpful. It’s a way to balance openness with accountability."
        },
        {
            "heading": 2,
            "text": "Where we go from here"
        },
        {
            "text": "We’ve reached a milestone. The user research manual is here, it’s live and we have started using it. But this isn’t the end. It’s a foundation we’ll build on in Defra as a user research community."
        }
    ]
}