{
    "url": "https://ukhsa.blog.gov.uk/2023/10/09/5-reasons-to-vaccinate-your-under-5s-against-flu/",
    "title": "5 reasons to vaccinate your under-5s against flu",
    "authors": [
        "Blog Editor"
    ],
    "categories": [
        "flu"
    ],
    "pub_date": "2023-10-09T11:16:50+01:00",
    "content": [
        {
            "text": "\nFlu season is just around the corner, and now is the time to get protected. If you are a parent of eligible pre-schoolers, make sure that you book your child in with their GP practice for the nasal spray that protects against flu. Flu can be an unpleasant illness in children, causing fever, extreme tiredness, aching muscles and joints, stuffy nose, dry cough, and sore throat. Most children recover within a week and are well enough to go back to nursery or school, but for some it can be life-threatening."
        },
        {
            "text": "Children aged 6 months to 2 years with a long-term health condition that increases flu risk are eligible, including those ever admitted overnight for a lung infection, and those with conditions like diabetes. These children will be offered a flu vaccine injection instead of the nasal spray. This is because the nasal spray is not licensed for children aged under 2 years."
        },
        {
            "text": "Primary and secondary school students can also get the nasal spray vaccine at school – make sure you sign the consent form. A vaccination session will be held at schools during the autumn term and the immunisation team will contact you via the school. For 2- and 3-year-olds, you should receive an invitation for your child to have it at their GP surgery. Parents can also contact them directly to book an appointment."
        },
        {
            "heading": 2,
            "text": "Here are 5 reasons your under-5s should have the flu vaccine:"
        },
        {
            "heading": 3,
            "text": "1. Protect your child"
        },
        {
            "text": "Children under 5 have the highest hospitalisation rate due to flu – 6,000 in England last winter. Vaccination cuts the hospitalisation risk by around two-thirds. It helps protect against complications like pneumonia and painful ear infections."
        },
        {
            "heading": 3,
            "text": "2. Protect family and friends"
        },
        {
            "text": "Pre-schoolers are excellent at spreading germs! Vaccinating your child helps reduce the chance of others in your family who are higher risk, like grandparents or those with long-term conditions, getting flu."
        },
        {
            "heading": 3,
            "text": "3. No needles!"
        },
        {
            "text": "The nasal spray is painless and easy to have. It contains weakened flu viruses to help your child build immunity and fight off flu. The vaccine is absorbed into the nose really quickly, so even if your child sneezes right after, it still works. For children who can’t have the nasal spray for medical reasons, an injection is available"
        },
        {
            "heading": 3,
            "text": "4. It’s better than having flu"
        },
        {
            "text": "The nasal spray helps protect against flu, has been given to millions of children in the UK and worldwide, and has an excellent safety record. In the last few years, the protection that children get from vaccination has been consistently higher than for adults. The vaccine is updated yearly to match flu strains, so we recommend vaccinating yearly, even if vaccinated last year."
        },
        {
            "heading": 3,
            "text": "5. Avoid costs and time off work"
        },
        {
            "text": "Juggling a sick child and work is tough. Vaccinating isn't just about your child's health, it's smart for parents. If your child gets flu, you may have to take time off or find childcare. The nasal spray vaccine means fewer missed workdays and is free on the NHS."
        },
        {
            "text": "Get your family winter strong by booking in eligible under-5s with your GP practice or making sure you sign a consent form if one is sent home from school."
        }
    ]
}