{
    "url": "https://ruralpayments.blog.gov.uk/2023/10/09/celebrating-25-years-of-bcms-with-terry-gadd/",
    "title": "Celebrating 25 years of BCMS with Terry Gadd",
    "authors": [
        "RPA Editor"
    ],
    "categories": [
        "BCMS"
    ],
    "pub_date": "2023-10-09T12:09:11+01:00",
    "content": [
        {
            "text": "Terry Gadd, RPA lead for livestock and trader scheme related services, is responsible for the operation of the British Cattle Movement Service (BCMS), the RPA’s specialised cattle tracing organisation, which is celebrating 25 years of operation. In this blog he talks about the work of BCMS and the services it provides. Read our previous blog Celebrating 25 years of the BCMS."
        },
        {
            "text": "My team and I are immensely proud of the quality and longevity of the services we have provided to our customers over the last 25 years. BCMS has been a well-respected and trusted service since its formation, and over that time has successfully processed approximately 453 million cattle transactions, issued nearly 68 million cattle passports, and processed almost 318 million cattle movements… a monumental achievement."
        },
        {
            "text": "The services we provide at BCMS make it possible to check which animals are present on a keeper’s holding, where an animal has been during its life, trace animals exposed to disease risk and provide assurance to buyers about an animal’s life history. This all plays a key role in livestock traceability, disease control and maintaining customer confidence in beef and its origin."
        },
        {
            "text": "BCMS was introduced in 1998 against the backdrop of the BSE epidemic, and later became part of RPA. We maintain the Cattle Tracing System (CTS), a register of all births, deaths, movements and imports of cattle for disease control purposes, issuing cattle passports for each bovine animal as well as recording where individual cattle are being kept. An effective cattle traceability system is seen as essential to control the spread of infectious diseases."
        },
        {
            "text": "We also work closely with RPA colleagues in our Customer Contact Centre who operate a dedicated livestock helpline and work collaboratively with Local Authorities and our colleagues in our Regulatory & Advice Service (RAS) around enforcement action for cattle keepers who are not complying with the Cattle Identification Regulations."
        },
        {
            "text": "Celebrating our 25 anniversary is a major milestone and my team and I are immensely proud of the quality and longevity of the services we’ve provided and how well respected and trusted BCMS has become with our livestock customers and key stakeholders."
        },
        {
            "text": "This has been demonstrated through the excellent feedback we’ve received from our customer satisfaction surveys and continues to be demonstrated via ongoing engagement with our customers on a daily basis."
        },
        {
            "text": "Key to this has been the hard work and dedication of the people working both in BCMS and across wider RPA. Also, listening to, and working closely with, industry stakeholders and understanding the needs of the variety of different livestock customers we support has been essential to delivering such a quality and user-friendly service. Without their insight and support we wouldn’t have been able to provide the services we do."
        },
        {
            "text": "Recently, the Livestock Information Service (LIS) sheep bureau moved into RPA. Working with Livestock Information Ltd we will now manage the movement traceability for sheep, goats, and deer for England, alongside our existing cattle services.  This forms part of the wider Livestock Information Transformation Programme, which will replace the existing traceability databases with one multi-species platform. This is an exciting time as we now start the journey to become one flexible team delivering traceability services in England for multiple livestock species."
        }
    ]
}