{
    "url": "https://greatbritishnuclear.blog.gov.uk/2023/10/09/companies-selected-for-next-stage-of-nuclear-energy-competition/",
    "title": "Companies selected for next stage of nuclear energy competition",
    "authors": [
        "Lucky Nwosu"
    ],
    "categories": [
        "Nuclear"
    ],
    "pub_date": "2023-10-09T14:59:16+01:00",
    "content": [
        {
            "text": "In October 2023, Great British Nuclear announced that six organisations had their designs selected to progress to the next stage of a government competition to support the development of innovative technology to boost Britain's energy security and sustainability. The Small Modular Reactor (SMR) competition is part of the government's plan to revive nuclear power."
        },
        {
            "text": "EDF, GE-Hitachi Nuclear Energy International LLC, Holtec Britain Limited, NuScale Power, Rolls-Royce SMR, and Westinghouse Electric Company UK Limited have been selected to go forward to the next stage."
        },
        {
            "heading": 2,
            "text": "Why Small Modular Reactors?"
        },
        {
            "text": "Small Modular Reactors (SMRs) are smaller, can largely be built in factories, and that could make construction faster and more cost-effective. They have the potential to transform how power stations are built. Because they are cheaper, they should be easier to finance as well."
        },
        {
            "heading": 2,
            "text": "What are the organisations proposing?"
        },
        {
            "text": "The technologies proposed by the organisations are varied. We will look at each vendor individually, below."
        },
        {
            "heading": 3,
            "text": "EDF"
        },
        {
            "text": "EDF's Nuward is a SMR plant with two independent reactors."
        },
        {
            "text": "EDF say these are housed in a single nuclear building and introduce a balanced approach to using technologies and innovations to boost constructability, operational competitiveness, and environmental performance."
        },
        {
            "text": "More information, and videos exploring their technology, can be found at the EDF Nuward website."
        },
        {
            "heading": 3,
            "text": "GE-Hitachi"
        },
        {
            "text": "The technology proposed by GE Hitachi is the BWRX-300 Small Modular Reactor."
        },
        {
            "text": "GE Hitachi says its SMRs are powered by proven and commercially available fuel and has an innovative and simplified build. This results in less steel and concrete for construction."
        },
        {
            "text": "It offers 300 MW of carbon-free power, world-class safety, and can be used for electricity generation and industrial applications. This includes hydrogen production, desalination, and district heating."
        },
        {
            "text": "More information can be found at the GE Hitachi website."
        },
        {
            "heading": 3,
            "text": "Holtec"
        },
        {
            "text": "The design proposed by Holtec Britain is the Holtec International SMR-160+."
        },
        {
            "text": "The company says it has been created to provide a an inherently safe and secure SMR based on proven pressurised water reactor technology consistent with UK supply chain."
        },
        {
            "text": "An SMR-160+ will produce 300 MW of electricity (net) and can operate using either a water-cooled condenser, or an air-cooled condenser for water-challenged areas."
        },
        {
            "text": "More information can be found at the Holtec Britain website."
        },
        {
            "heading": 3,
            "text": "NuScale Power"
        },
        {
            "text": "The offering from NuScale enables a multi-module plant design, which the company says means a power plant utilizing NuScale's SMR technology can produce reliable clean electricity while allocating one or more modules for applications like hydrogen production or water desalination."
        },
        {
            "text": "NuScale Power Modules are fully factory fabricated with no in-field construction. This keeps costs low, consistent and predictable; and makes power plants using NuScale technology less expensive to build, operate and maintain."
        },
        {
            "text": "NuScale's SMR technology holds key advantages in design maturity, regulatory approval and supply chain development, which can accelerate the timeline for reaching the UK's goal of deploying 25 gigawatts of new nuclear capacity."
        },
        {
            "text": "More details can be found at the NuScale Power website."
        },
        {
            "heading": 3,
            "text": "Rolls-Royce SMR"
        },
        {
            "text": "The Rolls-Royce SMR uses proven Pressurised Water Reactor technology and standard fuel, currently operating in many reactors globally."
        },
        {
            "text": "Designed and built in the UK, their SMR power station would have the capacity to generate 470MWe of low-carbon electricity, enough to power a million homes for 60+ years."
        },
        {
            "text": "The Rolls-Royce SMR is low-cost, deliverable and scalable. Further information can be reviewed at the Rolls-Royce SMR website."
        },
        {
            "heading": 3,
            "text": "Westinghouse"
        },
        {
            "text": "Westinghouse says its AP300 Small Modular Reactor is advanced, proven and readily deployable. It offers a cleaner energy mix, energy security, and grid flexibility and stabilisation."
        },
        {
            "text": "The AP300 has a smaller safety related footprint, which aims to reduce construction, as well as operational and maintenance costs."
        },
        {
            "text": "You can find out more at the Westinghouse SMR website."
        },
        {
            "heading": 2,
            "text": "Next steps"
        },
        {
            "text": "The chosen designs have been considered by Great British Nuclear and the government to be the most likely to deliver operational SMRs by the mid-2030s."
        },
        {
            "text": "The next stage of the process will be launched as soon as possible, where successful companies will shortly be able to bid for government contracts."
        },
        {
            "text": "The ambition is to announce in spring 2024 which of the six companies the government will support, with contracts awarded by summer 2024. This timetable aims to make this competition the fastest of its kind in the world."
        },
        {
            "text": "To stay up to date on the latest news regarding the Small Modular Reactor competition, follow Great British Nuclear on LinkedIn and Twitter (X)."
        }
    ]
}