{
    "url": "https://prisonjobs.blog.gov.uk/2023/10/09/kens-career-journey/",
    "title": "Ken's career journey",
    "authors": [
        "Ministry of Justice"
    ],
    "categories": [
        "Black History Month",
        "Career progression",
        "Culture",
        "Personal stories"
    ],
    "pub_date": "2023-10-09T16:53:20+01:00",
    "content": [
        {
            "heading": 3,
            "text": "Throughout October we will be covering Black History Month, sharing stories from those inside the HM Prison and Probation Service (HMPPS). We spoke to HMP Whitemoor’s Kenneth 'Ken' Tangie about his career journey with HMPPS."
        },
        {
            "text": "Ken taught French and English in Cameroon before studying a PHD in educational research at Cambridge University while working with young people with challenging behaviours. But Ken wanted a more stable career after deciding to start a family."
        },
        {
            "text": "After finishing his PHD and publishing a book, Ken wanted to make a positive impact on people’s lives and use his teaching skills to work with prisoners and break the cycle of crime."
        },
        {
            "text": "Since joining the Prison Service in 2006, Ken climbed the ranks to become one of HMP Woodhill’s governors and is now Head of Offender Management Unit (OMU) at HMP Whitemoor."
        },
        {
            "text": "Ken says: \"During the last few years of university, I was an educational research assistant on a fixed-term contract but I was keen to get into full-time employment. "
        },
        {
            "text": "\"I also started working in a residential home with young people with complex emotional and behavioural problems and really enjoyed it, which is where my interest in working with those in the crime cycle began."
        },
        {
            "text": "\"I knew I wanted to work with people where I felt I could break the cycle of crime and help people get onto the straight and narrow. That’s when I spotted an advert for prison officer jobs, so I contacted the governor at the time, who explained that I had so many transferable skills from my role as a teacher and in the residential home such as working with challenging people."
        },
        {
            "text": "“He also explained how communication skills were important because you can often get into difficult conversations with people, but my role as a teacher and in a classroom with different behaviours meant I already had the necessary skills."
        },
        {
            "text": "\"I love the job and being able to work with prisoners. I learnt straight away that there were so many opportunities for progression too, so I’m so glad I made the career move.\""
        },
        {
            "text": "\"You need resilience to be a prison officer and you must have good conversation skills. It’s a challenging career and it can sometimes be demanding but I always say to new starters not to give up at the first hurdle. We play an important role in turning people’s lives around."
        },
        {
            "text": "\"It’s a rewarding career and you can pick up so many new skills every week. You can move into lots of different roles such as intelligence, working in workshops, security, or becoming a physical education instructor, to name a few.\""
        }
    ]
}