{
    "url": "https://insideDIO.blog.gov.uk/2023/10/09/maximising-safe-public-access-on-salisbury-plain-training-area/",
    "title": "Maximising safe public access on Salisbury Plain Training Area",
    "authors": [
        "James Nevitt"
    ],
    "categories": [
        "Public Access",
        "Salisbury Plain Training Area",
        "Volunteering"
    ],
    "pub_date": "2023-10-09T15:48:52+00:00",
    "content": [
        {
            "text": "Salisbury Plain Training Area (SPTA) is the UK’s largest military training area, covering 11% of Wiltshire and a small part of Hampshire. Ensuring the fine balance between providing a place for our Armed Forces to train safely and maintaining public access to Salisbury Plain’s unique landscapes takes a lot of hard work – from both our teams here at DIO and through the work of dedicated volunteers."
        },
        {
            "text": "These volunteers give up their own time to make SPTA a safer place for everyone – whether it’s someone out walking their dog or soldiers training for combat."
        },
        {
            "heading": 2,
            "text": "The importance of the volunteer community"
        },
        {
            "text": "Since April this year, the Salisbury Plain Rights of Way Volunteers have already given 370 hours of their time, equating to 46 working days. To date, the volunteers have installed, repaired or replaced more than 2,000 rights of way signs and waymarks across the training area."
        },
        {
            "text": "This vital work has been carried out since 2006, when the group of volunteers was established by Nigel Linge MBE, then working as Range Safety Officer for the training area."
        },
        {
            "text": "A retired Lieutenant Colonel, Nigel has a long history of supporting the balance of military training requirements with public access across SPTA. If you’ve been following the MOD’s annual Sanctuary Awards and magazine, you may recognise the name – Nigel was the worthy winner of the coveted Silver Otter trophy in 2021 for his work with the volunteers."
        },
        {
            "text": "Despite retiring in 2014, Nigel continues to be an invaluable ally to the MOD, giving up his time to lead the group of volunteers whose continuing role in maintaining safe public access to SPTA has now been recognised in a formal agreement."
        },
        {
            "heading": 2,
            "text": "The Volunteer Arrangement"
        },
        {
            "text": "The Volunteer Arrangement for the Salisbury Plain Rights of Way Volunteers provides a framework for ongoing support from DIO Senior Training Safety Officers, who have a broad remit in overseeing military training activities and use of SPTA. It also supports the continued provision of funding and materials through the DIO Conservation Stewardship Fund, which is delivering a programme of conservation and environmental stewardship projects across the Defence estate."
        },
        {
            "text": "The arrangement will also see Wiltshire Council provide support for the volunteers, ranging from induction training to providing appropriate insurance so volunteers can carry out their work safely."
        },
        {
            "text": "This new agreement also sets out a formal process for the appointment of a future Volunteer Coordinator to lead the team when Nigel Linge eventually hands over the role, following many years of service to the military community and wider public."
        },
        {
            "text": "The agreement is welcome news for everyone involved, and it’s a perfect example of the positive ongoing partnership work between DIO, Wiltshire Council and the Salisbury Plain Rights of Way Volunteers."
        },
        {
            "text": "The agreement will ensure longevity within the volunteer community at the same time as securing a commitment to continued support from DIO and Wiltshire Council – all towards the crucial aim of balancing military training with safe, appropriate public access across SPTA."
        },
        {
            "text": "If you are planning to visit Salisbury Plain Training Area, please follow these simple steps:"
        },
        {
            "text": "• Check live firing times on GOV.UK\n• Stick to public rights of way and marked permissive paths and tracks\n• Take notice of red flags, red lights and signage which indicate where and when access is prohibited\n• Never touch military debris on the ground. Report it for safe removal"
        }
    ]
}