{
    "url": "https://defrafarming.blog.gov.uk/2023/10/09/new-entrant-support-scheme-pilots-our-initial-findings/",
    "title": "New Entrant Support Scheme pilots: our initial findings",
    "authors": [
        "Henry Leveson-Gower"
    ],
    "categories": [
        "Payments for entering farming"
    ],
    "pub_date": "2023-10-09T12:24:47+01:00",
    "content": [
        {
            "text": "Earlier this year, I shared an update on the New Entrant Support scheme pilots. In the post, I included portraits of our participants. "
        },
        {
            "text": "Since the pilots finished in May, we have been busy evaluating them using participant surveys, interviews and reports from the pilot leaders.   "
        },
        {
            "text": "With close to 200 pilot participants, there was a lot of valuable feedback to analyse, and we continue to learn from it. "
        },
        {
            "text": "In this post, I’d like to share our initial findings so far.  "
        },
        {
            "heading": 2,
            "text": "The main feedback "
        },
        {
            "text": "Participants’ top three motivations for taking part in the pilots were: 1) to access to expert advice, 2) to develop business and entrepreneurial skills and 3) to create or improve business plans. "
        },
        {
            "text": "This was in line with our objectives, although some respondents had a greater interest in gaining agricultural knowledge than entrepreneurial skills. Those respondents may not have benefited as much as this wasn’t the focus of the pilots. "
        },
        {
            "text": "The majority of participants who responded to the survey or took part in interviews were positive about the pilot and felt they had benefited. "
        },
        {
            "text": "On average, respondents rated the usefulness of the support received in achieving their intended goals for the pilots as 7 on a scale of 1 to 10 (based on 129 respondents). "
        },
        {
            "text": "Feedback from providers suggest that those who did not gain as much from the programme were, at one end, either too early in their thinking, with very little agricultural knowledge and experience of farming, or at the other end, had formally studied a land-based course to degree level and a strong connection to farming. "
        },
        {
            "text": "When asked what elements of the support they found to be most beneficial, participants mentioned: mentoring/coaching, peer to peer activities and site visits.  "
        },
        {
            "heading": 3,
            "text": "Mentoring"
        },
        {
            "text": "The participants we spoke to described the mentoring as: “useful”, “encouraging”, “the bit that really helped”. Many reported that it gave them increased confidence in their business plans and that they were able to consider other business ideas, their costs and benefits and think about different markets. "
        },
        {
            "text": "Some participants reported that they kept in touch with their mentor and felt that they could go back to them in future. "
        },
        {
            "text": "For instance, one participant who already had a business plan, said they were able to improve it with their mentor’s support: “we talked through all elements of the business plan”. They were able to look at different options and understand how much they would cost.  "
        },
        {
            "text": "A coaching approach to mentoring was well-received. One respondent said that, with support, their business was “more business-like”, adding that they felt on more solid ground. "
        },
        {
            "heading": 3,
            "text": "Peer to peer learning and networking"
        },
        {
            "text": "Most participants found peer-to-peer learning and networking beneficial. Feedback included: “There was a good variety of people on the course and so it was good to hear from more experienced peers” and “It was good to have some diversity and to be able to learn from others”.  "
        },
        {
            "text": "Pilot leads encouraged participants to build connections, for example, through online and in-person peer-to-peer sessions. Some set up group chats on WhatsApp."
        },
        {
            "text": "The majority of participants told us they had made new connections through the pilot. Most intended to try and maintain some of the connections they had built. "
        },
        {
            "heading": 3,
            "text": "Site visits"
        },
        {
            "text": "Seeing practical examples of what others have done, discussing them and being able to put questions to more established businesses was seen as very valuable.   "
        },
        {
            "text": "One pilot lead reported that site visits around specific learning modules had worked particularly well. For example, visiting a site which undertook specific activities to market their products as part of the marketing module. "
        },
        {
            "text": "Participants reported that site visits were useful to help them reflect on their own business ideas, on other ways of doing things and on possible diversification options.  "
        },
        {
            "text": "The site visits were also another opportunity for participants to connect with their peers in person. "
        },
        {
            "heading": 3,
            "text": "Entrepreneurial knowledge and competencies"
        },
        {
            "text": "Self-assessments completed by participants before and after the pilots suggest an improvement in how they felt about their knowledge of key business topics as a result of the scheme."
        },
        {
            "text": " The in-depth interviews and feedback from pilot leads suggested that while participants had benefited from the learning content, they would have liked more flexibility in tailoring it to their own needs.  "
        },
        {
            "heading": 2,
            "text": "But did the pilots make the difference we intended? "
        },
        {
            "text": "These pilots were designed to explore whether participants’ chances of gaining access to land and finance could be improved."
        },
        {
            "text": " Here the evidence was less clear as it is too soon to assess this until participants have had a chance to bid for land and finance for real. "
        },
        {
            "text": "The pilots involved pitching to land and finance providers but only as an exercise. "
        },
        {
            "text": "Many participants did report increased confidence in their business plans and pitching them to land and finance providers. 78% of respondents at the end felt either confident or very confident in their ability to pitch their business plan, this compares to 43% at the start. But of course, the proof of the pudding is in the eating so we will seek to follow-up with some participants to see how they fare.   "
        },
        {
            "text": "We know that the opportunities to access land are limited and this was reflected in many participants’ views of their chances in the future. "
        },
        {
            "heading": 2,
            "text": "Next steps  "
        },
        {
            "text": "We are currently reflecting on these results and digging further into the detail as well as discussing their significance with stakeholders. We will continue to share updates on the blog, so make sure to subscribe."
        },
        {
            "text": " You'll find a link to subscribe at the bottom of this post."
        }
    ]
}