{
    "url": "https://vets.blog.gov.uk/2023/10/09/the-value-of-international-collaboration-my-reflections-on-meeting-fellow-chief-veterinary-officers-in-asia/",
    "title": "The value of international collaboration: my reflections on meeting fellow Chief Veterinary Officers in Asia",
    "authors": [
        "Dr Christine Middlemiss BVMS MRCVS"
    ],
    "categories": [
        "Government Veterinary Services",
        "International Work"
    ],
    "pub_date": "2023-10-09T16:17:55+01:00",
    "content": [
        {
            "text": "As the United Kingdom’s Chief Veterinary Officer, I recently had the pleasure of representing the UK overseas and collaborating with our international partners, including fellow CVOs from across the G7 group of nations (pictured). On this trip I was joined by the Deputy CVO Jorge Martin-Almagro and Bhavisha Patel, Veterinary Trade Facilitation expert in Defra."
        },
        {
            "text": "This important engagement makes a real difference to our international trade and influence. It strengthens our international relationships by further developing trust in UK’s high animal health and welfare standards, and our preparedness to respond to global animal and public health threats."
        },
        {
            "text": "By positioning the UK as world-leader in animal health and welfare standards, we continue to progress market access and veterinary trade facilitation and promote a joined-up One Health approach in the G7 forum."
        },
        {
            "text": "Group of Seven (G7) CVOs’ Forum"
        },
        {
            "text": "I met with representatives from Canada, France, Germany, Italy, Japan, and the United States of America, along with the European Commission, World Organisation for Animal Health (WOAH) and the Food and Agriculture Organization of the United Nations（FAO) in Tokyo. We joined forces in our global fight against African Swine Fever (ASF), Highly Pathogenic Avian Influenza (HPAI) and Antimicrobial Resistance (AMR)."
        },
        {
            "text": "A deadly disease for pigs and wild boar, ASF has spread in mainland Europe and Asia.  It is causing significant disruption to the meat trade.  Avian influenza represents a significant global threat to poultry businesses, kept bird populations and native wild bird species. Antimicrobial resistance to treatments such as antibiotics continues to present significant risks to human health, as well as threatening animal health and welfare and food security."
        },
        {
            "text": "Taking a One Health Approach"
        },
        {
            "text": "It was great to see our international partners recognising UK leadership on AMR, co-designing policies with industry and One Health. Other nations were keen to learn more about the UK approach and deepen partnership in these important areas."
        },
        {
            "text": "The joined-up ‘One Health’ approach aims to sustainably balance and optimise the health of people, animals and ecosystems, recognising that these are all interdependent. As a major proponent of   One Health, the UK is pleased to see the G7 countries supporting the strengthening of this integrated approach to enhance preparedness and response to cross-sector threats, including zoonotic diseases, agrifood system security and antimicrobial resistance."
        },
        {
            "text": "Tackling the biggest threats"
        },
        {
            "text": "It was a good opportunity to understand the position of the other G7 countries on key issues, such as avian vaccination. We learned vaccination against HPAI may be used as an emergency or preventive measure in the EU following a risk assessment. Several EU countries are keen on exploring vaccination as a disease control tool to protect some parts of their national flocks, and France is beginning an avian vaccination programme in October 2023."
        },
        {
            "text": "We reviewed current work to deliver HPAI vaccination and the science behind it, emphasising that vaccination in accordance to WOAH standards is a complementary resource. We jointly committed to continued evaluation, to ensure vaccination efforts protect both poultry and wild populations, as well as safeguarding public health and maintaining safe international trade."
        },
        {
            "text": "We agreed that strengthening biosecurity, disease surveillance, contingency plans and capacity building is key in our fight against ASF. We also emphasized the critical importance of achieving these outcomes by raising awareness, knowledge, and co-operation about ASF among stakeholders, including farmers, hunters, veterinarians, importers, and border control officials."
        },
        {
            "text": "On AMR, we reiterated the importance of disease prevention to reduce the use of antimicrobials. We restated our commitment to supporting vets and veterinary paraprofessionals as we join forces to ensure the responsible and prudent use of antimicrobials. We want to continue to see a shift from treatment to prevention. I shared with the group my experiences of lambing in the spring, and recalled conversations with farmers who recognised the fundamental importance of biosecurity and hygiene in the lambing shed."
        },
        {
            "text": "Bilateral engagement in East and South-East Asia"
        },
        {
            "text": "In addition to the G7 activities, we met on a bilateral basis with Japan and Canada. We visited Taiwan to reconnect with CVOs from Taiwan and Phillipines, Dr Tu and Dr Limson, and with the Agriculture Vice Minister of Vietnam."
        },
        {
            "text": "These face-to-face engagements presented a great opportunity to cement relationships built on trust and mutual understanding. In addition, we gained a lot from the technical information exchange on disease outbreak measures, diagnosis, official controls, One Health strategy and import requirements."
        },
        {
            "text": "For example, we learned Vietnam’s approach to ASF vaccination, how Japanese fish auctions and wholesale markets are regulated by their government, and how critical the cold-chain storage is for UK pork products exported to the Philippines."
        },
        {
            "text": "Achievements and next steps"
        },
        {
            "text": "I enjoyed the opportunity to share the UK’s journey towards reducing the domestic use of antibiotics in animals during the G7 summit. Other G7 countries appreciated UK’s openness and knowledge-sharing. This helped to achieve real value from G7 CVOs meeting together and reinforce a One Health approach to our shared fight against global issues like antimicrobial resistance."
        },
        {
            "text": "I look forward to continuing to grow these collaborative, technical relationships, sharing expertise, and building trust in the UK’s approach. We have learned these forums really help to promote UK international influence, showcase our high standards and maintain and improve market access for British products."
        },
        {
            "text": "Overall, these visits contributed towards growing international partnership, building successful relationships with other G7 countries and our international counterparts in Taiwan, Japan, Philippines and Vietnam. This international collaboration helps us to strengthen the joined-up global response needed to tackle the emergent threats affecting people and animals and ecosystems around the world."
        }
    ]
}