{
    "url": "https://socialcare.blog.gov.uk/2021/07/07/care-home-open-week-a-good-reason-to-throw-a-party/",
    "title": "Care Home Open Week: a good reason to throw a party!",
    "authors": [
        "Ashleigh Calder"
    ],
    "categories": [
        "Care and support",
        "coronavirus",
        "Events"
    ],
    "pub_date": "2021-07-07T13:54:28+00:00",
    "content": [
        {
            "heading": 2,
            "text": "A focus on safety and fun"
        },
        {
            "text": "After what can only be described as an uncertain and difficult 18 months, Care Home Open Week was a fantastic opportunity to focus on the positives and have some fun. "
        },
        {
            "text": "Many of the people we support at Precious Homes have found the pandemic hard. Changes to routine can be a challenge for autistic people, and isolation from friends, family and support systems added to an already confusing situation."
        },
        {
            "text": "The open week gave us all something to focus on. Staff and the people they support got stuck into planning, from deciding what food to have and which shops to visit, to making decorations and baking cakes. "
        },
        {
            "text": "I look after thirteen services across my region, and this felt like a fantastic opportunity to get everyone together in one place, after such a long time without seeing each other. There was great excitement. We planned a festival, with music, a dance tent, face painting, and food. "
        },
        {
            "text": "We also planned to have various information tables, covering topics, including what it is like to live with autism, learning disabilities, sensory disorders, mental health and other topics, to help raise awareness. "
        },
        {
            "text": "Families were invited, along with social workers and neighbours - a real community focus. The outdoor event was hosted at Howe Park, one of our services with plenty of outdoor space - to make sure that it was COVID-19 safe and a place we could make sure social distancing was maintained. "
        },
        {
            "heading": 2,
            "text": "Course correction"
        },
        {
            "text": "Only days before, the plan to ease lockdown was changed. With infections rising and restrictions still very much in place, we had to reassess. All events now needed to be limited in numbers, and the services to remain in their bubbles. "
        },
        {
            "text": "Since the pandemic began, the staff have been extremely resourceful and positive, with an unwavering focus on keeping people happy, healthy and active. This was no different. "
        },
        {
            "text": "Each of the managers re-planned their events, quickly coming up with creative and fun ideas that would work on a smaller scale. Ultimately, the event was about celebrating the people we support, so the team made this their focus. "
        },
        {
            "heading": 2,
            "text": "Round the houses"
        },
        {
            "text": "At Tolcarne Avenue and Veryan Place, the team and the people they support threw themselves into arranging an amazing tea party, complete with a range of fun activities including makaton and sign language workshops. They took the opportunity to raise awareness about what we do, with a lovely showcase of photos from over the lockdown period. "
        },
        {
            "text": "At Howe Park, where we support people with more complex needs, a BBQ  was set up to make sure everyone could enjoy themselves whilst maintaining infection prevention controls. We invited the local police, giving them the opportunity to get to know Howe Park residents in a more relaxed environment."
        },
        {
            "text": "At Fenny Mews, the team planned another amazing BBQ with music, dancing, and plenty of food! One of the team managed to organise donations from Tesco and John Lewis, which was a really lovely gesture. "
        },
        {
            "text": "We were joined by Mitesh, our chairman, who is part of the Care Home Open Week committee, as well as one of the Championing Social Care ambassadors. We also had a visit from the local YMCA, who spoke to everyone about volunteering opportunities."
        },
        {
            "text": " At Dyers Mews, where we have fewer residents and a smaller space, everyone had a lovely tBBQ, with some of the younger residents taking part in a dance-off! "
        },
        {
            "text": "All in all, while it may not have been possible to do what we had originally planned, the event was an absolutely amazing opportunity for everyone to have fun. It gave us a much-needed release from the day-to-day. "
        },
        {
            "text": "In my region, we love any excuse to party - Care Home Open Week put a real smile on everyone’s faces. We can’t wait until next year! "
        }
    ]
}