{
    "url": "https://governmentscienceandengineering.blog.gov.uk/2021/07/07/innovation-with-a-big-bang/",
    "title": "Innovation with a Big Bang",
    "authors": [
        "Claire Jenkins"
    ],
    "categories": [
        "Blog Series",
        "Guest Blog"
    ],
    "pub_date": "2021-07-07T12:02:45+01:00",
    "content": [
        {
            "text": "A pedal-powered firework launcher, a self-filling bird bath, a robotic ball boy – these are just a few of the amazingly impressive entries that we shortlisted for the Intellectual Property Office Award for Outstanding Innovator at this year’s Big Bang. For those who are unaware, the Big Bang competition is the UK’s top science and engineering event for young people which exists to ‘inspire inquisitive minds to think big, challenge facts, ask questions and invent solutions right now’.  The Intellectual Property Office (IPO), have worked with national and regional Big Bang events for some time, but this was the first year we sponsored an award."
        },
        {
            "text": "An understanding and awareness of the Intellectual Property (IP) rights (patents, trade marks, copyright and design registration) are fundamental to invention and research.  As sponsors, we wanted to explore the current awareness of IP by entrants and for them to understand the role it plays in protecting and harnessing innovation.  We judged the entrants on innovation, sustainability, cost, inclusivity, creative design, along with the all-important Patent Examiner ‘gut check’. We were provided with a long-list of twenty-five projects that matched our award criteria which we narrowed down to a shortlist of ten. This may sound like a simple task – but if you could see the quality of the projects you would soon change your thinking – I was completely blown away, especially when I remembered that the inventors are all students from age 11 to 19."
        },
        {
            "text": "With the Big Bang fair and competition remaining a solely digital affair in 2021, IPO Chief Executive and Comptroller General Tim Moss and I interviewed the inventors via video call. The level of knowledge and depth of understanding these young people had developed whilst completing their projects was impressive. It was apparent that they are STEM enthusiasts with a talent for innovation, and I could definitely envisage seeing some of their names on patent applications in the future. Once we’d interviewed our selected ten, Tim and I unanimously agreed on our winning invention – an emergency single person tent for walkers & climbers, named the Back-up Bivie designed by Amy Greener of Sir William Borlase’s Grammar School, Marlow."
        },
        {
            "text": " "
        },
        {
            "text": "As the STEM Outreach Coordinator for the IPO, I really enjoy interacting with young people. I love to teach, discuss and listen about STEM in the hope that I can help to enthuse and inspire youngsters to pursue STEM beyond their school years and eventually into a career - so this opportunity was right up my street. I am very grateful to have been involved and I urge anyone who is looking to get involved in outreach, to seek and volunteer for any event that involves interacting with the Scientists & Engineers of tomorrow, whether it be teaching related, interviewing and/or judging – you won’t be disappointed!"
        },
        {
            "text": "The IPO’s relationship with the Big Bang is managed by our External Communications Team and this year included contributions in STEM career panels and a pre-recorded session by Senior Patent Examiner Dr Mark Lewney ‘the future ain’t what it used to be’."
        },
        {
            "text": "The Intellectual Property Office provides a series of education resources, competition and outreach to support innovation, creativity and intellectual property, including ‘Wallace & Gromit’s Cracking Ideas. To find out more, or to explore how we can work together, please get in touch via: ideas@crackingideas.com"
        }
    ]
}