{
    "url": "https://governmentscienceandengineering.blog.gov.uk/2021/07/07/member-communications-update/",
    "title": "Member Communications Update",
    "authors": [
        "Leon Kennedy"
    ],
    "categories": [
        "GSE Profession Updates"
    ],
    "pub_date": "2021-07-07T11:10:14+01:00",
    "content": [
        {
            "text": "Since March 2021, the GSE Profession Communications Team has undertaken several projects to develop our communications offering and improve our member’s experience. We provide an overview of what we have achieved, what we are working on and future developments."
        },
        {
            "heading": 3,
            "text": "What have we achieved?"
        },
        {
            "text": "Over the last 3 months, we have made significant changes to the communications team in areas such as membership registration, management of newsletter distribution, and streamlined the submissions process for the newsletter and the blog."
        },
        {
            "text": "In March, we launched a new subscriber tool that simplified the registration process and automatically adds members to our new newsletter distribution list. The new process merges multiple identical records and removes deactivated-emails from our distribution list. This allows us to accurately measure the number of members, as well as measure engagement with the newsletter."
        },
        {
            "text": "In April, we introduced a new evaluation dashboard to measure and evaluate the success of our digital communications, allowing us to measure GSE Blog visits and track engagement. Importantly, it has allowed us to understand how users access the blog (i.e. via laptop or mobile) and optimise our site to give the best user experience. We also introduced our internal Horizon Scan, which tracks what is happening within the profession and allows us to deliver more relevant and exciting content."
        },
        {
            "text": "Recently, in May, we created and implemented a new Communications Strategy to improve our online presence on the GSE Blog and our GOV.UK page to provide a more consistent flow of content."
        },
        {
            "heading": 3,
            "text": "What are we working on?"
        },
        {
            "text": "Currently, we are working on a range of projects to improve the communications offering of the Profession. Such projects include :"
        },
        {
            "heading": 3,
            "text": "Future developments"
        },
        {
            "text": "In the future, we are planning other improvements to develop the communications offering of the profession. Currently, these include :"
        },
        {
            "heading": 3,
            "text": "Summary"
        },
        {
            "text": "We hope that the changes we have made have engaged our users and helped to provide a more seamless and useful user experience of the GSE Profession. The ongoing and future projects discussed above are key ways we believe we can continue to develop and grow the profession and ensure the success of the profession."
        }
    ]
}