{
    "url": "https://naturalengland.blog.gov.uk/2021/07/07/peatland-discovery-grant-launched-to-support-the-next-waves-of-peatland-restoration/",
    "title": "Peatland Discovery Grant launched to support the next waves of peatland restoration",
    "authors": [
        "Bradley Tooze"
    ],
    "categories": [
        "Climate change",
        "Peat"
    ],
    "pub_date": "2021-07-07T12:00:03+01:00",
    "content": [
        {
            "text": "The importance of peat for nature and for our climate have been making the headlines in recent weeks. With growing interest in restoring our peatlands, I am delighted to report that we are launching a new Discovery Grant today (7th July 2021) as a part of the Nature for Climate Peatland Restoration Grant Scheme (NCPGS)."
        },
        {
            "text": "The NCPGS is the result of a close and strong collaboration between Defra and Natural England.  It has been informed by the knowledge and experience of many organisations and stakeholders. We have designed the scheme to facilitate and fund the restoration of 35,000 ha of peatland by 2025 and to secure 9MT of carbon in the process. English peatlands are estimated to contain around 584 million tonnes of carbon, but in their degraded state it is estimated that peatlands in England emit some 10 million tonnes of carbon dioxide equivalent every year. We need and slow or halt that release of carbon."
        },
        {
            "text": "This work is crucial to addressing climate change and the government’s ambitions for nature recovery, to secure our water resources and for flood risk mitigation for the benefit of the economy and society, as set out in the England Peat Action Plan."
        },
        {
            "text": "We opened the scheme for the first round of applications for Restoration Grants, aimed at meeting the capital costs of these works, in April this year."
        },
        {
            "text": "However, this is not work for the faint-hearted.  Restoration is most effective when it is undertaken at a landscape scale.  Multiple issues need to be addressed, technical solutions need to be worked up and costed that are practical to deliver. It needs commitment from landowners and managers who need to work together across ownership boundaries, bring in additional finance and confirm how they will manage the land to maintain the benefits long into the future. The need to build capacity and confidence was a key finding of the Newcastle University study  Social barriers and opportunities to the implementation of the England Peat Strategy."
        },
        {
            "text": "Now, professional bodies, landowners and land managers will be able to apply for Discovery Grants to support the development of their partnerships and to bring forward their proposals to restore areas of peatland. The Discovery Grants will enable people to develop new and ever more progressive and exciting applications for main Restoration Grant awards."
        },
        {
            "text": "And I’m very pleased to report that we are off to a promising start.  The window for submitting bids for the first round of main grant awards closed on the 25th July. We have received a diverse range of applications, with ambitious proposals that span both upland and lowland areas. These have largely come from the established and experienced peat partnerships. Proposals include works to restore the waterlogged conditions essential to forming and maintaining peat, re-introducing Sphagnum mosses and other peat-forming species and tackling peat erosion. We are now evaluating these applications and will make further announcements once we have determined how the first round of grants will be awarded."
        },
        {
            "text": "The Discovery Grants will enable new partnerships to form so we can extend the scope of restoration into new areas and, potentially, tackle more challenging situations with innovative schemes."
        },
        {
            "text": "We won’t stop here though: we are already thinking ahead to look for ways we can incentivise more land managers to adopt carbon-friendly practices as part of profitable commercial enterprises and contribute to the green recovery."
        }
    ]
}