{
    "url": "https://childrenssocialcare.blog.gov.uk/2021/07/07/plymouth-city-council-prioritising-naas-as-a-learning-need/",
    "title": "Plymouth City Council: prioritising NAAS as a learning need",
    "authors": [
        "David Neal"
    ],
    "categories": [
        "CPD",
        "NAAS",
        "Post-Qualifying Standards"
    ],
    "pub_date": "2021-07-07T11:50:43+01:00",
    "content": [
        {
            "heading": 4,
            "text": "David Neal, a team manager for the Practice Education Academy of Social Work in Plymouth, talks about his involvement in developing a continual professional development (CPD) framework that uses the National Assessment and Accreditation System (NAAS) to engage social workers and remind them of the importance of embedding the voice of young people in their continued learning."
        },
        {
            "text": "The delivery of NAAS for child and family social workers was paused during the COVID-19 pandemic.  Assessment centres restarted in June, allowing social workers to choose NAAS as a CPD option once again."
        },
        {
            "text": "NAAS aims to provide social workers with a better understanding of their current level of knowledge and skill, highlighting strengths and areas for development, and supporting employers to continue to raise the national standard and consistency of practice."
        },
        {
            "text": "For Plymouth, NAAS enables us to focus on and engage with the post-qualifying standards (PQS). The PQS are the legally mandated professional development framework for statutory children’s social workers; and I don’t think there’s a national understanding of that, including at university and local authority (LA) level."
        },
        {
            "text": "At Plymouth, we have stripped out the professional capabilities framework (PCF) from our post-qualifying training and remapped it to the PQS.  We have deviated from a standard appraisal framework, making a conscious effort to engage with social workers on a routine basis and ensuring yearly appraisals and learning needs benchmark social workers against the PQS."
        },
        {
            "heading": 2,
            "text": "We view NAAS as being about relationships"
        },
        {
            "text": "To prepare candidates, we run a series of workshops, keeping group sizes small.  We spend time challenging myths and criticisms and use appraisal workshops to make links to the PQS and create endorsement pathways. These pathways are a process for managers to decide whether social workers are ready to demonstrate their expertise and take the assessment. Plymouth has designed 3 endorsement pathways:"
        },
        {
            "text": "Once endorsed, the potential for structural barriers is raised, so we focus our support around the booking process and taking the assessment."
        },
        {
            "heading": 2,
            "text": "Accredited social workers have reaped the benefits of Plymouth’s support offer, with many gaining renewed confidence in their practice"
        },
        {
            "heading": 3,
            "text": "Preparation"
        },
        {
            "text": "Candidates receive a lot of support from professional development educators and managers, which helps reaffirm their knowledge and remove anxiety. Employer endorsement pathways are varied and come with study leave. As well as not having to work on the assessment day, Plymouth provides candidates with a day off before the assessment."
        },
        {
            "text": "After endorsement, candidates are asked to complete a self-assessment of their learning needs and are then given one-to-one dedicated support to address these in readiness for the assessment. They also have the option to attend a workshop and are given support to understand how the assessment works and how to prepare. Receiving personalised support helps the assessment feel less daunting."
        },
        {
            "heading": 3,
            "text": "Impact on practice"
        },
        {
            "text": "When social workers become accredited practitioners, they think a lot more about their knowledge and how they approach practice."
        },
        {
            "text": "NAAS refocuses thinking and reminds social workers to undertake more research to inform their approach to situations. They become more motivated to learn about aspects of practice they may not have been aware of previously and develop new skills through training. Ultimately social workers become more aware of what the PQS require them to know and do, which helps support their development planning and gives a renewed confidence."
        },
        {
            "heading": 2,
            "text": "Planning beyond NAAS"
        },
        {
            "text": "We see NAAS as a midpoint between career stages, where training can be picked up from learning needs taken from the endorsement and assessment feedback. We are planning to instigate spiral curriculums and deliver training around core subject areas mapped against the PQS."
        },
        {
            "text": "NAAS has also helped to identify a group of ‘outlier’ social workers in the academy, for example, social workers who have moved away from frontline practice into youth offending and fostering teams.  We’re currently developing the CPD offer to this group by enhancing the academy’s training package, to bolster knowledge and skills gaps for these social workers."
        },
        {
            "text": "By moving the main responsibility of NAAS and CPD to team managers, the intention is that they will facilitate CPD plans, monitor training needs, provide social workers with space to access training, routinely encourage assessment booking, automatically review feedback and revise learning plans. The idea is that the only direction candidates move, is forward.\n"
        }
    ]
}