{
    "url": "https://dcmslibraries.blog.gov.uk/2021/07/07/read-talk-share-how-the-reading-agency-helped-libraries-tackle-loneliness/",
    "title": "Read, Talk, Share – How the Reading Agency helped libraries tackle loneliness",
    "authors": [
        "Karen Napier, Chief Executive, The Reading Agency"
    ],
    "categories": [
        "Case study",
        "Outcome: communities",
        "Outcome: wellbeing"
    ],
    "pub_date": "2021-07-07T12:58:49+01:00",
    "content": [
        {
            "text": "The impact of loneliness on the mental and physical health of people across the UK has been well documented as a public health concern.[1] Feelings of loneliness have increased for many people but especially for those already most at risk of experiencing loneliness, such as older adults, young people and those living alone[2] and these feelings have a big impact on mental health and wellbeing.[3]"
        },
        {
            "text": "Luckily, The Reading Agency’s mission to use the proven power of reading to tackle life’s big challenges was perfectly placed to offer a solution. In December 2020 DCMS awarded TRA £3.5m to work with public libraries across England in taking on this challenge through its 'Read, Talk, Share' campaign."
        },
        {
            "heading": 2,
            "text": "What we did"
        },
        {
            "text": "'Read, Talk, Share' expanded The Reading Agency’s already successful Reading Well and Reading Friends programmes, enabling  public library services to step up to tackle loneliness and support mental health. Together we and our library partners  mobilised to reach those most in need of social connectivity,  overcoming the challenges of delivery in a pandemic, including the closure of library buildings and the difficulties of distance engagements. The flexibility, commitment and support of library staff and management to deliver this has been amazing."
        },
        {
            "heading": 2,
            "text": "In numbers"
        },
        {
            "heading": 2,
            "text": "The difference we’ve made"
        },
        {
            "text": "There is a strong link between mental health and loneliness, and evidence shows that improving emotion regulation and increasing social support are important first steps to take in reducing the negative impact of COVID on mental health.[4] Our evaluation into the impact of these programmes will be published later in the summer. But we already know that they have made an incredible difference to people’s lives."
        },
        {
            "heading": 2,
            "text": "Reading Well"
        },
        {
            "text": "Accessed both digitally and via ‘click and collect’ services over the funding period, when library buildings were closed, books from the Reading Well collections are helping to support children, young people and adults to better understand and manage their mental health and wellbeing and, by extension, reduce their likelihood of experiencing debilitating loneliness. One library user described the impact of the collections, saying: “These books are truly amazing and will be a godsend in my local area, especially as people’s mental health is so poor at present due to the pandemic.”"
        },
        {
            "text": "Libraries have been working with other local partners to deliver Reading Well: with schools, Primary Care networks, social prescribing sites and more. Health support in public libraries, amplified through partners, can create real systems change in public health and wellbeing. This creates a clear legacy for libraries, helping them embed their health offer as a vital part of community public health provision."
        },
        {
            "heading": 2,
            "text": "Reading Friends"
        },
        {
            "text": "With thousands of social connections made, Reading Friends met a huge need. Half (49%) of Reading Friends participants indicated that they had felt lonely often/always or some of the time since March 2020, and over three-quarters (76%) agreed that they had felt lonelier more often than before the pandemic.[5]  The programme also proved its flexibility by reaching a broad and diverse range of audiences including new and expectant parents, young carers, older people and those living with dementia."
        },
        {
            "text": "After participation, more than 4 in 5 (83%) agreed the programme helped them feel more connected to other people, and 72% agreed it had helped them feel less lonely.[6] One participant commented on how deeply they had been affected by the programme: “The group has been a life saver after a silent twelve months.” We also found that it wasn’t just the participants who experienced positive changes — over three-quarters of Befrienders (77%) also agreed that Reading Friends had helped them feel more connected to other people.[7]"
        },
        {
            "heading": 2,
            "text": "What next?"
        },
        {
            "text": "Our work with DCMS to support wellbeing and tackle loneliness in partnership with public libraries does not end here. It is needed more than ever as the UK recovers from the pandemic and the legacy of these programmes will be essential to this recovery."
        },
        {
            "text": "The Reading Well collections will remain in place in communities, continuing to provide access to quality assured advice and support. We are also working to expand and embed Reading Friends into public library services across the UK, offering a lifeline of social connections and support to those who need it most."
        },
        {
            "text": "The Reading Agency will continue to work with vulnerable and hard to reach communities, tackling loneliness and supporting mental health through the proven power of reading and welcomes the opportunity to work together with libraries and others to deliver this important work."
        },
        {
            "text": " "
        },
        {
            "heading": 3,
            "text": "Footnotes"
        },
        {
            "text": "[1] https://www.campaigntoendloneliness.org/threat-to-health/"
        },
        {
            "text": "[2] What Works Centre for Wellbeing (2020) How has Covid-19 and associated lockdown measures affected loneliness in the UK?"
        },
        {
            "text": "[3] British Red Cross (2020) Lonely and Left Behind: Tackling Loneliness at a Time of Crisis; https://www.mentalhealth.org.uk/our-work/research/coronavirus-mental-health-pandemic/key-statistics-wave-8"
        },
        {
            "text": "[4] Groarke et al. (2020), ‘Loneliness in the UK during the COVID-19 pandemic: Cross-sectional results from the COVID-19 Psychological Wellbeing Study’, PLOS One"
        },
        {
            "text": "[5] Renaisi (2021) Analysis of data collected as part of Reading Friends rollout, unpublished"
        },
        {
            "text": "[6] Renaisi (2021)"
        },
        {
            "text": "[7] Renaisi (2021)"
        }
    ]
}