{
    "url": "https://insideDIO.blog.gov.uk/2021/07/07/the-mystery-of-rat-islands-skeletons/",
    "title": "The mystery of Rat Island’s skeletons",
    "authors": [
        "Richard Osgood"
    ],
    "categories": [
        "Archaeology",
        "Operation Nightingale"
    ],
    "pub_date": "2021-07-07T16:25:40+00:00",
    "content": [
        {
            "text": "Participants in the Operation Nightingale EX REDCAP RECOVERY on Rat Island last month [Crown Copyright/MOD2021]The element of secrecy and security that surround most Ministry of Defence sites lends them an air of mystery. A result of this is that many of them are also associated with urban myths – some more believable than others. Buried motorbikes, Spitfire engines in crates and even a hidden hoard of mess silver are just some of those rumours I have encountered in 17 years working for the Department. All of the above turned out (so far) not to be correct and yet the most preposterous tale, on the face of it, actually has some credence. That site is Burrow Island – also known as ‘Rat Island’ between Gosport and the Naval base at Portsmouth in Hampshire."
        },
        {
            "text": "Harbour tours past this small tidal island refer to the colloquial name and claim it was so-called because of the number of rats to be found there feeding on the corpses of the prisoners that had been buried there in the Georgian era. Surely this was just another tall tale? Well, it turns out to have more than a grain of truth. After storms in 2014, the police reported the discovery of human bones on Rat Island and so as DIO’s Senior Archaeologist, I had the site send me the bones. I was half expecting them to be animal bones, but I was greeted with, amongst other elements, a very clearly human skull in an evidence bag. Further examination of the small cliff on the island showed that there were more bones eroding out."
        },
        {
            "heading": 2,
            "text": "Archaeological investigations"
        },
        {
            "text": "Since that point the archaeology team within DIO has organised several excavations on the site to recover remains affected by these storms. This work, in conjunction with Cranfield University, Breaking Ground Heritage and the Royal Military Police (RMP) has now retrieved the remains of over 35 individuals from a very small area indeed. Analysis of these bones seems to suggest them all to be adult males in their late teens to early sixties and to have suffered a variety of ailments and aches – some even seemingly with scurvy. The bodies were in elm coffins and aligned east -west in a standard Christian fashion even though this is not consecrated land. Assessment of the teeth of the bodies (and their stable isotopes) indicated that most were from southern Britain although a couple had spent their early years of life on the European mainland."
        },
        {
            "text": "Unlike the burials of prisoners of war at nearby Portchester Castle or those of sailors at Haslar hospital, these individuals had nothing with them in their graves. This, along with a map reference to the ‘Convict burying ground’, and an 19th Century article in the Oxford Times also referring to convict inhumations, leads us to think these are the remains of prisoners who had died on the prison hulks moored around Portsmouth harbour in the late 18th and early 19th Centuries."
        },
        {
            "heading": 2,
            "text": "Latest findings"
        },
        {
            "text": "A recording of skeletons found at Rat Island during Operation Nightingale EX REDCAP RECOVERY.[Crown Copyright/MOD2021]This June we were finally able to return, and our team comprised forensics experts, archaeologists, military veterans on the Operation Nightingale programme and RMP personnel, supported by 17 Port Maritime Regiment. In a week, skeletal parts of 12 people were found – again in coffins. Poignantly this included a baby and possibly a woman. This would change our understanding of the nature of the site from the all-male narrative beforehand."
        },
        {
            "text": "So why do we do this? It provides good and realistic training to the RMP who have body recoveries of a more recent nature as part of their job portfolio, alongside top-level forensics links. It is also an engaging piece of work for our veterans that live locally."
        },
        {
            "text": "Finally, it is the right thing to do – our work is permitted under a Ministry of Justice license which requires us to re-bury these people on completion of the project. By collecting and recovering the remains we can tell the story of these people, avoid the ignominy of their bones simply lying around without respect, and finally ensure they are reburied properly at a location where there is no threat of erosion."
        }
    ]
}