{
    "url": "https://gott.blog.gov.uk/2021/07/07/uncovering-previously-unrecognisable-fingerprints/",
    "title": "Uncovering previously unrecognisable fingerprints",
    "authors": [
        "Graham Farnsworth",
        "Simon Carr"
    ],
    "categories": [
        "Defence Science and Technology Laboratory"
    ],
    "pub_date": "2021-07-07T11:50:03+01:00",
    "content": [
        {
            "text": "Head of Intellectual Property, Graham Farnsworth, Dstl: "
        },
        {
            "text": "“The Defence Science and Technology Laboratory (Dstl) is a proven national asset that provides innovative solutions to help protect the armed forces and keep the public safe."
        },
        {
            "text": "It collaborates with experts in academia and industry, particularly small and medium-sized enterprises (SMEs), to produce pioneering science and technology from cyber and artificial intelligence to robots and military vehicles."
        },
        {
            "text": "A number of its solutions also have wide ranging benefits beyond defence and security and these opportunities, in addition to exploitation in defence and security, are managed by the Intellectual Property team."
        },
        {
            "text": "The team have recently reached the milestone of 1000 Intellectual Property (IP) reports and operate under the maxim of ‘highlight, protect, exploit'."
        },
        {
            "text": "The importance of the team was demonstrated when our new invention uncovered previously unrecognisable fingerprints. The technology was later licensed to Foster and Freeman in 2017, and launched as RECOVER in 2018.\""
        },
        {
            "text": "The RECOVER Machine"
        },
        {
            "text": "Before we arrived at this stage, a pioneering technique was found which allowed a fingerprint to be retrieved from a metal object even after it has been cleaned with solvent or burnt in a fire."
        },
        {
            "text": "This sounds amazing enough before you even find out that this was invented in part by chance, at which point it seems to echo Alexander Fleming’s infamous discovery of penicillin."
        },
        {
            "text": "However, this is really a story of collaboration and maximising the impact of our knowledge assets."
        },
        {
            "text": "This story started in a lab at Loughborough University in 2007 where a group of scientists were studying inorganic chemistry."
        },
        {
            "text": "They noticed that a glass bottle that had been left overnight, and exposed to the process they were using, had developed a fingerprint."
        },
        {
            "text": "This is now called Latent Fingerprint Technique (LFT) and it can recover fingerprints from items that had previously been extremely challenging or impossible to work with."
        },
        {
            "text": "This includes items exposed to high temperatures, such as Improvised Explosive Device (IED) components and fired ammunition cases, as well as metal items that had been deliberately cleaned, such as knives."
        },
        {
            "text": "This clearly has applications to both the battlefield and the crime scene."
        },
        {
            "text": "The technique used by forensic services to develop and preserve fingerprint evidence is known as a ‘fuming process’. A precursor powder is heated and then allowed to degrade into a crystallised form in a chamber containing the object under analysis."
        },
        {
            "text": "This crystallised form is then re-evaporated, creating fumes around the object which then condense to develop fingerprints on the sample."
        },
        {
            "text": "Unlike other techniques, LFT does not require the presence of sweat or naturally occurring skin oils to develop a fingerprint."
        },
        {
            "text": "Loughborough University collaborated with us at Dstl and the Home Office Centre for Applied Science and Technology (CAST). The latter is now part of Dstl."
        },
        {
            "text": "Scientists from the university, as the developers, had the fundamental understanding of how the novel chemistry worked."
        },
        {
            "text": "CAST brought knowledge of the fingerprint development processes used by the police and had also demonstrated success in taking laboratory concepts and turning them into operational equipment."
        },
        {
            "text": "We at Dstl had a need to improve fingerprint recovery rates and provided funding to drive the development forward."
        },
        {
            "text": "Together, over eight years, our combined efforts made the LFT technology a viable tool."
        },
        {
            "text": "It is a fantastic example of collaborative working between academia and government to develop an innovation that will help the police and security services to identify criminals and link them to their crimes."
        },
        {
            "text": "From an IP perspective, it was important that this opportunity was highlighted early so we could protect it, exploit it and maximise its impact. This way, we retain the use of this technology and its vital capabilities for defence and security, we can help exploit other applications that benefit the wider public and also generate money for the UK economy."
        },
        {
            "text": "The IP team work closely with Ploughshare Innovations (the commercial sister organisation of Dstl) and is skilled at licensing our technologies and finding the right partners to bring these products to market."
        },
        {
            "text": "Turning the successful laboratory technique into a commercially available product required the expertise of an industry partner."
        },
        {
            "text": "Ploughshare’s assessment of LFT identified it as being suitable for licensing and the process of screening potential interested parties began in 2015."
        },
        {
            "text": "Foster and Freeman, as a leading forensic science equipment supplier to more than 150 countries, was an ideal partner to take this technique and turn it into a successful product."
        },
        {
            "text": "The company also had 40 years of experience delivering pioneering technology to police and government agencies."
        },
        {
            "text": "The LFT tech was licensed to Foster and Freeman in 2017 and launched as RECOVER in 2018."
        },
        {
            "text": "The LFT technology which was launched as RECOVER "
        },
        {
            "text": "Foster and Freeman recognised the laboratory processes would need to be adapted to comprise of a single unit and be, in part, automated."
        },
        {
            "text": "This collaboration of the right people has ensured that this chance discovery in the Loughborough University lab did not stay in the lab."
        },
        {
            "text": "We were in a position to remove roadblocks and to ensure the government’s investment in science and technology was maximised and that wider society also benefits by the application of this innovation."
        },
        {
            "text": "The RECOVER product can get results within as little as 30 minutes and is already being used by forensic teams and experts securing convictions on a global scale. This is another excellent example of powering private sector R&D investment and success through public sector innovation."
        }
    ]
}