{
    "url": "https://disabilityunit.blog.gov.uk/2020/12/17/living-with-non-visible-disabilities/",
    "title": "Living with Non-Visible Disabilities",
    "authors": [
        "Disability Unit"
    ],
    "categories": [
        "Raising Awareness"
    ],
    "pub_date": "2020-12-17T10:24:28+00:00",
    "content": [
        {
            "heading": 2,
            "text": "What is a non-visible disability?"
        },
        {
            "text": " A non-visible disability is a disability or health condition that is not immediately obvious. It can defy stereotypes of what people might think disabled people look like. "
        },
        {
            "text": "This can make it difficult for people with non-visible disabilities to access what they need. The impact of living with a non-visible disability can be slight, or can have a huge effect on someone’s life.  "
        },
        {
            "heading": 2,
            "text": "Why is it called a non-visible disability?"
        },
        {
            "text": "Many disabled people self-identify in different ways. There are several ways of talking about non-visible disabilities. "
        },
        {
            "text": "Some people with disabilities that are not obvious prefer the phrase ‘non-visible’. This is because the word ‘invisible’ can erase the legitimacy of the disability, or imply the disability does not exist. "
        },
        {
            "text": "‘Hidden’ disability can imply a person is hiding their disability on purpose. ‘Less-visible’ disability does not encompass those whose condition is completely non-visible. "
        },
        {
            "text": "With non-visible disabilities it is important to emphasise that even though the disability cannot be seen, it does not mean it does not exist. "
        },
        {
            "text": "Some ‘non-visible’ conditions are visible or obvious sometimes. Also, they can be 'seen' by some people who might have a better understanding of the condition. But they are not usually visible to others."
        },
        {
            "text": "Non-visible disabilities are named this way because you cannot always easily see the nature of the disability. Some people with non-visible disabilities might use mobility aids, whereas others will not. "
        },
        {
            "text": "Also, some people with non-visible disabilities might have a ‘dynamic disability’. This means that sometimes they might use a mobility aid, but other times they might not need it. Likewise, sometimes they might need to use a priority seat on busy public transport. Other times they may not feel they need to."
        },
        {
            "heading": 2,
            "text": "Which disabilities are non-visible?"
        },
        {
            "text": "Daily life can look different for people with non-visible disabilities. Non-visible disabilities include a wide range of disabilities. These are not limited to, but may include:"
        },
        {
            "text": "There are many different types of non-visible disability. The kind of support that people with non-visible disabilities need differs. "
        },
        {
            "text": "It is best not to assume what kind of support someone might need. Listening to the needs of disabled people and acting on them is the best course of action."
        },
        {
            "heading": 2,
            "text": "How should I act towards people with non-visible disabilities?"
        },
        {
            "text": "People with non-visible disabilities want to be treated with respect and as individuals – just like people with visible disabilities and the general population. Even though you cannot see evidence of a disability, the disability still exists.  "
        },
        {
            "text": "Nobody has to tell you they have a disability, or explain what it is. People can choose to keep this private. Some people may choose to wear a lanyard or carry a badge to show that they have a non-visible disability. It shows they may need extra support whilst travelling or shopping. Other people with non-visible disabilities prefer not to do this. Some people may wear a different lanyard or badge to alert you to their disability or ‘impairment’. "
        },
        {
            "heading": 2,
            "text": "Non-visible disabilities and COVID-19"
        },
        {
            "text": "Some people with non-visible disabilities are more vulnerable or susceptible to COVID-19, but others are not. Some people with non-visible disabilities are exempt from wearing face-coverings.  "
        },
        {
            "text": "If you are exempt, you do not have to prove this to other people. Some people who have exemptions and a non-visible disability, want to demonstrate that they are exempt. "
        },
        {
            "text": "There are several schemes which allow someone to do this. You could wear the sunflower lanyard or cards explaining you have a medical exemption from wearing a face-covering. Schemes include: "
        },
        {
            "text": "There are many other organisations and disability charities that produce bespoke mask-exemption identification. "
        },
        {
            "text": "  "
        },
        {
            "heading": 2,
            "text": "Raising awareness"
        },
        {
            "text": "We can provide better support the more we understand about non-visible illnesses. Everyday things can be difficult for people with non-visible disabilities. These include travel, work, shopping and socialising. "
        },
        {
            "text": "Making sure not to judge someone based on whether their disability is visible or not is crucial. "
        },
        {
            "text": "Listening to disabled people and making sure accessibility is inclusive is important. This could help improve the lives of people with non-visible disabilities."
        },
        {
            "text": "We will be posting our next blog in January, in the meantime join the conversation and follow us on Twitter @DisabilityUnit to keep up-to-date with what we’re doing."
        }
    ]
}