{
    "url": "https://civilservicelocal.blog.gov.uk/2021/08/19/apply-now-for-the-future-leaders-academy/",
    "title": "Apply now for the Future Leaders Academy",
    "authors": [
        "Heidi Stephens"
    ],
    "categories": [
        "A National Spotlight",
        "Cymru Wales",
        "East, South East & London",
        "Midlands",
        "North East, Yorkshire and the Humber",
        "North West England",
        "Northern Ireland",
        "Scotland",
        "South West England"
    ],
    "pub_date": "2021-08-19T07:25:19+00:00",
    "content": [
        {
            "text": "We are pleased to launch our next online Civil Service Local Future Leaders Academy, which opens for applications from today and closes on 15 September.  This 9 month programme will run from 3 November 2021.  The time commitment is explained below."
        },
        {
            "heading": 4,
            "text": "What is the CS Local Future Leaders Academy Online (FLAO)?"
        },
        {
            "text": "The FLAO is a unique cross-departmental leadership development programme which will provide you with the opportunity to work collaboratively with colleagues from other government departments around the country. It includes a mix of self-discovery, personal development, team building, and leadership, designed to help develop a range of skills required to become leaders of the future. It is open to AA/AO/EO (or equivalent) grades and is for those who have shown the desire to become potential leaders of the future."
        },
        {
            "text": "Delegates will take part in a range of learning and development sessions before working together in cross-departmental groups to identify a project that they will develop and deliver over the 9-month programme."
        },
        {
            "heading": 4,
            "text": "Why have a cross-departmental leadership development programme?"
        },
        {
            "text": "The FLAO is designed as another option for civil servants alongside existing departmental programmes. The key difference is that it is open across the whole Civil Service. This enables participants to develop skills that can be transferred between departments and establish networks to develop an appreciation of the Civil Service ‘bigger picture’. The FLAO is designed to create leadership development opportunities and to facilitate collaborative working, encouraging the sharing of good practice."
        },
        {
            "heading": 4,
            "text": "What is the commitment?"
        },
        {
            "text": "Delegates must be able to commit to the initial learning phase on the dates shown below, as well as the subsequent project work.  The initial learning phase will consist of guest speakers, group workshops and reflection exercises plus approximately a further 1 hour of pre-learning per week. This will culminate in delegates pitching a project idea (as a group) to senior civil servants in a ‘dragon’s den’ scenario. Delegates will then work on their projects for the remainder of the 9-month programme."
        },
        {
            "heading": 4,
            "text": "Dates and times for initial learning phase:"
        },
        {
            "text": "Online for 6 hours per day (with breaks):"
        },
        {
            "text": "Week 1 - Wednesday 3 November 2021"
        },
        {
            "text": "Week 2 - Tuesday 9 November 2021"
        },
        {
            "text": "Week 3 - Wednesday 17 November 2021"
        },
        {
            "text": "Week 4 - Wednesday 24 November 2021"
        },
        {
            "text": "Week 5 - Wednesday 1 December 2021"
        },
        {
            "text": "Break - Wednesday 8 December 2021"
        },
        {
            "text": "Week 6 - Wednesday 15 December 2021"
        },
        {
            "heading": 4,
            "text": "Dates for follow up project work:"
        },
        {
            "text": "2 to 3 days per month December 2021 to 31 July 2022. That time may be spent face-to-face or on a virtual basis, depending on the ongoing COVID-19 situation and the locations of the group members."
        },
        {
            "heading": 4,
            "text": "Middle and end of Academy"
        },
        {
            "text": "There will be 1 day sessions to share progress and celebrate achievements. Dates to be confirmed."
        }
    ]
}