{
    "url": "https://deframedia.blog.gov.uk/2021/08/19/consultation-on-abstraction-changes-to-protect-water-resources/",
    "title": "Consultation on abstraction changes to protect water resources",
    "authors": [
        "Defra Press Office"
    ],
    "categories": [
        "Uncategorized"
    ],
    "pub_date": "2021-08-19T15:15:58+01:00",
    "content": [
        {
            "text": "There is coverage today (19 August) in Eastern Daily Press, Farmers Guardian and Farming UK, among others, about the Environment Agency’s 12 week consultation on changes to the way organisations and individuals are charged to abstract water from the environment."
        },
        {
            "text": "These changes are to help better manage and protect our water resources. Based on recent projections, more than 3.4 billion additional litres per day will be needed in England by 2050, 23% more than today’s supplies."
        },
        {
            "text": "The new proposed charges – which have not changed for the past 10 years – will be based on:"
        },
        {
            "text": "Under the proposals, around 45% of abstractors will see their annual charges decrease and 55% will see an increase. Overall, three quarters (75%) of all abstractors will see either a decrease or an increase of less than £100."
        },
        {
            "text": "The changes will enable the Environment Agency to invest more in upgrading infrastructure assets to move water around the country and protecting water-stressed catchments such as chalk streams."
        },
        {
            "text": "Environment Agency Chief Executive Sir James Bevan said:"
        },
        {
            "text": " All those who abstract water from the environment – including water companies, farmers, local authorities and other organisations – are encouraged to take part."
        },
        {
            "text": "Follow Defra on Twitter, and sign up for email alerts here."
        }
    ]
}