{
    "url": "https://videosurveillance.blog.gov.uk/2021/08/19/framework-service-level-agreement/",
    "title": "Framework Service Level Agreement",
    "authors": [
        "Tony Gleason"
    ],
    "categories": [
        "Biometrics and Surveillance Camera Commissioner",
        "CCTV",
        "Local authorities",
        "National surveillance camera strategy",
        "Policing",
        "Surveillance camera code of practice"
    ],
    "pub_date": "2021-08-19T17:59:49+01:00",
    "content": [
        {
            "text": "Introduction "
        },
        {
            "text": "Hello! I am Tony Gleason, one of the strand leads for the Biometrics and Surveillance Camera Commissioner’s (BSCC) National Camera Surveillance Strategy (NSCS). I am the CCTV Manager at Bournemouth, Christchurch and Poole Council, Chairman of the Public CCTV Managers Association and I represent the Local Government Association at the National Police Chiefs' Council CCTV working group."
        },
        {
            "text": "The NSCS is the strategic vision of the Commissioner, and it includes ambitious objectives, both short and long-term. My strand is focused on local authorities, promoting good practice, BSCC third-party certification and partnership working. More specifically, I have been working with a number of key partners in developing a Framework Service Level Agreement (SLA) guidance document for local authorities and police forces. This document can also be used by other agencies for their use of surveillance camera systems."
        },
        {
            "text": "What is the guidance?"
        },
        {
            "text": "The Service Level Agreement framework is a guidance document designed to help you and your organisation develop an SLA yourselves. It is not in itself an SLA but a tool to help you ensure you have included all the minimum requirements that would be expected to be included in one. The sections that are outlined are not exhaustive; there is no ‘one size fits all' SLA and it should be completed in conjunction with the Surveillance Camera Code of Practice (SC Code) and its 12 guiding principles issued under the Protection of Freedoms Act 2012."
        },
        {
            "text": "Why it matters?"
        },
        {
            "text": "An effective SLA is a crucial part of any partnership working arrangements between organisations. This template has been designed specifically for partnerships between relevant authorities defined at section 33(5) of the Protection of Freedoms Act 2012 (local authorities and police forces) regarding the operation of surveillance camera systems. However, it will be of use for any partnership working. The aim is to help facilitate an effective partnership addressing a number of areas of collaborative working including Information Sharing Agreements, directed surveillance, vetting, training, sharing live images, feedback and welfare of staff. It also sets out standards and procedures that will in turn reassure the public that the use of surveillance is proportionate, necessary and lawful."
        },
        {
            "text": "What the Commissioner has to say"
        },
        {
            "text": "“I am delighted to announce the release of this guidance and framework document for creating Service Level Agreements. Tony, in collaboration with my office and  other organisations, have worked extremely hard in its development and it is of the utmost importance that we continue to help provide local authorities and the police with tools to ensure they are able to use their surveillance systems to the best possible standard.” – Professor Fraser Sampson, Biometrics and Surveillance Camera Commissioner"
        },
        {
            "text": "What the NPCC Capabilities Manager for CCTV has to say"
        },
        {
            "text": "“To the Police, CCTV evidence is the primary consideration in around 90% of all investigations and is the main detection factor in over one third of all justice outcomes. CCTV is also 100% effective for establishing crimes have been committed, linking crimes, identifying victims, establishing cause of death, eliminating post charge suspects, charging suspects, and providing admission of guilt, and is over 96% effective in identifying persons of interest.*"
        },
        {
            "text": "In times of austerity it is even more critical for the police to work with local authorities to demonstrate this effectiveness and prove the legitimacy and justification of CCTV evidence."
        },
        {
            "text": "The NPCC CCTV Working Group have been working closely with the BSCC and Tony to improve the quality and effectiveness of CCTV across policing and fully support the release of this important guidance.” - Andy Read NPCC Capabilities Manager for CCTV on behalf of ACC Jenny Gilmer NPCC CCTV Portfolio."
        },
        {
            "text": "*Forensic Policy Team, Home Office Project Impact of Forensic Science on the CJS"
        },
        {
            "text": " "
        }
    ]
}