{
    "url": "https://phescreening.blog.gov.uk/2021/08/19/guidance-on-managing-the-nhs-diabetic-eye-screening-register-updated/",
    "title": "Guidance on managing the NHS diabetic eye screening register updated",
    "authors": [
        "Patrick Rankin"
    ],
    "categories": [
        "NHS Diabetic Eye Screening Programme"
    ],
    "pub_date": "2021-08-19T12:33:15+01:00",
    "content": [
        {
            "text": "Every local NHS diabetic eye screening (DES) service is responsible for ensuring they have an up to date register of people with diabetes who are eligible for screening. PHE commissions and oversees the general practice to diabetic retinopathy screening (GP2DRS) system, which supports the electronic sharing of data for eligible people with diabetes between GP practices and local DES services."
        },
        {
            "text": "It is essential that GP practices use the correct codes on the GP2DRS system, to make sure people with diabetes are correctly identified through a monthly extract from the system."
        },
        {
            "heading": 2,
            "text": "Missing individuals"
        },
        {
            "text": "Some people are included on the eligible screening register but should not be invited for screening. These people may have been incorrectly referred to the service and are not included in the monthly GP2DRS extract because they do not have a current diabetes diagnosis code on their patient record. This cohort is referred to as ‘missing individuals’ because they are missing from the GP2DRS extract."
        },
        {
            "heading": 2,
            "text": "PHE Screening blog"
        },
        {
            "text": "The PHE Screening blog provides up to date news from all NHS screening programmes. You can register to receive updates direct to your inbox, so there’s no need to keep checking for new blogs. If you have any questions about this blog article, or about population screening in England, please contact the PHE screening helpdesk."
        }
    ]
}