{
    "url": "https://civilservice.blog.gov.uk/2021/08/19/next-gen-leadership-in-the-civil-service-what-to-expect/",
    "title": "Next-Gen Leadership in the Civil Service: what to expect",
    "authors": [
        "Caroline Murray, Deputy Director, Leadership Programmes Strategy, Government Skills & Curriculum Unit, Cabinet Office"
    ],
    "categories": [
        "A great place to work",
        "A Modern Civil Service",
        "A Skilled Civil Service",
        "An Ambitious Civil Service"
    ],
    "pub_date": "2021-08-19T08:31:26+00:00",
    "content": [
        {
            "text": "Caroline Murray on what today's aspiring leaders are likely to need for tomorrow."
        },
        {
            "text": "The last couple of years have been a timely reminder why world-class leadership in the Civil Service matters more than ever. "
        },
        {
            "text": "The pandemic response and EU Exit have seen civil servants at their very best, working together to deliver better outcomes. We’ve also been tested like never before, and in some cases, have felt underprepared and under-equipped. "
        },
        {
            "text": "“The challenges - Net Zero or an outlier global crisis - aren’t going to go away, but nor are the opportunities to serve to the best of our ability. It's vital we continue to invest in our training and development to equip our people with the skills, knowledge and networks they need to stay ahead.” - Declaration on Government Reform, published by the Prime Minister and Cabinet Secretary, June 2021. "
        },
        {
            "text": "Shared standard of excellence"
        },
        {
            "text": "As the world, the role of government, and the future of work evolve, so does the role of leaders. With different expectations must come new skills. Working across government and the public sector, we’re designing a new core - universal - curriculum for leadership and management, to better reflect what we need now. "
        },
        {
            "text": "‘Strand Three’ of the curriculum framework, which underpins the Government Campus, will not be restricted to the handful of senior leaders. It will support every civil servant with clarity and accessibility in their learning and development, whether a permanent secretary or one of our thousands of valued line managers, working across the UK. It will be for everyone."
        },
        {
            "text": "Greater consistency and quality   "
        },
        {
            "text": "Every Civil Service leader will have access to tangible skills for management - managing people, processes, money, or projects. "
        },
        {
            "text": "In developing this, we’re looking to the world leaders in management, but also ensuring relevance to the context of government. From the most junior level, people will be clear on what we would expect of them as future leaders, and what expertise and experience they’ll need to build, and how. "
        },
        {
            "text": "Complementary and coherent"
        },
        {
            "text": "Our aim is to ensure all our central leadership and management programmes are complementary, coherent, and effective. This means the programmes and products available via Civil Service Learning, the Civil Service Leadership Academy, the Accelerated Development Schemes and the National Leadership Centre will change to provide unrivalled development opportunities. "
        },
        {
            "text": "Since leaders learn best from leaders, new entrants will be developed by those they look up to. Participants on the new programmes also will hear from experienced leaders from different sectors and industries. We’ll provide opportunities to hear about how they’ve solved problems, approached new challenges, used new technologies and innovated. "
        },
        {
            "text": "Building Networks "
        },
        {
            "text": "Learning with peers from across different parts of the Civil Service (and public sector) will help to better connect all those leading and managing public services, policymaking, and policy delivery. It will expand people’s understanding and their challenges. It will help them maximise opportunities and become more effective as leadership teams, across boundaries, geographic or sectoral. "
        },
        {
            "text": "Building trust and empathy"
        },
        {
            "text": "We know that broad, deep relationships are vital for success in complex systems. Our most senior leaders will learn alongside Ministers, building mutual trust and empathy. Crucially, the value for participants and the wider system will continue long after the development programme is complete. Webinars and seminars on business topics will enable our people to continue to learn personally, and amplify their new skills back into their organisation. "
        },
        {
            "text": "This programme of change is underpinned by operating principles, built on what we know works. This will shape reform of our selective accelerated development programmes, for high potential colleagues. They will become shorter, more structured and guided, and focused on ‘case method’, simulations, and stretch assignments tailored to the participant, with a healthy balance of challenge and support. "
        },
        {
            "text": "There will be greater exposure to other sectors and industries, particularly private sector organisations to build wider leadership experiences, underpinned by academic courses of study. We will also put systems in place to ensure a better understanding of our high potential individuals, to help them plan their careers using collective workforce insights."
        },
        {
            "text": "Stepping in the same direction"
        },
        {
            "text": "The scale of the comprehensive reforms planned means this won’t happen immediately. We’re continuing to work with others to ensure all of our activity remains complementary to existing investment in capability, whether in functions, professions or departments. The Major Projects Leadership Academy and emerging Service Delivery Academy programmes are just two examples of leadership curricula being developed in parallel and aligned to the curriculum framework. "
        },
        {
            "text": "As Colin Powell said: “If you are going to achieve excellence in big things, you develop the habit in little matters.” "
        },
        {
            "text": "This autumn, we’ll share more about our plans, the ‘habits’ and the ‘little matters.’ "
        }
    ]
}