{
    "url": "https://insidedio.blog.gov.uk/2021/08/19/raf-odiham-runway-upgrades-completed%e2%80%af/",
    "title": "RAF Odiham runway upgrades completed  ",
    "authors": [
        "DIO Communications Team"
    ],
    "categories": [
        "RAF",
        "Runways"
    ],
    "pub_date": "2021-08-19T08:49:28+00:00",
    "content": [
        {
            "text": "The newly-resurfaced runway at RAF Odiham. [Crown Copyright / MOD 2021]We’ve just finished a programme of work to upgrade the runway and associated airfield lighting at RAF Odiham in Hampshire."
        },
        {
            "heading": 2,
            "text": "Why does a helicopter station need a runway? "
        },
        {
            "text": "Royal Air Force Odiham is a front-line helicopter base and home of the UK Chinook Force working within Joint Helicopter Command. The Chinook is a capable and versatile support helicopter primarily used for transportation and can carry up to 10 tonnes of equipment or up to 55 personnel. RAF Odiham operates three Chinook squadrons."
        },
        {
            "text": "A Royal Air Force Chinook Mark 6 helicopter takes its first flight at RAF Odiham in 2014.Benefitting from a new Digital Automatic Flight Control System that provides improved handling qualities and aircraft stability, offering increased safety, the Mark 6 is the most advanced heavy-lift helicopter ever operated by the RAF. [Crown Copyright / MOD 2014]Obviously, it was very important to avoid disruption to our RAF colleagues wherever possible. Fortunately, the nature of rotary operations, the flexibility of both the squadrons and contractors, and close coordination by those involved meant we were able to accommodate the project with minimal disruption to operations."
        },
        {
            "text": "As a helicopter station, you may be wondering why RAF Odiham has a runway, or why it matters what condition it’s in. Having a runway is important to provide resilience for the RAF and because from time to time, fixed wing aircraft need to use the station."
        },
        {
            "heading": 2,
            "text": "The project"
        },
        {
            "text": "DIO awarded a £2.9m contract for the runway works and a £2.6m contract for the lighting works to Amey Highways in December 2020. They worked with Levertech and various subcontractors."
        },
        {
            "text": "The project started very quickly in early January and the runway resurfacing was finished ahead of schedule in February. The airfield lighting upgrades were a longer project and they were completed in late July."
        },
        {
            "text": "The runway works were needed to increase the amount of friction on the surface to keep it safe. To do that we removed and replaced the top 40mm of the runway, to a total of 8,500 tonnes of asphalt. It was an important project that will extend the life of the runway for another 15 years."
        },
        {
            "text": "At the request of the aircrews, as well as replacing the airfield ground lighting we also relocated it. The new airfield ground lighting is modern, energy efficient and should last for years."
        },
        {
            "text": "One of the new pieces of airfield ground lighting installed during the project. [Crown Copyright / MOD 2021]It’s fantastic to see the upgraded runway and airfield lighting ready for aircrews. The team have been really impressive, completing the project quickly despite the challenges of keeping everyone safe during COVID. The newly-upgraded runway and improved lighting will be in use by aviators at RAF Odiham for years to come."
        }
    ]
}