{
    "url": "https://publicpolicydesign.blog.gov.uk/2021/08/19/the-final-frontier-for-policy-design/",
    "title": "The final frontier for policy design",
    "authors": [
        "Helena Trippe"
    ],
    "categories": [
        "Thought leadership"
    ],
    "pub_date": "2021-08-19T12:00:57+01:00",
    "content": [
        {
            "text": "The growing complexity of policy problems, the fast-paced nature of technological and demographic change, or the pressures of finding new ways of doing things and yet having to do more with less, are just some of the many challenges facing the UK’s policymakers."
        },
        {
            "text": "For some, the policymaking process and the institutions tasked with designing policies are inherently broken."
        },
        {
            "text": "And yet, there is a growing body of evidence on the ability of design to de-risk delivery, to drive down costs, and to drive up public value."
        },
        {
            "text": "This evidence suggests there might not be a need for a full overhaul of the policy system. Instead it makes a case for re-framing policy beyond an evaluative activity to be more generative in nature."
        },
        {
            "heading": 2,
            "text": "Design as an accelerant"
        },
        {
            "text": "Policy theory and practice is premised on the ability of policymakers to quantify policy problems, predict outcomes, and objectively anticipate the consequences of policy intervention. The aim is to achieve precision in policy problem-solving. This confines policy design to an evaluative activity."
        },
        {
            "text": "The ability to design policies for the human experience is a well-documented blindspot in policy practice. As is its ability to forecast possible futures."
        },
        {
            "text": "The climate crisis, the housing crisis, managing future technology and data are a few examples of the need to find new ways of doing policy and delivering public value."
        },
        {
            "text": "This is where design excels: at forming a deep and rounded understanding of problems to propose new ways of doing things."
        },
        {
            "text": "User-centred design is now synonymous with the successes of digital transformation across the UK government. It has been instrumental in transforming service experiences across the public sector to make services more accessible to people."
        },
        {
            "text": "To a large extent, the application of user-centred design has tended to concentrate at the transactional end of policymaking, at the implementation and service delivery stage. As evidence on the value of design to the public sector increases, so too does the maturity of design practice across government."
        },
        {
            "text": "One of design’s guiding principles is its approach to framing problems, and solutions, around people. That means it considers the technical, social, economic and legal implications of a policy by zooming in and out of people's everyday lived experiences of them. Design applies a laser-like focus to assessing the value of any future intervention through constant experimentation."
        },
        {
            "text": "Design’s ability to peer into the future is what sets design apart from more evaluative policy approaches. It is a difference not only of approach but - fundamentally - of mindset. This is particularly valuable in a context where uncertainty rules and there is a need to create practical evidence to manage risk and drive value in decision making."
        },
        {
            "text": "The blueprint map popular among service designers is an example of this. It involves tracking, in detail, the steps people take to complete a task. It breaks down how each stage of the process is delivered, by whom, through what channel (digital, face-to-face, in person, over the phone), the different flows of data, and the back office processes that support delivery. A blueprint can be used to audit an existing process, be used to illustrate a roadmap, or visualise a future state."
        },
        {
            "text": "Fundamentally, the blueprint builds a solid picture of where resources are directed, where there are gaps, or opportunities for future value creation and leveraging of resources."
        },
        {
            "text": "Combined with spending allocations, a blueprint is a powerful tool to not only evaluate but also experiment with return on investment (ROI) distribution in each of its discrete stages, and across the policy delivery spectrum."
        },
        {
            "heading": 2,
            "text": "Design maturity and the infrastructure of governance"
        },
        {
            "text": "A natural evolution of placing people at the centre of policy design is the idea that people can be active participants in co-creating policy solutions. This is not new; participatory design approaches have been around for some time."
        },
        {
            "text": "In government, co-creation is often used as a participatory method for consultation and collaborative decision making. One of the challenges in applying co-creation to policy design is an uneasy tension with more established democratic practices and processes. Even well-designed deliberative processes do not mean there is equity of representation or a level playing field for those taking part."
        },
        {
            "text": "These challenges aside, collaborative design has had significant impact in the third sector. Examples include the social entrepreneurship sector, which combines the power of technology to social impact investing."
        },
        {
            "text": "In challenging system failures, these initiatives provide opportunities for reconfiguring existing networks of value that policies tend to create and support. When they come up against established models of governance, an inability for policy design to quickly adapt often slows the rate at which innovation can scale, and the ability for government to maximise on public value to drive policy outcomes."
        },
        {
            "text": "These challenges are not just the result of the difficulties of moving policy design beyond an evaluative activity but are the symptom of a bigger problem."
        },
        {
            "heading": 2,
            "text": "Bridging the gap between policy design and implementation"
        },
        {
            "text": "The disconnect between policymaking and implementation, as 2 distinct activities, are well-documented. This disconnect increases the risk of services failing to fully translate policy goals and disrupts feedback loops which are integral to future policy design."
        },
        {
            "text": "Policy design involves not only defining policy goals, but also designing the instruments - laws, regulation, institutions - to achieve these goals. Policy instruments shape people’s experiences of government and send clear social contract signals on the calculus of consent. Beyond being purely technical components of policymaking, they delimit the experience of services and the scope of public value creation opportunities."
        },
        {
            "text": "Could this be the next frontier for design in government? This is where, in my view, things get really exciting. And where policy design can help short-circuit policy instrument choice considerations by bringing a people-centred focus and strategic approach to working through experimentation."
        }
    ]
}