{
    "url": "https://defrafarming.blog.gov.uk/2021/08/19/the-farmers-who-work-in-defra/",
    "title": "The farmers who work in Defra",
    "authors": [
        "Ben Keene",
        "Brian Longman"
    ],
    "categories": [
        "A view from the farm",
        "Farmers in Defra"
    ],
    "pub_date": "2021-08-19T14:55:32+01:00",
    "content": [
        {
            "text": "Like most workplaces, staff in Defra come from a variety of different backgrounds. Each brings their own unique experiences and specialist skills to deliver public policy."
        },
        {
            "text": "But one area where Defra may differ from some other workplaces, is that quite a few of us are (or have been) involved in practical farming."
        },
        {
            "text": "We felt it would be beneficial if we could develop closer ties with each other and bring something unique to the department."
        },
        {
            "text": "So, we developed a network called the Defra Farmer’s Forum. In this post, we’d like to give you an overview of what we do. We’ll also share a little bit about ourselves to kick off a series which will feature other members of the forum."
        },
        {
            "text": "There are currently around 20 of us in the network, from a variety of farming backgrounds. Some combine both working in farming and working in Defra. Some have left farming, and some are involved in wider family farms."
        },
        {
            "text": "We have put on a number of experience-sharing sessions across Defra so that colleagues can share more about their own farms and farming experiences with others."
        },
        {
            "text": "This has helped those without farming backgrounds to learn more about farming first-hand - and get a better understanding of what it’s like as a livelihood."
        },
        {
            "text": "One of the benefits of the forum is that we make ourselves available across the Future Farming Programme so that whoever needs to, can quickly give us a call, email or send us a message on chat. This isn’t intended to replace our engagement and co-design work – far from it – but rather it’s to complement it. It is an additional handy resource to help us make the right decisions."
        },
        {
            "text": "For example, we help with requests from policy teams who might want feedback about an aspect of their plans, or perhaps a sense check before going out with information to the wider farming community."
        },
        {
            "heading": 3,
            "text": "Ben Keene"
        },
        {
            "heading": 4,
            "text": "Policy Adviser -  Future Farming Resilience Fund"
        },
        {
            "text": "I grew up on a small family farm, a mixed dairy and arable farm in Buckinghamshire, and I’ve worked in various farm-related jobs both on and off the farm throughout my career."
        },
        {
            "text": "Over the last few years, we have been gradually working towards ending the farming business which was becoming unviable. As the work on the farm reduced in 2018, I was able to start working part-time for Defra."
        },
        {
            "text": "Since then I have worked in the team developing the Agricultural Transition Plan and I am now helping with the Farm Resilience Fund  which provides business support to farmers."
        },
        {
            "text": "In both these roles I’ve felt really privileged to be working on policy areas which directly affect the farming community that I come from, care about and hopefully know a little bit about."
        },
        {
            "text": "The work with the forum is great as it gives me an extra opportunity to keep abreast on what’s going on in the industry and also to chat to other farmers (which we all love doing!)"
        },
        {
            "text": "I think there is much potential for us farmers here in Defra to get more involved in shaping things as we go forward - and hopefully we will continue to do that. And if you are a farmer, I would encourage you to get involved in one of our co-design sessions when you can too."
        },
        {
            "text": "If you have any questions for me about my role or would like to learn more about the forum, leave a comment below."
        },
        {
            "heading": 3,
            "text": "Brian Longman"
        },
        {
            "heading": 4,
            "text": "Policy Adviser - Red Meat and Dairy Team  (Dairy specialist)"
        },
        {
            "text": "In late 2018, I closed down the dairy herd I ran on a portion of our sixth-generation south Somerset family farm."
        },
        {
            "text": "It was a decision I came to after weighing up a range of issues, the main one being that no one in the next generation wanted to come in and take on the enterprise."
        },
        {
            "text": "I joined Defra as a policy adviser in January 2019 in the hope that, from inside the department, I could have a hand in shaping policy that supports farmers to do what they work so hard to do each day: growing good, affordable food for people while taking care of their land, landscapes and livestock, and hopefully themselves and their families as well."
        },
        {
            "text": "Prior to moving into Defra’s specialist dairy team, I worked in non-farming policy areas, but very soon came across the fledgling Defra Farmer’s Forum that Ben and my other colleagues had set up, and so was able to use my farming knowledge and connections to help others across Defra right from joining."
        },
        {
            "text": "As Ben said earlier, we have been able to help our Defra colleagues in a range of ways, bringing not just our on-the-ground understanding of farming, but also of farmers and the realities of the industry and way of life. I’ve lost count of the number of times I’ve been contacted by colleagues to help them with the farmer's perspective on a piece of work."
        },
        {
            "text": "So one message I’d really like to get across, is not just that there are actually farmers working in Defra (hope you’re sitting while reading this!), but that whilst many in Defra don’t have an agricultural background, they are genuinely fascinated in farming, farmers and the vital job we do."
        },
        {
            "text": "I think there is no better example of this than when the Defra Farmer’s Forum recently arranged a session to explain what the phase out of Basic Payments (BPS) might mean for members and their farms."
        },
        {
            "text": "While such sessions are held on a range of Defra issues and attract a good number of attendees, this session attracted hundreds and had to move to a higher capacity video conferencing platform to deal with the numbers wanting to attend."
        },
        {
            "text": "Many of my Defra colleagues talk to a host of farmers as part of their work, and increasingly so as we work closely with the farming industry to co-design our new farming policy. It's hard to get across how grateful many farmers are when they are to be able to talk to someone  with farming experience in addition to all the ‘formal’ work we do with farmers and land managers – the most common comment I get is ‘This is absolute gold!’"
        },
        {
            "text": "If you have any questions or comments for me, leave them below. And don’t forget to subscribe to the Future Farming Blog."
        }
    ]
}