{
    "url": "https://digitaltrade.blog.gov.uk/2024/09/03/campaign-sites-supporting-our-great-global-trade-network/",
    "title": "Campaign Sites: Supporting our great global trade network",
    "authors": [
        "Andrew Donaghy - Lead Content Designer"
    ],
    "categories": [
        "Products"
    ],
    "pub_date": "2024-09-03T11:47:27+01:00",
    "content": [
        {
            "text": "Andrew Donaghy"
        },
        {
            "text": "I am the Lead Content Designer in the Business Growth portfolio, with a focus on export support content and services on great.gov.uk. Great.gov.uk offers expert guidance, tools and services to support UK exports, imports and inward investment. "
        },
        {
            "text": "A lot has changed in the world of great.gov.uk microsites in a year. In fact, a whole new service has been designed and delivered, which is having a major positive impact for our trade teams and their audiences globally."
        },
        {
            "heading": 2,
            "text": "Microsites: A problem to solve"
        },
        {
            "text": "Many of these represented a reputational and legal risk, in terms of:"
        },
        {
            "text": "Critically, these microsites had no check-step, governance or retirement process in place. This made it difficult for Digital, Design and Marketing to support teams globally and ensure microsites were always relevant, up-to-date and quality. "
        },
        {
            "text": "Armed with this knowledge, the team agreed a new microsite policy with the department’s Executive Committee and the Government Digital Service, who hold overall say over the online platforms to use for government business.  "
        },
        {
            "text": "We also agreed that all compliance services would remain on GOV.UK. All our educational and promotional content would remain on great.gov.uk, as it didn’t fit well with GOV.UK’s existing proposition despite a clear need for these.  "
        },
        {
            "text": "Finally, we agreed the platforms the department would use to publicise events, and that these would need to be retired within a 6-month timeframe to manage our digital footprint. With this new policy in place, we formed a team to stand up the missing part of this strategy: the ability to host campaign sites on great.gov.uk. "
        },
        {
            "heading": 2,
            "text": "Working on the problem"
        },
        {
            "text": "Between December 2022 and February 2023, the microsites mission team carried out a discovery. In it, they assessed more than 1,500 microsites, of which only 87 were judged to be non-duplicative, relevant and useful for users. "
        },
        {
            "text": "This gave us the scale of the problem, when it came to disjointed digital experiences for people interacting with the department’s guidance. Collaboration and cooperation with microsite owners would therefore be a key next step.  "
        },
        {
            "text": "After consulting with microsite owners, 87 sites turned to 50, with many welcoming our support in identifying sites that needed to be retired.  "
        },
        {
            "text": "Chosen content was then migrated to great.gov.uk’s content management system (CMS), Wagtail. The plan was then to publish each site in a newly designed template and publishing model. "
        },
        {
            "text": "To accomplish this and to solve the lack of control and coherence that existed before, we interviewed site owners from all 9 of His Majesty’s Trade Commission’s (HMTC) regions and UK sector teams. This helped us to understand their pain points and needs. "
        },
        {
            "heading": 2,
            "text": "Finding the right solution"
        },
        {
            "text": "Using insights from hours of interviews, we devised and designed a new publishing service for all future site requests. We also designed a template for teams to create new sites easily and consistently to support all future programmes of activity. "
        },
        {
            "text": "In summer 2023, the team ran 2 additional rounds of usability testing on the service. From this, the team established a new name – Great.gov.uk Campaign Sites. This was a significant clarifying step in all internal labelling as well as for adoption. "
        },
        {
            "text": "Critical to the Great.gov.uk Campaign Sites’ publishing model and future management, was establishing an Advisory Group with colleagues from the global and domestic marketing teams. "
        },
        {
            "text": "Meeting fortnightly, the group discusses and approves requests for campaign sites to ensure validity, relevancy and quality. Content designers from DDaT were also recruited to manage the design and usability of all sites going through the service.  "
        },
        {
            "heading": 2,
            "text": "Moving forward with Campaign Sites"
        },
        {
            "text": "In early October 2023, the Great.gov.uk Campaign Sites service went live."
        },
        {
            "heading": 3,
            "text": " The service includes:"
        },
        {
            "heading": 3,
            "text": "What the service has delivered so far:"
        },
        {
            "heading": 3,
            "text": "How the campaign sites are performing so far "
        },
        {
            "text": "Since going live, campaign sites have collectively received over 92,000 visitors.  Data analysis on clicks and activity demonstrates strong user engagement on some of our key campaign sites: "
        },
        {
            "text": "Unicorn Kingdom Pathfinder Awards: Out of 33,000 (unique) visitors to the site, 2.200 clicked on outbound links, 800 downloaded site content, 400 filled out site forms and 950 watched the video. "
        },
        {
            "text": "Made in the UK Awards: Out of 8,000 visitors to the site, 2,500 clicked on outbound links and 250 downloaded site content. "
        },
        {
            "text": "Global Entrepreneurs Programme: Out of 10,000 visitors to the site, 1,000 downloaded site content, 70 filled out site forms and 450 watched the video. "
        },
        {
            "heading": 3,
            "text": "Iteration and improvement"
        },
        {
            "text": "Credit must go to Clare Hill, Anais Reding, Andra Oprea, Linda Williams, Chris Tucker, Mei Mei Loh, Umair Ahmad, Katherine Cain, Julie Ledesma, Philippa McEvoy, Dayanna Ocana, Derek Sivyer, and Danny Jack for their expertise and hard work."
        }
    ]
}