{
    "url": "https://digitalpeople.blog.gov.uk/2024/09/03/celebrating-a-decade-of-success-for-the-digital-and-data-fast-stream/",
    "title": "Celebrating a decade of success for the Digital and Data Fast Stream",
    "authors": [
        "Marwa Ali, Digital Capability Manager, CDDO",
        "James Hessian, Digital Capability Manager, CDDO"
    ],
    "categories": [
        "Capabilities",
        "Digital & Technology Faststream",
        "DSIT Digital Centre",
        "Government Digital and Data"
    ],
    "pub_date": "2024-09-03T18:00:02+01:00",
    "content": [
        {
            "heading": 3,
            "text": "Introduction"
        },
        {
            "text": "August 2024 is an important milestone for the digital and data branch of the Fast Stream programme in the Civil Service, celebrating a decade since launching. To mark this momentous event, civil servants across the Government Digital and Data profession came together at a special event in July at Horse Guards in London to share expertise and experience surrounding the field."
        },
        {
            "heading": 3,
            "text": "The digital and data fast stream in numbers"
        },
        {
            "text": "In the last 10 years there have been 724 Fast Streamers appointed to Product Manager, Delivery Manager, Business Analyst, or User Researcher roles and last year we had our biggest cohort to date."
        },
        {
            "text": "Furthermore, over the last ten years the fast stream has improved representation across all characteristic groups:"
        },
        {
            "heading": 3,
            "text": "A celebration event"
        },
        {
            "text": "The event brought together current and past members of the digital and data Fast Stream programme; senior digital and data leaders across the civil service. Also in attendance were some of the summer interns who helped with the event logistics and got to hear more about careers in the Civil Service."
        },
        {
            "text": "The event included an address by the Chief Digital Officer Mike Potter on the importance of the scheme and the vision for change and innovation for the future, a message which is especially pertinent to the Central Digital and Data Office (CDDO) and Government Digital Service (GDS) as we join the new digital centre of Government in the Department for Science, Innovation and Technology. As well as, spotlight sessions on digital strategy to practical sessions on coding and its benefits to both technical and non-technical civil servants. The interns within CDDO and GDS were particularly well-placed to take advantage of all of the learning opportunities during the day, here’s what they had to say:"
        },
        {
            "text": "Overall, the feedback from the Fast Stream celebration event has been really positive, not just in showcasing how Digital and Data Fast Streamers and their colleagues are making an impact on government and wider public and private sectors, but also in displaying the support from colleagues and other departments that the Stream benefits from. The scope for digital and data is ever-expanding, and so one can only imagine the successes we will be celebrating in another decade’s time!"
        },
        {
            "heading": 3,
            "text": "Looking forwards"
        },
        {
            "text": "On the Digital, Data, Technology (DDaT) and Cyber Fast Stream, you will have a unique opportunity to learn and work across four digital, data, technology or cyber areas in a fast paced and learner driven environment where the work you do will impact the lives of millions of people."
        },
        {
            "text": "The next cohort of Digital Fast Streamers will be appointed from September 2024, and there is a further opportunity for Graduates to apply between October and November, to join the scheme in September 2025 - for more information please visit the Digital, Data, Technology and Cyber Fast Stream web-pages."
        }
    ]
}