{
    "url": "https://educationhub.blog.gov.uk/2024/09/message-schools-ahead-start-term-secretary-of-state-bridget-phillipson/",
    "title": "Message to schools ahead of the start of term from the Secretary of State, Bridget Phillipson",
    "authors": [
        "mediaofficer"
    ],
    "categories": [
        "Schools",
        "Secondary schools"
    ],
    "pub_date": "2024-09-03T16:33:28+01:00",
    "content": [
        {
            "text": "This week many of you are returning to schools, colleges and early years settings across the country after a well-earned summer break. I'd like to personally welcome you back as we start the new term together."
        },
        {
            "text": "Fresh in your minds will be the recent exam results. I saw first-hand how much these moments mean to students, parents and staff when I visited a sixth form college in Manchester for Level 3 Results Day. Your hard work changes lives and I want to say a huge thank you for the dedication you display every day."
        },
        {
            "text": "Of course, as is the case every year, not everyone will have got the results they were hoping for – and it’s up to us to support all young people taking their next steps in learning and beyond."
        },
        {
            "text": "Exam results season showed the best of our society – but, unfortunately, we also saw the very worst over the summer. The appalling incident in Southport in which three children lost their lives was shocking and tragic in equal measure. We are working tirelessly across government to ensure all children are safe inside and outside of education settings."
        },
        {
            "text": "The riots that broke out in the aftermath of that attack shook us all. These were shocking and criminal acts of racism and Islamophobia – and the perpetrators are now quite rightly feeling the full force of the law. I know the disorder will have impacted all of you in different and upsetting ways. Your students will have been affected too, especially those from minority communities and of the Muslim faith. It’s important to recognise that many students and staff might be nervous about returning to the classroom."
        },
        {
            "text": "These events are a deeply powerful reminder of the importance of education – to help people tell truth from lies, encounter and understand those from different backgrounds, and grow strong and inclusive values. We want to continue to work with you to make your schools and colleges positive, safe and welcoming places as students and staff return this month. The department stands ready to support this, with resources and opportunities to share best practise. I know that all of us working in education will go into a new term determined to show that achievement and hope can triumph over violence and hate."
        },
        {
            "text": "In education, September and a brand-new academic year is a time to look forward. It brings new hope for the future – and an opportunity for me to say a bit more about my vision for the sector."
        },
        {
            "text": "When I wrote to you in my first week as Education Secretary, I told you I wanted to put education back at the heart of change and at the forefront of national life. That’s because I am ambitious about this country’s future. Working with all of you, I want to build a country where the life chances of all children are championed, where background is no barrier to getting on, and where the next generation does better than the last."
        },
        {
            "text": "I know there are massive challenges. High workloads, climbing vacancy rates, the strain on care, severe financial constraints, and growing problems with securing the right support for children with SEND, top a long list. But there are deeper issues at play, not least the widespread child poverty that is holding back our young people and piling pressure on you in the classroom. The persistence of these problems leads to an erosion of hope. For too many, the unwritten social contract between government and families – that the next generation will do better than the last – is broken."
        },
        {
            "text": "This breakdown of trust demands urgent attention. We all must recognise the shared responsibilities of schools, government and families. Places of learning should be centres of communities. That’s why face-to-face attendance is so important. High levels of absence harm the children who come to school as well as those who stay at home. It disrupts the rhythm of the classroom and makes building a sense of belonging so much harder."
        },
        {
            "text": "These are inherited challenges for this new government, but you’ve been facing them for years, doing brilliantly for children in the most difficult circumstances – because we all know that the worst thing we can do for children is to let our expectations fall."
        },
        {
            "text": "The first week of term is crucial in setting the right behaviours for attendance. Parents have a responsibility to send their children to school, and schools have a responsibility to create welcoming, engaging and inclusive spaces for pupils. The Government’s approach to absence is ‘support first’ – spotting attendance issues early and working with families to help children back into school. For post-16 providers, I’ve announced the in-year funding guarantee to ensure that no 16- or 17-year-old is blocked from pursuing their education because of a limit on available places."
        },
        {
            "text": "Accountability and communication are priorities. I’m confirming the end of Ofsted single headline grades – immediately for schools, and in time for further education and early years. A single word to sum up the performance of a school, college or any other institution simply doesn’t make sense. Instead, from September 2025 I’ll introduce a new school report card, one that gives parents the information they need and supports you to deliver high and rising standards for every child. It's important that I say up front that report cards won't be a soft option – they will clearly highlight areas where performance must be better for children, as well as things being done well. But they'll be a much less crude way to achieve that than a single word could ever be."
        },
        {
            "text": "We are forging ahead too with the Curriculum and Assessment Review. We are bringing together education experts, leaders and staff to deliver a broader, richer, cutting-edge curriculum fit for the future."
        },
        {
            "text": "I also want to update you on our plans for early education and childcare. It’s a top priority for me and for this government. So I am committed to working with you to deliver the increased hours of government-funded childcare that parents have been promised. This week, hundreds of thousands of working parents will receive 15 funded hours for their young children for the first time – thank you to all the providers who have worked so hard to make this possible. I have been up front with parents that delivering these entitlements won’t be plain sailing – for example – not all parents will get their first choice of childcare place."
        },
        {
            "text": "I am pleased to confirm that the 2025 childcare commitment to increase this to 30 funded hours will go ahead. However, I am being similarly open with parents that there will be many challenges in delivering what was promised to them and that, as with this year, they may not be able to take up their first choice. Over the coming weeks and months, we will set out plans for reform in more detail."
        },
        {
            "text": "As we enter my first September as Education Secretary, I’m full of hope and optimism for the future. That’s not because I think the path ahead is easy. You know as well as I do that there are no quick fixes to the challenges we face. But I’ve been heartened by my first few months in the job because I’ve seen up close the incredible work you all do. Since July, I’ve visited a nursery, a children’s care home, a family hub, a college and a university. I’ve been blown away by your devotion to delivering the very best life chances for our children and young people."
        },
        {
            "text": "In my first email, I told you I wanted to reset our relationship and build back trust. I hope my actions since then have shown how committed I am to achieving that. So I want to once again thank you for your hard work, and remind you of the importance of our shared mission. Today marks the start of a new academic year for many of you. But together we can make it a new beginning for our nation."
        },
        {
            "text": "Bridget Phillipson"
        },
        {
            "text": "Secretary of State for Education"
        }
    ]
}