{
    "url": "https://naturalengland.blog.gov.uk/2024/09/03/progress-in-second-year-of-the-hen-harrier-southern-reintroduction/",
    "title": "Progress in second year of the hen harrier southern reintroduction",
    "authors": [
        "Stephanie Bird-Halton"
    ],
    "categories": [
        "Biodiversity",
        "Hen Harriers",
        "Wildlife"
    ],
    "pub_date": "2024-09-03T12:41:33+01:00",
    "content": [
        {
            "text": "The hen harrier southern reintroduction aims to establish a wild, farmland nesting population of hen harriers in the south of England. Supported by a conservation breeding programme, the project plans to introduce up to 100 juvenile hen harriers to a protected farmland site in Wiltshire over a five-year period. The southern reintroduction project represents one of six points in DEFRA’s joint action plan to increase the English hen harrier population, running in parallel with other activities including long-term monitoring of the species in northern England."
        },
        {
            "text": "The southern reintroduction project "
        },
        {
            "text": "Hen harriers were once common across the UK, but in the 1800s were driven to extinction throughout most of the British Isles. Their gradual natural recovery has since seen them recolonise parts of Scotland and northern England. However, the northern population remains vulnerable due to ongoing illegal killing and disturbance. The combination of this vulnerability and the species’ strong inclination to return to the same upland heathland habitat every breeding season, known as breeding philopatry, has hindered their further expansion south."
        },
        {
            "text": "In continental Europe, hen harriers nest in farmland directly comparable with much of the arable landscape across southern England. It is hoped that offspring from European hen harriers (by way of through the conservation breeding programme) will retain this preference. We anticipate releasing them into a specifically cultivated arable crop made safe from ground predators and other interference will further encourage them to favour this widely available arable habitat. Over time, harriers released in southern England should begin to breed naturally in the wild, establishing a new self-sustaining population."
        },
        {
            "text": "Though they do not yet breed in southern England, some hen harriers from Northern England do move south, forming winter roosts each year in wild expanses like Salisbury Plain and the New Forest. Establishing a resident population in the south will provide new opportunities for these overwintering harriers to stay in the south to breed. It may also be that individuals established in southern England may head further southward to breed with the populations of Continental Europe; both of these events would promote gene-flow between the European and British harrier populations, improving their resilience to adapt to changing environmental conditions, such as an increasingly volatile climate."
        },
        {
            "text": "Continued progress for the conservation breeding programme "
        },
        {
            "text": "Delivered by expert project partners – the International Centre for Birds of Prey (ICBP) – the conservation breeding programme has showed consistent progress since it began in late 2022, with early courtship behaviours displayed in spring 2023, primarily by the males. Further positive signs were seen in spring 2024, now predominantly exhibited by the females, with no fewer than 24 eggs laid. As the birds did not copulate this year all the eggs were infertile, so no juvenile harriers will be released in 2024. Nevertheless, their laying is an excellent indicator of good health and welfare condition of the female harriers and a further step in the right direction towards successful breeding. The birds also showed promising maternal behaviours, such as building nests and incubating the eggs, and even tentative attempts to copulate – further indication of their readiness to breed. These developments are encouraging at such an early stage, as conservation breeding programmes for raptors can be expected to allow a few years for the birds to settle before breeding."
        },
        {
            "text": "Laying the groundwork for a new wild hen harrier population in Wiltshire "
        },
        {
            "text": "With the conservation breeding programme underway at ICBP, Natural England staff have been working hard to prepare for the reintroduction of hen harriers. Based on a National Nature Reserve in Wiltshire, the reintroduction team has been preparing an arable field especially for the birds. The field features specially designed aviaries that are known to work well for hen harriers, sited within a cereal crop for fledglings to be released from; a predator-proof fence for their safety; and a rich mix of plants to provide an abundance of food for wildlife, primarily to encourage small birds and rodents that will one day be a wild food source for released hen harriers."
        },
        {
            "text": "The team are also speaking to local farmers, landowners and public about the project, sharing their hopes and expectations, and trying to understand some of the concerns or perceived conflicts that might arise."
        },
        {
            "text": "For anyone with questions or concerns about the Southern Reintroduction, please get in touch at hen.harrier@naturalengland.org.uk."
        }
    ]
}