{
    "url": "https://food.blog.gov.uk/2024/09/03/share-your-expertise-and-join-our-science-advisory-committees/",
    "title": "Share your expertise and join our Science Advisory Committees",
    "authors": [
        "Professor Robin May, Chief Scientific Adviser"
    ],
    "categories": [
        "Science"
    ],
    "pub_date": "2024-09-03T11:21:25+01:00",
    "content": [
        {
            "text": "Cymraeg"
        },
        {
            "text": "We are currently recruiting for new members to join our independent Science Council and Science Advisory Committees (SACs)."
        },
        {
            "text": "Our committees are essential to the work of the FSA and help us to be an effective science and evidence-led organisation. Our SACs play a huge part in helping us to prioritise our work and ensure our advice to consumers is evidence-based and accurate."
        },
        {
            "text": "To help our SACs provide expert advice we take pride in having members from a wide range of disciplines, so that discussions and decisions are fuelled by diverse voices and experiences, using extensive skills and expertise."
        },
        {
            "text": "To get a feel for what being a member of one of our SACs is like, we spoke to two current members to find out more."
        },
        {
            "heading": 2,
            "text": "Tell us about the committee you are a member of."
        },
        {
            "text": "Julie Hill: I am a member of the Advisory Committee on Social Sciences (ACSS), which provides expert strategic advice to the FSA on its use of social science."
        },
        {
            "text": "Clare Stephenson: I am a member of the Joint Expert Group on Additives, Enzymes and other Regulated Products (AEJEG) and the Smoke Flavourings Working Group (SFWG)."
        },
        {
            "heading": 2,
            "text": "What is your role in the committee, and what are your responsibilities?"
        },
        {
            "text": "Julie Hill: I am the Chair of the ACSS, and I liaise closely with FSA colleagues to shape the agenda for the committee’s work. I ensure that committee members are able to contribute fully to the work programme, I run meetings and ensure that in general, things run smoothly!"
        },
        {
            "text": "Clare Stephenson: My expertise is dietary exposure, which I use to help shape the work of the committee."
        },
        {
            "heading": 2,
            "text": "What is it like working with the FSA?"
        },
        {
            "text": "Julie Hill: The FSA has a hugely important role in ensuring that people can trust food in several key ways, and it is valuable work to be part of. The FSA is very good at utilising and responding to expert advice and making it a rewarding role, where everyone is continually learning and developing."
        },
        {
            "text": "Clare Stephenson: FSA colleagues create a productive environment that helps to promote and focus discussion. As a committee member, not only do you make an important contribution to food safety, but the FSA encourages members to contribute to wider issues, which will hopefully feed into future UK guidance, model development and influence future regulatory approaches."
        },
        {
            "heading": 2,
            "text": "What is the best thing about being a member of your committee?"
        },
        {
            "text": "Julie Hill: Feeling that I have played a role in protecting consumers and contributing to a better food system."
        },
        {
            "text": "Clare Stephenson: The team. Each member makes a contribution, but the committees (together with the Secretariat) are greater than the sum of their parts. Hearing the perspectives of others, facing challenges and being exposed to new and emerging areas of science is as interesting as it is challenging."
        },
        {
            "heading": 2,
            "text": "How has being a committee member helped you in your career?"
        },
        {
            "text": "Julie Hill: It has given me a great deal of knowledge about food and food safety. In addition, it has helped me to develop skills in relation to being a committee member (for example, teamwork and effective contributions) and I have also been able to develop my chairing skills when I was fortunate enough to be appointed to that role."
        },
        {
            "text": "Clare Stephenson: Each application brings something new, allowing me to build on my existing knowledge and expertise, and collaborating with experts from other disciplines is crucial to providing sound advice. Committee work allows me to develop my technical knowledge and enhance my analytical and communication skills."
        },
        {
            "heading": 2,
            "text": "Who would you encourage to apply?"
        },
        {
            "text": "Julie Hill: Anyone who is interested in the future of food, is able to contribute expert advice in an accessible way, and anyone who is a good team player and a good listener."
        },
        {
            "text": "Clare Stephenson: Experts from a regulatory science background from other chemical regimes that bring fresh perspectives, alongside technical expertise."
        },
        {
            "heading": 3,
            "text": "Find out more about the roles and apply to join the FSA's Science Advisory Committees and Science Council."
        },
        {
            "text": "If you’d like to learn more from members of other committees, such as the Science Council, the Advisory Committee on Animal Feedingstuffs or the Advisory Committee on the Microbiological Safety of Food, you can read our previous blog from September 2023."
        },
        {
            "heading": 1,
            "text": "Rhannwch eich arbenigedd ac ymunwch â’n Pwyllgorau Cynghori Gwyddonol"
        },
        {
            "text": "Ar hyn o bryd, rydym yn recriwtio aelodau newydd ar gyfer ein Cyngor Gwyddoniaeth a’n Pwyllgorau Cynghori Gwyddonol annibynnol. "
        },
        {
            "text": "Mae ein pwyllgorau yn hanfodol i waith yr ASB ac maent yn ein helpu i fod yn sefydliad effeithiol sy’n cael ei arwain gan wyddoniaeth a thystiolaeth. Mae ein pwyllgorau yn chwarae rhan enfawr wrth ein helpu i flaenoriaethu ein gwaith a sicrhau bod ein cyngor i ddefnyddwyr yn seiliedig ar dystiolaeth ac yn gywir."
        },
        {
            "text": "Er mwyn helpu ein pwyllgorau i ddarparu cyngor arbenigol, mae gennym aelodau o ystod eang o ddisgyblaethau. Mae hyn yn destun balchder i ni, gan fod trafodaethau a phenderfyniadau’r pwyllgorau’n cael eu llywio gan leisiau a phrofiadau amrywiol yr aelodau, a phob un ohonynt yn cynnig sgiliau ac arbenigedd helaeth."
        },
        {
            "text": "I gael syniad sut beth yw bod yn aelod o un o’n pwyllgorau, siaradais â rhai aelodau presennol i gael gwybod mwy."
        },
        {
            "heading": 2,
            "text": "Dywedwch wrthym am y pwyllgor rydych yn aelod ohono."
        },
        {
            "text": "Julie Hill: Rwy’n aelod o’r Pwyllgor Cynghori ar Wyddor Gymdeithasol (ACSS), sy’n rhoi cyngor strategol arbenigol i’r ASB ar ei defnydd o’r gwyddorau cymdeithasol."
        },
        {
            "text": "Clare Stephenson: Rwy’n aelod o’r Grŵp Arbenigol ar y Cyd ar Ychwanegion, Ensymau a Chynhyrchion Rheoleiddiedig eraill (AEJEG) a’r Gweithgor Cyflasynnau Mwg (SFWG)."
        },
        {
            "heading": 2,
            "text": "Beth yw eich rôl ar y pwyllgor, a beth yw eich cyfrifoldebau?"
        },
        {
            "text": "Julie Hill: Fi yw Cadeirydd yr ACSS, ac rwy’n cynnal cysylltiadau agos â chydweithwyr yn yr ASB i lunio’r agenda ar gyfer gwaith y pwyllgor. Rwy’n sicrhau bod aelodau’r pwyllgor yn gallu cyfrannu’n llawn at y rhaglen waith, rwy’n cynnal cyfarfodydd ac yn sicrhau bod pethau, ar y cyfan, yn rhedeg yn esmwyth!"
        },
        {
            "text": "Clare Stephenson: Fy arbenigedd yw materion ynghylch dod i gysylltiad â pheryglon dietegol, ac rwy’n defnyddio’r arbenigedd hwnnw i helpu i lunio gwaith y pwyllgor."
        },
        {
            "heading": 2,
            "text": "Sut brofiad yw gweithio gyda’r ASB?"
        },
        {
            "text": "Julie Hill: Mae gan yr ASB rôl hynod bwysig o ran sicrhau bod pobl yn gallu ymddiried mewn bwyd mewn sawl ffordd allweddol, ac mae’n waith gwerthfawr i fod yn rhan ohono. Mae’r ASB yn dda iawn am ddefnyddio cyngor arbenigol ac ymateb iddo, ac am wneud y rôl yn un werth chweil, lle mae pawb yn dysgu ac yn datblygu’n barhaus."
        },
        {
            "text": "Clare Stephenson: Mae cydweithwyr yn yr ASB yn creu amgylchedd gwaith cynhyrchiol sy’n helpu i hyrwyddo a rhoi ffocws i drafodaethau. Fel aelod pwyllgor, yn ogystal â gwneud cyfraniad pwysig at ddiogelwch bwyd, mae’r ASB yn annog aelodau i gyfrannu at faterion ehangach, a’r gobaith yw y bydd y cyfraniadau hyn yn ychwanegu at ganllawiau’r DU yn y dyfodol, yn helpu i ddatblygu modelau ac yn dylanwadu ar ddulliau rheoleiddio yn y dyfodol."
        },
        {
            "heading": 2,
            "text": "Beth yw’r peth gorau am fod yn aelod o’ch pwyllgor chi?"
        },
        {
            "text": "Julie Hill: Y peth gorau i mi yw’r teimlad fy mod i wedi chwarae rhan wrth ddiogelu defnyddwyr a chyfrannu at system fwyd well."
        },
        {
            "text": "Clare Stephenson: Y tîm. Mae pob aelod yn gwneud cyfraniad, ond mae’r pwyllgorau (ynghyd â’r Ysgrifenyddiaeth) yn fwy na chyfanswm eu rhannau. Mae clywed safbwyntiau pobl eraill, wynebu heriau a bod yn agored i feysydd gwyddoniaeth newydd a rhai sy’n dod i’r amlwg yr un mor ddiddorol ag y mae’n heriol."
        },
        {
            "heading": 2,
            "text": "Sut mae bod yn aelod pwyllgor wedi eich helpu yn eich gyrfa?"
        },
        {
            "text": "Julie Hill: Mae wedi rhoi llawer iawn o wybodaeth i mi am fwyd a diogelwch bwyd. Yn ogystal, mae wedi fy helpu i ddatblygu sgiliau mewn perthynas â bod yn aelod pwyllgor (er enghraifft, gwaith tîm a chyfraniadau effeithiol) ac rwy hefyd wedi gallu datblygu fy sgiliau cadeirio pan oeddwn yn ddigon ffodus i gael fy mhenodi i’r rôl honno."
        },
        {
            "text": "Clare Stephenson: Mae pob cais yn dod â rhywbeth newydd, sy’n fy ngalluogi i adeiladu ar fy ngwybodaeth a’m harbenigedd presennol, ac mae cydweithio ag arbenigwyr o ddisgyblaethau eraill yn hanfodol i ddarparu cyngor cadarn. Mae gwaith pwyllgor yn fy ngalluogi i ddatblygu fy ngwybodaeth dechnegol a gwella fy sgiliau dadansoddi a chyfathrebu."
        },
        {
            "heading": 2,
            "text": "Pwy fyddech chi’n ei annog i wneud cais?"
        },
        {
            "text": "Julie Hill: Unrhyw un sydd â diddordeb yn nyfodol bwyd, sydd â’r gallu i gyfrannu cyngor arbenigol mewn ffordd hygyrch, ac unrhyw un sy’n gallu cydweithio a gwrando’n dda."
        },
        {
            "text": "Clare Stephenson: Arbenigwyr o gefndir gwyddoniaeth reoleiddiol sydd ynghlwm wrth gyfundrefnau cemegol eraill ac a all gynnig safbwyntiau ffres, ochr yn ochr ag arbenigedd technegol."
        },
        {
            "heading": 3,
            "text": "Dysgwch fwy am y rolau a gwnewch gais i ymuno â Phwyllgorau Cynghori Gwyddonol a Chyngor Gwyddoniaeth yr ASB."
        },
        {
            "text": "Os hoffech ddysgu mwy gan aelodau o bwyllgorau eraill, fel y Cyngor Gwyddoniaeth, y Pwyllgor Cynghori ar Fwydydd Anifeiliaid neu’r Pwyllgor Cynghori ar Ddiogelwch Microbiolegol Bwyd, gallwch ddarllen ein blog blaenorol o fis Medi 2023."
        }
    ]
}