{
    "url": "https://cddo.blog.gov.uk/2025/01/17/behind-government-digital-and-data-meet-the-people-driving-a-modern-digital-government/",
    "title": "Behind Government Digital and Data: meet the people driving a modern digital government",
    "authors": [
        "Central Digital and Data Office"
    ],
    "categories": [
        "CDDO",
        "Cross-government strategy",
        "Data",
        "DDaT community",
        "Digital transformation",
        "Government Digital and Data"
    ],
    "pub_date": "2025-01-17T09:47:12+00:00",
    "content": [
        {
            "text": "From transforming public services to unlocking the power of data, our Government Digital and Data experts are at the forefront of innovation in public service delivery. In this blog we shine a spotlight on some of the remarkable individuals who are harnessing technology and data to make government work better for everyone."
        },
        {
            "text": "Our digital and data professionals come from diverse backgrounds and work on an impressive range of projects - whether they're building user-friendly platforms, analysing complex datasets to inform policy decisions, or developing new ways to make public services more accessible and efficient."
        },
        {
            "text": "Join us as we explore their stories, challenges, and achievements, offering a behind-the-scenes look at how digital transformation is reshaping the way government serves citizens in the 21st century. Through these personal accounts, we'll discover how their work is making a real difference to people's lives across the UK."
        },
        {
            "heading": 3,
            "text": "Dia Nag, Chair, Cabinet Office Women In Digital Network & Head of Product - Strategy & Digital Transformation for Cabinet Office"
        },
        {
            "text": "Before moving to the UK in 2008, Dia worked in India's international publishing and journalism sectors. She joined the UK public sector in 2016 at the Parliamentary Digital Service, later moving to the Government Digital Service and Cabinet Office."
        },
        {
            "text": "Most recently Dia was a key figure in establishing the Digital and Data Directorate for the Cabinet Office in 2020 and leading the launch of the Cabinet Office Digital brand. "
        },
        {
            "text": "Her contributions earned recognition and were awarded in NetZero50 Leaders 2024, Government Transformation 100 Top Leaders 2024 and “Women’s Network of the Year” award for 2024."
        },
        {
            "text": "We asked Dia what inspired her to pursue a career in digital and data within the Civil Service, and what’s been the most rewarding experience so far?"
        },
        {
            "heading": 3,
            "text": "Chris Back, Head of Delivery, Homes for Ukraine, Ministry of Housing, Communities and Local Government"
        },
        {
            "text": "As a dynamic leader in digital government transformation, Chris has made significant contributions to modernising UK public services, most notably through his work on online conveyancing including during the pandemic and the Homes for Ukraine programme"
        },
        {
            "text": "With a passion for collaborative leadership and continuous learning, he recently achieved certification in scaled agile methodologies and is a champion for the geographical spread of digital and data talent across the UK as one of the government's greatest strengths."
        },
        {
            "text": "We asked Chris what excites him the most about the future of digital and data within government?"
        },
        {
            "heading": 3,
            "text": "Freya Krol, Lead User Researcher – Labs, Foreign, Commonwealth & Development Office"
        },
        {
            "text": "Freya is a passionate lead user researcher at the Foreign, Commonwealth and Development Office (FCDO) following her time on the Civil Service Fast Stream. She has established FCDO's first User-Centred Design Community of Practice and developed innovative training initiatives to nurture emerging talent. "
        },
        {
            "text": "Her impactful work in user research includes transforming services designed to attract, inspire and enable prospective teachers to apply for their initial teacher training at the Department of Education, and planning and leading user research activities on complex projects to advance FCDO’s diplomatic and development objectives. "
        },
        {
            "text": "With a strong commitment to open data initiatives and data-driven decision-making, Freya champions user-centred design principles across government, believing in creating more empathetic and responsive public services through digital transformation."
        },
        {
            "text": "We asked Freya, what does Government Digital and Data mean to her?"
        },
        {
            "heading": 3,
            "text": "Graeme Jamieson, Head of Accessibility, HM Revenue & Customs"
        },
        {
            "text": "Graeme is an accessibility specialist at HMRC and the head of the Digital Inclusion and Accessibility Standards team, which has played a key role in ensuring government services are accessible to all users. Since joining the Civil Service in March 2021, motivated by the pandemic’s impact on digital exclusion, Graeme has encouraged his team to embed accessibility knowledge and expertise into projects like the HMRC app. "
        },
        {
            "text": "The team’s involvement in collaborating with service teams was vital in making accessibility a core part of the app’s development process, meaning they could release new features faster and more often. This commitment has been instrumental in transforming the perception of government digital services, showcasing them as dynamic, efficient and accessible."
        },
        {
            "text": "We asked Graeme to share a moment when his work has a direct impact on improving government services or the experience of users. "
        }
    ]
}