{
    "url": "https://defrafmp.blog.gov.uk/2025/01/17/defras-bass-management-group-a-new-era-for-englands-bass-fishery/",
    "title": "Defra's Bass Management Group: a new era for England's bass fishery",
    "authors": [
        "Nicola"
    ],
    "categories": [
        "- Defra led FMPs",
        "Bass FMP"
    ],
    "pub_date": "2025-01-17T14:55:12+00:00",
    "content": [
        {
            "heading": 2,
            "text": "Launch of the Bass Management Group "
        },
        {
            "text": "We’ve noticed that bass fisheries are a recurring topic in the comments section of our blog posts which highlights the strong interest and engagement on this FMP and so are pleased to share a major milestone on bass FMP implementation. "
        },
        {
            "text": "The first meeting of the Bass Management Group took place on 8 November 2024. "
        },
        {
            "text": "Establishing the group is a key short-term goal of the bass fisheries management plan. "
        },
        {
            "heading": 3,
            "text": "Who is involved? "
        },
        {
            "text": "The group consists of 18 members from the UK bass fishing industry, including representatives from recreational and commercial sectors, regulators, environmental groups and scientific bodies.  Members were chosen based on their involvement in the UK bass fishery, previous engagement with the bass FMP and their established wide reach to stakeholders.  "
        },
        {
            "text": "These sector representatives will work collaboratively alongside policy makers from Defra and the Welsh Government to define how best to deliver the goals of the bass FMP.  "
        },
        {
            "text": "Representation on the group has been confirmed and although we’re not taking on new members, if you would like to contribute your views on the bass FMP, please contact us at BassFMP@defra.gov.uk "
        },
        {
            "heading": 3,
            "text": "How will it work? "
        },
        {
            "text": "To make the Bass Management Group as effective as possible at delivering its aims, smaller subgroups, known as ‘task-and-finish' groups will be formed to tackle specific measures set out in the bass FMP. Task-and-finish groups will draw on expertise from within the Bass Management Group and external industry knowledge to ensure a wide range of viewpoints are considered and discussed, alongside scientific evidence. "
        },
        {
            "heading": 3,
            "text": "What did the first meeting cover? "
        },
        {
            "text": "Members discussed their ambitions for the future of bass management within English waters, as well as the bass FMP goals that their organisations wished to prioritise. Defra provided members with an update regarding work that is underway, as well as an update on UK negotiations with the EU, and Cefas delivered a presentation on bass evidence gaps.  "
        },
        {
            "text": "To request the meeting notes, please contact BassFMP@defra.gov.uk "
        },
        {
            "heading": 3,
            "text": "Looking ahead  "
        },
        {
            "text": "The Bass Management Group plans to meet quarterly, with the task-and-finish groups to meet more often as needed. Collectively, these meetings aim to provide regular opportunities for collaboration to address relevant areas and issues.      "
        },
        {
            "text": "While the group provides a formal place to engage on this FMP, we’re also exploring other ways to reach a wider audience.  If you’re a recreational fisher, we encourage you to attend the quarterly Recreational Sea Fishing Forum (contact recreational-seafishing@defra.gov.uk). This meeting provides a valuable opportunity to share your perspectives and support the promotion and development of recreational sea fishing.  "
        },
        {
            "text": "Please use the comment section below for any feedback or questions about this post on the  Bass Management Group - following the blog guidelines. "
        },
        {
            "text": "If you have specific queries and comments about details of the bass FMP, please contact the policy team at BassFMP@defra.gov.uk "
        },
        {
            "text": "Additionally, if you have any suggestions on how we can improve engagement for this or any of our FMPs we’d love to hear from you at FMPs@defra.gov.uk     "
        }
    ]
}