{
    "url": "https://minimumwage.blog.gov.uk/2025/01/17/low-pay-commission-regional-visits-2025/",
    "title": "Low Pay Commission regional visits 2025",
    "authors": [
        "josephwilkinson"
    ],
    "categories": [
        "Uncategorized"
    ],
    "pub_date": "2025-01-17T11:25:48+00:00",
    "content": [
        {
            "heading": 2,
            "text": "Make your views heard on the future of the minimum wage"
        },
        {
            "text": "The Low Pay Commission (LPC) is the independent body which advises the Government on the National Minimum Wage (NMW), including the National Living Wage (NLW). Commissioners are drawn from different backgrounds, representing the interests of workers, employers and independent experts."
        },
        {
            "text": "A big part of our work is hearing first-hand from the workers and employers affected by the minimum wage. Each year we travel across the UK to meet the people affected by our recommendations."
        },
        {
            "heading": 3,
            "text": "What we do"
        },
        {
            "text": "We make recommendations to the Government on the level of the minimum wage and on related policy issues which affect workers and employers. To do this, we draw on the latest data on the labour market and economy, and first-hand testimony from those directly affected by the minimum wage."
        },
        {
            "text": "We work through the year to gather evidence. Commissioners negotiate and agree recommendations in the autumn and we publish an annual report setting out our advice alongside the evidence and analysis we relied on."
        },
        {
            "heading": 3,
            "text": "What we want to talk about"
        },
        {
            "text": "We want to hear from you about:"
        },
        {
            "heading": 3,
            "text": "What we do with your evidence"
        },
        {
            "text": "Your evidence will help shape Low Pay Commissioners’ thinking about the next steps for the National Minimum Wage, including when they negotiate and agree rates in autumn 2025. All the evidence we hear and data we used are summarised in our annual report."
        },
        {
            "text": "Anything you tell us will be treated in confidence. All evidence will be anonymised as appropriate, and nothing attributed to you without your permission."
        },
        {
            "heading": 3,
            "text": "How can you speak to us?"
        },
        {
            "text": "This year we will be visiting the following locations: "
        },
        {
            "text": "If you wish to take part, please contact us via lpc@lowpay.gov.uk or 07341 098734."
        },
        {
            "text": "We hold meetings beyond these regional visits. If you can't make these locations or dates, but still want to contribute, please do get in touch."
        },
        {
            "heading": 3,
            "text": "What is the current minimum wage?"
        },
        {
            "text": "The table below sets out the current minimum wage rates, alongside the rates which will come into effect on 1 April 2025."
        }
    ]
}