{
    "url": "https://homeofficemedia.blog.gov.uk/2025/01/17/media-factsheet-eu-settlement-scheme-2/",
    "title": "Media factsheet: EU Settlement Scheme",
    "authors": [
        "Home Office news team"
    ],
    "categories": [
        "Fact sheet"
    ],
    "pub_date": "2025-01-17T13:14:06+00:00",
    "content": [
        {
            "text": "This factsheet was updated on 16 January 2025"
        },
        {
            "text": "The EU Settlement Scheme (EUSS) enables EU, other EEA and Swiss citizens resident in the UK by the end of the transition period on 31 December 2020, and their family members, to obtain the status they require in order to live and work in the UK after 30 June 2021."
        },
        {
            "text": "The scheme opened to the public on 30 March 2019. The deadline for most people to apply to the EUSS was 30 June 2021, but eligible applicants may still be able to apply if they have a later deadline to do so or they have ‘reasonable grounds’ for their delay in applying."
        },
        {
            "text": "More than three years have passed since the 30 June 2021 deadline, and we continue to make changes to the scheme. This includes a change from January to automatically convert eligible pre-settled status holders to settled status without the need for them to make a further EUSS application (further details are below)."
        },
        {
            "text": "Key statistics"
        },
        {
            "text": "Settled status automation from 2025"
        },
        {
            "text": "What is the Home Office’s response to the High Court judgment in the judicial review brought by the Independent Monitoring Authority for the Citizens’ Rights Agreements (IMA) concerning pre-settled status holders under the EUSS?"
        },
        {
            "text": "What status will successful applicants get?"
        },
        {
            "text": "Why might people be refused?"
        },
        {
            "text": "Temporary protection of rights"
        },
        {
            "text": "What is the status of those who have made a valid application but not yet received a decision?"
        },
        {
            "text": "Are you introducing physical proof of status?"
        },
        {
            "text": "Evidencing status in the UK"
        },
        {
            "text": "How can someone evidence that they have an application pending?"
        },
        {
            "text": "How do you know employers and landlords won’t discriminate against people with pending applications?"
        },
        {
            "text": "How does somebody with status under the EUSS enter the UK if they do not have physical documentation to show they have applied?"
        },
        {
            "text": "Child citizenship"
        },
        {
            "text": "Applying on behalf of children"
        },
        {
            "text": "Will somebody who has not applied have access to benefits?"
        },
        {
            "text": "Will somebody who did not apply by 30 June 2021 or applies late lose guaranteed access to healthcare and NHS services?"
        },
        {
            "text": "What support is available for those who need to apply to switch from pre-settled to settled status, use their status, or make a late application?"
        },
        {
            "text": "What support is available for people with a digital-only status to demonstrate that?"
        }
    ]
}