{
    "url": "https://sustainableict.blog.gov.uk/2025/01/17/why-were-supporting-the-government-digital-sustainability-alliance/",
    "title": "Why we’re supporting the Government Digital Sustainability Alliance",
    "authors": [
        "Ewen Anderson",
        "Gerry Hackett"
    ],
    "categories": [
        "Circular economy",
        "GDSA",
        "Scope 3",
        "Uncategorized"
    ],
    "pub_date": "2025-01-17T16:00:03+00:00",
    "content": [
        {
            "text": "Gerry Hackett and Ewen Anderson tell us why they have each volunteered to chair one of our Government Digital Sustainability Alliance (GDSA) working groups, sharing their personal career journeys to this point, and their ideas for where they see some of the big opportunities to make a difference in this area."
        },
        {
            "heading": 2,
            "text": "Gerry Hackett, Circular Economy working group"
        },
        {
            "text": "Hi, I’m Gerry Hackett, and I’ve taken up this new role because I believe the group can really help government to manage their technology estates better. In its simplest form, circularity is about reusing stuff where you can, and recycling when you can’t, coupled with an understanding of the cash and carbon impacts of those decisions."
        },
        {
            "text": "What exactly does good look like in this context? What are the key considerations? Within the CEWG are many, many years of experience in answering these questions on behalf of some of the largest organisations in the world. I think we can distil that knowledge for the benefit of government, to better understand the issues, save money and improve environmental performance."
        },
        {
            "heading": 3,
            "text": "How I got here"
        },
        {
            "text": "I began my time in the technology circular economy back in 1992, when I founded Nationwide Computer Auctions. The concept was a regular calendar of auctions where anyone could buy and/or sell used tech hardware and software. The auctions were instantly popular and quickly expanded the events to three sales every weekend across fifteen sites in Southern England."
        },
        {
            "text": "Over the next five years we began to attract businesses, large and small, looking to realise value from their used IT estates at auction. To address this demand, we quickly gathered the key elements of the IT Asset Disposal proposition – transport to collect the equipment, data wiping tools to erase data, electrical safety testing, mass industrial recycling by product type and regulatory compliance across the whole operation. The Environment Agency was our first customer and RDC was born."
        },
        {
            "text": "RDC was the business bought by Computacenter (CC) in 1999. RDC has operated circular services for Computacenter from that date until now. With a brief interlude, following the Arrow acquisition, I have been in charge of the business throughout this time."
        },
        {
            "text": "I oversaw the development of its service portfolio for Computacenter’s large corporate and government customers. With our colleagues at CC, we have gradually merged the sourcing, maintenance, financing and deployment of new technology with the reuse and recycling of used."
        },
        {
            "text": "In January 2025, the business was renamed Computacenter Circular Services, and I stepped back from the day-to-day management of the business to look at our broader strategy in the UK and internationally. The opportunity to chair this working group within GDSA has therefore come at a good time. I’m both grateful and excited at the prospect of making a difference beyond the walls of Computacenter."
        },
        {
            "heading": 3,
            "text": "What I think we can achieve"
        },
        {
            "text": "We have representatives from most of the technology sector and we should bring that experience to bear, to clear some of the fog surrounding this business of circularity. When I set up NCA in 1992, the circular economy was simply the used economy, giving discarded product a new life in someone else’s hands. It is an ancient activity with direct relevance to today - saving money, time and energy by mending, fixing, repairing, upgrading and reusing used stuff."
        },
        {
            "text": "This has always made sense, but it has a greater urgency today with the ubiquity of digital technology, the scarcity of raw materials and the need to retrieve those materials when the reuse routes are exhausted."
        },
        {
            "text": "Then we have energy. B2B technology represents about one eighth of worldwide electronic waste and it is consuming more and more of the world’s energy output. The measurement and evaluation of our carbon footprints is a key element in the decisions around the deployment of technology assets."
        },
        {
            "text": "I think our priority, therefore, is firstly to provide government with a guide to the main features of the digital circular economy. We can explain terminology, outline good process, look at key yardsticks, and highlight the tangible benefits, both in carbon and cash, of the right approach. We have the right people in the working group to bring this alive across central and local government and suppliers."
        },
        {
            "heading": 3,
            "text": "What success looks like to me"
        },
        {
            "text": "In the short term, success in this role would be the production of a guide outlining the principles of technology circularity, which can form part of a broader GDSA educational programme."
        },
        {
            "text": "In the longer term, success would see a wider adoption of circularity principles into cross government procurement and supplier management. Circularity brings better environmental performance and reduces costs."
        },
        {
            "heading": 2,
            "text": "Ewen Anderson, Scope 3 working group"
        },
        {
            "text": "Hi I’m Ewen and I’m the CEO of P2zero.  P2zero joined the GDSA because we believe it has the potential to really help UK government departments make a substantial reduction in their carbon emissions and environmental impact. "
        },
        {
            "heading": 3,
            "text": "Why take on the role of chair for the Scope 3 working group?"
        },
        {
            "text": "The GDSA Scope 3 working group was where I felt my personal skills would be of most use, given the importance of the ICT supply chain and the complexity of reporting.  I accepted the nomination as Chair because I believe my experience working as a company Chair and a consultant in ICT, business and sustainability roles will support the GDSA objectives and help my colleagues in the working group to deliver the best possible outcomes from the group."
        },
        {
            "heading": 3,
            "text": "How I got here"
        },
        {
            "text": "My professional career began in the gas industry as a management services consultant working on business case analysis and strategic change.  Recognising the increasing role and importance of ICT, I took on responsibility for End User Computing, developing an enterprise Windows solution as an in-house managed service for around 20,000 staff.  I set up my first commercial ICT consulting business in 1996, remaining as CEO and strategic consulting lead for nearly 20 years. My focus has been on sustainability since 2017, working on ICT sustainability projects for central and local government, charities and commercial organisations of all sectors and sizes including three of the world’s “big five” technology companies. "
        },
        {
            "heading": 3,
            "text": "What I think we can achieve"
        },
        {
            "text": "Scope 3 emissions are typically the largest element of an organisation’s carbon footprint, so it is really important that we source good quality data and link it to an actionable carbon reduction plan.  The scope 3 working group is looking at a range of case studies and established best practice methodologies to see what can be provided as examples to government of initiatives and changes that drive positive results."
        },
        {
            "text": "It's crucial for us that anything we deliver is useful and accessible, so we have been surveying government sustainability leads to get their feedback on what is needed, who to send it to and the best format to use.  We believe that this research will help ensure that we create content that can genuinely make a difference."
        },
        {
            "heading": 3,
            "text": "What success looks like to me"
        },
        {
            "text": "We need to build momentum and drive results across all the working groups, so I hope that I can support the Scope 3 group but also integrate with the other workstreams to share and learn. We also need to widen participation within the working party and include a diverse set of industry knowledge and experience."
        },
        {
            "text": "Long term success is all about actual reductions in real carbon emissions.  Immediate impacts can be difficult to measure because emissions figures may rise in the short term as the quality of data, methodology and reporting improves. These are necessary adjustments to the baseline figures which are required if we want to establish baselines and reduction strategies."
        },
        {
            "text": "So, in the short term, success will not necessarily be to see the numbers coming down, it will be to see the quality of reporting going up and the establishment of carbon reduction plans that are linked to trustworthy data.  Longer term success is to see those downward trends happening with figures that are credible and set an example to the wider public and private sector of what is possible."
        },
        {
            "text": "Gerry and Ewen will continue to keep blog readers of this channel updated on their working groups progress as they go. Any thoughts, comments or feedback can be shared by posting a comment below. Gerry Hackett takes over from Alan Sawyer as the Chair of the GDSA Circular Economy working group. We would like to thank to Alan for his leadership and support of this working group since its formation."
        },
        {
            "text": "Check out our LinkedIn page for all the latest news, stories and job openings. While you're there, why not give us a follow."
        }
    ]
}