{
    "url": "https://educationhub.blog.gov.uk/2023/12/artificial-intelligence-in-schools-everything-you-need-to-know/",
    "title": "Artificial intelligence in schools – everything you need to know",
    "authors": [
        "mediaofficer"
    ],
    "categories": [
        "Schools"
    ],
    "pub_date": "2023-12-06T15:46:04+00:00",
    "content": [
        {
            "text": "Artificial intelligence (AI) is here to stay – it’s already having a positive impact across society, including in the education sector."
        },
        {
            "text": "We believe it could be used to improve our education system, for example, early research suggests it could be used to free up teachers’ time and provide personalised support to pupils."
        },
        {
            "text": "While we want to make the most out of this emerging technology, we need to understand its risks, as well as its opportunities."
        },
        {
            "text": "Here, we set out what we’re doing to develop artificial intelligence in education safely and explore how it could benefit both teachers and young people."
        },
        {
            "heading": 3,
            "text": "What are you doing to develop AI in education?"
        },
        {
            "text": "From investing in AI tools, to gathering evidence about how teachers and pupils are using AI, we’re already investigating how we take can advantage of AI in education."
        },
        {
            "text": "These are just first steps, but we have already:"
        },
        {
            "text": "To understand how those in education already use generative AI – including its use to produce content, such as text imagery and audio – we launched a call for evidence to gather views from educational professionals, academics and the edtech sector on its risks and possibilities. The results show AI is already being used to reduce administrative tasks and are optimistic about its potential."
        },
        {
            "text": "We organised a two-day hackathon for teachers and school leaders from across England, which allowed teachers and school leaders to work with data scientists to come up with solutions which use AI to tackle real-life issues like teacher workload. The results of the hackathon will be published next year."
        },
        {
            "text": "This boost for Oak National Academy, an online learning platform, will help develop new, free resources for teachers which are powered by AI, such as lesson planners and classroom quizzes."
        },
        {
            "heading": 3,
            "text": "How could AI help teachers?"
        },
        {
            "text": "We’re still in the early stages of exploring the possibilities of AI and how it could benefit teachers. One area we’re looking at includes using AI tools to cut teacher workload by providing teachers with a virtual ‘assistant’."
        },
        {
            "text": "From drafting curriculum plans to producing high-quality teaching resources, AI has the potential to reduce the amount of time teachers spend doing administrative tasks, so they can focus on what they do best– teaching and supporting their pupils."
        },
        {
            "heading": 3,
            "text": "Does this mean pupils could be taught by AI?"
        },
        {
            "text": "Absolutely not."
        },
        {
            "text": "Teachers are irreplaceable, and AI could never be a substitute for teachers’ professional judgement and the personal relationship they have with their pupils."
        },
        {
            "text": "We’re aiming to develop AI to serve teachers better, not to take away from the unique role that they play."
        },
        {
            "text": "We’re also making sure that with any AI tools, teachers are always in charge and that there is always a “human in the loop”. For example, we wouldn’t support the use of AI to draft personalised plans or guidance without expert human involvement."
        },
        {
            "heading": 3,
            "text": "How could AI help pupils?"
        },
        {
            "text": "There is much more work to be done to explore how AI could enhance how pupils learn, and we know that there are concerns around the risks for young people, especially as this is a new form of technology. The development of any AI tools for young people would prioritise their safety and security."
        },
        {
            "text": "This includes ensuring that children and young people are not accessing or creating harmful or inappropriate content online through generative AI, and that their data and intellectual property is protected."
        },
        {
            "text": "As AI tools are interactive and can be easily personalised, they could be used to provide all young people with their own virtual ‘tutor’. To name one example, AI could help provide pupils with a bespoke workplan, based on marking and assessments from teachers."
        },
        {
            "heading": 3,
            "text": "What are you doing to stop pupils using AI to cheat?"
        },
        {
            "text": "While there are many positive uses for AI tools, we know that some parents and teachers are concerned about pupils using them to do their homework for them, or cheat in exams."
        },
        {
            "text": "Results of the call for evidence and the hackathon will provide the base for future policy on AI, including how schools can work around the possibility of students using it to cheat."
        }
    ]
}