{
    "url": "https://ipa.blog.gov.uk/2023/12/06/data-and-digitalisation-powering-the-uks-major-government-projects/",
    "title": "Data and digitalisation - powering the UK’s major government projects",
    "authors": [
        "laurenvamplew"
    ],
    "categories": [
        "digital infrastructure",
        "Major projects",
        "Modern Methods of Construction",
        "Project Delivery",
        "Transforming Infrastructure Performance"
    ],
    "pub_date": "2023-12-06T16:32:23+00:00",
    "content": [
        {
            "heading": 5,
            "text": "Source: Shutterstock"
        },
        {
            "text": "In a world of scarce resources, tight deadlines and limited budgets, being as productive and efficient as possible is key to delivering value for citizens - the use of data and digital tools is essential in this.  "
        },
        {
            "text": "IPA is at the forefront of embedding the use of data and digital into how we deliver major projects and wider transformation delivery. The ambition is that digital practices and the use of data become the drivers of productivity for project delivery."
        },
        {
            "text": "We are already acting on this now"
        },
        {
            "text": "At the heart of the IPA’s ‘Transforming Infrastructure Performance’ (TIP) programme lies the need for a step change in productivity and efficiency in the ways we plan, design, manufacture, construct and operate infrastructure. It will require data from all parts of the system to inform decision-making, from improved information management in delivery to the creation of digital twins for asset construction, maintenance and optimisation. "
        },
        {
            "text": "That’s why we are actively investing in using cutting-edge technology in projects across the UK. From component tracking systems at HMP Millsike - the first prison to operate as zero-carbon - that integrate and enhance supply chain data in real-time, to leveraging drone technology and machine learning to make our railways safer."
        },
        {
            "text": "The Digitalisation in Infrastructure Projects guide, available to all project delivery leaders within government, intends to help us achieve that. The guide offers advice and information on digital opportunities that need to be exploited in projects and contracts to deliver increased quality and cost efficiency. It also describes the key benefits of digitalisation and the efficient implementation of it in delivery. It provides specific guidance on BIM (building information modelling), digital twins and using modern methods of construction (MMC). "
        },
        {
            "text": "Case studies"
        },
        {
            "heading": 5,
            "text": "Source: Shutterstock"
        },
        {
            "text": "The delivery of Crossrail demonstrated the numerous benefits of implementing IPA’s TIP principles, especially in the utilisation of digital tools. The use of BIM, including 3D and 4D modelling, saved both time and money during the civil construction. Modelling was also used when managing the construction fit of mechanical, electrical and plumbing systems. "
        },
        {
            "text": "The pioneering use of digital twins on this project - creating a virtual railway alongside the physical railway - also allowed the design to be developed to improve and optimise the design, construction, operation and eventual decommissioning of the railway. It was great to see that the successful use of this was shared with HS2, who are creating a digital twin on their project."
        },
        {
            "text": "Currently underway is the delivery of HMP Millsike, a project building net-zero prisons that implements methods and techniques proven to be effective in the recent delivery of HMP Five Wells. Digital innovation such as the use of digital twin technology and MMC principles has increased the productivity and efficiency of the project - modernising and accelerating infrastructure performance in line with TIP principles. "
        },
        {
            "text": "Specifically, digital twin technology has provided improved tracking of building components, allowing closer monitoring of milestones while costing only one-third of the traditional alternative method. We are now delivering prisons fit for the 21st century - faster, cheaper and more efficient, with a focus on rehabilitating offenders to cut reoffending. "
        },
        {
            "text": "Looking to the future"
        },
        {
            "heading": 5,
            "text": "Source: Shutterstock"
        },
        {
            "text": "IPA is proud of our work to equip projects with the tools to digitalise for the benefit of the economy, the environment and the citizens of the UK. However, there is still work to be done. "
        },
        {
            "text": "We now recommend all projects and programmes in the built environment adopt digital tools such as 4D CAD and Advanced Work Packaging and modular building (where practicable) to achieve predicted efficiency savings of 40%. "
        },
        {
            "text": "We are also working on ensuring that the application of BIM across departments is consistent and remains in line with current guidance."
        },
        {
            "text": "In future, we expect to see these digital requirements embedded in contracts, helping us to achieve our goal of digital-by-default delivery. "
        },
        {
            "text": "Our Benchmarking Data Service is set to be launched across the government soon, ensuring that public sector projects have access to high-quality data crucial to successful decision-making and delivery. This exciting new development will mean that project teams will have quick, intuitive and secure access to data collected from previous similar projects on crucial points of interest, like carbon emissions, cost and performance. This data sharing will ensure that public services delivered in the future benefit from previous best practices and drive productivity. "
        },
        {
            "text": "The effective use of information management and embedding the use of AI in how we oversee project performance is a key enabler to unlocking taxpayer value. This principle underpins our thinking in our forthcoming paper on Project Data Analytics and AI in Projects, due out in early 2024. This paper will propose a direction of travel and the immediate steps we will take in embedding the use of AI across government project delivery."
        }
    ]
}