{
    "url": "https://mattersoftesting.blog.gov.uk/encouraging-motorists-to-view-their-mot-certificate-online/",
    "title": "Encouraging motorists to view their MOT certificate online",
    "authors": [
        "Chris Price"
    ],
    "categories": [
        "MOT testing service",
        "News and updates"
    ],
    "pub_date": "2023-12-06T12:30:57+00:00",
    "content": [
        {
            "text": "Between April 2022 and March 2023, you collectively carried out about 34.5 million light MOTs. And that uses up a lot of paper.    "
        },
        {
            "text": "If every test had an A4 certificate printed out, those pieces of paper would:  "
        },
        {
            "text": " In fact, it would take 13,800 boxes of A4 paper to print that many certificates. And it  takes more than 4,000 trees to create that much new paper.   "
        },
        {
            "text": "In this blog post I want to explain what we’re doing to reduce this amount of paper and how you can help us achieve this.  "
        },
        {
            "heading": 2,
            "text": "Setting our vision for 2025"
        },
        {
            "text": "Our strategic plan to 2025 sets out our ambition within the MOT to:"
        },
        {
            "text": "I blogged about our proposed move to paperless certificates in August, sharing the work we’d been doing with our user research team, alongside our review of the paper we ask you to store and print within the MOT."
        },
        {
            "heading": 3,
            "text": "The benefits of reducing printing"
        },
        {
            "text": "We’re still reviewing the findings of this paper review and considering where we can best make use of our current digital services. But we want to start to move forwards with our plans to reduce the amount of MOT certificates being printed."
        },
        {
            "text": "It will:"
        },
        {
            "heading": 2,
            "text": "Reducing the use of paper over the last few years"
        },
        {
            "text": "Back in January 2021 we made it optional for you to issue a paper record of the emissions test to the customer if the vehicle passes the emissions test."
        },
        {
            "text": "Then in September 2021 we made it optional for you issue a paper MOT pass certificate - but we asked you to continue issuing paper fail certificates."
        },
        {
            "heading": 3,
            "text": "Reviewing our policy on printing"
        },
        {
            "text": "Since then we’ve reviewed our policy, and we think it’s now the time to start going further.  So we’re now giving you the flexibility to not issue a paper fail certificate if the customer is able and willing to view the vehicle’s MOT record and history online."
        },
        {
            "text": "You can still offer a paper fail certificate to your customers for complex or multiple failures so that it’s clear exactly what they need to do to fix the vehicle."
        },
        {
            "text": "However, if the customer would prefer to look at this information online using the MOT history service, that’s fine. We want them to be able to choose what works best for them."
        },
        {
            "text": "Also consider if issuing a PRS pass then no need to print the fail at all.  It’s the next step in moving to a paperless MOT system."
        },
        {
            "heading": 3,
            "text": "Emissions test record"
        },
        {
            "text": "For now, you’ll still need to issue a printed emissions test record if the vehicle fails the emissions test."
        },
        {
            "heading": 2,
            "text": "Ask, encourage and explain"
        },
        {
            "text": "The easiest thing to do is to ask your customers whether they want a paper copy of their MOT certificate or if they’re happy viewing it online when they drop their vehicle off. They’ll then know what to expect when they collect it."
        },
        {
            "text": "In some cases, if the vehicle does not have any advisories or if there are minor advisories, it makes more sense to suggest the customer views this information online."
        },
        {
            "text": "We know many MOT centres are sending more and more paperwork to customers by email to help lower printing costs, so this could be something you’d like to consider if customers want a copy of their certificate."
        },
        {
            "text": "We understand that there will always be customers who want a paper copy of their certificate to drive away with, so we’re not going to stop you from being able to print certificates. But it’s important we make small changes where we can."
        },
        {
            "heading": 2,
            "text": "What to consider before printing"
        },
        {
            "heading": 2,
            "text": "The best place to check MOT test results and history is GOV.UK"
        },
        {
            "text": "We’ve been promoting our MOT history service since it launched back in 2015. We’re really pleased that it is the third most used online government service this year."
        },
        {
            "text": "As we move towards a paperless system, we’re going to promote the service more and more on our social media channels."
        },
        {
            "text": "We’ll be spreading the word that the best place to check a vehicle’s MOT test result and history is on GOV.UK – not  a paper certificate. It’s more secure, always up to date and available 24 hours a day, 7 days a week."
        },
        {
            "heading": 2,
            "text": "Updating our content"
        },
        {
            "text": "We’ve also reviewed the language we use across our web pages. We’ll be removing references to ‘printing’ and “storing paper copies of certificates” and signposting people to our MOT history service where they can view a copy of their vehicle’s record instead."
        },
        {
            "heading": 2,
            "text": "Making sure you’re equipped"
        },
        {
            "text": "To help you have these conversations with customers and explain to them why they might not receive a paper copy of their MOT result we’ve created a toolkit for you. It’s got our key messages in, suggested social media and website content and some graphic images. It also includes some printable posters that you can pin to your notice boards."
        },
        {
            "heading": 2,
            "text": "Promoting paperless certificates"
        },
        {
            "text": "Over the next few months, we’ll be sharing the message across our social media channels and through the media so that as many people as possible will know about the changes before they book their MOT."
        },
        {
            "text": "Ultimately, we know how important it is to do our bit for the environment and this will help bring the service in line with other services across the world. It’s getting rarer to find a business these days that will automatically print out and hand you a receipt without asking first, and in the grand scheme of things, an MOT certificate is a type of receipt."
        },
        {
            "text": "We’re confident that this change will cause little to no disruption to you and your business, and in the long run, save you money and time."
        },
        {
            "heading": 2,
            "text": "Let us know what you think"
        },
        {
            "text": "As ever, we want to hear your thoughts and ideas on how we can continue to support you in your role, so please do leave us a comment below."
        }
    ]
}