{
    "url": "https://traderemedies.blog.gov.uk/2023/12/06/explainer-what-are-tariff-rate-quotas-and-how-do-we-review-them/",
    "title": "Explainer: What are tariff rate quotas and how do we review them?",
    "authors": [
        "Amber Newman, Investigations Lead"
    ],
    "categories": [
        "Investigations"
    ],
    "pub_date": "2023-12-06T08:34:24+00:00",
    "content": [
        {
            "text": "The TRA announced the initiation of the steel safeguard extension review, SE0041, earlier this year.  The purpose of this review is to make a recommendation to the UK government on whether the current steel safeguard measure, which is set to expire on 30 June 2024, should be extended. In parallel to this extension review, we will soon be reviewing Tariff Rate Quotas (TRQ), an important part of the steel safeguard measure."
        },
        {
            "text": "The TRQs in place allow for a certain volume of imports for each category of steel subject to the safeguard measure to be imported into the UK tariff-free, with a 25% tariff applied after this limit is reached. A simple way of thinking of these quotas is as a ‘pot’ from which steel can be imported without incurring the safeguard tariff. The quota covers a three-month period, so once the ‘pot’ has been used up, all future imports for that quarter will have a tariff of 25%."
        },
        {
            "text": "There are two types of quotas: country specific and residual."
        },
        {
            "text": "A country specific quota allocates a specific amount of the total quota for each steel category based on the proportion of their imports, with all the remaining countries (with some exceptions) having access to the residual quota. The total quotas for each category of steel were calculated based on the average imports from a previous three-year representative period. Countries who had imported more than 5% of the total amount of imports into the UK for a particular category of steel received their own quota."
        },
        {
            "text": "The residual quota is what remains of the total quota for that category after the country quota has been calculated."
        },
        {
            "text": "The quotas are liberalised, or increased, by a certain percentage each year."
        },
        {
            "heading": 2,
            "text": "When do we review TRQs?"
        },
        {
            "text": "Under regulation 35B of the Safeguard Regulations, the TRA can undertake a review of the TRQs where there is information to show there has been a change in circumstance since the application of the TRQ, in practice, since the quotas were last adjusted."
        },
        {
            "text": "Some reasons for a change in circumstances (although not an exhaustive list) could be:"
        },
        {
            "heading": 2,
            "text": "Developing Country Exceptions"
        },
        {
            "text": "Regulation 43 of the Safeguard Regulations provides an exception from a safeguard measure for a developing country member of the WTO whose individual share of total imports of the goods concerned into the UK does not exceed 3%."
        },
        {
            "text": "If the share of imports from a developing country is 3% or under, they are considered ‘low volume exporters’.  These ‘low volume exporters’ are excepted from the safeguard measure provided their collective share of total imports into the UK of the goods concerned does not exceed 9% of the total imports. Any imports from a developing country will not come out of the quota ‘pot’ for that steel category, as long as imports stay at 3% or under of total imports from that country."
        },
        {
            "text": "If a developing country’s imports exceed 3% but are still under 5%, they have access to the residual quota.  If a developing country exceeds 3% and, upon looking back to the original safeguard transition review, was found to have exceeded 5% of total imports for a specific category of steel during the original representative period, then that country will be given a country specific quota."
        },
        {
            "text": "All other countries not eligible for the DCE will have access to the residual quota."
        },
        {
            "heading": 2,
            "text": "What does a TRQ DCE review look like?"
        },
        {
            "text": "In the first half of 2023, the TRA undertook a review of the DCE in the steel safeguard measure. Following this review, due to fluctuations in import levels, changes were made to the TRQs after some developing countries were found to be no longer eligible for the DCE, and others previously excluded were given access to it.  The recommendations in this review were made by analysing data from HMRC on imports that were coming into the UK across all categories of steel subject to the safeguard measure.  In this type of review, this is the only evidence that is taken into consideration."
        },
        {
            "text": "As import levels regularly change, in order to ensure that the DCE list is kept up to date, the TRA has committed to reviewing the DCE annually.  A 12-month period of analysis is important to accurately assess trading patterns taking into consideration trading habits throughout a year.  HMRC publish import data approximately 2 months in arrears, and changes made to the TRQs are only implemented by HMRC at each quarter (January 1, April 1, July 1, October 1).  In addition to these factors, any changes to the status of developing countries must allow time for WTO consultation. The changes are not quickly or easily implemented, therefore the timeframe to conduct a DCE TRQ review is very narrow."
        },
        {
            "text": "By communicating our intention to conduct TRQ DCE reviews annually, the TRA is hoping to assure stakeholders that if they are concerned about developing country imports, reviews will be conducted regularly and consistently. When the next review is initiated, this will be published and interested parties will be invited to register onto the case."
        },
        {
            "text": "If you would like more information on TRQ DCE reviews, please get in touch."
        }
    ]
}