{
    "url": "https://environmentagency.blog.gov.uk/2023/12/06/internships-with-the-regulated-industry-team-dharanijas-story/",
    "title": "Internships with the Regulated Industry team – Dharanija’s story.",
    "authors": [
        "Environment Agency"
    ],
    "categories": [
        "Environment Agency"
    ],
    "pub_date": "2023-12-06T13:45:04+00:00",
    "content": [
        {
            "text": "I am Dharanija Bantu, studying MSc Computer Science at the University of Nottingham, specialising in Artificial Intelligence. I am an international student from India who moved to the UK in September 2022. I completed my bachelor's degree in Electronics and Communications Engineering, specializing in computer communications."
        },
        {
            "text": "Whilst working as a Programmer Analyst for 18 months I found the complexity involved in data is fascinating and I’m passionate about leveraging data to uncover insights and support informed decision-making."
        },
        {
            "text": "Why the EA? "
        },
        {
            "text": "Our environment holds remarkable sway over our well-being. The sight of a beautiful environment can infuse us with positivity and vibrancy. Throughout my life, I've deeply cherished nature and my affinity for the environment has driven me to take actions to preserve it, including reducing plastic consumption, tree planting, adopting reusable items, and energy conservation."
        },
        {
            "text": "Joining an organization that creates a positive impact felt like a natural progression. I was drawn to the Environment Agency by a desire to delve into a fresh field, broadening my knowledge and skill set. I was also particularly intrigued by the chance to contribute to flood modelling and analysis as a chance to bring together my interests and meaningful work that improves people's lives."
        },
        {
            "text": "I also wanted to get a better understanding of the work culture in the UK and gain valuable work experience, build some professional relationships and extend my network. At the same time as understand the different teams and career paths in the EA and get practical experience of working on real-world projects."
        },
        {
            "text": "What have you been up to?  "
        },
        {
            "text": "During my summer internship with the Regulated Industry team based in Nottingham I visited multiple sites. From motorcycle breakers to household waste recycling centres, I gained a comprehensive understanding of permits, standard regulations, inspections, audit reports, and effective communication with diverse individuals."
        },
        {
            "text": "My very first site visit was to a waste transfer station for an odour complaint investigation. Witnessing the sheer magnitude of human-generated waste was truly eye-opening and underscored the necessity of robust regulations for environmental protection."
        },
        {
            "text": "This was a completely new experience for me, and it provided a first-hand glimpse of a typical inspection process. What really struck me was the tangible impact of the team's work. I also had the chance to join in fascinating training sessions focused on carbon literacy, environment and waste management, as well as Power Apps."
        },
        {
            "text": "How was your experience?"
        },
        {
            "text": "The level of support I've received from my line manager, mentor, well-being buddy, and fellow office colleagues has been nothing short of incredible. The friendly and approachable nature of my teammates greatly contributed to a positive work environment, and I experienced a healthy work life balance in the organization."
        },
        {
            "text": "The learning sessions organized by the internship program team were extremely helpful in understanding the different teams within the EA. I also made some valuable connections, heard inspiring career stories and got some tips about how to create successful applications for full-time positions. The work culture, site visits for inspections, and inspiring stories shared during the learning sessions, and the flexibility to explore various teams within the organization are the aspects I enjoyed the most during my internship experience."
        },
        {
            "text": "What’s next? "
        },
        {
            "text": "One of the best things I liked in the UK is its environment, and the opportunity to contribute to Environment Agency is truly priceless. I'm currently on a journey to discover innovative approaches through which a computer science graduate can contribute to the betterment of habitats for both humans and wildlife while fostering sustainable progress and I’m looking forward to making a difference in my own way as a data analyst."
        },
        {
            "text": "What advice would you give to anyone considering an internship with the EA?"
        },
        {
            "text": "Try and explore as many new things as possible to discover what truly interests you."
        },
        {
            "text": "Are you interested on an internship at the EA? "
        },
        {
            "text": "Find out more information about the early career opportunities, including internships, industry placements and apprenticeship opportunities at the Environment Agency by visiting Early careers - Environment Agency (environmentagencycareers.co.uk)"
        },
        {
            "text": " "
        }
    ]
}