{
    "url": "https://defradigital.blog.gov.uk/2023/12/06/international-volunteer-day-why-im-supporting-the-homeless/",
    "title": "International Volunteer Day: Why I’m supporting the homeless",
    "authors": [
        "Khadijr Rahman"
    ],
    "categories": [
        "Defra digital"
    ],
    "pub_date": "2023-12-06T08:16:34+00:00",
    "content": [
        {
            "text": "To celebrate the United Nations International Volunteer Day, Khadijr Rahman shares her experiences of regularly helping homeless people in Birmingham."
        },
        {
            "text": "It’s so easy to become absorbed in our own routines and responsibilities, that we sometimes forget what we have and what others may not. There’s such a warm feeling of happiness that comes from extending a helping hand to those less fortunate."
        },
        {
            "text": "I volunteer by giving out food to the homeless on the first Monday of every month in Birmingham City Centre. It gives me an incredible sense of connection and community."
        },
        {
            "heading": 2,
            "text": "The call to action"
        },
        {
            "text": "The decision to start a monthly routine of giving food to the homeless came from my church group, where there was a strong want to make a positive impact in the community."
        },
        {
            "text": "Perhaps it's a response to seeing the growing numbers of people experiencing homelessness or a personal realisation of the privilege of having enough to eat each day. Whatever the motivation, this act of giving has become a beacon of hope in the lives of those who receive it."
        },
        {
            "text": "Embarking on this journey required thoughtful planning and organisation. We came together as a group of four to find public spaces where homeless individuals congregate and identified these as distribution points. Volunteers, ranging from friends and family to church and community members, come together to prepare nutritious meals or gather food donations for us to give out."
        },
        {
            "heading": 2,
            "text": "The power of connection"
        },
        {
            "text": "The act of giving food has become more than just a charitable gesture; it’s an opportunity for human connection. Engaging in conversations, sharing smiles, and offering a kind word can be as nourishing to the soul as the food is to the body."
        },
        {
            "text": "This simple act of compassion breaks down barriers and helps us to get rid of some of the stigmas that often surround homelessness. It encourages a sense of dignity and worth in those receiving the assistance, reminding them that they are seen and valued."
        },
        {
            "text": "After doing this for a year already, I have met some of the most amazing people who have been vulnerable enough to share their stories with me and inspire me in ways I could have never imagined."
        },
        {
            "heading": 2,
            "text": "Challenges and rewards"
        },
        {
            "text": "Undoubtedly, there are challenges in maintaining a consistent monthly effort. Factors such as weather, logistics, and the availability of volunteers can pose obstacles. But the rewards far outweigh the challenges."
        },
        {
            "text": "Witnessing the gratitude in the eyes of those served, observing positive changes within the community, and knowing that we are contributing to a more compassionate society all serve as powerful motivators."
        },
        {
            "heading": 2,
            "text": "A little can go a long way"
        },
        {
            "text": "What we do not only transforms the lives of those who receive the food but also the hearts of those who give; it is always the day I look forward to the most every month. It’s a testament to the incredible power of compassion, and a reminder that, by coming together, we can create positive change and build a more compassionate and inclusive world."
        },
        {
            "text": "I never knew how much something as simple as a chocolate bar could really change someone’s day! My message is to always share kindness where you can, be forever appreciative of the things you DO have (even when days aren’t feeling so great) and look past what you see at face value."
        }
    ]
}