{
    "url": "https://socialcare.blog.gov.uk/2023/12/06/winter-covid-19-and-flu-vaccinations-still-time-to-book-online/",
    "title": "Winter COVID-19 and flu vaccinations - still time to book online",
    "authors": [
        "Dr Adrian Hayter"
    ],
    "categories": [
        "Care and support",
        "Communities",
        "coronavirus",
        "Workforce"
    ],
    "pub_date": "2023-12-06T15:19:52+00:00",
    "content": [
        {
            "heading": 2,
            "text": "Protection perpetuated"
        },
        {
            "text": "As we prepare for the winter festive season, as well as stocking up the medicine cabinet, it’s time to make sure you and your care and health colleagues – and by extension, the people you care for - are protected against flu and COVID-19 through vaccination."
        },
        {
            "text": "It’s important to realise your immunity to COVID-19 fades over time. So, even if you have been vaccinated through previous campaigns or already been infected with coronavirus, it’s now time to get vaccinated again."
        },
        {
            "text": "Why? Viruses change over time. That’s why, for vaccines to remain effective, they need to keep up with these changes if they are to continue to offer full protection for you."
        },
        {
            "text": "This reminder is coming now because you have until 14 December to use the national booking system via the NHS App, 119 phone service or online."
        },
        {
            "heading": 2,
            "text": "Don’t worry if you miss the deadline!"
        },
        {
            "text": "If you miss the 14 December deadline, please don’t give up trying to get vaccinated in good time. You can still attend local NHS vaccination centres, including local pharmacies and walk in sites until 31 January 2024."
        },
        {
            "text": "We know our care home and domiciliary residents deserve to be protected from winter viral infections and vaccination helps prevent flu and covid outbreaks this winter."
        },
        {
            "text": "The recently updated Enhanced Health in Care Homes service framework from NHS England, has brought in more support for residents since 2020."
        },
        {
            "text": "So, let's work together this winter to protect ourselves and those we care for, at home and at work and deliver better outcomes for everyone."
        }
    ]
}