{
    "url": "https://ukhsa.blog.gov.uk/2023/11/08/achieving-more-equitable-outcomes-ukhsa-health-equity-for-health-security-strategy/",
    "title": "Achieving more equitable outcomes: UKHSA Health Equity for Health Security Strategy",
    "authors": [
        "Blog Editor"
    ],
    "categories": [
        "Health Equity"
    ],
    "pub_date": "2023-11-08T17:26:04+01:00",
    "content": [
        {
            "text": "\nWe know that health threats can have a disproportionate impact on different groups."
        },
        {
            "text": "This inequality can be due to differences in living and working conditions, access to and uptake of vaccination, testing and treatment, and underlying illnesses. Each of these risk factors can increase the chance of contracting an infection or being impacted by an environmental hazard and becoming unwell once exposed. For example:"
        },
        {
            "text": "Health equity is defined as “the absence of unfair and avoidable or remediable differences in health among population groups defined socially, economically, demographically or geographically”, and to keep all our communities safe, we need everyone to recognise the role they can play."
        },
        {
            "text": "The UKHSA 2023-2026 strategic plan sets out how the agency will prepare for, prevent, and respond to infectious diseases and environmental hazards to keep all our communities safe.  Recognising the importance of health equity, it includes a cross-cutting goal."
        },
        {
            "text": "One year on from setting out our initial approach to achieving this priority in Health equity and the UK Health Security Agency, we reflect on progress made to deliver more equitable outcomes and outline next steps to ensure we keep all our communities safe from hazards to their health."
        },
        {
            "text": "This includes the development of a 3-year roadmap in collaboration with national and local government partners across the health system, as well as with the voluntary and community sector."
        },
        {
            "text": "UKHSA has identified four areas of focus that we need to strengthen in order to deliver on our ambitions:"
        },
        {
            "text": "UKHSA is a data-driven organisation, but we know that not all people and places are routinely represented in data and surveillance. We have a critical role across the health system to make the invisible visible in our data, to identify how diseases are impacting different groups, and to understand what interventions work."
        },
        {
            "text": "This year, through publications such as the 2023 Official Statistics HIV report and the Seasonal influenza vaccine uptake 2022-2023 report we have shown the importance of disaggregating data by ethnicity and deprivation, evidencing the disproportionate impact to catalyse targeted action across the system. In other outputs, we have highlighted the burden on inclusion health groups - including those with social risk factors in the Tuberculosis in England report, and the Shooting up report which summarises infections and other injecting-related harms among people who inject drugs in the UK."
        },
        {
            "text": "Next year, we will publish our first health equity technical report, drawing together what we know about the burden of infectious disease on the people and places at highest risk and identifying where we have gaps. This will inform the work set out in the UKHSA data strategy to improve the visibility of populations in our data."
        },
        {
            "text": "Communities who experience health inequalities often face a disproportionate impact across multiple health threats. By considering the people or place first, we can identify interventions that can effectively target and address concurrent risks in the same group."
        },
        {
            "text": "This year, UKHSA has identified several priority populations to focus our efforts. These are: people in contact with the criminal justice system, vulnerable migrants, people experiencing homelessness, place-based inequality and a continued focus on ethnicity and deprivation. With this focus, we have increasingly adopted a people and place approach; considering and addressing the context in which we provide health protection. This has included addressing the specific needs of these populations during adverse weather; working with colleagues across the health system to update guidance to support health outcomes of migrants; and exploring how we take this people and place approach further through our regional health protection services."
        },
        {
            "text": "Over the next year, we will build our understanding of people and places so that our health protection services can become more efficient and effective. Learning and best practice will be shared through an evidence repository – one of the key milestones outlined in the UKHSA science strategy –  and continued collaboration with partners."
        },
        {
            "text": "To deliver better health outcomes, we work in close partnership with health agencies, other government departments, industry, academia, and community groups across a regional, national, and global level."
        },
        {
            "text": "The agency has adopted the NHS England (NHSE) CORE20PLUS framework to identify the populations we will routinely consider in our work, ensuring our national and regional teams are aligned in our focus on people and places at most risk across NHSE, Integrated Care Systems and UKHSA. UKHSA has also joined with Department of Health and Social Care (DHSC) and NHSE to become a partner of the Voluntary Community and Social Enterprise (VCSE) Health and Wellbeing Alliance, providing UKHSA with a co-ordinated way to reach VCSE organisations and hear the voice of communities."
        },
        {
            "text": "At a global level, UKHSA continues to provide system leadership on health equity for health security and recently co-chaired a conference with the World Health Organisation (WHO) on infectious diseases in prisons. A key learning from this conference was the importance of lived experience throughout the work that we do. Over the next year, we will build our approaches to partner with people with lived experience in the design, delivery and evaluation of our work, and continue to encourage this in our partnerships with industry and academia. Additionally, the 2023 UKHSA Conference will have a health equity ‘track’ of sessions."
        },
        {
            "text": "At UKHSA, health equity is everyone’s business."
        },
        {
            "text": "Last year, UKHSA committed to improving our understanding of diversity across our staff and use this to drive action towards a workforce reflective of our communities. Our workforce profile was published in the Equality in UKHSA 2023 report, and is used to identify ways to build a more diverse and inclusive culture. This has included establishing UKHSA’s values of ‘impactful, insightful, and inclusive’; maintaining 12 staff networks; and piloting a new development programme for staff from ethnic minority communities or with a disability. We are also improving understanding of health equity across our staff; we have delivered training to raise awareness around Health Equity, CORE20PLUS and the Public Sector Equality Duty (PSED) to nearly 400 colleagues, and created a Health Equity hub to support colleagues with information, tools and resources."
        },
        {
            "text": "The UKHSA leadership and Advisory Board are strong advocates for health equity, receiving regular updates on progress, including how equity is embedded in UKHSA strategic priority programmes and the progress we have made to achieve more equitable outcomes. The UKHSA Equalities Ethics and Communities Committee of the Advisory Board, provides us with challenge and advice on UKHSA’s ambition to reduce health inequalities and engage with communities."
        },
        {
            "heading": 2,
            "text": "How you can support us in realising our ambitions."
        },
        {
            "text": "Over the next year, we will continue to share what we are doing and the learning and progress we are making through a series of blogs focusing on each of the UKHSA strategic priorities."
        },
        {
            "text": "To be really successful and have a demonstrable impact on health inequalities, we are calling for system partners to recognise the important role they can play and commit to working with us and with our communities to achieve improvements in health security outcomes for the people and places at highest risk."
        }
    ]
}