{
    "url": "https://dataingovernment.blog.gov.uk/2023/11/08/celebrating-the-power-of-community/",
    "title": "Celebrating the power of community",
    "authors": [
        "miahatton"
    ],
    "categories": [
        "Data science",
        "People and Skills"
    ],
    "pub_date": "2023-11-08T14:47:38+00:00",
    "content": [
        {
            "text": "The Cross-Government and Public Sector Data Science Community provides regular opportunities for people in the public sector, with an interest in data science, to connect with their peers, learn new skills and collaborate. This autumn, we are hosting the first Data Science Community Showcase to celebrate the successes of our community, as well as those of other networks and communities supporting government analysts. The event will take place online over three days and you can book your place on individual sessions on Eventbrite. It’s an excellent opportunity to expand your network, showcase your work and hear from colleagues in government who use data science for the public good."
        },
        {
            "text": "The Showcase will feature curated content coordinated by the Data Science Community, with support from our partners, focused on three content strands: your career in data science, the Data Science Toolshed and making an impact with data science."
        },
        {
            "text": "Civil servants can count attendance of any Showcase sessions towards their One Big Thing data training."
        },
        {
            "heading": 2,
            "text": "Day one: your career in data science"
        },
        {
            "text": "We will explore skills-building and career progression in the data science space. This follows the success of our career panel events throughout 2023 and requests from our members to access career content."
        },
        {
            "text": "On day one you can expect:"
        },
        {
            "text": " "
        },
        {
            "heading": 2,
            "text": "Day two: the data science toolshed"
        },
        {
            "text": "At our June meetup we invited our members to enter the Data Science Toolshed, where developers code in the open, follow best Reproducible Analytical Pipelines (RAP) practice, and build tools to share. We had great feedback from the event and not enough time to explore the tools available to government data scientists, so we have decided to dedicate a whole day to the toolshed as part of the Showcase."
        },
        {
            "text": "On day two you can expect:"
        },
        {
            "text": " "
        },
        {
            "heading": 2,
            "text": "Day three: making an impact with data science"
        },
        {
            "text": "We will shift our focus to looking at the context in which we do data science. The questions we address on this day are important not only for data scientists, data engineers and data analysts, but also for policymakers, scientists and anyone in government whose work is impacted by data. Some of the questions cover how policymakers and data scientists can support each other and how data science improves the lives of the public."
        },
        {
            "text": "On day three you can expect:"
        },
        {
            "text": " "
        },
        {
            "heading": 2,
            "text": "Our community is for everyone"
        },
        {
            "text": "This year, we have focused on broadening the reach of our Community activities and making it more inclusive. Engaging with a wider range of sectors and organisations in our programme, means more opportunities to grow your network, understand the data science landscape, and collaborate rather than duplicate."
        },
        {
            "text": "The Data Science Community is managed by the Data Science Campus, part of the Office for National Statistics. By teaming up with partner networks and communities with shared goals, we aim to deliver a Showcase that highlights the many areas of the public sector that are underpinned by data science. We are delighted to be working with the RAP Network, the NHS-R Community, the  EmTech Community, and our own subcommunities."
        },
        {
            "text": "We would like to extend a special thanks to Data Cymru, who have helped us to curate the content and engage speakers, ensuring that the voices of colleagues in local and devolved governments across the UK are incorporated into the Showcase."
        },
        {
            "heading": 2,
            "text": "Get involved"
        },
        {
            "text": "Sessions are now live for booking on Eventbrite. Join our mailing list to be the first to know when more sessions become available. You can contact the Data Science Community team using government.data.science.community@ons.gov.uk."
        },
        {
            "text": " "
        }
    ]
}