{
    "url": "https://governmentscienceandengineering.blog.gov.uk/2023/11/08/chemistry-week-2023-chemistry-making-the-world-a-better-place/",
    "title": "Chemistry Week 2023: Chemistry making the world a better place",
    "authors": [
        "gseprofession"
    ],
    "categories": [
        "Blog Series",
        "Learning & Development",
        "Reward & Recognition",
        "Specialism Deep Dives"
    ],
    "pub_date": "2023-11-08T13:34:50+00:00",
    "content": [
        {
            "heading": 3,
            "text": "What do the Scientific Adviser, Private Secretary and Regulatory Scientist we spoke to all have in common? They all studied chemistry, and work across government."
        },
        {
            "text": "Taking place from 5 - 11 November, Chemistry Week is a celebration of the chemical sciences. To show the impact of chemistry, we caught up with three chemists who now work across government. Let's meet, Ruth, a Scientific Adviser in MOD; Sam, Assistant Private Secretary to the Chief Scientific Adviser in DfT; and Amy, Regulatory Scientist in HSE."
        },
        {
            "heading": 4,
            "text": "First question, why did you choose to study Chemistry?"
        },
        {
            "text": "Ruth, Scientific Adviser\nI remember playing with my cousin’s chemistry set when I was about 10 years old. We mixed a load of the chemicals together and made orange goo which came out of the test tube and made a stain on the carpet - that got me interested. When I was choosing what to study at university, I was undecided between food science and chemistry. However, on a trip to Leeds University (where I ended up studying) the chemistry department told me I should choose chemistry as it would give me more options. That turned out to be the best piece of advice as after leaving university, I have spent my whole career in defence."
        },
        {
            "text": "Sam, Private Secretary\nI always loved science growing up, so choosing to study a science subject at university was a natural choice. Choosing which science to study was much more difficult! I was really torn between chemistry and physics, and in the end, I think it was chemistry’s centrality that swayed me. Through studying chemistry, I could still study the elements of biology and physics that I found interesting, like biochemistry and quantum mechanics. It also meant I got to avoid some of the bits I was less keen on."
        },
        {
            "heading": 4,
            "text": "You all have very different roles in government, what’s your favourite part of your current role?"
        },
        {
            "text": "Sam, Private Secretary\nThe role sits in the Science, Innovation and Technology (ScITech) directorate at the Department for Transport. This means I get exposed to all the interesting and exciting ways that science can influence the transport sector, both today and in the future. I’ve only been in the role for a few weeks, but the team have been incredibly welcoming, and are all super enthusiastic about the areas they cover."
        },
        {
            "text": "Amy, Regulatory Scientist\nMy role includes evaluating a range of data relating to the chemistry, methods of analysis and residues of pesticides in food and feed."
        },
        {
            "text": "Considering the residues of pesticides is my favourite part of my role. This is because I perform consumer exposure assessments which ensures safe consumption of food that has previously been treated by pesticides in the field. I find it extremely rewarding because my role is protecting the health of people. It’s also really interesting seeing the pesticide products that are authorised on the market and seeing all the food on the shelves makes me feel that what I do is relevant and helps so many people."
        },
        {
            "heading": 4,
            "text": "What advice would you give to a scientist who wishes to pursue a career in government? "
        },
        {
            "text": "Ruth, Scientific Adviser\nGovernment is a fantastic place to be a scientist. I would recommend spending time as both a lab scientist and then in disciplines such as policy. If you can, get experience in industry too. Like any discipline, it is really important to build a wide network."
        },
        {
            "text": "Amy, Regulatory Scientist\nIt’s not all about having previous experience when applying to work for the civil service. If you have the key skills and can demonstrate the desirable behaviours outlined in the success profiles then you have an equal opportunity to work for the civil service."
        },
        {
            "text": "Thank you Ruth, Sam and Amy. For more information on Chemistry Week, please visit the Royal Society for Chemistry."
        }
    ]
}