{
    "url": "https://kingsawards.blog.gov.uk/2023/11/08/coolicon-lighting-celebrates-their-export-success-with-kings-award-for-enterprise/",
    "title": "Coolicon Lighting celebrates their export success with King's Award for Enterprise",
    "authors": [
        "The Queen's Awards for Enterprise"
    ],
    "categories": [
        "Advice",
        "Enterprise promotion",
        "International trade"
    ],
    "pub_date": "2023-11-08T11:17:07+00:00",
    "content": [
        {
            "text": "Coolicon Lighting is a British craft-based, heritage lighting brand. Leading the market in Vitreous Enamel lampshades we supply wholesale lighting solutions to retailers and commercial projects worldwide. With 90 years of craft history, all products are handmade to exacting standards in England using traditional skills and techniques passed on by generations of craftspeople. Adding to the excitement of the brands anniversary year, Coolicon Lighting are honoured to have been awarded the King’s Award for Enterprise 2023. This highly-coveted commercial award highlights the skills and expertise of traditional craftspeople, without whom, years of knowledge may be lost."
        },
        {
            "text": "Which international markets do you already export to?  "
        },
        {
            "text": "Coolicon Lighting offers an authentic, specialised collection of products and as such targets high-end lighting, furniture, and lifestyle showrooms in the EU and further afield. This market is not dominated by large corporations per se, but rather populated with numerous premium retailers, interior design practices and architects specialising in commercial projects. This market allows us to compete on added value, originality, and heritage through a knowledgeable dealer network."
        },
        {
            "text": "Coolicon Lighting have now expanded their distributor reach to nine geographical territories, with stock holdings that conform to local legislation in Europe, Asia and the USA."
        },
        {
            "text": "Could you tell us about your export story? When did you begin to export?  "
        },
        {
            "text": "Europe was our first focus as an export market, and a big step for the small British brand. Now, we look to the future having gained buzz and traction within this territory, expanding sales by broadly splitting the global market into three segments; namely USA/North America, EU and Asia. This turns the page on an exciting new chapter for the brand as historically, Coolicon products were only seen throughout the UK."
        },
        {
            "text": "Europe has a well-established premium lighting industry, with many countries not only producing a significant number of premium historical brands but, in doing so, dominating their domestic retail and professional markets. Key European markets such as Scandinavia are dominated by a regional aesthetic which is designed specifically to pair seamlessly with local interior design styles. This acts as a further informal barrier to entry for imported products such as Coolicon lampshades. The same can be said of countries such as Italy, Germany and the Netherlands in particular."
        },
        {
            "text": "It is in this difficult environment that Coolicon Lighting, with a small portfolio and resources, has managed to carve out a niche with forward thinking distributors, retailers and professionals who see value in our ethics, quality and history. Building on our British heritage and skills, we lead the way by telling a new story in these saturated markets. 90 years of heritage is one thing that new brands simply cannot compete with, and we’re now thinking of the next 90 years!"
        },
        {
            "text": "What is the value of your exports and how has this grown your business?"
        },
        {
            "text": "Since re-establishing the brand in 2015, international sales were a primary focus. The Coolicon brand has been in the UK for 90 years and is synonymous with industrial pendant task lighting, with many of the original shades still in use today. This makes the UK stable market with a rich history but poses challenges for growth with the core product offering. We feel the key to sustainable growth is export. As turnover increases year on year it is clear to us that export sales are driving this. Export sales now account for around 75% of annual turnover."
        },
        {
            "text": "Is there a surprising fact about your exports? "
        },
        {
            "text": "Until this year, the Coolicon lamps had never been exported to North America. After several months working on establishing a new distributor network and overcoming completely new legislative bodies, redesigning products for US compliance, the Coolicon lampshades are now well established across the water, with more than 200 of them hanging proudly in US interiors. It took 90 years for Coolicon products to reach North America, but they are definitely here to stay!"
        },
        {
            "text": "What do exports mean for your business?"
        },
        {
            "text": "We are proactive with all channels and actively look for key distribution partners, retail brands or projects who are as enthusiastic about the brand as we are. We believe collaboration across the globe is hugely fruitful for brand growth and providing added value to our customers."
        },
        {
            "text": "These routes to market create a stable production volume for our UK supply chain. Despite our tiered sales, discounts on manufacturing costs based on sales tier are not offered. Instead, we work to stable pricing for both parties, focusing on high-skill and high-quality products. This secures associated skills within the UK, job satisfaction and pride in one’s work. We are true believers that pride should not be undervalued in the craft sector."
        },
        {
            "text": " What advice would you give to other businesses exporting?  "
        },
        {
            "text": "Just do it! International orders are now a major part of our business and is a decision we do not regret taking. But be prepared for A LOT of paperwork and customs declarations. Look for resources online and offline, it does get easier over time."
        },
        {
            "text": "Find out more about Colicon Lighting: https://www.cooliconlighting.com/"
        },
        {
            "text": "Find out more about The King's Awards for Enterprise: https://www.gov.uk/kings-awards-for-enterprise"
        }
    ]
}