{
    "url": "https://nationalscreening.blog.gov.uk/2023/11/08/first-uk-nsc-online-seminar-a-resounding-success/",
    "title": "First UK NSC online seminar a resounding success",
    "authors": [
        "Professor Anne Mackie"
    ],
    "categories": [
        "General"
    ],
    "pub_date": "2023-11-08T09:43:23+00:00",
    "content": [
        {
            "text": "More than 90 stakeholders from a broad range of backgrounds attended the first of a series of online seminars organised by the UK National Screening Committee (UK NSC)."
        },
        {
            "text": "This first seminar looked in detail at the evidence and the processes the UK NSC followed in developing a clinical pathway for the modelling of targeted lung cancer screening. This work paved the way for the UK NSC to make a positive recommendation for screening in 2022."
        },
        {
            "text": "We use the phrase ‘Ideas to action’ in the screening team. It neatly describes the process of taking a proposal for a screening programme, assessing the evidence, stakeholders’ views, its feasibility and other aspects and then, if it all adds up, working with policy people and the NHS to turn it into a live screening programme. This is major undertaking which involves economists, epidemiologists, evidence analysts, public health leads from local authorities, ministers’ private officers, policy and finance colleagues, commissioners, doctors, nurses, patients, industry and many many others."
        },
        {
            "text": "The lung seminar featured fascinating presentations from 8 of the UK’s leading experts who contributed to the lung screening pathway and modelling work."
        },
        {
            "text": "Many thanks to our excellent presenters, who fielded a variety of great questions from delegates who included screening policy makers, clinicians, NHS screening professionals, public health experts, academics, charity and industry."
        },
        {
            "heading": 2,
            "text": "Catch up on the presentations"
        },
        {
            "text": "You can view the slides from the presentations from the targeted lung screening pathway and modelling seminar by clicking on the links below."
        },
        {
            "text": "Lung cancer screening pathway development – Prof David Baldwin (Consultant Respiratory Physician and Honorary Professor of Medicine, Nottingham University Hospitals NHS Trust)"
        },
        {
            "text": "Initial approach and invitation – Dr Samantha Quaife (Reader in Behavioural Science, Queen Mary University of London)"
        },
        {
            "text": "Eligibility assessment – Dr Richard Lee (Consultant Respiratory Physician, The Royal Marsden NHS Foundation Trust)"
        },
        {
            "text": "Screening process and outcomes – Dr Emma O’Dowd (Consultant Respiratory Physician, Nottingham University Hospitals NHS Trust) and Dr Arjun A Nair (Consultant Radiologist, University College London Hospitals NHS Foundation Trust)"
        },
        {
            "text": "Task and finish group – Prof Mark Sculpher (Director, Centre for Health Economics, University of York)"
        },
        {
            "text": "Introduction to lung screening modelling – Prof Chris Hyde (Professor of Public Health and Clinical Epidemiology, University of Exeter)"
        },
        {
            "text": "Modelling methods and results – Dr Tristan Snowsill (Senior Lecturer in Health Economics, University of Exeter)"
        },
        {
            "heading": 2,
            "text": "Keep up to date"
        },
        {
            "text": "We’ll post details of new screening seminars on this blog. You can register to receive updates direct to your inbox, so there’s no need to keep checking for new articles."
        }
    ]
}