{
    "url": "https://forestrycommission.blog.gov.uk/2023/11/08/focusing-on-wild-venison-this-british-game-week/",
    "title": "Focusing on wild venison this British Game Week",
    "authors": [
        "David Hooton"
    ],
    "categories": [
        "Deer",
        "Woodland management"
    ],
    "pub_date": "2023-11-08T09:29:49+00:00",
    "content": [
        {
            "text": "The UK’s deer population is believed to be at its highest level for 1,000 years. It has risen from an estimated 450,000 in the mid-1970s to some two million deer in our countryside and semi-urban areas today. "
        },
        {
            "text": "There are six species of deer living wild in the UK, just two are native, the red deer and roe deer.  The introduced species (fallow, sika, Muntjac, and Chinese Water Deer) have found UK living very much to their liking, expanding rapidly across much of the UK during the last 100 years.  "
        },
        {
            "text": "It should be remembered that just 100 years ago there were very few wild deer in the UK, with scattered remanent populations, and that today’s populations stem from a wide variety of introductions.  "
        },
        {
            "text": "With rising deer populations there are increased risks to woodland creation, existing woodland, agricultural crops and wider biodiversity.  With no natural predators, there is more browsing pressure on woodland ground flora through deer consumption of tree shoots, shrubs and woody vegetation that sequester carbon. Increased wild deer management is therefore essential. "
        },
        {
            "text": "Venison is produced as a product of this management work.  Venison is a highly nutritious natural meat, high in essential amino acids and a rich source of thiamine, riboflavin, niacin, iron, and zinc. It is lower in cholesterol and saturated fats than other red meats and is a high-quality source of protein. "
        },
        {
            "text": "It is important that a large-scale, year-round demand for British Wild Venison is developed.  The British Wild Venison Working Group, a partnership of organisations and individuals developed from across the venison supply chain, including the Forestry Commission, aims to support this through the introduction of a robust set of requirements for both the producer and the processor of wild venison via The British Quality Wild Venison Standard. This aims to: "
        },
        {
            "text": "Historically venison markets have fluctuated in demand, and this has led to instability throughout the supply chain. Investment from Game Handling Establishments has occurred but is still very limited.  "
        },
        {
            "text": "The current network of processors have not yet developed a market for the volumes of venison that are predicted to be available during the next few years.  To ensure deer management continues at the levels that are required to reduce impacts, we need to increase demand and develop the venison market across the country. "
        },
        {
            "text": "Deer stalkers and processors are fundamental to delivering our aspirations of increasing woodland cover in the UK to 16.5% of area, supporting a wide range of biodiversity across our countryside, whilst also protecting arable crops.  "
        },
        {
            "text": "Supporting the British Quality Wild Venison standard, by joining as an Approved Game Handling Establishment (AGHE) or as producers, we can all help to increase the market demand for high quality wild venison.  "
        },
        {
            "text": "Some within the supply chain may question the value of having a standard, but we have standards across all areas of our lives, these are developed to support and protect us, providing reassurance that the products we are buying have been produced to the highest of standards.  "
        },
        {
            "text": "The development of British Quality Wild Venison Standard supports this.   "
        },
        {
            "text": "And we’re gaining momentum. In the first few months since launch in April 2023, we have received interest from both producers and processors. The first audit of a deer stalker producer occurred this week and the first audits of AGHE processors will take place in the New Year.  "
        },
        {
            "text": "We expect that by Spring 2024, British Wild venison displaying the British Quality Wild Venison logo will start to become available, and we will be making strides in developing a year-round market. "
        }
    ]
}