{
    "url": "https://educationhub.blog.gov.uk/2023/11/08/get-number-confident-and-unlock-your-potential/",
    "title": "How to boost your maths skills for free",
    "authors": [
        "Media Officer"
    ],
    "categories": [
        "Adult learning",
        "Further education",
        "Higher Education"
    ],
    "pub_date": "2023-11-08T16:25:22+00:00",
    "content": [
        {
            "text": "Maths skills are vital for everyday life and work. Adults with a good grasp of numbers have a greater chance of getting a job and having higher wages."
        },
        {
            "text": "If you want to improve your confidence with numbers, there is a range of help available, and much of it supported by the government and free of charge."
        },
        {
            "text": "Being number-confident can help you take control and be better prepared to deal with everyday tasks, such as managing personal or work finances, working out how to split a bill between friends or even baking."
        },
        {
            "text": "It can also prepare you for further study at college, university or work."
        },
        {
            "heading": 3,
            "text": "What help is available to gain a maths qualification?"
        },
        {
            "text": "Many adults across the country aren’t confident with numbers. If you have not already achieved a maths GCSE or equivalent qualification you can gain one for free."
        },
        {
            "text": "Our free maths courses allow people to gain either a GCSE or a Functional Skills Qualification. You can find a course near you on the National Careers Service website."
        },
        {
            "text": "Shaunna 31, completed a free maths course at her local college funded by the government and has never looked back."
        },
        {
            "text": "“I was bullied at school which led to me leaving at 15 with no formal qualification in maths,” she told the Education Hub."
        },
        {
            "text": "“After my daughter was born, I realised I wanted to get into teaching, but my maths skills were poor, and I had an irrational fear of doing maths."
        },
        {
            "text": "“The maths course I completed was a great stepping-stone as it gave me the skills and the confidence boost I needed to go on to further study. Also, I now enjoy maths which is something I never thought possible."
        },
        {
            "text": "“Following this course, I went on to achieve an English, Science and Maths GCSE, and have recently finished university this year receiving the Dean's Award for my contribution to primary science."
        },
        {
            "text": "“With the confidence I have gained from improving my numeracy skills as an adult, I can now continue my learning journey and I plan to complete a postgraduate certificate in education (PGCE) qualification soon.”"
        },
        {
            "heading": 3,
            "text": "How can I improve my numeracy skills? "
        },
        {
            "text": "Our Multiply programme also helps people improve their basic numeracy through free courses that fit around your life. They boost opportunities for people to take the first steps into maths learning."
        },
        {
            "text": "Courses are available on a part time or intensive basis."
        },
        {
            "text": "This allows people to take a formal qualification that will open doors for them and help them to progress and secure well-paid jobs."
        },
        {
            "text": "If you’re interested in accessing free support with maths and boosting your earning potential, you can take our Multiply quick quiz or have a look at what math courses available near you here."
        }
    ]
}