{
    "url": "https://naturalengland.blog.gov.uk/2023/11/08/green-infrastructure-creating-habitable-towns-and-cities-fit-for-the-future/",
    "title": "Green Infrastructure: creating habitable towns and cities fit for the future",
    "authors": [
        "Natural England"
    ],
    "categories": [
        "Biodiversity",
        "Climate change",
        "Development",
        "Green Infrastructure",
        "Natural England"
    ],
    "pub_date": "2023-11-08T14:57:33+00:00",
    "content": [
        {
            "text": " "
        },
        {
            "text": "This week is Green Infrastructure week, a celebration of green infrastructure design and best practices. Green infrastructure is a network of natural spaces designed to deliver benefits for people and the planet. The below video details green infrastructure in more depth: "
        },
        {
            "text": "In January 2023, Natural England published the Green Infrastructure Framework, a comprehensive tool to support local planning authorities and developers in designing and creating quality, nature-rich, climate-resilient urban greenspaces. The guidance also aims to support equitable access to greenspace across the country, with an overarching target for everyone being able to reach good quality greenspace in their local area so that more people realise the well-being benefits of time spent in nature. "
        },
        {
            "text": "As extreme weather events continue to dominate headlines in the UK and globally, adopting green infrastructure’s powerful nature-based tools has never been more urgent. Green and blue infrastructure is a practical response to the climate, public health, and biodiversity crises. Planners, developers, and community groups all have important contributions to make to ensure that green infrastructure is integrated into towns and cities across England, securing spaces to work, live and relax, and guaranteeing a habitable future for generations to come."
        },
        {
            "text": "Nature- led approaches to urban and rural planning"
        },
        {
            "text": "Green infrastructure now features in many towns and cities’ Local Plans. Revised every five years, they set out planning aspirations so that the sustainable needs of local communities are met.  Many towns and cities are now using Natural England’s guidance to embed Urban Greening Factor  (UGF) in their Local Plans, setting factors to drive up green cover in new residential and commercial developments. This is important because as towns and cities grow, plans are in place to establish green infrastructure at the heart of design, securing essential health, well-being, and economic benefits for residents. As a living tool, green infrastructure still needs to be designed and managed to adapt to and be resilient to climate change."
        },
        {
            "text": "Mapping insight to inform green infrastructure delivery"
        },
        {
            "text": "The GI mapping tool supports the targeted allocation of resources and the effective design and delivery of green infrastructure. Version 2.1 of the GI Mapping Tool, part of the GI Framework is sponsored by the Natural Capital and Ecosystem Assessment Programme (NCEA). Launching in Spring 2024, version 2.1 will incorporate data from the 2021 census, new urban habitat data for cities including Greater Manchester and Birmingham, and new thematic information such as more detailed data on urban heat vulnerability. It will also trial the inclusion of data on sustainable drainage in the built environment."
        },
        {
            "heading": 3,
            "text": "Examples of Green Infrastructure Design:"
        },
        {
            "text": "Sustainable Drainage System (SuDS) to manage extreme rainfall"
        },
        {
            "text": "Risk of flooding and disruption in urban areas is exacerbated due to the high proportion of impermeable surfaces (roads, paving, roofs, etc.), and a traditional drainage system that is not designed to accommodate the volume of rainfall. Sustainable drainage systems (SuDS) mimic nature’s existing water management system and reduce the risk of flooding in urban areas. SuDS lower flow rates, increase water storage capacity and reduce pollution in the water environment."
        },
        {
            "text": "Key SUDS design features:"
        },
        {
            "text": "Green roofs, blue roofs, rainwater harvesting systems, rain gardens, modified tree pits, swales, basins, ponds, wetlands, and other features can be modified to store water and slow the flow. For more information, please read the SUDS chapter in the GIF Design Guide"
        },
        {
            "text": "Urban Cooling"
        },
        {
            "text": "Green infrastructure has an important role to play in urban cooling and reducing the use of air conditioning. Green roofs and green walls significantly lower temperatures, as demonstrated by the infra-red photo below, which shows green infrastructure delivering cooling benefits."
        },
        {
            "text": "Urban heat island, (UHI) is an urban area that is significantly warmer than its surrounding rural areas due to human activities. The main cause of the Urban Heat Island effect is caused by the modification of land surfaces such as dense areas of pavement, buildings, and other surfaces that retain heat and contribute to significantly higher air temperatures in cities. To combat this, planners, ecologists, and community groups can create spaces incorporating green infrastructure (GI) design to build resilience so that people, communities, and systems are better prepared for climate change. "
        },
        {
            "text": " "
        },
        {
            "text": "The Green Infrastructure Framework’s Urban Tree Canopy Standard (one of 5 GI Headline Standards) provides guidance on the long-term maintenance of tree canopy and urban greening to support urban cooling. Watch the Deep Dive Urban Tree Canopy Cover webinar to find out more."
        },
        {
            "text": "GI design to improve air quality."
        },
        {
            "text": "Urban vegetation such as green roofs, green walls, and street-level planting can promote air movement and act as barriers to pollutants and add to the biodiversity of urban greenspace. Well-designed planting can deliver cleaner air, cooler air temperatures, more sustainable drainage, and even alleviate acoustic stress."
        },
        {
            "text": " "
        },
        {
            "text": "The Government’s 25 Year Environment Plan and Environmental Improvement plan (EIP) set out what the UK will do to improve the environment within a generation.  Green and blue spaces close to home are essential for the successful delivery of the Environmental Improvement Plan ambition for connecting people with nature so that we nurture a generation who benefit from and act for nature and species recovery; and to help reduce recreational pressure on our more sensitive nature-rich sites. As the world faces more extreme weather conditions, it’s vital that we use the green infrastructure tools at our disposal to create more nature-rich, healthy, climate resilient, and thriving places now and for future generations."
        },
        {
            "text": "Join us on 6th March 2024, for the Greener Towns and Cities: An Update on the Green Infrastructure Framework webinar. "
        }
    ]
}