{
    "url": "https://buyingforschools.blog.gov.uk/2023/11/08/looking-to-review-your-schools-insurance-check-out-the-benefits-of-rpa-dfes-alternative-to-commercial-insurance/",
    "title": "Looking to review your school’s insurance? Check out the benefits of RPA – DfE’s alternative to commercial insurance",
    "authors": [
        "Louise Green, Engagement and Information Manager"
    ],
    "categories": [
        "Services"
    ],
    "pub_date": "2023-11-08T09:31:09+00:00",
    "content": [
        {
            "text": " "
        },
        {
            "text": "Is reviewing your school or trust's insurance arrangements one of those things on your ‘to do’ list for the autumn term? Louise Green works in the Department for Education's Schools Commercial Team.  In this blog post, Louise talks about the benefits of the DfE’s Risk Protection Arrangement (RPA), an alternative to commercial insurance for state funded schools."
        },
        {
            "text": "Before you click the close button because your school is already an RPA member, I encourage you to read on and make sure you are making the most of your membership."
        },
        {
            "text": "What is the Risk Protection Arrangement (RPA)?"
        },
        {
            "text": "The DfE’s risk protection arrangement (RPA) could save you time and money. The RPA is the DfE’s alternative to commercial insurance for schools, and this means that the UK government covers losses instead of commercial insurance."
        },
        {
            "text": "It’s not complicated to join, it takes less than five minutes and there are no forms to fill in. It operates on a no material fact disclosure basis, so we don’t need estate, buildings or contents valuations and we don’t review your school's risk rating. Another bonus is that there is no annual renewal process. Your membership will simply roll over to the next year, so you don’t even have to think about that."
        },
        {
            "text": "It provides financial protection to schools in England and covers a wide range of risks, including (but not limited to):"
        },
        {
            "text": "A detailed list of everything covered can be found on RPA GOV.UK."
        },
        {
            "text": "RPA membership brings many benefits that can help protect your school and staff, including:"
        },
        {
            "text": "Since its launch the RPA has resulted in schools achieving significant savings. Currently, the cost for 2024/25 is £25 per pupil, per place, and this is reviewed annually. It’s based on academic years; this means for academies the membership year runs from 1 September to 31 August and for Local Authority Maintained schools, 1 April to 31 March."
        },
        {
            "text": "I mentioned about the RPA saving you time. This is not just each year when your membership rolls over automatically, but should the unexpected happen and you need to make claim, access to support is quick and simple through a single telephone call. Claims can also made online through the RPA claims management company website."
        },
        {
            "text": "But don't just take our word for it. Here's what Sally Connell, School Business Manager at Chew Stoke Church School, had to say about being a member of the RPA:"
        },
        {
            "text": "Membership also gives you access to guidance and support, and this includes proactive flood, crime, fire, and health and safety resilience schemes. Depending on the circumstances, financial support is available to either improve risk management or invest in solutions that are likely to reduce future claims. Where solutions are proactively instigated, they reduce the need to close schools and classrooms and all the disruption that comes along with that if an incident were to occur. There’s more information about this in our Keeping everyone safe and secure in school blog post."
        },
        {
            "text": "RPA resilience funded over £100,000 of security measures at the Coastal Learning Partnership. Sue Grey from the partnership’s central team said:"
        },
        {
            "text": "Cybercrime is a concern and a cyber security incident can affect your schools ability to function. It can be very costly and time consuming to put right which is why, in response to ever growing cybercrime concerns, cyber cover is included in the RPA cover."
        },
        {
            "text": "As RPA members, Bishop Stopford School avoided costs of £45,000 following a cyber incident. Clare Curchin, School Business Manager at Bishop Stopford School said:"
        },
        {
            "text": "There’s more information about cyber cover in our RPA members – if an incident were to happen, is your school cyber secure and are you covered? blog post."
        },
        {
            "text": "How to join"
        },
        {
            "text": "If you are a school leader, I would encourage you to consider joining the RPA. It is a valuable safety net that can help to protect your school's finances and reputation. Here's a quick summary of the benefits:"
        },
        {
            "text": "If you are currently an RPA member, I encourage you to take advantage of all the benefits that your membership has to offer. By doing so, you can help to protect your school and its staff from the unexpected."
        },
        {
            "text": "If you would like more information about the RPA, please visit the GOV.UK RPA website or contact schools.commercial@education.gov.uk"
        }
    ]
}