{
    "url": "https://kingsawards.blog.gov.uk/2023/11/08/lyma-life-celebrate-their-kings-award/",
    "title": "LYMA Life celebrate their King's Award!",
    "authors": [
        "The Queen's Awards for Enterprise"
    ],
    "categories": [
        "Advice",
        "Assessors",
        "Enterprise promotion",
        "Innovation",
        "International trade"
    ],
    "pub_date": "2023-11-08T16:29:00+00:00",
    "content": [
        {
            "text": "LYMA is a British, WellTech company founded in 2018. LYMA was created to make people’s lives better. LYMA has three category defining products, the world’s most effective supplement, the world’s most powerful home beauty device and the world’s most active skincare."
        },
        {
            "text": "Founder Lucy Goff realised that by applying cutting-edge technology and the rigour of science to the genius of nature, you can open a door to a new way of feeling. Not just preventing future ill health but allowing you to curate your future self. In just five years, LYMA has redefined the wellness category by fusing wellbeing and technology to lead the new WellTech category. LYMA products are always proven, always evidence-based, always medical-grade and always peer-reviewed."
        },
        {
            "text": "LYMA has built a global network of experts, doctors and scientific advisors that are leaders in their fields. The business has two in-house scientific advisors. Professor Paul Clayton is LYMA’s Director of Science, a clinical pharmacologist, formerly Chair of the Forum on Food & Health (UK) and Senior Scientific Advisor to the UK Government's Committee on the Safety of Medicines. Dr Clayton is one of the world's leading experts in the fast-developing science of preventative ageing. Dr Graeme Glass PhD, LYMA’s Aesthetics Director, is one of the world's leading plastic and craniofacial surgeons and a lecturer in novel stem cell therapeutics at Oxford University. He’s recognised for his clinical excellence in craniofacial, cleft, facial palsy, facial trauma, microsurgery and keloid scarring."
        },
        {
            "text": "LYMA achieved B Corp certification in September 2022 to cement its commitment to running a sustainable business. Since its launch LYMA has received numerous awards and accolades this culminated in April 2023 with the honour of receiving the first ever King’s Award for Enterprise for International Trade."
        },
        {
            "text": "The LYMA Supplement"
        },
        {
            "text": "Considered the gold standard within the evolving nutraceutical market. The Supplement is the only nutraceutical in the world to include ten powerful, peer-reviewed, patented ingredients included in the dosage proven to work. In an industry where over 90% of supplements are unproven, LYMA takes an evidence-based approach, delivering unrivalled results across sleep, anxiety, beauty, focus, performance and health."
        },
        {
            "text": "The LYMA Laser"
        },
        {
            "text": "The world’s most powerful home beauty device. Peer-reviewed clinical evidence proves this technology’s ability to transform fine lines and wrinkles, pigmentation, scars and rosacea with daily use. Because the LYMA Laser rejuvenates skin with no cell damage it is the only skincare laser suitable for all skin tones. Until now, those with melanin-rich skin have been advised to avoid clinic laser treatments because of the risk of scarring."
        },
        {
            "text": "The LYMA Laser is the only clinic-grade skincare laser FDA cleared for home use, and has recently been selected as one of TIME Magazine's Best Invention 2023. *"
        },
        {
            "text": "LYMA Skincare"
        },
        {
            "text": "Powered by GenolyticTM technology, LYMA patented technology addresses the eight mechanisms of skin ageing. Formulated with over 80% actives, LYMA Skincare is the first skin science to address why the skin ages, not just the signs."
        },
        {
            "text": "A doctor-led clinical trial of its formula saw 72% improvement in skin hydration, 51% improvement in skin firmness, 24% improvement in skin elasticity and 21% reduction in redness, in just 30 days. This simple two-step protocol is proven to reverse the conditions associated with skin ageing"
        },
        {
            "text": " "
        },
        {
            "text": "Which international markets do you already export to?  "
        },
        {
            "text": "LYMA sells direct to consumers in 70 countries.  LYMA’s primary markets are the US and UK."
        },
        {
            "text": "The King’s Award is recognition of our plans to expand our customer base across the world, we see ourselves as an international business and have a global mindset. As well as a direct to consumer activities we also export to retail partners in the US, Hong Kong and Europe."
        },
        {
            "text": " "
        },
        {
            "text": "Could you tell us about your export story? When did you begin to export?  "
        },
        {
            "text": "LYMA launched in 2018, selling the LYMA Supplement which firstly launched in the UK – the launch was so successful it sold out and we were then inundated with requests from Europe, the US and other countries. We quickly accelerated our international growth plans to be able to ship to most places in the world."
        },
        {
            "text": "Initially we distributed all our products from a UK distribution centre, however our plans to have a more global distribution footprint were accelerated by Brexit and we now have hubs in UK, Europe and the US."
        },
        {
            "text": "The launch of the LYMA Laser drove growth globally opening up new opportunities to acquire a different kind of wellness customer. Receiving the King’s Award in early 2023 saw more recognition for our products across the globe. The King’s Award accolade came just before the launch of our third product, LYMA Skincare, a ground-breaking innovation which created headlines around the world."
        },
        {
            "text": " "
        },
        {
            "text": "What is the value of your exports and how has this grown your business?"
        },
        {
            "text": "LYMA is building a British brand with a truly global footprint. In each country LYMA has entered, it has outperformed its initial forecasts and the market launch strategy is always supported by all parts of the business to give customers the true LYMA experience."
        },
        {
            "text": "Key insights:"
        },
        {
            "text": " "
        },
        {
            "text": "Is there a surprising fact about your exports? "
        },
        {
            "text": "The demand for LYMA products from the US has been overwhelmingly positive - when we launched our LYMA Laser to the US we had a waiting list of 10,000 people and sold out initial stock in 24 hours. Similarly for the LYMA Skincare launch our US customers were the first to sign up. American consumers are educated and informed about the science behind our products. They have found they are also very supportive of us as a female founded, and British brand and we believe they saw us receiving the King’s Award as the ultimate accolade."
        },
        {
            "text": " "
        },
        {
            "text": "What do exports mean for your business? "
        },
        {
            "text": "The international and domestic trading strategies work together to deliver LYMA’s mission of being the leader in its category and becoming the first WellTech super brand."
        },
        {
            "text": "LYMA will only enter a market where it feels it can do the brand justice and exceed customers’ expectations in order to build the brand, influence word of mouth, and ensure all customers receive the highest level of service. LYMA has primarily focused on English-speaking territories, but its growth strategy will see it explore expansion in non-English-speaking countries. This next phase of growth will see LYMA rely on third-party regional distribution where expertise is needed to understand nuances and needs of the consumer."
        },
        {
            "text": "Exporting and fostering connections with international partners is at the heart of the LYMA business and receiving the King’s Award has cemented our commitment to this."
        },
        {
            "text": " "
        },
        {
            "text": "What advice would you give to other businesses exporting?  "
        },
        {
            "text": "When starting to export it is vital to ensure your distribution partnerships are solid and reliable. When you are a new brand, and a customer has trusted you enough to place an order it is vital you deliver on that promise and ensure they receive their product swiftly and in excellent condition. When you’re a wellness brand it is even more important to deliver on this promise."
        },
        {
            "text": " "
        },
        {
            "text": "Find out more about LYMA Life here."
        },
        {
            "text": "Find out more about The King's Awards here."
        },
        {
            "text": " "
        }
    ]
}