{
    "url": "https://planninginspectorate.blog.gov.uk/2023/11/08/raising-aspirations-through-royal-town-planning-institute-rtpi-volunteering/",
    "title": "Raising aspirations through Royal Town Planning Institute (RTPI) volunteering",
    "authors": [
        "Rebecca Phillips"
    ],
    "categories": [
        "People",
        "Public service",
        "Recruitment"
    ],
    "pub_date": "2023-11-08T14:12:29+00:00",
    "content": [
        {
            "text": "As a planner, a Professional Lead at the Inspectorate, and a proud member of the Royal Town Planning Institute (RTPI), I've had the privilege of getting involved in an initiative that not only fuels my passion for planning but also contributes significantly to the development of the planning profession.  "
        },
        {
            "text": "In this blog post, I want to share my story of volunteering for the RTPI and encourage RTPI chartered members, active or retired, to consider this enriching opportunity. "
        },
        {
            "heading": 2,
            "text": "The RTPI's vital role in planning education"
        },
        {
            "text": "The development of the planning profession is inseparable from education and accreditation. To support this fundamental aspect of our field, the RTPI operates a volunteer program known as the Partnership and Accreditation Panel (PAP).  "
        },
        {
            "text": "PAP members play a pivotal role in assessing universities' applications for RTPI accreditation. This work is essential for nurturing a skilled and well-prepared planning workforce. "
        },
        {
            "heading": 2,
            "text": "Partnership boards: Nurturing planning education"
        },
        {
            "text": "Each accredited Planning School, or those working towards accreditation, has a dedicated Partnership Board. These boards are composed of a Chair, Vice Chair, the RTPI Education Officer, and two university-appointed planning practitioner representatives. Their purpose is to oversee the ongoing effectiveness of the Planning School and provide support for its development.  "
        },
        {
            "text": "Volunteers who wish to contribute to these boards start their journey on the PAP before taking on a specific role within the Partnership Board. Board members typically meet twice a year, once for the Partnership Board meeting and again for the PAP Board meeting. "
        },
        {
            "heading": 2,
            "text": "Who can volunteer?"
        },
        {
            "text": "The roles within these boards are open to RTPI Chartered members and retired Members or Fellows with a vested interest in planning education and higher education policy. Whether you are currently working or have experience as a planning academic or practitioner in the public or private sector, your dedication to the profession is what truly matters. "
        },
        {
            "heading": 2,
            "text": "A glimpse into the experience"
        },
        {
            "text": "Currently, over 50 members, combining both academia and practice, make up the RTPI PAP. They gather annually to receive updates about RTPI activities and explore any issues affecting planning higher education.  "
        },
        {
            "text": "New volunteers are typically offered Vice Chair roles, where they gain an overarching perspective of the planning profession in relation to education, training, and continuing professional development.  "
        },
        {
            "text": "The Vice Chair supports the Chair and may need to step in under exceptional circumstances. Some knowledge of higher education operations and RTPI education policy is expected. "
        },
        {
            "heading": 2,
            "text": "My journey as chair"
        },
        {
            "text": "I began my journey as a Vice Chair at Plymouth University Partnership Board before being appointed as Chair, initially at Plymouth and now at the JDLC Partnership Board. Prior to this, I had served as an external examiner at Cardiff University's Planning School.  "
        },
        {
            "text": "As the Chair of the JDLC Partnership Board, I take on a leadership role and act as a crucial link between the Planning School and the RTPI.  "
        },
        {
            "text": "My responsibilities include chairing the annual Board meeting, collaborating on the agenda with the Head of School, and ensuring the voices of Board members influence key decisions, including the accreditation of new courses. I also produce an annual report assessing the effectiveness of the Planning School. "
        },
        {
            "heading": 2,
            "text": "The rewarding aspect of volunteering"
        },
        {
            "text": "One of the most gratifying aspects of volunteering is the opportunity to engage with students and fellow board members. Listening to students' feedback on their courses and learning about their work is truly rewarding. It's also a fantastic way to expand your professional network and connect with planners from across the profession and academia. Moreover, these activities contribute to your Continuing Professional Development. "
        },
        {
            "heading": 2,
            "text": "Making a difference together"
        },
        {
            "text": "Both roles – Vice Chair and Chair – offer a chance to connect with other planning professionals, gain a deeper understanding of the education and academic sector, and ensure that the education of future planners aligns with the expectations and experiences of planning practitioners. "
        },
        {
            "text": "The RTPI provides invaluable support, training, and reimbursement of reasonable expenses to its dedicated volunteers. With virtual meetings since 2020 and flexible options for attendance, the time commitment is manageable, allowing you to prepare for meetings and collaborate with the Planning School at your own pace. "
        },
        {
            "text": "If you're interested in learning more and potentially joining this fulfilling journey, head to the RTPI Accreditation or Partnership Board application page. "
        }
    ]
}