{
    "url": "https://mhrainspectorate.blog.gov.uk/2023/11/08/were-hiring-meet-some-of-the-inspectors-in-compliance-team-1/",
    "title": "We’re Hiring - meet some of the Inspectors in Compliance Team 1",
    "authors": [
        "Mandy Budwal-Jagait"
    ],
    "categories": [
        "Compliance matters",
        "Inside the Inspectorate",
        "recruitment"
    ],
    "pub_date": "2023-11-08T15:38:16+00:00",
    "content": [
        {
            "text": "We are currently recruiting for a Good Clinical Practice (GCP) Inspector and a Good Pharmacovigilance Practice (GPvP) Inspector in Compliance Team 1. We are passionate about reaching a diverse pool of candidates from a variety of backgrounds. In this blog we have asked some of our inspectors to share their background and what motivated them to apply for the role of an inspector. You will see that there’s no one career path for the role of an inspector and each inspector’s previous experience brings a unique insight which is celebrated. We hope it inspires you or someone you know to apply for our current vacancies or consider becoming an inspector as part of your own career path."
        },
        {
            "text": "We will be including additional inspector profiles as part of our future recruitment campaigns."
        },
        {
            "text": "Please click on the profile below, to learn more about the Inspector, why they applied for the role, what they love about the role and advice for potential candidates."
        },
        {
            "text": "See details of our current vacancies and how to apply."
        },
        {
            "heading": 2,
            "text": "GCP Inspectors"
        },
        {
            "text": "Mandy Budwal-Jagait, Head of GCP and Lead Senior GCP Inspector"
        },
        {
            "text": "Jason Wakelin-Smith, Head of the Expert Circle and Expert GCP Inspector"
        },
        {
            "text": "Hayley Dixey, Lead Senior GCP Inspector"
        },
        {
            "heading": 2,
            "text": "GPvP Inspectors"
        },
        {
            "text": "Sophie Radicke, Head of GPvP and Senior Pharmacovigilance Inspector"
        },
        {
            "text": "Claire Longman, Expert Pharmacovigilance Inspector"
        },
        {
            "heading": 2,
            "text": "GLP Inspector"
        },
        {
            "text": "Lynsay Hunter, GLP Inspector"
        },
        {
            "text": " "
        },
        {
            "heading": 3,
            "text": "Mandy Budwal-Jagait, Head of GCP and Lead Senior GCP Inspector"
        },
        {
            "text": "Hello, I’m Mandy and I am the current Head of GCP at the MHRA and a Lead Senior GCP Inspector. I am responsible for the GCP inspection programme and the recruiting manager for the current GCP inspector vacancy. After completing my BSc in Medical Biochemistry and MSc in Toxicology, I realised that I wasn’t suited to life in a laboratory (for some reason, I would always have something go awry in my experiments)! I learned about clinical research and was immediately drawn to wanting to make a difference and help patients receive lifesaving/changing medicine. I started as a clinical research associate (CRA) in the pharmaceutical industry in 2008, progressing to a quality compliance role, then quality assurance as an auditor. I joined the MHRA as a GCP inspector in 2014."
        },
        {
            "text": "A site of mine had been selected for an MHRA GCP inspection, where I observed the incredible work of the GCP inspectors. Following the inspection, I had a mindset change and couldn’t look at monitoring in the same way. I was delving into root-causes of issues and wanting to look at the bigger picture in terms of impact. I decided to apply for the role of GCP inspector as I am passionate about championing the voice of patients and keeping them safe. By joining the MHRA, I was able to do this not just within one company, but across the clinical research arena. You’ll read below that most inspectors applied and thought that they wouldn’t get the role, I was one of them too. Applying and saying yes to the role, was the best decision in my career so far."
        },
        {
            "text": "This is a role of public service and I work with committed colleagues who inspire me every day with the work they do. I love the variety in my work, from inspections, educating and collaborating via stakeholder engagement, policy development and the numerous projects we get involved in. No day is the same and I am constantly learning! This role has accelerated my personal development and allowed me to have purpose every day in the work that I do. The role has also allowed me to balance my family commitments as a working mum of two small children, who keep me on my toes!"
        },
        {
            "text": "My advice to anyone considering applying is to firstly review the advert and job description. Don’t rule yourself out or pre-empt who we are looking for or what previous roles you need to have held to join. Champion yourself, your uniqueness and be authentically you. If you feel that now is not the right time for you to apply, include GCP inspector as part of your career goals and keep an eye out for future vacancies."
        },
        {
            "heading": 3,
            "text": "Jason Wakelin-Smith, Head of the Expert Circle and Expert GCP Inspector"
        },
        {
            "text": "My name is Jason Wakelin-Smith and I am the Expert GCP Inspector and Head of the Compliance Expert Circle. I have been at the MHRA for 17 years so I have seen plenty of changes in the world of clinical trials since I joined in 2006 shortly after the introduction of the Medicines for Human Use Regulations in 2004. I initially qualified from university as a Biomedical Scientist but fell into the world of hospital pharmacy where I initially trained as a pharmacy technician; once qualified I moved into aseptic manufacture within the NHS followed a few years later by commencing training to become a Qualified Person (QP) within the NHS. This led to a role in clinical trials as I gained broader skills to support my QP training. At this time the clinical trial regulations and the conduct of clinical trials were very different than they are today and eventually I ended up leading the provision of pharmacy clinical trial services within my NHS Trust. In 2006 I was encouraged to apply for a GCP Inspector’s post by my manager and I admit to applying so that I could cross it off the list when I didn’t get it and continue down the path to becoming a QP. Following the selection process I was offered the job and it was a significant turning point in my life as it meant leaving the NHS and becoming a civil servant and starting a life ‘on the road’."
        },
        {
            "text": "The change in role very much fitted with my values; in the NHS I could make a difference for the single patient that I was working on behalf of, whether that was making their dose of chemotherapy or ensuring that they had access to the correct medication to support their inclusion in a clinical trial. By becoming an inspector this massively changed my ‘reach’; if I do a good job then it could potentially impact the current participants involved in that clinical trial as well as any future patient taking medication that had been tested as part of that clinical trial. This has always been a massive driver for me."
        },
        {
            "text": "The life of an inspector is fascinating! The exposure to the development of cutting edge treatments and technologies, looking at the multitude of ways that a process can be undertaken, the changes to technology and ways of working, meeting interesting people and the ability to effect change globally through partnerships and exchanges of information with other regulators and stakeholders are always examples of that. It’s a vertical learning curve when you start life as a new inspector and it remains steep thereafter but it’s always interesting and challenging. Once qualified there are multiple directions that you can take whether that’s developing additional technical skills within a particular area, cross-training with another inspection team or developing management skills. I have done all of these and I continue to enjoy it every step of the way. We are a close-knit community of inspectors and you are never alone - help, support, encouragement or a suggestion is only ever a phone call away."
        },
        {
            "text": "In terms of any advice that I can offer to you? I’d encourage you to bring your life experiences to the role. I did not think that I would make the grade to become an inspector as I hadn’t worked in industry. But what I did bring to the role was broad exposure to many areas such as a basic analytical background from my degree, knowledge of the NHS, exposure to GMP and GCP, experience in computer system development, involvement in national pharmacy training provision and an appetite to learn and make a difference. So embrace your life’s journey to date and let us know what you can bring to the team as our next inspector."
        },
        {
            "heading": 3,
            "text": "Hayley Dixey, Lead Senior GCP Inspector"
        },
        {
            "text": "I applied for a GCP Inspector job at the MHRA in 2015. The role of a GCP Inspector was of interest to me as I had been working in GCP quality roles for around 7 years and at the time I thought, why not give the application a go? I didn’t really expect to get the position as I doubted that I had enough experience and knowledge. I had been inspected and hosted inspections by the MHRA and respected the inspection process and what the MHRA is there to do."
        },
        {
            "text": "Eight years later and so much has now changed in my personal life, I am now a parent to two small children and the work life logistics are significantly more complex! However, it is possible! Please don’t immediately be put off by caring responsibilities if this role is something you are interested in."
        },
        {
            "text": "The role as an inspector is technically challenging and as the clinical trial world evolves, we have to evolve with it, which is fascinating to be a part of.  What I have enjoyed in my role, is the people I work with and the people we meet along the way. We are so privileged to be able to go into a vast array of environments and gain such insight into their culture and processes. Going back to my first point, it’s really the people in the agency that make this an enjoyable role. Inspections are intense for all involved (hosts and Inspector’s) but we always manage to have a laugh and this makes being away from home and my children much easier."
        },
        {
            "text": "During my time at the agency, I have been given many opportunities such as working with international regulatory agencies and have been able to progress to a Lead Senior Inspector despite time out of work for maternity leave."
        },
        {
            "text": "Recently one of my children for the first time took an interest in what my job is, asking ‘what do you actually do at work mummy?’ after explaining as best as I could to a 4-year-old they responded ‘hmm that sounds important’ (before they turned back to YouTube). We really are trying to ensure that trials are conducted safely and ethically for participants, any of whom could be our family members or us ourselves at some point in our lifetime. So, it makes me proud that my children think what I do is important."
        },
        {
            "text": "Final bits of advice for anyone considering the role;"
        },
        {
            "heading": 3,
            "text": "Sophie Radicke, Head of GPvP and Senior Pharmacovigilance Inspector"
        },
        {
            "text": "My name is Sophie Radicke and I am the Head of the GPvP Compliance Team. My main responsibility is the line management of the MHRA’s pharmacovigilance inspectors and to ensure the operational delivery of pharmacovigilance inspections. I am also a senior pharmacovigilance inspector, and in this capacity, I have conducted over 70 inspections of a variety of organisations and pharmacovigilance systems."
        },
        {
            "text": "I have degrees in Human Biology and Forensic Anthropology, but after graduating from university, I found myself in a position that is probably familiar to many graduates – I knew what I wanted to do in an ideal world but couldn’t quite achieve it due to various factors. I therefore fell back on my plan B, which was working in the pharmaceutical industry. I subsequently worked for a mid-sized pharmaceutical company in Germany and then a medical information service provider. But after around three years of working in industry, I became curious about how it would be like to work for the medicines regulator."
        },
        {
            "text": "In 2016, I joined the MHRA as an associate assessor for safety variations in the Patient Information Quality Unit. At the time, I was not even aware that the inspector role existed, but my ignorance didn’t last long as I attended a Lunch-and-Learn talk by one of the GCP inspectors. While the role sounded exciting and like it would match with many of my skills and interests, I did not give it any further thought until the GPvP inspection team opened a recruitment round for a new inspector a year and a half later. I was keen to stay at the MHRA, but to develop further so I leapt at the opportunity to apply. In fact, my manager also encouraged me to apply as she thought the role might be a good fit for me – I am grateful for her encouragement to this day! Due to my limited experience in pharmacovigilance, I started the inspector role at the lower SEO grade."
        },
        {
            "text": "While I conduct fewer inspections now than I used to, it is still one of my favourite parts of the job. I enjoy the ‘detective’ work of inspections and putting together all the different pieces to build a picture of compliance. It is also a privilege to be able to see so many different organisations and ways of operating a pharmacovigilance system, an experience which would be difficult to achieve otherwise."
        },
        {
            "text": "Beyond inspections, my work gives me a degree of autonomy and flexibility that I haven’t encountered in any other role before. I also like the mix of working from home, our London office and travelling for inspections. In addition, I work with a talented and supportive group of people which in turn creates an amazing atmosphere at work."
        },
        {
            "text": "Lastly, I am extremely motivated by knowing that my work is an important cog in the MHRA machinery to ensure that patients have access to safe and effective medicines. I also enjoy sharing my knowledge and expertise with newer inspectors and organisations, supporting them to work towards our common goal of patient safety."
        },
        {
            "text": "My advice to interested candidates is to give it a shot – while a certain degree of pharmacovigilance knowledge and experience is needed, but it is only part of our requirements. If you are able to organise your own work, to motivate yourself and are eager to continuously learn personally and technically, reflect and develop yourself and others, then you’re already in a good position to succeed in this role."
        },
        {
            "heading": 3,
            "text": "Claire Longman, Expert Pharmacovigilance Inspector"
        },
        {
            "text": "My name is Claire Longman, I am a mum of 5-year-old twins and the Expert Pharmacovigilance Inspector at the MHRA."
        },
        {
            "text": "I have been at the MHRA now for nearly 10 years, having 2.5 years off to look after my babies when they were younger."
        },
        {
            "text": "Becoming an inspector was one of the proudest days of my life and sometimes I still have to pinch myself that I am privileged enough to hold this role. I have a BSc in Human Biology and a MSc in Health Sciences. I had fallen into Pharmacovigilance and spent 6 years in industry working my way up through PV and medical information. I had experience in case management, signal detection, PSURs and had been the Local Safey Officer at a medium sized company. I was contacted about the Inspector role at the MHRA and at the time declined to apply as I did not believe it was something I had enough experience or sufficient knowledge to be successful in applying for. After some persuasion, I submitted my application with the view that I would at least understand how the application process work and in a few years’ time I would be ready to apply ‘for real’, but to my surprise I kept being successful though each round and made it to the final round at the assessment centre. I remember this aspect clearly and enjoyed the environment and experience, I knew then that the job was for me and luckily, I exceeded my expectations and started as a Pharmacovigilance Inspector in 2014."
        },
        {
            "text": "10 years later and I am still here, still engaged, still learning and still feeling privileged to hold the role I do. I have had exposure to situations and environments I would not have got in other roles. There are frustrations, of course, I am sure they come with every job but there are so many aspects I love about my role and I truly look forward to coming to work every day and giving my all. So what are the top 3 aspects I enjoy about the role of an inspector? Firstly, the amazing people I get to work with, I find the team inspiring, everyone works hard, has a valid opinion and everyone is encouraged to bring their strengths within the team and we celebrate the diversity we have. Secondly, the exposure I get, whether this is on inspection itself and seeing how different companies approach achieving compliance with regulations; training and presenting in front of large audiences; to speaking with other regulators and inputting to discussions on behalf of the MHRA; to imparting knowledge and experience with others, whether trainee inspectors or other departments. Above all the work is always diverse and stimulating. Thirdly, I am often out of my comfort zone, although this can be hard sometimes, it is a feeling you get used to and are rewarded with an amazing sense of achievement pushing yourself to achieve tasks you may not have had chance to be part of in other roles."
        },
        {
            "text": "But there must be disadvantages to the role? One, which may be considered a disadvantage, is the travel, especially if you have a young family like me. Although it can be hard sometimes to leave, it is achievable and when not travelling work is flexible. I work from home with infrequent trips to London for meetings and I can make work fit around my home life. This is invaluable to me and makes a challenging role achievable and enjoyable whilst still having time to raise my family and spend quality time with them."
        },
        {
            "text": "If I can give any advice, it would be, if you have an enquiring mind, are a team player and want to be challenged, apply for the role, give it a go. Its highly rewarding, fun, at times exhilarating and you can become part of a very hard working and dedicated team. Be yourself, be open, listen to others but give your opinion and make time to have fun along the way."
        },
        {
            "heading": 3,
            "text": "Lynsay Hunter, GLP Inspector"
        },
        {
            "text": "My name is Lynsay Hunter, and I am a Scottish-based GLP inspector working within the laboratories team here at the MHRA for the past seven years. I have two daughters whose social lives have eclipsed my own, although they and my husband are great helpers in helping me get rid of the results of my baking obsession which I still get time for!"
        },
        {
            "text": "I left the University of Stirling in 2005 with an honours degree in biochemistry which I put to work as an auditor in a small team at a clinical research organisation (CRO) on my university campus. I then moved into the lab and spent the next five years moving between CROs starting as a lead stability analyst and happily settling as a formulation analysis study director before that CRO site closed and I found myself redundant. After the closure I ended up as a development scientist investigating scale inhibitors in the oil industry. Our ISO9001 auditor left to go on maternity leave which coincided with me returning after a health scare (which limited me physically) so I found myself taking on the audit secondment to get us through our upcoming re-accreditation. On the return of the existing ISO9001 auditor, and being unable to move around brine barrels anymore, I moved to another CRO for a few years before the manager of a local quality assurance consultancy headhunted me and convinced me to join their laboratories team (which I ended up leading)."
        },
        {
            "text": "I applied to be an inspector after a colleague who had left my consultancy and joined the MHRA themselves told me about a vacancy. I had never looked at MHRA positions as I felt I could never be ‘good enough’ to be an inspector despite the role being very appealing, but they persuaded me to apply - and I’m very glad they did. The variety of backgrounds in my own team alone shows that there is no set path to becoming an inspector and the majority of us have been inspected ourselves at some point so we know what it’s like to be an inspectee. It is the very variety in my own background which I think helps me in my role. Being part of the laboratories team (as well as the wider compliance teams) is a huge part of why I love my job as the other inspectors are all very welcoming and supportive – and a lot less scary than I had been led to believe at previous jobs!"
        },
        {
            "text": "My advice to anyone weighing up applying for an inspector role would be to just go for it, and even if you don’t see another inspector with similar experience to you consider that could be because it is exactly what we are missing from our teams."
        }
    ]
}