{
    "url": "https://educationhub.blog.gov.uk/2022/06/02/queen-honours-people-for-their-contributions-to-education-and-childcare/",
    "title": "Queen honours people for their contributions to education and childcare",
    "authors": [
        "Media Officer"
    ],
    "categories": [
        "Families",
        "Schools",
        "Skills"
    ],
    "pub_date": "2022-06-02T00:10:06+01:00",
    "content": [
        {
            "text": "Every year on her official birthday the Queen honours people who have gone above and beyond in public service."
        },
        {
            "text": "The list, published today, includes a number of people honoured for their contributions to education. Among them are:"
        },
        {
            "text": "Afia Choudhury OBE"
        },
        {
            "text": "Afia is a foster carer from Tower Hamlets in London. Her dedication to fostering is extraordinary.  She is a foster parent, a fostering ambassador and a member of corporate parenting board."
        },
        {
            "text": "Nicola Benyahia MBE"
        },
        {
            "text": "Nicola is the founder of Families for Life. She has played a key role in raising awareness of the risk of radicalisation of vulnerable people."
        },
        {
            "text": "Jill Colbert OBE"
        },
        {
            "text": "Jill is the Director of Children's Services and Chief Executive of Together for Children.  She has transformed children’s services in Sunderland."
        },
        {
            "text": "Yvonne Jacqueline Davis MBE"
        },
        {
            "text": "Yvonne is the former headteacher of Oak View Primary and Nursery School in Hatfield. She is a trailblazer in education for teachers from ethnic minority backgrounds."
        },
        {
            "text": "Aisha Thomas MBE"
        },
        {
            "text": "Aisha founded Representation Matters. She tirelessly campaigns for greater representation for students and teachers from ethnic minorities by highlighting the importance of anti-racist practice."
        },
        {
            "text": "Graham Cowley OBE"
        },
        {
            "text": "Graham is the independent chair of Blackpool Opportunity Area. He is a campaigner for better opportunities for young people in Blackpool."
        },
        {
            "text": "Michael James Paul Arthur Knighthood"
        },
        {
            "text": "Michael was Provost and President of University College London. Under his leadership University College London became a sector-leader in equality, diversity and inclusion."
        },
        {
            "text": "William Ogden British Empire Medal"
        },
        {
            "text": "William is academic affairs advisor at Kingston University. He has ensured students with additional needs have access to correct the support and raised awareness of the deaf society."
        },
        {
            "text": "Bryan Lee British Empire Medal"
        },
        {
            "text": "Bryan is the site manager at Tomlinscote School in Frimley. Bryan was instrumental in keeping the school open safely during the Covid-19 pandemic."
        }
    ]
}