{
    "url": "https://ipo.blog.gov.uk/2022/06/02/time-for-tea-raising-a-cup-to-the-ip-in-the-platinum-jubilee-party/",
    "title": "Time for tea: raising a cup to the IP in the Platinum Jubilee party",
    "authors": [
        "Kayleigh Enticknap"
    ],
    "categories": [
        "Licensing",
        "Patents",
        "Trade marks"
    ],
    "pub_date": "2022-06-02T09:30:20+01:00",
    "content": [
        {
            "text": "The countdown begins! This weekend we celebrate the Queen’s Platinum Jubilee, a landmark anniversary. It's not every day a country sees a monarch marking 70 years of service on the throne. "
        },
        {
            "text": "With the excitement levels ramping up, what activities are you planning to mark this historic event?  "
        },
        {
            "text": "My weekend will be filled with plenty of exciting family activities for this Royal extravaganza. We’re starting with the Trooping of the Colour, which marks the Queen’s official birthday. As I sit and reminisce with my grandmother about the street celebrations through the years, it got me thinking about the ingenious innovations (and intellectual property within it) that help bring these parties to life. "
        },
        {
            "heading": 2,
            "text": "Setting up your street party "
        },
        {
            "text": "The day has dawned, there’s a scurry of activity as tables, chairs and trays of food emerge from every doorway. A celebration such as a Jubilee would not be complete without bunting and balloons - but how will you keep your balloon safe on a windy day?  "
        },
        {
            "text": "Party accessory brand B-Loony clearly had such a challenge in mind when they patented their child-friendly, sustainable and biodegradable BalloonGrip® Balloon Holders. The colourful cardboard holders are even fully recyclable.  "
        },
        {
            "text": "  "
        },
        {
            "text": "Kris Baker, Marketing Manager, said of B-Loony's patent: "
        },
        {
            "text": "A patent protects your invention and gives you the legal right to take action against anyone who copies or uses it without your permission. "
        },
        {
            "heading": 2,
            "text": "All dressed up"
        },
        {
            "text": "Now that you've got your party decorations sorted, it's time to ensure you look the part. Will you be wearing your best attire or going in fancy dress? If it's the fun factor you're going for, celebrity mask maker Mask-arade have just the accessory for you. Imagine your friends faces when you turn up as someone from the Royal Family!"
        },
        {
            "text": "After launching to fame on Dragons' Den, Mask-arade purchased a number of copyright licences to produce the celebrity faces and applied to register a community trade mark on the word Mask-arade."
        },
        {
            "text": "Speaking about their trade mark a few years ago, Ray Duffy of Mask-arade told us:"
        },
        {
            "text": "To learn more about Mask-arade and how protecting their IP has been of benefit to their business, check out their case study."
        },
        {
            "heading": 2,
            "text": "Time for tea "
        },
        {
            "text": "No Jubilee celebration would be complete without a nice cup of tea, but where are you going to balance your plate and cuppa when chatting to your neighbours at the street party? Laura Ellen Roberts was obviously wondering something similar when she invented the ingenious integrated cup and saucer, patented in 1901.   "
        },
        {
            "text": "A patent would have allowed Laura to license her invention to others. I wonder if she did? To find out more about applying for a patent and licensing your patent, watch our IP Basics video below:"
        },
        {
            "heading": 2,
            "text": "...and a slice of cake "
        },
        {
            "text": "When it comes to food and drink, the creator of a certain dish or product may choose to keep the recipe or special ingredient secret, in order to distinguish themselves from their competitors or license said recipe. This is known as a trade secret. These are used by many well-known food and drinks companies, such as Coca-Cola and KFC. "
        },
        {
            "text": "Thankfully, the winner of the Platinum Jubilee pudding competition didn’t trifle with trade secrets. The recipe for Jemma Melvin’s delicious-looking lemon and amoretti trifle has been made available for us all to share. Jemma was inspired by the lemon posset that was served at the Queen’s wedding to Prince Phillip. "
        },
        {
            "text": "Find out more about trade secrets with our collection of case studies, showing how businesses have used trade secrets to protect the know how in their organisations."
        },
        {
            "text": "So...the party has ended and all is quiet again, giving you time to ponder on your next invention, catchy business name or beautifully designed product. If so, these may well contain intellectual property. Why not watch our colourful IP Basics videos to find out what IP you may have and how to protect it."
        },
        {
            "text": "To keep in touch, sign up to email updates from this blog, or follow us on Twitter."
        }
    ]
}