{
    "url": "https://opss.blog.gov.uk/2023/08/16/join-our-team-as-a-data-scientist/",
    "title": "Join Our Team as a Data Scientist!",
    "authors": [
        "Adam Barclay – Fast Stream Summer Intern - OPSS"
    ],
    "categories": [
        "Careers at OPSS",
        "Civil Service Careers",
        "Vacancies"
    ],
    "pub_date": "2023-08-16T09:22:36+01:00",
    "content": [
        {
            "text": "Are you passionate about using data to drive real-world impact?"
        },
        {
            "text": "Do you have the skills and expertise to make a difference in the world of product safety and regulation?"
        },
        {
            "text": "If so, we invite you to consider an exciting opportunity to become a part of the Analysis Team at the Office for Product Safety and Standards (OPSS), a crucial department within the Department for Business and Trade."
        },
        {
            "heading": 4,
            "text": "About OPSS"
        },
        {
            "text": "At OPSS, our mission is clear: we are dedicated to ensuring the safety of products and protecting both consumers and businesses. As part of the Department for Business and Trade, our role is to make regulation effective and impactful. Well-crafted and well-implemented regulation can foster growth, innovation, and efficiency while keeping people and places safe from product-related harm."
        },
        {
            "heading": 4,
            "text": "The Role: Data Scientist"
        },
        {
            "text": "As a Data Scientist at OPSS, you will play a pivotal role in advancing our analytical capabilities and leveraging data to uncover insights into product safety. Collaborating closely with our Senior Data Scientist and other team members, you will be responsible for delivering data science solutions across a range of topics, including product safety, compliance, and enforcement. Your work will help OPSS become a data-led organisation, enabling us to harness new data sources and techniques while promoting the use of robust pipelines to deliver reproducible outputs."
        },
        {
            "text": "Key responsibilities range from collaborating with senior team members on high-profile analytical projects to developing both your own and wider coding and data science capability across the department through training and community events."
        },
        {
            "heading": 4,
            "text": "Why you should apply"
        },
        {
            "text": "Embarking on a career as a Data Scientist at the Office for Product Safety and Standards (OPSS) within the Department for Business and Trade offers a unique opportunity to make a tangible impact on consumer safety, business growth, and the regulatory landscape."
        },
        {
            "text": "Here's why you should consider joining our dynamic team:"
        },
        {
            "text": "Location and Working Arrangements"
        },
        {
            "text": "This role is available in both Birmingham and London. Flexible working arrangements are available, and we embrace a hybrid working model that allows for a balance between remote and office-based work."
        },
        {
            "text": " "
        },
        {
            "text": "How to Apply"
        },
        {
            "text": "If you are excited about the prospect of contributing to product safety and making a meaningful impact, we encourage you to apply for this role. To do so, please click on the link to apply on Civil Service Jobs."
        },
        {
            "text": "We are committed to creating an inclusive and diverse workforce, and we welcome applications from all backgrounds. If you require reasonable accommodations during the application or interview process, please don't hesitate to contact us."
        },
        {
            "text": "Benefits"
        },
        {
            "text": "Alongside your starting salary of £38,052, the Department for Business and Trade contributes £10,274 towards you being a member of the Civil Service Defined Benefit Pension scheme."
        },
        {
            "text": "Important Dates"
        },
        {
            "text": "Don't miss your chance to become our next Specialist Data Scientist. Embrace the challenges, drive innovation, and elevate your career within the Civil Service."
        },
        {
            "text": "Apply now and join us in shaping the future of data science!"
        }
    ]
}