{
    "url": "https://ruralpayments.blog.gov.uk/2023/08/16/keeping-your-digital-maps-up-to-date/",
    "title": "Keeping your digital maps up to date",
    "authors": [
        "RPA Editor"
    ],
    "categories": [
        "Countryside Stewardship",
        "Mapping",
        "Sustainable Farming Incentive"
    ],
    "pub_date": "2023-08-16T12:53:57+01:00",
    "content": [
        {
            "text": "Recently, we published a series of blogs about the importance of keeping the registered land details on your digital maps up to date. This blog summarises what this series of blogs has covered, together with links to those blogs so you can read the full detail."
        },
        {
            "heading": 2,
            "text": "Making sure your registered land details are up to date before you apply for environmental land management schemes  "
        },
        {
            "text": "The details we map (register) for each land parcel include:"
        },
        {
            "text": "Before you apply for an environmental land management scheme, such as Countryside Stewardship Mid Tier or the Sustainable Farming Incentive (SFI), check your digital maps in the Rural Payments service to make sure each land parcel:"
        },
        {
            "text": "If these land details are not up to date, you will not be able to include that land in your environmental land management scheme application."
        },
        {
            "text": "For more information, read our blogs about:"
        },
        {
            "heading": 2,
            "text": "How to ask us to update the registered land details on your digital maps"
        },
        {
            "text": "If the registered land details on your digital maps are not up to date, you can ask us to update them. You need to ask us to do this as soon as something changes."
        },
        {
            "text": "You can use an RLE1 form and sketch map to ask us to:"
        },
        {
            "text": "Read our blog about how to fill in an RLE1 form, as it’s really important that the information you provide on the RLE1 form and sketch maps is accurate. This helps us to process your mapping update request more quickly."
        },
        {
            "text": "You can also find more information in our blogs on:"
        },
        {
            "heading": 2,
            "text": "How we’re improving the mapping experience for farmers"
        },
        {
            "text": "Approximately 75% of land in England is registered as over 2.5 million land parcels on our land system. We want to help farmers and land managers to keep these registered land details up to date, so they can submit applications and receive timely and accurate payments."
        },
        {
            "text": "We’ve already made some improvements to the RLE1 mapping update request process, and we’re exploring further improvements we can make to make it quicker and easier. This includes looking at options to allow farmers, land managers and agents to update their registered land details online."
        },
        {
            "text": "Find out more in our blog about improving the mapping experience for farmers."
        },
        {
            "text": "You can also read our blog about how the RPA provides accurate mapping for farmers and land manager. In this blog, RPA’s Operational Mapping Lead, David Franks, explains the work his team does to keep the registered land details on our land system up to date."
        },
        {
            "heading": 3,
            "text": "Stay up to date with the latest information"
        },
        {
            "text": "To stay up to date with the latest information and updates from RPA, sign up to our blog and follow us on social media on the following accounts:"
        },
        {
            "text": "By following and subscribing to our social channels and blog, you’ll be able to see the latest updates about important information. We also share top tips and announcements. You can also listen to The RPA Podcast which we have launched to help farmers, landowners and rural communities keep up to date with the latest news from RPA."
        }
    ]
}