{
    "url": "https://competitionandmarkets.blog.gov.uk/2023/08/16/steps-you-can-take-to-help-choose-the-right-bank-for-you/",
    "title": "Steps you can take to help choose the right bank for you",
    "authors": [
        "Colin Garland"
    ],
    "categories": [
        "Remedies"
    ],
    "pub_date": "2023-08-16T15:03:32+01:00",
    "content": [
        {
            "text": "At this time when people and businesses are struggling with the rising cost of living, there are steps everybody can take to ensure that you are with the bank that best meets your needs."
        },
        {
            "text": "There can be benefits to switching your current account to another bank or building society, such as saving you money on interest rates or having access to your money in the way which suits you best. For example, banks differ in the range of services and packages they offer, so an alternative provider’s offering might better suit your spending patterns and banking needs."
        },
        {
            "text": "Banking competition benefits all of us. Active and empowered customers drive competition between banks so that they try harder to come up with innovative, good value products and top-quality services that match your needs. This increases the choice and value available to you and makes switching even easier as banks compete to attract customers."
        },
        {
            "text": "The CMA introduced requirements on banks to make switching simpler and easier, including helping you choose who to bank with and make the switching process easy and simple."
        },
        {
            "heading": 2,
            "text": "Helping you choose who to bank with"
        },
        {
            "text": "The latest retail banking service quality results are published. At the CMA we’ve required banks to publish the results of these surveys in their branches and on their websites and mobile apps. These survey results provide people with reliable information about the quality of service that banks offer and rank different banks against each other."
        },
        {
            "text": "This information makes it easier to find out if you’d be better off somewhere else. The survey results are based on customers’ willingness to recommend their bank to friends, family or colleagues. These are published separately for personal current accounts and business current accounts."
        },
        {
            "heading": 2,
            "text": "Making the switching process easy and simple"
        },
        {
            "text": "We also required improvements to be made to the Current Account Switching Service (CASS). If you’ve found another bank that could give you a better deal, CASS helps to make the process of switching much simpler. This free service is available to anyone with a personal or business current account in the UK. This service means that banks have to transfer your financial arrangements from the old bank to the new one for you, so you don’t have the hassle of having to sort that out yourself."
        },
        {
            "text": "Check the list of participating banks and building societies to make sure you can use the Current Account Switch Service."
        }
    ]
}