{
    "url": "https://nationalscreening.blog.gov.uk/2026/01/13/consultation-opens-on-evidence-relating-to-screening-for-copd/",
    "title": "Consultation opens on evidence relating to screening for COPD",
    "authors": [
        "Peggie Huangfu"
    ],
    "categories": [
        "Adult screening"
    ],
    "pub_date": "2026-01-13T08:54:23+00:00",
    "content": [
        {
            "text": "The UK National Screening Committee (UK NSC) has opened a consultation on evidence relating to screening for Chronic Obstructive Pulmonary Disease (COPD) in the general adult population.  "
        },
        {
            "text": "COPD is one of the health conditions the committee reviews regularly for evidence relating to population screening. "
        },
        {
            "text": "Evidence maps are typically the first step in the UK NSC process of reviewing evidence. We are asking individuals and organisations to provide feedback on the findings and conclusions of a 2025 evidence map on screening for COPD in adults. "
        },
        {
            "text": "The evidence map was commissioned to review literature on the topic published since our last evidence review in 2018.   "
        },
        {
            "text": "The 2025 evidence map concludes that the volume and type of new evidence related to screening for COPD in adults is currently insufficient to justify more in-depth work at this time. It recommends that screening for COPD should be re-considered in 3 years’ time. "
        },
        {
            "heading": 2,
            "text": "How to respond"
        },
        {
            "heading": 2,
            "text": "About COPD"
        },
        {
            "text": "COPD is a group of progressive lung conditions characterised by the inflammation and irreversible damage to pulmonary air passages that gradually reduces airflow into the lungs. The main symptoms of COPD include increasing breathlessness when active and persistent coughs with phlegm. However, airflow obstruction without symptoms is also common in COPD. "
        },
        {
            "text": "If left untreated, these lung conditions will progressively impair quality of life, resulting in long-term disabilities and increased mortality. Smoking tobacco has been shown to be the main cause of COPD and is responsible for 80% to 90% of cases. Epidemiological studies have found that 15% to 50% of all smokers will develop COPD. "
        },
        {
            "heading": 2,
            "text": "The 2025 evidence map"
        },
        {
            "text": "The 2025 evidence map identifies some new evidence published since the 2018 review, including evidence on:"
        },
        {
            "heading": 2,
            "text": "Keep up to date"
        },
        {
            "text": "The UK NSC blog provides up to date news from the UK NSC. You can register to receive updates direct to your inbox, so there is no need to keep checking for new articles. If you have any questions about this blog article, or about the work of the UK NSC, please email uknsc@dhsc.gov.uk. "
        }
    ]
}