{
    "url": "https://defrafarming.blog.gov.uk/2026/01/13/mandatory-sheep-carcase-classification-and-price-reporting-introduced/",
    "title": "Mandatory sheep carcase classification and price reporting introduced",
    "authors": [
        "The Team"
    ],
    "categories": [
        "Supply chain"
    ],
    "pub_date": "2026-01-13T11:53:57+00:00",
    "content": [
        {
            "text": "A mandatory, standardised system for classifying sheep carcases and reporting prices is now in force. "
        },
        {
            "text": "The new system will help ensure sheep carcases are classified in a fair and consistent way, bringing the sheep sector into line with beef and pork, where similar systems have been used for many years."
        },
        {
            "text": "By increasing transparency in the market, farmers will have a better understanding of how their livestock is graded and priced."
        },
        {
            "text": "The sheep classification guidance can be found on GOV.UK. "
        },
        {
            "heading": 2,
            "text": "Background"
        },
        {
            "text": "Some abattoirs have, for many years, used sheep carcase classification systems and have also chosen to report prices to the Agriculture and Horticulture Development Board (AHDB) on a voluntary basis."
        },
        {
            "text": "However, the standards used for trimming and presenting carcases for classification and weighing have varied between abattoirs."
        },
        {
            "text": "This has meant that carcases of similar quality could be presented, weighed and paid for differently across the sector, making weights and prices harder to compare."
        },
        {
            "text": "As a result, sheep farmers have not always had clear or consistent information to help them understand how their animals were valued, negotiate prices, or make informed decisions for their businesses."
        },
        {
            "text": "A targeted consultation with stakeholders in spring 2024 confirmed strong industry support for standardising sheep carcase classification."
        },
        {
            "text": "We worked closely with industry to design regulations that are proportionate and workable. The regulations reflect the seasonal nature of lamb production and the way the sheep processing industry operates."
        },
        {
            "text": "Most processors already use some form of carcase classification, often as part of how they pay farmers. "
        },
        {
            "text": "While there will be some transition costs, these are expected to be limited, as classifiers are already in place and will mainly need training to apply the new, standardised system."
        },
        {
            "heading": 2,
            "text": "The new system"
        },
        {
            "text": "As of yesterday (12 January 2026), abattoirs in England that process 2,000 or more sheep per week, calculated as a rolling annual average, must register with the Rural Payments Agency (RPA) and follow the new regulations."
        },
        {
            "text": "Businesses that slaughter between 1,000 and 1,999 sheep per week can choose to register for the scheme on a voluntary basis."
        },
        {
            "text": "Mandatory classification applies to carcases from sheep aged under 12 months. These carcases will be classified using a detailed grid based on two criteria:"
        },
        {
            "text": "These are the same principles already used for beef and pork classification."
        },
        {
            "heading": 2,
            "text": "Roles and responsibilities"
        },
        {
            "text": "Carcases must be assessed by a licensed classifier, who assigns a grade to each carcase based on the criteria set out above. "
        },
        {
            "text": "Classifiers must be trained and certified to apply the grading standards consistently, and abattoirs are responsible for making sure their classifiers are properly qualified."
        },
        {
            "text": "Abattoirs that process sheep are responsible for carrying out classification in line with the regulatory requirements and for reporting grading and prices to the AHDB and to the sheep supplier. "
        },
        {
            "text": "The data will be anonymised, aggregated and published to provide a clearer picture of price trends across the sector."
        },
        {
            "text": "Abattoirs must keep records of classification results, weighing data and price information. They must also keep evidence showing that carcases have been correctly identified, presented, weighed, categorised and labelled in line with the regulations."
        },
        {
            "text": "These records must be available to the RPA if requested. Keeping records clear and accurate will help make checks straightforward and support confidence in the price reporting system."
        },
        {
            "text": "While processors are responsible for classification and reporting, the information produced will help farmers better understand how their animals are graded and priced. "
        },
        {
            "text": "This clearer, more consistent information will support better-informed decisions on breeding, finishing and marketing, without revealing commercially sensitive details."
        },
        {
            "text": "The RPA is responsible for registering businesses, monitoring compliance and enforcing the regulations for both classifiers and abattoirs. "
        },
        {
            "text": "If requirements are not met, the regulations allow for enforcement action and penalties."
        },
        {
            "heading": 2,
            "text": "Automated systems"
        },
        {
            "text": "The rules allow for automated sheep carcase classification, but these systems will need separate approval."
        },
        {
            "text": "Applications to use automated systems can be considered from 12 February 2027. Until then, sheep carcases must be classified manually by licensed classifiers."
        },
        {
            "text": "Any automated system will need to show that it can produce results that are as reliable and consistent as manual classification before it can be approved."
        },
        {
            "heading": 2,
            "text": "Learn more "
        },
        {
            "text": "Improving fairness across the food supply chain is an important government priority, and mandatory sheep carcase classification is one part of that wider work."
        },
        {
            "text": "If you’d like to learn more about the wider work under way to improve supply chain fairness, you can listen to our podcast with the Agricultural Supply Chain Adjudicator, Richard Thompson, or read our posts on the subject."
        },
        {
            "text": "You can also subscribe to the Farming blog to receive updates from the Farming and Countryside team."
        }
    ]
}