{
    "url": "https://publicguardian.blog.gov.uk/2026/01/13/power-of-attorney-stories-justine/",
    "title": "Power of Attorney Stories: Justine",
    "authors": [
        "harryfortuna"
    ],
    "categories": [
        "Future planning",
        "lasting power of attorney",
        "LPA",
        "Uncategorized",
        "YourVoiceYourDecision"
    ],
    "pub_date": "2026-01-13T10:00:00+00:00",
    "content": [
        {
            "text": "[English] - [Cymraeg]"
        },
        {
            "text": "A lasting power of attorney (LPA) allows you to nominate someone you trust, known as an attorney, to step in if you lack the mental capacity to make certain decisions yourself. They are legal documents that cover decisions about health and welfare, or property and finance. "
        },
        {
            "text": "Justine, 54, from Suffolk, knows first-hand how important a lasting power of attorney can be. Despite having witnessed countless in her role as a legal assistant, her mother’s LPA – created before difficult surgery – carried a whole new meaning. Three years later, Justine continues to be her mother's voice in the outside world – making consensual decisions, arranging appointments and protecting her autonomy.  "
        },
        {
            "text": "Thanks to her experience, Justine is now a powerful advocate for LPA protection at any age. She spoke to us about her journey into attorney-hood, the changes it inspired, and the comfort it still brings.  "
        },
        {
            "text": "Twenty years ago, the word ‘attorney’ used to conjure up images of power suits, gavels and powder-white wigs in my mind. I bet for many, it still does! I’d never heard of an LPA back then and couldn’t possibly have known what a significant term it would become for me (both personally and professionally). Now, I can’t think of being an attorney without thinking of Mum – and what a privilege it is to have her think of me in return.  "
        },
        {
            "text": "Oftentimes, we tease each other that I was her only choice. Sadly, we lost Dad in 2000, and any other family have long since passed away. Despite being “stuck with me” (thanks, Mum!), she knows I’m as strong an advocate for her as any. I hope I do Dad proud in that respect.  "
        },
        {
            "text": "We set up the lasting power of attorney just before some scheduled surgery. It went really well, thankfully, but like a lot of these things, it revealed some complications. Her left hip had turned to cotton wool, and any kind of knock or fall could lead to something far more serious. We knew then that life would always look a little differently for Mum, and before long, she became almost entirely housebound. She hasn’t lost mental capacity in any sense - she’s still sharp as anything - but that doesn’t make her need for an attorney any less desperate. Thanks to her LPA, I can now speak on her behalf in a world she can’t always access.  "
        },
        {
            "text": "I remember being in the hospital with her not long after the operation, and I was asked if a power of attorney had been set up. I felt so proud to say ‘yes’. As soon as we scanned it over, all the nurses and doctors then spoke to us both. I could see just from Mum’s face how much me being there reassured her and soothed any worries.  "
        },
        {
            "text": "That's what an LPA is all about for me. In my professional capacity, I watch so many clients uncurl their shoulders and let out a little sigh of relief when they put that pen to paper. I saw the exact same thing in Mum that day. I don’t think there should be an age limit on that kind of comfort.  "
        },
        {
            "text": "I go running with a local club a few times a week, and it’s such a supportive community to be a part of.  We’ve got members ranging from 18 to even 80, and you hear so many incredible stories while you’re out there. We’re definitely a walk-and-talk kind of group! However, these conversations can often be a harsh reminder that life happens, regardless of age – be it surgery, mental health struggles, accidents or illness. I know, and they now do too, that an LPA could make all of these circumstances so much easier to manage.  "
        },
        {
            "text": "I’ve witnessed hundreds of LPAs over the years, and every situation is so unique. I have clients with dementia or Alzheimer's – which is what we assume to be the norm – but their choices and decisions are all totally individual. Not a single LPA is the same. Which is why it’s so important to protect your voice while you still can.  "
        },
        {
            "text": "If I could only give one piece of advice? Don’t wait. We didn’t for Mum, and it’s the best decision she ever made.  "
        },
        {
            "text": "Justine and her mother are one of the many families across England and Wales that have made an LPA. "
        },
        {
            "text": "It's never too early to talk about lasting powers of attorney with someone you trust. Start a conversation today. "
        },
        {
            "text": "Find out more at  https://powerofattorney.campaign.gov.uk "
        },
        {
            "text": "[English] - [Cymraeg]"
        },
        {
            "heading": 1,
            "text": "Straeon Atwrneiaeth: Justine"
        },
        {
            "text": "Mae atwrneiaeth arhosol (LPA) yn caniatáu i chi enwebu rhywun rydych chi’n ymddiried ynddo, a elwir yn atwrnai, i gamu i mewn os nad oes gennych alluedd meddyliol i wneud rhai penderfyniadau eich hun. Dogfennau cyfreithiol ydyn nhw sy’n ymdrin â phenderfyniadau ynghylch iechyd a lles, neu eiddo a chyllid. "
        },
        {
            "text": "Mae Justine, 54, o Suffolk, yn gwybod yn iawn pa mor bwysig y mae atwrneiaeth arhosol yn gallu bod. Er iddi weld llu ohonynt yn ei swydd fel cynorthwyydd cyfreithiol, roedd i atwrneiaeth arhosol ei mam - a grëwyd cyn llawdriniaeth anodd - ystyr cwbl newydd. Dair blynedd yn ddiweddarach, mae Justine yn dal i fod yn llais i’w mam yn y byd y tu allan - gan wneud penderfyniadau cydsyniol, trefnu apwyntiadau a diogelu ei hannibyniaeth.  "
        },
        {
            "text": "Diolch i'w phrofiad, mae Justine bellach yn eiriolwr pwerus dros warchodaeth Atwrneiaeth Arhosol yn unrhyw oed. Bu’n siarad gyda ni am ei siwrnai i fod yn atwrnai, y newidiadau y mae wedi’u hysgogi, a'r tawelwch meddwl mae’n ei roi iddi o hyd.  "
        },
        {
            "text": "Ugain mlynedd yn ôl, roedd y gair 'atwrnai' yn arfer creu delweddau o siwtiau awdurdodol, morthwylion llys a wigs gwyn yn fy meddwl. Mi rydw i’n siŵr bod hynny dal yn wir i lawer! Doeddwn i heb glywed am atwrneiaeth arhosol bryd hynny ac allwn i ddim fod wedi gwybod term mor bwysig a fyddai i mi (yn bersonol ac yn broffesiynol). Nawr, alla i ddim meddwl am fod yn atwrnai heb feddwl am Mam - ac mae'n fraint ei chael hithau i feddwl amdanaf finnau hefyd.  "
        },
        {
            "text": "Yn aml, rydyn ni'n pryfocio ein gilydd mai fi oedd ei hunig ddewis. Yn anffodus, mi wnaethom golli Dad yn 2000, ac mae unrhyw deulu arall wedi marw ers tro. Er nad oes ganddi “ddim dewis ond fi” (diolch, Mam!), mae’n gwybod fy mod cystal eiriolwr iddi ag unrhyw un arall. Dwi’n gobeithio y byddai Dad yn falch ohonof yn hyn o beth.  "
        },
        {
            "text": "Mi wnaethom drefnu’r atwrneiaeth arhosol cyn llawdriniaeth yr oedd mam ei hangen. Mi aeth pethau’n dda iawn, diolch byth, ond fel gyda llawer o'r pethau hyn, mi wnaeth ddatgelu cymhlethdodau. Roedd ei chlun chwith wedi troi'n wlân cotwm, a gallai unrhyw fath o gnoc neu gwymp arwain at rywbeth llawer mwy difrifol. Roedden ni'n gwybod bryd hynny y byddai bywyd wastad yn edrych ychydig yn wahanol i Mam, a chyn bo hir, roedd hi bron yn gwbl gaeth i'r tŷ. Dydy hi heb golli dim o’i galluedd meddyliol - mae hi’n dal mor siarp ag erioed - ond nid yw hynny'n golygu bod ganddi lai o angen am atwrnai. Diolch i’w hatwrneiaeth arhosol, rydw i nawr yn gallu siarad ar ei rhan mewn byd sydd ddim bob amser yn hygyrch iddi hi.  "
        },
        {
            "text": "Rydw i’n cofio bod yn yr ysbyty gyda hi yn fuan ar ôl y llawdriniaeth, a gofynnwyd imi a oeddem wedi sefydlu atwrneiaeth. Roeddwn i'n teimlo mor falch o ddweud ein bod ni. Cyn gynted ag y gwnaethom ei sganio draw atynt, dechreuodd y nyrsys a'r meddygon siarad gyda'r ddwy ohonom.  Roeddwn i'n gallu gweld oddi wrth wyneb Mam gymaint roedd y ffaith fy mod i yno yn rhoi tawelwch meddwl iddi ac yn lleddfu ei phryderon.  "
        },
        {
            "text": "Dyna, i mi, ydy pwrpas atwrneiaeth arhosol. Yn fy swydd broffesiynol, rwy'n gwylio cynifer o gleientiaid yn cael cymaint o ryddhad ar ôl arwyddo’r darn papur holl bwysig. Mi welais i’r un peth yn union yn Mam y diwrnod hwnnw. Dydw i ddim yn meddwl y dylid rhoi terfyn oedran ar y math hwnnw o dawelwch meddwl.  "
        },
        {
            "text": "Rydw i’n mynd i redeg gyda chlwb lleol ychydig o weithiau'r wythnos, ac mae'n gymuned mor gefnogol i fod yn rhan ohoni.  Mae gennym ni aelodau sy'n amrywio o 18 i 80 hyd yn oed, ac rydych chi'n clywed cymaint o straeon anhygoel pan fyddwch chi allan yna. Rydyn ni'n bendant yn grŵp cerdded a siarad! Fodd bynnag, mae'r sgyrsiau hyn yn aml yn gallu ein hatgoffa bod bywyd yn digwydd, beth bynnag fo'n hoed - boed hynny'n llawdriniaeth, yn bryderon iechyd meddwl, yn ddamweiniau neu'n salwch. Rydw i’n gwybod, ac maen nhw'n awr yn gwybod, y gallai Atwrneiaeth Arhosol ei gwneud yn llawer haws ichi ddelio â’r holl amgylchiadau hyn.  "
        },
        {
            "text": "Rydw i wedi gweld cannoedd o atwrneiaethau arhosol dros y blynyddoedd, ac mae pob sefyllfa mor unigryw. Mae gen i gleientiaid sydd â dementia neu Alzheimer's - sef yr hyn rydyn ni'n tybio yw'r norm - ond mae eu dewisiadau a’u penderfyniadau i gyd yn gwbl unigol. Does dim un atwrneiaeth arhosol yr un fath. A dyna pam ei bod mor bwysig diogelu eich llais tra bo chi’n dal i allu gwneud hynny.  "
        },
        {
            "text": "Pe bawn i ond yn gallu rhoi un darn o gyngor? Peidiwch ag oedi. Wnaethon ni ddim oedi gyda Mam, a dyna’r penderfyniad gorau iddi hi ei wneud erioed.  "
        },
        {
            "text": "Mae Justine a’i mam yn un o’r llu o deuluoedd ledled Cymru a Lloegr sydd wedi gwneud atwrneiaeth arhosol. "
        },
        {
            "text": "Dydy hi byth yn rhy gynnar i siarad am atwrneiaeth arhosol gyda rhywun rydych chi’n ymddiried ynddo. Dechreuwch sgwrs heddiw. "
        },
        {
            "text": "Mae rhagor o wybodaeth ar gael yn  https://powerofattorney.campaign.gov.uky/home-page/"
        }
    ]
}