{
    "url": "https://companieshouse.blog.gov.uk/2021/10/27/certificates-and-certified-document-copies-from-companies-house/",
    "title": "Certificates and certified document copies from Companies House",
    "authors": [
        "Rachel Cooper - Service Manager, Get Company Information Service"
    ],
    "categories": [
        "Company guidance"
    ],
    "pub_date": "2021-10-27T11:16:11+01:00",
    "content": [
        {
            "text": "After you’ve registered your company with Companies House, you’ll be sent a certificate of incorporation. This document contains your company’s vital information, including:"
        },
        {
            "text": "Your certificate serves as evidence that your company has been duly registered at Companies House. It should be kept safely as it may be required for opening a bank account, for loan applications or if you’re selling your company."
        },
        {
            "text": "If you have mislaid your certificate you can download a digital copy on our Find and update company information service."
        },
        {
            "text": "When the scanned copy of your incorporation document is displayed, you can print it or save it to your computer."
        },
        {
            "heading": 2,
            "text": "Certified documents"
        },
        {
            "text": "If you require a copy of a document from the company’s filing history to be certified, you must:"
        },
        {
            "text": "Using the Find and update company information service, search for your company by name or number, find your company from the list provided and select the more tab from the company overview screen. Here you will be able to order a certified document. The standard service cost is £15 and should be processed within 4 working days."
        },
        {
            "heading": 2,
            "text": "Certified certificate"
        },
        {
            "text": "This document can be used to prove that a company is incorporated, and that no action is being taken to remove the company from the register."
        },
        {
            "text": "This document is often required if you’re looking to conduct business overseas. It might be needed by the official register of the foreign territory (the equivalent of Companies House)."
        },
        {
            "text": "Included on the certificate is:"
        },
        {
            "text": "Additional information such as the registered office address, company directors, company secretary and any company name changes can be added."
        },
        {
            "text": "You can also request that the certificate includes a statement of good standing, but this will not be included if for example:"
        },
        {
            "heading": 2,
            "text": "Ordering a certified certificate"
        },
        {
            "text": "To order a certified certificate, you must:"
        },
        {
            "text": "Using the Find and update company information service, search for your company by name or number, find your company from the list provided and select the more tab from the company overview screen. Here you will be able to order a certified certificate. The standard service cost is £15 and should be processed within 4 working days."
        },
        {
            "heading": 2,
            "text": "Keeping your company details up to date"
        },
        {
            "text": "Before ordering a certified certificate, it’s worth checking that all your company details are correct and up to date."
        },
        {
            "text": "Remember, company directors have a legal responsibility to tell Companies House about changes to their company, so that the details are accurate and current. Examples that should be notified are new appointments or resignations of directors or company secretaries, and changes to their personal circumstances."
        }
    ]
}