{
    "url": "https://deframedia.blog.gov.uk/2021/10/27/environment-bill-storm-overflows-amendment-coverage/",
    "title": "Environment Bill storm overflows amendment coverage",
    "authors": [
        "Defra Press Office"
    ],
    "categories": [
        "Weekly stories"
    ],
    "pub_date": "2021-10-27T11:36:54+01:00",
    "content": [
        {
            "text": "There has been widespread coverage including in The Guardian, Financial Times, Daily Mail, Times, Independent, Daily Mirror, Telegraph, i news, Daily Express, the Sun and the Evening Standard of the Government’s announcement that the Environment Bill will be further strengthened to tackle water pollution following an amendment in the House of Lords yesterday."
        },
        {
            "text": "The move will see a duty enshrined in law to ensure water companies secure a progressive reduction in the adverse impacts of discharges from storm overflows. The story has also been  covered on BBC News at 6 and 10, Channel 4 News, BBC Radio 4’s Farming Today, and BBC Breakfast."
        },
        {
            "text": "Earlier this year the Government published a new set of strategic priorities for the industry’s financial regulator Ofwat, which set out the direction from government that water companies must take steps to “significantly reduce storm overflows” and that the regulator should ensure funding should be approved for them to do so. This publication – known as the Strategic Policy Statement - strongly influences investment decisions and is one of Government’s key tools in driving action from water companies."
        },
        {
            "text": "This amendment will enshrine that expectation in law, to further align the Bill with the government’s strategic priorities for the sector and help to drive action from industry."
        },
        {
            "text": "Environment Secretary George Eustice said:"
        },
        {
            "text": "The Government amendment bolsters a raft of measures already being taken by Government through the Environment Bill to deliver progressive reductions in harm caused by storm overflows."
        },
        {
            "text": "Moreover, the new amendment will serve to inject additional regulatory backing to existing Government priorities to reduce storm overflows."
        },
        {
            "text": "Our Environment Bill will ensure we deliver the most ambitious environmental programme of any country - transforming how we protect our natural environment, make better use of our resources and clean up our air and water."
        },
        {
            "text": "The Government has previously made amendments that set a new, historic legally-binding target to halt species decline by 2030 and allow ministers to introduce charges on all single-use items, not just plastics, helping to cut waste and put an end to throwaway culture. New measures will also help landowners secure long-term environmental benefits through conservation covenants and better protect ancient woodland in England."
        },
        {
            "text": "The Government will bring forward the amendment in the House of Commons when the Bill returns there for the next stage of passage."
        },
        {
            "text": "Follow Defra on Twitter, and sign up for email alerts here."
        }
    ]
}