{
    "url": "https://environmentagency.blog.gov.uk/2021/10/27/flying-high-using-drones-to-collect-evidence-of-illegal-waste-sites/",
    "title": "Flying high! Using drones to collect evidence of illegal waste sites",
    "authors": [
        "elenaholmes"
    ],
    "categories": [
        "Regulated industry",
        "Waste"
    ],
    "pub_date": "2021-10-27T13:48:16+00:00",
    "content": [
        {
            "text": "Kim Mynard, Regulatory Officer at the Environment Agency, discusses harnessing the power of drone technology to help take action against those causing harm to our environment. "
        },
        {
            "text": "When I joined the Environment Agency about two and a half years ago, little did I know that I would become a pilot!"
        },
        {
            "text": "As a Regulatory Officer, my role involves regulating larger industrial processes within the food and drink; landfills; biowaste and combustion sectors."
        },
        {
            "text": "Some of the sites I inspect can be very large and can also be quite difficult to access due to being confined spaces or hazardous in nature. For example, the tipping face of a landfill is no place to be standing!"
        },
        {
            "text": "So how did this role lead to my becoming a pilot? Given the scale of some sites we regulate and access and safety issues at others, the Environment Agency had been looking into ways it could keep its Officers safe while carrying out their regulatory work and harness technology to help us get quicker at taking tough action against those causing harm to our environment. Drones were the answer. Now we have Officers up and down the country fully trained to pilot drones."
        },
        {
            "text": "At the start of 2021 there was an opportunity to increase the number of pilots and I volunteered to be trained up. After successful completion of the training and assessment I became a qualified UAS (unmanned aircraft system) pilot."
        },
        {
            "text": "So far I have undertaken 24 flights for a variety of purposes including routine compliance inspections at landfills; anaerobic digestion and compost sites; food and drink sites; chemicals manufacturer and combustion sites. The drone is also useful to support other work the Environment Agency does, such as flood and coastal risk management; I have flown the drone to inspect the condition of the Boston Barrier, and supported our fisheries teams in their management of rivers by flying the drone to assess weed growth."
        },
        {
            "text": "The drone is proving to be particularly useful for collecting evidence of illegal waste sites for our Environmental Crime Teams.  From the air we can see the whole site including skips and piles of waste stored behind buildings or trees that could be hidden from view during a visit on the ground."
        },
        {
            "text": "Using a drone to collect images from illegal waste sites is safer for Officers visiting hostile sites as we do not need to be physically on the site to collect the images. The drone has a powerful lens that is able to zoom in to areas to identify waste types and vehicle registration plates. We also have a drone that has thermal imaging capabilities that enables us to calculate volumes of waste being stored on site."
        },
        {
            "text": "Footage collected on these drones means we can provide clear and compelling evidence of illegal waste activities that we can use in court cases."
        },
        {
            "text": "I’m proud to work for the Environment Agency and be able to contribute towards the protection of our environment, keeping check on those we issue permits to and gathering evidence against those who break the rules."
        },
        {
            "text": "You can help protect our environment too. If you suspect illegal waste activities are happening near you, please do report them. You can do this anonymously via Crimestoppers: 0800 555 111 or online: https://crimestoppers-uk.org/give-information/forms/give-information-anonymously"
        },
        {
            "text": " "
        }
    ]
}