{
    "url": "https://nda.blog.gov.uk/gdf-supplier-day-we-absolutely-need-you/",
    "title": "GDF Supplier Day – we need you",
    "authors": [
        "Paul Hinson - RWM Commercial Manager"
    ],
    "categories": [
        "Supply Chain",
        "Waste management"
    ],
    "pub_date": "2021-10-27T14:31:03+01:00",
    "content": [
        {
            "heading": 3,
            "text": "Finding out more"
        },
        {
            "text": "We were really pleased to see that so many suppliers were keen to engage with us about long-term opportunities on the UK geological disposal programme for radioactive waste."
        },
        {
            "text": "Over 130 delegates turned up at the venue in Birmingham to find out more about what the future could hold in terms of business opportunities as we move ahead with work to develop a Geological Disposal Facility (GDF)."
        },
        {
            "heading": 3,
            "text": "Incredibly informative"
        },
        {
            "text": "There was a real buzz to the atmosphere and it was incredibly informative for us to simply listen and explore how we can work together with suppliers to shape the long-term programme. We need to frame procurement so the commercial arrangements bring benefits to all parties - we absolutely need suppliers!"
        },
        {
            "text": "This is an extremely long-term programme, stretching for at least the next century, and is a  £multi-billion Nationally Significant Infrastructure Project for the UK."
        },
        {
            "text": "Design and delivery of a GDF is, in addition, the First of a Kind in the sense that it’s a UK nuclear design and construction programme that’s based on community consent."
        },
        {
            "text": "We structured the day to inform the market about the GDF programme and the long-term commercial opportunities, but we also wanted to engage more directly on important topics such as programme integration, design , major permissions and site characterisation."
        },
        {
            "heading": 3,
            "text": "Collaborative model"
        },
        {
            "text": "We’ll be delivering through an integrated collaborative model, the Integrated Design and Development Partner (IDDP) , where capability, behaviours, technology and the supply chain value proposition will be principal drivers in our decision-making. Sustainability and social value will also be critical drivers for future IDDP partners."
        },
        {
            "text": "The morning included presentations and talks to set the background context around the GDF siting process and our ongoing work with communities across the country. In the afternoon, we held breakout sessions to allow for deeper discussions on key topics."
        },
        {
            "text": "Teams from our programme, technical, siting and commercial sections spoke about broad-ranging topics include the permitting and implementation requirements to ensure safe, secure and sustainable long-term solutions for disposing of radioactive waste deep below the ground."
        },
        {
            "text": "The event will inform and optimise commercial arrangements as we move forward with work."
        },
        {
            "text": "It also marks the beginning of our long-term engagement with the supply chain, and we’ll be following up with individual meetings as well as future supply chain events where we can further discuss requirements for the partners, the process and timetable."
        },
        {
            "text": "For more information, contact Paul Hinson, paul.hinson@nda.gov.uk, or Simon Scott, simon.scott@nda.gov.uk"
        },
        {
            "heading": 3,
            "text": "What suppliers said"
        },
        {
            "text": "Supplier feedback included:"
        }
    ]
}