{
    "url": "https://civilservice.blog.gov.uk/2021/10/27/me-and-the-pink-elephant/",
    "title": "Me and the pink elephant ",
    "authors": [
        "Alexia Cowley, Senior Communication Officer/Co-chair of the FCDO Mental Health, Active Listening & Wellbeing network, FCDO"
    ],
    "categories": [
        "A great place to work",
        "A Modern Civil Service",
        "An Ambitious Civil Service",
        "An Innovative Civil Service"
    ],
    "pub_date": "2021-10-27T08:41:56+00:00",
    "content": [
        {
            "heading": 3,
            "text": "To mark OCD Week, Alexia Cowley myth-busts a condition which is often misunderstood and provides top tips for anyone experiencing Obsessive Compulsive Disorder."
        },
        {
            "text": "I’m going to ask you to try out one thing.  Don’t think of a pink elephant. I guarantee that every single reader immediately saw a pink elephant in their head, because that’s how our brains work. "
        },
        {
            "text": "You may have tried avoiding the pink elephant by thinking of something else. That’s what it’s like having Obsessive Compulsive Disorder (OCD). A thought enters your head and relentlessly plays like a broken record, over and over again. "
        },
        {
            "text": "The more you try not to think of a thought, it comes back stronger until eventually this urge can manifest into compulsions – basically rituals which (temporarily) relieve the anxiety. These can be physical or mental. But it’s a catch-22, because the more you try to avoid, suppress or replace a thought, it bounces back and you’re back at square one."
        },
        {
            "text": "So there I am, on the edge of my bed, one dark January morning (compounded by a national lockdown). I reached a point where I just couldn’t cope with my thoughts anymore and the only viable option left was to call my doctor.  "
        },
        {
            "text": "When the receptionist asked me the reason for a GP appointment, a lump in my throat emerged but I managed to mutter, “I wasn’t feeling like myself.” "
        },
        {
            "text": "Within an hour, my GP called me, asking a range of questions on my mood. I can’t tell you how nervous to the pit of my stomach I was. For a few minutes, I couldn’t speak through my tears, but she reassured me: “You’ve done the right thing asking for help. The first step is always the hardest.” And she was right."
        },
        {
            "heading": 4,
            "text": " Triple whammy"
        },
        {
            "text": "Fast-forward a few mental health assessments, I was diagnosed with OCD towards the top end of ‘severe’ on OCD, anxiety and depression. A triple whammy! On my 28th birthday, I queued in Boots to collect my first batch of antidepressants. It felt like it couldn’t get much worse - and luckily, it didn’t."
        },
        {
            "text": "Ironically, even though I’m a trained Mental Health First Aider, I hadn’t clocked that OCD is much broader than cleaning, which just goes to show that the condition is still heavily misunderstood, even for those who experience it. "
        },
        {
            "heading": 4,
            "text": " Voice for others"
        },
        {
            "text": "OCD takes many shapes and forms, so I won’t go into detail. Instead, I want to share some of my personal experiences, because I want to be a voice for others who may feel afraid to speak up about their own experience with it."
        },
        {
            "text": "I see my OCD as separate to me. ‘Rational me’ knows that I turned my straighteners off, or locked the door, but ‘OCD me’ finds the need to do laps around the house checking and rechecking until “it feels right”."
        },
        {
            "text": "It’s the same for driving. I’d start to actually drive around roads I’d just driven down to check I hadn’t unknowingly hit someone - because in my head, that would mean that if I did by accident, I’d lose my job and end up in prison. That’s how quickly OCD can take grip of you, spiral, and lose control. "
        },
        {
            "heading": 4,
            "text": "Epiphany"
        },
        {
            "text": "The worst part is, once you feel like you’ve ‘cracked’ a theme, a new one creeps in. You wouldn’t believe how draining this is, and how much time I’ve lost worrying about something which has never happened. So when I found out I had OCD, I had an epiphany that I was, in fact, not going to be put in prison for a crime I never committed (this sounds bonkers) – but in actual fact, I was just very unwell."
        },
        {
            "text": "To cut a long story short, I had regular Cognitive Behavioural Therapy sessions (exposure therapy) from January right through to September this year. They were intense, draining, and heavy, but they worked. I saw things through a different lens. "
        },
        {
            "text": "I’m not quite there yet, but mental health is a journey, full of real ups and downs. You can get off the OCD struggle bus with the right help, the right treatment plan and the right support and people around you. "
        },
        {
            "text": " "
        }
    ]
}