{
    "url": "https://cspl.blog.gov.uk/2021/10/27/review-of-the-uk-governments-draft-electoral-commission-strategy-and-policy-statement/",
    "title": "Review of the UK government’s Draft Electoral Commission Strategy and Policy Statement",
    "authors": [
        "Dr Alistair Clark"
    ],
    "categories": [
        "Elections"
    ],
    "pub_date": "2021-10-27T12:00:36+01:00",
    "content": [
        {
            "text": "Dr Alistair Clark is reader in politics at Newcastle University and gave evidence to the Committee's July report on Regulating Election Finance. In this guest blog, he looks at the potential impact of the government’s recently published illustrative Electoral Commission Strategy and Policy Statement."
        },
        {
            "text": "The Draft/Illustrative Electoral Commission Strategy and Policy Statement published by the UK government is a curious document. It seems, initially, a restatement of things the Electoral Commission already does alongside some general statements of the desirability of free and fair elections. Yet, it repays careful re-reading. There are concerning aspects which could potentially be used to impinge upon the independence of the Electoral Commission."
        },
        {
            "heading": 2,
            "text": "Commission Independence  "
        },
        {
            "text": "The statement begins by stating that it sets out the government’s views as to what the Electoral Commission’s should prioritise. The central point is not recognised that the Electoral Commission is not like other regulators, existing to deliver government policy, but one where independence from government is vital. Instead, the Statement indicates that the Commission ‘must have regard to’ the government’s core priority functions (paragraphs 2 & 5)."
        },
        {
            "text": "Paragraph 2 offers a nod towards operational independence however. It suggests:"
        },
        {
            "text": "This is unconvincing. The focus on governance and investigative and enforcement decisions appears tightly worded. Immediately before this, there are nine lines setting out the aims of this statement: ‘to provide guidance to which the Commission must have regard in the discharge of their functions’ (author’s italics). Paragraph 5 extends this to ‘must have regard to the Government’s delivery of legitimate executive priorities’. This appears considerably stronger than just offering guidance on priorities. Note also that enforcement activity must ‘have had regard to the statement’. "
        },
        {
            "text": "If the second part of paragraph 2, quoted in the previous paragraph, has any weight, readers of the document might wonder what the point of such a Strategy and Policy Statement is. It’s far from clear, that the Speaker’s Committee, dominated by any governing party and given powers to hold Electoral Commission to the government’s priorities, would be able to resist both using them, and commenting on governance and decisions made by the Commission. Other committees and parliamentarians would almost certainly do the same."
        },
        {
            "heading": 2,
            "text": "Other Linkages and Gaps "
        },
        {
            "text": "A link is made to value for money (paragraph 16). Limiting the resources of regulatory bodies can be a way of influencing their activities. There is a coded but relatively clear direction here, that the Commission must ‘consider[…] carefully the balance between executive priorities in relation to elections as approved by Parliament listed in this statement and their other functions’. The government would clearly like that balance to fall on executive priorities rather than the Commission’s other functions. How this might impact upon resources remains to be seen, but this linkage raises important questions.  "
        },
        {
            "text": "Paragraph 5 also raises the question of how long this statement is valid for, mentioning ‘this parliament’. A successor government, of any party, might choose to do differently. This raises issues about any Statement being under constant review in every parliament, leading to continued uncertainty for the Electoral Commission as priorities change. "
        },
        {
            "text": "There are important gaps in this Statement. It is unclear how the Speaker’s Committee will use any final statement in its oversight of the Electoral Commission. It is also unclear what will happen if the Electoral Commission prioritises its other functions over the government’s priorities, and what sanctions the Speaker’s Committee will have to enforce this document. Worries must remain about the opacity of the Speaker’s Committee’s business in general, and also given its current single-party majority composition. This is contradictory given the accountability, impartiality and transparency the document argues necessary for the Electoral Commission."
        },
        {
            "heading": 2,
            "text": "Conclusion"
        },
        {
            "text": "Ultimately, this statement seems unnecessary. Beyond their role in ensuring transparent, free and fair elections, it is not the role of independent electoral regulators to deliver ‘legitimate executive priorities’. Little in the Statement addresses widely recognised and long-standing problems in the electoral system.  "
        },
        {
            "text": "The Electoral Commission’s functions are established in PPERA 2000 and subsequent acts. The Commission is clearly aware of its functions. It must have regard to all its functions, not just government priorities. While there may be room for improvement, the Commission is already accountable to parliament. The issues the Commission will need to prioritise will evolve over time, possibly rapidly; electoral integrity is a dynamic environment. "
        },
        {
            "text": "The Strategy and Policy Statement therefore seems a clear attempt to influence the Electoral Commission. It will inevitably impinge upon its independence, whatever this statement says to the contrary."
        }
    ]
}