{
    "url": "https://digitalpeople.blog.gov.uk/2021/10/27/supporting-digital-data-and-technology-ddat-professionals-to-progress/",
    "title": "Supporting Digital, Data and Technology (DDaT) professionals to progress",
    "authors": [
        "Laura Billings"
    ],
    "categories": [
        "Capabilities",
        "Digital data and technology",
        "Skills and Learning"
    ],
    "pub_date": "2021-10-27T10:00:12+01:00",
    "content": [
        {
            "text": "The DDaT Capability Team in the Central Digital and Data Office (CDDO) powers digital transformation by ensuring that government has the right people to develop and deliver excellent services for users."
        },
        {
            "text": "We are here to tackle the biggest challenges facing the profession through:"
        },
        {
            "heading": 2,
            "text": "Working in the open"
        },
        {
            "text": "We have mission teams to provide support for civil servants in different stages of their DDaT career, and with different levels of DDaT knowledge requirements."
        },
        {
            "text": "These are:"
        },
        {
            "text": "This post is from the team focused on supporting folks who are already established in DDaT roles. It outlines the challenge as we understand it, our approach and initial recommendations to take forward."
        },
        {
            "text": "We are working in the open as an invite to join us on the journey."
        },
        {
            "heading": 2,
            "text": "The challenge"
        },
        {
            "text": "“DDaT is a relatively young profession that started forming in government in 2015. It has achieved a lot to date, and people in DDaT roles are now increasingly motivated to have the opportunity to implement their creative ideas at scale, via roles in senior leadership. "
        },
        {
            "text": "To accelerate this journey, we need to ensure that there is consistent access to effective learning, and support to develop and apply new skills in all roles. For example, this means ensuring that DDaT professionals can prioritise long term learning over short term delivery, to enable them to progress to the very top of the civil service.”"
        },
        {
            "text": "Jenny O'Connor, Head of DDaT Capability, CDDO"
        },
        {
            "heading": 2,
            "text": "How we are tackling the challenge "
        },
        {
            "text": "We are breaking down our approach to change in two ways."
        },
        {
            "text": "Firstly, we will transform the whole progression route for a single role. Going in depth to tackle all the challenges we know about (and probably some we don’t!) end-to-end. This is a live lab approach to piloting and iterating solutions, learning in practice what works, before scaling across more roles in the DDaT profession."
        },
        {
            "text": "Secondly, we are looking at common challenges for all roles across the profession. Going wide to tackle challenges that we are best placed to make impact on from CDDO."
        },
        {
            "heading": 2,
            "text": "The recommendations"
        },
        {
            "text": "In order to get to this point we:"
        },
        {
            "text": "The recommendations coming from this process are:"
        },
        {
            "heading": 2,
            "text": "Get involved"
        },
        {
            "text": "This is all work in progress. If you would like to get involved you can:"
        }
    ]
}