{
    "url": "https://marinescience.blog.gov.uk/2021/10/27/voyage-of-discovery-rrs-discovery-expedition-to-ascension-island-and-st-helena/",
    "title": "Voyage of Discovery: RRS Discovery Expedition to Ascension Island and St Helena",
    "authors": [
        "Paul Whomersley"
    ],
    "categories": [
        "Oceanography",
        "Policy",
        "Technology",
        "Uncategorized",
        "Vulnerable species"
    ],
    "pub_date": "2021-10-27T05:00:22+01:00",
    "content": [
        {
            "text": "In November 2021, Blue Belt Programme scientists and key partners will depart on a 9000 mile expedition to Ascension Island and St Helena in the South Atlantic Ocean. Currently finalising both the scientific objectives and preparing all of the necessary scientific equipment, the crew will depart Southampton onboard Royal Research Ship (RRS) Discovery on 26 November."
        },
        {
            "text": "The ship is the fourth vessel to bear the name Discovery, the first being the barque-rigged auxiliary steamship built in 1901 which carried Robert Falcon Scott and Ernest Shackleton on their highly successful voyage to the Antarctic. The modern-day RRS Discovery is a purpose-built ocean-going research vessel operated by the Natural Environment Research Council (NERC). RRS Discovery is nearly 100m long, 18m wide and weighs 6000 tonnes. Fitted with the most up-to-date high-tech equipment and sensors, RRS Discovery is the perfect ship to undertake oceanic exploration in remote and challenging environments."
        },
        {
            "text": "Figure 1. RRS Discovery"
        },
        {
            "text": "Adapting to COVID-19"
        },
        {
            "text": "This expedition was originally conceived early in 2020 when our initial planning began with a scheduled sailing date of March 2021, but we all know what happened next…Fast forward to the present day, and our new sailing date is fast approaching."
        },
        {
            "text": "Since the initial plans were developed several things have changed. Due to the potential impacts and risks that COVID-19 could have on an expedition of this type, we will now be sailing from Southampton all the way to Cape Verde, off the west coast of Africa. After refuelling, we will continue our journey to Ascension Island and St Helena."
        },
        {
            "text": "We will spend 10 days around each island, conducting scientific surveys and collecting data. Once completed, we will transit back to Tenerife to disembark. The whole expedition will take approximately 60 days to complete and cover over 9000km, crossing the equator twice."
        },
        {
            "text": "There will be 27 scientists onboard, including colleagues from the Governments of both Ascension Island and St Helena. We will also be supported by members of the RRS Discovery crew, and technical and engineering staff from National Marine Facilities."
        },
        {
            "text": "Figure 2. RRS Discovery  143 transit track"
        },
        {
            "text": "Aims and objectives of the expedition"
        },
        {
            "text": "A main objective of the expedition is to collect new scientific data on how key habitats and species found within the biodiverse and near pristine Exclusive Economic Zones (EEZs) and Marine Protected Areas (MPAs) of both islands function. This increased knowledge will help inform the development of future sustainable management and conservation strategies."
        },
        {
            "text": "Habitats of interest for the expedition will include previously uncharted hydrothermal vents, the Atlantic mid-ocean ridge and a number of unexplored seamounts. These different habitats support a multitude of important species, including cold water corals, tuna, billfish and sharks. Areas previously surveyed will also be revisited. By doing this, we can collect time-series data which will allow scientists and managers to begin assessing any changes identified and relate them to the effectiveness of existing management strategies."
        },
        {
            "text": "Figure 3. Images of relevant species and habitats"
        },
        {
            "text": "Time-series data is particularly key in helping scientists and the Overseas Territories understand the potential impacts of global ocean threats – such as climate change and non-indigenous invasive species – to these marine environments. Building baseline and time-series data will allow us to identify potential changes to these habitats, such as in water temperature or acidity, in the future. Growing this understanding will help Ascension and St Helena, as well as other Territories, to inform the mitigation of these impacts."
        },
        {
            "text": "The Discovery expedition will also be an important opportunity to collect data on compliance and enforcement measures around the islands. For instance, the positional information of other vessels encountered by Discovery will be used to validate remote sensed satellite data that is currently used to monitor Illegal, Unreported and Unregulated fishing (IUU) within the EEZs and MPAs of the islands."
        },
        {
            "text": "During the survey, we’re also excited to share relevant knowledge and experiences with colleagues onboard from both Ascension and St Helena. During the 10 days we spend around the respective islands, training and learning opportunities will be given on a range of sampling activities and a suite of data collection methods. This knowledge exchange will help to build capacity on island for future research activities."
        },
        {
            "text": "What equipment do you need for a marine survey?"
        },
        {
            "text": "This expedition has been months in preparation, and we are now in the final stages of our planning.  A container of specialised equipment will depart from Lowestoft in mid-November and travel to our departure port of Southampton. Alongside technical equipment, it will include essential items ranging from the personal protective equipment we need, to our supply of mince pies and Christmas chocolate…"
        },
        {
            "text": "The wide variety of equipment we’ll use each serve specific purposes which will allow us to fulfil the scientific objectives of the voyage. Specific examples of equipment includes:"
        },
        {
            "text": "A wave glider (an autonomous, unmanned surface vehicle) will also be deployed on missions around the islands to survey pelagic fish abundances by using acoustics to measure the size of shoals. Baited Underwater Remote Video Systems (BRUVS) will also be deployed in the surface waters to assess the presence and abundances of large pelagic species such as sharks and tuna. We will also be mapping the seabed using Multibeam Swath Bathymetry which constructs an image of the seabed using sound."
        },
        {
            "text": "Figure 4. Images of kit and examples of output"
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": "Through this series of blogs and via Blue Belt Programme social media channels, we hope to keep you all updated on how the expedition is progressing, reveal any exciting discoveries we make along the way and introduce you to the crew and life onboard the ship. Please check back to follow our progress, and send through any questions you may have!"
        }
    ]
}