{
    "url": "https://buyingforschools.blog.gov.uk/2023/05/25/a-beginners-guide-to-using-frameworks-for-school-buying/",
    "title": "A beginners’ guide to using frameworks for school buying",
    "authors": [
        "Emily Wignall, Digital Engagement and Information Manager"
    ],
    "categories": [
        "Advice and support"
    ],
    "pub_date": "2023-05-25T10:21:09+01:00",
    "content": [
        {
            "text": "Emily Wignall, Digital Engagement and Information Manager in the DfE’s Schools Commercial Team explains what a framework is and how using one can help your school navigate a legally compliant buying process, whilst saving time and money. "
        },
        {
            "text": "When I joined the DfE Schools Commercial Team last year after working in the private sector, I didn’t know much about frameworks. Having now been in the team for over a year, I’ve learnt all about them and how they help schools purchase goods and services. I’ve attended informative webinars run by the team and heard from school business managers who’ve used DfE approved frameworks. I can safely say they’re not as complicated as they first seemed, and plenty of help is at hand if you need it. I’ve written this blog to share what I have learned, and to hopefully help others better understand what DfE approved frameworks are, how they work, and the benefits of using them.  "
        },
        {
            "heading": 2,
            "text": "An introduction to DfE approved frameworks "
        },
        {
            "text": "The Department for Education currently has over 60 approved frameworks. These frameworks cover everything from books, furniture and catering to energy, facilities and more. Our free Find a framework tool allows school business professionals to find ways to buy goods and services, recommended by the DfE to get the best value for their school. Frameworks are approved by the DfE based on several factors, including but not limited to value for money and ease of use. "
        },
        {
            "heading": 2,
            "text": "Get help buying for schools  "
        },
        {
            "text": "Last year we launched a new, free procurement service for state funded schools in England, called Get help buying for schools. This service aims to help those in schools responsible for buying goods and services to get the best value for money. "
        },
        {
            "text": "If you require more specific or direct help with your buying, you can reach out to our team of procurement experts for support. "
        },
        {
            "heading": 2,
            "text": "What is a framework? "
        },
        {
            "text": "A framework is a commercial agreement put in place with a provider or range of providers, for the supply of an unspecified amount of a product or service, over a specified period. It is the framework providers role to select the suppliers for the framework, based on factors such as best value and best quality. "
        },
        {
            "text": "Framework agreements enable buyers to place orders for services without running lengthy, full tendering exercises, essentially saving time and often money too. Framework agreements are sometimes referred to as umbrella agreements, and making a purchase is known as making a ‘call off’.  "
        },
        {
            "text": "There are two different types of frameworks. Firstly, an arrangement exists with suppliers where terms and prices are fixed at the start, and throughout the duration of the framework. The second option is to run a mini competition under the umbrella of the contract, where prices are determined amongst the suppliers. This will allow a competitive process to provide the best price possible. "
        },
        {
            "heading": 3,
            "text": "How does a Framework work? "
        },
        {
            "text": "The chart below provides on overview of the process in the development and application of a framework. The Public Sector Buying Organisation (PSBO) will use their significant market expertise in developing the specification and discussing the market with possible suppliers. ​ "
        },
        {
            "text": "Using a framework will give you the confidence and assurance of a legally compliant tender process as the PSBO will have conducted the tendering process, ensuring it is compliant with current legislation – this means you do not need to worry about procurement regulations for open competition – you don’t need to get three quotes, for example. ​​ "
        },
        {
            "text": "As a school business professional, you will still have some responsibility. Contract management is an important part of the process and the PSBOs will actively take this on board with suppliers, but you will also need to manage suppliers, ensuring you have a positive and productive relationship with them.​ You will also need to plan ahead - it is not always a quick process. Depending on your requirements, a complex procurement process can still take many months. So, whilst it does ensure the process is compliant and provides value, it is not something that can be done in a matter of days or weeks - planning ahead is vital.  "
        },
        {
            "heading": 3,
            "text": "Key features of a framework "
        },
        {
            "text": "There are several key features that define a framework agreement. For schools, we always expect the framework to be easy to access and suitable - this is something that all DfE approved frameworks are assessed for. Other features include: "
        },
        {
            "heading": 3,
            "text": "Key benefits of a framework "
        },
        {
            "text": "Buying from a framework will usually be quicker and easier than getting bids or quotes yourself because the agreements have already been through a full competitive tender process to get the best value possible. They have been quality checked, meet all procurement compliance requirements, and have draft specifications and help available. They also deliver the advantages of aggregation, which combines similar needs of customers from across the public sector to increase buying power to achieve greater savings than buying alone. In short, using a framework can save you time, money, and hassle.  "
        },
        {
            "heading": 3,
            "text": "Direct award and mini competitions  "
        },
        {
            "text": "There are two ways to buy through a framework. You can make a direct award; this is where a school can place their order with the appointed supplier​. The supplier provides a price as agreed under the framework, and the products/services are delivered to the school, saving time, and making the process easier. "
        },
        {
            "text": "Alternatively, some framework providers may run mini competitions. These will require at least three documents – a specification, pricing schedule and terms and conditions. PSBOS can provide help with this including template competition documents. Some frameworks offer both options. "
        },
        {
            "heading": 2,
            "text": "Create a specification "
        },
        {
            "text": "Within GOV.UK Buying for schools guidance, there is a free Create a Specification too that can be used if you are purchasing a new catering contract or Multi-function Devices (MFDs) e.g., printers, scanners. This free online tool will assist you in planning your procurement needs in detail, ensuring both your school leadership and prospective suppliers are clear on all your requirements.   "
        },
        {
            "heading": 2,
            "text": "What’s the difference between a framework and a dynamic purchasing system (DPS)?  "
        },
        {
            "text": "Some of the frameworks that we signpost as part of our Get help buying for schools service are known as ‘dynamic purchasing systems’ (DPS). These are essentially frameworks but with two key differences – suppliers can join at any time and procurement processes must be run completely electronically.  "
        },
        {
            "text": "They are increasingly common in the public sector, and they work where there may be a high number of suppliers who operate often more local. The key difference is that suppliers can come and go during the lifetime of the framework.  "
        },
        {
            "text": "On some DPS agreements, schools can nominate their local suppliers to become a member of the framework.​ This is good for competition and means that new businesses can join the framework. In addition, businesses that do not meet the qualification criteria on day one may re-submit a request to join the framework at a later date. Most importantly, DPS are dynamic, so suppliers can change during the lifetime of the framework. ​ "
        },
        {
            "heading": 2,
            "text": "Useful links "
        },
        {
            "text": "If you would like to know more about our services, you can head to GOV.UK and search ‘Buying for Schools’. If you need help with buying goods and services for your school, you can reach out to our Get help buying for schools team who will be happy to assist you. "
        },
        {
            "text": "The Schools Commercial team host regular webinars and live events where they discuss in more detail the different free services we offer to schools and provide a chance to ask questions. If you’d like to find out more about these, follow us on Linkedin for event updates and to find out more about how we can help save your school time and money. "
        }
    ]
}