{
    "url": "https://forestrycommission.blog.gov.uk/2023/05/25/from-lumberjack-to-lumberjill-why-forestry-isnt-just-for-men/",
    "title": "From lumberjack to lumberjill: Why forestry isn't just for men.",
    "authors": [
        "Kate Hawley"
    ],
    "categories": [
        "Careers",
        "Our Staff"
    ],
    "pub_date": "2023-05-25T16:40:11+01:00",
    "content": [
        {
            "text": "Is there a place for me here? It’s a question I asked myself almost constantly upon joining the Forestry Commission 13 years ago, straight into a team of all men in Scotland. They were lovely, supportive, incredibly knowledgeable… but I stuck out like a sore thumb. A lack of female corporate clothing back then meant I spent my days swamped in a men’s XS shirt, constantly rolling up the sleeves of my oversized jacket and sometimes tying measuring tape around my waterproof trousers to keep them up. This was 2010. It wasn’t 1950. But for some reasons, at times it felt like it."
        },
        {
            "text": "I asked myself the same question again years later as my blooming pregnant belly rendered any and all PPE useless. Who needs maternity PPE in a team of mainly men? By then, female corporate clothing had arrived but we still hadn’t managed to acknowledge the presence of pregnant foresters who needed high-viz vests a mile wide, or salopettes you could (literally) fit a family in."
        },
        {
            "text": "“Is there a place for me here?” Is also the name of the spoken word piece I gave last week at the Women in Forestry celebration in Grizedale. An opportunity for people from all over the forestry sector to come and celebrate the opening of the exhibition about the Lumberjills, a group of women who worked in the Women’s Timber Corps during WW1 and WW2 - talk about being a woman in a man’s world back then…!"
        },
        {
            "text": "As part of the exhibition, there was a video of a news piece that went out in the 40s; footage of the Lumberjills working hard, cutting timber, driving machinery – and a man narrating over the top, with patronising phrases such as, “You go girls! Gosh, what a big chop that was from a little lady’, and ‘Those hands are good for chopping vegetables AND wood!’ – although it made us all chuckle, it was a stark reminder how out of place those women were in that kind of work back then."
        },
        {
            "text": "The event was a wonderful celebration of the legacy of the Lumberjills, with stories and interviews with women currently working in forestry, and a demonstration of the tools used back in the 1940s by the ladies themselves. The exhibition itself in the Grizedale gallery was central to the day, with a guided tour being included as part of the event. Never-before seen photos of the Lumberjills themselves, video footage, journals and letters, photos and tools were on show… it was a wonderful and immersive experience which took us back to the Lake District, and the Forest of Dean, almost 100 years ago."
        },
        {
            "text": "The centrepiece of the exhibition, and highlight of the event, was the unveiling of The People’s Picture – a collage of over 2000 publicly submitted images of women currently working in forestry, and from the past - making up a single photo of a Lumberjill . The Lumberjill is Kathleen Houghton who joined the Women’s Timber Corp in 1941 as a lorry driver despite having never driven a car before. It was a perfect demonstration of how the actions of these women in the 1940s inspired and connected an industry that has more women working in it than ever in 2023."
        },
        {
            "text": "And as for me? I decided in the end that there was a place for me in the sector, and I still love working for the Forestry Commission today. It has been an amazing journey over the last 13 years, having the opportunity to work in forestry across England, Scotland and Wales, and seeing first-hand the changes in the industry as the ‘monoculture’ of male colleagues became a more nuanced and diverse workforce."
        },
        {
            "text": "Women now make up almost half of all employees in the Forestry Commission   and I am proud to work as the Area Operations Manager for Yorkshire and North East England, overseeing an operational forestry team with a similar demographic split. The Women in Forestry exhibition is a true celebration of women working in forestry today, as well as an opportunity to showcase the many careers available. But whilst significant progress has been made, we must continue challenging the industry to make sure we have a diverse forestry workforce made up of people from all backgrounds and abilities."
        },
        {
            "text": "I often get the opportunity to speak to people considering a career in Forestry, and to those individuals – especially the women – I say this. There is nothing about effective land stewardship or forestry science that is male. It is not a ‘man’s job’, any more than a nurse or a primary school teacher is a ‘woman’s job’. Instead, all we ask for is a passion for our beautiful outdoors, a wish to learn about putting the ‘right tree in the right place’ and – most importantly – a desire to create a landscape legacy for future generations. There is something magical about working hard on a planting project now, knowing that it will be your children – and more likely grandchildren - who will see the end product."
        },
        {
            "text": "I have seen first-hand how the narrative around forestry careers has changed over the course of my career. My 4-year-old daughter will proudly tell whoever listens that she ‘wants to be a forester’ when she grows up – something I never heard at that age. I hope that if she does choose this career, that she will find it as rewarding and inspiring as I have found it – albeit with an option for maternity forestry clothing if required!"
        }
    ]
}