{
    "url": "https://socialcare.blog.gov.uk/2023/05/25/how-can-digital-technologies-support-care/",
    "title": "How can digital technologies support care?",
    "authors": [
        "Alice Ainsworth"
    ],
    "categories": [
        "Care and support",
        "Digital skills and technologies",
        "Innovation",
        "Social care reform"
    ],
    "pub_date": "2023-05-25T12:06:35+00:00",
    "content": [
        {
            "heading": 2,
            "text": "It's not unusual..."
        },
        {
            "text": "Most of us now use digital technology in some way in our day to day lives. Whether it’s doing our weekly food shop via an app on the phone, wearing a watch to track how many steps we are taking each day, or a using a smart speaker to remind us to take the roast out of the oven on time!"
        },
        {
            "text": "It’s no different in the adult social care sector and often the same technologies and gadgets we use at home can also be used to support how we care for people.  But when this everyday tech is packaged up as “care technology” it can feel a bit intimidating and technical."
        },
        {
            "text": "In our work to support the digital transformation of the adult social care sector we want to make sure we keep the focus on the difference technology can make to people’s lives and how care is delivered. Using technology to support care shouldn’t be daunting. And you definitely don’t need to be a tech-whizz to be able to use it. If you are using a smart phone in your day-to-day life, then using technology to support care is no different."
        },
        {
            "text": "Going back to the devices we may already be using at home, mobile phones and tablets have already found their place as invaluable tools to support people in remaining connected with families and loved ones.  They can also be used to set medication or hydration reminders or to manage repeat prescriptions."
        },
        {
            "text": "There are also many apps which can be used to support communication, including the more sophisticated eye-gaze and touchscreen technologies enabling people to express their wants and needs and be in control of how they are supported."
        },
        {
            "heading": 2,
            "text": "Exercising mind and memory"
        },
        {
            "text": "Digital solutions to support reminiscence, as well as art-based solutions, such as music therapy, are helpful in supporting people with learning disabilities or those living with dementia. Even playing games on a tablet is a way in which technology can incorporate therapeutic approaches into care routines."
        },
        {
            "text": "There are many ways embedding everyday technology into care planning can play a part in supporting people."
        },
        {
            "text": "These approaches to using technology in care settings can deliver big results, but what about solutions requiring more investment in time or finances?"
        },
        {
            "text": "Solutions supporting delivery of care include vital signs monitoring, falls prevention and detection technologies. We are seeing strong evidence around the role these technologies play in keeping people safe and preventing hospital admissions, but there’s a lot to think through."
        },
        {
            "text": "With this in mind, we want to support CQC (Care Quality Commission) registered providers in making decisions about which care technology solutions they might choose to invest in. We recently announced the launch of our technology fund.  The funding will support providers to test and adopt care technologies that address local priorities, by providing implementation and evaluation support to develop an evidence base to prioritise which technologies have proven benefits for the sector."
        },
        {
            "heading": 2,
            "text": "Integrated collaboration"
        },
        {
            "text": "We’re working with local integrated care systems to manage applications to our Adult Social Care Technology fund, which will focus on:"
        },
        {
            "text": "We know technology is increasingly playing a significant role in how care is delivered. Get it right and technology can help enable outstanding quality and personalised care, empowering individuals, their families and carers."
        },
        {
            "text": "To find out more about how our care technology funding support could help you please get in touch by emailing england.adultsocialcare@nhs.net."
        },
        {
            "text": "This article originally appeared in Caring Times May edition."
        }
    ]
}