{
    "url": "https://defradigital.blog.gov.uk/2023/05/25/my-learning-journey-in-the-defra-cloud-academy/",
    "title": "My learning journey in the Defra Cloud Academy",
    "authors": [
        "Darcie Ingram"
    ],
    "categories": [
        "Defra digital",
        "Defra services"
    ],
    "pub_date": "2023-05-25T07:15:52+01:00",
    "content": [
        {
            "text": "Associate Cloud Engineer Darcie Ingram reflects on her experiences being part of the first cohort of ‘cadets’ to join our new Cloud Academy."
        },
        {
            "text": "Eight months ago I was about to enter my second year studying a biochemistry degree at university. I had spent my whole academic career knowing I would end up at university, because that’s how academia seemed to work."
        },
        {
            "text": "I have always had a natural aptitude for STEM (science, technology, engineering, and mathematics) based subjects, and continuing my studies felt like the best option, but I found myself unhappy. I’d always loved to learn, and that hadn’t changed, but I felt I didn’t fit into the culture that went with being at university."
        },
        {
            "heading": 2,
            "text": "I wasn’t sure if academia was for me"
        },
        {
            "text": "I wanted to have some independence and build a career that I could be proud of, and which I could use. My previous work experience included working in a garden centre and through this, and various other means, I began to take a keen interest in horticulture and the environment."
        },
        {
            "text": "This led to me choosing plant-based modules, at university and through my studies I found Defra. At the time I didn’t think working here without a degree would be possible, so I decided to revisit it after attaining my degree."
        },
        {
            "text": "I spent most of my time during the summer before second year working at home, and I felt happier doing this than I had for the whole academic year prior. Unsure of what I would end up doing, I followed my gut instinct and decided to withdraw from university."
        },
        {
            "heading": 2,
            "text": "Making the change was daunting, but necessary"
        },
        {
            "text": "It feels like an understatement to say I was scared, but it was the right decision for me. I found the advert for this Academy opportunity, and it felt like what I needed to be doing, it felt more “right” than anything I’d ever considered before. I knew I needed to give it my best shot and after a few months (and a fair bit of interviewing…) I discovered, alongside 11 other applicants, that I’d got the job!"
        },
        {
            "text": "Over the past 14 weeks I’ve taken part in an intensive ‘bootcamp’ (covering cloud concepts); I’ve revised for and attained my first computing certification; I’ve made new connections within my team and the civil service, and I’ve started shadowing somebody on my future job."
        },
        {
            "text": "After completing the intensive bootcamp we were encouraged to celebrate our successes by coming together and giving presentations on our journey so far, before finishing the day with some fun at an escape room in Newcastle."
        },
        {
            "heading": 2,
            "text": "Teamwork makes the dream work"
        },
        {
            "text": "What I have loved the most about embarking on this apprenticeship has been the focus on teamwork. At the start of our journey, we all travelled to Birmingham and took part in a few days of team building."
        },
        {
            "text": "Through the ice breakers, breakout rooms and shared experiences, we have now formed a network of support where no question is too basic, and everyone feels listened to. Feeling as though I have a place in my workspace, and teammates who care about me, makes logging on for the day or heading into the office something I look forward to."
        },
        {
            "text": "So far during my time as an Associate cloud engineer working towards an apprenticeship at Defra, I have been given the opportunity to develop myself both personally and professionally. I’ve challenged myself to be pushed out of my comfort zone by taking opportunities that I would otherwise have found to be scarier. I can normally feel overwhelmed or a little shaky over prospects like this. But now, with the support of colleagues, I feel as though I can be myself while engaging with the subject at hand."
        },
        {
            "text": "If I were to offer any advice to somebody my age looking to join Defra I would say go in with an open mind. I can feel myself being proud to pursue study, whilst also building a career for myself in a robust environment."
        },
        {
            "text": "In terms of future qualifications and working at Defra I can’t be certain of what the future truly holds. At the moment though, I see no opportunity that better suits me and how I learn; I can’t imagine myself happily getting a qualification anywhere else."
        }
    ]
}