{
    "url": "https://deframedia.blog.gov.uk/2023/05/25/natural-england-chair-tony-juniper-responds-to-criticism-of-nutrient-neutrality/",
    "title": "Natural England chair Tony Juniper responds to criticism of nutrient neutrality",
    "authors": [
        "Defra Press Office"
    ],
    "categories": [
        "Natural England"
    ],
    "pub_date": "2023-05-25T14:50:31+01:00",
    "content": [
        {
            "text": "Today there is coverage in the Times following an interview with chair of Natural England Tony Juniper. The article carries his comments which clarify Natural England’s position on nutrient neutrality environmental regulations, following earlier inaccurate coverage that Natural England is blocking the building of new homes."
        },
        {
            "text": "Nutrient neutrality rules are based on environmental law and Natural England has been working in partnership with developers and planning authorities to create compensatory measures, including new wetlands, to mitigate the nutrient load of new developments and allow housebuilding to go ahead."
        },
        {
            "text": "The article notes that he warned that “Terrifying declines” in wildlife and rivers “overloaded with sewage” will not be fixed if these environmental regulations are dropped."
        },
        {
            "text": "The Times is currently running a campaign ‘Clean it Up’ to improve the water quality of our rivers and seas, highlighting this he said that dropping or watering down nutrient neutrality guidance would make it harder to meet the objectives of this campaign. Stressing the public interest in nature and the environment and  government commitments through the Environmental Improvement Plan and targets under the Environment Act he also said: “We’ve just had Wild Isles and David Attenborough showing the beauty of Britain. We all know we’ve got massive environmental challenges, terrifying figures about the state of our wildlife. And in January we had a new environmental improvement plan that said we’re going to halt and reverse the loss of nature”."
        },
        {
            "text": "He said: “It’s difficult to see how we will remain on target to meet water quality and nature recovery goals if we step away from this kind of scheme.”"
        },
        {
            "text": "The Home Builders Federation (HBF) made claims this week that 120,000 new homes were being held up by “nutrient neutrality” rules affecting 74 local authorities across England. Responding to these claims he said: “It’s ambitious policy, but when it meets ground level, there’s a chorus of opposition and this [the HBF intervention] is one example of it. The environmental regulations are there for a reason. We need to take steps to manage the impacts of different sectors — housing, agriculture, infrastructure — and if we weaken those rules, we’re going to weaken the chances of meeting our outcomes.”"
        },
        {
            "text": "The article notes he said that tackling the pressure on waterways was like combating climate change, because all sectors were responsible and no one was off the hook, including housebuilders. “With climate change, it sometimes seems there’s an apparent choice between ‘should we close down coal-fired power stations’, or ‘should we do something about aviation’? Of course, the answer is we have to do something about all of them if we’re going to meet our targets, and so it goes with river pollution."
        },
        {
            "text": "“We can’t expect to meet long-term targets for really healthy rivers if we’re going to say that some sources of pollution are exempt because they may be smaller than others.”"
        },
        {
            "text": "In July, Defra and Natural England set out plans for a new nutrient mitigation scheme, and we have announced a series of measures to drive down nutrient pollution and help unlock construction of new homes across the country. Noting this work is underway he said: “Mitigation schemes are now coming on stream to speed up planning consents. In the northeast of England, in the south of England, in the Somerset Levels, we have established compensatory mechanisms that are now permitting houses to be built.”"
        },
        {
            "text": "Pollution comes from multiple sources and Natural England is clear that all sectors need to be part of the solution to ensure we improve water quality and reduce the impact on our protected sites for nature."
        },
        {
            "text": "Tony Juniper said alongside action from development a strategic approach is needed from all sources to combat nutrient pollution: “What we’re doing is basically compensating for additional damage. The underlying problems remain.”"
        },
        {
            "text": "Follow Defra on Twitter, and sign up for email alerts here."
        }
    ]
}