{
    "url": "https://healthmedia.blog.gov.uk/2023/05/25/new-hospital-programme-media-fact-sheet/",
    "title": "New Hospital Programme – media fact sheet",
    "authors": [
        "DHSC Media Team"
    ],
    "categories": [
        "New Hospital Programme",
        "NHS"
    ],
    "pub_date": "2023-05-25T14:11:27+01:00",
    "content": [
        {
            "text": "This fact sheet sets out the latest on the government’s New Hospital Programme, following the announcement that five hospitals constructed mostly using reinforced autoclaved aerated concrete (RAAC) will be rebuilt by 2030 as part of the New Hospital Programme - protecting patients and staff safety, expected to be backed by over £20 billion of investment in hospital infrastructure."
        },
        {
            "text": "The five hospitals are Airedale in West Yorkshire, Queen Elizabeth King’s Lynn in Norfolk, Hinchingbrooke in Cambridgeshire, Mid Cheshire Leighton in Cheshire and Frimley Park in Surrey. This is on top of two of the worst affected hospitals - West Suffolk Hospital in Bury St Edmunds and James Paget Hospital in Norfolk."
        },
        {
            "text": "The NHS has asked the government to prioritise the rebuilding of these hospitals given the risks they pose to patients and staff - the full extent of which has come to light since the New Hospital Programme was first announced in 2020."
        },
        {
            "text": "Read the Health and Social Care Secretary's oral statement here: Health and Social Care Secretary Oral Statement on NHP - GOV.UK (www.gov.uk)"
        },
        {
            "heading": 2,
            "text": "Health and Social Care Secretary Steve Barclay said: "
        },
        {
            "text": "“These five hospitals are in pressing need of repair and are being prioritised so patients and staff can benefit from major new hospital buildings, equipped with the latest technology."
        },
        {
            "text": "“On top of this I’m strengthening our New Hospital Programme by today confirming that it is expected to represent more than £20 billion of new investment in hospital infrastructure."
        },
        {
            "text": "“As we approach the 75th anniversary of our fantastic NHS, this extra investment will ensure it can care for patients for decades to come and help cut waiting lists so they get the treatment they need quicker.”"
        },
        {
            "heading": 2,
            "text": "What is the status of the New Hospital programme schemes? "
        },
        {
            "heading": 2,
            "text": "On what basis have you prioritised these five RAAC hospitals over others?"
        },
        {
            "heading": 2,
            "text": "How much will the new hospitals cost to build? "
        },
        {
            "heading": 2,
            "text": "When will the RAAC hospitals go into construction?"
        },
        {
            "heading": 2,
            "text": "Will patients and staff using the current buildings be safe in the meantime?"
        },
        {
            "heading": 2,
            "text": "What about the ‘next 8’ selection process to become part of the New Hospital Programme?"
        },
        {
            "heading": 2,
            "text": "What does the long-term rolling programme mean in practice? "
        },
        {
            "heading": 2,
            "text": "Are some schemes being delayed? "
        },
        {
            "heading": 2,
            "text": "Will these three mental health schemes be new hospitals? "
        },
        {
            "heading": 2,
            "text": "Are the mental health hospitals part of the New Hospital Programme? "
        }
    ]
}