{
    "url": "https://healthmedia.blog.gov.uk/2023/05/25/nhs-workforce-stats-for-may-2023-record-numbers-of-doctors-and-nurses-in-nhs/",
    "title": "NHS workforce stats for May 2023: Record numbers of doctors and nurses in NHS",
    "authors": [
        "DHSC Media Team"
    ],
    "categories": [
        "NHS",
        "Workforce"
    ],
    "pub_date": "2023-05-25T19:03:24+01:00",
    "content": [
        {
            "text": "For the second consecutive month, there are record numbers of doctors and nurses working in the NHS helping to deliver extra appointments, speed up diagnoses and tackle the Covid backlog."
        },
        {
            "text": "At the same time, additional data shows there are more than 29,000 additional primary care staff as the government announced last week it has delivered on its commitment to recruit 26,000 more staff in primary care by March 2024."
        },
        {
            "text": "This is what you need to know."
        },
        {
            "heading": 2,
            "text": "How many NHS staff do you have?"
        },
        {
            "heading": 2,
            "text": "What about general practice?"
        },
        {
            "heading": 2,
            "text": "What are you doing to recruit and retain more health workers?"
        },
        {
            "heading": 2,
            "text": "What have you already done to boost the workforce?"
        },
        {
            "text": "We have:"
        },
        {
            "heading": 2,
            "text": "Where can I access the figures?"
        },
        {
            "text": "The latest figures for February 2023 can be found in full below:"
        },
        {
            "text": "NHS workforce: NHS Workforce Statistics - February 2023 (Including selected provisional statistics for March 2023) - NDRS (digital.nhs.uk)"
        },
        {
            "text": "General practice workforce: General Practice Workforce, 30 April 2023 - NDRS (digital.nhs.uk)"
        },
        {
            "heading": 2,
            "text": "Our latest statement"
        },
        {
            "text": "Health and Social Care Secretary, Steve Barclay, said:"
        },
        {
            "text": "“We continue to make progress on strengthening the NHS and primary care workforce."
        },
        {
            "text": "“Cutting waiting lists is one of the government’s five priorities, so it is extremely promising to see record numbers of NHS doctors, nurses, midwives and nursing associates registered to practice in the UK to ensure patients get the care they need more quickly."
        },
        {
            "text": "“We have published a Primary Care Recovery Plan setting out how we will support general practice to recover from the pandemic, and will soon publish a long term workforce plan focused on recruiting and retraining more staff – to help tackle the backlogs and improve patient care.”"
        }
    ]
}