{
    "url": "https://healthmedia.blog.gov.uk/2023/05/25/patients-given-more-choice-to-help-cut-nhs-waiting-times-what-you-need-to-know/",
    "title": "Patients given more choice to help cut NHS waiting times - what you need to know",
    "authors": [
        "DHSC Media Team"
    ],
    "categories": [
        "GPs",
        "NHS"
    ],
    "pub_date": "2023-05-25T17:09:58+01:00",
    "content": [
        {
            "text": "We have announced plans to offer patients more choice over where they receive their NHS treatment after they are referred by their GP."
        },
        {
            "text": "Further information is available here."
        },
        {
            "heading": 2,
            "text": "What are the new measures?"
        },
        {
            "text": "Patients will now have greater control over the type of treatment they receive and where they receive it."
        },
        {
            "text": "Patients will be able to choose their provider from a single, easy to view list that will include both NHS hospitals and independent hospitals that provide NHS care."
        },
        {
            "text": "GPs and clinicians will then share options for up to five providers for hospital care. Patients will then be able to view information on each to decide which provider can offer the best care to suit clinical needs - based on waiting lists, quality of care and distance to travel."
        },
        {
            "heading": 2,
            "text": "Can you guarantee all patients will get five choices from today?"
        },
        {
            "text": "Patients should be offered a choice if they want it and we’ve issued guidance to the NHS to this effect."
        },
        {
            "text": "It is up to patients to decide whether they want to exercise this choice."
        },
        {
            "text": "We want to support all parts of the NHS to ensure providers are making this choice a reality for patients."
        },
        {
            "heading": 2,
            "text": "What kind of treatments does this cover?"
        },
        {
            "text": "The package covers consultant-led elective hospital care. It does not include choice of GP practice, emergency services or emergency or urgent treatment, maternity services, end of life care, local health authority or other health or care services."
        },
        {
            "heading": 2,
            "text": "Will I need to speak to my GP before choosing my provider?"
        },
        {
            "text": "Yes. If a GP decides to refer a patient for hospital care, where clinically appropriate, they will be able to offer them a minimum choice of five providers, in line with the patient’s preferences."
        },
        {
            "text": "GPs or healthcare clinician will be able to talk patients through the options and will then email over a link with the information. Patients will then be able to select where they receive treatment either through the NHS App or through the NHS website – all from the comfort of their own home."
        },
        {
            "heading": 2,
            "text": "How will this work in practice?"
        },
        {
            "heading": 2,
            "text": "Will this allow me to receive treatment more quickly?"
        },
        {
            "text": "Yes, the measures will strengthen patients’ right to choose when it comes to healthcare."
        },
        {
            "text": "If waits are too long at a particular hospital, patients can ask to be treated elsewhere at a clinically appropriate alternative provider, which may help to reduce waiting times for treatment. Research shows that giving patients choice can cut up to three months off their waiting time by selecting a different hospital in the same region."
        },
        {
            "heading": 2,
            "text": "What if I’m already on a waiting list?"
        },
        {
            "text": "If patients are already waiting to start treatment, they will benefit from improved choice."
        },
        {
            "text": "From October, all patients waiting over 40 weeks who have not had a first outpatient appointment booked or where a decision to treat has been made but the patient does not have a date for their treatment all patients waiting over 40 weeks who have not had a first outpatient appointment booked or where a decision to treat has been made but the patient does not have a date for their treatment will be asked whether they want to switch hospitals, including one with a shorter wait, if possible and clinically appropriate."
        },
        {
            "heading": 2,
            "text": "Do I not already have the right to choose where I receive care?"
        },
        {
            "text": "Yes, as part of the NHS Constitution, patients have the right to choose a provider for consultant-led first outpatient appointment at the point of referral but currently just one in ten patients exercise their right to choose. Patients are also entitled to request an alternative provider if they have been waiting longer than 18 weeks. However, improvements to the NHS App and website, and to the system that supports those who have been waiting a long time, will strengthen this offering and give people more choice over the type of care they receive."
        },
        {
            "heading": 2,
            "text": "Do I need the NHS App or can I access this online?"
        },
        {
            "text": "The NHS App – one of the most downloaded apps in the country - is already playing a vital role in giving patients greater control over their own care. The app is the most accessible way to access the new services as it is mobile friendly, however, patients can also use the NHS website to view information and make changes to appointments."
        },
        {
            "text": "For patients who do not have access to technology, their GP practice will speak to them and help select their provider. Alternatively, patients can call the ‘National Referral Helpline’ who will be able to talk them through their shortlist and support finalising their choice and onward referral."
        },
        {
            "text": "Of course, choice might not be right for some patients. The important thing is that they are given the option by their GP."
        },
        {
            "heading": 2,
            "text": "Will there be support with transport if I choose a different provider? "
        },
        {
            "text": "Integrated Care Boards have been asked to ensure travel is not a prohibitive factor. There is a longstanding policy in the NHS that if patients are eligible, they may be able to claim a refund for reasonable travel costs. That scheme - Healthcare Travel Costs Scheme – will continue to apply."
        },
        {
            "heading": 2,
            "text": "What support will be provided to GPs to offer choice?"
        },
        {
            "text": "Communications have been issued to GP practices to support them to offer choice, with GP practices supported to offer choice through training and improved tech supported by pop up alerts on the system. The NHS has also set up a primary care workstream to support this programme and work with health professionals to understand what additional training may be necessary."
        },
        {
            "text": "Separately we announced our GP recovery plan earlier this month to help ease the burdens on GPs and tackle the 8am rush – backed by more than £1.2 billion of investment this year."
        },
        {
            "heading": 2,
            "text": "What if I’m happy with my current healthcare provider?"
        },
        {
            "text": "If patients do not want a choice, or their GP thinks it’s clinically not right, then nothing will change and they can continue to receive treatment from their current provider."
        }
    ]
}