{
    "url": "https://deframedia.blog.gov.uk/2023/05/25/today-there-has-been-coverage-on-bbc-breakfast-on-the-launch-of-englands-first-ever-national-marine-and-coastal-wildlife-code/",
    "title": "Coverage on the marine and coastal wildlife code",
    "authors": [
        "Defra Press Office"
    ],
    "categories": [
        "marine"
    ],
    "pub_date": "2023-05-25T11:31:29+01:00",
    "content": [
        {
            "text": "There has been broadcast coverage on BBC Breakfast, Radio 4’s Farming Today and Coast Radio on our announcement that the government has launched England’s first ever national Marine and Coastal Wildlife Code which offers friendly advice and guidance to help people visit the coast responsibly."
        },
        {
            "text": "Home to around 95% of Europe’s grey seal population and around 25% of Europe’s breeding seabirds, the British coastline supports many iconic species and habitats. However, as visitors to our coastlines rise, it is important to ensure that our precious marine wildlife remains as undisturbed as possible."
        },
        {
            "text": "Developed in collaboration with organisations including Whale and Dolphin Conservation, the RSPB, Shark Trust and Cornwall Seal Group Research Trust, the Marine and Coastal Wildlife Code includes advice for those walking along the coast or taking part in water-based activities such as kayaking, paddleboarding or jet skiing. It offers specific guidance around animals such as seabirds, seals, dolphins, sharks and turtles, including information on breeding seasons and how species might react to disturbance."
        },
        {
            "text": "BBC Breakfast filmed a live package with conservationists Sue Sayer, from Cornwall Seal Group Research Trust, and Dan Jarvis, from the British Diver Marine Life Rescue, on Hayle Beach in St Ives, Cornwall where they discussed why the code was important, and their wider work to help to protect marine wildlife and the environment."
        },
        {
            "text": "Marine Minister Lord Benyon said:"
        },
        {
            "text": "Sue Sayer, from Cornwall Seal Group Research Trust, said:"
        },
        {
            "text": "Kirsten Carter, Marine Principal Policy Officer at the RSPB, said:"
        },
        {
            "text": "Amanda Craig, director for Connecting People with Nature at Natural England, said:"
        },
        {
            "text": "Dr Carla Boreham, Director of Campaigns for Whale and Dolphin Conservation, said:"
        },
        {
            "text": "The Marine and Coastal Wildlife Code builds on the existing Countryside Code, which provides helpful advice and guidance for an enjoyable and safe trip to the outdoors."
        },
        {
            "text": " Follow Defra on Twitter, and sign up for email alerts here."
        }
    ]
}