{
    "url": "https://healthmedia.blog.gov.uk/2023/05/25/what-were-doing-to-speed-up-clinical-trials-in-the-uk/",
    "title": "What we’re doing to speed up clinical trials in the UK",
    "authors": [
        "DHSC Media Team"
    ],
    "categories": [
        "Life Sciences",
        "Medicines",
        "NIHR",
        "Research"
    ],
    "pub_date": "2023-05-25T22:49:09+01:00",
    "content": [
        {
            "text": "The government has today announced plans to speed up clinical trials and make it easier for revolutionary healthcare treatments get to NHS patients, backed by £121 million."
        },
        {
            "text": "The announcement, published in response to Lord O’Shaughnessy’s independent review, brings together organisations across government to deliver five new funding commitments to boost clinical trials and make the UK a more attractive destination for investment."
        },
        {
            "text": "This is part of a wider cross-government package of £643 million to unlock growth, create jobs and safeguard the nation’s health. These measures will make rapid progress against the Life Sciences Vision – the government’s 10-year plan to make the UK the best place in the world to invest in life sciences."
        },
        {
            "text": "More details can be found here."
        },
        {
            "text": "The full government response is available here."
        },
        {
            "heading": 2,
            "text": "What was the aim of the independent review?"
        },
        {
            "text": "The government appointed Lord James O’Shaughnessy, former health minister, in February 2023 to carry out an independent review into UK commercial clinical trials. He has made 27 recommendations where action should be taken by the government."
        },
        {
            "text": "We are now responding and outlining how we will implement the priority recommendations, with support from NHS England, Medicines and Healthcare products Regulatory Agency (MHRA), the Health Research Authority (HRA) and the National Institute for Health and Care Research (NIHR)."
        },
        {
            "heading": 2,
            "text": "What are the funding commitments?"
        },
        {
            "heading": 2,
            "text": "Where is the funding coming from? "
        },
        {
            "text": "This will be funded by £20million of new funding and £101 million from reprioritised DHSC budgets (NIHR)."
        },
        {
            "heading": 2,
            "text": "How will clinical trials benefit patients and the NHS?"
        },
        {
            "text": "Clinical research is the single most important way in which we improve our healthcare – by identifying the best way to prevent, diagnose and treat conditions."
        },
        {
            "text": "Evidence shows hospitals which undertake research have better patient care outcomes, improved staff retention and it benefits the whole health and care system. Clinical trials are part of the solution for reducing the strain on the NHS."
        },
        {
            "text": "The UK has already made significant progress to improve clinical research in the UK since the impact of Covid-19, with recruitment levels and numbers of trials in the UK now above pre-pandemic levels. Across the country, 77,000 people on average are being recruited to trials per month - 15,000 more than before the pandemic."
        },
        {
            "heading": 2,
            "text": "How do commercial clinical trials work?"
        },
        {
            "text": "Commercial clinical trials are fully funded by the companies developing new treatments and products and provide the NHS and patients with earlier access to innovation. The commitments we are announcing will make it quicker and easier for companies to trial more of their products in the NHS."
        },
        {
            "heading": 2,
            "text": "Does the new funding announcement apply to the whole of the UK?"
        },
        {
            "text": "The review makes recommendations regarding the UK-wide clinical research system, which are being considered by devolved administrations."
        },
        {
            "heading": 2,
            "text": "What are the next steps?"
        },
        {
            "text": "The government will provide an update in the autumn, which will outline progress against the commitments, as well as respond to the remaining recommendations from the Lord O’Shaughnessy review."
        },
        {
            "heading": 2,
            "text": "How can I sign up to research?"
        },
        {
            "text": " Anyone can take part in research whether you have a health condition or not. You could take part in research at a local hospital, GP practice – or even at home."
        },
        {
            "text": "It's easy to get involved. Visit here and simply sign up online. You can choose the health conditions you are interested in. You will be sent details of approved studies that match your interests to decide if you want to take part."
        },
        {
            "heading": 2,
            "text": "Quotes "
        },
        {
            "heading": 2,
            "text": "Professor Lucy Chappell, DHSC’s Chief Scientific Advisor, said:"
        },
        {
            "text": "\"The UK has an excellent track record when it comes to clinical research."
        },
        {
            "text": "\"Lord O’Shaughnessy’s review highlights priorities where we can do even better."
        },
        {
            "text": "\"We delivered record amounts of research in the COVID-19 pandemic to enable treatments for patients at pace and scale."
        },
        {
            "text": "\"We are now rebuilding the research portfolio to enable an effective, efficient, and innovative health research system to improve outcomes for people across the NHS."
        },
        {
            "text": "\"Through acting on the key recommendations within the review, we can enable more clinical trials to be conducted in the UK, ultimately leading to more lives improved and saved through innovative interventions.\""
        },
        {
            "heading": 2,
            "text": "Tim Ferris, National Director of Transformation, NHS England said:"
        },
        {
            "text": "“We want the UK to remain a world leader in research and innovation in healthcare, so that our patients continue to benefit from early access to new therapies and technologies."
        },
        {
            "text": "“We are committed to achieving the goals set out in the Government’s response to Lord O’Shaughnessy’s review: to continue the development and implementation of a national approach to contracting, and the expansion of the National Contract Value Review (NCVR) led by NHS England. In its first six months, the NCVR has reduced UK study set-up times by 45%; 95 days faster than before, meaning it now takes four months instead of seven months."
        },
        {
            "text": "“Furthermore, in response to the review’s recommendation around the use of data for research and digitally facilitated recruitment the Government has committed to establish a common approach to contacting patients about research. This is an area where, through NHS DigiTrials, we have already had significant success including in a remarkably quick timeframe recruiting the target of 140,000 study participants for the NHS Galleri-Trial."
        },
        {
            "text": "“NHS England welcomes Lord O’Shaughnessy’s review and the Government response, and will continue to work toward achieving its goals for improved access to the latest scientific advances through clinical trials.”"
        },
        {
            "heading": 2,
            "text": "Dr June Raine, Chief Executive of the MHRA, said: "
        },
        {
            "text": "“We fully support the ambition for the UK to be one of the most attractive places in the world to conduct clinical trials, and the additional resource being put into the system at large will go some way to help achieve this."
        },
        {
            "text": "“The Independent Review of Commercial Clinical Trials in the UK highlights real-world examples of how clinical trials change lives. We are committed to playing our part to make these trials quicker and easier to set up, for example through our new regulatory framework for clinical trials, our public consultation on Good Clinical Practice guidelines announced today, and our transparency about clinical trial approval timelines."
        },
        {
            "text": "“We are confident that the measures we have in place will bring more clinical trials to the UK and will, most importantly, get innovative treatments sooner to the people who need them.”"
        }
    ]
}