{
    "url": "https://cyberandspecialistoperationscommand.blog.gov.uk/2024/05/06/rg-regimental-week/",
    "title": "Royal Gibraltar Regiment's Regimental Week",
    "authors": [
        "abievans"
    ],
    "categories": [
        "Gibraltar",
        "Overseas Bases"
    ],
    "pub_date": "2024-05-06T13:30:38+01:00",
    "content": [
        {
            "text": "The Royal Gibraltar Regiment was proud to host a series of special events as part of its Regimental Week celebrations last week, marking its 85th anniversary."
        },
        {
            "text": "The week's events kicked off with a Regiment fun-filled Family Day at Devil’s Tower Camp for all serving members, where they enjoyed various activities including laser tag, bouncy castles, and face painting."
        },
        {
            "text": "This event aimed to strengthen the bond between the serving members of the Regiment and their families."
        },
        {
            "text": "On Tuesday 23rd April the Regiment hosted a Regimental reception at Alameda Gardens to honour and show appreciation to veterans who have served with distinction over the years."
        },
        {
            "text": " "
        },
        {
            "text": "This was a poignant moment to reflect on the Regiment's rich history and the sacrifices made by those who have served previously."
        },
        {
            "text": "Wednesday 24th April saw the RG execute a Recruitment Day at Devil's Tower Camp, which was open to all aspiring individuals wanting to learn more about the exciting career opportunities available within the Royal Gibraltar Regiment. This event was a perfect chance for those interested in joining the ranks to meet with serving members and gain valuable insights into life in the military."
        },
        {
            "text": "The Regimental Week culminated on Thursday 25th April in a grand Regimental Dinner, honouring the serving Sergeants, Warrant Officers, and Officers for their dedication and service to the Regiment."
        },
        {
            "text": "This prestigious event was a fitting tribute to the current members who uphold the traditions and values of the Royal Gibraltar Regiment and also served to dine out the current Governor, Vice Admiral Sir David Steel KBE, KStJ, DL as the outgoing Commander in Chief of the Regiment."
        },
        {
            "text": "Lieutenant Colonel Matt Moore, Commanding Officer of the Royal Gibraltar Regiment, expressed his excitement for the Regimental Week activities, stating: \"This year's celebrations hold special significance as we mark our 85th anniversary."
        },
        {
            "text": "We look forward to welcoming veterans, families, and the community to join us in commemorating our past achievements, celebrating our present successes, and looking ahead to a promising future.\""
        }
    ]
}