{
    "url": "https://cyberandspecialistoperationscommand.blog.gov.uk/2024/05/06/royal-gibraltar-regiment-honour-hm-king-charles-iii-with-a-royal-gun-salute/",
    "title": "Royal Gibraltar Regiment honour HM King Charles III with a Royal Gun Salute",
    "authors": [
        "abievans"
    ],
    "categories": [
        "Gibraltar",
        "Overseas Bases"
    ],
    "pub_date": "2024-05-06T13:36:30+01:00",
    "content": [
        {
            "text": "In a ceremony held today, Monday 6 May 2024, at His Majesty’s Naval Base, the Royal Gibraltar Regiment’s Headquarter Company executed a Royal Gun Salute in honour of the Coronation of His Majesty, King Charles III."
        },
        {
            "text": "The event, marked by precision, highlighted the deep respect and loyalty of the Regiment towards the Crown."
        },
        {
            "text": "The ceremony commenced with a formal reception of the Chief of Staff British Forces Gibraltar Colonel (Col) Campbell-Colquhoun by Commanding Officer of the Royal Gibraltar Regiment, Lieutenant Colonel (Lt Col) Moore."
        },
        {
            "text": "The dignitaries proceeded to the inspection line, where the Gun Position Officer (GPO) Captain (Cpt) Alvarez, reported the readiness of the gun detachments and invited Col Campbell-Colquhoun to assume his inspection."
        },
        {
            "text": "Following the inspecting, Lt Col Moore escorted Col Campbell-Colquhoun to a prime vantage point where at precisely 1200, under the command of Capt Alvarez, the first round was fired, marking the beginning of the gun salute, which lasted over three minutes."
        },
        {
            "text": "The ceremony was witnessed by officers, guests, and members of British Forces Gibraltar.   On completion of the Gun Salute, Capt Alvarez approached Lt Col Moore and Col Campbell-Colquhoun to confirm the Gun Salute was complete and all guns were now empty."
        },
        {
            "text": "Lt Col Moore then invited Col Campbell-Colquhoun to sign the Inspecting Officer’s book before presenting him with a Shell."
        }
    ]
}