{
    "url": "https://ukhsa.blog.gov.uk/2024/06/28/from-measles-to-malaria-how-to-keep-you-and-your-family-healthy-on-holiday/",
    "title": "From measles to malaria, how to keep you and your family healthy on holiday",
    "authors": [
        "Blog Editor"
    ],
    "categories": [
        "Health and Wellbeing"
    ],
    "pub_date": "2024-06-28T11:52:20+01:00",
    "content": [
        {
            "text": "With lots of people preparing for their holidays, I’ve written this blog post as a handy guide to travelling safely and minimising risks to your health."
        },
        {
            "text": "Risks vary depending on the type of trip you’re going on – but whether you’re off for a week of sunbathing, watching the Euros, visiting family based overseas or taking a lengthier backpacking trip, it’s worth being prepared. It’s important to research your trip and check your destination before you travel and stay up to date with the latest outbreaks and events."
        },
        {
            "heading": 2,
            "text": "Before you travel"
        },
        {
            "heading": 3,
            "text": "Routine vaccinations"
        },
        {
            "text": "It is vital to ensure you are up to date with your vaccinations before you travel, both for your protection and for the benefit of the health of those around you."
        },
        {
            "text": "Many countries have different diseases circulating and some of these could potentially be dangerous. It’s possible to pick up an illness that we don’t routinely see in the UK, and important to remember that some can have serious consequences for vulnerable people."
        },
        {
            "text": "Measles is a highly infectious viral illness that can be very unpleasant and sometimes leads to serious complications. The measles, mumps and rubella (MMR) vaccine is normally given in childhood, but if you or anyone in your family has not had the MMR, you can catch up at any time. The MMR is available to all adults and children who are not up to date with their 2 doses. It is essential that you take both doses - finishing the full course offers life-time protection from measles for most people. If you are not sure if you are protected, you can check with your GP practice or arrange a travel clinic appointment to discuss."
        },
        {
            "text": "The measles virus is currently circulating in the UK and it is even more common in some parts of Africa, Asia and mainland Europe, so please check that you and your family are up to date with your MMR vaccines."
        },
        {
            "heading": 3,
            "text": "Additional vaccinations/pre-medications"
        },
        {
            "text": "You may need additional vaccinations and preventative medications for the countries you are visiting. For example, if you’re visiting parts of rural Asia and the Far East Japanese encephalitis may be a risk, and the vaccination could be recommended."
        },
        {
            "text": "For malaria risk areas - you may need to take malaria prevention tablets. It’s important to bear in mind that some countries require proof of yellow fever vaccination even if there is no risk of infection. There are also places where the rabies vaccination may be needed."
        },
        {
            "text": "Always check your country of travel for recommended vaccinations, review the NHS Advice on travel vaccinations and keep a close eye on outbreaks in your country of travel."
        },
        {
            "text": "For advice on vaccinations and preventative medicines, you can contact your local travel health clinic or GP practice. With most vaccines it is advised you arrange your vaccination 4 to 6 weeks before you arrive at your destination."
        },
        {
            "heading": 2,
            "text": "During travel"
        },
        {
            "heading": 3,
            "text": "General health measures"
        },
        {
            "text": "While abroad, especially in more remote/rural places, be conscious of hand hygiene, your water supply, food safety and sun exposure."
        },
        {
            "text": "During a heatwave, keep out of the heat if you can. If you have to go outside, stay in the shade especially between 11am and 3pm and stay hydrated. You should wear sunscreen, a hat and light clothes, and avoid exercise or activity that makes you hotter."
        },
        {
            "text": "Be sure to pack hand sanitiser and where possible and appropriate drink bottled water. Always wash your hands with soap and water after using the toilet and before eating. For general advice, this helpful blog post covers top tips for each of these."
        },
        {
            "text": "It’s more common in some countries but traveller's diarrhoea, which results from eating and drinking unsafe food/water, is something to be aware of. You can have quite significant fluid loss from this, so if you experience these symptoms while travelling, it is a good idea to take lots of rest, drink plenty of bottled fluids - if possible, topped up with rehydration salts. If you feel particularly unwell or your symptoms don’t improve, seek medical attention while abroad as you may require medical treatment for dehydration."
        },
        {
            "heading": 3,
            "text": "Particular diseases to be aware of"
        },
        {
            "text": "Mosquito bites are always an annoyance but also pose a particular risk in other parts of the world, where they can cause diseases including malaria, dengue, zika, West Nile virus or chikungunya. This applies to large parts of Europe as well as long-haul destinations. Mosquito bite avoidance advice includes wearing long-sleeved clothing to cover exposed skin, using repellents (at least 50% DEET), and mosquito nets."
        },
        {
            "text": "Suspected malaria is a medical emergency and must be quickly diagnosed and treated. If you visit a malaria risk country, which include countries in large areas of Africa, Asia, and Central and South America, and have a fever, flu-like symptoms or any unusual symptoms during or after travelling you must get urgent medical attention. Don’t wait until you return to the UK if you are unwell."
        },
        {
            "text": "Rabies is transmitted by a bite or scratch from an infected animal, usually a dog, and can be fatal if not recognised, or because post-exposure treatment is not available."
        },
        {
            "text": "Avoid animal bites, and check if you would benefit from a pre-exposure vaccine. All travellers who have a possible exposure to the rabies virus, whether by bites, scratches, or other means, should seek medical advice without delay. You can find full rabies advice here."
        },
        {
            "heading": 3,
            "text": "Getting help"
        },
        {
            "text": "You should also seek medical care if you experience any of the following:"
        },
        {
            "text": "- a fever of 38°C or more"
        },
        {
            "text": "- blood and/or mucus in your poo"
        },
        {
            "text": "- confusion or an altered mental status"
        },
        {
            "text": "- severe abdominal pain"
        },
        {
            "text": "- jaundice or rash"
        },
        {
            "text": "If your symptoms do not improve in 3 days you should seek help."
        },
        {
            "text": "Young children, infants, older travellers and other groups where dehydration may have more serious consequences, must seek early medical advice if they are not tolerating fluids or are showing signs of dehydration."
        },
        {
            "heading": 3,
            "text": "Sexual health"
        },
        {
            "text": "Practising safer sex while abroad will reduce the risk of STIs and HIV, as well as infections that spread through close personal contact."
        },
        {
            "text": "You can reduce your risk by using condoms and having an open conversation about HIV and other STIs before any sexual contact, and avoid sharing items such as towels, clothing or bedding with someone who has mpox or mpox symptoms."
        },
        {
            "text": "Mpox is a virus which can be spread from an infected animal to a person, or by close personal contact with a person with mpox or materials where a person has shed the virus."
        },
        {
            "text": "Symptoms include fever, headache, muscle ache, joint pain, and a rash with scabs which often begins on the face then spreads to other parts of the body which can include the mouth, genitals and anus (considered contagious until all scabs fall off and skin is intact)."
        },
        {
            "text": "Antibiotic-resistant gonorrhoea is on the rise in popular tourist destinations in the Asia-Pacific region – including countries such as China, Thailand, Cambodia and the Philippines. This type of gonorrhoea is not easy to treat and can affect fertility."
        },
        {
            "text": "If you have had condomless sex while abroad, get yourself tested for STIs before having sex with anyone else – depending on where you live, you could get a self-sampling kit or simply attend your local sexual health clinic."
        },
        {
            "heading": 2,
            "text": "Other factors to consider"
        },
        {
            "heading": 2,
            "text": "Returning to the UK"
        },
        {
            "text": "If you feel unwell on returning to the UK, seek medical attention and ensure you inform your healthcare provider that you have been travelling recently."
        }
    ]
}