{
    "url": "https://earlyyears.blog.gov.uk/2025/04/10/how-we-look-at-the-use-of-early-years-pupil-premium-eypp-in-our-inspections-of-early-years-settings/",
    "title": "How we look at the use of Early Years Pupil Premium (EYPP) in our inspections of early years settings",
    "authors": [
        "Wendy Ratcliff HMI, Principal Officer, Early Education"
    ],
    "categories": [
        "Early years"
    ],
    "pub_date": "2025-04-10T15:31:48+01:00",
    "content": [
        {
            "text": "The Department for Education (DfE) recently published guidance for local authorities on the use of EYPP. The Education Endowment Fund (EEF) has also published guidance for early years providers. This blog will discuss how we look at the use of this vital funding when inspecting early years providers."
        },
        {
            "text": "As we frequently say, we are tasked with finding out what it is like to be a child at their early years setting."
        },
        {
            "text": "In practice, this means that we must consider what it is typically like. And we give particular consideration to disadvantaged children and those children with special educational needs and/or disabilities (SEND). This always includes children eligible for EYPP."
        },
        {
            "text": "During an inspection"
        },
        {
            "text": "During the notification call, we will ask you if any children who attend your setting receive additional funding. This includes two-year-old funding for disadvantage, Disability Access Funding (DAF) and EYPP."
        },
        {
            "text": "We will probably want to track the experiences of these children throughout the whole inspection. As our Chief Inspector says:"
        },
        {
            "text": "We know that if you are getting it right for children eligible for EYPP, then all children will be benefitting from high-quality education and care."
        },
        {
            "text": "We will use our inspection methodology to have discussions with leaders, staff and parents. These discussions will focus on what it is like at the setting for children eligible for EYPP. We might ask questions such as:"
        },
        {
            "text": "We will spend most of our time observing the interactions between practitioners and children, particularly those who are disadvantaged. This will help us to evaluate the quality of education and care they receive."
        },
        {
            "text": "We will consider the decisions of leaders and how well funding is used. Where good decisions are made, and disadvantaged children receive high-quality education, it is likely that all children in those settings are benefitting from high-quality provision."
        },
        {
            "text": "This might mean that the funding is used to provide targeted interventions for eligible children. Or it could be used for professional development for practitioners which improves the quality of education they provide."
        },
        {
            "text": "Strong settings will use their knowledge of effective strategies and high-quality education and care throughout their practice. They will do this every day, with all children, and particularly with disadvantaged children. This is vital in improving outcomes for disadvantaged children and helping them to catch up and keep up with their peers."
        },
        {
            "text": "Settings without EYPP"
        },
        {
            "text": "If you do not have any children who are in receipt of EYPP, we may want to know why this is. We may look into questions such as:"
        },
        {
            "text": "Further reading"
        },
        {
            "text": "We would encourage all providers to read the EEF guidance."
        },
        {
            "text": "We also recommend reading our Best Start in Life research review, which aims to support you and examines the factors that contribute to high-quality early education. Our inspectors are trained in how to consider these factors."
        },
        {
            "text": "We know that early education has a positive effect on the life chances of disadvantaged children. And we know that these children, on average, need more opportunities to develop the wider habits and capacities for learning that they will need for later success. Many disadvantaged children need more chances to develop their language and communication and to learn the knowledge they need. This is why it is vital that EYPP funding is used effectively. All of us in early years have a crucial role in making sure these children get what they need to be as successful as their peers."
        }
    ]
}