{
    "url": "https://forestrycommission.blog.gov.uk/2025/04/10/into-the-woods-special-features-in-the-forest-of-dean/",
    "title": "Into the woods: special features in the Forest of Dean",
    "authors": [
        "Kev Tuffley"
    ],
    "categories": [
        "Into the woods series",
        "Nature"
    ],
    "pub_date": "2025-04-10T11:40:34+01:00",
    "content": [
        {
            "text": "Even though I have lived in the Forest of Dean nearly all my life and have spent countless pleasurable hours walking its woodlands, I am still discovering new and interesting areas to explore. One such place is located just outside the village of St. Briavels on the western side of the Dean and inside the Wye Valley Area of Outstanding Natural Beauty."
        },
        {
            "text": "Slade Wood lies in a small valley known as Slade Bottom. Owned and managed by Forestry England, it follows a stream fed by several springs emerging from the valley. This stream, Slade Brook, gives this wood an interesting and unusual feature: tufa dams."
        },
        {
            "heading": 2,
            "text": "Tufa dams"
        },
        {
            "text": "Tufa is a type of porous limestone deposited from calcium carbonate-rich water - in this case the springs that arise to feed the Slade Brook from the underlying limestone. The slow flowing nature of the water allows the calcium carbonate to accumulate on the branches and stems of trees which have fallen across the stream, creating a series of dams and cascades known as tufa dams. There are around 60 dams here, forming the longest set in the country at nearly 700m in total. "
        },
        {
            "text": "The tufa dams on this site are rare as there are still active deposits being created. Consequently, the brook has been designated as a Site of Special Scientific Interest. On a sunny day, the dappled light reflecting from the pools onto overhanging branches is magical."
        },
        {
            "heading": 2,
            "text": "Wild garlic"
        },
        {
            "text": "The best time to visit Slade Wood and the tufa dams is in May when the wild garlic (Allium ursinum) is in full bloom. This perennial creates a spectacular and fragrant carpet which in this location has so far managed to be free of wild boar incursions – and boar love to eat it!"
        },
        {
            "text": "Also called ramson, buckram and bear leek, wild garlic produces small, white flowers with six petals held on a single upright stalk. It has long, oval leaves originating from the base of the plant and reproduces largely from bulb propagation and occasionally from seeds. It is closely related to the garlic you buy in supermarkets but has a more delicate flavour."
        },
        {
            "text": "The leaves and flowers of the wild variety are a popular foraging food but its collection at Slade Wood is prohibited under the Under the Wildlife and Countryside Act 1981 to protect the ecosystem from disturbance."
        },
        {
            "text": "As well as garlic, the wood contains a wide range of native tree and plant species. Impressively tall mature ash trees rise above an understorey of hazel, wych elm, alder, small-leaved lime and beech. Different fern species thrive in the moist conditions alongside the stream and springs while bluebells, dog’s mercury and coltsfoot are abundant at various times of the year."
        },
        {
            "heading": 2,
            "text": "Inspiring poetry"
        },
        {
            "text": "Even though it is at its most picturesque in spring, the wood is a beautiful spot throughout the year. Sean Swallow, a local poet and garden designer, was inspired to write this poem about the site in winter:"
        },
        {
            "text": "Slade Brook, DecemberFor an hour, the applause of water over tufa dams ease,and the brook more slowly pummels air into stone.For an hour, foam accumulates on the surface,a bust of toxic minerals,and lime tree leaves will winter to be green.Mist sweetens the woodland hour,and every rotten thing connects a hairy root of ivy,snakes up a mossy trunk andmonsters a butterscotch crown.For a borrowed hour,the flow does not draw down to the leathery River Wye,and the yellow quarry trucks cease rumbling,for an hourthreadbare wood sorrel grows on a hollow log,growing until the rotten things that give it life also go."
        },
        {
            "text": "As referenced in the refrain in Sean’s poem, an hour’s walk down through Slade Wood is time borrowed from the rush of life, an escape into a world where nature moves at its own quiet pace, whether in the vibrant bloom of spring or the misty hush of winter."
        },
        {
            "text": "The gentle flow of Slade Brook, the fragrance and beauty of wild garlic and the shifting light through the trees invite a deeper connection to the land. Here, among tufa dams, time slows just enough for us to listen, breathe and experience a landscape that continues to inspire."
        }
    ]
}