{
    "url": "https://ipo.blog.gov.uk/2025/04/10/spinning-lies-the-rise-of-fake-vinyl-and-how-industry-is-fighting-back/",
    "title": "Spinning lies: the rise of fake vinyl and how industry is fighting back  ",
    "authors": [
        "Kelsey Jones"
    ],
    "categories": [
        "Enforcement"
    ],
    "pub_date": "2025-04-10T14:00:00+01:00",
    "content": [
        {
            "text": "Record Store Day is held every year in April and honours the special role independent record shops hold in their local communities. In the UK, over 270 stores participate in every corner of the country.  "
        },
        {
            "text": "The IPO is supporting Record Store Day by encouraging you to buy your vinyl from reputable retailers to avoid being tricked by scammers. "
        },
        {
            "heading": 3,
            "text": "Fake vinyl on the rise "
        },
        {
            "text": "In 2024 vinyl accounted for £146 million of UK record companies trade income, with sales rising (9.1%) for a 17th consecutive year to a three-decade high of 6.7m units. Across the world, it’s a billion-dollar business with 250 million units produced annually. With this increasing demand for vinyl, collectors will sometimes be happy to pay a premium for a special edition release. And, as we know, where there is a high demand and scarcity of a product, criminals will alas use the opportunity to trick consumers.  "
        },
        {
            "text": "Counterfeit records, often referred to as \"fake\" records, deceive vinyl collectors and financially harm hard-working artists and the music ecosystem that supports them, ultimately devaluing the legal market. Fake versions of popular albums have been discovered on marketplaces, sometimes priced as high as £1,000.  "
        },
        {
            "text": "Kim Bayley, CEO of ERA, the UK trade body that hosts Record Store Day, said: "
        },
        {
            "heading": 3,
            "text": "Counterfeit vs. Pirate vs. Bootleg: Know the difference "
        },
        {
            "text": "In the music industry, various terms are used to describe illicit music, but it's important to differentiate a counterfeit from a bootleg, as they aren’t the same. "
        },
        {
            "heading": 3,
            "text": "Industry’s fight against fakes "
        },
        {
            "text": "In February 2024, the Police Intellectual Property Crime Unit (PIPCU) at City of London Police, reported seizing 18 tonnes of evidence following a raid on an illegal vinyl pressing factory. The London factory housed four pressing machines, and the fake records recovered were estimated to have cost the music industry over £1 million if sold. This was just one operation. Find more information and images on Instagram. "
        },
        {
            "text": "In the UK, the BPI works hard to tackle IP crime in the music industry. It supports Police investigations, such as the one exampled above, and actively delists fake items from online marketplaces. Between 2020 and 2024, the BPI delisted approximately £26 million worth of fake vinyl from digital platforms, and seized £316,050.00 in physical goods. "
        },
        {
            "text": "Peter Ratcliffe, BPI Director of Content Protection, said: "
        },
        {
            "text": "The Vinyl Record Manufacturers Association (VRMA) is a collective of independent businesses dedicated to vinyl record manufacturing globally. It offers its members opportunities to discuss various industry-related issues and communicate them to their customers. VRMA actively combats counterfeiting through dedicated workgroups and committees focused on supply chain integrity and best practices. "
        },
        {
            "text": "For example, all VRMA members, which include several pressing plants, require an Intellectual Property Rights form before using their plant, to ensure that customers have legally acquired their music. This initiative makes it more difficult for criminals to find a plant to produce counterfeit records. Additionally, the VRMA provides its members with training on ‘reasonable certainty guidelines’, helping them improve their knowledge of their customers and to identify suspicious behaviour through periodic audits and spot checks. "
        },
        {
            "heading": 3,
            "text": "Spotting the fakes: What to look for "
        },
        {
            "text": "What should you look out for when shopping for authentic vinyl? "
        },
        {
            "text": "As counterfeiters become more sophisticated, the IPO is committed to raising awareness of the issue and providing consumers with the tools to protect themselves and the creative industry. By following the tips above, you can ensure you're purchasing authentic vinyl and supporting legitimate sellers.  "
        },
        {
            "heading": 3,
            "text": "How to report "
        },
        {
            "text": "If you suspect someone is selling fake records, please report your concerns to the BPI or contact your local Trading Standards Office using the post code finder.  "
        }
    ]
}