{
    "url": "https://educationhub.blog.gov.uk/2022/01/02/an-open-letter-from-education-secretary-nadhim-zahawi-to-education-and-childcare-leaders/",
    "title": "An open letter from Education Secretary Nadhim Zahawi to education and childcare leaders",
    "authors": [
        "mediaofficer"
    ],
    "categories": [
        "Coronavirus",
        "early years",
        "Further education",
        "Returning to school",
        "Schools",
        "Universities"
    ],
    "pub_date": "2022-01-02T00:01:44+00:00",
    "content": [
        {
            "text": "Education Secretary Nadhim Zahawi has written an open letter to education and childcare leaders on the return to education settings in 2022 and what it will look like. "
        },
        {
            "text": "I wrote to you in December 2021 to express my heartfelt appreciation for everything you and your colleagues have done in responding to the challenges of Covid-19 to keep education and childcare settings open. In the face of additional responsibilities and uncertainty brought by the pandemic, you continue to respond with professionalism and care to provide high quality education, care and pastoral support for children and young people."
        },
        {
            "text": "I understand that many of you and your staff are worried about the Omicron variant and the difficulties this could bring when education and many childcare settings re-open. We all know that face-to-face education is the best way for children and young people to learn and that we have to balance this against wider public health risks brought by Covid-19. I want to reassure you and your staff that enabling face-to-face education and childcare is my absolute priority. You have already done an outstanding job in implementing measures that have helped to keep children and young people in face-to-face environments and you have my continued support in keeping your settings open."
        },
        {
            "text": "I know that some examinations and assessments will be taking place early in the new year and these should go ahead so students, who have worked so hard to prepare for them, have the chance to demonstrate what they know."
        },
        {
            "text": "In universities, face-to-face learning is what students want and expect, and we will do everything we can to avoid any further disruption to their education. We expect face-to-face teaching to continue."
        },
        {
            "text": "Vaccinations remain our best defence against Covid-19 and that is why every child and young person aged 12 and over is eligible to receive the vaccine. It is also vital that all of us – including parents, carers, teachers, early years professionals, eligible students and everyone working in education and childcare – go out as soon as they possibly can to get the booster jab, to protect the NHS, protect our way of life, and protect education and childcare."
        },
        {
            "text": "Feedback from schools suggests that the 350,000 carbon dioxide monitors rolled out across the country are acting as a helpful tool to manage ventilation."
        },
        {
            "text": "To help improve ventilation in schools, colleges and early years settings, we are also making available up to 7,000 new air cleaning units for areas where quick fixes to improve ventilation are not possible, such as being able to open a window. This builds on the 1,000 air cleaning units announced for special schools and alternative provision settings."
        },
        {
            "text": "Additional support for school leaders will also be in place, as Ofsted will not ask inspectors who are also school, college and early years leaders to undertake inspections, so they can focus on their leadership responsibilities at this critical time. This will be a temporary measure from the start of January. Ofsted has already confirmed that it will not be inspecting secondary schools during the first week of term in January, as schools undertake on-site pupil testing. Ofsted will also encourage early years settings, schools and colleges that are significantly impacted by COVID-related staff absence to ask for their inspection to be deferred."
        },
        {
            "text": "Testing remains a priority. All secondary school students should undertake one on-site test on return to boost testing participation and help reduce transmission after a period of social mixing over the holidays. In addition, FE and HE students, and staff are asked to self-test at home before they return. All staff and students are also strongly encouraged to test twice a week using an LFD test and to report all results to the NHS and to their setting."
        },
        {
            "text": "We are already taking targeted and proportionate action by recommending face coverings for all adults in the communal areas of all settings, and for pupils and students in year 7 and above in communal areas."
        },
        {
            "text": "And from 4th January, we also recommend that face coverings should be worn in classrooms and teaching spaces where students in year 7 and above are educated. The advice is short term only and will be reviewed on the 26 January, in line with the review on Plan B measures."
        },
        {
            "text": "By keeping your contingency plans under review, you will be able to keep as many students and children in face-to-face education and childcare settings as possible."
        },
        {
            "text": "I urge you to do everything in your power to protect face to face learning for our children and young people and am confident that you will of course make every endeavour to do so. I understand that a possible challenge for keeping young people in classrooms is staff absence, which is why I am continuing to call on any former teacher who can do so to come back to the classroom. You can support this effort by using your own professional and personal networks to encourage others to sign up to offer temporary help."
        },
        {
            "text": "However, if operational challenges caused by workforce shortages in your setting make delivery of face-to-face teaching impossible, I would encourage you to consider ways to implement a flexible approach to learning. Flexible delivery involves utilising all your available teaching and non-teaching workforce to maximise on-site education for as many pupils as possible while you flexibly deliver provision either on-site or remotely to some pupils."
        },
        {
            "text": "This should only be on a short-term measure and settings should return to full-time in-person attendance for all pupils as soon as practicable. We have worked with leaders across the sector to share case studies that may help you to develop and adopt flexible learning approaches in your own setting and you can continue to access free bespoke support from the EdTech Demonstrator network."
        },
        {
            "text": "Once again, I would like to thank you for your ongoing dedication in keeping education and childcare settings open in such challenging times."
        }
    ]
}