{
    "url": "https://codigital.blog.gov.uk/2023/08/14/data-privacy-and-compliance-team-make-the-finals/",
    "title": "Data Privacy and Compliance Team make the finals",
    "authors": [
        "christinelloydhirst"
    ],
    "categories": [
        "Uncategorized"
    ],
    "pub_date": "2023-08-14T17:59:24+01:00",
    "content": [
        {
            "text": "It’s always good to be appreciated, we all know that.  So when you make it to the finals of an award it is great.  Yes, the Data Privacy and Compliance Team here at the Cabinet Office are  finalists in the PICASSO Europe Privacy Awards. We have been shortlisted for Privacy Team of the Year! "
        },
        {
            "text": "The PICCASO Awards have been created to recognise the people making an outstanding contribution to the Data Privacy and Data Protection profession — from the professionals ensuring their companies meet increasingly complex legal demands to the academics and engineers pushing privacy thought leadership and innovative protections forward. These awards are especially important as they not only reflect the Data Protection landscape in the UK but also across the whole of Europe. The organisers pointed out that they have also had an “unprecedented number of applications this year”, so for such a young team to be shortlisted is an achievement in itself!l"
        },
        {
            "text": "We do have to acknowledge there is some stiff competition, with international banks, airlines and solicitors also in the final.  As a team we are only three years old and to be included alongside large well established organisations like these validates the work that has been done by the team and those supporting it within the Cabinet Office. "
        },
        {
            "text": "As you would expect, we are pretty pleased. Whether we win an award or not it is just nice to be appreciated. (But we would really like the award too!)"
        }
    ]
}