{
    "url": "https://hmlandregistry.blog.gov.uk/2023/08/14/perplexed-by-practice-guides-listen-up/",
    "title": "Perplexed by practice guides? Listen up",
    "authors": [
        "Julie Blunsom, Customer and Strategy Division"
    ],
    "categories": [
        "Law and practice"
    ],
    "pub_date": "2023-08-14T15:14:24+01:00",
    "content": [
        {
            "text": "The latest edition in HM Land Registry’s customer training podcast series is now available on Apple, Spotify and SoundCloud."
        },
        {
            "text": "The two-part podcast focuses on our 80-plus practice guides, which contain a wealth of information on all aspects of land registration to help answer your queries and ensure high-quality, accurate applications."
        },
        {
            "text": "In part 1, host Stephanie Straw is joined by Rebecca Milner, a Solicitor and Assistant Land Registrar at HM Land Registry, and Callum Leary, a Senior Associate in the commercial real estate department at law firm Moore Barlow, to discuss the benefits of using practice guides. And in part 2, Rebecca answers Callum’s questions about electronic signatures, Register of Overseas Entities and digital ID requirements, with reference to the relevant practice guides."
        },
        {
            "text": "It’s a fascinating insight, not only into HM Land Registry’s practices, but also the considerations that lie behind new points of practice. Don't miss out!"
        },
        {
            "heading": 2,
            "text": "Overview"
        },
        {
            "text": "Part 1: Callum and Rebecca talk about how they each became aware of HM Land Registry’s practice guides, which they find most useful, how they use them and how to find specific sections. They also discuss Ask for Guidance, the new pre-submission service for queries that are not answered in any of our practice guides."
        },
        {
            "text": "Part 2: Rebecca answers Callum’s questions, explaining the technical points that underpin our practice:"
        },
        {
            "heading": 2,
            "text": "Listen now"
        },
        {
            "text": "HM Land Registry on Spotify"
        },
        {
            "text": "HM Land Registry on SoundCloud"
        },
        {
            "text": "HMLR Customer Training on Podbean"
        },
        {
            "text": "Practice Guides part 1"
        },
        {
            "text": "Practice Guides part 2"
        },
        {
            "text": "To listen on a mobile device, you’ll need to download or subscribe to the Apple, Spotify or SoundCloud app and search for ‘HMLR Customer Training podcast’."
        },
        {
            "text": "This podcast was recorded on 5 July 2023. All information and guidance in this podcast is in accordance with HM Land Registry practice at the time of recording."
        }
    ]
}