{
    "url": "https://governmentscienceandengineering.blog.gov.uk/2023/08/14/professional-recognition-is-it-for-you/",
    "title": "Professional Recognition – Is it for you?",
    "authors": [
        "gseprofession"
    ],
    "categories": [
        "Blog Series",
        "GSE Opportunities",
        "Learning & Development"
    ],
    "pub_date": "2023-08-14T15:27:19+01:00",
    "content": [
        {
            "text": "What is GSE Professional Recognition? "
        },
        {
            "text": "Professional recognition provides acknowledgement of your skills by obtaining internationally recognised status through joining a community of professional scientists and engineers. The Government Science and Engineering (GSE) Profession considers professional recognition as any form of recognition from a professional body. Be that as a member, a registered scientist, technician, incorporated engineer or becoming fully chartered. "
        },
        {
            "text": "Why is professional recognition important?"
        },
        {
            "text": "Professional recognition shows that you have the required skill set to gain internationally recognised status. It enhances your career prospects and evidences your commitment to your science or engineering specialism."
        },
        {
            "text": "What do people who have completed professional recognition think?"
        },
        {
            "text": "Watch the videos below to hear from colleagues across government, and in the private sector who have completed professional recognition to support their professional development."
        },
        {
            "text": "Natural England - Senior Environmental Soils Specialist"
        },
        {
            "text": "NHS - Pathology Transformation Clinical Fellow"
        },
        {
            "text": "Realise your potential: become professionally qualified"
        },
        {
            "text": "How can you start your Professional Recognition journey now?"
        },
        {
            "text": "Complete the GSE Professional Recognition Offer interest form and sign up to attend an event via our Professional Recognition Week blog."
        },
        {
            "text": "Already professionally recognised? Become a mentor"
        },
        {
            "text": "If you are already professionally recognised with any professional institute/body and would be willing to mentor someone in your department new to this process, please let us know by emailing gse@go-science.gov.uk."
        }
    ]
}