{
    "url": "https://charitycommission.blog.gov.uk/2024/11/04/a-thank-you-to-all-trustees/",
    "title": "A thank you to all trustees",
    "authors": [
        "David Holdsworth, Chief Executive Officer"
    ],
    "categories": [
        "Trustees",
        "Volunteering"
    ],
    "pub_date": "2024-11-04T09:36:43+00:00",
    "content": [
        {
            "text": "Since returning to the Charity Commission this summer in my new role as Chief Executive, I’ve been thrilled to spend time meeting with representatives of charities and sector bodies across England and Wales.  "
        },
        {
            "text": "The charities I’ve visited have had different purposes, different outlooks and different ambitions.  "
        },
        {
            "text": "Some employ hundreds of people and some are run with just a handful of volunteers.  "
        },
        {
            "text": "What unites all these charities, however, is the unwavering dedication, passion and skill of their volunteers, employees and of course amazing trustees.  "
        },
        {
            "text": "As we begin Trustees’ Week 2024, I wanted to take this opportunity to thank the hundreds of thousands of you in England and Wales who take on this role for the good of others. "
        },
        {
            "text": "It’s been a privilege to see what incredible work you do. The vast majority of you are unpaid volunteers, and all of you are driven by a fierce commitment to public service. "
        },
        {
            "text": "It’s my belief that charities are at the beating heart of our nations, our communities, providing services that accompany us through our lives, cradle to grave, supporting the most vulnerable, protecting our heritage, environment and animals, strengthening communities and our society as a whole."
        },
        {
            "text": "And as trustees, you are the ones tasked with ensuring that these charities thrive, rising to meet the great variety of internal and external pressures they might face.  "
        },
        {
            "text": "Difficult decisions in challenging times "
        },
        {
            "text": "Charities have faced particularly challenging times in the past few years, navigating the double blow of the pandemic and the cost-of-living crisis. "
        },
        {
            "text": "I’ve heard from many charities who say they are facing unprecedented demand for their services and support. "
        },
        {
            "text": "Our latest research shows this trend clearly, alongside a declining proportion of the public saying they have made donations to charities.  "
        },
        {
            "text": "Against this backdrop, trustees are being asked to make difficult decisions, weighing up what is in the best interests of their charity, with a clear-headed focus on their founding purpose.  "
        },
        {
            "text": "Even the most experienced trustees are being tested by this, and it is testament to their character that so many charities are weathering these challenges. "
        },
        {
            "text": "Trust in charity  "
        },
        {
            "text": "But, despite the challenging economic climate, there is also good news. "
        },
        {
            "text": "Our research also shows that public trust in charities has reached its highest level in 10 years, with charities amongst the most trusted groups in society, second only to doctors.    "
        },
        {
            "text": "This renewed trust comes as a direct result of the good work of trustees, ensuring their charities are steadfast in their purposes, in putting others before self and being compliant with the law. "
        },
        {
            "text": "To help you in that endeavour, Trustees’ Week is a fantastic opportunity to hone your existing knowledge by signing up to one of the many events on offer, or by taking our trustee quiz. "
        },
        {
            "text": "The future of trusteeship "
        },
        {
            "text": "I’d also like to extend my welcome and thanks to new trustees who might be making their first steps as a charity trustee.  "
        },
        {
            "text": "Or, perhaps, you’re reading this as someone who is considering trusteeship but is unsure whether to go ahead. "
        },
        {
            "text": "To you I’d like to say this.   "
        },
        {
            "text": "Yes, trusteeship can feel challenging at times. Whilst most trustees tell our researchers they feel confident in their duties, some have told me they can feel overawed by their responsibilities at times, or unsure about making the right calls.  "
        },
        {
            "text": "That is natural, and as regulator, we are here to help trustees understand and deliver on their responsibilities not just enforce the law."
        },
        {
            "text": "Yet, these same trustees told me of the huge sense of pride that trusteeship brings them - pride in their charities, in their responsibilities and in themselves. "
        },
        {
            "text": "During Trustees’ Week this year, I wanted to reflect this pride back - and to acknowledge the huge contribution, commitment and passion of charity trustees throughout England and Wales. Thank you from all of us at the Charity Commission and on behalf of all those you make a difference to. "
        }
    ]
}