{
    "url": "https://gds.blog.gov.uk/2024/11/04/gov-uk-forms-in-motion/",
    "title": "GOV.UK Forms in motion",
    "authors": [
        "The GOV.UK Forms Team"
    ],
    "categories": [
        "GOV.UK Forms"
    ],
    "pub_date": "2024-11-04T09:23:03+00:00",
    "content": [
        {
            "text": "GOV.UK Forms is now in public beta, enabling all teams across central government to use the platform. We’re also expanding our support and service offering."
        },
        {
            "text": "GOV.UK Forms is an easy to use form building platform with accessibility, security and hosting built-in. We do lots of the hard work for teams such as complying with government standards, including on accessibility and cyber security, so they can focus on building forms and using expert knowledge to run public services. "
        },
        {
            "text": "You can see how the platform is enabling teams to save time and money in this short video. "
        },
        {
            "text": "There are over 10,000 document-based forms published on GOV.UK. GOV.UK Forms is designed to tackle some of the common problems associated with these. Many of these forms tend to be less accessible, difficult for the public to use and take longer to process. "
        },
        {
            "text": "GOV.UK Forms is part of GDS’ commitment to make common components, making it easier for government departments to build better digital forms, save everyone time and improve the public experience of interacting with government. "
        },
        {
            "text": "Teams right across central government can now sign up to quickly create secure and accessible digital forms without needing any technical knowledge. We estimate this has already saved government teams over 2 years in processing time since September 2022."
        },
        {
            "text": "During private beta and early access we saw 87 forms published alongside over 1,200 users creating accounts to test how GOV.UK Forms can help their organisations build better forms. The team have done lots of accessibility research throughout development and Oliver Quinlan, Lead User Researcher at GDS, has previously written about what we learned from users when testing different form formats and the preference for digital forms."
        },
        {
            "text": "To help organisations use GOV.UK Forms we’ve also included controls such as user management, which enables departments to manage who can publish forms, and guidance on how to create good forms."
        },
        {
            "text": "We’ve been working with and learning from teams across government throughout private beta. John Ploughman and Thomas Williams from DVSA, recently published a blog post on ‘How to get started using GOV.UK Forms’ and what they’ve learned. "
        },
        {
            "text": "We’re continuing to develop and scale the platform and we’re keen to do that in partnership with teams across central government. So if you have questions, feedback or ideas, please get in touch."
        }
    ]
}