{
    "url": "https://nda.blog.gov.uk/how-well-evaluate-a-site-to-host-a-geological-disposal-facility/",
    "title": "How we’ll evaluate a site to host a Geological Disposal Facility",
    "authors": [
        "NWS"
    ],
    "categories": [
        "Mission delivery",
        "Research and development",
        "Waste management"
    ],
    "pub_date": "2024-11-04T14:16:31+00:00",
    "content": [
        {
            "text": "A Geological Disposal Facility – or GDF – is the best solution to permanently dispose of our most radioactive waste. We’ve developed a robust process for choosing where a GDF could be built and at the moment, we’re actively engaging with communities to see if hosting a GDF would be right for them."
        },
        {
            "text": "As part of the process, we evaluate each potential site based on six siting factors."
        },
        {
            "text": "Would this area be suitable for a GDF?"
        },
        {
            "text": "These six siting factors are safety and security, community, environment, engineering feasibility, transport, and value for money."
        },
        {
            "text": "When it comes to safety and security we must demonstrate a potential site will be safe and secure both during its construction and when it’s operating. If we can’t do this we can’t consider the site suitable and a GDF can’t be built in that location. The geology must be suitable and the facility must satisfy the UK’s strict safety and security standards for us to move ahead."
        },
        {
            "text": "The community also plays a central role and throughout the whole process, we remain in constant dialogue with local people in the community and stakeholders, local authorities and  the Community Partnership."
        },
        {
            "text": "Like any big infrastructure project, a GDF would affect the local community in different ways. Our discussions with local people will seek to ensure that the social and economic impact of a GDF would benefit them as much as possible."
        },
        {
            "text": "If the community decides they do not want to host a GDF, then we won’t go ahead."
        },
        {
            "text": "A GDF will be one of the biggest environmental protection projects the UK has ever seen and protecting the environment is a key factor when evaluating potential sites. We will need to assess the impact on protected habitats and species, as well as anything of  historical and cultural significance."
        },
        {
            "text": "What would it mean to host a GDF?"
        },
        {
            "text": "When it comes to engineering feasibility, the geology of an area will ultimately influence whether and how a GDF can be designed, constructed and operated safely. We will need to drill deep boreholes into the ground to bring up rock samples so we understand the geology. This work will give us a really detailed picture of the different layers present.  "
        },
        {
            "text": "We also look at transport links. After all, there’s no point in building a site for disposing of radioactive waste if we can’t get the waste there safely and efficiently. During this evaluation, we’ll consider what the existing transportation looks like, and development options."
        },
        {
            "text": "Last but not least: does building a GDF in a chosen area represent good value for money? Since this is a government project, we have to make sure we’re using taxpayers’ money as efficiently as possible for the long-term."
        },
        {
            "text": "What if a site is or isn’t suitable?"
        },
        {
            "text": "These six siting factors help support our considerations on whether a site is suitable for  a GDF. In 2023, we withdrew from Allerdale, in Cumbria, because there was only a limited volume of suitable rock which meant the geology wasn’t right."
        },
        {
            "text": "If a site does supportall aspects of the six siting factors, then we’ll seek approval from the government, and apply for the necessary planning and regulatory consents."
        },
        {
            "text": "The whole process of building and eventually closing the GDF will take around 150 years, and it will keep protecting people and the environment for thousands more – which is why it’s vitally important to evaluate potential sites thoroughly."
        }
    ]
}