{
    "url": "https://nationalscreening.blog.gov.uk/2024/11/04/journal-article-showcases-uk-nsc-workshop-on-risk-stratification-in-breast-screening/",
    "title": "Journal article showcases UK NSC workshop on risk stratification in breast screening",
    "authors": [
        "Andrew Anderson"
    ],
    "categories": [
        "General"
    ],
    "pub_date": "2024-11-04T16:20:52+00:00",
    "content": [
        {
            "text": "There has been lots of interest in recent years around the potential benefits of tailoring breast screening to an individual’s unique risk."
        },
        {
            "text": "This ‘risk stratification’ approach could enable women known to be at high risk to be screened more often and with more sensitive technologies, while reducing the frequency of screening for women at lower risk."
        },
        {
            "text": "This risk-based screening method could help detect cancers earlier in high-risk groups while minimising unnecessary testing for low-risk groups, thus optimising health outcomes and healthcare resources."
        },
        {
            "text": "We have blogged previously about a UK NSC workshop that brought together screening experts to discuss research studies that could help shape the future of a risk-stratified breast screening programme. A journal article about this workshop has now been published."
        },
        {
            "text": "The UK NSC organised the workshop as part of its horizon scanning function following the committee’s expansion to consider targeted and risk-stratified screening in addition to whole population screening."
        },
        {
            "text": "The event was attended by a range of stakeholders including radiologists, geneticists, policymakers, and patient advocacy groups. They heard from researchers, who showcased a range of studies that focused on:"
        },
        {
            "text": "The journal article goes into much more detail than we could do in the blog about the research, the presentations and what the next steps might be. We have ensured the article is Open Access so anyone can read it. So please do have a look and share the link to it within your networks."
        },
        {
            "text": "We hope to publish more articles on UK NSC workshops and discussions in scientific journals in the future to help keep people informed about the UK NSC’s ongoing work and thinking. So please watch this space."
        },
        {
            "heading": 2,
            "text": "UK NSC blog"
        },
        {
            "text": "The UK NSC blog provides up to date news from the UK NSC. You can register to receive updates direct to your inbox, so there’s no need to keep checking for new articles. If you have any questions about this blog article, or about the work of the UK NSC, please email uknsc@dhsc.gov.uk."
        }
    ]
}