{
    "url": "https://defrafarming.blog.gov.uk/2024/11/04/our-approach-to-farming-recovery-payments/",
    "title": "Our approach to Farming Recovery payments",
    "authors": [
        "The Team"
    ],
    "categories": [
        "Flooding support"
    ],
    "pub_date": "2024-11-04T16:08:25+00:00",
    "content": [
        {
            "text": "Winter 2023 and Spring 2024 were among the wettest seasons recorded in England."
        },
        {
            "text": "From October 2022 to March 2024, England experienced its wettest 18-month period since Met Office records began in 1836. The months from October 2023 to March 2024 marked the wettest October-to-March period ever recorded."
        },
        {
            "text": "Reflecting the exceptional nature of these events, we are making recovery payments to farmers as a contribution towards the costs incurred following the damage that Storms Babet and Henk and the exceptional wet weather caused during this period."
        },
        {
            "text": "To support farmers affected by Storms Babet, Henk and severe wet weather, we’re providing a one-off Recovery Payment to help cover the uninsured costs of restoring farmland. Payments will range from £2,895 to £25,000, based on the level of damage."
        },
        {
            "text": "Following our announcement this summer, we’re now able to confirm how farmers were selected for this support."
        },
        {
            "text": "Only those identified by the Rural Payments Agency (RPA) will be contacted."
        },
        {
            "heading": 2,
            "text": "Recovery payments worth £60 million"
        },
        {
            "text": "The Recovery Payments aim to help farmers recover from the extreme wet weather of Winter 2023/24, worsened by two major storms, Storm Babet in the autumn and Storm Henk in January 2024."
        },
        {
            "text": "The impact on yields and productivity has varied depending on the region, crop, and soil type, with some farms facing additional costs to restore their land to productive use."
        },
        {
            "text": "Around 13,000 farm businesses will receive this exceptional, one-off payment as a contribution towards these costs."
        },
        {
            "text": "The Environment Agency and Met Office data was used to identify which farm businesses will receive the recovery payment."
        },
        {
            "text": "This data on river flooding and exceptional rainfall allows us to pinpoint affected land and make payments directly to eligible farms. By focusing on those with the most significant impacts, this approach ensures the payment contributes to uninsured costs resulting from the extreme wet weather."
        },
        {
            "text": "There’s no need for farmers to submit an application or claim form. This straightforward process means payments can be made quickly—usually within 28 days of receiving a letter or email from the RPA —without further evidence or confirmation of eligibility."
        },
        {
            "text": "Eligible farmers can opt out or notify the RPA of any change in circumstances, such as changes in land use for listed parcels, within 10 days of receiving their letter or email."
        },
        {
            "text": "For queries about your letter, please call the phone number provided. If you believe you are not eligible for the payment despite receiving a letter, you can email the contact address included in your correspondence."
        },
        {
            "heading": 2,
            "text": "Identifying farmers"
        },
        {
            "text": "The recovery payments are focused on exceptional wet weather impacts in this period and therefore those who are most likely to have had the most significant impacts."
        },
        {
            "text": "Eligibility covers areas of the most extensive river flooding from the two largest storms in the period plus the areas where extreme rainfall occurred over the six months."
        },
        {
            "text": "Farmers will receive a letter from the RPA with details of the area of land considered to be eligible for the recovery payment by combining 2 sources of information:"
        },
        {
            "text": "Data from the Environment Agency was used to track high river levels during Storm Babet (19–25 October 2023) and Storm Henk (2–12 January 2024). "
        },
        {
            "text": "Satellite imagery was used to confirm the land where the river flooding impacts were most severe."
        },
        {
            "text": "Rainfall data from the Met Office identified local authority areas in England where at least half of the area experienced exceptional rainfall (more than 70% above the 30-year average rainfall) from October 2023 to March 2024."
        },
        {
            "text": " Eligible land parcels were then identified in these areas and payment made for a set proportion of total eligible farm area to take account of uncertainties in the precise extent of localised rainfall impacts across the country."
        },
        {
            "text": "Farmers whose land is engineered as a flood storage area are not eligible for recovery payments, as they are expected to be prepared for and resilient to flooding."
        },
        {
            "heading": 2,
            "text": "How the payment is calculated"
        },
        {
            "text": "If, for example, the amount of land parcels affected totals between 1 and 25 hectares of eligible land, farmers will receive a one-off payment of £2,895. The more land affected, the higher the payment, according to the table below."
        },
        {
            "heading": 2,
            "text": "Payment bands"
        },
        {
            "text": "1.00 – 25.00 ha  £2,895"
        },
        {
            "text": "25.01 – 50.00 ha £4,875"
        },
        {
            "text": "50.01 – 75.00 ha £8,125"
        },
        {
            "text": "75.01 – 100.00 ha £11,375"
        },
        {
            "text": "100.01 – 125.00 ha £14,625"
        },
        {
            "text": "125.01 – 150.00 ha £17,875"
        },
        {
            "text": "150.01 – 175.00 ha £21,125"
        },
        {
            "text": "175.01 ha and above £25,000"
        },
        {
            "text": "The recovery payments will only be made to farmers in England as an exceptional, one-off contribution towards the uninsured costs incurred from returning their land to its pre-flooding condition."
        },
        {
            "heading": 2,
            "text": "Building resilience"
        },
        {
            "text": "To protect land, rural homes, and businesses from flooding we have set up a new Flood Resilience Taskforce to make sure coordination is working between central government and the agencies on the ground. The National Farmers Union (NFU) is a member. It will contribute to future taskforce discussions on the resilience of the agriculture sector to flooding."
        },
        {
            "text": "Adapting to climate change, including extreme weather, is a shared responsibility. By building resilience now, we can reduce the costs and disruption caused by significant flooding and wet conditions in the future. We’ll continue to work with industry to support better risk management."
        },
        {
            "text": "Building resilience is an important way to mitigate the long-term risks associated with climate change, market volatility and other environmental factors. "
        },
        {
            "text": "Through our environmental land management schemes, we’re supporting farmers and land managers to invest in actions that will help with water management and build resilience to wet weather. You can read more about these on GOV.UK."
        },
        {
            "text": "For example, the Sustainable Farming Incentive (SFI) is designed to help farmers adopt sustainable practices that increase the resilience of their business, food production and the environment."
        },
        {
            "text": "By enhancing soil health, improving water management, and encouraging biodiversity, these schemes reduce the impact of adverse events, such as extreme weather, helping farmers manage risk directly on their farms."
        },
        {
            "text": "We are working to create a future where farmers are empowered to manage their risk by taking forward looking actions in their own business, taking up relevant actions for resilience in environmental land management schemes, supporting wider local action to manage flood risk and harnessing commercial insurance markets. This will encourage a more resilient and sustainable agricultural sector."
        },
        {
            "text": "More broadly, our flood investment programme benefits both urban and rural communities. Around 40% of the Environment Agency’s flood defence schemes — and 45% of their investment — go towards better protecting properties in rural areas."
        },
        {
            "text": "We are also working to improve the resilience of the agriculture and food sectors against weather extremes and enable better risk management. This includes industry-led efforts, such as the Food and Drink Sector Council's subgroup on resilience."
        }
    ]
}