{
    "url": "https://educationhub.blog.gov.uk/2024/11/student-fees-and-maintenance-loan-increase-what-you-need-to-know/",
    "title": "Student fees and maintenance loan increase: what you need to know",
    "authors": [
        "mediaofficer"
    ],
    "categories": [
        "Higher Education",
        "Universities"
    ],
    "pub_date": "2024-11-04T16:54:53+00:00",
    "content": [
        {
            "text": "Maintenance loans and tuition fees in England are changing in line with inflation to help ensure the financial stability of the university sector. But what does this mean for students and universities?  "
        },
        {
            "heading": 3,
            "text": "Why has this decision been made? "
        },
        {
            "text": "We recognise that students have been feeling the pinch of the cost of living. Because of this, we have decided to raise maintenance loans – the loan that helps you with your living expenses as a full-time student.   "
        },
        {
            "text": "The 3.1% rise will provide as much as £414 extra per year to help students from the lowest income families.   "
        },
        {
            "text": "We have also made the decision to increase maximum tuition fee limits to help universities cover the cost of providing education. Fees have not been increased in seven years, which means they have not kept in line with inflation. Maximum fees for standard full-time courses will rise by 3.1% to £9,535.  "
        },
        {
            "text": "After leaving study, those who have taken out a student loan will not see their monthly student loan repayments increase because of these changes. Repayments do not start until a graduate reaches the earnings threshold either.   "
        },
        {
            "heading": 3,
            "text": "How much will this go up in pounds?   "
        },
        {
            "text": "Both the maintenance loan and maximum tuition fees universities can charge will rise by 3.1%, in line with inflation.   "
        },
        {
            "text": "For student tuition fees this means:   "
        },
        {
            "text": "The maximum cap for full-time student fees will go up by £285 making the yearly maximum fee limit cost £9,535.  "
        },
        {
            "text": "The maximum cap for part-time student fees will go up by £210 making the yearly maximum fee limit cost £7,145.  "
        },
        {
            "text": "The maximum cap for accelerated student fees will go up by £340 making the yearly maximum fee limit cost £11,440  "
        },
        {
            "text": "The maximum maintenance loan will be uplifted by:  "
        },
        {
            "text": "£267 for students living at home, making the maintenance loan £8,877 yearly.  "
        },
        {
            "text": "£414  for students living away from home and studying in London, making the maintenance loan £13,762 yearly.  "
        },
        {
            "text": "£317 for students living away from home and studying outside London , making the maintenance loan £10,544 yearly.  "
        },
        {
            "text": "£363 for students studying overseas as part of a UK course, making the maintenance loan £12,076 yearly.  "
        },
        {
            "heading": 3,
            "text": " I’ve already started my course – will these changes affect me?  "
        },
        {
            "text": " From the 2025/26 academic year the new maximum tuition fee and maintenance loan rates will apply to new students and those who are continuing their studies.  "
        },
        {
            "text": "If you are confused about an offer that has already been made for the 2025/2026 academic year, get in touch with your higher education provider.  "
        },
        {
            "heading": 3,
            "text": "Will you be putting fees up again next year?    "
        },
        {
            "text": "Longer-term funding plans for the higher education sector will be set out in due course.  "
        },
        {
            "heading": 3,
            "text": "What will this mean for repaying my student loan?  "
        },
        {
            "text": "After finishing university, those who have taken out a student loan will not see their monthly student loan repayments increase because of these changes.    "
        },
        {
            "text": " For a student loan, the amount you repay each month, if you’re paid monthly, depends on how much you earn over the repayment threshold. So, the more you earn, the more you repay. If your earnings fall below the threshold, you’re not required to pay back anything.  "
        },
        {
            "text": "Unlike commercial loans, if you have not repaid your student loan after 40 years, the amount you still owe is automatically cancelled, regardless of how much it is.  "
        },
        {
            "heading": 3,
            "text": "What does this mean for universities? "
        },
        {
            "text": "The fee increase will provide a boost of funding to the sector, helping higher education providers handle their financial challenges.   "
        },
        {
            "text": "In return for this investment, we are also calling on universities to do their bit to support disadvantaged students, use their money responsibly, and focus on their core mission of providing world-class education. More on how we’re reforming higher education will come in the next few months.  "
        },
        {
            "text": "Universities have been asked to consider the following moving forward:  "
        },
        {
            "text": "Widen access to university: Universities are being asked to do more to help disadvantaged students reach university and achieve their potential when they get there.     "
        },
        {
            "text": "Flexible Learning Options: Universities are being asked to offer more flexible study options and various course types. This flexibility should allow more people to study for a degree. They are also encouraged to help more students move from further education to university.    "
        },
        {
            "text": "Improving efficiency: Universities should be focused on delivering the very best value for students. We want to make sure they are transparent on how they are spending money, looking at their business models, and cutting out any wasteful spending. We also expect to see better collaboration across the sector, working together to improve efficiency. "
        }
    ]
}