{
    "url": "https://aphascience.blog.gov.uk/2024/09/28/rabies-in-ghana-the-silent-bites/",
    "title": "Rabies in Ghana: The silent bites",
    "authors": [
        "Christopher Finnegan"
    ],
    "categories": [
        "International",
        "Viral diseases"
    ],
    "pub_date": "2024-09-28T09:00:00+01:00",
    "content": [
        {
            "text": "During a meeting to plan for the 2023 Anti-rabies Ghana National Campaign, Dr Mabel Abudu, the Ashanti regional Veterinary Officer could not hold back her tears. She was being consoled by her colleagues. But why? Sadly, she had been informed about the daughter of a close relative, who has just passed away. The daughter had been bitten by a dog suspected of rabies. She had initially reported that she was suffering from a bad headache and could not drink water or eat food. Later, she began to vomit and foam at the mouth."
        },
        {
            "text": "A visit to her nearby hospital, diagnosed rabies. She was exhibiting signs of hydrophobia or fear of water – an advanced symptom of the disease. Because of hydrophobia, saliva was accumulating in her mouth, and she was unable to swallow."
        },
        {
            "text": "Dr Mabel Abudu later explained, once a person is symptomatic for rabies, treatment is ineffective. All the family could do, was wait."
        },
        {
            "text": "“Once clinical symptoms appear, rabies is virtually 100% fatal.”"
        },
        {
            "text": "Unfortunately, this is not an isolated, rare, or unusual story."
        },
        {
            "text": "Ghana rabies situation"
        },
        {
            "text": "In Ghana, a total of 793 suspected cases of rabies (including dog and other animal bites), were reported between 2020-2023 with 77 officially confirmed deaths. In 2023 alone, a total of 331 suspected cases were recorded. There are over 2.5 million dogs in Ghana. Only 76,000 of these have been vaccinated, leaving over 2.4 million unvaccinated."
        },
        {
            "text": "Rabies is one of the priority diseases in Ghana, targeted for elimination by 2030. Although people work together on control and prevention, progress towards its elimination is difficult."
        },
        {
            "text": "Ghana has a Rabies Control and Prevention Action Plan (2018 – 2030) with a goal to use the One Health Approach for surveillance, prevention, and control of dog-mediated human Rabies. The country however needs a vaccination coverage, (due to herd immunity), of over 70% of dogs to protect more than 33.48 million citizens from dog-mediated rabies."
        },
        {
            "text": "If Ghana was to eliminate dog-mediated human rabies, it would set a precedent in West Africa for other countries in the region to follow."
        },
        {
            "text": "Need for dog vaccination in Ghana: start small, demonstrate success, and strengthen the system"
        },
        {
            "text": "In response, the UK government, through its ODA-funded Animal Health System Strengthening (AHSS) project (part of UKAid), has donated 15,000 doses of rabies vaccine, laboratory equipment and consumables to the Ghanaian Ministry of Food and Agriculture (MoFA), to help in the crusade of eliminating rabies in Ghana."
        },
        {
            "text": "The donation coincided with World Veterinary Day and was used to fulfil a pledge made in September 2023 during the celebration of World Rabies Day, to support Ghana’s vision to eliminate human death from dog mediated rabies by the year 2030."
        },
        {
            "text": "Within 60 days, the Ghanaian Veterinary Services Department (VSD), had deployed over 300 field officers across the country, to vaccinate more than 15,000 dogs, at no cost to the pet owners. This covered 1% of the unvaccinated dog population – a rate exceeding the minimum for interruption of dog-to-dog transmission. If sustained at this rate (1%) every 60 days, it is thought that Ghana will eliminate rabies in the dog population before 2030."
        },
        {
            "text": "The field vaccinations were closely monitored by colleagues working with the ODA-funded AHSS Project in Ghana. VSD also used the opportunity to further train its newly employed field staff and veterinarians in animal vaccinations and handling."
        },
        {
            "text": "Prior to this intervention, the UK Government supported the ‘Supporting rabies elimination in Africa through a One Health stepwise approach’ workshop in Ghana, 2023. It was jointly organised by the Global Alliance for Rabies Control (GARC) and the Food and Agriculture Organization of the United Nations (FAO) under the auspices of the Pan-African Rabies Control (PARACON) network. It brought together stakeholders from PARACON Member states (MS) that have undertaken in-country Stepwise Approach towards Rabies Elimination (SARE)."
        },
        {
            "text": "The direct cost and life savings"
        },
        {
            "text": "Here in Ashaiman, a large town and the capital of the Ashaiman Municipal Assembly in the Greater Accra Region of Ghana, a team from the Regional Veterinary Office is vaccinating dogs in each household. In each household, there are at least 5 people exposed to a dog. The team met Aaron, who owns 10 dogs. He told us, “It cost me Ghs50, (approximately £2.40), to vaccinate a dog”. He is a happy man today because he is saving Ghs500, (approximately £24), participating in UK supported dog vaccination. Five people from his household have been saved from direct possible rabies virus exposure. With the big picture in mind, Ghana could be saving, within these 60 days, Ghs75,000, (approximately £3,600), in direct vaccination cost investment. This further translates into saving 75,000 Ghanaians being directly exposed to rabies from infected dogs."
        },
        {
            "text": "The Government of Ghana estimates not less than £31.3m together with 1,186 field vaccinators is needed to eliminate rabies in Ghana by 2030. ODA-funded AHSS has demonstrated the need to start small, demonstrate success, and strengthen the system for an early rabies elimination in Ghana. The ODA-funded AHSS programme not only completes the UK’s health security offer in Ghana, but also in Africa, complementing the Foreign Commonwealth and Development Office’s £96.7million Tackling Deadly Disease in Africa programme, for which Ghana is a focal country."
        },
        {
            "text": "Expanding the scope"
        },
        {
            "text": "Ghana is one of the UK’s longest standing and strongest partners in Africa, and the AHSS project is a shining example of the strong partnership between the UK and Ghana in the area of development and science."
        },
        {
            "text": "UK’s support is a comprehensive package to strengthen Ghana’s animal health system, supporting integration into the overall health security framework of the country."
        },
        {
            "text": "The proven effect of the ODA-funded AHSS program in reducing rabies in Ghana presents the UK with a chance to showcase its commitment to a comprehensive strategy for health security in Africa. This involves utilising resources from His Majesty's Government to establish enduring collaborations and infrastructure that lessen the severity of epidemics, save lives, and protect livelihoods."
        },
        {
            "text": "ODA-funded AHSS in Ghana"
        },
        {
            "text": "The AHSS project in Ghana, is part of a flagship Official Development Assistance (ODA) funded bilateral technical partnership between the United Kingdom’s Department for Environment, Food & Rural Affairs (DEFRA) including Animal and Plant Health Agency (APHA), Veterinary Medicines Directorate (VMD) and Centre for Environment, Fisheries and Aquaculture Science (Cefas) and countries in Africa, including Ghana, Nigeria, Zambia and The Gambia."
        },
        {
            "text": "It complements efforts made by national government and other key stakeholders to achieve Zero Poverty, Zero Hunger, Good Health and Wellbeing, together with the African Union (AU) Agenda 2063, and Zero by 2030:"
        },
        {
            "text": "In Ghana, AHSS is focused on seven key strategic pillars, guided by the World Organisation for Animal Health (WOAH), Performance of Veterinary Services (PVS) framework and informed by the country needs as requested by Ghanaian officials."
        }
    ]
}