{
    "url": "https://mojdigital.blog.gov.uk/2024/03/14/a-user-centred-approach-to-the-spending-review-process/",
    "title": "A user-centred approach to the spending review process",
    "authors": [
        "Kate Stulberg"
    ],
    "categories": [
        "User Centred Design",
        "user-centered"
    ],
    "pub_date": "2024-03-14T11:57:13+01:00",
    "content": [
        {
            "heading": 3,
            "text": "What is a spending review?"
        },
        {
            "text": "It’s no secret that in 2024 there will be a General Election, and after that a spending review. A spending review is how HM Treasury decides how to distribute the total amount of money the Government plans to spend on its departments and public services. Each department must bid for the funds they think they’ll need."
        },
        {
            "text": "Typically, spending reviews cover an electoral term, so we expect the upcoming review to take us up to 2029-30. Teams across Whitehall will currently be considering what funds they will need to maintain public services over the next 5 years. But that’s not all - they’ll also need to consider what funds may be required to respond to changing external circumstances. This is particularly relevant this time round, if you think about the rapid development of new technologies such as generative AI and the opportunities this may bring for the Civil Service to modernise its services and improve productivity. "
        },
        {
            "heading": 3,
            "text": "Why make this process user-centered?"
        },
        {
            "text": "Spending reviews are usually developed in a similar way to traditional policy. Civil servants, typically from Strategy and Policy, develop ideas that are evaluated by Economists for their potential costs and benefits. "
        },
        {
            "text": "This is a tried and tested model. However, like traditional policymaking, it comes with some challenges - particularly now, in the age of vast technological advancement. Classic consultations, pilots, and evaluations can take a while to set up and assess, whereas User Centred Design (UCD) methods may be better equipped to respond to such fast-paced change. We can generate insight quickly by testing innovative ideas early and often with users, learning and iterating our thinking as we go, and having the flexibility to respond to the changing landscape around us. "
        },
        {
            "text": "A user-centred approach is also about ensuring user needs are well understood, so we’re prioritising the right problems to solve. To do this well, we need to foster an environment where we can think creatively, and to be bold in challenging existing assumptions about how things can or should work."
        },
        {
            "text": "This is why our CDIO proposed that as Justice Digital looks to contribute to the MoJ’s spending review bid, we do so from a user-centred perspective. A small team has spent the last few months exploring opportunities for digital transformation in the justice system. We’re now about to start testing different ideas that we hope will streamline policies and processes, increase productivity across the department, and ultimately deliver a better experience for our users."
        },
        {
            "heading": 3,
            "text": "What have we learned so far?"
        },
        {
            "heading": 4,
            "text": "Actions speak louder than words."
        },
        {
            "text": "It’s been challenging to approach change in this area. Many of the colleagues we need to work with in a spending review are unfamiliar with UCD, and may have misconceptions about its purpose and potential. For instance, some colleagues have expressed doubt that UCD methods can provide a robust evidence base in such a short period of time. "
        },
        {
            "text": "We’ve therefore felt it important to show colleagues as quickly as possible what a test and learn approach means in practice, and just how much insight can be gathered from engaging directly with our users. We think showing, not telling, will build confidence in this approach - one reason why we’ve decided to start testing ideas very quickly."
        },
        {
            "heading": 4,
            "text": "Multidisciplinary working is built on trust and a shared agreement of outcomes."
        },
        {
            "text": "Traditional spending review bids often feel like they are developed from the top-down, designed by Policy, and implemented by Operations. Digital may be thought of as an enabling factor in the implementation of a new idea, rather than a driver of change in its own right. Thinking in this way can reinforce siloes between disciplines, limiting collaboration around the development of new ideas. "
        },
        {
            "text": "Whilst a key component of a user-centred approach is to challenge this notion and create new ideas via multidisciplinary working, it has been difficult to achieve this in some spaces, because of how some colleagues may perceive UCD. If UCD is thought of as something Digital ‘own’, then this approach risks reinforcing the same siloes."
        },
        {
            "text": "This is why we’ve considered how we can create the conditions for true collaboration amongst different disciplines, where different parts of the department agree to work towards the same, shared outcomes. This could even involve this type of work needing to sit outside of Justice Digital, in a central space with an impartial sponsor. Hopefully, the time and effort we’re putting into this now will allow for more radical approaches to strategic work getting off the ground faster in the future."
        },
        {
            "heading": 4,
            "text": "Reactive responses to the spending review cycle limits how user-centred we can be."
        },
        {
            "text": "We are a temporary team that was only set up in September. This didn't give us much time to collect existing knowledge of user needs across the justice system - a challenge exasperated by the lack of repositories that document the user research we've already conducted, the service blueprints already developed, and the thinking already done to map how different products and services interact with each other across the justice system."
        },
        {
            "text": "Additionally, the aforementioned challenges around trust and collaboration have meant that a large proportion of our time has been supporting stakeholders to understand our approach. This has taken time away from working directly with users, filling research gaps, and as a result, has sometimes limited our ability to offer the most effective strategic advice."
        },
        {
            "text": "To help us address this point in future, we may wish to start our spending review planning even earlier, so there is sufficient time to engage directly with both users and stakeholders. It would also help to have access to a more holistic view of user needs across the justice system - something the User Research community are actively starting to explore."
        },
        {
            "heading": 3,
            "text": "What next?"
        },
        {
            "text": "Moving into the next phase of our project, we’ll be testing quick and dirty ideas with users, to identify which have the greatest potential for improving service delivery through to 2030. We’ll also work with an Economist to understand how we can weave an agile, user-centred approach into the more static requirements of a spending review bid. "
        },
        {
            "text": "We hope that the biggest hurdles of this project have already been experienced, and that the work done early to build understanding and buy-in around UCD will help us in the long run. But we don’t know what’s yet to come - this is the first time we have worked on a spending review in this way at Justice Digital. We truly are working in the unknown. So I’m sure there’ll be more reflections and learnings later on this year."
        }
    ]
}