{
    "url": "https://food.blog.gov.uk/2024/03/14/british-science-week-career-conversations-with-fsa-scientists/",
    "title": "British Science Week – Career conversations with FSA scientists",
    "authors": [
        "Rick Mumford, Deputy Director, Science Evidence and Research, Deputy CSA",
        "Michelle Patel, Deputy Director, Analysis and Insight"
    ],
    "categories": [
        "People",
        "Science"
    ],
    "pub_date": "2024-03-14T09:09:15+00:00",
    "content": [
        {
            "text": "Cymraeg"
        },
        {
            "text": "With activity well underway for British Science Week, we wanted to shine a light on our scientists and help others connect to the interesting and varied work they do."
        },
        {
            "text": "The Food Standard Agency (FSA)’s fundamental mission is to ensure that the food we buy and eat is safe and what it says it is. Our scientists lie at the heart of the research and evidence we use to make the decisions that help protect animal and public health."
        },
        {
            "text": "Our scientists are some of the best in the world and we are excited to introduce a few of them to you today."
        },
        {
            "heading": 2,
            "text": "Frederique Marie Uy - Toxicological Risk Assessor"
        },
        {
            "text": "What is your current team and job title? "
        },
        {
            "text": "Hello! My name is Frederique Marie Uy and I am a Toxicological Risk Assessor in the Risk Assessment Unit of the Science, Evidence and Research Directorate (SERD) at the FSA."
        },
        {
            "text": "How long have you been at the FSA? "
        },
        {
            "text": "I started at the FSA in November 2018, which was also the beginning of my career as a civil servant."
        },
        {
            "text": "How would you describe what you do, in the simplest terms?"
        },
        {
            "text": "My role is to help deliver one of the core purposes of the FSA, to ensure that food is safe and what it says it is and is healthy and more sustainable."
        },
        {
            "text": "For example, food or animal feed may contain chemicals that have been intentionally added, like a food colouring or a preservative or may contain a chemical due to contamination, such as a pesticide or a radioactive substance. These chemicals could have the potential to cause harm to the person or animal that consumes it. I utilise a variety of scientific methods and data to help assess the level of risk that the consumer may be exposed to."
        },
        {
            "text": "I also carry out secretariat work for our Scientific Advisory Committees and Joint Expert Groups, which are independent groups of experts that advise the FSA on various aspects of food safety."
        },
        {
            "text": "With the food industry and public diet constantly changing, there are always new and emerging concerns when it comes to food safety. My role extends to helping identify areas that may require further research. Recent examples include novel foods such as cell-based proteins, alternative food packaging materials, and emerging environmental contaminants that may find their way into the food chain like microplastics."
        },
        {
            "text": "How does science feed into your current role?"
        },
        {
            "text": "Science is at the core of my role. To help determine the level of risk a certain chemical has to a consumer, I firstly gather scientific data that describes the toxicological profile of a chemical from available literature and publications. This helps to better identify and understand how it may cause harm. We call this a “hazard profile”. This information is then combined with an exposure assessment which helps determine how much of the chemical an individual would be exposed to and the safety risk from exposure."
        },
        {
            "text": "The output of this risk assessment helps policy makers make scientifically based decisions on whether any legal measures should be taken to help protect the public."
        },
        {
            "text": "It is also possible that there is a lack of scientific data available to carry out a robust risk assessment. Keeping up to date with new scientific methodologies (especially those that do not involve the use of animals) to find out the safety profile of a chemical also plays a key role to help ensure that the way we perform our risk assessments are in tune with cutting edge scientific developments."
        },
        {
            "text": "What did you work on before joining the FSA?"
        },
        {
            "text": "I worked as a chemical regulation’s consultant specialising in assisting clients to comply with an EU regulation (REACH Regulation). I also worked as a cosmetics packaging safety assessor. Whilst performing these roles, I simultaneously undertook part-time study for my Master’s degree in Toxicology at the University of Birmingham. Juggling my time between these commitments was challenging, but I would not trade the experience."
        },
        {
            "text": "What was your childhood dream job? "
        },
        {
            "text": "It was completely non-scientific. My childhood dream job was to become an air hostess. It seemed so glamorous to be travelling all over the world, experiencing new cultures, sights and most importantly, food."
        },
        {
            "text": "What is the best piece of career advice you have ever received?"
        },
        {
            "text": "To build on your resilience. In the ever-changing field of science, I think it is important to keep a positive frame of mind and have the courage and willingness to try new concepts, methodologies, and theories. This also extends to different career paths especially if you consider yourself to be a deep specialist."
        },
        {
            "text": "I strongly believe that being resilient is an essential life skill in general, but especially as a scientist."
        },
        {
            "text": "If you could give one piece of advice to people about engaging with science, what would it be? "
        },
        {
            "text": "Try to not temper your curiosity and ask those ‘silly questions’! Everyone has a different perspective, and your interpretation may shed some light to help answer those ‘million-dollar’ questions or discover something entirely new."
        },
        {
            "heading": 2,
            "text": "Dan Lloyd - Senior Regulated Products Risk Assessor"
        },
        {
            "text": "What is your current team and job title?"
        },
        {
            "text": "Senior Regulated products risk assessor in the Novel Food risk assessment team."
        },
        {
            "text": "How long have you been at the FSA?"
        },
        {
            "text": "I joined the Microbiological risk assessment team almost three years ago in May 2021 before moving to Novel food regulated products last year."
        },
        {
            "text": "How would you describe what you do, in the simplest terms?"
        },
        {
            "text": "I assess the risk (shocking I know) of novel food applications submitted by companies that want to sell them in the UK. Everything from human breast milk sugars to be added to infant formula, to cell cultivated products like lab grown meat. My team assesses if the applicant has demonstrated that the food is safe across several criteria. The outcome is then passed on to risk managers who make the decision if the food should be recommended for authorisation."
        },
        {
            "text": "How does science feed into your current role?"
        },
        {
            "text": "Without taking a good scientific approach my current role wouldn’t be possible. We rely on applicants providing high quality data on their product, then we take an analytical approach to interpreting the data in the context of the specific food production process."
        },
        {
            "text": "Novel foods are often highly complex products that pose various potential hazards, and it is simply not possible to be an expert in every area. We work with our advisory committee the Advisory Committee on Novel Foods and Processes"
        },
        {
            "text": "(ACNFP) made of various experts who provide input and inform the final risk assessment."
        },
        {
            "text": "What did you work on before joining the FSA?"
        },
        {
            "text": "I finished my PhD on antibiotic resistance during the 2nd Covid lockdown and had already decided I didn’t want to stay in academia. Thanks to a placement at Public Health England during my PhD, I already knew there were science roles in government. I just happened to search on Civil service jobs two days before a post closed for a position in the Micro team, and the rest is history!"
        },
        {
            "text": "What was your childhood dream job?"
        },
        {
            "text": "I grew up in an area where university wasn’t really discussed as an option during school. I was always interested in data and analytical processes, so thought I wanted to be a doctor. Growing up, that was the only career I knew about that used those skills. When I went to college, an amazing and supportive teacher introduced me to an entire sector of science that I didn’t know existed. This instantly changed the path I was on and led to me being here now!"
        },
        {
            "text": "What is the best piece of career advice you have ever received?"
        },
        {
            "text": "That you have to just try it, give it your all and you might just succeed. Even if you don’t, you will have still done something great! I would also have to add an honourable mention for ‘Fake it till you make it’!"
        },
        {
            "text": "If you could give one piece of advice to people about engaging with science, what would it be?"
        },
        {
            "text": "We aren’t scary. Most of us love to talk about what we do, but we don’t always know what you need to know, so don’t be afraid to ask!"
        },
        {
            "heading": 2,
            "text": "Amy Hale - Microbiological Risk Assessor"
        },
        {
            "text": "What is your current team and job title? "
        },
        {
            "text": "I am a Microbiological Risk Assessor in the microbiological risk assessment team. We are part of the wider risk assessment unit here at the FSA."
        },
        {
            "text": "How long have you been at the FSA? "
        },
        {
            "text": "I am still new! I have only been here for five months."
        },
        {
            "text": "How would you describe what you do, in the simplest terms?  "
        },
        {
            "text": "Every day in the UK food is tested to make sure it is safe for us to eat. Sometimes those tests show us that there could be harmful microbes in a particular food that would make it unsafe. Our team will look at all the evidence in the research as well as what is given to us by the food business, and we decide on how risky that food is. It is then passed to the policy team who will make a recommendation based on our information. We also help with outbreaks of food poisoning, assist with research projects and do long-term risk assessments."
        },
        {
            "text": "How does science feed into your current role?"
        },
        {
            "text": "Science is the basis of what I do every day. I use published scientific research to provide evidence for understanding the microbiological safety of food and to keep the safety updated. I need to be able to understand scientific literature easily and be able to recognise quality science and sources."
        },
        {
            "text": "What did you work on before joining the FSA?"
        },
        {
            "text": "I have worked in laboratories including the NHS, in microbiology and histology. I have also worked in education as an engineering Education Officer."
        },
        {
            "text": "What was your childhood dream job? "
        },
        {
            "text": "I always wanted to be a scientist of some kind. I also wanted to be an archaeologist, as I am interested in history. Essentially, I just wanted a role that would help me understand the world better, which is what science is all about."
        },
        {
            "text": "What is the best piece of career advice you have ever received?"
        },
        {
            "text": "The best piece of advice I received was to follow what I am passionate about. It has meant that I am always interested in what I am doing, which allows me to work harder and be more likely to succeed. It also means that my work is never too difficult because I am enjoying the challenges!"
        },
        {
            "text": "If you could give one piece of advice to people about engaging with science, what would it be?"
        },
        {
            "text": "Science can be a bit overwhelming sometimes, but I would recommend that you make sure you have the basics down. Understanding how scientific journals and research works will help you, regardless of the field you are in, and allow you to learn more and more."
        },
        {
            "heading": 2,
            "text": "Aoibheann Dunne - Nutrition Science Lead"
        },
        {
            "text": "What is your current team and job title? "
        },
        {
            "text": "I am the Nutrition Science Lead in the Science and Surveillance team."
        },
        {
            "text": "How long have you been at the FSA? "
        },
        {
            "text": "I started in the FSA as a Nutrition Science Advisor in April 2021."
        },
        {
            "text": "How would you describe what you do, in the simplest terms?  "
        },
        {
            "text": "I work on the FSA’s dietary health surveys which collects nutrition surveillance data. These include projects investigating Northern Ireland food and drink purchasing, the FSA’s Food and You 2 Survey and other consumer attitudes and purchasing surveys."
        },
        {
            "text": "I lead on the coordination of the Northern Ireland boosted sample of the National Diet and Nutrition survey with colleagues from the Department of Health and Safefood, representing Northern Ireland at UK Project Board meetings. Together, these projects let us know what consumers in Northern Ireland are eating, what they are buying, and what they are thinking with regards to food. This picture then informs dietary health policy development, implementation and evaluation in Northern Ireland."
        },
        {
            "text": "I represent the Food Standards Agency in Northern Ireland as an official government observer at the Scientific Advisory Committee on Nutrition meetings and subgroup meetings. I was also awarded the title of Honorary Lecturer for the School of Biological Sciences at Queen’s University Belfast in September 2023. These roles help keep me up-to-do with the latest scientific research."
        },
        {
            "text": "What did you work on before joining the FSA?"
        },
        {
            "text": "I studied Human Nutrition at the Ulster University, Coleraine. I worked as a trainee researcher for 9-months with the World Health Organization at the International Agency for Research on Cancer in Lyon, France. As a trainee, I worked on developing a 24-hour dietary recall system for use in an Irish population. I completed a PhD at Ulster University where my research projects focused on developing tools to assess people’s exposure to low-calorie sweeteners. I then used these tools to investigate how low-calorie sweeteners may affect body weight and blood glucose levels. These roles have enhanced my expertise in dietary assessment methodologies and have greatly benefitted me in my current role."
        },
        {
            "text": "What was your childhood dream job? "
        },
        {
            "text": "I always wanted to be a scientist – but not the type I am now. I watched quite a lot MythBusters when I was younger, so I was very into the idea of conducting mad experiments and blowing stuff in the name of science. Science at the FSA is lot less dramatic and edgy, but definitely a lot safer."
        },
        {
            "text": "What is the best piece of career advice you have ever received?"
        },
        {
            "text": "At an Early Career Scientist Association round table, someone spoke about the importance of never feeling locked down in a career. They had been a scientist in academia, then entered industry and then public health. She said you may feel the need to specialise early and become an expert in certain fields, but by being flexible when choosing roles, you can become experienced in many different areas. I applied this mantra early in my career as a nutritionist. After my PhD, I decided to move to the FSA as I have always been drawn to the nexus between academia and public health. We know a lot about nutrition from a research point of view, but it is more difficult to put this knowledge into practice for people at national level. Combing these two worlds has allowed me to explore my passion of both nutrition and psychology, hopefully using my scientific background to improve to the dietary health and nutritional status of the nation."
        },
        {
            "text": "If you could give one piece of advice to people about engaging with science, what would it be? "
        },
        {
            "text": "My advice would be to ask for help when you need it. There are plenty of professionals who are eager to share scientific methods to make your role easier. Engaging with science can feel a bit dauting, but attending training on using data analysis can really help. You can also research scientific articles to become more experienced in a topic. Science can help you evaluate your projects, mitigating future mistakes and improving your project management."
        },
        {
            "heading": 1,
            "text": "Wythnos Wyddoniaeth Prydain – Sgwrsio â gwyddonwyr yr ASB am yrfaoedd"
        },
        {
            "text": "A hithau’n Wythnos Wyddoniaeth Prydain, dyma gyflwyno ein gwyddonwyr, a chynnig cyfle i ddysgu mwy am y gwaith diddorol ac amrywiol y maent yn ei wneud."
        },
        {
            "text": "Cenhadaeth sylfaenol yr Asiantaeth Safonau Bwyd (ASB) yw sicrhau bod y bwyd rydym yn ei brynu a’i fwyta’n ddiogel ac yn cyd-fynd â’r hyn sydd ar y label. Mae ein gwyddonwyr wrth wraidd yr ymchwil a’r dystiolaeth a ddefnyddiwn i wneud y penderfyniadau sy’n helpu i ddiogelu iechyd y cyhoedd ac iechyd anifeiliaid."
        },
        {
            "text": "Mae ein gwyddonwyr ymhlith y gorau yn y byd, ac mae’n bleser gennym gyflwyno rhai ohonynt heddiw."
        },
        {
            "heading": 1,
            "text": "Frederique Marie Uy - Asesydd Risg Wenwynegol"
        },
        {
            "text": "Ym mha dîm rydych chi’n gweithio ar hyn o bryd a beth yw teitl eich swydd? "
        },
        {
            "text": "Helô! Fy enw i yw Frederique Marie Uy ac rwy’n Asesydd Risg Wenwynegol yn yr Uned Asesu Risg yng Nghyfarwyddiaeth Gwyddoniaeth, Tystiolaeth ac Ymchwil (SERD) yr ASB."
        },
        {
            "text": "Ers pryd rydych chi wedi bod yn yr ASB?"
        },
        {
            "text": "Dechreuais i yn yr ASB ym mis Tachwedd 2018, sef dechrau fy ngyrfa fel gwas sifil hefyd."
        },
        {
            "text": "Sut byddech chi’n disgrifio eich gwaith yn syml iawn?  "
        },
        {
            "text": "Fy rôl i yw helpu i gyflawni un o ddibenion craidd yr ASB, sef sicrhau bod bwyd yn ddiogel, ei fod yn cyd-fynd â’r hyn sydd ar y label, a’i fod yn iach ac yn fwy cynaliadwy."
        },
        {
            "text": "Er enghraifft, gall bwyd neu fwyd anifeiliaid gynnwys cemegion sydd wedi’u hychwanegu’n fwriadol, fel sylwedd lliw bwyd neu gyffeithydd (preservative), neu gallent gynnwys cemegyn oherwydd halogiad, fel plaladdwr neu sylwedd ymbelydrol. Gallai’r cemegion hyn achosi niwed i’r person neu’r anifail sy’n eu bwyta. Rwy’n defnyddio amrywiaeth o ddulliau a data gwyddonol i helpu i asesu lefel y risg y gallai defnyddwyr fod yn agored iddi."
        },
        {
            "text": "Rwy hefyd yn gwneud gwaith ysgrifenyddol ar gyfer ein Pwyllgorau Cynghori Gwyddonol a’n Grwpiau Arbenigol ar y Cyd, sef grwpiau annibynnol o arbenigwyr sy’n cynghori’r ASB ynghylch gwahanol agweddau ar ddiogelwch bwyd."
        },
        {
            "text": "Gan fod y diwydiant bwyd a deiet y cyhoedd yn newid drwy’r amser, mae pryderon newydd yn dod i’r amlwg byth a hefyd o ran diogelwch bwyd. Mae fy rôl hefyd yn cynnwys helpu i nodi meysydd y gallai fod angen ymchwilio iddynt ymhellach. Mae enghreifftiau diweddar yn cynnwys bwydydd newydd fel proteinau sy’n seiliedig ar gelloedd, deunydd pecynnu bwyd amgen, a halogion amgylcheddol sy’n dod i’r amlwg a allai gyrraedd y gadwyn fwyd, fel microblastigau."
        },
        {
            "text": "Sut mae gwyddoniaeth yn rhan o’ch rôl bresennol? "
        },
        {
            "text": "Gwyddoniaeth sydd wrth wraidd fy rôl. Er mwyn helpu i bennu lefel y risg y gall cemegyn penodol ei beri i ddefnyddiwr, rwy’n mynd ati yn gyntaf i gasglu data gwyddonol sy’n disgrifio proffil gwenwynegol cemegyn o’r llenyddiaeth a’r cyhoeddiadau sydd ar gael. Mae hyn yn helpu i nodi a deall yn well sut y gallai achosi niwed. Yr enw ar hyn yw ‘proffil perygl’. Yna, caiff yr wybodaeth hon ei chyfuno ag asesiad aramlygiad (exposure). Mae hyn yn helpu i bennu faint o’r cemegyn y byddai unigolyn yn dod i gysylltiad ag ef a’r risg diogelwch yn sgil hynny."
        },
        {
            "text": "Mae canlyniad yr asesiad risg hwn yn helpu llunwyr polisïau i wneud penderfyniadau ar sail wyddonol ynghylch a ddylid cymryd unrhyw fesurau cyfreithiol er mwyn helpu i ddiogelu’r cyhoedd."
        },
        {
            "text": "Mae hefyd yn bosib bod diffyg data gwyddonol ar gael i allu cynnal asesiad risg cadarn. Mae dilyn y diweddaraf o ran methodolegau gwyddonol newydd (yn enwedig y rhai nad ydynt yn cynnwys defnyddio anifeiliaid) i ddarganfod proffil diogelwch cemegyn hefyd yn chwarae rhan allweddol wrth helpu i sicrhau bod y ffordd yr ydym yn cynnal ein hasesiadau risg yn gydnaws â datblygiadau gwyddonol arloesol."
        },
        {
            "text": "Beth oedd eich gwaith cyn ymuno â’r ASB? "
        },
        {
            "text": "Bues i’n gweithio fel ymgynghorydd rheoleiddio cemegol gan helpu cleientiaid i gydymffurfio â rheoliad yr UE (Rheoliad REACH). Roeddwn i hefyd yn gweithio fel asesydd diogelwch deunydd pecynnu colur. Wrth wneud y swyddi hyn, roeddwn i’n astudio’n rhan-amser ar yr un pryd ar gyfer fy ngradd Meistr mewn Tocsicoleg ym Mhrifysgol Birmingham. Roedd rheoli fy amser rhwng yr ymrwymiadau hyn yn heriol, ond fyddwn i ddim yn newid dim."
        },
        {
            "text": "Pa swydd roeddech chi’n breuddwydio am ei gwneud pan oeddech chi’n blentyn? "
        },
        {
            "text": "Doedd hi ddim yn ymwneud â gwyddoniaeth o gwbl! Fy swydd ddelfrydol pan oeddwn i’n blentyn oedd dod yn stiwardes awyr. Roedd gallu teithio ar draws y byd, gan brofi diwylliannau ac ymweld â llefydd newydd ac, yn bwysicaf oll i gyd, fwyta bwyd newydd mor apelgar, fel bywyd seren ffilmiau!"
        },
        {
            "text": "Beth yw’r darn gorau o gyngor ar eich gyrfa a gawsoch chi erioed?\n"
        },
        {
            "text": "Y cyngor gorau oedd y dylwn i adeiladu ar fod yn wydn. Ym maes gwyddoniaeth, sy’n newid drwy’r amser, rwy’n teimlo ei bod hi’n bwysig aros yn gadarnhaol, a bod yn ddigon dewr a pharod i roi cynnig ar gysyniadau, methodolegau a damcaniaethau newydd. Mae hyn hefyd yn berthnasol i wahanol lwybrau gyrfa, yn enwedig os ydych chi’n ystyried eich hun yn arbenigwr mewn maes penodol."
        },
        {
            "text": "Rwy’n credu’n gryf bod gwydnwch yn sgìl bywyd hanfodol yn gyffredinol, ond yn enwedig fel gwyddonydd."
        },
        {
            "text": "Wrth feddwl am ymgysylltu â gwyddoniaeth, pa un darn o gyngor byddech chi’n ei roi i bobl?\nPeidiwch â thawelu’ch chwilfrydedd, a da chi – gofynnwch y cwestiynau ‘twp’ hynny! Mae gan bawb safbwynt gwahanol, ac efallai y bydd eich dehongliad yn taflu rhywfaint o oleuni i helpu i ateb y cwestiynau pwysig hynny neu i ddarganfod rhywbeth hollol newydd."
        },
        {
            "heading": 2,
            "text": "Dan Lloyd - Uwch-asesydd Risg Cynhyrchion Rheoleiddiedig"
        },
        {
            "text": "Ym mha dîm rydych chi’n gweithio ar hyn o bryd a beth yw teitl eich swydd? "
        },
        {
            "text": "Uwch-asesydd risg cynhyrchion rheoleiddiedig yn y tîm Asesu Risg Bwydydd Newydd."
        },
        {
            "text": "Ers pryd rydych chi wedi bod yn yr ASB? "
        },
        {
            "text": "Ymunais i â’r tîm Asesu Risg Ficrobiolegol bron i dair blynedd yn ôl ym mis Mai 2021 cyn symud i’r tîm cynhyrchion rheoleiddiedig newydd y llynedd."
        },
        {
            "text": "Sut byddech chi’n disgrifio eich gwaith yn syml iawn?  "
        },
        {
            "text": "Rwy’n asesu’r risgiau (syfrdanol, rwy’n gwybod) mewn ceisiadau bwydydd newydd sy’n cael eu cyflwyno gan gwmnïau sydd am werthu’r bwydydd newydd hynny yn y DU. Mae hyn yn cynnwys popeth o siwgrau llaeth y fron i’w hychwanegu at fformiwla fabanod, i gynhyrchion a wneir drwy feithrin celloedd fel cig a dyfir mewn labordy. Mae fy nhîm yn asesu a yw’r ymgeisydd wedi dangos bod y bwyd yn ddiogel yn unol â sawl maen prawf. Yna caiff y canlyniad ei drosglwyddo i reolwyr risg sy’n penderfynu a ddylid awdurdodi’r bwyd ai peidio."
        },
        {
            "text": "Sut mae gwyddoniaeth yn rhan o’ch rôl bresennol? "
        },
        {
            "text": "Heb gymryd camau sy’n seiliedig ar wyddoniaeth, fyddai fy rôl bresennol i ddim yn bosib. Rydyn ni’n dibynnu ar yr ymgeiswyr i ddarparu data o ansawdd uchel mewn perthynas â’u cynhyrchion, yna rydyn ni’n defnyddio dull dadansoddol er mwyn dehongli’r data yng nghyd-destun y broses benodol ar gyfer cynhyrchu’r bwyd."
        },
        {
            "text": "Mae bwydydd newydd yn aml yn gynhyrchion hynod gymhleth sy’n achosi peryglon posib amrywiol, ac yn syml iawn dyw hi ddim yn bosib bod yn arbenigwr ym mhob maes. Rydyn ni’n gweithio gyda’n pwyllgor cynghori, y Pwyllgor Cynghori ar Fwydydd a Phrosesau Newydd (ACNFP), sef grŵp o arbenigwyr amrywiol sy’n darparu mewnbwn ac sy’n llywio’r asesiad risg terfynol."
        },
        {
            "text": "Beth oedd eich gwaith cyn ymuno â’r ASB? "
        },
        {
            "text": "Gwnes i gwblhau fy PhD ar ymwrthedd i wrthfiotigau adeg COVID-19, yn ystod yr ail gyfnod clo, ac roeddwn i wedi penderfynu’n barod nad oeddwn i am aros yn y byd academaidd. Yn dilyn lleoliad gwaith gydag Iechyd Cyhoeddus Lloegr yn ystod fy PhD, roeddwn i’n gwybod yn barod bod swyddi ym maes gwyddoniaeth ar gael yn y llywodraeth. Gwnes i ddigwydd chwilio ar wefan swyddi’r Gwasanaeth Sifil ddeuddydd cyn y dyddiad cau ar gyfer swydd yn y Tîm Micro, a hen hanes yw’r gweddill!"
        },
        {
            "text": "Pa swydd roeddech chi’n breuddwydio am ei gwneud pan oeddech chi’n blentyn? "
        },
        {
            "text": "Ces i fy magu mewn ardal lle nad oedd y brifysgol yn cael ei hawgrymu fel opsiwn yn ystod yr ysgol. Roeddwn i wastad â diddordeb mewn data a phrosesau dadansoddol, felly roeddwn i’n meddwl fy mod i eisiau bod yn feddyg. Pan oeddwn i’n iau, dyna’r unig yrfa roeddwn i’n gwybod amdani oedd yn defnyddio’r sgiliau hynny. Pan es i i’r coleg, gwnaeth athro anhygoel a chefnogol ddangos sector cyfan o wyddoniaeth i mi nad oeddwn i’n gwybod dim amdano. Newidiodd hyn y llwybr roeddwn i arno ar unwaith, a dyna sy’n gyfrifol am y ffaith fy mod i yma nawr!"
        },
        {
            "text": "Beth yw’r darn gorau o gyngor ar eich gyrfa a gawsoch chi erioed?"
        },
        {
            "text": "Mae’n rhaid i chi roi cynnig arni, gwneud eich gorau glas ac efallai byddwch chi’n llwyddo. Hyd yn oed os na fyddwch chi’n llwyddo, byddwch chi wedi gwneud rhywbeth gwych! Hoffwn i hefyd dalu teyrnged i’r hen ddihareb enwog, ‘Fake it till you make it’!"
        },
        {
            "text": "Wrth feddwl am ymgysylltu â gwyddoniaeth, pa un darn o gyngor byddech chi’n ei roi i bobl?"
        },
        {
            "text": "Dydyn ni ddim yn bobl frawychus. Mae’r rhan fwyaf ohonom ni wrth ein boddau’n siarad am ein gwaith, ond dydyn ni ddim bob amser yn gwybod beth sydd angen i chi ei wybod, felly peidiwch â bod ofn gofyn!"
        },
        {
            "heading": 2,
            "text": "Amy Hale – Asesydd Risg Ficrobiolegol"
        },
        {
            "text": "Ym mha dîm rydych chi’n gweithio ar hyn o bryd a beth yw teitl eich swydd? "
        },
        {
            "text": "Rwy’n Asesydd Risg Ficrobiolegol yn y tîm asesu risg ficrobiolegol. Rydyn ni’n rhan o’r uned asesu risg ehangach yma yn yr ASB."
        },
        {
            "text": "Ers pryd rydych chi wedi bod yn yr ASB? "
        },
        {
            "text": "Dwi’n dal i fod yn newydd! Dim ond ers pum mis dw i wedi bod yma."
        },
        {
            "text": "Sut byddech chi’n disgrifio eich gwaith yn syml iawn?  "
        },
        {
            "text": "Bob dydd yn y DU, mae bwyd yn cael ei brofi i wneud yn siŵr ei fod yn ddiogel i ni ei fwyta. Weithiau, mae’r profion hynny’n dangos y gallai fod microbau niweidiol mewn bwyd penodol a fyddai’n ei gwneud yn anniogel i’w fwyta. Bydd ein tîm yn edrych ar yr holl dystiolaeth yn yr ymchwil, yn ogystal â’r hyn a roddir i ni gan y busnes bwyd, a byddwn yn penderfynu pa mor beryglus yw’r bwyd hwnnw. Yna, caiff hyn ei drosglwyddo i’r tîm polisi a fydd yn gwneud argymhelliad yn seiliedig ar ein gwybodaeth. Rydyn ni hefyd yn helpu gyda brigiadau o achosion o wenwyn bwyd, yn cynorthwyo gyda phrosiectau ymchwil ac yn cynnal asesiadau risg hirdymor."
        },
        {
            "text": "Sut mae gwyddoniaeth yn rhan o’ch rôl bresennol? "
        },
        {
            "text": "Gwyddoniaeth yw sylfaen fy ngwaith bob dydd. Rwy’n defnyddio ymchwil wyddonol gyhoeddedig i ddarparu tystiolaeth er mwyn deall diogelwch microbiolegol bwyd ac i sicrhau bod yr wybodaeth am ddiogelwch yn gyfredol. Mae angen i mi allu deall llenyddiaeth wyddonol yn hawdd a gallu adnabod gwyddoniaeth a ffynonellau o safon."
        },
        {
            "text": "Beth oedd eich gwaith cyn ymuno â’r ASB? "
        },
        {
            "text": "Dw i wedi gweithio mewn labordai, gan gynnwys yn y GIG, ym meysydd microbioleg a histoleg. Dw i hefyd wedi gweithio ym myd addysg fel swyddog addysg beirianneg."
        },
        {
            "text": "Pa swydd roeddech chi’n breuddwydio am ei gwneud pan oeddech chi’n blentyn? "
        },
        {
            "text": "Roeddwn i bob amser eisiau bod yn wyddonydd o ryw fath. Roeddwn i hefyd eisiau bod yn archeolegydd, gan fod gen i ddiddordeb mewn hanes. Yn y bôn, roeddwn i eisiau rôl a fyddai’n fy helpu i ddeall y byd yn well, sef hanfod gwyddoniaeth."
        },
        {
            "text": "Beth yw’r darn gorau o gyngor ar eich gyrfa a gawsoch chi erioed? "
        },
        {
            "text": "Y darn gorau o gyngor a gefais i oedd y dylwn i ddilyn yr hyn dw i’n frwd drosto. Mae wedi golygu fy mod i wastad â diddordeb yn yr hyn dw i’n ei wneud, sy’n fy ngalluogi i weithio’n galetach a bod yn fwy tebygol o lwyddo. Mae hefyd yn golygu nad yw fy ngwaith byth yn rhy anodd oherwydd fy mod i’n mwynhau’r heriau!"
        },
        {
            "text": "Wrth feddwl am ymgysylltu â gwyddoniaeth, pa un darn o gyngor byddech chi’n ei roi i bobl? "
        },
        {
            "text": "Gall gwyddoniaeth fod bach yn llethol weithiau, ond byddwn i’n argymell eich bod chi’n sicrhau eich bod chi’n deall y pethau sylfaenol. Bydd deall sut mae cyfnodolion ac ymchwil wyddonol yn gweithio yn eich helpu, dim ots ym mha faes rydych chi’n gweithio, a bydd yn eich helpu i ddysgu mwy a mwy."
        },
        {
            "heading": 2,
            "text": "Aoibheann Dunne - Arweinydd Gwyddor Maeth"
        },
        {
            "text": "Ym mha dîm rydych chi’n gweithio ar hyn o bryd a beth yw teitl eich swydd? "
        },
        {
            "text": "Rwy’n Arweinydd Gwyddor Maeth yn y tîm Gwyddoniaeth a Gwyliadwriaeth."
        },
        {
            "text": "Ers pryd rydych chi wedi bod yn yr ASB? "
        },
        {
            "text": "Dechreuais i yn yr ASB fel Cynghorydd Gwyddor Maeth ym mis Ebrill 2021."
        },
        {
            "text": "Sut byddech chi’n disgrifio eich gwaith yn syml iawn?  "
        },
        {
            "text": "Rwy’n gweithio ar arolygon iechyd deietegol yr ASB sy’n casglu data gwyliadwriaeth ar faeth. Mae’r rhain yn cynnwys prosiectau sy’n ymchwilio i’r arferion yng Ngogledd Iwerddon o ran prynu bwyd a diod, Arolwg Bwyd a Chi 2 yr ASB, ac arolygon eraill ar agweddau defnyddwyr ac arferion prynu."
        },
        {
            "text": "Rwy’n arwain y gwaith o gydgysylltu sampl amlygedig Gogledd Iwerddon o’r arolwg Deiet a Maeth Cenedlaethol gyda chydweithwyr o’r Adran Iechyd a Safefood, gan gynrychioli Gogledd Iwerddon yng nghyfarfodydd Bwrdd Prosiect y DU. Gyda’i gilydd, mae’r prosiectau hyn yn rhoi gwybod i ni beth mae defnyddwyr yng Ngogledd Iwerddon yn ei fwyta, beth maen nhw’n ei brynu, a beth maen nhw’n ei feddwl o ran bwyd. Mae’r darlun hwn wedyn yn llywio datblygiad, gweithrediad a gwerthusiad polisi iechyd deietegol yng Ngogledd Iwerddon."
        },
        {
            "text": "Rwy’n cynrychioli’r Asiantaeth Safonau Bwyd yng Ngogledd Iwerddon fel arsylwr swyddogol y llywodraeth yng nghyfarfodydd y Pwyllgor Cynghori Gwyddonol ar Faeth a chyfarfodydd yr is-grŵp. Hefyd rhoddwyd y teitl Darlithydd Anrhydeddus i mi gan Ysgol y Gwyddorau Biolegol ym Mhrifysgol Queen’s, Belfast, ym mis Medi 2023. Mae’r rolau hyn yn fy helpu i fod â’r wybodaeth ddiweddaraf ym maes ymchwil wyddonol."
        },
        {
            "text": "Beth oedd eich gwaith cyn ymuno â’r ASB? "
        },
        {
            "text": "Astudiais Faeth Dynol ym Mhrifysgol Ulster, Coleraine. Gweithiais fel ymchwilydd dan hyfforddiant am 9 mis gyda Sefydliad Iechyd y Byd yn yr Asiantaeth Ryngwladol ar gyfer Ymchwil i Ganser yn Lyon, Ffrainc. Fel hyfforddai, bues i’n gweithio ar ddatblygu system ddeietegol 24 awr ar gyfer galw cynhyrchion yn ôl i’w defnyddio ymhlith Gwyddelod. Gwnes i gwblhau fy PhD ym Mhrifysgol Ulster lle roedd fy mhrosiectau ymchwil yn canolbwyntio ar ddatblygu offer i asesu cysylltiad pobl â melysyddion calorïau isel. Yna, defnyddiais yr offer hyn i ymchwilio i sut y gall melysyddion calorïau isel effeithio ar bwysau’r corff a lefelau glwcos yn y gwaed. Mae’r rolau hyn wedi gwella fy arbenigedd mewn methodolegau asesu deietegol ac maen nhw wedi bod o fudd mawr i mi yn fy rôl bresennol."
        },
        {
            "text": "Pa swydd roeddech chi’n breuddwydio am ei gwneud pan oeddech chi’n blentyn? "
        },
        {
            "text": "Roeddwn i wastad eisiau bod yn wyddonydd – ond nid y math o wyddonydd ydw i nawr. Roeddwn i’n gwylio cryn dipyn o MythBusters pan oeddwn i’n iau, felly roeddwn i’n hoff iawn o’r syniad o gynnal arbrofion gwallgof a ffrwydro pethau yn enw gwyddoniaeth. Mae gwyddoniaeth yn yr ASB yn llawer llai dramatig, ond yn bendant yn llawer mwy diogel."
        },
        {
            "text": "Beth yw’r darn gorau o gyngor ar eich gyrfa a gawsoch chi erioed? "
        },
        {
            "text": "Yn ystod un o gyfarfodydd y Gymdeithas Gwyddonwyr Newydd, siaradodd rhywun am bwysigrwydd peidio byth â theimlo dan glo mewn gyrfa. Roedd y person hwnnw wedi bod yn wyddonydd yn y byd academaidd, cyn symud i’r diwydiant ac wedyn iechyd y cyhoedd. Dywedodd efallai y byddwch chi’n teimlo’r angen i arbenigo mewn pwnc penodol yn gynnar a dod yn arbenigwr mewn meysydd penodol, ond trwy fod yn hyblyg wrth ddewis swyddi, gallwch chi ddod yn brofiadol mewn llawer o wahanol feysydd. Gwnes i lynu wrth hyn wrth ddechrau fy ngyrfa fel maethegydd. Ar ôl cwblhau fy PhD, penderfynais symud i’r ASB gan fy mod i wedi cael fy nenu erioed at y cysylltiad rhwng y byd academaidd ac iechyd y cyhoedd. Rydyn ni’n gwybod llawer am faeth o safbwynt ymchwil, ond mae’n anoddach rhoi’r wybodaeth hon ar waith i bobl ar lefel genedlaethol. Mae gweithio yn y ddau fyd hyn wedi fy ngalluogi i archwilio fy angerdd dros faeth a seicoleg, gan obeithio defnyddio fy nghefndir gwyddonol i wella iechyd deietegol a statws maethol y genedl."
        },
        {
            "text": "Wrth feddwl am ymgysylltu â gwyddoniaeth, pa un darn o gyngor byddech chi’n ei roi i bobl? "
        },
        {
            "text": "Fy nghyngor i fyddai gofyn am help pan fydd ei angen arnoch chi. Mae digonedd o weithwyr proffesiynol sy’n awyddus i rannu dulliau gwyddonol er mwyn gwneud eich rôl yn haws. Gall ymgysylltu â gwyddoniaeth deimlo braidd yn frawychus, ond wrth fynd i sesiynau hyfforddi ar ddefnyddio dulliau dadansoddi data, dylai’r ofn gilio cryn dipyn! Gallwch chi hefyd ymchwilio i erthyglau gwyddonol i ddod yn fwy profiadol mewn pwnc. Gall gwyddoniaeth eich helpu i werthuso eich prosiectau, lliniaru camgymeriadau yn y dyfodol a gwella’ch dulliau rheoli prosiectau."
        }
    ]
}