{
    "url": "https://ruralpayments.blog.gov.uk/2024/03/14/countryside-stewardship-and-environmental-stewardship-revenue-claims-are-open-for-2024/",
    "title": "Countryside Stewardship and Environmental Stewardship revenue claims are open for 2024",
    "authors": [
        "RPA Editor"
    ],
    "categories": [
        "Countryside Stewardship",
        "Environmental Stewardship"
    ],
    "pub_date": "2024-03-14T15:41:31+00:00",
    "content": [
        {
            "text": "You can now submit your 2024 revenue claim for Countryside Stewardship (CS) or Environmental Stewardship (ES)."
        },
        {
            "text": "You have until 11.59pm on Wednesday 15 May 2024 to submit your claim without reduction."
        },
        {
            "heading": 2,
            "text": "Countryside Stewardship"
        },
        {
            "text": "Last year we simplified the process for submitting your CS revenue claim online and once again this year you will be able to use this streamlined process."
        },
        {
            "text": "Before you submit your CS claim, please make sure you have updated your land use codes by signing into the Rural Payments service. If you are unable to access the Rural Payments service, email us at ruralpayments@defra.gov.uk."
        },
        {
            "text": "If you’re a CS agreement holder who submits an annual revenue claim, an annual declaration will be available to you in the Rural Payments service. As long as there is no change to your claim from last year, you will be able to generate and submit an automated revenue claim for this year with a single click and without needing to complete each section of the claim form."
        },
        {
            "text": "Watch: How to submit a revenue claim using the Rural Payments portal"
        },
        {
            "text": "If there are any changes to your claim from last year or your agreement includes rotational options, you will need to tell us."
        },
        {
            "heading": 2,
            "text": "Environmental Stewardship"
        },
        {
            "text": "If you are an ES agreement holder, you will receive your claim form by either email or post. You need to complete it and return it to us to submit your claim."
        },
        {
            "heading": 2,
            "text": "Reductions applied to late claims"
        },
        {
            "text": "The deadline for submitting your 2024 CS or ES claim without reduction is 11.59pm on Wednesday 15 May."
        },
        {
            "text": "If you miss this deadline, you still have until 11.59pm on Wednesday 2 September 2024 to submit a claim, but a reduction will be applied to the value of your claim – the later you submit it, the greater the reduction."
        },
        {
            "text": "The reductions will be applied in the following way:"
        },
        {
            "text": "Read our guidance on GOV.UK for more information on how to make a Countryside Stewardship or Environmental Stewardship revenue claim."
        }
    ]
}