{
    "url": "https://dragonsden.blog.gov.uk/2024/03/14/dragons-den-the-ip-blog-series-21-episode-11/",
    "title": "Dragons' Den the IP Blog - Series 21 Episode 11",
    "authors": [
        "Jenny Manders"
    ],
    "categories": [
        "Business",
        "IP",
        "Licensing",
        "Patents",
        "Trade marks"
    ],
    "pub_date": "2024-03-14T21:00:59+00:00",
    "content": [
        {
            "text": "We met an IP-savvy bunch of entrepreneurs in the Den this episode. Every one of them had either applied for, or obtained, at least one type of intellectual property right to protect their innovation."
        },
        {
            "heading": 3,
            "text": "Natural sparkle"
        },
        {
            "text": "The Den was filled with sparkle when Mum Kitty Auguste entered the Den with her daughters. Nel and Tessie immediately set about demonstrating how to apply their glittery body paint using a flower shaped transfer, clearly experts at their craft."
        },
        {
            "text": "Kitty explained that when she had looked for play makeup for Nel and Tessie, she was unable to find any available in the UK with purely natural ingredients. She’d discovered a gap in the market - consumers who are waking up to the need for products that are kind to the skin as well as the planet. That’s when she started The Natural Play Makeup Company."
        },
        {
            "text": "“I wanted to produce play makeup without nasties, that are natural on the skin… and bring a natural sparkle into children's' lives.”"
        },
        {
            "text": "Kitty asked the Dragons for £70,000 in exchange for 15% of her business. She currently sells online and was seeking help to enter the retail market, but as the Dragons were all agreed, she would need to bring her costs down first to achieve the right margin."
        },
        {
            "text": "Eco-Dragon Deborah Meaden could see an opportunity for Kitty as “the first and the most trusted” in the UK market for natural play makeup, in spite of the manufacturing cost challenge. Consumer education would be a key element of building the brand’s success, she advised."
        },
        {
            "text": "Deborah’s offer of all of the money for 20% of the business added a touch of sparkle to Kitty’s day, as she willingly accepted the deal."
        },
        {
            "heading": 3,
            "text": "Fancy a Cheeky Nibble?"
        },
        {
            "text": "It was clear that Marietta Hickman inspired the Dragons with her professionalism as well as her tasty, home-made, Cheeky Nibble. She has found the repetitive process of hand baking more than 15,000 boxes of her allergen-free vegan granola bars therapeutic, helping to alleviate her anxiety and reduce the symptoms of her neuro-divergent conditions."
        },
        {
            "text": "With innovation awards and Selfridges sales agreements to her credit as well as being in talks with Boots, Marietta asked for £60,000 for a 10% stake. This, she hoped, would help her scale up her business and “impact more lives”, declaring herself “on a mission to spread joy through food”."
        },
        {
            "text": "In spite of being tempted by the granola bar flavours and being very encouraging about Marietta’s success so far, the Dragons felt that the cost of the bars would prevent her  upscaling the business. They recommended instead that she focus on more niche outlets."
        },
        {
            "text": "Marietta was not too downhearted, feeling proud of the kind words she had received from the Dragons."
        },
        {
            "heading": 3,
            "text": "An eye for investment? "
        },
        {
            "text": "“With licensing he could be a multi-millionaire in years to come” said Peter Jones, watching entrepreneur Bob Gokani leave the Den empty handed. Bob had just rejected offers from Peter and Touker for investment in his patented eye drop applicator, Ezidrops, and an ear drop applicator."
        },
        {
            "text": "With interest from Boots, Amazon and multiple independent pharmacies, Bob clearly had enough confidence in his product not to want to give too much of his business away or pursue the licensing route."
        },
        {
            "heading": 3,
            "text": "A warm welcome"
        },
        {
            "text": "Anthony Cherry was the last visitor to the Den in this episode. He has a patent and a patent pending for his Time:O:Stat invention – an easy to use thermostat for students and tenants in rented accommodation. The timer function can greatly reduce the cost of heating for landlords of multiple occupancy homes, Anthony assured the Den."
        },
        {
            "text": "The Dragons could see the advantage of the product, and it was the well-connected Touker who negotiated a deal with the entrepreneur, in spite of seemingly high product costs. He was keen to link him up with UK landlord networks."
        },
        {
            "text": "Discussion in the Den included a Dragon warning that others could come up with similar, more cost-effective solutions to the high cost of bills in multi-occupancy rentals. Anthony was wise to patent his invention to prevent others from copying it."
        },
        {
            "text": "If you are thinking about the intellectual property in your business, visit the IP for Business section of our website or sign up to receive regular updates."
        },
        {
            "text": " "
        },
        {
            "text": "Disclaimer:"
        },
        {
            "text": "The purpose of the IPO's Dragons' Den IP blog is to help identify the IP in entrepreneurs’ pitches and highlight how IP works, or could work, in the real-life examples featured. IPO’s authorship of this blog does not constitute its endorsement or sponsorship of any products, individuals or businesses referenced within it."
        }
    ]
}