{
    "url": "https://defrafarming.blog.gov.uk/2024/03/14/from-application-to-agreement-making-the-process-to-join-sfi-simple/",
    "title": "From application to agreement: making the process to join SFI simple",
    "authors": [
        "The Team"
    ],
    "categories": [
        "Sustainable Farming Incentive"
    ],
    "pub_date": "2024-03-14T12:33:59+00:00",
    "content": [
        {
            "text": "When you apply for the Sustainable Farming Incentive (SFI), we want your experience to be smooth and we want to offer you as much flexibility as possible.  "
        },
        {
            "text": "In this post, we’ll set out what you can do and what we’re doing to make the process of applying as straightforward as it can be, so you can join the 14,000 other farmers, growers and land managers who've already applied."
        },
        {
            "heading": 2,
            "text": "Preparation  "
        },
        {
            "text": "Our new online SFI actions checker tool will help you filter the actions you can get paid to do on your land. It complements the scheme guidance which you can find on GOV.UK and in the SFI Handbook.  "
        },
        {
            "text": "The process to begin your application starts on the Rural Payments service.  "
        },
        {
            "text": "Start by checking that you are eligible and your land is eligible. You should also check the registered details on your digital maps are up to date.  "
        },
        {
            "text": "If you request updates before you apply, it'll speed things up. It takes time to make changes so it’s best to request them as early as you can.  "
        },
        {
            "text": "Do make sure your contact details are up to date and your permissions are correctly set for SFI in the Rural Payments service. "
        },
        {
            "text": "You need to get your land use and land cover right for the system to show the relevant actions for you. This allows us to automate the question ‘is this land eligible or not?’ This automation has helped us to reduce the processing time to a week or two.  "
        },
        {
            "text": "We’ve made it easier for you to make changes to land use and land cover. Land eligibility is a vital part of your application. We're assessing ways to streamline this."
        },
        {
            "text": "Once you’ve done your preparation, applying for SFI should be straightforward. If you happen to run into any difficulties, for example if a parcel is not showing for you, get in touch with the RPA and they’ll help to resolve it. Remember to include your Single Business Identifier (SBI) number in your message or have it handy if you call them. "
        },
        {
            "text": "The RPA produced an SFI checklist leaflet if you’d like take a look, to print it off or share it. "
        },
        {
            "heading": 2,
            "text": "Speed bumps "
        },
        {
            "text": "On average, it takes 15 days to process an application."
        },
        {
            "text": "Occasionally, it can take longer depending on their size and compatibility with other schemes. "
        },
        {
            "text": "We know that applying for an SFI agreement if you farm common land can take longer. "
        },
        {
            "text": "Management control is the biggest factor slowing down an application’s progress. For example, when a landowner and tenant farmer submit separate applications and a parcel appears on both applications, the RPA undertakes checks to make sure that there isn’t any duplication or overlap of land.  "
        },
        {
            "text": "It’s worth noting that if you’re applying for an agreement on a Site of Special Scientific Interest (SSSI), you must either give notice to Natural England or you must already have consent from Natural England. The RPA needs to make sure that the actions applicants want to do are compatible with any existing agreements on the land. The RPA can only process an application once Natural England has been in touch with them. Guidance on applying for SFI actions on SSSIs can be found on page 118 of The SFI Handbook.  "
        },
        {
            "text": "Until recently, applicants needed to provide notice to Natural England where there was an SSSI within a parcel with MOR1 actions. MOR1 no longer requires applicants to gain consent or to notify Natural England. This is part of our commitment to make things as easy as possible for those who want to apply."
        },
        {
            "text": "Please do share your feedback so we can continue to improve the process of applying for an SFI agreement and the guidance.  "
        },
        {
            "text": "In cases where there have been delays, the RPA has been in touch with applicants to talk through the issue. "
        },
        {
            "heading": 2,
            "text": "Assessing your application  "
        },
        {
            "text": "Once you submit your application, it will be processed as quickly as possible – as mentioned, the average time this takes is 15 working days.  "
        },
        {
            "text": "The scheme isn’t competitive so anyone who is eligible will get an agreement."
        },
        {
            "text": "Once your application has been submitted and all compliance checks are complete, the RPA will notify you. "
        },
        {
            "text": "Continue to check Rural Payments service for any updates or correspondence from the RPA. Delays in responses will have a knock-on effect."
        },
        {
            "heading": 2,
            "text": "After you get your agreement offer  "
        },
        {
            "text": "You will receive your first payment 4 months after your SFI agreement starts. After that you’ll be paid every 3 months, so you have a regular, reliable income. "
        },
        {
            "text": "Once you’re in SFI, you can add more land and actions to your agreement each year and you can have multiple agreements.  "
        },
        {
            "text": "We recently announced that we are doubling the Management Payment for SFI so those with existing agreements will receive up to an extra £1,000 this spring. It will be extended to Countryside Stewardship Mid Tier for the first year of agreements starting by March 2025.   "
        },
        {
            "heading": 2,
            "text": "Contacting the RPA "
        },
        {
            "text": "You can use the Rural Payments service to raise a query about your SFI application, agreement or payment. Just sign into the Rural Payments service and select ‘Create or view a query’. "
        },
        {
            "text": "If you have a general question about SFI, you can contact the RPA by: "
        },
        {
            "text": " "
        }
    ]
}