{
    "url": "https://educationhub.blog.gov.uk/2024/03/how-supporting-university-students-mental-health/",
    "title": "How we’re supporting university students with their mental health",
    "authors": [
        "media officer"
    ],
    "categories": [
        "Mental Health",
        "Students",
        "Universities"
    ],
    "pub_date": "2024-03-14T10:20:20+00:00",
    "content": [
        {
            "text": "Going to university is a fun and exciting time for most students – but it comes with unique challenges and stresses. We believe that all students’ mental health and wellbeing should be properly supported during their time at university."
        },
        {
            "text": "There is a range of mental health support available to students, from online mental health and wellbeing platform Student Space to counselling and one-to-one support. Here’s what you need to know."
        },
        {
            "heading": 3,
            "text": "What action are you taking to support students’ mental health?"
        },
        {
            "text": "Students struggling with their mental health can access Student Space, a mental health and wellbeing hub supporting students."
        },
        {
            "text": "Funded by £3.6 million from the Office for Students (OfS), Student Space provides dedicated one-to-one text and web chat support services. It’s also an online platform providing vital mental health and wellbeing resources."
        },
        {
            "text": "This service is part of the £15 million we have asked the OfS to allocate towards student mental health in 2023/2024. This funding will also be used to give additional support for those making the transition from school or college to university, in particular through counselling services."
        },
        {
            "text": "It will also be used to address any challenges that students may face in accessing local support services through their university, by establishing better partnerships between universities and local NHS services."
        },
        {
            "text": "To ensure all the information is readily available for students and young people, we have put together some useful links and sources of mental health support so that everyone can get the advice and help they need. This information is available here."
        },
        {
            "text": "We are also asking universities to take a whole university approach to mental health by setting a target for all universities to sign up to the University Mental Health Charter Programme by September 2024."
        },
        {
            "text": "To support this target the Office for Students (OfS) is providing £400,000 additional funding to Student Minds to support expansion of the Programme. You can read more about it on the OfS website. "
        },
        {
            "heading": 3,
            "text": "What is the University Mental Health Charter Programme? "
        },
        {
            "text": "Universities that are part of the University Mental Health Charter programme will be supported to make cultural change so that all aspects of university life promote and support mental health."
        },
        {
            "text": "Both students and staff will benefit from better support for their mental health and wellbeing as a result."
        },
        {
            "text": "The Charter Award is given to the universities that are part of the Programme members which demonstrate excellent practice in supporting student mental health."
        },
        {
            "heading": 3,
            "text": "What is the Department doing to reduce suicides at universities?"
        },
        {
            "text": "Every student death is a tragedy and preventing suicide and self-harm in our student populations is a key priority."
        },
        {
            "text": "So that students are better protected we have asked universities to fully implement best practice including the Suicide Safer Universities guidance, led by Universities UUK and Papyrus."
        },
        {
            "text": "This includes guidance for universities on sharing information with family and friends in the event of a mental health crisis and practical advice on compassionate, confident, and timely support when a tragedy occurs."
        },
        {
            "text": "Understanding student suicide data and risk factors is central to informing preventative action, which is why we have worked with the Office for National Statistics, which has published updated data and analysis."
        },
        {
            "text": "We appointed Professor Edward Peck as Higher Education Student Support Champion in May 2022 for a two-year term and extended the appointment for another year until 31 May 2025. Professor Peck has been speaking to bereaved parents to understand where improvements can be made.  "
        },
        {
            "text": "To deliver better practice in mental health support across the higher education sector Professor Peck is chairing a Higher Education Mental Health Implementation Taskforce, which will include bereaved parents, students, mental health experts, charities and sector representatives."
        },
        {
            "text": "It has been asked to deliver a report with a plan for better early identification of students at risk, a University Student Commitment on dealing with students sensitively on disciplinary issues, and a set of clear targets for improvements in practice by providers."
        },
        {
            "text": "Its first stage report has been published outlining progress so far and setting out new areas of focus, including improving join up between higher education and NHS mental health services. It is due to publish a second stage report by July 2024."
        },
        {
            "text": "We have also appointed the National Confidential Inquiry into Suicide and Safety in Mental Health (NCISH) to carry out a National Review of Higher Education Suicides."
        },
        {
            "text": "This will ensure that valuable lessons from past tragedies can be learnt to help us better protect students in future. Its findings report will be published by Spring 2025 outlining good practice and areas for improvement around suicide prevention in higher education."
        },
        {
            "text": "Providers’ participation in the National Review of HE Suicides will be supported by the additional one-off £10m funding we have asked the OfS to allocate on mental health and hardship, which comes top of the £15 million already distributed this year on HE student mental health."
        },
        {
            "heading": 3,
            "text": "What should I do if I’m worried about a friend or family member at university?"
        },
        {
            "text": "We understand that helping a friend or family member with mental health issues can be difficult. It is important that students feel supported at this difficult time. There is support in place and people who are available to listen."
        },
        {
            "text": "If for any reason you have cause to believe that someone you know is struggling with mental health and wellbeing issues at university, we recommend following NHS guidance."
        },
        {
            "text": "Universities have support services in place for their students which can be accessed via their website, or by looking up your university on the Student Space support pages."
        }
    ]
}