{
    "url": "https://ukhsa.blog.gov.uk/2024/03/14/inside-britains-deadly-fungus-collection/",
    "title": "Inside Britain’s Deadly Fungus Collection",
    "authors": [
        "Blog Editor"
    ],
    "categories": [
        "Microbiology services",
        "Uncategorized"
    ],
    "pub_date": "2024-03-14T15:01:39+01:00",
    "content": [
        {
            "text": "Housed near Bristol, UKHSA’s National Collection of Pathogenic Fungi (NCPF) is home to more than 4,500 isolates of potentially deadly fungi, gathered over the last century."
        },
        {
            "text": "The collection serves as a remarkable illustration of how scientific endeavours from the World War II era continue to hold significance in the present day. Moreover, it offers a glimpse into the future of health protection, highlighting the importance of preserving and studying these specimens."
        },
        {
            "text": "In this blog post, we’ll cover the history of the NCPF: why it was set up, what it houses and how it continues to play an important role in protecting our health."
        },
        {
            "heading": 2,
            "text": "100 years of deadly fungi"
        },
        {
            "text": "Founded in 1920, the National Collection of Type Cultures (NCTC) is the longest-established collection of its type anywhere in the world. It also serves as a United Nations Educational, Scientific and Cultural Organization (UNESCO) Microbial Resource Centre (MIRCEN)."
        },
        {
            "text": "The collection was originally housed at the London School of Hygiene and Tropical Medicine (LSHTM). The fungal strains from NCTC were combined with a collection of fungi gathered by the first NCPF curator, Dr James T. Duncan, who had undertaken a survey of fungal disease in Great Britain in the 1940s."
        },
        {
            "text": "Today, the collection is based in Bristol and continues to be an integral part of the Mycology Reference Laboratory."
        },
        {
            "heading": 2,
            "text": "Why are we collecting fungi?"
        },
        {
            "text": "Fungi (moulds and yeasts) might just sound like ingredients for some of our favourite recipes, but they can also be important pathogens of humans and other animals. Infections caused by fungi range from superficial and relatively mild infections of nails and skin, to highly invasive infections that can destroy muscle tissue, bones, organs and in some cases kill."
        },
        {
            "text": "Since its inception in 1946, the NCPF has been an integral part of the Mycology Reference Laboratory and is now based in Bristol, which means that the expertise is available on-site to help doctors identify the strain their patient might have."
        },
        {
            "text": "Our NCPF colleagues offer services related to these fungal strains, such as:"
        },
        {
            "heading": 2,
            "text": "The Fungus Files: what’s in the collection"
        },
        {
            "text": "At present, the collection holds over 4,500 strains of mould and yeast isolates of clinical significance from Absidia spinosa to Zygowilliopsis californica, and includes specimens from humans, an elephant, a camel, a dolphin, several hedgehogs, two goats and even a koala bear, amongst others."
        },
        {
            "text": "Our collection includes:"
        },
        {
            "text": "Name: Curvularia lunata (named due to its crescent moon-shaped spores)"
        },
        {
            "text": "Target: Eyes, bones, heart, central nervous system."
        },
        {
            "text": "In extreme cases of phaeohyphomycosis, this organism can cause deep infections involving the eyes, bones, heart or central nervous system."
        },
        {
            "text": "Name: Aspergillus fumigatus"
        },
        {
            "text": "Target: Lungs."
        },
        {
            "text": "Primarily causing an invasive infection in the lung, A. fumigatus represents a major cause of disease and death in immunosuppressed individuals as well as potentially causing a variety of allergic complications in immunocompetent individuals. In recent years there have been concerns over emerging drug resistance in this species."
        },
        {
            "text": "Name: Cunninghamella bertholletiae"
        },
        {
            "text": "Target: Human body tissue."
        },
        {
            "text": "Often entering the body through skin wounds or in patients with severe burns, Cunninghamella bertholletiae can infect and destroy a wide variety of tissue structures."
        },
        {
            "text": " "
        },
        {
            "text": "Name: Pseudallescheria boydii"
        },
        {
            "text": "Target: Central nervous system, lungs, joints, bones."
        },
        {
            "text": "As well as a chronic subcutaneous disease (eumycetoma) following accidental traumatic inoculation , this organism and its close relatives can cause ear infections, fungal balls in the lungs, joint and bone infections, and infection of the central nervous system in immunosuppressed patients and those with fungal pneumonia after near-drowning."
        },
        {
            "text": " "
        },
        {
            "text": "Name: Lichtheimia corymbifera"
        },
        {
            "text": "Target: Lungs and sinuses."
        },
        {
            "text": "In those with weakened immune systems, breathing in spores of this fungus and related members of the Mucormycota can cause an infection in the lungs or sinuses. Additional risk factors include diabetes and steroid use. These fungi were responsible for >45,000 cases of “black fungus disease” in patients with severe COVID infection in India in 2020-2021."
        },
        {
            "text": "Dermatophytes and related fungi that cause skin infections, sourced from the UK and other countries. Many of these are original reference strains that can be used for identification. Included are strains of Trichophyton indotineae, a recent cause of treatment-resistant groin infections that has been spreading worldwide in the last decade."
        },
        {
            "text": "Mould strains that can cause deep tissue and internal organ infections in humans and animals."
        },
        {
            "text": "Yeasts that are known to cause infections, including many isolates of Candida auris, a relatively novel yeast species that has caused hospital outbreaks worldwide."
        },
        {
            "text": "Fungi that can transition between a mould and yeast form (Dimorphic fungi), allowing them to cause different types of infections. These are high containment pathogens (containment level 3) and include Histoplasma, Coccidioides, Blastomyces. Famously, the singer Bob Dylan was forced to cancel the British Leg of a European tour in 1997 due to histoplasmosis and the Johnny Cash song “Beans for Breakfast” accurately made the link between bird guano and catching histoplasmosis."
        },
        {
            "heading": 2,
            "text": "Why fungus is important for our future"
        },
        {
            "text": "With an estimated 2-4 million species (only approximately 150, 000 of which have been formally described), members of Kingdom Fungi are ubiquitous with a worldwide distribution and have adapted to inhabit extreme environments ranging from deserts to deep sea environments and even the Chernobyl nuclear exclusion zone."
        },
        {
            "text": "Although most fungi are primarily decomposers of dead organic matter, some 600 species have been associated with human infections, with 200 of those reported as agents of human disease on a regular basis."
        },
        {
            "text": "Each year, around 1,500 new species are described, with a new or emerging fungal pathogen of humans or animals described every month."
        },
        {
            "text": "Over recent decades, the emergence of a number of important new pathogens has been noted together with increased antifungal resistance in known pathogen populations, in many cases driven directly by human activity (indiscriminate use of antifungal drugs in patients or the environment, increased foreign travel and tourism, exportation of exotic animals, planetary temperature changes)."
        },
        {
            "text": "These include the novel human pathogens Candida auris and Trichophyton indotineae, Pseudogymnoacus destructans (the agent of white nose syndrome in bats which has destroyed more than 90% of the US populations of some bat species) and Batrachochytrium dendrobatidis (which has decimated amphibian populations worldwide) together with worldwide increases in the prevalence of resistance to azole antifungal drugs in the human pathogen Aspergillus fumigatus. There have also been reports of new species and even a new genus of Hazard Group 3 fungal pathogens which have to be handled in a special containment facility in the laboratory due to their propensity to cause disease in otherwise healthy individuals."
        },
        {
            "text": "Some of the primary roles of the Mycology Reference Laboratory (which houses and maintains the NCPF) include the identification, surveillance and tracking of novel and emerging fungal pathogens, antifungal drug susceptibility testing of individual fungi isolated from infections to optimise treatment, studies to understand the biology of new pathogens and to improve the diagnosis and treatment of fungal infections in humans (and animals) and conservation of important organisms in the NCPF so that they are available to other researchers."
        }
    ]
}