{
    "url": "https://naturalengland.blog.gov.uk/2024/03/14/the-science-of-natural-england-now-and-then/",
    "title": "The science of Natural England: now and then",
    "authors": [
        "Tim Hill"
    ],
    "categories": [
        "Biodiversity",
        "Climate change",
        "Environmental Improvement Plan",
        "Geology",
        "Mapping",
        "Marine environment",
        "Monitoring",
        "National Nature Reserve",
        "Natural England",
        "Nature Recovery Network",
        "Science and evidence",
        "Species recovery",
        "Wildlife"
    ],
    "pub_date": "2024-03-14T10:51:19+00:00",
    "content": [
        {
            "text": "By Dr Tim Hill, Chief Scientist at Natural England"
        },
        {
            "text": "Science, evidence and evaluation sit at the heart of Natural England. Our teams work across a range of ecological, earth, economic and social sciences. With a strong focus on collaboration with a range of partners, we work to safeguard and enhance our biodiversity and geodiversity for people and nature."
        },
        {
            "text": "In celebration of British Science Week, I am proud to highlight the amazing work of Natural England’s science and scientists across our organisation, and the ongoing commitment and dedication our teams here at Natural England have in creating more nature-rich places for generations to come."
        },
        {
            "text": "The theme of this year’s British Science Week is ‘Time’ and so, I’d like to use this as an opportunity to celebrate our work in exploring our country’s heritage, where we are at present and our goals for the future. We have a team of Earth Scientists, for example, who are tasked with the conservation and enhancement of our rich and extremely diverse geological and geomorphological heritage representing around 600 million years of time. This ensures that the places, features and fossils which enable us to understand the history of our planet, past environmental change, and the evolution and adaption of life adaptation in response to these changes, are conserved and managed, enabling us to understand the past and plan for the future."
        },
        {
            "text": "We have life scientists working to conserve and enhance England’s biodiversity, and we have social scientists looking at how people interact with the environment. We also have teams assessing and evaluating our past and current work to ascertain what has worked/is working best for people, places, and nature, and we have Futures Specialists who scan the horizon to assess what issues are emerging and how they may affect our future. Science truly is at the core of all we do."
        },
        {
            "text": "The way we do our science has changed tremendously across the decades. We use scientific advancements that were unimaginable when Natural England’s predecessor bodies were first established. For example, Environmental DNA (eDNA) identifies species present in a particular environment from small samples. We conduct Environmental DNA ‘Bioblitzes’, which assess all the biodiversity of a given location. Earth observation from satellites would have been pure science fiction when the 1949 National Parks and Access to the Countryside Act came into force; Lidar (Light Detection and Ranging,) was first used in the 1960s and is now routinely used to identify tiny height differences across sites that are essential for understanding water movement across sites. It goes almost without saying the computers we use every day - whether simply to send an email or to process huge datasets - are far more powerful now than the first computers we used when the organisation began. The development of Artificial Intelligence (AI), and the rate at which technology is evolving presents exciting possibilities for the future, especially in terms of data analysis and geographic information."
        },
        {
            "text": "Our National Nature Reserves (NNRs) have been open-air workshops since Yarner Wood, now part of East Dartmoor Woods and Heaths NNR, was purchased in 1952. Research on NNRs continues today with new NNRs designated each year, opening up further opportunities to learn what conservation actions work best."
        },
        {
            "text": "Just over a year ago, Government launched its Environmental Improvement Plan (EIP), which arose from the 25 Year Environment Plan (25YEP). We’ve already been successful in achieving some of the targets set out in the EIP. For example, the recent closure of sandeel fisheries in the English North Sea waters. The closure will bring a number of benefits to the area, including the recovery of sandeel populations; they are a vital food source for commercially important seafood species such as haddock and whiting as well as benefitting seabirds and porpoises. It was our evidence and advice to government that made the decision to close the area possible."
        },
        {
            "text": "Natural England has been working closely with JNCC to provide the Marine Management Organisation with the conservation advice and evidence needed to protect species such as pink sea fans, fragile sponges, and anemones, and sensitive features, such as rocky and biogenic reef, from the effects of bottom trawling. This work is critical for preserving our marine environments, which play a significant part in the overall health of our planet."
        },
        {
            "text": "Underpinning all this work is Natural England’s Science, Evidence and Evaluation Strategy, which describes how a good understanding of the evidence base is crucial to our work. From understanding environmental changes to what works in nature recovery, it sets out our goals to continually improve the evidence base, to invest in the scientific expertise of our staff and to work with our partners to drive innovative approaches, and to share our knowledge and understanding."
        },
        {
            "text": "Time is against us for addressing the twin challenges of biodiversity decline and climate change, so we must utilise the science and continue to focus on the most effective tools and research to aid nature’s recovery for both people and our planet."
        },
        {
            "text": "Learn more about the work of Natural England's science and evidence in our short video, and find our Science, Evidence and Evaluation Strategy here:"
        },
        {
            "text": "Science Evidence and Evaluation Strategy - NE764 (naturalengland.org.uk)"
        }
    ]
}