{
    "url": "https://charitycommission.blog.gov.uk/2024/03/14/yes-political-think-tanks-deserve-their-charitable-status/",
    "title": "Yes, political think tanks deserve their charitable status",
    "authors": [
        "Orlando Fraser KC"
    ],
    "categories": [
        "Uncategorized"
    ],
    "pub_date": "2024-03-14T15:44:53+00:00",
    "content": [
        {
            "text": "This piece was first published in The Times on 12 March 2024. "
        },
        {
            "text": "Think tanks are critical to our political ecosystem. Their work is valued by parliamentarians and those interested in public policy. Their model of policy development and scrutiny is present in most established democratic nations, where solutions to the toughest challenges are researched, analysed and debated with gusto."
        },
        {
            "text": "It is because of the important role of think tanks in informing debate and educating the public that many of them hold charitable status in England and Wales. Yet the nature of these charities is too often called into question."
        },
        {
            "text": "Some argue that think tanks are inherently political organisations and, accordingly, don’t deserve the benefits that charitable status brings. I disagree. Charitable think tanks make an enormously positive contribution to intellectual debate. That is a good thing, whatever intellectual tradition they come from."
        },
        {
            "text": "Like any charity, think tanks are free to engage in political activity where doing so supports their charitable purposes. Despite this, some have sought to co-opt the Charity Commission into campaigns against think tanks with which they disagree."
        },
        {
            "text": "I want to be clear that, as long as a think tank is not endorsing political parties or undertaking inappropriate political activity, the commission, as regulator, has no interest in stifling their work and thus will rarely intervene when allegations of political bias are made. This is a key part of the fair, balanced and independent approach of the commission."
        },
        {
            "text": "We expect their research to be open-minded and their conclusions not to be predetermined. But we are unlikely to consider that a progressive think tank is in breach of charity law by the fact that it may favour left-of-centre solutions, and likewise with others elsewhere on the political spectrum."
        },
        {
            "text": "Similarly, it is not a regulatory matter if charity think tank staff join any future government, or if staff leave government to join a charity think tank. Ex-politicians and officials have a lot to offer the voluntary sector (think of David Miliband at the International Rescue Committee), just as many former charity employees have made strong contributions to politics (think of the current charities minister Stuart Andrew, formerly of the British Heart Foundation)."
        },
        {
            "text": "I hope charity think tanks can continue to carry out the work they do unhindered by unfounded complaints made to the commission about the alleged non-charitable nature of their work — and continue to be the valuable part of our democracy they are trusted to be."
        },
        {
            "text": " "
        }
    ]
}