{
    "url": "https://governmentscienceandengineering.blog.gov.uk/2021/08/17/become-an-engineering-in-policy-committee-member/",
    "title": "Become an Engineering in Policy Committee member",
    "authors": [
        "Selina Khan"
    ],
    "categories": [
        "Blog Series",
        "Collaborating & Networking",
        "Diversity & Inclusion",
        "GSE Champions",
        "GSE Opportunities",
        "Our People & Deep Dives"
    ],
    "pub_date": "2021-08-17T21:31:57+01:00",
    "content": [
        {
            "text": "Engineering in Policy is a network for all who are interested in the role that engineers and engineering approaches can play in government and policy making. The network has impact in four ways:"
        },
        {
            "text": "We formed the network in April 2021 and have already had lots of successes!"
        },
        {
            "text": "We’ve run events on using systems thinking to make great policy and discussing how engineers can reach leadership positions whilst retaining their professional engineering identity. We also interviewed industry experts on the role of engineers in built environment policy. "
        },
        {
            "text": "We’ve published blogs exploring: what an engineering mindset brings to policy making; the role of engineers in the policy process; and the state of the art in academic research on how engineering advice is used."
        },
        {
            "text": "We’ve also launched a website, a LinkedIn group and built our membership both within and outside government."
        },
        {
            "text": " "
        },
        {
            "text": "Now we are calling on you to become a committee member to lead the delivery of one of our exciting new projects. This commitment could be big or small to suit you. You can pick something from the list below or suggest something we haven't thought of!"
        },
        {
            "text": "We are looking for new committee members to lead on:"
        },
        {
            "text": "Creating a thriving community by designing and delivering Engineering in Policy events for the first ever Government Science and Engineering (GSE) conference. Or launching an initiative that provides opportunities for network members to meet."
        },
        {
            "text": "Building our knowledge by creating learning sessions and resources to help people in engineering and policy professions understand each other’s thought process and ways of working. Or helping colleagues to get the most out of engineering experts outside of the civil service by mapping the current routes to sourcing this expertise."
        },
        {
            "text": "Raising awareness of roles on the boundary between engineering and policy by designing a jobs board, and building the networks across departments to keep it populated. Or working with the GSE profession to showcase role models of leaders in the civil service and beyond with a background in engineering."
        },
        {
            "text": "Facilitating change by leading our engagement with the GSE Profession’s learning and career development initiatives. They will help the GSE Profession best support the career development needs of people with an engineering background."
        },
        {
            "text": "Engineering in Policy membership is open to civil, public and crown servants as well as those working in industry and the third sector, and academia. The network is supported by the Government Science and Engineering profession meaning we have access to the contacts across departments and links to opportunities that go to thousands of engineers in government."
        },
        {
            "text": "We are looking for new committee members from across all government departments and organisations and want to represent the full breadth of interests our engineers have across in government. We encourage volunteers who would be excited to help us reach beyond the boundaries of government wherever possible."
        },
        {
            "text": "If you would like to volunteer for a project, share what you are doing through our blog, or find out more, please contact gse@go-science.gov.uk or info@engineeringinpolicy.org.uk."
        }
    ]
}