{
    "url": "https://childrenssocialcare.blog.gov.uk/2021/08/17/in-foster-care-every-child-provides-an-opportunity-to-make-progress-and-move-forward/",
    "title": "In foster care, every child provides an opportunity to make progress and move forward",
    "authors": [
        "Denise Allen",
        "Helen Pasco"
    ],
    "categories": [
        "Foster care"
    ],
    "pub_date": "2021-08-17T10:02:31+01:00",
    "content": [
        {
            "heading": 4,
            "text": "Denise Allen and Helen Pasco have known each other for 10 years. Denise is a Fostering Social Worker at Redcar and Cleveland Borough Council where Helen and her partner Steve are foster carers. In this blog, the pair reflect on what they’ve learnt over the years and the qualities that make a great foster carer."
        },
        {
            "text": "Helen: I’ve been fostering for almost a decade. Prior to this, I was a nurse manager and my husband Steve worked in health and safety. We made the decision to adopt a family member 20 odd years ago. After this, I eventually got to the point where I wanted to do something more, but it needed to be the right time for my son. When he reached 15, we started fostering and we haven’t stopped since!"
        },
        {
            "text": "Over that period, we’ve had a number of short and long-term placements. We’ve had a young lady on a Special Guardianship Order for 9 years and have adopted a little boy who was placed with us when he was 6 months old; he has some additional needs and complex health issues. Currently, my husband and I have these 2 children with us and another little one on a short-term placement (15 months so far)."
        },
        {
            "text": "Denise: My social work career has been varied. I did a joint degree in social work and learning disabilities nursing. With 5 years' experience in safeguarding, I went into fostering to supervise social workers. I then managed a Children In Our Care team before returning to fostering as a team manager. After 5 years as a manager, I found I missed visiting families, so 2 years ago I became a supervising social worker once again. I’ll be ready to retire in 3 years' time!"
        },
        {
            "heading": 2,
            "text": "Social workers support foster carers in all sorts of ways"
        },
        {
            "text": "Denise: My role in the Children in Our Care Team meant I was always aware of Helen and the children placed with her. I actually trained Helen 10 years ago, when she applied to become a foster carer. It’s a real positive being able to develop long-term relationships like ours."
        },
        {
            "text": "Helen: I remember the training being really informative, Steve and I felt everything was covered well. Foster carers need to be open-minded and prepared for the potential needs of the children coming into their care - it can be a shock. It’s all-consuming but the rewards are huge. The difference you see in children, from the time they come into your care to when they move on, makes it all worthwhile."
        },
        {
            "text": "The needs of a child dictate how readily you dip into the support from your social worker. Sometimes it’s a breeze but when things are more challenging, it’s so important to know your social worker is there for you. Denise is always available at the end of the phone. If we have any problems or concerns, we can go to her. If she’s away, she’ll leave another point of contact so we always have someone to go to for support."
        },
        {
            "text": "Denise: Social workers support foster carers in all sorts of ways. We hold monthly supervisions where we use the Signs of Safety approach to understand what is working well and what needs to happen. We also connect foster carers through buddying. Helen provides guidance to less experienced carers and the council organises support groups with guest speakers. There is also the Foster Care Training Hub where we recently held a trauma-informed training session. 80% of foster carers turned up; there were 158 people in total including social workers and those who work in schools."
        },
        {
            "text": "Helen: Generally, training has reinforced the self-directed learning that I’ve done. I’ve researched PACE (Playfulness, Acceptance, Curiosity, Empathy) training and recently learned more about Fetal Alcohol Spectrum Disorder - another area of special interest for me as it impacts one of our boys. You need to have the understanding to support any child that comes into your home."
        },
        {
            "text": "Denise: Helen and Steve have looked after many children with complex and additional needs; we’ve asked both of them to go above and beyond what is normally asked of foster parents. With Helen’s nature being so therapeutic, the children wouldn’t be as well off without her."
        },
        {
            "text": "Nowadays, I think we have more knowledge about why children’s behaviour is the way it is. This helps us gain a greater understanding of a child’s needs and ultimately means we can offer greater help through models like PACE, which bring children closer to us."
        },
        {
            "heading": 2,
            "text": "Foster carers that can put themselves in a child’s shoes"
        },
        {
            "text": "Denise: Helen is very critical of herself but through this, she has taught me a lot. Together, we spend time thinking ‘I wonder whether…’ Helen is amazing at reflecting on if we could have done something differently. I now use this technique with other foster carers."
        },
        {
            "text": "Helen: For us, every child provides an opportunity to make progress and move forward. Different routines and boundaries are a massive adjustment. On difficult days, you have to remind yourself that they are in this situation through no fault of their own. It’s not personal if they’re having a difficult day. If you lose sight of that, you need to have a hard think about whether you should still be doing what you’re doing."
        },
        {
            "text": "Steve and I are a tag team with the support of Denise behind us. I tend to overthink – I wonder whether I have done enough or done the right thing. He’ll remind me, “We’ve done what we can, we’re trying everything”. No matter how long you’re with a child, when they move on there is always an impact on our family."
        },
        {
            "text": "Denise: You need openness, honesty, calmness, patience, and love to be a good foster carer. You find ways to love every child that you care for. As a carer, Helen has masses of these qualities and so does Steve. We need carers that can put themselves in a child’s shoes."
        },
        {
            "text": "I learnt something in the training recently... I often tell children and young people that they shouldn’t do something, and they just smirk and smile. I learnt that’s actually an involuntary reflex - they’re not doing it on purpose!"
        },
        {
            "text": "Helen: Adults laugh at inappropriate times. Just like us, children get anxious and don’t know how to react. When I’m with a child who has particular needs, I want to learn why they behave the way they do. I wonder, “What’s the science behind that?” It’s because of this that my collection of books is getting bigger and bigger!"
        }
    ]
}