{
    "url": "https://insidehmcts.blog.gov.uk/2021/08/17/keeping-it-fresh-ventilation-in-courts-and-tribunals/",
    "title": "Keeping it fresh – ventilation in courts and tribunals",
    "authors": [
        "Mark Evans"
    ],
    "categories": [
        "COVID-19"
    ],
    "pub_date": "2021-08-17T10:00:10+01:00",
    "content": [
        {
            "text": "Ventilation is not something people usually pay much attention to, but since the pandemic we're all more aware of the air we breathe and how clean it is. Now, how we keep air fresh in courts and tribunals is on everybody’s mind. It’s been my and my team’s job to make sure our systems do that effectively and reliably."
        },
        {
            "text": "Keeping it clean"
        },
        {
            "text": "We know that virus particles can be transmitted in water droplets circulated in the air, so the air in a room needs to change and stay as clean and fresh as possible."
        },
        {
            "text": "There are two options to keep fresh air circulating:"
        },
        {
            "text": "An air handling system is basically a big fan in a box that blows in and extracts air through a duct system. To meet building regulations, every occupiable room must have a window or an air handling system."
        },
        {
            "text": "All our systems are designed to building regulations or above and that’s part of our court design guide."
        },
        {
            "text": "Ventilation as mitigation"
        },
        {
            "text": "Good ventilation is part of the suite of safety measures such as screens, masks and cleaning, that we have at our sites. It’s part of the site-based risk assessment so courts and tribunals will flag any concerns with air quality when they do their weekly review."
        },
        {
            "text": "As well as this, we work with our contractors to do weekly operational checks of the systems to make sure they’re working properly. This is above any statutory or contracted obligation.  So we know that the system is in place, it’s working and it’s doing its job."
        },
        {
            "text": "Any room that does not have a good means of ventilation is not in use. We’ve also taken the extra precaution of removing desk fans because they can blow particles from one person to the next, so if someone’s asymptomatic and in the building, a desk fan could transmit the virus across the room."
        },
        {
            "text": "As with all our safety measures and approach to reducing the risk of COVID transmission in courts, we’ve worked with Public Health England, the Health and Safety Executive and professional bodies."
        },
        {
            "text": "It’s working well"
        },
        {
            "text": "As part of our assurance that our mitigations are working, we're installing CO2 monitors. CO2 will build up if the air is not being refreshed, so this is an indication that air quality has decreased."
        },
        {
            "text": "The monitors are most effective in smaller rooms with high occupancy – jury rooms, cells and other small rooms – and these are the rooms of most concern in terms of increasing the possibility of transmission."
        },
        {
            "text": "We’ve installed around 400 CO2 monitors to date and had no alarms. That’s a really good indication that our mitigations are working and our ventilation systems are doing their job well."
        },
        {
            "text": "Changing perceptions"
        },
        {
            "text": "You can’t see or feel an air-handling system, so it’s hard to demonstrate when it’s working well. In the pandemic, people were naturally worried about the air they were breathing, so the biggest challenge for us wasn’t technical, it was the perception that our buildings weren’t well ventilated."
        },
        {
            "text": "We’re doing everything to make them safe, and ventilation has been key to that. And that’s thanks to the tireless hard work of the HMCTS technical team and health and safety team. It's also thanks to the facilities management team, who checked the systems and implement any changes, as well as our contractors who do the weekly checks."
        },
        {
            "text": "I’m incredibly proud of what we’ve achieved – but we will not stop checking our approach, testing the systems, and making sure the air we’re all breathing in the courts is fresh and clean."
        },
        {
            "text": " "
        }
    ]
}