{
    "url": "https://phescreening.blog.gov.uk/2021/08/17/newborn-outcomes-solution/",
    "title": "Time to embed the newborn outcomes solution into clinical practice",
    "authors": [
        "Emma Proctor"
    ],
    "categories": [
        "NHS Sickle Cell and Thalassaemia Screening Programme"
    ],
    "pub_date": "2021-08-17T11:22:17+01:00",
    "content": [
        {
            "text": "The newborn outcomes (NBO) solution is a web-based system for referring newborn babies who screen positive for sickle cell disease (SCD) and thalassaemia."
        },
        {
            "text": "On 1 March 2021, all laboratories reporting NHS newborn blood spot screening results were live on the system. Laboratories and their associated clinical networks are now transitioning to using the NBO solution as their only method of reporting, replacing any pre-existing manual processes."
        },
        {
            "text": "It is really important the NBO solution is now embedded into clinical practice."
        },
        {
            "heading": 2,
            "text": "How to use the NBO solution"
        },
        {
            "text": "Clinical teams must update the NBO solution in a timely way by following these 3 steps:"
        },
        {
            "text": "Please ensure your local guidance reflects the pathway for the care of babies who screen positive for SCD or thalassaemia. Please make sure roles and responsibilities are defined."
        },
        {
            "heading": 2,
            "text": "NBO solution support"
        },
        {
            "text": "Each site requires a designated superuser. This person is responsible for ensuring their users’ accounts are up to date. A superuser can add a new user account to the system. Please inform NBO support of each designated superuser so their account can be updated to include the administrative function."
        },
        {
            "text": "User guides for the solution are available."
        },
        {
            "text": "You can request NBO solution training by emailing NBO support. Users may also receive queries relating to incomplete data that may require action."
        },
        {
            "text": "For queries relating to user accounts, including removing, adding or unlocking accounts, please continue to use MDSAS support."
        },
        {
            "heading": 2,
            "text": "PHE Screening blog"
        },
        {
            "text": "The PHE Screening blog provides up to date news from all NHS screening programmes. You can register to receive updates direct to your inbox, so there’s no need to keep checking for new blogs. If you have any questions about this blog article, or about population screening in England, please contact the PHE screening helpdesk."
        }
    ]
}