{
    "url": "https://companieshouse.blog.gov.uk/2021/08/17/restoring-your-company-after-voluntary-strike-off/",
    "title": "Restoring your company after voluntary strike off",
    "authors": [
        "Gary Townley - Senior communications manager"
    ],
    "categories": [
        "Company guidance"
    ],
    "pub_date": "2021-08-17T12:28:06+01:00",
    "content": [
        {
            "text": "If you have signed up to receive regular updates from Companies House, then you would have read our blog post about voluntarily dissolving a company you no longer need. If not, you can sign up for email updates and subscribe to our blog."
        },
        {
            "text": "This is a follow up to show you the process of restoring a company that has been voluntarily dissolved and removed from the register. There are several reasons why somebody would want to reinstate a company to the Companies House register after voluntary dissolution."
        },
        {
            "heading": 2,
            "text": "Why apply for restoration?"
        },
        {
            "text": "There are several reasons why a company may be reinstated to the register. These include:"
        },
        {
            "text": "See a full list of who can apply for the restoration."
        },
        {
            "text": "The application for restoration must be made within 6 years of the date of dissolution of the company, except in the case of a personal injury claim."
        },
        {
            "heading": 2,
            "text": "Where to apply"
        },
        {
            "text": "Depending on where the company was registered, the application needs to be made to the relevant authority."
        },
        {
            "text": "For a company that was registered in England or Wales, an application should be made to the registrar of the Companies Court in London. If you’re restoring a company that was registered in Scotland you must apply to the Court of Session and in Northern Ireland, the Royal Courts of Justice."
        },
        {
            "text": "Other options for where to apply may be available depending on the circumstances."
        },
        {
            "heading": 2,
            "text": "Evidence"
        },
        {
            "text": "With your application you’ll need to supply evidence in the form of a witness statement. This should include:"
        },
        {
            "text": "If the purpose of the restoration is for the company to continue trading, you’ll need to send any outstanding documents (accounts and confirmation statements) during the process, and pay any late filing penalties as soon as the company is restored."
        },
        {
            "text": "If you want to restore the company to recover assets (such as money or property), you do not need to file outstanding documents or pay late filing penalties. Instead, an undertaking will need to be given by the Claimant to the Courts that the company is not going to trade again, and will be dissolved as soon as the assets have been recovered."
        },
        {
            "heading": 2,
            "text": "The process"
        },
        {
            "text": "If successful, when a company has been restored to the register, the general effect is that a company is deemed to have continued in existence as if it had not been dissolved or struck off the register."
        },
        {
            "text": "The Court may give directions or make provision to put the company and all other persons in the same position as they were before the company was dissolved and struck off. A notice will also be placed in the relevant Gazette."
        },
        {
            "text": "The process can be complicated and lengthy. As always, we recommend you seek advice from a legal specialist if you need help."
        }
    ]
}