{
    "url": "https://cddo.blog.gov.uk/2023/04/11/a-guide-to-creating-user-centric-data-commissions/",
    "title": "A guide to creating user-centric data commissions",
    "authors": [
        "Fiona Macauley, Product Manager, CDDO"
    ],
    "categories": [
        "Data",
        "DDaT community",
        "Digital strategy"
    ],
    "pub_date": "2023-04-11T12:10:45+01:00",
    "content": [
        {
            "text": "A lot of us rely on getting data from outside our teams to help us to do our jobs. Data that we then use to make decisions. If higher quality data means our judgement can be more accurate, then it’s clearly in our best interests to do all we can to facilitate high calibre information sharing."
        },
        {
            "text": "In this blog, I share some thoughts on how we might do that based on recent experiences delivering the digital performance data commission. I’ve identified the departmental staff who complete commissions as being key users and am following user-centred design principles to improve their experience of being asked to share data."
        },
        {
            "text": "Working with colleagues from across government departments, some light touch user research and process mapping have highlighted some key pain points."
        },
        {
            "text": "To help build engagement with those we commission for data, there are a few things we can do. You can"
        },
        {
            "text": "Small changes can make a big difference. I’ve started to implement these changes and our most recent commission brought fewer challenges and faster returns - some were even submitted early. They also provided us with 10% more data than previously, and a better picture of the data landscape in departments, for example knowing why there are gaps in certain areas provides valuable context."
        },
        {
            "text": "So although we’re only just getting started, early signs are that we’re doing some good. Everyone I’ve spoken to has been incredibly constructive in their feedback on how we build a better data commission template. With their continued help I’m confident we can further reduce the pain of completing a data commission."
        }
    ]
}