{
    "url": "https://deframedia.blog.gov.uk/2023/04/11/coverage-on-post-brexit-fishing-opportunities-and-recently-allocated-spurdog-quota-for-the-uk-fishing-industry/",
    "title": "Coverage on post-Brexit fishing opportunities and recently allocated spurdog quota for the UK fishing industry",
    "authors": [
        "Defra Press Office"
    ],
    "categories": [
        "Fisheries"
    ],
    "pub_date": "2023-04-11T14:12:40+01:00",
    "content": [
        {
            "text": "Coverage ran in the Daily Express over the weekend following Fisheries Minister Mark Spencer visiting the local fishing community and seafood businesses in Newlyn, Cornwall last week. This ran alongside a comment piece from the Minister and highlighted opportunities for the UK fishing industry since leaving the EU, including new quotas for about 100 species caught in UK waters and how the industry has already benefited from an estimated £100 million uplift in fishing opportunities for 2023 compared to if the UK was still an EU member state. The coverage also references some ongoing challenges for the industry, with comments carried from the Cornish Fish Producers Organisation and the National Federation of Fishermen’s Organisation outlining that additional paperwork and increased costs continue to be a barrier post-Brexit."
        },
        {
            "text": "Fisheries Minister Mark Spencer said: "
        },
        {
            "text": "Coverage also ran over the weekend in the Financial Times, Sunday Times and Mail Online following Defra’s announcement that UK commercial fishermen can now fish for spurdog in UK waters following a recently updated scientific assessment."
        },
        {
            "text": "Spurdog (Squalus acanthias) also known as picked or spiny dogfish, are a type of shark species that inhabit UK waters. They have been managed as a prohibited species in UK and EU waters for around five years to facilitate stock recovery, with the only landings permitted though a scientific bycatch avoidance programme. But now, following a recently updated scientific assessment, the International Council for the Exploration of the Sea (ICES) has advised the stock is recovering and landings of spurdog can be supported again."
        },
        {
            "text": "Outlets carried comments from the National Federation of Fish Friers who welcomed the announcement and said this could help fish and chips shops dealing with rising costs given spurdog is a cheaper alternative to cod or haddock. Comments were also included from environmental non-government organisations such as the Marine Conservation Society warning the reintroduction has the potential to cause population decline again if not managed carefully."
        },
        {
            "text": "Fisheries Minister Mark Spencer said: "
        }
    ]
}