{
    "url": "https://mojdigital.blog.gov.uk/2023/04/11/designing-with-prisoners-running-an-ideation-workshop-in-prison/",
    "title": "Designing with Prisoners: Running an ideation workshop in prison",
    "authors": [
        "Rachel Abbott",
        "Nick Johnstone-Waddell"
    ],
    "categories": [
        "Our services",
        "Prisons"
    ],
    "pub_date": "2023-04-11T14:24:35+01:00",
    "content": [
        {
            "text": "Background"
        },
        {
            "text": "As part of the work to reduce reoffending, the Ministry of Justice (MOJ) and His Majesty’s Prison and Probation Service (HMPPS) are working together to develop a ‘resettlement passport’ for prison leavers."
        },
        {
            "text": "This was a commitment from the Prisons Strategy White Paper (2021). The aim is to bring together the information and services needed to address the causes of repeat offending and support prison leavers to have a smooth transition into the community."
        },
        {
            "text": "Our team is nearing the end of our discovery phase - we’ve spent the past few months speaking with staff from probation and prison, third sector/charity organisations and people in prison themselves to understand what current resettlement tasks and processes look like, and what prison leavers feel is most important to them upon release."
        },
        {
            "text": "Our Plan"
        },
        {
            "text": "We wanted to run a creative workshop in a prison with prisoners - we felt it would help us elicit more insights as well as being more engaging for the participants than a formal interview. We also hoped taking this ‘co-design’ approach would help to reduce any feelings around the power imbalance of our roles."
        },
        {
            "text": "The workshop was based around this idea of a ‘Product Box’ - we wanted the participants to design a solution to the problem (In this case - what do you need for a successful resettlement?) and to talk us through their thoughts as they did so. We used blank cardboard boxes to represent the solution and coloured pens and small cards helped them to design the branding and ‘features’."
        },
        {
            "text": "What We Did"
        },
        {
            "text": "We ran our workshop earlier this year in a Cat C male prison. We had 7 participants on the day, and although they started off reserved and quiet, soon they were confidently sharing their experiences and thoughts with the group. Two of the men elected to work together in a pair, which we had stressed at the start that they could do if they felt more comfortable this way. We also let them know that spelling and grammar did not matter and they could use illustrations rather than words if that was easier for them"
        },
        {
            "text": "We facilitated the session in a relaxed way - offering observations and gentle questioning throughout. At the end, when they had finished their box designs, we invited them to do a mini ‘show and tell’ back to the group. This was really useful for us in gathering a summary of their feedback and provided a further opportunity for follow up questions."
        },
        {
            "text": "Outcomes and Learning"
        },
        {
            "text": "You can see from the pictures of the boxes they created that we had some really great ideas - including potential names. Inside the boxes were cards on which they had written their ‘features’ or the things they felt were most important to have for resettlement."
        },
        {
            "text": "I am really glad we had two facilitators for a group this size - it meant we were able to try to engage the quieter participants and not let the more confident people lead the session."
        },
        {
            "text": "Running this sort of design workshop worked really effectively for us as a research method - being able to capture physical outputs gives you a real tangible representation of user needs and pain-points. They also serve as a great physical asset to show stakeholders - it’s literally the participant’s own words."
        },
        {
            "text": "I think we should mention the fact that some of them said they’d been to similar sessions previously but don’t think anything had ever changed as a result - so it’s important we follow through on our promises and ideally go back and show them the prototype they helped to design."
        },
        {
            "text": "We’re keen to run similar workshops during our alpha phase, building on what we learnt here."
        }
    ]
}