{
    "url": "https://nationalscreening.blog.gov.uk/2023/04/11/expert-research-and-methodology-group-gets-down-to-work/",
    "title": "Expert research and methodology group gets down to work",
    "authors": [
        "Professor Anne Mackie"
    ],
    "categories": [
        "General"
    ],
    "pub_date": "2023-04-11T08:08:02+01:00",
    "content": [
        {
            "text": "High quality research and evidence underpins the work of the UK National Screening Committee (UK NSC) and all the recommendations it makes to ministers and the NHS in the 4 UK countries."
        },
        {
            "text": "The UK NSC only recommends a screening programme if peer-reviewed, published evidence demonstrates screening would do more good than harm at reasonable cost."
        },
        {
            "text": "The 4 UK chief medical officers (CMOs) last year emphasised just how important research is for screening when they made their recommendations for the UK NSC’s expanded remit. They proposed the establishment of a research sub-group and this new group, the UK NSC’s research and methodology group (RMG) is now getting to grips with an important and varied workload."
        },
        {
            "heading": 2,
            "text": "Why we need the RMG"
        },
        {
            "text": "The expansion of the UK NSC’s remit, to cover targeted and stratified screening as well as population screening, has not only increased the committee’s potential to positively impact public health. It is also likely to greatly increase the volume of screening-related research questions, issues and opportunities."
        },
        {
            "text": "There is significant demand from researchers, research funders and industry to understand exactly what sort of research and evidence the UK NSC needs in order to make a positive screening recommendation."
        },
        {
            "text": "In the past, some well-funded studies have not met UK NSC requirements, wasting money and the time and effort of research participants."
        },
        {
            "heading": 2,
            "text": "How the RMG will help"
        },
        {
            "text": "One of the RMG’s most important functions will be to provide clarity on the UK NSC’s research requirements for stakeholders. This should help ensure that future screening research is fit for purpose and impactful."
        },
        {
            "text": "Evidence synthesis and economic modelling underpin the UK NSC’s evidence review process and recommendations. The RMG will define best practice for these methods that are crucial to the committee’s work."
        },
        {
            "text": "The group will advise on research design more broadly and provide expert input on the research and evidence implications and requirements associated with exciting new technologies such as multi-cancer early detection tests."
        },
        {
            "text": "The RMG has been tasked with keeping up to date with screening research by establishing close links with funding bodies, researchers and screening programme teams."
        },
        {
            "text": "It will identify the UK NSC’s screening research priorities and research gaps and advise on mechanisms to address them."
        },
        {
            "heading": 2,
            "text": "Wealth of expertise"
        },
        {
            "text": "The RMG is chaired by Professor Sian Taylor-Phillips, professor of population health at the University of Warwick."
        },
        {
            "text": "Its members have a wealth of experience and expertise covering areas such as health economics, behavioural science, statistics and research synthesis."
        },
        {
            "text": "Prof Taylor-Phillips said:"
        },
        {
            "text": "Any individual researcher, stakeholder or organisation wanting to contact the RMG can do so by emailing screeninginformation@dhsc.gov.uk."
        },
        {
            "heading": 2,
            "text": "Keep up to date"
        },
        {
            "text": "The UK NSC blog provides up to date news from the UK National Screening Committee. You can register to receive updates direct to your inbox, so there’s no need to keep checking for new articles. If you have any questions about this blog article, or about the work of the UK NSC, email screeninginformation@dhsc.gov.uk."
        }
    ]
}