{
    "url": "https://deframedia.blog.gov.uk/2023/04/11/four-new-bathing-waters-designated/",
    "title": "Four new bathing waters designated",
    "authors": [
        "Defra Press Office"
    ],
    "categories": [
        "water"
    ],
    "pub_date": "2023-04-11T16:25:41+01:00",
    "content": [
        {
            "text": "There has been coverage in various national and regional media outlets including the Guardian, Independent, The Times, East Anglian Daily Times, Jersey Evening Post and Suffolk Live following yesterday’s announcement (10 April) that four new bathing water sites will be designated across England."
        },
        {
            "text": "Following a two week public consultation, Sykes Lane Bathing Beach and Whitwell Creek at Rutland Water, Firestone Bay in Plymouth, and a section of the River Deben at Waldringfield, Suffolk, will all be officially designated ahead of the 2023 bathing water season. This will take the total number of bathing waters across the country to 424."
        },
        {
            "text": "The four new sites will benefit from regular monitoring by the Environment Agency during the bathing season - which runs between 15 May and 30 September – that will test the water quality and assess whether action is needed to reduce pollution at these locations."
        },
        {
            "text": "The government has made significant progress over the past decade in improving bathing water quality at existing sites. Since 2010, the proportion of bathing waters assessed as ‘good’ or ‘excellent’ has increased from 76% to 93%. Meanwhile, 72% are considered ‘excellent’ - up from just 51% in 2010."
        },
        {
            "text": "This announcement follows the Plan for Water, launched by the government last week, which brings together the significant action already taken, along with more investment, stronger regulation and tougher enforcement on those who pollute."
        },
        {
            "text": "Water Minister Rebecca Pow said:"
        },
        {
            "text": " "
        }
    ]
}