{
    "url": "https://buyingforschools.blog.gov.uk/2023/04/11/helping-schools-to-make-more-sustainable-printing-choices/",
    "title": "Helping schools to make more sustainable printing choices",
    "authors": [
        "Ross Buthee, Commercial Lead, Crown Commercial Service"
    ],
    "categories": [
        "Services"
    ],
    "pub_date": "2023-04-11T09:28:27+01:00",
    "content": [
        {
            "text": "Ahead of World Earth Day on 22 April, Ross Buthee, Commercial Lead at Crown Commercial Service (CCS), blogs about his experience of developing the Print marketplace. This DfE-approved framework is an innovative, online purchasing portal built to responsibly meet the printing needs of the education sector, putting the power of making more sustainable choices in the hands of schools and trusts."
        },
        {
            "text": "Schools and multi-academy trusts print thousands of items every year – materials such as exercise and workbooks, right through to stationery, parent communications and promotional items. For example, via the Print marketplace alone, we saw over 40,000 key stage workbooks, 11,500 prospectuses and school promotional items, 8,000 posters and 2,500 lanyards and branded merchandise ordered during the 2021/2022 academic year. The education sector clearly still has huge print requirements, so the question is, how do we make these more sustainable?"
        },
        {
            "text": "Due to concerns over climate change, the world is moving positively towards more sustainable ways of living and working and print is no exception. This is one of the reasons that CCS has partnered with APS Group and YPO to develop the Print marketplace, offering an online solution that makes it easier for print buyers to make more environmentally friendly buying decisions. This can be done in many ways. You can choose a specific grade of sustainability for your paper – right up to 100% recycled. The system doesn’t have a minimum order quantity so the potential for wastage is significantly reduced. You can filter quotes based on delivery miles, meaning the closer your supplier, the less CO2 will be released into the atmosphere through transportation. The Print marketplace also supports your local economy, letting you choose a supplier based on locality. In addition to all this, 94% of our suppliers are SMEs, with over 300 apprentices employed across the supply chain."
        },
        {
            "text": "I’ve already listed a few different ways you can make better print buying decisions, but we wanted to go one step further. For most orders you can also choose to offset residual carbon emissions on your print quotes, which 80% of customers choose to do where possible. With the help of Climate Impact Partners, specialist in carbon market solutions for climate action, customers who choose to offset their emissions provide finance to projects which are reducing emissions now, supporting the transition to a low carbon global economy."
        },
        {
            "text": "Our offsetting programme supports projects that develop and operate sustainable infrastructure. Sustainable infrastructure projects accelerate the transition to renewable energy and decrease our dependence on fossil fuels. These large-scale technology solutions focus on the biggest sources of global emissions and reduce the carbon intensity of energy, transportation, and industry. In addition to the reduction of emissions these projects deliver several other benefits including affordable and clean energy, job creation and economic growth, and industry development and innovation."
        },
        {
            "text": "We are proud of the Print marketplace portal’s commitment to sustainability and social value - it’s a really easy way to contribute towards your organisation’s environmental and social value goals. This, along with other initiatives, such as tree planting with The Woodland Trust as part of a Carbon Capture scheme, all demonstrate that CCS are serious about combatting climate change."
        },
        {
            "text": "If you want to find out more about Print marketplace and get the chance to ask us your questions, register now to join our Buying for Schools webinar:"
        },
        {
            "text": "Buying print for your school – Tuesday 25 April, 11-11.30am"
        },
        {
            "text": "If you’ve found this article useful and want to learn more about how we’re supporting schools, click ‘sign up and manage updates’ to subscribe to our blog and receive notifications when we next post."
        }
    ]
}