{
    "url": "https://nda.blog.gov.uk/nws-employees-visit-nuclear-waste-facilities-in-sweden-during-international-learning-trip/",
    "title": "NWS employees visit nuclear waste facilities in Sweden during international learning trip",
    "authors": [
        "Kristina Drake"
    ],
    "categories": [
        "International activities"
    ],
    "pub_date": "2023-04-11T15:52:23+01:00",
    "content": [
        {
            "text": "Last month, NWS employees travelled to Sweden to meet the organisation responsible for managing and disposing of the country’s nuclear waste, SKB."
        },
        {
            "text": "The privately owned company, which identified a site for a Geological Disposal Facility in 2009, hosted the NWS team to support international collaboration and provide learnings on the country’s GDF programme."
        },
        {
            "text": "Sweden has made great progress in the last 30 years with its geological disposal plans. In 1992, every local authority in Sweden was invited to take part in the site selection process and the search was eventually narrowed down to 2 communities in Ӧsthammar and Oskarshamn."
        },
        {
            "text": "Comprehensive site investigations over 5 years led to a decision in favour of the Forsmark site in Ӧsthammar, close to an existing nuclear power station and where the granite rock is 1.9 billion years old. When fully developed, some time in the 2080s, the repository will comprise around 60 km of tunnels with space for more than 6,000 canisters of spent fuel."
        },
        {
            "text": "The group from NWS were given the opportunity to visit the site in Forsmark, tour the small-scale mock-up of a GDF at Äspö Hard Rock Laboratory and visit the research site which SKB use to understand the stability of replica waste packages in the host rock at depths of 450m or more."
        },
        {
            "text": "They also visited the Clab interim storage for spent nuclear fuel, and the Canister Laboratory which researches packaging and canisters for spent nuclear fuel."
        },
        {
            "text": "At the end of the trip, NWS sat down with Jenny Rees from SKB to discuss their journey so far with the GDF programme and their next steps."
        },
        {
            "text": "Who are SKB and what is SKB’s role in Sweden?"
        },
        {
            "text": "SKB, the Swedish Nuclear Fuel and Waste Management Company, is responsible for managing the radioactive waste and spent fuel from nuclear power production, research, and medical use in Sweden."
        },
        {
            "text": "What stage is SKB currently at with its GDF plans?"
        },
        {
            "text": "We recently received the government’s decision stating that SKB can build the final repository for spent nuclear fuel in Forsmark and an encapsulation plant in Oskarshamn. Today we are taking care of Sweden’s spent fuel in the short term in interim storage, but we need to take care of it long term as well, and that is why we need to build the final repository. We’re just waiting for two key bits of legislative approvals before we can begin construction, which we expect to receive soon."
        },
        {
            "text": "What are your long-term plans for high-level waste not destined for a GDF?"
        },
        {
            "text": "SKB has one final repository for low- and intermediate-level short-lived waste (material that is radioactive for only a few hundred years), the SFR facility. SFR has been operating since the middle of the 1980s, and it is now being extended to be able to dispose of decommissioning waste."
        },
        {
            "text": "The final repository for spent nuclear fuel (the GDF), which is where all the high-level waste is going, will be constructed as soon as we have received the building conditions from the Land and Environment Court and the Radiation Safety Authority."
        },
        {
            "text": "We are also planning for a final repository for low- and intermediate-level long-lived waste, the SFL facility. This means that we will eventually have three final underground repositories."
        },
        {
            "text": "How long has it taken you to get to this stage?"
        },
        {
            "text": "We have recently celebrated 50 years of SKB as a company. I have worked at SKB for 26 years, all in Communications and Community Engagement. Working to inform the public for many years has been an interesting and challenging journey.  Informing the public is what in the end brings trust and acceptance. SKB realised the importance of clear and transparent information in the 1980s, especially on a local level, and our communication and consultation programmes have evolved since then. We are very proud to have firm trust and support in the communities where we have our facilities, and it requires our dedication every day."
        },
        {
            "text": "What engagement have you done with communities on your GDF programme?"
        },
        {
            "text": "I don’t even know where to start! We have invited the people living in the municipalities where we are planning to build our facilities to meetings and events, we have a magazine, we host exhibitions, we arrange visits to our existing facilities, and that’s just to mention a few. We also really utilise social media nowadays, something we didn’t have 26 years ago."
        },
        {
            "text": "Back then we went to visit all our neighbours to speak to them, to inform them about future plans and about the steps we were taking so that the people living in the municipality were taking these steps with us. We invited them to take the journey with us and have their say in the process. It has taken many years to build these relationships. We feel we are in a very good place now and our opinion polls show this."
        },
        {
            "text": "For your chosen site, what are the main benefits for the community? "
        },
        {
            "text": "I would say a big benefit for the municipality is that it is a big infrastructure project, and it will provide a lot of jobs. It is a big investment. It takes about 10 years to construct a final repository and there are hundreds of people that will be doing construction work at the site. They are going to have to live somewhere, shop somewhere, and eat somewhere locally. It creates a lot of jobs and really supports the local economy."
        },
        {
            "text": "… and what are the challenges?"
        },
        {
            "text": "One challenge is that not everybody wants a final repository, and we have to accept that. It is also important not to be afraid to have open discussions with everyone and listen to the different opinions."
        },
        {
            "text": "However, most of the people living in the areas where SKB is operating are supportive of a GDF. If you looked at our opinion poll, more than 80% of people support our plans."
        },
        {
            "text": "Another challenge is that when we start to construct and build, there will be more traffic on the roads. That could disturb our neighbours and we are already looking to address these challenges when it comes to the construction of the facility."
        },
        {
            "text": "What have you learnt along the way so far?"
        },
        {
            "text": "When we started in the 80s, we drilled boreholes in many places in Sweden, to get a map to see what kind of bedrock we had. We had all the permits we needed but didn’t consider communicating with the public before going out with our drilling equipment, so there were some demonstrations.  We had to go back and think, how can we do things better? And that is when we started to plan our communications activity. We realised quite quickly that we needed to have local information offices, where people could come in and speak to us whenever they wanted and invite the public to our facilities."
        },
        {
            "text": "We wanted to be open and transparent. It is so important to earn the trust of the local community. You have to accept that sometimes you don’t have all the answers and be honest about that. For example, we were asked at the beginning what is going to happen to house prices? What will it look like? When we didn’t have the answers, we found them. We took it question by question. The public need to know this information before they can say if they want to host a GDF in their community or not. In the siting process in Sweden, the municipalities need to say yes to enable SKB to take our plans forward. Both our host municipalities have done just that."
        },
        {
            "text": "Any advice?"
        },
        {
            "text": "What we have learnt is that it is not enough to have all the permits you need. Of course, you have to have all the permits and permissions necessary, but you also need to start early and speak to communities. My advice to you, and all the other countries that are coming to us and are in the beginning of their process, is simple – start early with the communication and, be as close as possible to the people living in the areas."
        },
        {
            "text": "Also, we have two processes; one is the technical process, and in parallel with that is the acceptance and trust process. They must be done together. The people need to take the journey with you, every step of the way."
        }
    ]
}