{
    "url": "https://educationhub.blog.gov.uk/2023/04/11/what-are-short-breaks-for-disabled-children-and-improving-service/",
    "title": "What are short breaks for disabled children and how are we improving the service",
    "authors": [
        "media officer"
    ],
    "categories": [
        "SEND"
    ],
    "pub_date": "2023-04-11T17:12:01+01:00",
    "content": [
        {
            "text": "Every child deserves the same opportunity to meet their potential. For those with special educational needs and disabilities (SEND) this means making sure they have the opportunity to develop skills, make friends and gain independence."
        },
        {
            "text": "Short breaks away from family can be a fun and exciting way for children to learn these skills, and at the same time, provides parents and carers with a much-needed rest from caring responsibilities."
        },
        {
            "text": "The service is free and provided by local authorities, but we know that some families have struggled to find a service that meets their needs."
        },
        {
            "text": "That’s why we created the short breaks innovation fund."
        },
        {
            "heading": 3,
            "text": "What are short breaks? "
        },
        {
            "text": " Short breaks provide disabled children and teens, with opportunities to take part in unforgettable activities and develop vitals skills, while giving their families a chance to rest from caring duties."
        },
        {
            "text": "They also provide opportunities for disabled children and young people to have an enjoyable experience that helps them to become more independent and form friendships outside of their family."
        },
        {
            "heading": 3,
            "text": "What is the short breaks innovation fund?"
        },
        {
            "text": "To make sure that local authorities are meeting the needs of SEND children and families, we’ve launched the Short Breaks Innovation Fund, worth £30million over three years."
        },
        {
            "text": "It is to be used to set up new short break projects and test new approaches to improve the service."
        },
        {
            "text": "We have already completed the first year of the programme, which included seven projects in seven different local authorities, and it showed positive results for children and their families."
        },
        {
            "text": "The second year of the programme began in April 2023."
        },
        {
            "heading": 3,
            "text": "What are some examples of a short break?"
        },
        {
            "text": "The breaks can range a lot in nature, from sleep-over clubs and film-making workshops to build teamworking skills, as well as outdoor activities, adventure, and team building."
        },
        {
            "text": "For example, in Sunderland they have a project called, Breathing Space which provides support to children aged 10 to16 with social, emotional or mental health (SEMH) needs or Autism."
        },
        {
            "text": "The teams in the area create innovative short break activities for these children to help improve their emotional regulation skills."
        },
        {
            "text": "Parents and carers are also offered peer support and training whilst children are taking part in their activities."
        },
        {
            "text": "The Breathing Space programme has led to improved attendance, improved behaviour and a reduction in suspensions from school."
        },
        {
            "heading": 3,
            "text": "Where can I find out more about short breaks? "
        },
        {
            "text": "To find out what is available where you live, visit your local authority’s website and search for short breaks."
        },
        {
            "text": "You can also find out more on your area’s Local Offer website – simply type your local authority’s name and ‘SEND local offer’ into your search engine."
        }
    ]
}