{
    "url": "https://environmentagency.blog.gov.uk/2015/07/29/waste-crime-help-spot-it-and-stop-it/",
    "title": "Waste crime: help spot it and stop it",
    "authors": [
        "National Enforcement Service Intelligence Team Member"
    ],
    "categories": [
        "Regulated industry",
        "Waste"
    ],
    "pub_date": "2015-07-29T10:25:01+00:00",
    "content": [
        {
            "text": "Our work collecting and evaluating information about serious and organised environmental crime is vital for stopping waste crime.  We use reports about suspected illegal activity from industry and the public to build intelligence so we that can target our work and take action against waste criminals."
        },
        {
            "text": "If you think you have seen illegal waste activity, help stop it by reporting it anonymously to Crimestoppers on 0800 555 111 or online."
        },
        {
            "text": "Here are some signs to spot that could indicate that a waste site is breaking the law."
        },
        {
            "heading": 2,
            "text": "Signs to spot an illegal waste site"
        },
        {
            "text": "There are lots of signs to look out for, which could suggest suspicious activity. These include:"
        },
        {
            "text": "The lack of a sign at the site entrance giving the operator’s name and permit number, flyers advertising cheap disposal rates and odour caused by rotting waste on the site could also be signs that they are operating outside of the law."
        },
        {
            "text": "Fly-tipping should be reported to your local council."
        },
        {
            "heading": 2,
            "text": "How we use your reports"
        },
        {
            "text": "In the Intelligence Team we build a picture of what’s happening – locally, nationally and internationally – so that we can target Environment Agency resources to have the most impact. Investigating illegal waste sites, illegal waste exports and the deliberate mis-description of waste to evade taxation are our current big priorities."
        },
        {
            "text": "Illegal waste sites cause environmental pollution and undercut legitimate business. Sites involved in the processing, storage or disposal of waste must have a permit issued and regulated by the Environment Agency. The permit makes sure that the sites only take certain types and quantities of waste and that they have infrastructure in place to prevent pollution. For example, the use of sealed drainage systems to prevent water pollution or fencing to prevent litter escaping from the site."
        },
        {
            "text": "Illegal operators working outside this system often charge less for their services because they don’t put pollution prevention measures in place. This puts communities and the environment at risk and threatens legitimate businesses."
        },
        {
            "heading": 2,
            "text": "Checking whether a site is registered"
        },
        {
            "text": "Whether you are a business, local council or householder make sure you know where your waste goes, so it doesn't end up in the hands of illegal operators.  Everyone who disposes of waste has a ‘duty of care’ to ensure it is handled safely and correctly."
        },
        {
            "text": "Landowners should make sure that tenants involved in waste have the necessary permissions in place and remain compliant with those permissions. The costs for landlords to clear up an illegal waste site can run to thousands of pounds."
        },
        {
            "text": "You can check the public register to see if a site is permitted and whether the person who collects and disposes of your waste is a registered waste carrier."
        },
        {
            "heading": 2,
            "text": "Taking action against waste criminals"
        },
        {
            "text": "We take a wide range of action against the operators of illegal waste sites depending upon the nature of the illegal activities and the history of the offender. Where appropriate we will prosecute offenders."
        },
        {
            "text": "Operating an illegal waste site can result in unlimited fines and up to 5 years imprisonment. Other penalties, which can be sanctioned by the courts, include disqualification as a director, seizure of vehicles, disqualification from driving and community service. We will also use the Proceeds of Crime Act to recover any monies generated as a result of the illegal activity. This can run into hundreds of thousands of pounds."
        },
        {
            "text": "If you suspect that a site is operating illegally, report it. We've partnered with independent charity Crimestoppers to provide an anonymous way of reporting waste crime. Call 0800 555 111 or report it online at www.crimestoppers-org.uk."
        }
    ]
}