{
    "url": "https://food.blog.gov.uk/2025/03/05/precision-breeding-publication-of-draft-guidance/",
    "title": "Precision Breeding – Publication of Draft Guidance",
    "authors": [
        "Dr James Cooper, Deputy Director of Food Policy"
    ],
    "categories": [
        "Business guidance",
        "Science"
    ],
    "pub_date": "2025-03-05T16:21:23+00:00",
    "content": [
        {
            "text": "This week, draft secondary legislation necessary to implement the Genetic Technology (Precision Breeding) Act 2023 for plants in England was laid in Parliament. The Government wants to introduce precision breeding technology due to its potential to increase food production, reduce costs for farmers, and enable the cultivation of drought and disease-resistant crops. Precision breeding technology offers the possibility of developing crops that are more nutritious, pest and disease-resistant, climate-resilient, and environmentally beneficial."
        },
        {
            "text": "Precision breeding involves introducing genetic changes into the DNA of plants or animals limited to those that could occur through traditional breeding methods. These changes are introduced using modern biotechnology techniques such as gene editing. Other genetic changes, such as those involving insertion of foreign DNA into the genome, will continue to be regulated as Genetically Modified Organisms (GMOs)."
        },
        {
            "text": "Precision Bred organisms for food and feed use will be classified as regulated products. The Food Standards Agency (FSA) is responsible for ensuring the safety of all foods and feeds classified as regulated products. This means we will need to make sure that any precision-bred organism (PBO) intended for use in food and feed in England is safe for its consumers to eat, before it can be sold."
        },
        {
            "text": "The draft regulations that have now been introduced to Parliament set out the requirements of the new regulatory framework that will apply to PBOs. The proposals that we have included in these regulations have been developed following input from our Board, other Government departments and our independent scientific advisory committees. If Parliament approve these regulations, the FSA will launch our new regulatory service later this year."
        },
        {
            "text": "Our framework for precision bred organisms is science and evidence based and has been designed to regulate each PBO proportionately to the risk posed. All PBOs must meet the statutory requirements in the regulations before they can be sold, and in-depth safety assessments will be conducted by the FSA, in line with those regulations, where necessary."
        },
        {
            "text": "To ensure that the guidance for the safety assessment of precision bred organisms work effectively, we have published our draft guidance documents and will undergo a period of user testing to allow businesses and researchers as potential applicants to take time to review it, and feedback to us on the clarity of the document."
        },
        {
            "text": "After this period of user testing, we will use the feedback gained to finalise the guidance documents before final preparation for secondary legislation."
        }
    ]
}