{
    "url": "https://planninginspectorate.blog.gov.uk/2025/03/05/reflections-on-the-nsip-forum-2025-embracing-change-and-innovation-in-infrastructure-planning/",
    "title": "Reflections on the NSIP Forum 2025: Embracing change and innovation in infrastructure planning",
    "authors": [
        "David Price"
    ],
    "categories": [
        "Applications",
        "nationally significant infrastructure projects"
    ],
    "pub_date": "2025-03-05T16:40:31+00:00",
    "content": [
        {
            "text": "Last week, I had the pleasure of presenting at the Waterfront NSIP Conference, sharing updates about the Planning Inspectorate’s work and discussing the ongoing development of our infrastructure service. The room was full of infrastructure professionals with great energy and ideas, reflecting the sector's shared commitment to delivering crucial infrastructure projects efficiently and effectively."
        },
        {
            "heading": 2,
            "text": "Current State of Play"
        },
        {
            "text": "We're currently managing over 30 live NSIP applications, with a significant proportion comprising generating stations - particularly offshore wind and solar farms. What's particularly interesting is the pipeline of over 70 projects at pre-application stage. While the energy sector continues to dominate, we're seeing some notable trends: solar projects are increasing, as are electric line applications, while there's been a decline in both road projects and offshore wind developments."
        },
        {
            "text": "Our pre-application service continues to evolve, currently supporting:"
        },
        {
            "heading": 2,
            "text": "Service transformation"
        },
        {
            "text": "From April, we're implementing a new service model that puts the customer at its heart. This transformation is built on becoming increasingly digital by design and data-driven, while maintaining our professional standards and improving operational efficiency. "
        },
        {
            "text": "We're following an Agile methodology and are particularly excited about several digital improvements currently in development, including an Applicant's Portal (currently in Alpha), AI-powered redaction tools (in Beta), GIS integration (in Alpha), and new recommendation systems (in the Discovery phase). "
        },
        {
            "text": "I'm pleased to announce that we've updated our website to include a more structured feedback process through our customer contact form. Whether it's positive feedback or constructive criticism, we want to hear from you. We've also improved data accessibility, allowing you to export project summary information directly from our Project search page as CSV files."
        },
        {
            "heading": 2,
            "text": "Key learnings and advice"
        },
        {
            "text": "Our experience has highlighted several crucial points for successful NSIP applications. In the run up to and during pre-application, it's vital to thoroughly read and understand Government Guidance and our Pre-Application Prospectus. We strongly encourage early engagement with relevant parties around drafting of protective provisions and emphasise the importance of good design too! Do check out our recently updated and published advice and associated webinars."
        },
        {
            "text": "The first four months of our new Pre-application Service have provided valuable insights. We've learned the importance of comprehensive programme documents for resource planning, and the value of multi-partite meetings. We're continuing to refine our processes based on feedback. We will be launching customer surveys soon but are keen to receive feedback from all our stakeholders."
        },
        {
            "heading": 2,
            "text": "New guidance for linear infrastructure projects"
        },
        {
            "text": "I'm particularly excited to highlight our newly published advice note for linear NSIPs. This comprehensive guidance covers everything from electricity lines and pipelines to transport infrastructure, drawing on best practice and real examples from recent projects. The advice addresses crucial aspects including pre-application engagement, environmental impact assessment, design evolution, construction planning, land rights, and DCO preparation."
        },
        {
            "text": "This publication comes at a critical time as we see and anticipate increasing demand for our infrastructure service, particularly for linear infrastructure projects. We've designed this guidance to be practical and accessible, incorporating lessons learned from previous examinations to help both applicants and stakeholders navigate the complexities of linear infrastructure projects."
        },
        {
            "text": "To support this new guidance, we're hosting a detailed webinar on 6 March (12:30-14:00), where our experienced Examining Inspectors Annie Coombs and Richard Allen will share their insights from examining major linear schemes. This session will offer valuable opportunities for discussion and knowledge sharing through a Q&A session. If you can't make the session then keep an eye on our webinar page where a recording will be posted."
        },
        {
            "heading": 2,
            "text": "Looking forward"
        },
        {
            "text": "We're committed to continuous improvement. We're reviewing our pre-application service and exploring innovative improvements across all areas of our service. The launch of our new linear infrastructure guidance and accompanying webinar represents just one step in our ongoing journey to enhance our service delivery."
        },
        {
            "heading": 2,
            "text": "Final thoughts"
        },
        {
            "text": "Events like the Waterfront NSIP Conference are invaluable opportunities for dialogue with our stakeholders. As we move forward, we're placing greater emphasis on our engagement in effort to develop a responsive service delivery. The infrastructure sector faces significant challenges, but I'm confident that through collaboration and innovation, we can meet the government's ambitious infrastructure delivery targets while maintaining the highest standards of examination and decision-making."
        },
        {
            "text": "Your feedback and ideas for improvement are always welcome - they're essential to helping us deliver a better service for everyone involved in the NSIP process."
        }
    ]
}