{
    "url": "https://educationhub.blog.gov.uk/2023/09/how-the-period-products-scheme-is-removing-barriers-in-education/",
    "title": "How the Period Products Scheme is removing barriers in education",
    "authors": [
        "mediaofficer"
    ],
    "categories": [
        "Period Products Scheme",
        "Schools"
    ],
    "pub_date": "2023-09-28T15:35:34+01:00",
    "content": [
        {
            "text": "Nobody should have to miss out on education because of their period. That’s why we launched the Period Product Scheme which provides pupils and students with period products when they need them in their place of study."
        },
        {
            "text": "Since its launch in January 2020, 99% of secondary schools and 94% of post 16 organisations have ordered products using the scheme."
        },
        {
            "text": "We offer a range of products for schools and colleges to order, including pantyliners and environmentally-friendly products, such as period pants. We encourage schools and colleges to include their pupils and students in deciding which products should be available for them."
        },
        {
            "text": "Here we provide information on the scheme and how your schools and colleges can get involved."
        },
        {
            "heading": 3,
            "text": "What is the Period Products Scheme?"
        },
        {
            "text": "The Period Products Scheme provides pupils with period products when they need them."
        },
        {
            "text": "It provides access to tampons, pads and more through schools or colleges if, for example, pupils can’t afford period products, have forgotten to bring them to school or college, or have come on their period unexpectedly."
        },
        {
            "heading": 3,
            "text": "What are schools saying about the Period Products scheme?"
        },
        {
            "text": "We visited Gillas Lane Primary Academy in Sunderland for World Menstrual Hygiene Day (28 May 2023) and spoke to teacher, Emma Monaghan."
        },
        {
            "text": "Emma discussed how they have implemented the scheme successfully in their school. She mentioned how the scheme can eradicate any barriers to learning and make a real impact on outcomes for children."
        },
        {
            "heading": 3,
            "text": "Are environmentally friendly products available at my child’s school?"
        },
        {
            "text": "All schools have the option to order period pants and reusable period pads, which are designed for long-term use and offer a sustainable alternative to other period products."
        },
        {
            "text": "The proportion of organisations ordering environmentally friendly or reusable products was higher in 2023 than in earlier years - in 2023, 52% of ordering organisations had bought environmentally friendly or reusable products, compared with 44% in 2022 and 35% of organisations in both 2020 and 2021."
        },
        {
            "heading": 3,
            "text": "Who is eligible for the scheme?"
        },
        {
            "text": "All state-funded schools (including primary schools with Year 5 pupils and above) and DfE-funded 16-19 education organisations in England are eligible to access the scheme."
        },
        {
            "heading": 3,
            "text": "How does the scheme work?"
        },
        {
            "text": "To make sure organisations have access to a wide range of period products in the most cost-effective and efficient way, we have a national contract with Personnel Hygiene Services Limited (phs). This allows organisations to order period products and have them delivered when they need them."
        },
        {
            "text": "Schools and colleges then choose how the products are made available to pupils. Some have them in the welfare room, others in toilets. Some organise drop-in sessions where pupils and students can go to collect products."
        },
        {
            "heading": 3,
            "text": "I don’t think my school/college offers this – what should I do?"
        },
        {
            "text": "Speak to your school or college and make sure they are aware of the scheme – if they are not, explain that they should look online at how to get involved."
        },
        {
            "heading": 3,
            "text": "How long does the scheme run for?"
        },
        {
            "text": "The scheme has been extended until at least July 2024 as part of the Government’s drive to end period poverty and support disadvantaged pupils."
        },
        {
            "text": "More information on the Period Product scheme can be found here."
        }
    ]
}