{
    "url": "https://environmentagency.blog.gov.uk/2023/09/28/improving-the-way-we-deliver-property-flood-resilience/",
    "title": "Improving the way we deliver Property Flood Resilience",
    "authors": [
        "Environment Agency"
    ],
    "categories": [
        "Flood"
    ],
    "pub_date": "2023-09-28T09:26:15+00:00",
    "content": [
        {
            "text": "Julie Foley, Director of Flood Risk Strategy & National Adaptation"
        },
        {
            "text": "It is essential that we make homes and businesses resilient to flooding and when the worst happens build back better to limit any future damages and speed up recovery."
        },
        {
            "text": "Property flood resilience involves making changes to properties to keep as much floodwater out as possible and reduce damages if water does enter. These changes can involve using flood doors or barriers, self-closing air bricks, raising electrics and tiling floors."
        },
        {
            "text": "We’re committed to raising awareness of property flood resilience measures and increasing their take up for communities at flood risk. This is a priority in our National Flood and Coastal Erosion Risk Management (FCERM) Strategy and FCERM Strategy Roadmap."
        },
        {
            "text": "Earlier this year, working closely with Flood Re, we launched the Be Flood Smart campaign to showcase the property flood resilience options available and raise awareness. Our campaign has reached 10 million people and helped to improve understanding of the steps people can take to keep their property and possessions safe."
        },
        {
            "text": "Through our flood and coastal risk investment programme, we’re making property flood resilience measures easier to take forward. There are potentially many locations up and down the country which would benefit from property flood resilience measures to keep floodwater out. These are often places which have suffered regular flooding over several decades."
        },
        {
            "text": "To speed up the installation of property flood resilience measures, we are streamlining our processes to make it easier for partners to access funding from the Environment Agency. This will help to save time and avoid disproportionate project development costs. Our new process is available to all flood risk management authorities including local councils, water companies and internal drainage boards in England."
        },
        {
            "text": "Later this year, we will be launching a new supplier framework to survey properties and to fit property flood resilience measures. It will be made up of surveyors and installers who are well-trained and skilled. They will also be using quality products, which have been thoroughly tested."
        },
        {
            "text": "With recent flooding sadly affecting parts of England, it is important that we are all prepared. Alongside property flood resilience measures, checking your flood risk, signing up for warnings, and making a flood plan are all important steps in giving peace of mind to communities."
        }
    ]
}