{
    "url": "https://ipo.blog.gov.uk/2023/09/28/meet-the-ipo-board-director-of-people-and-place-penny-phillpotts/",
    "title": "Meet the IPO Board: Director of People and Place, Penny Phillpotts ",
    "authors": [
        "Kayleigh Enticknap"
    ],
    "categories": [
        "Gender Pay Gap",
        "Inclusion and diversity",
        "IPO",
        "Recruitment",
        "STEM career",
        "Transformation"
    ],
    "pub_date": "2023-09-28T12:00:25+01:00",
    "content": [
        {
            "text": "Introducing the next candidate in our ‘Meet the Board’ series: Penny Phillpotts, Director of People and Place at the IPO. We spoke to Penny about where her career started, how her experience has been since she joined the IPO last year, and what she sees as her priorities for the future.  "
        },
        {
            "heading": 2,
            "text": "A healthy start "
        },
        {
            "text": "Penny told us how her first job was in HR, temping in an NHS organisation.  "
        },
        {
            "text": "Penny loved it so much, in fact, she stayed to pursue her HR qualifications. Since then, she has worked in a number of different public sector organisations – some NHS, higher education, audit organisations and some freelance consulting.  "
        },
        {
            "heading": 2,
            "text": " A match of values  "
        },
        {
            "text": "We asked Penny to describe what attracted her to join the IPO.  "
        },
        {
            "heading": 2,
            "text": " Future priorities – and a culture audit "
        },
        {
            "text": "We were keen to find out about Penny’s focus so far and what she sees as her team’s future priorities.  "
        },
        {
            "text": "Penny outlined how this year is all about planning for the future, assessing where we are against where we said we want to be and building plans for the future. "
        },
        {
            "text": "So how will the IPO get to where we want to be? "
        },
        {
            "heading": 2,
            "text": "Diversity and inclusion  "
        },
        {
            "text": "Aware that this is a challenge shared by organisations right across the STEM sector, Penny is determined that as an organisation, we can make a difference.  "
        },
        {
            "text": "One initiative is a programme supporting science and technology ‘returners’ back into work after a career break. "
        },
        {
            "heading": 2,
            "text": "Investing in leadership "
        },
        {
            "text": "Accommodation plays its part, too."
        },
        {
            "heading": 2,
            "text": "Thoughts on the future "
        }
    ]
}