{
    "url": "https://mojdigital.blog.gov.uk/2023/09/28/moj-accessibility-team-from-creation-to-nomination/",
    "title": "MoJ Accessibility team: from creation to nomination",
    "authors": [
        "Beverley Newing"
    ],
    "categories": [
        "Accessibility",
        "Diversity and Inclusion",
        "National Inclusion Week"
    ],
    "pub_date": "2023-09-28T11:27:44+01:00",
    "content": [
        {
            "text": "The Justice Digital accessibility team are currently celebrating! We’ve made it through to the nominations list for the Civil Service Awards and we’re in the Diversity and Inclusion category - fingers crossed."
        },
        {
            "text": "As part of our celebrations, we’ve been reflecting on how far we’ve come. We realised that we haven’t written a blog post updating everyone on our fun activities since 2021 when the creation of the team was announced. That’s over 2 years ago! "
        },
        {
            "text": "So, here are a few updates on what we’ve been working on since our team was formed, and what’s still to come. "
        },
        {
            "heading": 3,
            "text": "We’ve grown!"
        },
        {
            "text": "In the blog post from 2021 we were a small team of 2. We’re now a team of 7! As well as an Accessibility Lead, we now have two Senior Accessibility Specialists, two mid-level Accessibility Specialists, an Engagement Manager, and a Delivery Manager. "
        },
        {
            "text": "It’s been a big jump - but now we can provide more services and support to teams at MoJ!"
        },
        {
            "heading": 3,
            "text": "Running an Accessibility Consultancy"
        },
        {
            "text": "We’ve been running an accessibility consultancy and it has continued to grow in popularity! We see requests coming in from all agencies within MoJ - to date, we’ve worked with 90+ teams."
        },
        {
            "text": "The consultancy requests are incredibly varied. We’ve looked at websites, procurement contracts, documents like Word and PDF, and comms materials. Our Associate Delivery Manager Emma Moon does a fab job of fielding those requests and scheduling them. "
        },
        {
            "text": "There is a mixture of helping teams with one-off requests, but also embedding specialists into teams on a longer-term basis. A great example of this is the Criminal Justice System Delivery Data Dashboard. This is used by a wide range of people working within the criminal justice system including the police, CPS, and Local Criminal Justice Boards, as well as victims groups and the general public. "
        },
        {
            "text": "This team welcomed two of our specialists, Eu-Hyung Han and Andy Ronksley, who worked alongside them throughout the build process. Charts are notoriously difficult when it comes to accessibility, but as a team, we ensured non-standard form components had a comparable level of accessibility to GOV UK components. "
        },
        {
            "heading": 3,
            "text": "Building up an internal training offering"
        },
        {
            "text": "In the past 6 months, we’ve created an in-house ‘Intro to Accessibility course’. We wanted to deliver something that would be tailored to Digital teams at the MoJ, who are working with various broad but also quite specific user groups. This could be people in prison, those applying for Legal Aid, or looking into Power of Attorney."
        },
        {
            "text": "Katherine Moonan and Martin Glancy have been doing lots of work looking at existing courses and training resources and conducting research into what would be appropriate at the MoJ. The result is a course that is consistently fully booked, and includes a waitlist!"
        },
        {
            "text": "Throughout our consultancy requests, we have frequently observed that people have needed additional support with creating content. This led to us running a content workshop for those staff to attend, which has been fully booked too!"
        },
        {
            "heading": 3,
            "text": "Champs network"
        },
        {
            "text": "The other big area we’ve been working on in regard to building capability has been setting up a Champions Network. We now have an onboarding process, and a growing network consisting of people all across the organisation. We have champions representing many different roles with a huge range of skills that they bring to the wider group. "
        },
        {
            "text": "Charlie Turrell, our Engagement and Champs lead, has done a fabulous job of arranging some amazing guest speakers for us, including:"
        },
        {
            "text": "To run alongside this network we have developed learning journeys to give champions supported learning paths, helping them build their accessibility skills in their own time. We'll be launching this in the next few months!"
        },
        {
            "heading": 3,
            "text": "What’s next?"
        },
        {
            "text": "It’s been a busy time! Alongside the learning journeys, we’re finding new and exciting guest speakers to come and talk to our champions."
        },
        {
            "text": "We will be exploring more training, creating workshops, and other capability-building activities to run with the UX professions here."
        },
        {
            "text": "Continuing to run our consultancy is high on the agenda, working with teams across the MoJ to help make sure we’re delivering an accessible justice system for all. People don’t just choose to use our services - they’re often using them because they have to. "
        },
        {
            "text": "We’ve achieved a lot so far - and look forward to doing lots more. "
        }
    ]
}