{
    "url": "https://forestrycommission.blog.gov.uk/2023/09/28/trees-and-trains/",
    "title": "Trees and Trains",
    "authors": [
        "Neil Strong"
    ],
    "categories": [
        "Tree Planting",
        "Woodland creation"
    ],
    "pub_date": "2023-09-28T12:28:08+01:00",
    "content": [
        {
            "text": "Throughout my 20-or so years with the railway I have always been involved with trees. Either by writing standards and protocols for how we manage them, or how we manage the habitats and biodiversity that they are an intrinsic part of."
        },
        {
            "text": "Often that work has involved dealing with the Forestry Commission for things ranging from felling licence advice through to arranging access for pest control - such as the Asian longhorn beetle."
        },
        {
            "text": "You may not always associate Network Rail with trees. However, we own and manage six million on our property. In addition, over the last three years we have also funded the planting of around 250,000 trees with The Tree Council . With our money they have been able to work with over 150 communities to plant tree and hedgerow habitats that will benefit those communities."
        },
        {
            "text": "This work with The Tree Council is very much about making sure we are growing trees in the right place for the right reason – that place is not always next to an operational railway."
        },
        {
            "text": "Earlier this year, the government legislated a statutory tree and woodland target to increase tree canopy and woodland cover of England to 16.5% by 2050. My knowledge of forestry and the interactions we have with our seven million neighbours brought it home that when these trees were planted, we needed to make sure once they have matured they didn't pose a risk to the railway."
        },
        {
            "text": "Conversations with the Forestry Commission showed that we could make use of data we had available to identify habitats next to the railway. This data could be overlaid with several factors that could be reasons why, or why not, to plant trees in a certain location. These could include peat soils or high-quality agricultural land as places not to plant or conversely closeness to local communities and ancient woodland as reasons to plant."
        },
        {
            "text": "The data covers over three million hectares of land and we have been able to identify 600,000 hectares in England alone where there could be an opportunity to grow trees. The data we have suggests that the land within one kilometre of the railway has actually quite low woodland cover... in the region of 10%."
        },
        {
            "text": "Today, Network Rail and the Forestry Commission are together hosting a conference, ‘Trees and Trains: Growing Green Corridors’. 100 people from across government, environmental organisations, local authorities, water and transport companies to name just a few, will join us."
        },
        {
            "text": "The conference will look at the feasibility work we did with the UK Centre for Ecology and Hydrology. This looked at how best to incentivise landowners and plan for appropriate planting and included the development of a digital woodland suitability mapping tool. The tool draws on layers of geographic information to identify influencers for woodland planting. This removed all land with obvious constraints (priority habitats, Grade 1 and 2 farmland, peaty soils, developed land etc) and then applied positive attractors for woodland ."
        },
        {
            "text": "The conference will then draw upon the expertise and knowledge from across the farming, forestry, arboriculture and railway industries to identify the future potential for growing green corridors across England. With ministerial support and senior leaders from across forestry and railway in attendance, we have the opportunity to take some great strides."
        },
        {
            "text": "The data we have not only informs where we could grow trees but could also be used to establish other habitat types. We can look to see how planting further afield, for example in river catchment areas, could help to protect the railway from extreme weather events. We can build on relationships with our landowning neighbours to support them in opportunities for different methods of using their land in a time of challenging funding changes."
        },
        {
            "text": "We will share at the conference the work we have done to take our ideas from paper, to feasibility studies and onto trials. For the trials we identified a number of partners to form a consortium to get trees in the ground. Colleagues at Atkins introduced us to people working within the River Evenlode catchment which meant we could start to explore trial options - planting trees in a manner eligible for England Woodland Creation Offer funding to benefit the landowner, with the railway getting the benefit through, for example, reduced flooding."
        },
        {
            "text": "By being able to demonstrate what we are trying to do ‘in the field’ we can now start to show other landowners the opportunities. Our trial site is not a large area of woodland planting, but a shelter belt system to protect a couple of fields."
        },
        {
            "text": "Aecom, with whom we are working, have also been able to show the farmer involved in the trial project that there are a couple of corners to the fields that, with a slight tweak to management, could benefit from increased biodiversity payments. The shelter belt examples also help to show prospective landowners that hedges, wood pasture and other agroforestry techniques are also eligible."
        },
        {
            "text": "This work marks a step change in how Network Rail manages its tree assets. The National Nature Network is an opportunity to increase tree cover across the UK while maintaining a safe space for train travel, improving connectivity not only for our customers, but for the communities, both wildlife and human, who live alongside our estate."
        },
        {
            "text": "The model we have developed enables infrastructure operators to work with their neighbours and identify the most suitable location to grow trees. The data we have will also mean that we can consider other habitat types as well. With the Forestry Commission, we have struck upon an opportunity to plant more trees, helping to tackle climate change, and benefiting nature and our railways."
        },
        {
            "text": "We already know that a well planted and maintained hedgerow can be established, fruiting and providing living and breeding habitat for wildlife within five years. We also know where we can put these hedges to create major potential for improving yield and animal welfare… and in fact major potential for improving yield and animal welfare."
        },
        {
            "text": "Over the next 10 years we don’t need to chase numbers, trees, units or otherwise. We need good management plans delivered to the correct specification. That can then deliver safe operations, biodiversity improvements, carbon sequestration, health and well-being and a revitalisation of some land management industries. ."
        }
    ]
}