{
    "url": "https://civilservice.blog.gov.uk/2023/09/28/using-data-to-end-rough-sleeping/",
    "title": "Using data to end rough sleeping",
    "authors": [
        "Charlie OHalloran"
    ],
    "categories": [
        "A Modern Civil Service",
        "A Skilled Civil Service",
        "An Innovative Civil Service",
        "Uncategorized"
    ],
    "pub_date": "2023-09-28T15:40:35+00:00",
    "content": [
        {
            "heading": 3,
            "text": "At DLUHC, Charlie O’Halloran’s team have built a new data framework to give them fresh insights into the complex nature of rough sleeping  "
        },
        {
            "text": "When I joined the Civil Service and Homelessness and Rough Sleeping Directorate in late 2021, I had never worked in data before and wouldn’t label myself as a ‘data person’."
        },
        {
            "text": "I was excited to work on a project with analytical colleagues to change the way local authorities collected and used data on rough sleeping. Our task was to develop a set of metrics that moved beyond headline numbers of people on the streets, and instead showed how people were moving through the whole system. For instance, if we know how many people return to the streets, we can try and understand why. "
        },
        {
            "text": "To make data on the complexity of rough sleeping comparable across the country, we arranged a series of workshops with experts at Centre for Homelessness Impact (CHI) and over 40 ‘early adopter’ areas to create clear metrics.                    "
        },
        {
            "text": "Over many months of testing, we were able to test definitions to ensure the indicators would paint an accurate picture of the state of rough sleeping in England, supporting local areas to tailor their approach to rough sleeping. "
        },
        {
            "text": "Working on this project has demonstrated how data is relevant to roles across policy, analysis, project management (and more!) but importantly, across national and local government. "
        },
        {
            "heading": 4,
            "text": "Collaborative working"
        },
        {
            "text": "It has also demonstrated the value of collaborative working, with analysts’ knowledge in designing data collections and ensuring data quality, policy’s expertise in policy engagement and testing by the third sector and local partners on the ground by local partners enabling the success of the framework."
        },
        {
            "text": "It has been my role to lead the project from a policy perspective; ensuring the project delivers to a tight timescale, engaging seniors and Ministers on the project and working with our key external stakeholders to sustain their engagement in the framework."
        },
        {
            "text": "It is important to remember that the data we are collecting represent the lives of the most vulnerable groups in our society. We also know every journey into rough sleeping is unique both to the individual and the local area. I am really proud to have delivered a framework which will enable local and national government to develop a common framework for what it means to end rough sleeping, whilst also enabling local areas to tailor their plans for ensuring that rough sleeping is rare, brief and non-recurrent. "
        },
        {
            "text": "Although I started off with the assumption that I wasn’t necessarily a data person, since working on this data-led project – I can say that my perception that data was only for data specialists has changed, and that I would call myself a ‘data person’ now!"
        }
    ]
}