{
    "url": "https://educationhub.blog.gov.uk/2023/09/what-are-ghost-children-and-why-is-school-attendance-important/",
    "title": "Why is school attendance important and what support is available?",
    "authors": [
        "mediaofficer"
    ],
    "categories": [
        "Attendance",
        "Schools"
    ],
    "pub_date": "2023-09-28T09:10:46+01:00",
    "content": [
        {
            "text": "School is the best environment for the vast majority of pupils to learn in. Being surrounded by teachers and friends in school helps keep children safe, and supports them to reach their potential. "
        },
        {
            "text": "That’s why we’re committed to tackling the factors causing children to miss school. Here, we tell you what you need to know about school attendance, provide advice about how best to support your child to attend well, and link to resources which you may find helpful if your child is struggling to attend.  "
        },
        {
            "heading": 3,
            "text": "Why is school attendance important? "
        },
        {
            "text": "Being in school is important to your child’s academic achievement, wellbeing, and wider development.  There is evidence to suggest that regular school attendance is a key mechanism to support children and young people's educational, economic and social outcomes. Schools can facilitate positive peer relationships, which is a contributes to better mental health and wellbeing. "
        },
        {
            "text": "Attendance at school is crucial to prepare young people for successful transition to adulthood, and to support their longer term economic and social participation in society. There is also evidence that the students with the highest attendance throughout their time in school gain the best GCSE and A level results. "
        },
        {
            "text": "Our research found that pupils who performed better both at the end of primary and secondary school missed fewer days than those who didn’t perform as well. "
        },
        {
            "text": "For example, data from 2019 shows that 84% of Key Stage 2 pupils who had 100% attendance achieved the expected standard, compared to 40% of pupils who were persistently absent across the key stage. "
        },
        {
            "heading": 3,
            "text": "What does it mean if a child is persistently or severely absent? "
        },
        {
            "text": "Children who are registered at a school but regularly fail to turn up are officially referred to as being ‘persistently’ or ‘severely’ absent. "
        },
        {
            "text": "The school day is split into two sessions – one session counts as a morning or afternoon spent in school. Pupils who have missed more than 10% of school sessions are considered persistently absent, while children who have missed more than 50% of school sessions are referred to as severely absent. "
        },
        {
            "text": "It’s encouraging that the number of absent pupils has fallen since the pandemic, but there is still work to do. That is why we’re introducing measures to improve school attendance. "
        },
        {
            "heading": 3,
            "text": "Is my child too sick to go to school? "
        },
        {
            "text": "It’s usually appropriate for parents and carers to send their children to school with mild respiratory illnesses, including general cold symptoms like a minor cough, runny nose or sore throat. Children should stay at home if they have a high temperature (38C or above). "
        },
        {
            "text": "Schools have received a letter from the Chief Medical Officer which explains how to tell whether a pupil is well enough to be in school. "
        },
        {
            "text": "Further information about whether your child is too ill for school, including information on other illnesses like chickenpox, headlice, and a sore throat, is available on the NHS website here. "
        },
        {
            "heading": 3,
            "text": "My child is anxious about going to school, should I send them in? "
        },
        {
            "text": "Children can sometimes feel a little bit worried about going to school. Mostly, this is a very normal emotion. It is important to recognise that going in to school can help children to feel less worried than letting them stay at home. "
        },
        {
            "text": "If your child is anxious over several weeks, talk to their school about how they can support you. We have put together some useful links and sources of mental health support which you may find helpful. "
        },
        {
            "heading": 3,
            "text": "What else is being done to improve school attendance? "
        },
        {
            "text": "We’re supporting schools to boost attendance through a range of initiatives, set out in our recent attendance strategy and guidance. Here is a short guide which helps parents understand this guidance, how they can work with their school and local authority to support their children to attend school and get the right support. "
        },
        {
            "text": " This includes: "
        },
        {
            "text": "Together, these measures aim to improve attendance, leading to better attainment and mental wellbeing amongst school children. "
        },
        {
            "heading": 3,
            "text": "What are Attendance Hubs? "
        },
        {
            "text": "We’re supporting schools to improve pupil attendance though the expansion of our Attendance Hubs programme. These are networks of schools that share practical ideas and resources with each other to help improve attendance. "
        },
        {
            "text": "This could include making sure that a school’s culture is warm and welcoming, texting parents if pupils are not in school, using data to track patterns and identify pupils at risk of not coming in, and providing tailored support to break down the barriers some pupils face in attending school. "
        },
        {
            "text": "Attendance Hubs are now helping around 800 schools across the country, supporting the attendance of 400,000 children. "
        },
        {
            "heading": 3,
            "text": "What are ‘ghost children’?                                                                           "
        },
        {
            "text": "‘Ghost children’ isn’t an official government term, but the media often uses it to refer to children who are not regularly attending school. "
        },
        {
            "text": "When the media refer to ghost children, they may mean children of school age, who are not registered pupils at a school and not receiving suitable education, such as adequate home-schooling. "
        },
        {
            "text": "The media may also include children who are registered at school but are persistently or severely absent. "
        }
    ]
}