{
    "url": "https://apprenticeships.blog.gov.uk/2023/09/28/what-is-the-ifate-apprentice-panel/",
    "title": "What is the IfATE Apprentice Panel?",
    "authors": [
        "Institute for Apprenticeships"
    ],
    "categories": [
        "Apprentice panel",
        "Apprentices"
    ],
    "pub_date": "2023-09-28T10:18:52+01:00",
    "content": [
        {
            "text": "Here at IfATE, we work with employers to develop, approve, review and revise apprenticeships and technical qualifications."
        },
        {
            "text": "Our work aims to make sure apprenticeships and technical education are of the highest quality. This helps to give every employer and individual the skills they need to succeed."
        },
        {
            "text": "The apprentice panel aims to help apprentices, employers and training providers work better together to improve the quality of apprenticeships."
        },
        {
            "text": "The panel help to inform all areas of IfATE’s work by giving apprentices a voice and sharing their different experiences and views."
        },
        {
            "text": "The apprentice panel outside the House of Lords, at the Simpler Skills System launch in 2023."
        },
        {
            "text": "The panel brings together apprentices from a wide range of backgrounds, representing apprenticeship levels and occupations from the 15 major business sectors (or occupational routes as we call them)."
        },
        {
            "text": "The panel meets every six weeks online and occasionally at face-to-face meetings at exciting venues such as the House of Lords. The panel has supported with projects such as:"
        },
        {
            "text": "Panel members also attend IfATE board meetings to update on panel activity. They offer the board advice and challenge on relevant issues. From time to time, they meet with ministers and other government officials. This helps to make sure that new polices take account of what matters to apprentices."
        },
        {
            "text": "The panel support in other ways such as:"
        },
        {
            "text": "Being a panel member is a fabulous opportunity to develop professional and personal support network and influence the future of technical education."
        },
        {
            "text": "You can find more information about who is on our apprentice panel on our website."
        }
    ]
}