{
    "url": "https://educationhub.blog.gov.uk/2023/09/28/what-are-ghost-children-and-why-is-school-attendance-important/",
    "title": "Why is school attendance important and what support is available?",
    "authors": [
        "mediaofficer"
    ],
    "categories": [
        "Attendance",
        "Schools"
    ],
    "pub_date": "2023-09-28T09:10:46+01:00",
    "content": [
        {
            "text": "School is the best environment for most pupils to learn in. Being surrounded by teachers and friends in school helps keep children safe, and supports them to reach their potential."
        },
        {
            "text": "That’s why we’re committed to tackling the factors causing children to miss school. Here, we tell you what you need to know about school attendance."
        },
        {
            "heading": 3,
            "text": "Why is attendance important in school?"
        },
        {
            "text": "Being in school is important to your child’s achievement, wellbeing, and wider development. Evidence shows that the students with the highest attendance throughout their time in school gain the best GCSE and A level results."
        },
        {
            "text": "Our research found that pupils who performed better both at the end of primary and secondary school missed fewer days than those who didn’t perform as well."
        },
        {
            "text": "For example, data from 2019 shows that 84% of Key Stage 2 pupils who had 100% attendance achieved the expected standard, compared to 40% of pupils who were persistently absent across the key stage.What are 'ghost children'?"
        },
        {
            "text": "‘Ghost children’ isn’t an official government term, but the media often uses it to refer to children who are not regularly attending school."
        },
        {
            "text": "When the media refer to ghost children, they may mean children of school age, who are not registered pupils at a school and not receiving suitable education, such as adequate home-schooling."
        },
        {
            "text": "The media may also include children who are registered at school but are persistently or severely absent."
        },
        {
            "heading": 3,
            "text": "What does it mean if a child is persistently or severely absent?"
        },
        {
            "text": "Children who are registered at a school but regularly fail to turn up are officially referred to as being ‘persistently’ or ‘severely’ absent."
        },
        {
            "text": "The school day is split into two sessions – one session counts as a morning or afternoon spent in school. Pupils who have missed more than 10% of school sessions are considered persistently absent, while children who have missed more than 50% of school sessions are referred to as severely absent."
        },
        {
            "text": "It’s encouraging that the number of absent pupils has fallen since the pandemic, but there is still work to do. That is why we’re introducing measures to improve school attendance."
        },
        {
            "heading": 3,
            "text": "What are Attendance Hubs?"
        },
        {
            "text": "We’re supporting schools to improve pupil attendance though the expansion of our Attendance Hubs programme. These are networks of schools that share practical ideas and resources with each other to help improve attendance."
        },
        {
            "text": "This could include making sure that a school’s culture is warm and welcoming, texting parents if pupils are not in school, using data to track patterns and identify pupils at risk of not coming in, and providing tailored support to break down the barriers some pupils face in attending school."
        },
        {
            "text": "Attendance Hubs are now helping around 800 schools across the country, supporting the attendance of 400,000 children."
        },
        {
            "heading": 3,
            "text": "What else are you doing to improve school attendance?"
        },
        {
            "text": "We’re supporting schools to boost attendance through a range of initiatives, set out in our recent attendance strategy and guidance. This includes:"
        },
        {
            "text": "Together, these measures aim to improve attendance, leading to better attainment and mental wellbeing amongst school children."
        },
        {
            "heading": 3,
            "text": "What are ‘ghost children’?                                                                          "
        },
        {
            "text": "‘Ghost children’ isn’t an official government term, but the media often uses it to refer to children who are not regularly attending school."
        },
        {
            "text": "When the media refer to ghost children, they may mean children of school age, who are not registered pupils at a school and not receiving suitable education, such as adequate home-schooling."
        },
        {
            "text": "The media may also include children who are registered at school but are persistently or severely absent."
        },
        {
            "heading": 3,
            "text": "Is my child too sick to go to school?"
        },
        {
            "text": "It’s usually appropriate for parents and carers to send their children to school with mild respiratory illnesses, including general cold symptoms like a minor cough, runny nose or sore throat."
        },
        {
            "text": "Schools have received a letter from the Chief Medical Officer which explains how to tell whether a pupil is well enough to be in school."
        },
        {
            "text": "Further information about whether your child is too ill for school is available on the NHS website here."
        },
        {
            "heading": 3,
            "text": "What about children who are home-educated?"
        },
        {
            "text": "If you take your child out of school to educate them at home, your local authority will begin making enquiries as to whether that education is suitable."
        },
        {
            "text": "Currently, local authorities are encouraged to keep a record of children in the area who are educated somewhere other than at a school. We plan to make it compulsory for local authorities to do this."
        },
        {
            "text": "While most home education is of good quality, this will help us spot and support children where their education falls short, making sure all children have the opportunity to learn and thrive."
        }
    ]
}