{
    "url": "https://defradigital.blog.gov.uk/2022/03/20/achieving-happiness-is-my-happy-place/",
    "title": "Achieving happiness is my ‘happy place’",
    "authors": [
        "Imogen Moorhouse"
    ],
    "categories": [
        "Defra digital",
        "Defra services",
        "Smarter working"
    ],
    "pub_date": "2022-03-20T10:00:31+00:00",
    "content": [
        {
            "text": "I wake up to a Lumie Bodyclock light in the mornings, which has really helped me feel more awake and ready to start the day, especially during the winter mornings. Before my working day begins, my two non-negotiables are making a cup of tea and making the bed."
        },
        {
            "text": "If I’ve got more time in the mornings, I’ll roll out my yoga mat and put on a ‘Yoga with Adrienne’ YouTube video. Although they can seem like little things, they make a big difference to the start of my day."
        },
        {
            "heading": 2,
            "text": "Creating a work-friendly space"
        },
        {
            "text": "There’s something to be said about a messy room equalling a messy mind and I do my best to keep my working space free from clutter."
        },
        {
            "text": "I keep plants and flowers dotted around the room and I’ve positioned my desk next to a big window to let in natural light and fresh air. In the York office there are a lot of desks that overlook York Cathedral, so if I’m in the office I’ll opt for one of those."
        },
        {
            "heading": 2,
            "text": "Connecting with others\n"
        },
        {
            "text": "I joined Defra during the Covid-19 pandemic and became part of a dispersed team, which meant I had to learn new and different ways to connect with colleagues when I had previously been used to the easy interaction of being in a shared office each day.\n"
        },
        {
            "text": "Our team become aware of the initiative Action for Happiness last month as part of the series of ‘Time to Talk’ articles on our Intranet, and this Blog about the importance of talking by my colleague Kay Finn. This opened a discussion on what we can all do to support our own, and each other’s mental health."
        },
        {
            "text": "The Action for Happiness calendar provides daily actions that everyone can take to be kinder to ourselves and others. One of the suggestions was to “share something you find inspiring, helpful or amusing” and it’s an idea that our team have proposed we do every Monday morning to share a good news story, jokes or positive comments in our MS Teams chat."
        },
        {
            "text": "Making the time to read about Action for Happiness was a helpful reminder of the little gestures we can choose to do, to connect with others. This can be anything from arranging virtual tea breaks, to sending a colleague an encouraging note, and could really brighten someone’s mood and make a difference to their day."
        },
        {
            "heading": 2,
            "text": "Taking a break outside"
        },
        {
            "text": "I’m lucky to live on the edge of the Yorkshire Dales so I have access to the open countryside on my doorstep. Getting outside for a walk can really boost my mood. If it’s my lunch break, I’ll listen to a podcast. ‘How To Fail with Elizabeth Day’ is a great one for inspirational interviews."
        },
        {
            "text": "When the opportunity arises, I’ll sometimes dial into a meeting and listen on the go. I’ve found that in doing this I can engage more in what is being discussed and I’m not distracted by emails and Teams messages."
        },
        {
            "heading": 2,
            "text": "Subscribing to The Happy Newspaper\n"
        },
        {
            "text": "I discovered The Happy Newspaper a few years ago, a great initiative which celebrates happy news from all around the world and gets delivered to your door quarterly."
        },
        {
            "text": "This month I’ve read about Jonathan, the tortoise who became the oldest living land animal at the grand age of 190 who lives on the island of St Helena in the South Atlantic; and about the teen who won the Northeast Covid Acts of Kindness Community Award after he gave out thousands of survival packs in the pandemic to support those suffering with loneliness."
        },
        {
            "heading": 2,
            "text": "Creating a good work-life balance\n"
        },
        {
            "text": "Defra’s flexible working practices allow me to create a good work-life balance, which is something that hasn’t always been easy in previous jobs, when working hours have been rigid and working from home wasn’t an option."
        },
        {
            "text": "I live far away from family and friends, and with the option to work remotely I’ve been able to plan more visits knowing that I don’t have to fit a 10-hour round trip into one weekend, and I can work from an alternative location for that week."
        },
        {
            "text": "At the end of the working day, I also like to attend an exercise class and it’s something I’ve been able to commit to whilst working from home. With Defra’s blended working, if I have an office day planned, I know I can be flexible with my start and finish times so that even with an hour’s commute each way, I can still prioritise and commit to activities outside of work that I enjoy."
        },
        {
            "text": "Find out more about International Day of Happiness."
        }
    ]
}