{
    "url": "https://design102.blog.gov.uk/2024/04/29/10-years-of-design102/",
    "title": "Celebrating 10 years of Design102: A Q&A with Managing Director, Peter Rainey",
    "authors": [
        "Design102 team"
    ],
    "categories": [
        "Creative",
        "Services",
        "Team"
    ],
    "pub_date": "2024-04-29T16:19:34+01:00",
    "content": [
        {
            "heading": 1,
            "text": "Celebrating 10 years of Design102: A Q&A with Managing Director, Peter Rainey"
        },
        {
            "text": "This month marks a decade of creativity, innovation and growth at Design102. To celebrate this landmark birthday, we sat down with Managing Director Peter Rainey to reflect on our journey so far, the milestones we’ve achieved, and the exciting future that lies ahead."
        },
        {
            "heading": 2,
            "text": "How did Design102 come to be 10 years ago?"
        },
        {
            "text": "Back in 2013, when I was working as Head of Corporate Communications at the Ministry of Justice (MOJ), we had a small design team who were increasingly being asked to help out other departments. This was around the same time as the launch of the Government Communication Service (GCS), and in light of their focus on developing centres of excellence, we identified the opportunity for a shared service to meet the growing demand for design services across government. We merged the small in-house design teams at MOJ, Home Office and Cabinet Office, and in 2014 Design102 was created with the aim of bringing excellent design to the public sector."
        },
        {
            "heading": 2,
            "text": "How has Design102 changed over the past 10 years?"
        },
        {
            "text": "Design102 began as a team of just 14 people. Since then, we have grown into an agency of 70 staff, providing services across a range of creative and strategic disciplines including design, artwork, animation, videography and photography, copywriting, web building, strategic planning, and client services. Public sector communications and the needs of our clients are ever-changing, and we’ve always grown to meet those demands."
        },
        {
            "heading": 2,
            "text": "What has been key to Design102’s growth and success?"
        },
        {
            "text": "First, it’s our relentless focus on quality. We know we have to be as good as, if not better than, the alternatives. We set ourselves up to operate like a design agency, and it was our goal to showcase what could be achieved with design inside government. Second, it’s our high level of client service. Being internal to government, we know we have a unique position and perspective to offer. We are able to understand our clients’ problems and the challenges and opportunities to solving them better than anyone else."
        },
        {
            "heading": 2,
            "text": "What have been some of your most memorable projects?"
        },
        {
            "text": "We’ve delivered over 11,000 projects since we started in 2014, so picking just a few is challenging. But there are some that stand out. One of our first big branding projects was for the UK Space Agency’s Principia mission, which saw Tim Peake spend six months at the International Space Station. It was exciting to create a brand for such a high-profile endeavour. Another stand-out campaign we worked on was for the introduction of 5p carrier bags. It was a big challenge to change the behaviours of a nation, but it was incredibly rewarding to see our work so visible in public spaces. Finally, I’d also mention the ongoing work we’ve done to support the GREAT campaign over the past decade, helping them showcase the best of the UK across the world – from legal services and education to food and science."
        },
        {
            "heading": 2,
            "text": "What impact has Design102 had on public sector communications?"
        },
        {
            "text": "Since the very beginning Design102 has aimed to demonstrate the quality of design that can be produced within government. We have always believed that public sector communications matter, and that we should be doing everything we can to make them as good as they can be. This includes harnessing creative talent from within. There are now more departments than ever before employing their own designers, and Design102 will continue to trailblaze to show what government communications can achieve – be it trialling new and exciting technologies or continuing to champion the highest standards of accessibility."
        },
        {
            "heading": 2,
            "text": "What are your hopes and aspirations for the next 10 years?"
        },
        {
            "text": "I want to see Design102 continue to thrive and succeed. I look forward to a next 10 years as exciting and enjoyable as the last."
        },
        {
            "heading": 2,
            "text": "Is there a final message you’d like to share on this special milestone birthday?"
        },
        {
            "text": "Design102 is all about its people. I am incredibly proud of the talent we employ and the work we produce. We wouldn’t be where we are now without our staff, so to them I say thank you. I’d also like to thank our clients. Some have been with us since the very start of our journey, and some are just beginning their partnership with us. To them I’d say, thank you for believing in us. We work in true partnership with our clients, and I hope we continue to do so for many years to come."
        },
        {
            "text": "Design102 is an award-winning creative agency for the public sector. Find out more about our work on the Design102 website or reach out to us at hello@design102.co.uk."
        },
        {
            "text": " "
        }
    ]
}