{
    "url": "https://governmentscienceandengineering.blog.gov.uk/2024/04/29/learning-at-work-week-2024-power-of-lifelong-learning/",
    "title": "Learning at Work Week 2024: Power of lifelong learning",
    "authors": [
        "gseprofession"
    ],
    "categories": [
        "Blog Series",
        "Learning & Development"
    ],
    "pub_date": "2024-04-29T11:47:34+01:00",
    "content": [
        {
            "text": "As we approach Learning at Work Week 2024, it’s a great opportunity to engage in this year's theme of lifelong learning and get involved with webinars and learning opportunities."
        },
        {
            "text": "Webinar learning: A gateway to knowledge"
        },
        {
            "text": "During Learning at Work Week, there are a number of webinars which offer career development opportunities:"
        },
        {
            "text": "Tuesday 14 May - Apolitical: Learning from Failure in the Public Service, 4:00pm- 5:00pm\nJoin this free online event to learn about failing forward and learning from mistakes."
        },
        {
            "text": "Wednesday 15 May - GSE Profession: GSE Awareness Courses Webinar, 1:00pm - 1:45pm"
        },
        {
            "text": "Join the GSE Awareness Courses webinar to find out more about how the recently updated courses enhance your science and engineering capabilities. Learn about our recent updates from government experts and how the courses can support you."
        },
        {
            "text": "Wednesday 15 May - Apolitical: Must-Have Skills for Public Servants in Election Years, 3:00pm - 4:00pm\nHear from panel speakers who will delve into the essential skills that public servants must hone to ensure integrity, efficiency and resilience."
        },
        {
            "text": "Lifelong learning: The key to empowerment"
        },
        {
            "text": "Lifelong learning is the ongoing pursuit of knowledge, driven by personal motivation. It extends beyond formal education, encompassing self-initiated learning throughout our lives."
        },
        {
            "text": "Lifelong learning enables change by acquiring new knowledge, challenging our existing beliefs to adapt to evolving situations, growth through lifelong learning fuelling personal and professional growth. It’s the catalyst for promotions, career shifts, and leadership roles; and achievement of goals whether it’s individual, team, or organisational. Learning propels us all towards success."
        },
        {
            "text": "During this week, there are other opportunities for learning. What new skills will you learn today? Follow these links for continuous development opportunities."
        },
        {
            "text": "Do you want to keep up to date with the GSE Profession’s offers and opportunities? If you are a civil, crown or public servant, register to become a member of the GSE Profession."
        }
    ]
}