{
    "url": "https://environmentagency.blog.gov.uk/2023/12/01/bathing-waters-annual-classifications-2023/",
    "title": "Bathing Waters Annual Classifications 2023",
    "authors": [
        "Environment Agency"
    ],
    "categories": [
        "Water"
    ],
    "pub_date": "2023-12-01T10:47:24+00:00",
    "content": [
        {
            "text": "During this year’s bathing water season, we took more than 7,000 samples at our 424 bathing waters in England, including beaches, two rivers, inland lakes and recently-designated bathing waters."
        },
        {
            "text": "Weekly samples are taken at most sites and then tested at the laboratory for the level of bacteria. The results are then published on our Swimfo website, helping to inform people about when and where they can bathe. The annual bathing water classifications give a long-term assessment of water quality over a ‘rolling’ four-year period. The classifications for 2023 are based on data from 2019, 2021, 2022 and 2023."
        },
        {
            "text": "Why water quality can vary"
        },
        {
            "text": "There are a range of factors which influence bathing water quality and its annual variations with every catchment being different. An unseasonably wet summer as we had this year will have affected this year’s results due to the effects of land run-off, sewage spills from storm overflows and diffuse pollution from agriculture and highway drainage. This temporarily affects water quality but if it is happening frequently across the bathing water season, it will affect the classification. Other factors that influence the results include tides, wind and physical or environmental changes at a site."
        },
        {
            "text": "We issue Pollution Risk Forecasts to give bathers timely information on any daily variations to water quality. These predict average water quality for the day based on an analysis of the effects of the weather and tides where this is possible. We are working on an upgrade to the system to improve and simplify information for bathers."
        },
        {
            "text": "Next steps"
        },
        {
            "text": "Bathing water quality has improved substantially since the early 1990s when just 28 per cent of bathing waters in England met the highest standards in force at that time as compared with 90 per cent this year. 96 per cent this year meet the minimum standards as compared with 46 per cent in 1995 according to current classification standards, which are stricter than those used back then."
        },
        {
            "text": "Regulation and investment over several decades have driven significant improvements to our coastal bathing waters, however there is much more to do."
        },
        {
            "text": "All sectors and organisations that have a role to play in improving the water environment must take collective responsibility and demonstrate that we can work together to deliver the Government’s Plan for Water. The Plan for Water sets out more investment, stronger regulation and tougher enforcement to tackle widespread sources of pollution and clean up our water quality."
        },
        {
            "text": "We work together with local partners to improve water quality at Poor and Sufficient bathing waters, investigating pollution sources and putting local action plans in place to tackle them. If a bathing water is classified as Poor, a sign will be displayed the following year advising against bathing. The classifications for 2023 show that 4 per cent of bathing waters are classified as Poor. We will be progressing action plans over the coming months and following up with further investigations at many of these sites."
        },
        {
            "text": "Targeted action and partnership working can have a significant positive impact on bathing water quality.  Examples of successful partnerships include EA's work with Hastings Council and Southern Water to install screens in a stream that ran out to sea which has improved the water quality."
        },
        {
            "text": "We expect water companies to deliver on the promised £4.6bn investment (2020-2025) to carry out a number of improvements, including protecting and enhancing rivers and beaches, and redoubling their efforts to reduce pollution."
        },
        {
            "text": "We have significantly driven up monitoring and transparency from water companies in recent years, and have taken tough action against those companies which are breaking the rules."
        },
        {
            "text": "Cleaning up England’s waters isn’t just about water companies – it includes agriculture, industry, and urban pollution, too."
        },
        {
            "text": "Since April 2021, we have been increasing regulatory focus on the agriculture sector, undertaking more than 4,000 farm inspections, and requiring more than 5,000 improvement actions on farms – with a focus on high-risk locations, previously non-compliant businesses, and those farming sectors of greatest concern."
        },
        {
            "text": "The slight fall in standards this year show we must go further to drive improvements and that this takes time and investment. That’s why we are strengthening our regulation and working with the water sector, farmers, industry and others to help them put the environment the heart of their activities and improve our bathing waters for all."
        },
        {
            "text": "You can find out about water quality at each bathing water, what affects the water and what’s being done by organisations locally on the Environment Agency’s Swimfo website - https://environment.data.gov.uk/bwq/profiles/"
        },
        {
            "text": " "
        }
    ]
}