{
    "url": "https://charitycommission.blog.gov.uk/2023/12/01/charity-commission-and-electoral-commission-chairs-share-advice-for-charities-engaging-in-public-debate/",
    "title": "Charity Commission and Electoral Commission chairs share advice for charities engaging in public debate",
    "authors": [
        "Orlando Fraser KC",
        "John Pullinger"
    ],
    "categories": [
        "Campaigning"
    ],
    "pub_date": "2023-12-01T10:30:03+00:00",
    "content": [
        {
            "text": "A general election is on the horizon and we understand that many of you, as charity leaders and trustees, will see this as a critical moment to speak up for your beneficiaries and highlight your causes. Charities have a proud record of engaging in public debate and campaigning on behalf of their purposes which is entirely legitimate."
        },
        {
            "text": "Doing so consistently with the legal framework is crucial to public confidence in your political campaigning and to trust in charities more generally. As the chairs of our respective regulators, we want to support charities to understand the law."
        },
        {
            "text": "The law is clear about the right of charities to campaign. The Charity Commission has been active in affirming this right, as well as the important constraints the law places on charities’ political activities."
        },
        {
            "text": "Charities can take part in political activity provided it supports their purpose and is in their best interests. However, political activity must not become the reason for a charity’s existence. Charities must also remain independent and must not give their support to a political party. Guidance for charities on campaigning and political activity is available on the Charity Commission website, as well as a concise ‘5-minute guide’ for those who need a quick refresh. New social media guidance provides additional support, as campaigning and political debate plays out across online platforms."
        },
        {
            "text": "Charities also need to know about the new Non-Party Campaigner Code coming into effect from 1st December."
        },
        {
            "text": "By way of summary, in addition to a charity’s continuing obligations under normal charity law, electoral law requires charities to register as non-party campaigners if they spend over a certain amount on regulated campaign activities in the 12 months leading up to the next election."
        },
        {
            "text": "The first thing you need to know, is which campaign activities are regulated."
        },
        {
            "text": "According to electoral law, spending on certain activities is regulated if the activity can reasonably be regarded as intended to influence people’s voting choice. This activity is called ‘regulated campaign activities’. Thus, such activity, which is lawful under charity law if it is not supporting a specified party or candidate, is regulated under electoral law, counting towards your spending limit."
        },
        {
            "text": "The second thing, is how much you are able to spend on this activity."
        },
        {
            "text": "You will be required to register with the Electoral Commission as non-party campaigners if your charity spends over £10,000 (previously this was over £20,000 in England), on regulated campaign activities, across the United Kingdom. After the election, you may then need to provide financial returns, to support public transparency. If you think you might need to register, the Electoral Commission advises you to register early. Once an election is called, you cannot spend over the threshold until your registration is confirmed."
        },
        {
            "text": "The third thing to highlight is that the law now requires an imprint to be included on digital material that falls within the above definition of regulated campaign activities."
        },
        {
            "text": "An imprint tells voters who is responsible for publishing and promoting campaign material. This means that many types of digital material such as social media adverts and posts will require an imprint. Where a charity is paying for a digital advert it will require an imprint if, for example, it promotes an outcome in an election or it promotes or criticises an elected office-holder."
        },
        {
            "text": "If you are considering doing external advocacy work ahead of the election, we encourage you to find out more. The Electoral Commission has produced a new Code of Practice to support organisations that wish to campaign in the upcoming election period. It carries the same weight as legislation but is more practical and easier to understand than other legislation which can sometimes be quite technical. The Electoral Commission also provides guidance on digital imprints and an enquiry service for campaigners, should you need extra support to operate lawfully when campaigning about the important issues you champion."
        },
        {
            "text": "We understand that these changes can appear daunting. That’s why we want to make sure you feel equipped to enter the next election period, undertaking any campaigning to advance your charity’s purposes, with confidence."
        },
        {
            "text": "We want to stress that electoral law exists not to limit campaigning, but to ensure that there is transparency around key campaigning activity."
        },
        {
            "text": "Finally, everyone who engages in policy discussions around elections plays a part in supporting respectful debate and public confidence, but charities hold a unique position in law, and can and should model a better kind of discourse while championing their important work. If you do choose to engage, we expect you to do so in a manner that is respectful and tolerant and in a tone that reflects your standing as a registered charity."
        },
        {
            "text": "Any queries about the new campaigning rules can be directed to the Electoral Commission at pef@electoralcommission.org.uk."
        },
        {
            "text": " "
        }
    ]
}