{
    "url": "https://defraenvironment.blog.gov.uk/2023/12/01/creating-a-habitat-management-and-monitoring-plan-for-biodiversity-net-gain/",
    "title": "Creating a Habitat Management and Monitoring Plan for Biodiversity Net Gain",
    "authors": [
        "Land Use Policy Team"
    ],
    "categories": [
        "Biodiversity Net Gain",
        "Land Use"
    ],
    "pub_date": "2023-12-01T11:11:53+00:00",
    "content": [
        {
            "text": "Habitat management and monitoring are integral to effective biodiversity net gain (BNG) implementation. This blog may be helpful if you’re a:"
        },
        {
            "text": "A Habitat Management and Monitoring Plan (HMMP) will help you understand the information you may need alongside a BNG proposal. Natural England have developed a handy template, which you can access and find out more about here:"
        },
        {
            "text": "Natural England’s habitat management and monitoring plan templates - Guest Natural England Blog (Mike Burke, Head of Sustainable Development) - Land use: policies and framework"
        },
        {
            "text": "To set the scene, we’ve answered some key questions below."
        },
        {
            "text": "Why is a habitat management and monitoring plan so important for BNG?"
        },
        {
            "text": "Well planned management and monitoring is vital to the successful delivery of habitat on-site and off-site. It enables you to set target conditions for habitat establishment, track progress against these, identify any risks or issues in habitat development, and make adjustments as needed."
        },
        {
            "text": "Providing information on habitat management and monitoring is key to BNG delivery:"
        },
        {
            "text": "A habitat management and monitoring plan provides well-needed structure to how you deliver and manage habitat. Well communicated management and monitoring will reduce ambiguity in the agreement you make with your local authority or responsible body, when securing the off-site or significant on-site gai. The plan will ensure you and your responsible authority are on the same page about what ‘good’ looks like for the planned habitats, target conditions over the 30 year period and how often you’re undertaking monitoring."
        },
        {
            "text": "What do you need to include in your plan?"
        },
        {
            "text": "You can use Natural England’s template to help get you started."
        },
        {
            "text": "If you want to create your own plan, you must include:"
        },
        {
            "text": "For example, if you plan to create 2 hectares of grassland, you will provide information on:"
        },
        {
            "text": "How can you undertake habitat monitoring? "
        },
        {
            "text": "Monitoring may include surveys, regular observations and recording the progress in your habitat management and monitoring plan."
        },
        {
            "text": " "
        },
        {
            "text": " "
        }
    ]
}