{
    "url": "https://defradigital.blog.gov.uk/2023/12/01/dealing-with-my-invisible-illness/",
    "title": "Dealing with my invisible illness",
    "authors": [
        "Gabriella Debens"
    ],
    "categories": [
        "Defra digital"
    ],
    "pub_date": "2023-12-01T07:30:16+00:00",
    "content": [
        {
            "text": "Ahead of the International Day for Persons with Disabilities, Gabriella Debens reflects on how undiagnosed invisible illness can leave a person with anxiety about their work life, and that making even just a few simple workplace adjustments can make a world of difference."
        },
        {
            "text": "I was always quite active as a teenager with both dance and martial arts. It was during one of these classes I started to find problems with my hips. I would get painful flares when I kicked or moved in certain ways."
        },
        {
            "text": "Over the years the pain gradually got worse and, while I spoke to doctors about it, they put it down to growing pains. Unfortunately, I had to stop the sports I once enjoyed. By the time I left for university, my pain had worsened and had begun to affect all my joints. However, it wasn't until I was talking to someone at a house party, and they discussed having a very similar condition, that I began to delve deeper into researching what my condition could be."
        },
        {
            "text": "During university I had a physical job waitressing. After graduation this continued, as I worked in a hospital, and then teaching. Every time I would end up leaving because of the toll the job was having on my body. In the background, I carried on pushing the doctors for some kind of diagnosis."
        },
        {
            "heading": 2,
            "text": "The pain wasn’t going away, and I needed some answers"
        },
        {
            "text": "About three years ago, I started my first job as a civil servant working in a job centre, supporting with universal credit amid the pandemic. At this point I had been experiencing pain for nine years and was still no closer to a diagnosis."
        },
        {
            "text": "When I started in that role, the recruiter asked if I required reasonable adjustments of any kind. When I applied for the role, I had not ticked the guaranteed interview scheme box, and I was shocked by the question. I knew I was struggling, probably more than the average person, but I had no proof, and ticking that box felt like I was cheating."
        },
        {
            "text": "So, when they asked me about support and reasonable adjustments in the workplace, I didn’t know what to say. My new line manager asked me if there was anything I struggled with so they could put support in to help me to do my job. I cried. I didn’t even know that was an option. When I explained I experienced pain and other difficulties I suffered with, but had no way to prove it, my manager told me I didn’t need proof. It was like a weight was lifted."
        },
        {
            "heading": 2,
            "text": "And finally, a diagnosis"
        },
        {
            "text": "Two years ago, I moved to Defra. About a month into the move, I received a diagnosis, ten years after my first symptoms. I have hypermobile Ehlers Danlos Syndrome (hEDS), a connective tissue disorder that not only affects your joints but also internal systems such as your digestive tract too. I had a new occupational health assessment; this time I was finally able to explain my difficulties more coherently."
        },
        {
            "text": "I had come to the session researched, and noted down all my symptoms and what made them better or worse. My line manager in Defra was really pro-active. I received an electric riser desk, a monitor riser, a separate keyboard and special mouse, and a fully adjustable chair. But it wasn’t just physical equipment, we discussed my breaks and sick leave, as well as plans that needed to be put in place as physicians worked to trial me on several medications."
        },
        {
            "text": "After diagnosis I was relieved to finally give my pain a name; it made explaining why I needed adjustments so much easier. But it caused other issues. I struggled with imposter syndrome a lot in the beginning. I felt like I was barely treading water while other colleagues seemed to swim just fine."
        },
        {
            "text": "Tasks seemed to take me longer and I would work late to try and keep up. I avoided taking sick leave because I didn’t know what would be “normal” for someone who wasn’t in pain every day. I didn’t want to take leave for fear I would never catch up with all the work."
        },
        {
            "heading": 2,
            "text": "Meeting others who are in pain has really helped me"
        },
        {
            "text": "I started looking for support because I felt stressed. It was through this that I found the Defra Chronic Pain Network. I delved into their support pack and after looking at their suggestions I requested to become a member. I used the next catch up with my line manager to let them know I was stressed, and they were upset to know that I had been struggling."
        },
        {
            "text": "We had a long chat and looked at other options to put in place to support me at working. This included check ins every couple of days and discussions on how to reprioritise my work. We also moved down my capacity and I finally took some more leave. Ironically, I felt better after I came back from leave and more able to tackle things that would previously make me feel like I was drowning."
        },
        {
            "text": "As I felt better, I started volunteering for the Chronic Pain Network because I wanted to support others who may have been in the same situation as me. I wanted to give, to show them all the options available, and aid them in sensitive conversations with their own managers."
        },
        {
            "text": "Now, over a year on, I have never felt so confident in voicing what my needs are and asking for support in my day-to-day work life. I am much kinder to myself and remind myself regularly that I don’t have to make up for something because of my disability. I have met so many wonderful people in Defra who see me for more than my disability, or just as my work outputs. I have also taken up a more substantive role in the Chronic Pain Network, now leading the Network’s communications activity for our area of the department."
        }
    ]
}