{
    "url": "https://ukhsa.blog.gov.uk/2023/12/01/how-to-improve-air-quality-in-your-home-while-making-it-more-energy-efficient/",
    "title": "How to improve air quality in your home while making it more energy efficient",
    "authors": [
        "Blog Editor"
    ],
    "categories": [
        "Climate",
        "Health in a changing climate"
    ],
    "pub_date": "2023-12-01T17:09:40+01:00",
    "content": [
        {
            "text": "Climate change is a growing threat, and our homes contribute significantly to the problem through energy use and emissions. However, as we make our homes more energy-efficient, we need to ensure they remain healthy environments. On average in the UK, we spend 90% of our time inside buildings. This makes the indoor air quality and temperature of our homes extremely important. As we take steps to make our homes cosier and save energy, we also need to make sure that houses remain well ventilated."
        },
        {
            "heading": 2,
            "text": "5 top tips"
        },
        {
            "text": "Here are 5 easy ways to reduce your climate impact while maintaining a comfortable and safe home. The advice comes from researchers in the Health Protection Research Unit (HPRU) in Environmental Change and Health, an organisation funded by the National Institute for Health and Care Research. If you’d like to read more about the background to this advice, the links will take you to original research from scientists associated with the HPRU."
        },
        {
            "text": "There are more details on all of the above in the HPRU’s Healthy Housing workshop report April 2023."
        },
        {
            "text": "Taking small steps can make a real difference. It’s possible to reduce your climate impact while also creating a healthier home. You’ll find more tips on energy efficiency on the Energy Saving Trust’s website. With some simple changes, we can fight climate change and create a healthier environment at home."
        }
    ]
}