{
    "url": "https://forestrycommission.blog.gov.uk/2023/12/01/national-tree-week-2023/",
    "title": "National Tree Week 2023",
    "authors": [
        "Sir William Worsley"
    ],
    "categories": [
        "Tree health",
        "Tree Planting",
        "Urban trees",
        "Woodland creation",
        "Woodland management"
    ],
    "pub_date": "2023-12-01T19:37:01+00:00",
    "content": [
        {
            "text": "Our nation’s woodlands and trees are the heart of communities around the country. They support our wellbeing, improve quality of life and are home to some our most treasured species – from rare birds and butterflies to the endangered hazel dormouse and the red squirrel."
        },
        {
            "text": "It’s now 50 years since the country came together to Plant a Tree in ‘73 – a nationwide response to the devastation of our native elm trees by Dutch elm disease – a devastating fungal disease which swept through the country in the early 70s. The campaign led to the formation of The Tree Council, and the UK’s first National Tree Week took place two years later, in 1975."
        },
        {
            "text": "Half a century on, the call to fill our urban and rural landscapes with trees and support them to maturity, is just as urgent. Many of the ash trees that have been established in the wake of Dutch elm disease face a different threat today, as damaging ash dieback impacts their health."
        },
        {
            "text": "As a nation, we are now making great progress in increasing our tree cover, with the UK Government and partners spearheading efforts having planted over 4 million trees in the UK last year. However, it is vital that trees inside and outside woodlands are well managed and resilient to fight climate change, support wildlife and withstand the threat of pests and diseases. The UK Government has this week announced £16m in funding to Forest Research to support healthy and resilient woodlands."
        },
        {
            "text": "To maximise the impact trees can have, we need to increase survival rates by making sure the right tree is planted in the right place and for the right reasons. That’s why we are calling on the public to Grow a Tree in 2023 – to pay tribute to the much loved 1973 campaign, with a crucial difference. The use of the word ‘grow’ instead of ‘plant’ reflects the continued care trees need to ensure they thrive."
        },
        {
            "text": "There are a whole host of ways to connect and care for your local trees and woodlands, from joining volunteer groups such as a Tree Warden network, to increasing light levels by selectively thinning trees, to watering and weeding street trees, to tackling invasive, non-native plants and mammal management. This week, the UK Government has announced  improved woodland access, greater protections for street trees and plans for a new National Forest, so more people can enjoy the benefit of our local trees."
        },
        {
            "text": "We can’t do this alone. As a nation together, we must ensure our urban and rural trees and woodlands grow and thrive to enhance biodiversity and capture and store carbon to produce benefits for people and communities. We must also protect our woodlands and trees at a global level.  With attention now on COP28 we must continue to show global leadership on climate and trees, and work with our partners and friends across the world to protect and expand our woodlands, to take action to mitigate against widespread impacts from increasing global temperatures."
        },
        {
            "text": "This National Tree Week, we encourage everyone to celebrate the trees in your life, and if you can, join a nearby tree planting or celebration event and help grow the trees that will deliver so much for the next 50 years."
        }
    ]
}