{
    "url": "https://defralanduse.blog.gov.uk/2023/12/01/natural-englands-habitat-management-and-monitoring-plan-templates-guest-natural-england-blog-mike-burke-head-of-sustainable-development/",
    "title": "Natural England’s habitat management and monitoring plan templates - Guest Natural England Blog (Mike Burke, Head of Sustainable Development)",
    "authors": [
        "Land Use Policy Team"
    ],
    "categories": [
        "BNG",
        "Land Use"
    ],
    "pub_date": "2023-12-01T11:04:32+00:00",
    "content": [
        {
            "text": "Mike Burke, Head of Sustainable Development, Natural England, writes about two new templates developed by Natural England specifically for use with biodiversity net gain (BNG):"
        },
        {
            "text": "Each template is free to use and comes with supporting documents. Their use is not mandatory. The templates are designed to streamline the process for all users and evaluators when providing information needed to secure BNG."
        },
        {
            "text": "Biodiversity gain sites must be maintained for a minimum of 30 years, a step change in management and monitoring expectations. The aim of the Habitat Management and Monitoring Plan Template (HMMPT) is to help standardise the submissions to ensure consistency, improving efficiency for both applicants and decision-makers."
        },
        {
            "text": "A plan for managing and monitoring a BNG site and for subsequently reporting on progress is a technical ecological task. Because of this, we recommend a competent ecologist prepare and complete the templates."
        },
        {
            "text": "The templates can help developers specify work for their ecological contractors efficiently, so that it is fit for purpose and is a standardised approach for users to follow."
        },
        {
            "text": "The HMMPT is designed to work with the Statutory Biodiversity Metric.  It is also compatible with the net gain register requirement to provide habitat management and monitoring information when registering off-site land as a biodiversity gain site."
        },
        {
            "text": "Using the Habitat, Management and Monitoring Plan Template "
        },
        {
            "text": "Use the templates for:"
        },
        {
            "text": "Using the HMMPT is voluntary. The templates can help you understand what management and monitoring information is likely to be required by the reviewing authority. The templates include:"
        },
        {
            "text": "The templates are only a guide, refer to the responsible authority for any specific requirements."
        },
        {
            "text": "Using the BNG Monitoring Report Template  "
        },
        {
            "text": "The Monitoring Report Template (MRT) is designed to complement the requirement under mandatory BNG to submit monitoring reports to the relevant consenting or responsible authority."
        },
        {
            "text": "By making updates to the templates, you can capture the progress made in delivering the habitat outcomes over the period of the BNG agreements. You can highlight progress made and any issues experienced. The monitoring outcomes will help to inform adaptive habitat management and ongoing management activities to ensure that the biodiversity gains can be delivered."
        },
        {
            "text": "You’ll find the MRT has been produced in two parts. There is a Word document to help you evidence progress of monitoring. There is also a separate Excel template to provide the quantitative data. The data in the Excel template can be condensed to contribute to the relevant authority’s biodiversity duty reporting requirements."
        },
        {
            "text": "Shaping the Templates "
        },
        {
            "text": "Natural England worked closely with Defra and commissioned FPCR Environment and Design Ltd to help develop the templates.  A range of stakeholders helped inform the design and tested the templates and guidance, including:"
        },
        {
            "text": "The valuable feedback from everyone informed and shaped the final templates and associated materials. Thank you to everyone who helped!"
        },
        {
            "text": "What’s Next? "
        },
        {
            "text": "We are developing the Small Sites Metric HMMPT and accompanying documentation for release before April 2024. This template allows for a more simplified approach aimed specifically at smaller developments."
        },
        {
            "text": "We will consult stakeholders to inform the template’s development."
        },
        {
            "text": "Let’s continue to maximise the opportunities arising from BNG, to support nature’s recovery and create healthy and sustainable places where people will want to live."
        }
    ]
}