{
    "url": "https://moderncivilservice.blog.gov.uk/2023/12/01/skilled-odp-fest-2023-a-celebration-of-learning/",
    "title": "Skilled: ODP Fest 2023 -  A Celebration of Learning",
    "authors": [
        "Modernisation and Reform Unit"
    ],
    "categories": [
        "A Modern Civil Service",
        "Operational Delivery",
        "Proud Civil Servant",
        "Skilled"
    ],
    "pub_date": "2023-12-01T16:56:12+00:00",
    "content": [
        {
            "text": "The Operational Delivery Profession (ODP) is the largest of the 28 government professions, making up over half of the Civil Service. More than 255,000 members work in operational delivery roles across nearly every department. The profession is the face of public service, and those who don’t have a role in delivering services directly to the public still provide vital support to those that do. "
        },
        {
            "text": "Operational delivery is where government policies, strategies and plans are put into practice and where citizens experience government. Operational Delivery professionals manage our borders and prisons; run our job centres, issue passports, deliver our tax administration system and conduct driving examinations — put simply, they keep our country running."
        },
        {
            "text": "ODP Fest 2023 was a celebration of learning for Operational Delivery, with civil servants in every department taking part in 28 interactive online sessions over three weeks from 10-26 October. This year ODP Fest was built around three themes: personal development, service delivery, and the future of ODP."
        },
        {
            "heading": 2,
            "text": "Learning together, wherever you are"
        },
        {
            "text": "With nearly 5000 delegates registered and over 11,000 total session views, civil servants across every department were inspired, educated, and motivated by ODP Fest. Sessions provided useful information applicable to people’s day-to-day jobs, while giving everyone the opportunity to ask questions and learn how they could develop their skills and progress their career."
        },
        {
            "text": "Participants were able to join online from anywhere in the UK. The most popular sessions included an Introduction to AI and ChatGPT, writing skills, and analysis skills for all civil servants. A number of sessions also focused on improving and refining customer service, such as ‘What Customers Want in 2023’ and delivering effective collaboration."
        },
        {
            "text": "Peter Schofield, Permanent Secretary for DWP and Head of the Government Operational Delivery Profession, opened and closed the event. ODP Fest featured a number of experts and guest speakers including:"
        },
        {
            "text": "This year’s ODP Fest received brilliant feedback, with participants saying how relevant the sessions were to their jobs while being presented in an engaging and interactive way, inspiring them to take the next step in their career development and progression through everything that the Operational Delivery Profession has to offer."
        },
        {
            "heading": 2,
            "text": "How civil servants can get involved in ODP"
        },
        {
            "text": "The Operational Delivery profession has a number of events and initiatives to support civil servants planned throughout 2024, along with a wide range of learning and development opportunities to help them learn new skills and support their  careers. Existing civil servants can find out more and register on the ODP website (registration required). They can also catch up on all of the ODP Fest 2023 session recordings and watch them again. "
        }
    ]
}