{
    "url": "https://greatbritishnuclear.blog.gov.uk/2023/12/01/spreading-the-word-about-great-british-nuclear/",
    "title": "Spreading the word about Great British Nuclear",
    "authors": [
        "Lucky Nwosu"
    ],
    "categories": [
        "Nuclear"
    ],
    "pub_date": "2023-12-01T12:07:10+00:00",
    "content": [
        {
            "text": "As we near the end of a busy few months for Great British Nuclear, the organisation has attended several events. This includes Foresight Nuclear Live, and the Nuclear Institute YGN Annual Seminar."
        },
        {
            "heading": 2,
            "text": "Foresight Nuclear Live"
        },
        {
            "text": "In early November 2023, our Technical Director Brian Robinson presented at Foresight Nuclear Live."
        },
        {
            "text": "Held at London's Coin Street Conference Centre, the conference brought together key thought leaders and experts from across the nuclear technology sector."
        },
        {
            "text": "Having worked for over 30 years in nuclear, Brian spoke about why for the first time in his career he is now confident he could have the opportunity to see Small Modular Reactors (SMRs) on the ground."
        },
        {
            "text": "The topics Brian covered during his presentation included outlining Great British Nuclear and their purpose, the SMR technology selection process, and the next steps for Great British Nuclear."
        },
        {
            "text": "MoltexFlex touched upon how the global landscape of how nuclear is used is changing, as well as the topic of decarbonisation."
        },
        {
            "text": "There was then a question and answer session with the speakers, including Alasdair Harper from the Department for Energy Security and Net Zero (DESNZ), and Brian. They were joined by Andrew Pynn (Senior Advisor, Nuclear Specialist) from the Environment Agency."
        },
        {
            "text": "Throughout the rest of the day, many topics were covered by a range of organisations."
        },
        {
            "text": "Alongside DESNZ and Great British Nuclear, other organisations in attendance included Rolls-Royce SMR, X-energy, UK Atomics, Equilibrion, Astral Systems, Tokamak Energy, Ultra Safe Nuclear Corporation and EDF."
        },
        {
            "text": "Ultra Safe Nuclear Corporation talked about their work globally, including in Canada and Poland. They are one of two successful vendors chosen by DESNZ for Phase B of an Advanced Modular Reactor research, development, and demonstration programme."
        },
        {
            "text": "In the afternoon, Equilibrion gave a presentation on their business."
        },
        {
            "text": "They highlighted the importance of the consultation that the Government is planning, and noted it as an \"important moment for industry to engage with Government\". They encouraged responses to the consultation, including from supply chain businesses and others in the nuclear sector."
        },
        {
            "heading": 2,
            "text": "Nuclear Institute YGN Annual Seminar"
        },
        {
            "text": "Alongside Foresight Nuclear Live, the Nuclear Institute YGN held their Annual Seminar on the same day, at Rotherham's Magna Science Centre. Our Chief Executive, Gwen Parry-Jones, gave a keynote address at the beginning of the seminar."
        },
        {
            "text": "She outlined why the United Kingdom needs to move forward with Small Modular Reactors to bolster energy independence and clean air commitments."
        },
        {
            "text": "Gwen gave a rallying call to all young nuclear professionals:"
        },
        {
            "text": "\"Your futures are incredibly important to me. I hope you will be the people running the nuclear power stations that GBN will deliver for the UK\"."
        },
        {
            "text": "She also said:"
        },
        {
            "text": "\"UK Government has made a huge commitment to allow GBN to take forward our nuclear future and your voices are an important part of that\"."
        },
        {
            "text": "\"As young nuclear professionals you must make your voices heard at COP28, and in the UK Government consultations to ensure you have your say on how we deliver up to 24GW of new nuclear...\""
        },
        {
            "text": "Attendees at the seminar heard from a variety of individuals from across the nuclear industry. Organisations in attendance included the UK Atomic Energy Authority (UKAEA), Nuclear Waste Services, the Nuclear Advanced Manufacturing Research Centre (NAMRC), and Nuclear Restoration Services."
        },
        {
            "text": "As well as these two conferences, in recent months we have also attended:"
        },
        {
            "text": "The events we have attended have been positive opportunities to meet key stakeholders from across the nuclear sector, while raising awareness of our work."
        },
        {
            "heading": 2,
            "text": "What else is coming up for Great British Nuclear?"
        },
        {
            "text": "To find out more about future events and conferences Great British Nuclear will be attending, stay up to date by following us on social media on LinkedIn and Twitter (X)."
        },
        {
            "text": " "
        },
        {
            "text": " "
        }
    ]
}