{
    "url": "https://marinescience.blog.gov.uk/2022/11/24/antimicrobial-resistance-working-internationally-to-support-local-action/",
    "title": "Antimicrobial resistance- working internationally to support local action",
    "authors": [
        "David Verner-Jeffreys"
    ],
    "categories": [
        "Animal Health",
        "Aquaculture"
    ],
    "pub_date": "2022-11-24T16:28:38+00:00",
    "content": [
        {
            "text": "World Antimicrobial Awareness Week (WAAW) takes place this week, 18-24th November 2022, and aims to increase awareness of global antimicrobial resistance (AMR) and to encourage best practices to avoid further emergence and spread of drug-resistant microbes. Cefas, the Animal and Plant Health Agency (APHA) and the Veterinary Medicines Directorate (VMD) jointly hold the UK Food and Agriculture Organisation of the United Nations (FAO) Reference Centre, which exemplifies how the UK's Department for Environment, Food and Rural Affairs (Defra) science agencies work collectively to tackle this major challenge using a true One Health approach."
        },
        {
            "text": "The Reference Centre provides independent technical and scientific advice to safeguard animal and human health from the threat of antimicrobial resistance. Our mission is to provide world leading scientific and policy expertise within the global community to tackle antimicrobial resistance in terrestrial and aquatic animals and their environments. Dr Rod Card, APHA describes the recent activities of the Reference Centre in this blog, to highlight this year's WAAW."
        },
        {
            "text": " "
        },
        {
            "text": "Antimicrobial resistance (AMR) occurs when microorganisms no longer respond to medicines used to treat infection, such as bacteria becoming resistant to antibiotics. It has been estimated that 4·95 million deaths in 2019 were associated with bacterial AMR."
        },
        {
            "text": "AMR continues to be a global challenge requiring action in all countries and across all sectors, including public and veterinary health. Indeed, the importance of this One Health approach in tackling AMR is emphasised in the One Health Joint Action Plan (2022-2026) recently published by the Quadripartite (World Health Organisation (WHO), Food and Agriculture Organization of the United Nations (FAO), World Organisation for Animal Health (WOAH) and United Nations Environment Programme (UNEP)). This plan highlights the need to work together for the health of humans, animals, plants, and the environment."
        },
        {
            "text": "It is in this spirit of working together that the UK’s FAO Reference Centre for AMR has contributed to efforts to tackle the threat of AMR in Qatar and Bangladesh."
        },
        {
            "heading": 3,
            "text": "Workshop in Qatar"
        },
        {
            "text": "A One Health workshop was held in Qatar in March 2022 and focused on the environmental and animal health aspects of AMR. The workshop was hosted by the Ministry of Municipality in collaboration with the AMR Reference Centre and joined by experts from Qatar’s National Antibiotic Committee including representatives from the Ministry of Public Health Strategic Planning & Performance Department and Central Food Laboratories, Hamad Medical Corporation, Ministry of Municipality Animal Resource Department and Agriculture Research Department, Qatar University, and the UK Science & Innovation Network."
        },
        {
            "text": "In the workshop delegates identified approaches and systems to further strengthen Qatar’s One Health approach to tacking AMR through assessment of needs in human, environmental, and animal health. Outputs from the workshop have helped to inform discussions as Qatar prepares its next National Action Plan for AMR."
        },
        {
            "heading": 3,
            "text": "Bangladesh AMR workshop"
        },
        {
            "text": "A team of six visiting experts of UK’s FAO Reference Centre for AMR from APHA and The Centre for Environment, Fisheries and Aquaculture Science (Cefas) alongside colleagues from FAO Emergency Centre for Transboundary Animal Diseases (ECTAD) and WorldFish co-hosted a two-day AMR workshop, in Dhaka on ‘’AMR Surveillance in Veterinary and Aquaculture Settings in Bangladesh”. A total of 40 experts actively participated in the workshop."
        },
        {
            "text": "Delegates included relevant policy representatives from Bangladesh national government, scientists from Bangladesh research institutes and reference laboratories and academia, members of the Fleming Fund Country Grant Bangladesh, Fleming Fund Fellows, and One Health experts from the International Centre for Diarrhoeal Disease Research, Bangladesh."
        },
        {
            "text": "The workshop brought together the relevant stakeholders to share and review recent insights and achievements, identified approaches to strengthen existing surveillance structures and policy frameworks to produce recommendations for future work in this area in support of the Bangladesh AMR National Action Plan and established a framework for future collaboration."
        },
        {
            "text": "We look forward to continued engagement with our colleagues in Qatar and Bangladesh, and the new collaborations and projects commencing as a result of the workshops."
        },
        {
            "text": "The UK FAO Reference Centre for AMR designation is held by APHA, Cefas and the Veterinary Medicines Directorate. It has received funding from Defra, the Fleming Fund, and the Gulf Strategy Fund (Foreign, Commonwealth & Development Office)."
        },
        {
            "text": "The Fleming Fund is a £265 million UK aid investment to tackle antimicrobial resistance in low- and middle-income countries around the world. The programme is managed by the UK Department of Health and Social Care."
        }
    ]
}