{
    "url": "https://socialcare.blog.gov.uk/2022/11/24/carers-rights-day-an-opportunity-to-do-more/",
    "title": "Carers Rights Day: an opportunity to do more",
    "authors": [
        "Emily Holzhausen OBE"
    ],
    "categories": [
        "Care and support",
        "Carers",
        "coronavirus",
        "Events"
    ],
    "pub_date": "2022-11-24T15:52:07+00:00",
    "content": [
        {
            "heading": 2,
            "text": "Identifying unpaid carers early is key"
        },
        {
            "text": "To mark Carers Rights Day, Carers UK has released a new report: Cycles of Caring: transitions in and out of unpaid caring. It’s prompting a rethink of the way we identify carers because of the vast numbers of people assuming this role every day. Although an average of 4 million cease caring every year, many people find themselves becoming carers or returning to caring responsibilities, sometimes at short notice."
        },
        {
            "text": "This presents an opportunity for the care and health sectors and all employers to look at prevention in a positive way by identifying unpaid carers early and making sure they have access to the information and advice that they need."
        },
        {
            "text": "According to the research, a staggering 1.9 million people become unpaid carers every year whilst in paid employment. This means identifying unpaid carers must be firmly on every employer’s agenda."
        },
        {
            "text": "Members of our 250 strong Employers for Carers network, who have good leadership, demonstrate an understanding of the challenges of providing unpaid care to older, disabled or ill relatives."
        },
        {
            "text": "Those employers offering flexible working options and Carer’s Leave find it enhances the wellbeing and retention of staff. Whilst the number of unpaid carers in the workplace is around one in seven, this ratio is far higher in the NHS at one in three staff and there are suggestions this could be similar in social care."
        },
        {
            "heading": 2,
            "text": "Varied needs"
        },
        {
            "text": "Not every carer will need formal support. Many might just need an app like Jointly to help coordinate care, or get medication delivered. They might need a bit of flexibility at work, greater understanding of a condition, or knowledge of community connections they could use for support."
        },
        {
            "text": "Getting the right support early helps improve health outcomes, reduce stress and for some it can prevent current and future financial hardship. Employers tell us that identifying and supporting employees who are unpaid carers improves productivity on the bottom line. Centrica calculated it had saved them £3.1 million by improving absence rates, retaining staff and creating a bigger pool to recruit from."
        },
        {
            "text": "Knowing many people are new to caring means we need to think differently about dynamic data and systematically identifying carers within social care and health. If we take COVID and flu vaccination programmes, for example, we would be seeing a significant new cohort of family members who will be new to caring and potentially eligible."
        },
        {
            "text": "Getting unpaid carers vaccinated has huge public health benefits preventing infection, but also making sure they are well and able to continue caring. That’s why we need to refresh our messages so that people providing unpaid care are ready to receive them in a way that makes them relevant, impactful and useful."
        },
        {
            "heading": 2,
            "text": "We all give or need care at some point"
        },
        {
            "text": "Most people don’t call themselves unpaid carers, but see themselves as parents, partners, sons, daughters or close friends and often need help to recognise their vital role."
        },
        {
            "text": "The majority of us will care at some point during our lifetime and getting the right information, advice and support at the right time is what we all need. Anyone with experience of unpaid caring knows the difference this can make."
        },
        {
            "text": "If you want to make a difference for Carers Rights Day, look at your own employment policies, think about joining Employers for Carers to find out more, look at your communications and how you might help people identify themselves as unpaid carers, signposting or referring to support like Carers UK or local carers’ organisations."
        },
        {
            "text": "Your actions could make that vital link and help family, friends and colleagues providing unpaid care get the help they really need."
        },
        {
            "text": "Further information and advice for anyone providing unpaid care can be found on Carers UK’s website."
        }
    ]
}