{
    "url": "https://educationhub.blog.gov.uk/2022/11/24/how-we-are-ensuring-thousands-of-children-receive-a-healthy-nutritious-breakfast/",
    "title": "How we are ensuring thousands of children receive a healthy, nutritious breakfast",
    "authors": [
        "media officer"
    ],
    "categories": [
        "Free School Meals",
        "School food"
    ],
    "pub_date": "2022-11-24T14:46:25+00:00",
    "content": [
        {
            "text": "Starting the day with a healthy breakfast is important regardless of your age – but for children eating a nutritious meal before school it’s vital."
        },
        {
            "text": "Breakfast Clubs in schools make sure that children who attend them get a healthy breakfast at no cost to the family."
        },
        {
            "text": "Breakfast clubs can improve children’s readiness to learn, increase concentration, and improve wellbeing and behaviour, as our research has shown which looked at the benefits of the scheme in disadvantaged areas."
        },
        {
            "text": "That’s why we developed the National School Breakfast Programme – here’s what you need to know."
        },
        {
            "heading": 3,
            "text": "What is the National School Breakfast Programme? "
        },
        {
            "text": "In partnership with Family Action, the programme sources and delivers breakfast food products to schools in disadvantaged areas."
        },
        {
            "heading": 3,
            "text": "Why is this programme important?  "
        },
        {
            "text": "A healthy breakfast can play an important role in ensuring children from all backgrounds have a healthy start to their day and in turn, enhancing their learning potential."
        },
        {
            "text": "We believe this programme makes a real difference in terms of children's attainment, wellbeing and readiness to learn."
        },
        {
            "heading": 3,
            "text": "How long will this programme last? "
        },
        {
            "text": "Since its launch in 2021, working with Family Action, the programme has recruited schools in disadvantaged areas."
        },
        {
            "text": "Now, thanks to the additional investment of up to £12m, schools can benefit up until July 2024, helping to make sure children continue to receive a healthy breakfast, to set them up for the school day ahead."
        },
        {
            "heading": 3,
            "text": "Which schools are eligible for the programme? "
        },
        {
            "text": "The eligibility criteria for breakfast clubs is based on the Income Deprivation Affecting Children Index (IDACI) scale – a nationally recognised indicator of need - to make sure provision is fairly directed where it is most in need."
        },
        {
            "text": "Schools are eligible for the programme if they have 40% or more pupils in bands A-F of the income deprivation affecting children index (IDACI). This scale measures the proportion of all children aged 0 to 15 living in income deprived families in different local areas across England."
        },
        {
            "text": "This includes state-funded primary, secondary, special schools and alternative provision."
        },
        {
            "heading": 3,
            "text": "What kind of food is given to the children? "
        },
        {
            "text": "Breakfasts can be delivered through one of several models, including a traditional sit-down breakfast club in the school hall or canteen, a healthy 'grab and go' breakfast usually provided in the playground or school entrance, or a classroom breakfast."
        },
        {
            "text": "All breakfast products meet the School Food Standards and schools are able to choose and order the food products and quantities they need for their pupils. Products include various forms of healthy cereals, porridge and nutritious bagels."
        },
        {
            "text": "Schools are encouraged to consider a range of breakfast options from the outset to determine what would work best for their school"
        }
    ]
}