{
    "url": "https://educationhub.blog.gov.uk/2022/11/how-can-you-kick-off-a-career-in-football-world-cup/",
    "title": "How can you kick off a career in football?",
    "authors": [
        "mediaofficer"
    ],
    "categories": [
        "Apprenticeships",
        "School sport"
    ],
    "pub_date": "2022-11-24T09:26:57+00:00",
    "content": [
        {
            "text": "The World Cup kicked off in Qatar this week, with 32 of the world’s premier footballing nations – including England and Wales – taking part in the competition."
        },
        {
            "text": "Football is the world’s most popular sport, but you don’t have to be Chloe Kelly or Harry Kane to pursue a career in the beautiful game, in part thanks to government-backed skills training."
        },
        {
            "text": "Here's how you can kick off a career in football."
        },
        {
            "heading": 3,
            "text": "So, how can I get a job in football?"
        },
        {
            "text": "Many young girls and boys grow up dreaming of playing for a top football club or lifting the World Cup for their country. While most of us don’t quite have the talent to make it as professional players, there are still thousands of jobs in football out there."
        },
        {
            "text": "A great way to get the skills and experience you need to forge a career in the football industry is by pursuing an apprenticeship."
        },
        {
            "heading": 3,
            "text": "What football apprenticeships are on offer?"
        },
        {
            "text": "There are loads of apprenticeship opportunities to choose from that will allow you to work in the industry, but if you want to get paid to play the game you love while building the foundations for a rewarding career you could opt for a Sports Coaching or Sporting Excellence Professional apprenticeship."
        },
        {
            "text": "The latest stats show that over 1,400 apprentices in England started working on the Sporting Excellence Programme in the last year."
        },
        {
            "text": "This was developed with the Premier League and elite professional clubs, so apprentices get the experience they need to work in professional football or other major sports, learning to cope with the demands of elite level sport whilst training, playing and developing."
        },
        {
            "heading": 3,
            "text": "What jobs can you get working in football? "
        },
        {
            "text": "You don’t have to be a player or an elite coach like Pep Guardiola or Sarina Wiegman to work in football, and there is a huge range of skills to get you a job in the sport."
        },
        {
            "text": "The sector has a vast number of roles on offer from supporting players at all levels as a coaches or physical therapy specialists, to office staff who deal with the business side of the game, to the grassroots heroes running local club teams or coaching the future stars of the game in school and children’s sides."
        },
        {
            "text": "As well as playing or coaching, you can also consider working as a referee or a groundskeeper, getting outside, staying active and making the beautiful game tick."
        },
        {
            "heading": 3,
            "text": "What’s it like working as a football apprentice? "
        },
        {
            "text": "Callum Grainger did his apprenticeship in football coaching at a school in his local area."
        },
        {
            "text": "He has since gone on to a full-time job and now works as a Cluster Manager who helps oversee the running of football clubs, PE lessons and after school activities for children across a region of schools and staff."
        },
        {
            "text": "Callum admires the dedication of world-class managers and was able to apply lessons from elite football in his training, enjoying the opportunity to get practical, hands-on experience alongside a qualification."
        },
        {
            "text": "Callum said: "
        },
        {
            "heading": 3,
            "text": "Where can I find out more?"
        },
        {
            "text": "For more info and to search current apprenticeship vacancies visit: Apprenticeships | National Careers Service"
        },
        {
            "text": "For free, expert, impartial advice about career options that are right for you, you can chat to a qualified careers adviser online or by calling the National Careers Service helpline on 0800 100 900 https://nationalcareers.service.gov.uk/."
        }
    ]
}