{
    "url": "https://educationhub.blog.gov.uk/2022/11/24/how-we-are-working-to-close-development-gaps-in-the-early-years/",
    "title": "How we are working to close development gaps in the early years",
    "authors": [
        "mediaofficer"
    ],
    "categories": [
        "early years"
    ],
    "pub_date": "2022-11-24T14:48:03+00:00",
    "content": [
        {
            "text": "The first five years of a child’s life are pivotal in their early learning and development"
        },
        {
            "text": "High-quality early learning along with chatting, playing and reading at home provide the foundation children need to make the most of their abilities and talents as they grow up."
        },
        {
            "text": "But too many children are leaving reception without the early language and literacy skills they need for later success, compounding this disadvantage as they progress through school."
        },
        {
            "text": "Here’s what you need to know."
        },
        {
            "heading": 3,
            "text": "What is the Early Years Foundation Stage framework? "
        },
        {
            "text": "The Early Years Foundation Stage (EYFS) sets the standards that all early year’s providers must meet to ensure that children learn and develop well and are kept healthy and safe."
        },
        {
            "text": "The EYFS is a framework for childminders and nursery staff through to teachers teaching reception classes. There is no requirement for early years providers to baseline or track children's progress throughout the year. The only assessment requirements are the Reception Baseline Assessment at the start of reception year, which forms the school level progress measure and is not a diagnostic tool, and the EYFS Profile at the end of the reception year."
        },
        {
            "text": "Promoting teaching and learning, the Early Years Foundation Stage aims to ensure that every child has a broad range of knowledge and skills, providing them with the right foundation for a good future, and progression, through school and life."
        },
        {
            "heading": 3,
            "text": "What does this mean for my child?"
        },
        {
            "text": "There are two main aims:"
        },
        {
            "text": "As childminders, nurseries and schools recover from lost time in education and care due to the impact of COVID-19, the EYFS reforms continue to serve as an important platform to support COVID recovery, particularly children from disadvantaged backgrounds who will have been disproportionately impacted."
        },
        {
            "heading": 3,
            "text": "Is this compulsory? "
        },
        {
            "text": "Yes. The EYFS is statutory, issued by law, and early years providers (including childminders) must follow it."
        },
        {
            "heading": 3,
            "text": "Where can I find out more?"
        },
        {
            "text": "You can read the EYFS framework here. You can find You can find out more on the Foundation Years website here."
        },
        {
            "heading": 3,
            "text": "What more can I do at home to support my child?"
        },
        {
            "text": "Your child’s education starts at home long before they enter the classroom. And even when they start nursery or school the home is where a significant amount of their learning happens."
        },
        {
            "text": "That’s why it’s really important to build a positive learning environment at home – so parents can bring learning moments into their everyday activities while their child enjoys stimulating and engaging activity."
        },
        {
            "text": "You can read more on how you can help your child’s early language skills here."
        }
    ]
}