{
    "url": "https://defrafarming.blog.gov.uk/2022/11/24/new-entrant-support-scheme-apply-for-the-pilot/",
    "title": "New Entrant Support Scheme: apply for the pilot",
    "authors": [
        "Henry Leveson-Gower"
    ],
    "categories": [
        "Farmers",
        "Things we're doing",
        "Ways to get involved"
    ],
    "pub_date": "2022-11-24T14:16:22+00:00",
    "content": [
        {
            "text": "We want to better support those who want to enter farming and develop land-based businesses."
        },
        {
            "text": "In June, we shared how landowners, estate managers, a range of organisations and recent new entrants were helping us to shape our approach."
        },
        {
            "text": "Through the New Entrant Support Scheme, we want to nurture entrepreneurs to develop their business ideas, foster innovation and promote growth. "
        },
        {
            "heading": 2,
            "text": "Testing the idea of incubation"
        },
        {
            "text": "One idea that we said we were keen to test through a pilot was incubation: providing tactical support to young businesses through the early stages of development. "
        },
        {
            "text": "We put out a call for proposals from organisations to lead these pilot projects."
        },
        {
            "text": "The bids we received over the summer were impressive. We evaluated them all and, after careful consideration, we’ve now appointed pilot leads.  "
        },
        {
            "text": "Now that we have our pilot leads, you can apply to take part in the pilot. "
        },
        {
            "text": "The pilot will provide tactical support to young businesses through the early stages of development, nurturing entrepreneurs to further develop a business idea, encouraging innovation and growth. You'll be supported to pitch for the land and finance you need. "
        },
        {
            "text": "In this post, I’ll share details of the successful pilot leads and more information about the pilot."
        },
        {
            "heading": 2,
            "text": "Eligibility "
        },
        {
            "text": "The pilot is available to: "
        },
        {
            "text": "We want to recruit about 200 pilot participants in total. If you are thinking about starting a land-based business or scaling up your existing business, the pilot might be for you. "
        },
        {
            "text": "The pilot is not just for arable or animal farming businesses. It also includes horticulture, agro-forestry and environmental service businesses, such as providing livestock for arable farms as part of an agroecology system.  "
        },
        {
            "text": "The big challenge is to develop business models that will be successful and resilient in the future. They may well not look like those of the past.  "
        },
        {
            "text": "If you gain a place on the pilot, you will also be able to take part in any of our other farming schemes if you're eligible."
        },
        {
            "heading": 2,
            "text": "How the pilot will work "
        },
        {
            "text": "People will start to be recruited into the pilot in December. The pilot will run until spring 2023. "
        },
        {
            "text": "Pilot activities will take place in the evenings and on weekends, they can be carried out online at a time that works for you. There is no cost to participants."
        },
        {
            "heading": 2,
            "text": "How to apply "
        },
        {
            "text": "You can apply to take part now. To apply, please contact the relevant pilot organisation by following the links below. "
        },
        {
            "text": "The New Entrant Support Scheme will cover the whole of England. At the pilot stage, however, there are some restrictions on locations as you'll see below."
        },
        {
            "text": "The pilot leads have their own deadlines."
        },
        {
            "text": "You might also want to engage with these pilot projects as a potential mentor, demonstrator of innovative business models or as a landowner looking to work with new entrants. "
        },
        {
            "text": "If so, please follow the same links above to register your interest with the pilot leads. "
        },
        {
            "heading": 2,
            "text": "Next steps "
        },
        {
            "text": "These pilot projects are just the start. We will use our findings from them to inform the full New Entrant Support Scheme, which we will continue to develop next year. "
        },
        {
            "text": "Please subscribe to the Future Farming blog to receive updates on the scheme. If you have any questions about our approach, leave a comment below. "
        }
    ]
}