{
    "url": "https://food.blog.gov.uk/2022/11/24/path-safe-improving-the-detection-and-tracking-of-foodborne-disease-and-antimicrobial-resistance/",
    "title": "PATH-SAFE: Improving the detection and tracking of foodborne disease and antimicrobial resistance",
    "authors": [
        "Dr Shona O’Rourke, PATH-SAFE Research Programme Manager"
    ],
    "categories": [
        "Foodborne disease",
        "Science"
    ],
    "pub_date": "2022-11-24T13:54:55+00:00",
    "content": [
        {
            "text": "Cymraeg"
        },
        {
            "text": "During last year's World Antimicrobial Awareness Week we posted a blog introducing the Pathogen Surveillance in Agriculture, Food and the Environment (PATH-SAFE) programme. To mark World Antimicrobial Awareness Week 2022 we are back to share our progress!"
        },
        {
            "text": "Foodborne disease (FBD) is a major public health risk, resulting in millions of individual illnesses and thousands of hospitalisations each year. Most human disease is caused by a handful of pathogens which, in most cases, enter the food chain from farmed animals or the environment."
        },
        {
            "heading": 2,
            "text": "The importance of surveillance"
        },
        {
            "text": "Detecting and identifying pathogens early and accurately tracing FBD outbreaks to their source are critical steps to improving public health and reducing the associated economic costs."
        },
        {
            "text": "As well as this, the agri-food supply chain also poses a risk for the transmission of antimicrobial resistance (AMR) as it is transmitted through food, animals, humans, or water. Even though the UK has made significant progress in reducing its use of antibiotics in humans and animals within the last five years, drug-resistant bloodstream infections in humans have increased by 32% from 2015 to 2019."
        },
        {
            "text": "The rise and spread of AMR is creating a new generation of ‘superbugs’ that cannot be treated with existing medicines. The impacts of leaving AMR unchecked are wide-ranging and costly, particularly in terms of global health, food sustainability and security, environmental wellbeing, and socio-economic development."
        },
        {
            "text": "Recent advances in technology and data management offer the opportunity to create a step change in surveillance, to protect public health."
        },
        {
            "heading": 2,
            "text": "PATH-SAFE programme background"
        },
        {
            "text": "The PATH-SAFE programme, launched in 2021, uses the latest DNA-sequencing technology and environmental sampling to improve the detection and tracking of foodborne disease (FBD) and antimicrobial resistance (AMR). The programme aims to pilot a better national surveillance system for the monitoring and tracking of FBD and AMR in the environment and agri-food system."
        },
        {
            "text": "PATH-SAFE brings together and builds upon existing initiatives across the UK, to understand what the end-user needs to improve how they work in this space and to provide better data to identify the prevalence, source and pathways of FBD and AMR, helping to prevent spread by enhanced targeting of interventions."
        },
        {
            "heading": 2,
            "text": "Workstreams updates"
        },
        {
            "text": "The programme has four key workstreams being delivered by partners across government, industry and academia. Our partnership has grown immensely over the past 12 months and continues to grow as more collaborators come on board. These core and delivery partners are:"
        },
        {
            "text": "Take a look at our workstreams to see the approach we are taking and the exciting updates in the programme. The programme is keen to bring together and build on existing initiatives and to understand what the end-user really needs to improve how they work in this space."
        },
        {
            "heading": 3,
            "text": "Workstream 1: National foodborne disease genomic data platform"
        },
        {
            "text": "In Part A we are working with our partners to create a user-friendly platform for the rapid interrogation and archiving of genomic data."
        },
        {
            "text": "Update: Work on the next phase of discovery involving our partner organisations is underway. The results of this work, combined with those from the first discovery phase, will support the development of an exemplar data system tailored to meet user needs and support rapid decision-making. A consortium approach to the delivery of the data platform will be taken, with consortium partners working on a delivery plan for the system at present. Delivery is set to begin in January 2023."
        },
        {
            "text": "In Part B the aim of the PATH-SAFE Scottish pilot is to use whole genome sequencing (WGS) to understand source attribution, infection threat, and the level of AMR of E. coli."
        },
        {
            "text": "Update: Food sampling and additional abattoir sampling started in August, with sample collection from abattoir animals (cattle, pigs, sheep and poultry) and wild animal hosts (deer and shellfish) in progress. Whole genome sequencing (WGS) of the samples collected is also in progress, as is the curation/preparation of the WGS data collected for analysis. Discussions around access to sequencing data from clinical isolates to allow comparison of E. coli genomes from animal, food and environment with clinical datasets are ongoing."
        },
        {
            "heading": 3,
            "text": "Workstream 2: New surveillance approaches"
        },
        {
            "text": "In Part A we are focusing on FBD in the agri-food environment; appraising current surveillance systems by identifying existing environmental data and sampling infrastructure for the detection of FBD pathogens. We are exploring whether novel analysis technologies (for example WGS of pathogens from wastewater and shellfish) can improve the accuracy, speed and efficiency of outbreak detection and associated risks."
        },
        {
            "text": "Update: Discussions are ongoing with Ribble Rivers Trust and North Devon Biosphere Reserve/N. Devon EA to plan pilot studies and a list of monitoring programmes and data sets to be used for pilot studies compiled. Norovirus qPCR method optimisation progressing (a collaboration between Bangor, Cefas and EA) and is due to be completed in October. Norovirus sequencing method development is ongoing."
        },
        {
            "text": "In Part B we are focusing on antimicrobial resistance (AMR) surveillance in the agri-food environment, and there will be several projects supporting this work."
        },
        {
            "text": "Update: The first project on E. coli and raw meat started in September 2022, with others expected to begin throughout late 2022 and early 2023. Study and sample designs are under development for three of the studies, with further exploration and scoping being undertaken for the remaining three studies."
        },
        {
            "text": "In Part C we will utilise the infrastructure developed for NI SARS-CoV-2 wastewater surveillance programme and undertake building level wastewater monitoring to investigate the prevalence of norovirus, and AMR within the NI care home setting."
        },
        {
            "text": "Update: This project has been approved and work is underway to begin the project activities. Links will be established with other wastewater work being undertaken across the programme."
        },
        {
            "heading": 3,
            "text": "Workstream 3: Portable diagnostics as inspection tools"
        },
        {
            "text": "In Part A we are investigating the technology readiness levels (TRLs) of in-field FBD and AMR diagnostic technologies. This includes horizon scanning, stage of development and end-user needs."
        },
        {
            "text": "Update: The contract was awarded to Fera in September to work in collaboration with the University of Lincoln, and the project has begun. The scope has been defined."
        },
        {
            "text": "In Part B the aim is to repurpose rapid, in-field wastewater diagnostic technology that was developed in response to the SARS-CoV-2 pandemic for the detection of FBD. This workstream will aim to demonstrate its viability, economic value, and versatility in one or more agri-food settings."
        },
        {
            "text": "Update: This project has been approved, procurement is almost complete and work is underway to begin the project activities."
        },
        {
            "heading": 3,
            "text": "Workstream 4: Environment AMR surveillance system pilot"
        },
        {
            "text": "The overall aim of this workstream is to create a scientific and evidence-based understanding of the nature and extent of AMR in the environment and the drivers that influence this. This pilot will deliver an agreed and tested methodology for environmental AMR surveillance. The overall ambition is to establish a UK One Health surveillance system for AMR, focused in this pilot on environmental data, longer-term building in further One Health modules."
        },
        {
            "text": "Update: Sampling across the three river catchment sites continues. The initial results from the phenotypic and chemical analysis have been shared to support the development of the Environmental Exemplar Surveillance (ESS) IT platform. The ‘AMR shellfish’ project (with Cefas) and the ‘Bioaerosol’ project with WSP, Cranfield, and University of Exeter have started. Analysis of river samples for high throughput detection and quantification of Antibiotic Resistance by Resistomap is underway."
        },
        {
            "text": "The 'Disinfectant' project (with University of Exeter, UKCEH and Cardiff Uni) is also underway as is the ‘Bathing Waters’ project work (undertaken by Atkins & UKCEH)."
        },
        {
            "text": "Three projects reviewing and exploring different aspects in relation to minimum selection concentrations for antifungals and antibiotics are also underway."
        },
        {
            "text": "For more information, or to sign up for our newsletter, please visit the PATH-SAFE website or contact the team."
        },
        {
            "heading": 1,
            "text": "PATH-SAFE: Gwella’r broses o ganfod ac olrhain clefydau a gludir gan fwyd ac ymwrthedd gwrthficrobaidd"
        },
        {
            "text": "I nodi diwedd Wythnos Ymwybyddiaeth Gwrthficrobaidd y Byd 2021 fe wnaethom rannu blog yn cyflwyno’r rhaglen Cadw Gwyliadwriaeth ar Bathogenau mewn Amaethyddiaeth, Bwyd a’r Amgylchedd (PATH-SAFE). I nodi Wythnos Ymwybyddiaeth Gwrthficrobaidd y Byd 2022 dyma ddiweddariad ar ein cynnydd!"
        },
        {
            "text": "Mae clefydau a gludir gan fwyd yn risg fawr i iechyd y cyhoedd, gan arwain at filiynau o achosion o salwch a miloedd o bobl yn mynd i’r ysbyty bob blwyddyn.  Mae’r rhan fwyaf o glefydau dynol wedi’u hachosi gan lond llaw o bathogenau, sydd, yn y rhan fwyaf o achosion, yn mynd i mewn i’r gadwyn fwyd trwy anifeiliaid a ffermir neu drwy’r amgylchedd."
        },
        {
            "heading": 2,
            "text": "Pwysigrwydd gwyliadwriaeth"
        },
        {
            "text": "Mae canfod ac adnabod pathogenau yn gynnar ac olrhain achosion o glefydau a gludir gan fwyd yn gywir i’w ffynhonnell yn gamau hanfodol i wella iechyd y cyhoedd a lleihau’r costau economaidd cysylltiedig."
        },
        {
            "text": "Yn ogystal â hyn, mae’r gadwyn gyflenwi bwyd-amaeth hefyd yn peri risg o ran trosglwyddo microbau ag ymwrthedd gwrthficrobaidd (AMR), gan eu bod yn cael eu trosglwyddo trwy fwyd, anifeiliaid, pobl neu ddŵr.  Er bod y DU wedi gwneud cynnydd sylweddol o ran lleihau’r defnydd o wrthfiotigau ar gyfer pobl ac anifeiliaid yn ystod y pum mlynedd diwethaf, mae heintiau llif gwaed sy’n gwrthsefyll cyffuriau mewn pobl wedi cynyddu 32% rhwng 2015 a 2019."
        },
        {
            "text": "Mae cynnydd a lledaeniad AMR yn creu cenhedlaeth newydd o ‘archfygiau’ (superbugs) na ellir eu trin â meddyginiaethau presennol. Mae effeithiau peidio â mynd i’r afael ag AMR yn eang ac yn gostus, yn enwedig o ran iechyd byd-eang, cynaliadwyedd a diogelwch bwyd, lles amgylcheddol, a datblygiad economaidd-gymdeithasol."
        },
        {
            "text": "Mae datblygiadau diweddar mewn technoleg a rheoli data yn cynnig cyfle i newid y modd y cynhelir gwyliadwriaeth i ddiogelu iechyd y cyhoedd."
        },
        {
            "heading": 2,
            "text": "Cefndir y rhaglen"
        },
        {
            "text": "Mae’r rhaglen PATH-SAFE, a lansiwyd yn 2021, yn defnyddio’r dechnoleg dilyniannu DNA ddiweddaraf a samplu amgylcheddol i wella’r gallu i ganfod ac olrhain clefydau a gludir gan fwyd ac ymwrthedd gwrthficrobaidd (AMR).  Nod y rhaglen yw treialu system wyliadwriaeth genedlaethol well ar gyfer monitro ac olrhain clefydau a gludir gan fwyd ac AMR yn yr amgylchedd a’r system fwyd-amaeth."
        },
        {
            "text": "Mae’r rhaglen yn dwyn ynghyd fentrau cyfredol ar draws y DU, ac yn adeiladu arnynt, i ddeall beth sydd ei angen ar ddefnyddwyr terfynol, er mwyn gwella’r ffordd maent yn gweithio yn y maes hwn ac er mwyn darparu data gwell i nodi niferoedd, ffynonellau a llwybrau clefydau a gludir gan fwyd ac AMR, gan helpu i’w atal rhag lledaenu trwy dargedu ymyriadau yn well."
        },
        {
            "heading": 2,
            "text": "Diweddariadau ffrydiau gwaith"
        },
        {
            "text": "Mae gan y rhaglen bedair ffrwd waith allweddol sy’n cael eu darparu gan bartneriaid ar draws y llywodraeth, y diwydiant a’r maes academaidd. Mae ein partneriaethau wedi tyfu’n aruthrol dros y 12 mis diwethaf ac maent yn parhau i dyfu wrth i fwy o gydweithwyr ymuno. Gellir gweld y partneriaid cyflenwi craidd yn y tabl isod."
        },
        {
            "text": "Cymerwch olwg ar ein ffrydiau gwaith isod i weld y dull yr ydym yn ei fabwysiadu a’r diweddariadau cyffrous yn y rhaglen. Mae’r rhaglen yn awyddus i ddod â mentrau cyfredol ynghyd ac adeiladu arnynt, ac i ddeall beth sydd ei angen mewn gwirionedd ar ddefnyddwyr terfynol, er mwyn gwella’r ffordd mae’r mentrau hyn yn gweithio yn y maes hwn."
        },
        {
            "heading": 3,
            "text": "Ffrwd waith 1: Llwyfan data genomig genedlaethol ar gyfer clefydau a gludir gan fwyd"
        },
        {
            "text": "Yn Rhan A rydym yn gweithio gyda’n partneriaid i greu llwyfan hawdd ei defnyddio ar gyfer archwilio ac archifo data genomig yn gyflym."
        },
        {
            "text": "Diweddariad: Mae gwaith ar gam nesaf y darganfyddiad sy’n cynnwys ein sefydliadau partner yn mynd rhagddo. Bydd canlyniadau’r gwaith hwn, ynghyd â chanlyniadau’r cam darganfod cyntaf, yn cefnogi datblygiad system ddata enghreifftiol wedi’i theilwra i ddiwallu anghenion defnyddwyr ac i gefnogi gwneud penderfyniadau’n gyflym. Bydd dull consortiwm o gyflwyno’r llwyfan data yn cael ei ddefnyddio, gyda phartneriaid consortiwm ar hyn o bryd yn gweithio ar gynllun gweithredu ar gyfer y system. Disgwylir i’r gwaith gweithredu ddechrau ym mis Ionawr 2023."
        },
        {
            "text": "Yn Rhan B, nod y peilot PATH-SAFE yn yr Alban yw defnyddio dilyniannu genom cyfan i ddeall priodoliad ffynonellau, bygythiad heintiau, a lefelau AMR E. coli."
        },
        {
            "text": "Diweddariad: Dechreuwyd ar y gwaith o samplu bwyd a samplu lladd-dai ychwanegol ym mis Awst, gyda gwaith casglu samplau o anifeiliaid lladd-dai (gwartheg, moch, defaid a dofednod) a deiliaid anifeiliaid gwyllt (ceirw a physgod cregyn) yn mynd rhagddo. Mae dilyniannu genom cyfan o’r samplau a gasglwyd hefyd yn mynd rhagddo, yn ogystal â churadu/paratoi’r data dilyniannu genom cyfan a gasglwyd i’w ddadansoddi. Mae trafodaethau yn parhau ar fynediad at ddata dilyniannu o unigion clinigol er mwyn gallu cymharu genomau E. coli o anifeiliaid, bwyd a’r amgylchedd â setiau data clinigol."
        },
        {
            "heading": 3,
            "text": "Ffrwd waith 2: Dulliau gwyliadwriaeth newydd"
        },
        {
            "text": "Yn Rhan A rydym yn canolbwyntio ar glefydau a gludir gan fwyd yn y maes bwyd-amaeth; gwerthuso systemau gwyliadwriaeth cyfredol trwy nodi data amgylcheddol presennol a seilwaith samplu ar gyfer canfod pathogenau clefydau a gludir gan fwyd. Rydym yn archwilio a all technolegau dadansoddi newydd (er enghraifft dilyniannu genom cyfan o bathogenau o ddŵr gwastraff a physgod cregyn) wella cywirdeb, cyflymder ac effeithlonrwydd canfod achosion a risgiau cysylltiedig."
        },
        {
            "text": "Diweddariad: Mae trafodaethau’n parhau gyda Ribble Rivers Trust a North Devon Biosphere Reserve/Asiantaeth yr Amgylchedd Gogledd Dyfnaint i  gynnal astudiaethau peilot a chreu rhestr o raglenni monitro a setiau data i’w defnyddio ar gyfer astudiaethau peilot. Mae optimeiddio dull qPCR Norofeirws yn mynd rhagddo (cydweithio rhwng Bangor, Cefas ac Asiantaeth yr Amgylchedd), a disgwylir i’r gwaith gael ei gwblhau ym mis Hydref. Mae dull dilyniannu norofeirws ar y gweill."
        },
        {
            "text": "Yn Rhan B rydym yn canolbwyntio ar wyliadwriaeth ymwrthedd gwrthficrobaidd (AMR) yn y maes bwyd-amaeth, a bydd sawl prosiect yn cefnogi’r gwaith hwn."
        },
        {
            "text": "Diweddariad: Dechreuodd y prosiect cyntaf ar E. coli a chig amrwd ym mis Medi 2022, a disgwylir i brosiectau eraill ddechrau yn ystod diwedd 2022 a dechrau 2023. Mae dyluniadau astudio a samplu wrthi’n cael eu datblygu ar gyfer tair o’r astudiaethau, ac mae gwaith archwilio a chwmpasu pellach ar waith ar gyfer y tair astudiaeth arall."
        },
        {
            "text": "Yn Rhan C byddwn yn defnyddio’r seilwaith a ddatblygwyd ar gyfer rhaglen gwyliadwriaeth dŵr gwastraff SARS-CoV-2 Gogledd Iwerddon ac yn cynnal gwaith monitro dŵr gwastraff lefel adeiladau i ymchwilio i nifer yr achosion o norofeirws ac AMR o fewn lleoliadau cartrefi gofal yng Ngogledd Iwerddon."
        },
        {
            "text": "Diweddariad: Mae’r prosiect hwn wedi’i gymeradwyo ac mae gwaith yn mynd rhagddo i ddechrau gweithgareddau’r prosiect. Bydd cysylltiadau’n cael eu sefydlu gyda gwaith dŵr gwastraff arall yn cael ei gynnal ar draws y rhaglen."
        },
        {
            "heading": 3,
            "text": "Ffrwd waith 3: Diagnosteg gludadwy fel offer arolygu"
        },
        {
            "text": "Yn Rhan A rydym yn ymchwilio i lefelau parodrwydd technoleg ar gyfer technolegau diagnostig clefydau a gludir gan fwyd ac AMR yn y maes. Mae hyn yn cynnwys sganio’r gorwel, cam datblygu ac anghenion defnyddwyr terfynol."
        },
        {
            "text": "Diweddariad: Ym mis Medi, dyfarnwyd cytundeb i Fera weithio ar y cyd â Phrifysgol Lincoln, ac mae’r prosiect wedi dechrau.  Mae’r cwmpas wedi’i ddiffinio."
        },
        {
            "text": "Yn Rhan B, y nod yw ail-ddefnyddio technoleg diagnostig dŵr gwastraff cyflym yn y maes, a ddatblygwyd mewn ymateb i bandemig SARS-CoV-2 ar gyfer canfod clefydau a gludir gan fwyd. Nod y ffrwd waith hon fydd dangos ei hyfywedd, ei gwerth economaidd, a’i hyblygrwydd mewn un neu fwy o leoliadau bwyd-amaeth."
        },
        {
            "text": "Diweddariad: Mae’r prosiect hwn wedi’i gymeradwyo acmae’r broses caffael bron ar ben. Mae gwaith yn mynd rhagddo i ddechrau gweithgareddau’r prosiect."
        },
        {
            "heading": 3,
            "text": "Ffrwd waith 4: Cynllun peilot system gwyliadwriaeth AMR yn yr amgylchedd"
        },
        {
            "text": "Nod cyffredinol y ffrwd waith hon yw creu dealltwriaeth wyddonol sy’n seiliedig ar dystiolaeth o natur a graddau AMR yn yr amgylchedd a’r ysgogwyr sy’n dylanwadu ar hyn. Bydd y cynllun peilot hwn yn darparu methodoleg wedi’i phrofi y cytunwyd arni ar gyfer gwyliadwriaeth AMR amgylcheddol. Yr uchelgais gyffredinol yw sefydlu system wyliadwriaeth Un Iechyd y DU ar gyfer AMR, gan ganolbwyntio ar ddata amgylcheddol yn y cynllun peilot hwn, gan gynnwys modiwlau Un Iechyd pellach yn yr hirdymor."
        },
        {
            "text": "Diweddariad: Mae gwaith samplu ar draws tri dalgylch yr afonydd yn parhau. Rhannwyd canlyniadau cychwynnol y dadansoddiad ffenoteipaidd a chemegol i gefnogi datblygu llwyfan TG Gwyliadwriaeth Enghreifftiol Amgylcheddol (ESS). Mae’r prosiect ‘pysgod cregyn AMR’ (gyda Cefas), y prosiect ‘Bioaerosol’ gyda WSP, Cranfield, a Phrifysgol Caerwysg wedi dechrau. Mae’r gwaith o ddadansoddi samplau afonydd ar gyfer canfod trwybwn uchel a meintioli Ymwrthedd Gwrthficrobaidd trwy Resistomap yn mynd rhagddo. Mae prosiect diheintio (gyda Phrifysgol Caerwysg, UKCEH a Phrifysgol Caerdydd) wrthi’n cael ei gynnal. Mae gwaith prosiect  ‘Bathing Waters’ yn mynd rhagddo (a gynhelir gan Atkins ac UKCEH).  Mae tri phrosiect, sy’n adolygu ac yn archwilio gwahanol agweddau mewn perthynas â chrynodiadau dethol lleiaf ar gyfer gwrthffyngolau (antifungals) a gwrthfiotigau hefyd wrthi’n cael eu cynnal."
        },
        {
            "text": "I gael mwy o wybodaeth, neu i gofrestru ar gyfer ein cylchlythyr, ewch i wefan PATH-SAFE neu cysylltwch â’r tîm."
        }
    ]
}