{
    "url": "https://civilservice.blog.gov.uk/2022/11/24/raising-carer-awareness/",
    "title": "Raising Carer Awareness",
    "authors": [
        "Alex Chisholm, Civil Service Chief Operating Officer and Cabinet Office Permanent Secretary",
        "Rebecca Sudworth, Director of Policy, Food Standards Agency"
    ],
    "categories": [
        "Uncategorized"
    ],
    "pub_date": "2022-11-24T09:43:43+00:00",
    "content": [
        {
            "heading": 3,
            "text": "Alex Chisholm, Civil Service Chief Operating Officer and Permanent Secretary Lead for Carers, and Rebecca Sudworth, Deputy Lead for Carers, emphasise their commitment to building a carer-friendly workforce. "
        },
        {
            "text": "Carers’ Rights Day (24 November 2022) gives us the chance to reflect on and celebrate the special skills, life experience and insight that carers bring to the workplace. "
        },
        {
            "text": "It is important that carers have a voice. We want carers to feel supported in the workplace, know where they can go to for advice and feel we are all actively listening to the issues they face and taking action where necessary. "
        },
        {
            "text": "Implementing the Carers’ Strategy"
        },
        {
            "text": "We are grateful to all the carers in the Civil Service who do an amazing job both at work and in their caring responsibilities at home. This is no easy feat and we remain as committed as ever to ensuring real progress is made against the priorities set out in the Civil Service Carers’ Strategy. "
        },
        {
            "text": "Over the course of the past year, we’ve spent time with your departmental Champions and the leaders of staff networks across the Civil Service, to find out about the issues that are important to you and support departments as they implement the Carers’ Strategy."
        },
        {
            "text": "Becoming Carer Confident"
        },
        {
            "text": "Departments are making good progress in taking forward the actions in the strategy. We are very pleased that 16 organisations are now accredited as Carer Confident including, most recently, the Department for Education and the UK Health Security Agency at Level 2 and the Customer Services section of the Home Office at Level 1."
        },
        {
            "text": "As well as their caring responsibilities, colleagues may also have additional challenges which they face. Cathy and Maarya tell us about their experiences. "
        },
        {
            "heading": 4,
            "text": "Events     "
        },
        {
            "text": "We want to thank all the colleagues who run our carers’ networks, often in combination with their own caring responsibilities. Next week we hope to meet many of you when we attend the Celebrating Carers event organised by the Civil Service Carers’ Network. "
        }
    ]
}