{
    "url": "https://ace.blog.gov.uk/2022/11/24/scaling-the-accelerated-capability-environment-through-renewed-public-private-partnership/",
    "title": "Scaling the Accelerated Capability Environment through renewed public-private partnership ",
    "authors": [
        "Simon Carroll"
    ],
    "categories": [
        "Innovation"
    ],
    "pub_date": "2022-11-24T16:00:57+00:00",
    "content": [
        {
            "text": "The Home Office has appointed Vivace as the Private Sector Partner for the Accelerated Capability Environment, signalling the beginning of a new phase to scale ACE’s successful platform for mission-led innovation and cross-sector collaboration. "
        },
        {
            "text": "Following a very active competition, the contract was awarded to QinetiQ which has operated the Vivace industry and academic community since ACE launched in 2017.  "
        },
        {
            "text": "For its successful bid, QinetiQ partnered with innovation consultancy Plexal in a new relationship that will extend the breadth and diversity of the Vivace community to better bring the very best capabilities to bear on the public sector challenges brought to ACE. "
        },
        {
            "heading": 2,
            "text": "Delivering at pace"
        },
        {
            "text": "The pace at which ACE works has been credited with removing years from mission-critical programme delivery. Since its launch, ACE has worked across diverse public missions including: "
        },
        {
            "text": "–  addressing offender risk in the justice system following terrorist attacks "
        },
        {
            "text": "– health forecasting from wastewater-based epidemiology at the height of the UK’s COVID pandemic response "
        },
        {
            "text": "– helping protect children from sexual exploitation and abuse "
        },
        {
            "text": "– contributing to the disruption of illegal drug transportation and prosecution of criminal gangs exploiting children and vulnerable adults "
        },
        {
            "text": "– enabling cross-sector commitment to verification of children online as an element of the UK’s Online Harms policy "
        },
        {
            "text": "– enhancing joint maritime situational awareness and coordination to combat border risks  "
        },
        {
            "heading": 2,
            "text": "Scaling ACE operations"
        },
        {
            "text": "Leaders from The Home Office and QinetiQ came together yesterday/this week to formally announce the new contract and share plans for scaling operations with the wider ACE team. "
        },
        {
            "text": "ACE’s Senior Responsible Owner Richard Alcock CBE – Director Data, Information and Operations in the Homeland Security Group at the Home Office – said: “I am immensely proud of ACE’s significant achievements. ACE provides a platform that brings together the right expertise and perspectives from across industry and academia to tackle some of the most complex and pressing public sector challenges. This next phase of growth will enable this innovative platform to deliver outcomes more widely across government.” "
        },
        {
            "text": "James Willis, UK Intelligence Sector Chief Executive at QinetiQ, said: “We have been proud to help the Home Office deliver ACE over the past 5 years through Vivace. Its values align closely with ours – rapidly innovating for our customer’s advantage through teams of highly diverse, specialised partners and SMEs. The new contract gives us a real opportunity to build on that success by increasing the partnership with the Home Office and extending beyond homeland and national security to address a broader range of challenges and opportunities for the UK government.” "
        }
    ]
}