{
    "url": "https://deframedia.blog.gov.uk/2022/11/24/storm-overflow-discharges-in-the-media/",
    "title": "Storm overflow discharges in the media",
    "authors": [
        "Defra Press Office"
    ],
    "categories": [
        "Weekly stories"
    ],
    "pub_date": "2022-11-24T15:00:42+00:00",
    "content": [
        {
            "text": "Untreated sewage discharged into our waterways can be devastating to human health, local biodiversity and our environment."
        },
        {
            "text": "There has been coverage today (24 November) in the BBC, Evening Standard, Independent and Financial Times reporting that water companies have released sewage into UK rivers and seas almost 150 times during dry weather over the last 12 months, following analysis in Surfers Against Sewage’s (SAS) latest water quality report. The group also suggest that 95 of these discharges were at bathing water locations classed as “excellent”, and that this links to a correlation between these spills and cases reported to the SAS of people becoming unwell."
        },
        {
            "text": "This government wants clean and safe rivers, lakes and seas, and we have been clear that we will hold water companies to account if they do not comply with our environmental regulations."
        },
        {
            "text": "This can include criminal prosecution by the Environment Agency (EA) for the most serious offences - for which there can be unlimited fines. Since 2015 the EA has brought 56 prosecutions against water and sewerage companies, securing fines of over £141m. This includes a record £90 million fine for Southern Water last year after they pleaded guilty to thousands of illegal discharges of sewage."
        },
        {
            "text": "Our Storm Overflows Discharge Reduction Plan, published in August, will also bring about change, with strict targets on sewage pollution and a requirement for further investment into infrastructure from water companies."
        },
        {
            "text": "The plan frontloads action in particularly important and sensitive areas such as designated bathing waters and high priority ecological sites."
        },
        {
            "text": "If it is possible to go further and faster while balancing the cost to consumers, we will not hesitate to do so and have made this clear to the water industry. The government will review the targets in 2027, so we stay as ambitious as possible whilst balancing the impact on bills."
        },
        {
            "text": "At the beginning of September, we also challenged water company executives to take action on protecting the environment and safeguarding our water supplies. We are working with the water companies to establish where they can do more, as well as identify opportunities to speed up delivery."
        },
        {
            "text": "A Defra spokesperson said:"
        },
        {
            "text": "Please see the latest Environment Agency and Ofwat updates for more information on the industry-wide criminal and civil investigations into potential non-compliance by all the water companies at sewage treatment works."
        },
        {
            "text": "Follow Defra on Twitter, and sign up for email alerts here."
        }
    ]
}