{
    "url": "https://beisdigital.blog.gov.uk/2022/11/24/what-does-the-assistive-technology-team-do-at-beis-digital/",
    "title": "What does the Assistive Technology team do at BEIS Digital?",
    "authors": [
        "Liz Waterworth",
        "Andy Elliott"
    ],
    "categories": [
        "People and skills"
    ],
    "pub_date": "2022-11-24T16:02:52+00:00",
    "content": [
        {
            "text": "The BEIS Assistive Technology team makes sure that digital accessibility is always considered in BEIS. This could be supporting our staff with disabilities, or contributing to digital projects."
        },
        {
            "heading": 2,
            "text": "So first of all, what is digital accessibility?"
        },
        {
            "text": "It simply means that anything we create for members of the public is as accessible as possible, and that people with disabilities can use the laptops, phones and applications that BEIS provides to read emails or check their details in our HR systems."
        },
        {
            "text": "Accessibility is a requirement covered by law. The Equality Act 2010 “imposes a duty to make reasonable adjustments for people with disabilities”."
        },
        {
            "text": "And the Public Sector Bodies Accessibility Regulations 2018 (PSBAR) says that public sector bodies need to proactively make reasonable adjustments to ensure accessibility of services and information."
        },
        {
            "heading": 2,
            "text": "Who are we?"
        },
        {
            "text": "We are a small team of specialists. We draw on many years of experience supporting people and their use of specialist software and hardware products."
        },
        {
            "heading": 2,
            "text": "Making sure our services are accessible"
        },
        {
            "text": "We provide input and give advice to many digital projects."
        },
        {
            "text": "This week we’ve checked out a design company who are going to do some design work and build a public facing web page for BEIS. We gave advice on our requirement to make sure the website is accessible by being WCAG (Web Content Accessibility Guidelines) compliant."
        },
        {
            "text": "We work very closely with colleagues in Digital and especially our Assurance team and Digital Business Partners to make sure that accessibility is covered appropriately on all shapes and sizes of projects – whether internal or public facing."
        },
        {
            "heading": 2,
            "text": "What’s a typical day?"
        },
        {
            "text": "Actually, we don’t have many typical days!"
        },
        {
            "text": "We rarely work on two similar issues or provide the same assistive technology support to users, even if they have the same condition."
        },
        {
            "text": "Each day we respond to requests for assistive technology."
        },
        {
            "text": "We provide software that enables our colleagues to work if they:"
        },
        {
            "text": "We install different types of software, train the user and then support them afterwards."
        },
        {
            "text": "We also provide hardware such as:"
        },
        {
            "text": "These requests may come directly from the user or their line manager, or from our facilities team or following an external assessment, from our Health, Safety and Wellbeing team."
        },
        {
            "text": "We also help resolve issues for these users, for example if a JAWS user (Job Access With Speech, a screen reading software for blind users) can’t read a document or a website we can check what’s happening and give advice to the authors."
        },
        {
            "heading": 2,
            "text": "How we test to make sure we are accessible"
        },
        {
            "text": "We do some light testing using the assistive technology software we have in BEIS and for more complex testing such as public facing websites, we send teams to external companies that can conduct full WCAG audits."
        },
        {
            "text": "This week we’ve been testing pages for our intranet. We check the pages using the software that’s available at BEIS so we are thinking about accessibility from different angles:"
        },
        {
            "text": "Our testing also covers different devices. In one of the recent big projects we gave some of our users a different type of desk phone that looks like a phone but runs Microsoft Teams. We tested different devices thinking about the type and level of impairment of our users, the type of work being done, and the users' work environment."
        },
        {
            "heading": 2,
            "text": "Promoting digital accessibility across BEIS"
        },
        {
            "text": "We also promote digital accessibility in BEIS. We have resources to help people make their content more accessible to everyone."
        },
        {
            "text": "We give information on the in-built accessibility features on our laptops and phones, and the assistive technology that can be provided to staff."
        },
        {
            "text": "In partnership with our Health, Safety and Wellbeing team we also deliver interactive and engaging sessions to all staff that cover digital accessibility and reasonable adjustments. We use quizzes, polls and word clouds - all accessible!"
        },
        {
            "heading": 2,
            "text": "No two days are the same - we support all our users"
        },
        {
            "text": "So, no two days are the same and each person and project has very individual requirements which makes our work interesting, hugely rewarding and we believe, a positive experience for our users."
        },
        {
            "text": "Our team has a large amount of knowledge and experience built up over several years but almost every week we still come across new issues that we haven’t encountered before."
        },
        {
            "text": "Technical knowledge of the software and hardware is essential but the most important prerequisite for the role is empathy with our customers and potential customers."
        },
        {
            "text": "Understanding user needs to help them realise their potential in the workplace requires great people skills, patience and communication."
        },
        {
            "text": "The demand for our services increased greatly over the last few years, especially during the pandemic where we supported additional home working adjustments remotely across the country."
        },
        {
            "text": "Now we’ve moved to hybrid working we try to provide in-person support for those who are in the office while supporting those still working from home."
        },
        {
            "text": "We try to build good working relationships with all our users so that they don't hesitate to come back to us for help and advice if they have any issues, no matter how small. We pride ourselves on our customer service."
        },
        {
            "text": " "
        },
        {
            "text": "You can stay up-to-date with the latest developments by signing up for email alerts or by following us on Twitter."
        }
    ]
}