{
    "url": "https://mhrainspectorate.blog.gov.uk/2025/09/15/decentralised-manufacturing-emerging-considerations/",
    "title": "Decentralised Manufacturing: emerging considerations",
    "authors": [
        "Elspeth Gray",
        "Ian Rees",
        "Martine Powell"
    ],
    "categories": [
        "Clinical Trials",
        "Decentralised Manufacturing",
        "Good manufacturing practice",
        "Innovation",
        "Med Regulations",
        "Point of Care"
    ],
    "pub_date": "2025-09-15T09:00:00+01:00",
    "content": [
        {
            "text": "Decentralised Manufacturing (DM) is the overarching term used in the UK to cover the two elements of the new manufacturing and supply framework: point of care (POC) and modular manufacturing (MM). A cross-agency team of Quality and Clinical Trial assessors, Safety and Surveillance assessors, Inspectors for Good Manufacturing Practice (GMP), Pharmacovigilance (PV) and Good Clinical Practice (GCP) plus scientists from the MHRA Science Campus have worked closely together to support the implementation of the new DM legislation. These teams also come together to help answer a wide range of stakeholder queries which relate to the designation of DM products, applications for or variations to Clinical Trial and Marketing Authorisations, manufacture, licensing requirements and general handling and oversight of medical products."
        },
        {
            "text": "We are at the start of this implementation phase and thought it would be helpful to provide an outline of some of the new requirements and some key thoughts now that this new framework is in operation. We have included this blog on both our MedRegs and MHRA Inspectorate blog pages, to share information widely among followers of both blogs."
        },
        {
            "heading": 2,
            "text": "Background"
        },
        {
            "text": "The legislation for DM is The Human Medicines (Amendment) (Modular Manufacture and Point of Care) Regulations 2025, Statutory Instrument (SI) 2025 No. 87, and it came into force from 23 July 2025. In the period between this SI being signed into law on 23 January 2025 and it coming into force, regulatory guidance documents were developed through an in-person workshop on 12 March 2025 and further comments received after the workshop. These documents, together with other DM information, have been published on the new Decentralised manufacture hub."
        },
        {
            "text": "This new framework is applicable to all dosage forms to enable faster access for patients to lifesaving, personalised treatments whilst maintaining current standards of product quality, safety and efficacy."
        },
        {
            "text": "This framework provides manufacturers with new alternatives in a broadened range of manufacturing and supply options beyond those in the current factory-based model, i.e. centralised manufacturing. The framework is not only for new products. It also provides an option for existing centrally-manufactured products at clinical trial or authorised, which will benefit from DM, to change based on an appropriately supported and justified variation."
        },
        {
            "text": "However not all products and processes will be suitable for DM. This is primarily a ‘scale out’ option contrasting with the current ‘scale up’ model which is typically used for products that have long term stability and are geared for large uniform markets. Centralised manufacture is still the default or baseline manufacturing and supply position. The new legislation introduces new legal tests for the MHRA to assess the justifications submitted for either POC or MM via the designation step described below."
        },
        {
            "text": "Currently DM is only applicable within the United Kingdom (UK) and applicants must have a legal presence in the UK to apply for designation to manufacture DM products here. However, DM frameworks are being introduced in several other territories. For example, the European Union has draft legislation and the USA has the Food and Drug Administration’s FRAME initiative. The MHRA will continue its international engagement to support interoperability of DM frameworks across different territories and to update guidance documents where needed."
        },
        {
            "heading": 2,
            "text": "Three pillars of readiness"
        },
        {
            "text": "The DM framework is built on the readiness on three fundamental elements:"
        },
        {
            "text": "The MHRA will update its guidance documents as DM experience is gained in the UK and in other countries and new regulatory issues emerge."
        },
        {
            "text": "The MHRA has worked with healthcare providers, which in the UK is principally the National Health Service and its Specialist Pharmacy Service; with regulators that are directly involved such as the Human Tissue Authority (HTA); and with those that are not so directly involved but whose role is key to patient access such as the National Institute for Health and Care Excellence (NICE)."
        },
        {
            "text": "Developers will need to engage with the healthcare provider to evaluate the suitability of DM locations. This needs to be covered by technical agreements in line with the principles of GMP Chapter 7 and any commissioner’s requirements."
        },
        {
            "text": "Developers need to ensure that manufacturing and testing procedures are suitable to meet the challenges of deployment in the non-standard and novel situations and locations that will be seen in DM. Some manufacturing processes may never be suitable for DM and others currently may not be suitable for DM. These decisions are based on considerations such as manufacturing complexity, environmental condition requirements and availability of automation. These are expected to change over time as new technical developments come into operation."
        },
        {
            "heading": 2,
            "text": "Designation step and justification of clinical benefit"
        },
        {
            "text": "POC and MM are not mandatory and routine manufacturing via a traditional centralised approach remains the first option. Where centralised manufacture is unsuitable or is restrictive, a justification anchored in clinical benefit must be submitted to the MHRA through the DM designation process. Aspects relating to clinical benefit may be wide-ranging and may incorporate elements of improved clinical outcomes and equity and timeliness of access, such that there are no geographical barriers to accessing innovative medicines in what for some conditions, may be a narrow clinical window of eligibility. In all instances, data or published literature should be presented to support claims around clinical benefit."
        },
        {
            "text": "The role of the MHRA in assessing product quality, safety and efficacy is unchanged and where the benefit is restricted to cost alone, this does not represent a suitable justification for DM; such benefits should be directed to NICE in terms of an improved value proposition."
        },
        {
            "text": "Products that are designated as Point of Care will typically have short shelf life, such that they “can only be manufactured” at or near the place where the product is to be used or administered.  For example, if complex quality oversight and release testing is needed post manufacture and prior to administration, this would not support POC designation, where the product can be held with a typical shelf life to allow this."
        },
        {
            "text": "Modular Manufacture supports decentralised, relocatable manufacture that could otherwise be accomplished in a factory, but which is necessitated by “reasons relating to deployment”; a definition that is intentionally wide-ranging to allow for future innovations. This element of DM is most likely to require careful justification based upon clinical benefit."
        },
        {
            "heading": 2,
            "text": "GMP considerations"
        },
        {
            "text": "The Control Site for any DM product needs to hold an appropriate manufacturing licence.  This must be applied for or varied to include the POC or MM specific dosage form of the medicinal product. The forms for new applications and variations have been updated to include these options.  A Decentralised Manufacturing Master File (DMMF) must be included within any submission, and this should state the approved designation reference."
        },
        {
            "text": "Any addition for DM processes will trigger an inspection. Clear procedures and systems will need to be in place to support the decentralised processes."
        },
        {
            "heading": 2,
            "text": "Summary"
        },
        {
            "text": "The focus of DM products and their oversight remains the same – that of product quality, safety and efficacy, whilst improving access in support of patients within the UK."
        },
        {
            "text": "Full supporting guidance and updates can be accessed on the Decentralised manufacture hub."
        },
        {
            "text": "Now that the legislation has come into effect, we are at the start of this journey, and we will continue to enhance and develop the measures to support DM products. We will monitor ongoing queries and work with all stakeholders to assess them. We will review and publish learnings in future blogs and publications."
        }
    ]
}