{
    "url": "https://marinedevelopments.blog.gov.uk/2025/09/15/solitary-but-sociable-understanding-lone-dolphins-and-why-we-need-to-act-responsibly/",
    "title": "Solitary but sociable: Understanding lone dolphins and why we need to act responsibly",
    "authors": [
        "Dan Cutler, Communications & Engagement Manager"
    ],
    "categories": [
        "marine conservation",
        "Marine Science",
        "Science"
    ],
    "pub_date": "2025-09-15T11:26:27+01:00",
    "content": [
        {
            "text": "Every now and then solitary dolphins appear in coastal waters. The reasons why this happens can vary and are not always clear. What we do know is that they can captivate communities, display playful behaviour and become more interested in human interaction over time."
        },
        {
            "text": "While these encounters may seem magical, they often mask a deeper issue and can have tragic outcome for these vulnerable animals."
        },
        {
            "text": "Solitary vs. solitary sociable dolphins"
        },
        {
            "text": "Marine experts, including those at Marine Connection, confirm that it is not unusual for dolphins to be seen alone but how they interact with people may differ depending on whether they are simply lone dolphins or solitary sociable dolphins:"
        },
        {
            "text": "This behavioural shift is significant. As Liz Sandeman of Marine Connection explains,"
        },
        {
            "text": "“Solitary, sociable dolphins represent a unique behavioural group that requires focused conservation efforts. Once they become accustomed to humans, their risk of injury, stress, and behavioural changes increases dramatically."
        },
        {
            "text": "\"Unfortunately, these ‘friendly’ individuals may become rough in their interactions – biting, butting, tail-slapping and pushing people underwater. The situation is therefore dangerous for people. It may not be the dolphin’s intention to hurt the people that he/she is playing with, but he/she may not understand how much bigger, stronger and more capable than us he/she is in the water."
        },
        {
            "text": "\"It is also important to appreciate that these highly intelligent animals are all individuals, and that different individuals will react to people differently. For example, some may be more dominant in their play than others.”"
        },
        {
            "text": "More information about solitary sociable dolphins can be found here: Solitary, Sociable Cetaceans | Marine Connection and here: Solitary dolphins (Marine Animal Rescue Coalition)."
        },
        {
            "text": "Why human interaction can be harmful"
        },
        {
            "text": "Despite good intentions, human interaction with solitary sociable dolphins can lead to serious consequences:"
        },
        {
            "text": "What you can do to protect solitary dolphins"
        },
        {
            "text": "If you encounter a solitary dolphin in the wild, follow these guidelines to ensure both your safety and theirs:"
        },
        {
            "text": "If approached by a dolphin in the water, Whale Dolphin Conservation would recommend staying calm and leaving the water as calmly and quickly as possible, allowing the dolphin to move away of its own accord."
        },
        {
            "text": "To avoid disturbance and harm to cetaceans and other marine mammals, key take home messages are: Go slow – Stay back – Don’t chase   "
        },
        {
            "text": "Community action and education"
        },
        {
            "text": "Marine organisations around the world are working to raise awareness about solitary sociable dolphins. Educational webinars, community outreach, and conservation campaigns encourage local advocates who help spread awareness and promote safe, respectful wildlife watching."
        },
        {
            "text": "As Jess Churchill-Bissett, Head of Marine Conservation at the Marine Management Organisation, notes:"
        },
        {
            "text": "“Repeated human interaction inevitably disrupts their natural behaviours, increasing stress and potentially altering their temperament. Once habituated to humans, dolphins can lose their natural wariness, a change that can be fatal.”"
        },
        {
            "text": "“By understanding their unique behaviours and giving them space, we can help ensure these remarkable animals remain safe, wild, and free.’’"
        },
        {
            "text": "Lessons from Reggie, the Lyme Bay Dolphin"
        },
        {
            "text": "The arrival of a lone bottlenosed dolphin named Reggie in Lyme Bay in 2025 has captivated the public, sparking widespread excitement in the press, online and on social media. However, his growing habituation to close human contact has already resulted in injury and raised concerns over his increasingly boisterous interactions with swimmers."
        },
        {
            "text": "This highlights the urgent need for responsible behaviour around wild dolphins. MMO, conservation experts and charities have all united to raise awareness for responsible behaviour around marine wildlife and to help ensure his safety and the safety of people. This has been met with encouraging community engagement, with many attending workshops both in person and online to learn about dolphin behaviour and how to safely enjoy their presence without causing harm."
        },
        {
            "text": "We continue to encourage the public to follow, and the media to consider the marine and coastal wildlife code guidance."
        },
        {
            "text": "Marine and coastal wildlife code"
        },
        {
            "text": "The Marine and coastal wildlife code can help you to reduce disturbance to marine wildlife when you visit the coast. Its guidance includes advice that dolphins, whales and porpoises reacting to disturbance might:"
        },
        {
            "text": "The Marine and coastal wildlife code does not replace guidance from local councils or organisations. Instead, you can consider the code alongside guidance from other sources."
        },
        {
            "text": "Report a wildlife crime"
        },
        {
            "text": "Wildlife crimes include intentionally or recklessly harassing, injuring, disturbing, or taking or killing protected species or damaging their habitat. Find out how wildlife legislation in England protects different marine wildlife species."
        },
        {
            "text": "Call 101 to report a wildlife incident involving a solitary sociable dolphin that you have witnessed, quoting “Operation Seabird’ or for all other enquiries."
        },
        {
            "text": "You can also contact your nearest MMO office: Contact your local Marine Management Organisation office - GOV.UK or email conservation@marinemanagement.org.uk"
        },
        {
            "text": "If you suspect a wildlife crime in action, call 999, quoting ‘Operation Seabird’."
        },
        {
            "text": "The police may ask you:"
        },
        {
            "text": "Concerned about a dolphin’s health? Call British Divers Marine Life Rescue (BDMLR)"
        },
        {
            "text": "BDMLR is a charity with over 3000 trained volunteers acting primarily as a frontline response service for marine mammals that may be in need of help, which are reported to their national 24 hour hotline.  They are also actively involved in a wide variety of research, education and conservation projects contributing to the awareness of and solutions to issues such as entanglement and bycatch, climate change, wildlife disturbance and pollution."
        },
        {
            "text": "If you are concerned about an injured or stranded marine mammal you can contact BDMLR on 01825 765546 (24 hours a day)."
        }
    ]
}