{
    "url": "https://companieshouse.blog.gov.uk/2025/09/15/why-identity-verification-is-good-for-business/",
    "title": "Why identity verification is good for business",
    "authors": [
        "Victoria Taylor - Principal Policy Adviser, Identity"
    ],
    "categories": [
        "Changes to UK company law",
        "Companies House transformation",
        "Digital transformation"
    ],
    "pub_date": "2025-09-15T11:15:10+01:00",
    "content": [
        {
            "text": "Setting up a company in the UK is quick, straightforward and affordable. It’s one of the reasons our country remains an attractive place to do business. In return for limited liability — which protects personal assets — companies agree to have their details published on the UK’s open corporate register."
        },
        {
            "text": "The register is a valuable resource. It helps businesses make informed decisions, supports transparency, and plays a key role in the UK economy. Companies House data is estimated to be worth between £1 billion and £3 billion a year to users."
        },
        {
            "text": "As part of our transformation, we’re introducing identity verification to help make the information on the register more reliable. This is good news for business, users of the register and efforts to tackle economic crime."
        },
        {
            "heading": 2,
            "text": "What’s changing and when"
        },
        {
            "text": "From 18 November 2025, directors and people with significant control (PSCs) will be legally required to verify their identity. We’ll be phasing this in over 12 months and will contact companies with guidance on what to do and when."
        },
        {
            "text": "Identity verification will help make sure that the people setting up, running and controlling companies are who they say they are. This will:"
        },
        {
            "text": "By linking verified individuals to their company roles and activity, we’ll be better able to spot suspicious patterns and respond to potential risks. It will also prevent unverified or false identities - such as fictional or deceased individuals - from being added to the register."
        },
        {
            "text": "The introduction of identity verification will make it much harder to use the register to create anonymous corporate structures that enable fraud, corruption or other criminal activity."
        },
        {
            "text": "This is an important step in making the register a more trusted and transparent source of information. It will support a fairer and safer business environment for everyone."
        },
        {
            "heading": 2,
            "text": "Building business confidence and credibility"
        },
        {
            "text": "Being listed on the Companies House register is not just about limited liability. It also helps businesses build credibility, win contracts and show they're serious about what they do. Identity verification will play a key role in:"
        },
        {
            "text": "Journalists, trading standards and law enforcement often advise consumers to check whether a trader is listed on Companies House. Identity verification will help make sure that this listing reflects genuine and trustworthy information."
        },
        {
            "text": "A verified presence on the register can demonstrate legitimacy and professionalism. This enhanced credibility could help open doors to new opportunities - from securing better supplier relationships to accessing finance."
        },
        {
            "text": "Companies House data also helps businesses to:"
        },
        {
            "text": "The new measures will work together to make the register more accurate. They include:"
        },
        {
            "text": "This will enable better decisions by those who rely on Companies House data.Identity verification is another step forward in helping UK businesses thrive by making Companies House data more robust, reliable and valuable."
        },
        {
            "heading": 2,
            "text": "How to verify your identity"
        },
        {
            "text": "Identity verification is designed to be straightforward and for most people, you will only have to verify once. There are 2 ways to verify your identity:"
        },
        {
            "text": "We encourage you to verify your identity as early as possible. Since April 2025, hundreds of thousands of directors and PSCs have already verified their identities during the voluntary period."
        },
        {
            "text": "Read more about verifying your identity for Companies House."
        }
    ]
}