{
    "url": "https://educationhub.blog.gov.uk/2024/08/fines-for-parents-for-taking-children-out-of-school-what-you-need-to-know/",
    "title": "Fines for parents for taking children out of school: What you need to know",
    "authors": [
        "mediaofficer"
    ],
    "categories": [
        "Attendance",
        "Schools"
    ],
    "pub_date": "2024-08-19T13:50:45+01:00",
    "content": [
        {
            "text": "Every moment in school counts and days missed add up quickly. Evidence shows that pupils who have good attendance enjoy better wellbeing and school performance than those who don't. "
        },
        {
            "text": "The school day is split into two sessions – one session counts as a morning or afternoon spent in school. There are only a few occasions where a child is allowed to miss school, such as illness or where the school has given permission because of an exceptional circumstance. "
        },
        {
            "text": "However, if your child misses school without a good reason, local councils and schools can intervene and you may be issued a fine. "
        },
        {
            "text": "We’ve also introduced a national framework which will mean all councils have the same rules in place for when they need to consider a fine. We explain more on this below. "
        },
        {
            "text": "It’s important to note that children with long-term medical or more serious mental health conditions, and those with special educational needs and disabilities may face additional barriers. "
        },
        {
            "text": "For children who face complex barriers to attendance, schools should have sensitive conversations with children and families and work with them to put support in place for their individual needs. "
        },
        {
            "heading": 3,
            "text": "How much could I be fined if my child misses school?   "
        },
        {
            "text": "In the majority of cases, schools and local authorities will try and provide support to help you improve your child’s attendance first, but if this isn’t effective or the absence is for unauthorised term time holiday, parents may face paying a fine. "
        },
        {
            "text": "It’s the responsibility of the local authority to decide when to issue fines to parents, meaning the process varies from council to council. "
        },
        {
            "text": "However, under the national rules, all schools are required to consider a fine when a child has missed 10 or more sessions (5 days) for unauthorised reasons. "
        },
        {
            "text": "From August 2024, the fine for school absences across the country will be £80 if paid within 21 days, or £160 if paid within 28 days. This rate is in line with inflation and is the first increase since 2012. "
        },
        {
            "text": "In the case of repeated fines, if a parent receives a second fine for the same child within any three-year period, this will be charged at the higher rate of £160. "
        },
        {
            "text": "Fines per parent will be capped to two fines within any three-year period. Once this limit has been reached, other action like a parenting order or prosecution will be considered. "
        },
        {
            "text": "If you’re prosecuted and attend court because your child hasn’t been attending school, you could get a fine of up to £2,500. "
        },
        {
            "text": "Money raised via fines is only used by the local authority to cover the costs of administering the system, and to fund attendance support. Any extra money is returned to the government. "
        },
        {
            "heading": 3,
            "text": "How can you be sure parent fines are fair? "
        },
        {
            "text": "Fines are a last resort, and parents will be offered support to help improve their child’s attendance first. The vast majority of fines for unauthorised absence (89%) are issued for term time holidays. "
        },
        {
            "text": "If your child is facing barriers to school attendance due to special education needs or disabilities (SEND), schools, local authorities and wider services are required to work together to provide the right support in the first place. "
        },
        {
            "heading": 3,
            "text": "What if my child needs to miss school?  "
        },
        {
            "text": "Your child must attend every day that the school is open, unless: "
        },
        {
            "heading": 3,
            "text": "What happens if my child misses school without a good reason?  "
        },
        {
            "text": "If your child is absent and you haven’t received advance permission from the headteacher to take your child out of school, the school and local council may take action. "
        },
        {
            "text": "Before that, your child’s school and your local council are expected to support you to improve the child’s attendance before any measures are put in place. "
        },
        {
            "text": "These measures can include: "
        },
        {
            "heading": 3,
            "text": "Why is attendance important?  "
        },
        {
            "text": "For most pupils, the best place to be during term-time is in school, surrounded by the support of their friends and teachers. "
        },
        {
            "text": "This is important not just for your child’s learning, but also for their overall wellbeing, wider development and their mental health.  It’s not just children who fail to attend school who miss out, but  those around them too.   "
        },
        {
            "text": "We’re working with schools and local councils to improve attendance by supporting  them to reset the relationship between schools, families and the government to ensure children have the best start to life.  "
        },
        {
            "text": "You can read more about what we’re doing to help schools improve attendance on the Education Hub. "
        }
    ]
}