{
    "url": "https://defrafarming.blog.gov.uk/2024/08/19/first-endorsed-sfi-action-now-available/",
    "title": "First endorsed SFI action now available",
    "authors": [
        "The Team"
    ],
    "categories": [
        "Sustainable Farming Incentive"
    ],
    "pub_date": "2024-08-19T10:12:44+01:00",
    "content": [
        {
            "text": "We promised we’d let you know when the first endorsed action offered through the Sustainable Farming Incentive (SFI) became available.  "
        },
        {
            "text": "We’re pleased to share that GRH6: Manage priority habitat species-rich grassland is now on GOV.UK and available to include in your application through the Rural Payments service. "
        },
        {
            "text": "In this post, we’ll give a brief recap on endorsed actions and summarise GRH6. "
        },
        {
            "text": "We will also include links for you to learn more about SFI."
        },
        {
            "heading": 2,
            "text": "Endorsed Actions "
        },
        {
            "text": "Some SFI actions target certain priority habitats or species and heritage features. These actions need to be approved and are known as endorsed actions."
        },
        {
            "text": "Once you submit an application that includes an endorsed action, the Rural Payments Agency (RPA) will inform Natural England or Historic England, who will then contact you to confirm that your land is suitable for the action to be included in your agreement."
        },
        {
            "text": "The first available endorsed action under SFI is GRH6."
        },
        {
            "text": "In the case of GRH6, the endorsement will be carried out by Natural England. An adviser may visit your land to provide this endorsement."
        },
        {
            "text": "They will check that the area you want to carry out GRH6 on is either already priority habitat species-rich grassland or that it has potential for the restoration or creation of priority habitat species-rich grassland. "
        },
        {
            "text": "In addition, if the land on which you intend to place GRH6 is a Site of Special Scientific Interest (SSSI), then you will also need to request consent to undertake this action from Natural England. "
        },
        {
            "text": "Endorsement from Natural England is intended to give farmers and land managers  the guidance and support needed to confidently manage existing priority habitats and create these valuable habitats in the most effective and suitable locations."
        },
        {
            "heading": 2,
            "text": "Why GRH6 is an endorsed action "
        },
        {
            "text": "Species-rich grassland is not just an important part of the character of our landscape. It is home to a large variety of wildflowers, supporting many threatened plants, invertebrates, and birds."
        },
        {
            "text": "It keeps soil healthy, carbon-rich and plays an important part in preventing soil erosion. It offers forage for livestock and forms a part of our cultural heritage, facilitating traditions and maintaining skills including haymaking. "
        },
        {
            "text": "For these reasons, species-rich grassland typically requires different management than other grassland actions you can find in SFI. For example, cutting and/or grazing later in the summer to allow flowering grasses and wildflowers to go to seed and managing areas of scrub and trees."
        },
        {
            "text": "The aim of GRH6 is to: "
        },
        {
            "text": "The duration of GRH6 is 5 years. It’s up to you how you do this action, as long as you follow this action’s requirements and carry out the action in a way that could reasonably be expected to achieve this action’s aim. We’ve included voluntary advice to help, but it’s not a requirement that you follow it.  "
        },
        {
            "text": "That said, GRH6 is a static action – this means you must carry out the action on the same location every year for the duration of the action. "
        },
        {
            "text": "For completing this action, you will be paid £646 per hectare (ha) per year. "
        },
        {
            "text": "GRH6 sets out the process of endorsement. It also includes: "
        },
        {
            "heading": 2,
            "text": "Apply for SFI "
        },
        {
            "text": "There are now a total of 102 actions available through SFI which reward and support sustainable food production while protecting and enhancing nature."
        },
        {
            "text": " You can look through them on the ‘Find funding for land or farms’ page on GOV.UK. There’s also a PDF version which includes all 102 SFI actions. "
        },
        {
            "text": "We’re rolling out the scheme gradually. You can begin your SFI journey by completing an expression of interest, after which the RPA will invite you to apply for an agreement.  "
        },
        {
            "text": "The post we published last week provides an overview of the scheme's progress. It includes a link to the updated SFI terms and conditions and more information on supplemental SFI actions.  "
        }
    ]
}