{
    "url": "https://actuaries.blog.gov.uk/2024/08/19/gads-work-with-the-international-social-security-association/",
    "title": "GAD’s work with the International Social Security Association",
    "authors": [
        "Chris Morley - Senior Consulting Actuary"
    ],
    "categories": [
        "Actuary",
        "Social Security"
    ],
    "pub_date": "2024-08-19T15:14:06+01:00",
    "content": [
        {
            "text": "One of the most exciting parts of my role at the Government Actuary’s Department (GAD) is to bring the voice of the UK to the international community."
        },
        {
            "text": "In this blog I discuss my recent work with the International Social Security Association (ISSA). I recently attended the forum for ISSA technical commissions (TC) in Geneva as a Vice-Chair of the Technical Commission for Statistical, Actuarial and Financial Studies."
        },
        {
            "heading": 2,
            "text": "ISSA and the Technical Commissions"
        },
        {
            "text": "The ISSA is the world’s leading international organisation for social security institutions, government departments and agencies. It promotes excellence in social security administration through:"
        },
        {
            "text": "This all enables its members to develop dynamic social security systems and policy throughout the world."
        },
        {
            "text": "The ISSA was founded in 1927 under the auspices of the International Labour Organization (ILO), a specialised agency of the United Nations. It now has more than 320 member institutions from over 160 countries."
        },
        {
            "text": "There are 14 ISSA TCs which deliver ISSA’s knowledge development and technical work. These allow members to focus their efforts in particular areas and included in the TCs are one each for:"
        },
        {
            "heading": 2,
            "text": "My contributions to ISSA"
        },
        {
            "text": "In March 2023 I was appointed as Vice-Chair of ISSA’s TC for Statistical, Actuarial and Financial Studies."
        },
        {
            "text": "I have used this platform to support ISSA’s work promoting excellence in social security."
        },
        {
            "text": "In December 2023, I attended ISSA’s triennial conference for actuaries and investment specialists in Mexico City. There I presented on the importance of simple and bold communications. This approach is vital to ensure that when governments apply actuarial advice they are best equipped to make the right choices for their people."
        },
        {
            "text": "In January 2024 I contributed to a project collaborating with the International Actuarial Association. We looked at how climate change will impact social security systems across the world."
        },
        {
            "heading": 2,
            "text": "Best practice of other nations"
        },
        {
            "text": "At the Europe Regional conference in Porto, Portugal (April 2024) I was humbled to hear about some incredible projects in place to support citizens. These projects spanned the provision of social security throughout citizens’ life cycles and the breadth of the achievements was remarkable."
        },
        {
            "heading": 3,
            "text": "Poland"
        },
        {
            "text": "In Poland, in difficult circumstances, they set up a fast-tracked social security system from scratch. It is designed to cater for the needs of tens of thousands of refugees displaced into Poland by the war in Ukraine."
        },
        {
            "heading": 3,
            "text": "Austria"
        },
        {
            "text": "Meanwhile in Austria cutting edge innovation has seen the delivery of a streamlined system for e-prescriptions linked to identity cards. The efficiencies created:"
        },
        {
            "heading": 2,
            "text": "Personal experiences in Geneva"
        },
        {
            "text": "Most recently I attended ISSA’s forum for all their TCs in Geneva in June."
        },
        {
            "text": "This gave me further opportunities to contribute to the international social security community and I cover 4 of those here:"
        },
        {
            "text": "1.  Investment of social security funds. The TC for the Investment of social security funds discussed revisions to ISSA guidelines on the investment of social security funds. These revisions will assist users of the guidelines where diverse investment opportunities, detailed investment market data and/or liquid secondary markets are not available to Social Security Funds. I contributed to this discussion noting the importance of professional qualifications for those making investment decisions."
        },
        {
            "text": "2.  Raising the profile of actuarial work. I chaired a discussion on an initiative I proposed: ‘to raise the profile of actuarial work in the international social security community.’ We had a productive debate which widened into a discussion on how to build countries’ actuarial capability and what surveys could be taken forward to gather useful information."
        },
        {
            "text": "3.  Statistical, actuarial and financial studies TC meeting. Our TC met and discussed plans for future workstreams and events. We discussed the latest developments in actuarial modelling of social security systems. We also identified the importance of actuarial guidelines and standards being available in different languages to ensure inclusivity."
        },
        {
            "text": "4.  Advancing the contribution of social security analysis and research to policy innovation. On the final day of the forum, I was invited to join a project group. Its members were looking at how social security institutions advance policy innovation through analysis and research. This project was facilitated through ISSA’s collaborative innovation hub. I facilitated the discussion and fed back from a working group that gave insights from the UK, Belgium, India and Azerbaijan."
        },
        {
            "text": "After the TC forums concluded I managed to squeeze in time to visit the Palais des Nations the original home of the League of Nations."
        },
        {
            "text": "Disclaimer"
        },
        {
            "text": "The opinions in this blog post are not intended to provide specific advice. For our full disclaimer, please see the About this blog page."
        }
    ]
}