{
    "url": "https://nationalscreening.blog.gov.uk/2024/08/19/natalie-brings-sociological-perspective-to-work-of-uk-nsc/",
    "title": "Natalie brings sociological perspective to work of UK NSC",
    "authors": [
        "Mike Harris"
    ],
    "categories": [
        "Uncategorized"
    ],
    "pub_date": "2024-08-19T09:15:40+01:00",
    "content": [
        {
            "text": "Natalie was born and brought up in Northamptonshire where she lived with her parents and younger brother until going to the University of Warwick to study politics and sociology."
        },
        {
            "text": "“I’d planned to do law at university but then changed tack because I didn’t want to nail my colours to the mast too soon. Choosing a dual honours degree in politics and sociology allowed me to continue studying subjects I was really enjoying at A level.”"
        },
        {
            "text": "In her second year, Natalie met her future husband who lived in a neighbouring student house. “I have stuck with him ever since and he has stuck with me.”"
        },
        {
            "text": "Natalie had always been interested in health and medical issues and the third year of her Warwick course included a module on the sociology of health and illness, which she found fascinating."
        },
        {
            "text": "Her next step was an MSc in medical sociology at Royal Holloway, University of London, and she then successfully applied for a PhD at the University of Nottingham, funded by the Medical Research Council (MRC). Her project there involved looking at cervical screening from a social science perspective, developing work she had started during her MSc."
        },
        {
            "text": "“I had a great time at Nottingham and did lots of stuff that was helpful for my CV including personal tutoring, small group teaching and leading a module. So, when I left, I had all this teaching experience alongside a PhD, which was really helpful.”"
        },
        {
            "text": "A couple of postdoctoral positions followed, including one at the University of Warwick Medical School where Natalie was encouraged to publish from her PhD and complete her teaching qualification."
        },
        {
            "text": "She then successfully applied for a post at the University of Leicester, gaining a lectureship in 2008. She has worked there ever since, gaining promotions to her current professorial position, being a head of department, and now a deputy head of college."
        },
        {
            "heading": 2,
            "text": "Screening as a social intervention"
        },
        {
            "text": "Natalie’s work uses sociological ideas and methods to tackle problems in the delivery of high-quality healthcare, so she thinks about screening as a social intervention as much as a medical intervention."
        },
        {
            "text": "“If someone isn’t participating in screening then I’m really interested in understanding why. My interest is not to try to nudge people into screening, but more to think about why they have made that decision. What’s important to them and how have they understood the offer?"
        },
        {
            "text": "“I’m keen we respect people’s informed decisions. But if there are patterns in terms of who is and isn’t accepting that offer, then that’s interesting to explore using social science theory.”"
        },
        {
            "text": "One of Natalie’s students, Shavez Jeffers, recently completed a PhD looking into why people decline the offer of breast screening."
        },
        {
            "text": "“It’s often difficult to find people who do not participate in screening, but she was able to recruit a group of people who were very clear decliners. They’d made an active decision not to participate, were quite eloquent and had looked at the pros and cons of screening and the potential for overdiagnosis and overtreatment."
        },
        {
            "text": "“People from different backgrounds and in different circumstances can make different decisions because they have different priorities and values.”"
        },
        {
            "text": "Natalie is also interested in people who do not engage with screening, possibly because they face barriers to attendance."
        },
        {
            "text": "“It’s about striking the right balance between giving people who would like to attend every opportunity to do so, while at the same time respecting the choice of those who have made an informed decision not to attend, and don’t want to have their decision questioned or undermined.”"
        },
        {
            "heading": 2,
            "text": "UK NSC’s crucial role as arbiter of evidence"
        },
        {
            "text": "Natalie had 2 spells as the social science expert on the UK NSC’s adult reference group before successfully applying to join the main committee where she brings a focus on the implementation of screening, informed by social science and her own academic research."
        },
        {
            "text": "“The committee has a really important role in being the arbiter of what is and isn’t worth doing in the screening space and making those decisions based on evidence and a very clear set of criteria. People may not want to hear those decisions if we don’t recommend screening but it’s important that there is a body willing and able to say those things.”"
        },
        {
            "text": "The UK NSC increasingly uses in-service evaluations (ISEs) to test out proposed new screening programmes, or changes to existing ones, in NHS services. Data collected from ISEs helps answer important questions about whether screening should be implemented."
        },
        {
            "text": "“I’ve been really pleased to see the increased focus on in-service evaluations. It’s about learning how something works in practice. How can it be delivered? Does it work the way we thought it would or does it have any unintended consequences?”"
        },
        {
            "text": "Natalie is the implementation theme lead for the National Institute for Health and Care Research’s (NIHR’s) Applied Research Collaboration (ARC) East Midlands. She welcomes the UK NSC’s engagement with research funding bodies like the NIHR and with researchers, who can ask the UK NSC’s research and methodology group (RMG) for advice on screening research proposals."
        },
        {
            "text": "“The RMG’s work in engaging with researchers at an early stage is important in helping to make sure that when screening-related research is published it can answer the questions we as a committee need it to. The committee is the obvious end user for the evidence from screening-based research, and researchers want to engage and produce something that will be helpful. We’ve all got a responsibility to use public money in the most appropriate way that’s going to be useful and have the potential to have an impact.”"
        },
        {
            "heading": 2,
            "text": "Proud mum, snooker and steam fan"
        },
        {
            "text": "Away from work, Natalie loves spending time with her 10-year-old son. “He is an absolute joy, the very best thing I’ve ever produced. He plays lots of sports. I’m quite happy on a sunny summer afternoon to sit in a folding chair with a picnic and watch him play cricket.”"
        },
        {
            "text": "She also joins her son for an occasional musical duet, Natalie playing the violin and her son the trombone. Her many other interests include athletics, snooker (“I can waste hours watching snooker, I find the strategy fascinating”), and steam trains. “My dad was a big steam train enthusiast, so we were always taken around preserved railways and railway museums. My husband had the same experience, and now our son is on board too.”"
        },
        {
            "heading": 2,
            "text": "Keep up to date"
        },
        {
            "text": "The UK NSC blog provides up to date news from the UK National Screening Committee. You can register to receive updates direct to your inbox, so there’s no need to keep checking for new articles. If you have any questions about this blog article, or about the work of the UK NSC, email screeninginformation@dhsc.gov.uk."
        }
    ]
}