{
    "url": "https://moderncivilservice.blog.gov.uk/2024/08/19/one-big-thing-2024-one-big-thing-starts-with-one-small-change/",
    "title": "One Big Thing 2024: One Big Thing starts with One Small Change",
    "authors": [
        "Government Reform"
    ],
    "categories": [
        "A Modern Civil Service",
        "Ambitious",
        "Government Reform",
        "Innovation",
        "Modernisation and Reform",
        "One Big Thing",
        "Proud Civil Servant",
        "Skilled",
        "Skilled Civil Service"
    ],
    "pub_date": "2024-08-19T12:03:16+01:00",
    "content": [
        {
            "text": "We are excited to announce that One Big Thing - our annual initiative to drive cross-Civil Service action around a shared priority - is back on 14 October 2024! "
        },
        {
            "text": "Last year's focus on data skills was a tremendous success, with an astonishing half a million hours of data learning undertaken by 212,000 civil servants. This year, the theme is Innovation: ‘One Big Thing starts with One Small Change’. This is all about using our combined creativity to improve how we work and how we serve the public! "
        },
        {
            "text": "We want all civil servants to be equipped with the knowledge and skills to innovate and feel inspired to experiment, collaborate, and share new ideas. “Innovation is and must be for everyone’’, as this year’s sponsor, Jo Shanmugalinham, Second Permanent Secretary at the Department for Transport, noted. We're out to prove that innovation is not just a buzzword - it's something within everyone's reach."
        },
        {
            "text": "The power of small changes"
        },
        {
            "text": "From speaking with innovators across the Civil Service, we’ve seen first hand how innovation drives progress, and how innovators are at the heart of how we improve policy, process and service delivery: "
        },
        {
            "text": "How is it different from last year?"
        },
        {
            "text": "Building upon our experiences from last year, we have been working with departmental One Big Thing champions and a cross-government working group to design and develop the next iteration of One Big Thing to be even bigger and better! "
        },
        {
            "text": "We wanted to make this year more flexible and highly tailored - it’s not only about civil servant’s understanding the innovation process but applying their learning to make small changes that creatively respond to the unique local challenges they  face in their teams or departments. "
        },
        {
            "text": "There will be three components to One Big Thing 2024: "
        },
        {
            "text": "This is a  guest blog from the One Big Thing team."
        }
    ]
}