{
    "url": "https://publicpolicydesign.blog.gov.uk/2023/01/12/democracy-design-and-public-policy-potential-and-pitfalls/",
    "title": "Democracy, Design and Public Policy: potential and pitfalls",
    "authors": [
        "Lucy Kimbell"
    ],
    "categories": [
        "Events",
        "PublicPolicyDesign"
    ],
    "pub_date": "2023-01-12T12:00:32+00:00",
    "content": [
        {
            "text": "Expertise in design has already been shown to help people think differently about how to develop and deliver services, processes, strategies and policies. It is a part of a family of approaches that shares an interest in attending to lived experience, participation, using evidence to shape decisions, and methods such as visualisation."
        },
        {
            "text": "Some of these activities have been focused on generating improved concrete outcomes in specific policy areas - what has been called ‘participation for design’ by academics Kidjie Saguin and Benjamin Cashore (2022). But less well understood are ‘designs for participation’. Here design is often focused on improving civic participation as an end in itself, for example through experimental approaches to participation or improving or changing designed aspects of democratic processes (eg voter registration, voting)."
        },
        {
            "heading": 2,
            "text": "Potential and pitfalls"
        },
        {
            "text": "Given these developments, it is timely to take step back and consider the potential, and possible pitfalls, of design approaches being used instrumentally to deliver civic participation and the broader opportunities for understanding democratic design..."
        },
        {
            "heading": 2,
            "text": "Join the workshop"
        },
        {
            "text": "To explore these questions, the Design and Policy Network funded by the Arts and Humanities Research Council is taking democracy as the focus of its third workshop (held online) on Friday 17 February 2023, 0900-1100 GMT, open to all. Book here."
        },
        {
            "text": "The aim of these workshops is to bring together perspectives from practice, design studies and political science, to work towards synthesising opportunities, barriers and dilemmas for further research and practice development. The workshop will begin with provocations from three invited speakers. Design researcher Joyce Yee is Professor of Design and Social Innovation at Northumbria University, co-author of Transformations by Design and currently working on a social innovation project across Asia. Political theorist Michael Saward is Professor of Politics and International Studies at the University of Warwick and author of the recent book Democratic Design (2022) (see book launch here). Catherine Greig is founder of architecture and design studio MakeGood, which works with people in local communities to shape change. Following three short provocations from our speakers, we will host a discussion and an activity in breakout groups."
        },
        {
            "text": "All are welcome to join the network, which is based on LinkedIn (and requires a LinkedIn login to join), which operates as a self-organising, light touch community of those curious about or expert in the use of design within public policy settings, using the platform to share activities or discuss their work. For example, members of the community were invited to carry out voluntary peer review of learning materials for the new Policy to Delivery Course developed by the Policy Design Community for government."
        },
        {
            "text": "For anyone who’d like to find out what went on at the previous two meetings, write-ups and videos of the guest ‘provocations’ are available on this blog linked below."
        }
    ]
}