{
    "url": "https://supportingfamilies.blog.gov.uk/2023/01/12/domestic-abuse-adopting-a-whole-family-approach/",
    "title": "Domestic Abuse - Adopting a whole family approach",
    "authors": [
        "ballypahal"
    ],
    "categories": [
        "Data Sharing",
        "Early Help",
        "Education",
        "Evaluation",
        "Multidisciplinary Teams",
        "Reducing Parental Conflict",
        "Transformation"
    ],
    "pub_date": "2023-01-12T19:19:49+00:00",
    "content": [
        {
            "text": "Summary "
        },
        {
            "text": "System and cultural changes can be challenging. We would like to share how Waltham Forest Safe and Together partnership tackles domestic abuse by adopting the Safe and together model. The partnership has evolved in line with the ethos of Supporting Families programme. Families need to feel confident when accessing services and Lead Practitioner training is key to adopting a whole family approach."
        },
        {
            "text": "The Safe and Together Model and Whole Family Working"
        },
        {
            "text": "‘Safe and Together’ is an internationally recognised model which was first developed in the United States (USA). The model encourages cultural and systematic shifts in practice, including changing the language around working with survivors and perpetrators of domestic abuse. Lead practitioners are provided with a suite of tools and interventions to identify and highlight survivor strengths and recognising domestic abuse as a parenting choice of the perpetrator. As such, the model equips practitioners in engaging with risk and taking a strengths-based approach in engaging whole families where their domestic abuse is a factor, including holding the perpetrator accountable for the impact of the abuse on family functioning."
        },
        {
            "text": "The model has three key principles:"
        },
        {
            "text": "Using these principles, the Safe and Together model encourages practitioners to look at the whole family wellbeing and functioning within the context of the abuse. This fits with the revised Domestic Abuse Act 2021, under which children in the UK are recognised as victims of domestic abuse, rather than witnesses."
        },
        {
            "text": "These principles also challenge the ‘failure to protect’ narrative, where the non-abusive parent is held accountable and responsible for the children’s safety and wellbeing in the context of domestic abuse. The model challenges the double standards in relation to parenting and gender, holding fathers to the same high expectations we hold mothers to."
        },
        {
            "text": "By identifying, mapping, and addressing perpetrator patterns of behaviour, we can shift from this narrative and have an overall understanding of survivors’ responses to abusive behaviours. The feedback has been resoundingly positive. The model is transformative in the outcomes we see for families achieved through the skills and competencies utilised and increasing the confidence of lead practitioners in engaging perpetrators of abuse. The transformation starts at the beginning of the work, not at the end. It highlights an emphasis on early intervention and support for families."
        },
        {
            "text": "London Metropolitan University Child and Women Abuse Studies Unity (CWASU) are the partnership evaluators and have undertaken a mid-term evaluation of the Safe and Together partnership. Their report highlighted that the referrals to the perpetrator behaviour change programme in Waltham Forest, (Rise) have almost doubled, with more perpetrators staying on the programme to completion. This is attributed directly to the implementation of the model and the increased practitioner skills in discussing the domestic abuse with the family."
        },
        {
            "text": "Implementation and practice"
        },
        {
            "text": "The model was rolled out in consultation with implementation leads recruited via Respect and Local Authority S&T champions. Each participating borough has an implementation lead who uses the framework to support practitioners with their assessment, case planning and interview documentation. One to One and group sessions have helped embed the model. 130 consultations have been completed since November 2021."
        },
        {
            "text": "While supporting practitioners the implementation leads have built solid working relationship with Senior management in different departments creating a cultural shift to promote S&T within the local authority."
        },
        {
            "text": "The model is centred on delivering systems change. It provides a long-term approach, tackling language and culture that has been around for years within the social care sector and domestic abuse discourse. It provides more than a one-off training or intervention. It is shifting the way we support families creating a positive cultural change. It focusses on family wellbeing, survivor empowerment and appropriate safeguarding for children."
        },
        {
            "text": "A whole agency approach supports the sustainability of the model as opposed to a one-off training approach. The implementation lead working alongside team managers and Senior leadership team has been integral to ensure success of delivery. The partnership avoids the ‘refer-out’ approach and instead practitioners are also able to liaise with specialist marketplace providers based on perpetrator’s characteristics, e.g. languages spoken, race, gender identity and sexuality."
        },
        {
            "text": "Safe and Together provides tools to support the lead practitioners to map perpetrator patterns independently as well as collectively with the support of their managers, implementation lead and champions in the borough. Practitioners can identify and assess survivor and family strengths, recognise perpetrator behaviour, and effectively support family functioning."
        },
        {
            "text": "Delivery of the behaviour change project has been supported by Supporting Families programme funding. This change project not only promotes identification of survivors, but funds targeted intervention allows opportunities for perpetrators to change their behaviour."
        },
        {
            "text": "The process of implementing the model in the workplace has seen transformative insights from frontline staff.  There has been a shift in language around coercive control and perpetrator accountability. The lead practitioners consistently engages with different agents within the council to enhance collaborative working."
        },
        {
            "text": "Practitioner Feedback "
        },
        {
            "text": "The input of practitioners is vital to the project and its evaluation, below are quotes from practitioners who have undertook the training and consultations, and disclosed feedback to the implementation leads:"
        },
        {
            "text": "The response that I got from mum after the report for family court after our consult was incredible. She said she felt \"overwhelmed with validation\" and that this was the \"first time someone else has seen his behaviours for what they are - I felt like I was going crazy until I saw your assessment.\" She was so pleased. It had an immediate impact on her parenting when she went home and has since. Dad has made a formal complaint about me and has requested a new plan and new social worker. Don't worry, I've mapped that out as part of his pattern too.\" "
        },
        {
            "text": "“I just had a useful conversation with the victim/survivor that we had a consultation on this morning, and I directly used some of your suggestions and it made for a productive and reflective discussion. I wanted to thank you for your excellent consultation and direction.” "
        },
        {
            "text": "“I spoke to my first perp! It was quite scary, but I found myself getting more confident as the call went on. It was through an interpreter which was good in hindsight as it gave me time to prepare my questions in real time. He was saying things like he is a good person and saying I could speak to his friends or colleagues, and I was able to challenge this and say thank you, but I don't need character references, and would like to explore with you what makes a 'good person' resort to violence in the presence of their child. I'm going to be having more calls with him but feel so much more confident, thank you.” "
        },
        {
            "text": "“I’ve been a practitioner for over 15 years, I just have to tell you that I consider this training to be career-changing.” "
        },
        {
            "text": "“This is the best consultation I have ever had at work. I have been a social worker in for eight years before moving to LBWF and you're like an angel coming down to me and saying all the things I've always thought about DV practice. I feel so energised about doing this strengths work with mum and showing the court all the things she's doing despite his abuse.” "
        },
        {
            "text": "Safe & Together Programme and London Partnership"
        },
        {
            "text": "The Safe & Together (S&T) partnership was set up in 2019 in London. This is the first time S&T has been implemented with the support of assigned implementation leads to provide heightened support to boroughs and it has transformed how practitioners engage with families with incident(s) of domestic abuse."
        },
        {
            "text": "Waltham Forest is the lead borough, initially working with Hackney, and has expanded to four further boroughs: Newham, Redbridge, Tower Hamlets and Hammersmith & Fulham."
        },
        {
            "text": "Cross-borough working along with Respect (https://www.respect.uk.net) the evaluation team Child & Woman abuse studies unit (CWASU) at London Metropolitan University and the Safe & Together Institute have all been influential in driving this project forward. CWASU are evaluating the implementation of the model, staff confidence and thoroughness of safety planning for families."
        },
        {
            "text": "The Safe & Together partnership is currently in Phase 2 of its roll out. Phase 1 focused on training, consultations, and specialised support in local authorities, initially starting with two boroughs. The initial phase allowed for the collection of data and time for appropriate evaluation via CWASU."
        },
        {
            "text": "As well as the expansion to 6 boroughs, Phase 2 saw the introduction of the marketplace for perpetrator intervention services. This promoted more specialised support for vulnerable families, adults, and children, as well as multi-agency and cross-borough working."
        },
        {
            "text": "Moving Forward  "
        },
        {
            "text": "A key objective within this partnership is to improve engagement with perpetrators at an earlier point to maximise the behaviour change opportunities and reduce harm via cross-borough and specialised borough-working. The partnership is monitoring the embedding of the model. There have been regular audits around the services provided, case file audits and continuous engagement and support given to staff. One key point to raise is that the principles of the model have been well received by staff in partner boroughs."
        },
        {
            "text": "This is a great example of Waltham Forest Supporting Families team working with domestic abuse experts to ensure their workforce have the right skills to implement a whole family approach."
        },
        {
            "text": "To find out more email vawg@walthamforest.gov.uk "
        }
    ]
}