{
    "url": "https://dragonsden.blog.gov.uk/2023/01/12/dragons-den-episode-2-series-20/",
    "title": "Dragons' Den Episode 2 Series 20",
    "authors": [
        "Kayleigh Enticknap"
    ],
    "categories": [
        "Business",
        "Copyright",
        "Designs",
        "Patents",
        "Trade marks"
    ],
    "pub_date": "2023-01-12T21:05:50+00:00",
    "content": [
        {
            "text": "It's hard to believe that Dragons’ Den has been around since 2005. In tonight’s episode we saw a delightful throw back of Peter Jones and his investments. As a Dragon since day one of the Den, Peter's popularity shows no sign of slowing down."
        },
        {
            "text": "But the question is - were any of the entrepreneurs lucky enough to walk away with an investment?"
        },
        {
            "heading": 2,
            "text": "Kiss the pug for luck!"
        },
        {
            "text": "First into the Den were James and Anushka with their delightful little pug, Bertie. They were asking for a £35k investment in exchange for a 5% share in their business."
        },
        {
            "text": "The couple are founders of event company Pop+Bark, that host both indoor and outdoor cafes and discos for dogs."
        },
        {
            "text": "As a dog owner I couldn’t help but love the idea of a room filled with dogs...but were the pair barking up the right tree with the Dragons?"
        },
        {
            "text": "Deborah was the first to opt out of the deal, who argued that competitors could easily duplicate the concept of the company. Although Deborah is correct in that others could choose to open a similar business, the doggy duo are concentrating on building their brand with registered trade marks. A trade mark helps consumers to differentiate your goods and services from your competitors."
        },
        {
            "text": "Although Steven and Touker wanted a bite of the action, James and Anushka left the Den with their tails between their legs after a tense negotiation backfired."
        },
        {
            "heading": 2,
            "text": "Never give up "
        },
        {
            "text": "Next into the Den was Ben Pearson, owner of plus-size clothing company Big Clothing 4 U asking for £150k in return for a 10% stake in his business."
        },
        {
            "text": "Ben’s story is nothing short of remarkable. Having embraced his autism and difficult past, he is determined to motivate others and show that there are no barriers to success."
        },
        {
            "text": "From the start, Ben's tenacity and determination won him admirers. Fashion Tycoon Touker Suleyman complimented him on his great value products."
        },
        {
            "text": "Life for the entrepreneur has shifted in an inspiring way with Steven praising Ben for successfully securing Harvey Price, son of model Katie Price, as his Brand Ambassador. Steven also called Ben’s pitch “one of the best he’s seen since being in the Den”."
        },
        {
            "text": "A quick search of our trade mark database tells me that their clothing line Uptheir trade mark has been registered with the IPO since April 2018. The trade mark search tool is a free, user-friendly service that can be found on the IPO's website. It is useful for checking if there are any similar marks to your brand registered in the UK or to find out who owns a trade mark."
        },
        {
            "text": "Ben managed to bag a perfect fit with Touker Suleyman offering all the money for 35% of his business."
        },
        {
            "text": "This pitch really did prove that anything is possible if you believe in yourself."
        },
        {
            "heading": 2,
            "text": " A good night's sleep "
        },
        {
            "text": "Kris and Martin Andrew entered the Den wanting £80k for a 20% cut of their business Bed Stretch Limited."
        },
        {
            "text": "Their patented bed extender PillowShelf intended to sell the dream of a decent night’s sleep to tall people. This instantly caught the attention of 6ft 7 Peter Jones who showered their patented product with praise, calling it ‘genius’."
        },
        {
            "text": "It seems that patenting was a wise move for this pillow-inventing pair as a patent can protect their invention from anyone who may try to make, use, sell or import it without their permission."
        },
        {
            "text": "To patent your invention in the UK, it must be:"
        },
        {
            "text": "Your intellectual property can be a valuable asset in your business. It could even be your single most valuable asset which you could use to secure finance for company growth."
        },
        {
            "text": "However, not all IP is of financial value. Unless your IP assets help to create, maintain or increase cash flow, they may have no monetary value."
        },
        {
            "text": "Although Peter loved the product, he thought the business needed a far bigger investment than what Kris and Martin were pitching for. Sadly, their dreams of investment soon drifted away as each of the Dragons ‘turned down’ the deal."
        },
        {
            "heading": 2,
            "text": "Tech business that lends a hand "
        },
        {
            "text": "The episode’s final pitch saw Craig Smith, co-founder and CEO of tech company JustLend, asking for a £100k investment for a 2% stake in the business."
        },
        {
            "text": "The idea behind Craig’s pitch was to change the way people borrow and overcome the common pitfalls in family lending."
        },
        {
            "text": "A nervous Craig began to stumble when the Dragons began to delve deeper into Craig’s turnover."
        },
        {
            "text": "It takes a huge amount of courage to stand in front of the Dragons and showcase a product that you’ve invested so much of your time developing, so I really felt for Craig."
        },
        {
            "text": "IP became the hot topic of conversation with Craig stating that a patent application had been submitted to the US but not the UK. I did wonder why. However, things took a turn for the worst when Craig was unable to answer if he owned the name domain."
        },
        {
            "text": "Businesses in Craig’s position may want to check the IPO’s trade mark database to see if their chosen brand name has already been taken and protected by an earlier rights holder."
        },
        {
            "text": "Despite a rocky start, Steven loved the idea behind the business and offered all the money for a 12% share of the business."
        },
        {
            "text": "And until next week..."
        },
        {
            "text": "We hope you enjoyed this Dragons’ Den IP check-in. Congratulations to all the entrepreneurs that left with an offer. See you next week for another look at the IP behind the pitches."
        }
    ]
}