{
    "url": "https://cspl.blog.gov.uk/2023/01/12/improving-the-local-government-standards-framework/",
    "title": "Improving the local government standards framework",
    "authors": [
        "Paul Hoey"
    ],
    "categories": [
        "Ethical standards",
        "Local government"
    ],
    "pub_date": "2023-01-12T13:09:23+00:00",
    "content": [
        {
            "text": "Paul Hoey, is co-founder of Hoey Ainscough, a company which has worked with over 400 local authorities on Code of Conduct related issues, through provision of training, investigative support and wider governance advice. They also supported the Local Government Association on production of a new model Code of Conduct for councillors and supporting guidance."
        },
        {
            "text": "Paul was director of strategy at the Standards Board for England from 2001 until its closure in 2012."
        },
        {
            "text": "Every year we hold an annual conference for local government officers to discuss the local government standards framework, latest legal developments and how we can help improve standards and the implementation of the framework locally. And every year we hear the same frustrations about how the lack of available sanctions means local government is hamstrung in dealing with the most serious misconduct and the tiny minority of councillors who routinely bully and harass fellow councillors, officers and members of the public."
        },
        {
            "text": "That was why we detected almost-universal support among officers and councillors alike for the CSPL’s 2019 recommendations to government to allow local authorities to reintroduce the power of suspension for the most serious offences. And this year’s conference reacted with dismay at the government’s negative response to the report."
        },
        {
            "text": "This was particularly so given the relative progress there has been on processes to deal with conduct issues in Parliament in recent years. "
        },
        {
            "text": "In many ways the Localism Act and subsequent reforms of Parliamentary standards procedures have sent local and national government in opposite directions. Prior to 2012 the local government framework was driven by independence, whether the Standards Board nationally or the role of independent members on standards committees locally, and meaningful sanctions that could be imposed outside of the electoral cycle, such as suspension and disqualification of members."
        },
        {
            "text": "Parliament meanwhile was then largely self-regulating but on the back of some of the serious bullying allegations of recent years, has slowly introduced greater independence. "
        },
        {
            "text": "Investigations into MPs are now routinely done by independent outsiders rather than civil servants. The committee which hears the cases now has an equal number of lay members as MPs, all with equal voting rights. And there are powers to suspend the worst offenders from the House, as has happened recently, and even the power of recall. So, Parliament is now not dissimilar to where local government used to be before the Localism Act. "
        },
        {
            "text": "Local government meanwhile feels in a similar position to the Ministerial Code, relying too often on the whims of party machinery in the absence of meaningful sanctions or independent representatives with the power to make decisions on cases. And parish councils, for the most part without even party discipline, have suffered the most from the lack of sanctions, as demonstrated in survey work we have done for the Society of Local Council Clerks which showed how many local councils faced real behavioural challenges."
        },
        {
            "text": "That tension between the Government’s view of relying on the party machinery to deal with things and the sanctity of the ballot box as the formal instrument for regulating politicians on the one hand, and councils being allowed locally to deal effectively with serious breaches, as Parliament can, with its own sanctions, has left local government in a very difficult position reputationally. "
        },
        {
            "text": "Our conference delegates echoed the disappointment felt more widely at the Government’s rejection of the key findings of the Committee. Yet if localism is to mean anything, shouldn’t councils be able to regulate themselves locally if they so choose in a way that Parliament itself can nationally? If MPs can be trusted to suspend their own for serious misconduct so why cannot councillors? "
        },
        {
            "text": "The vast majority of councillors operate to the highest standards but are let down by the few who are bullies or abuse the system. Local government deserves a system at least as good as Parliament and not one which lacks the teeth to deal adequately with those rare but serious breaches of the Code."
        }
    ]
}