{
    "url": "https://companieshouse.blog.gov.uk/2023/01/12/working-together-to-build-an-inclusive-culture-at-companies-house/",
    "title": "Working together to build an inclusive culture at Companies House",
    "authors": [
        "Bailjit Gill - Senior Equality, Diversity and Inclusion Manager"
    ],
    "categories": [
        "People and culture",
        "Personal blog posts",
        "Working at Companies House"
    ],
    "pub_date": "2023-01-12T13:59:47+00:00",
    "content": [
        {
            "text": "Source: Companies House strategy 2020 to 2025."
        },
        {
            "text": "Our Equality, Diversity and Inclusion (EDI) strategy may be seen as ambitious. How will it be delivered? What will it mean to current and potential employees? What might it look like?"
        },
        {
            "text": "At Companies House, we know our strategy is aspirational and that we may stumble at times. We know we may not fully achieve this goal by 2025. But we’re still determined to undertake this journey. We’ll continue to drive our strategy forward and apply an EDI lens to all we do - recognising the benefits for both our staff and our customers."
        },
        {
            "text": "We’ve already taken great steps in creating an inclusive environment at the core of our organisational culture. We’re helping our brilliant people to flourish and drive high performance through our ‘ABC’ behaviours - being adaptable, bold and curious."
        },
        {
            "text": "These behaviours are fundamental in embedding our values:"
        },
        {
            "heading": 2,
            "text": "Networks and support groups"
        },
        {
            "text": "Our 20-plus people-led networks and support groups were instrumental in supporting colleagues through the uncertainties of lockdown and working from home during the coronavirus (COVID-19) pandemic. They continue to grow, providing opportunities for colleagues to flourish and bring their whole, brilliant selves to work."
        },
        {
            "text": "One of the many positive outcomes of our networks has been the evolution of our diversity and inclusion forum into our EDI steering group. Chaired by our organisational executive champion for EDI, Michelle Wall, it has representatives from our directorates, our culture change community and our trade union."
        },
        {
            "text": "This group plays a strategic role in monitoring our EDI strategy's development, delivery, and implementation. Our strategy compliments the culture of Companies House and focuses on 3 core themes:"
        },
        {
            "text": "Our focus on the employee experience means we take an evidence-based approach to being an employer of choice and providing opportunities for colleagues to thrive. This helps us provide a positive customer experience where accessibility needs are recognised and met."
        },
        {
            "heading": 2,
            "text": "Disability confidence"
        },
        {
            "text": "In March 2021 we achieved disability-confident leader status after having our disability-confident self-assessment independently validated. This was in recognition of our commitment to recruit, retain, support and develop disabled people and those with long-term health conditions."
        },
        {
            "text": "We champion disability confidence through our social media channels, where our colleagues and ability network members share their stories of living with a disability and how being disability confident has helped them thrive at Companies House."
        },
        {
            "text": "To mark the International Day for the Elimination of Racial Discrimination in 2021, we became a signatory of the Business in the Community Race at Work Charter, committing to improving racial equality in the workplace. We created a sub-group of colleagues from across Companies House to identify opportunities for progression and deliver the charter’s calls to action. The group makes sure EDI is integral to policy development and service delivery, and supports and challenges current approaches."
        },
        {
            "text": "This culture of inclusivity is what we continue to promote at Companies House, the culture of ‘we’ and ‘us’ not ‘I’ or ‘me’. We want to ensure there are opportunities for everyone to not only have a seat at the table but also to have a voice."
        },
        {
            "text": "These working groups and our staff networks provide an opportunity for colleagues to recognise the role they can play in driving our EDI strategy forward."
        }
    ]
}