{
    "url": "https://charitycommission.blog.gov.uk/2023/11/28/charities-must-not-become-forums-for-hate-speech-over-gaza/",
    "title": "Charities must not become forums for hate speech over Gaza",
    "authors": [
        "Orlando Fraser KC"
    ],
    "categories": [
        "International charities",
        "News"
    ],
    "pub_date": "2023-11-28T16:01:13+00:00",
    "content": [
        {
            "text": "This comment piece was first published in the Sunday Telegraph on 26 November 2023. "
        },
        {
            "text": "As aid lorries enter Gaza during the current pause in hostilities, we are reminded once again of the vital role charities play in meeting humanitarian needs. UK charities are among those working to supply essential water, food, clothing and medical supplies to those affected by the conflict in both Gaza and Israel. They are doing so in extraordinarily difficult circumstances – as are charities working in Ukraine and in other conflict zones across the world."
        },
        {
            "text": "At the same time, many charities here in the UK have stepped up their efforts to promote cohesion and combat extremism at a time when reports of antisemitic and anti-Muslim hate crimes have been increasing. I have met several Jewish and Islamic charities recently to discuss their work and will continue to do so."
        },
        {
            "text": "The overwhelming response of most charities to the conflict has been a credit to the sector. It is therefore hugely disappointing this good work could be undermined by a few individuals abusing their privileged positions to fuel division and tension."
        },
        {
            "text": "The Charity Commission is aware of a significant number of serious concerns about activities linked to the conflict in Israel and Gaza. These include charities representing communities across the religious divide, although these to date largely concern allegations of antisemitic or hate speech."
        },
        {
            "text": "Charities must not allow their premises, events or online content to become forums for hate speech against any community or unlawful extremism. The Commission will not stand by and permit charities to be abused in this way. Where there proves to have been wrongdoing, make no mistake, we will deal with it robustly."
        },
        {
            "text": "We have acted when similar concerns have been raised in the past. This includes instances where one charity had hosted events that risked it being associated with terrorism, and another charity that appeared to be connected to far-right extremism. We act just as strongly on any form of hate speech or extremism, whichever community it stems from or is directed at."
        },
        {
            "text": "At a time of heightened tensions, people expect charities to lead the way in bringing us together. That does not mean that they must avoid sensitive or controversial issues – charities are free to campaign so long as it relates to their charitable purposes. But I am clear that they have a responsibility to do so with respect, tolerance and consideration for others. They must avoid inflammatory rhetoric that stokes division and may undermine trust in the sector."
        },
        {
            "text": "The Commission will always use our powers, given to us by Parliament, to deal strongly with those who intentionally or recklessly abuse charities in England and Wales. We will not hesitate to take action to protect the reputation of the sector as a whole, including the many religious charities on our Register that are doing so much good across communities here and abroad."
        }
    ]
}