{
    "url": "https://environmentagency.blog.gov.uk/2023/11/28/exploring-the-science-of-droughts/",
    "title": "Exploring the science of droughts",
    "authors": [
        "Dr Robert Bradburne"
    ],
    "categories": [
        "Environment Agency"
    ],
    "pub_date": "2023-11-28T09:55:17+00:00",
    "content": [
        {
            "text": "Summer 2022 was extraordinarily hot and dry, and 2023 marked the hottest June on record in the UK. It’s easy to forget these events as temperatures cool again, but the ground beneath your feet remembers. The way that water flows across and into our landscape, over the months and years after rain has fallen or a dry spell has occurred, is one of the things that makes the science of drought so fascinating and challenging."
        },
        {
            "text": "That is why the Environment Agency has undertaken its largest ever consultation of drought experts in England. The project pulled together the latest knowledge on drought, identifying what is known and what is not yet known about the topic."
        },
        {
            "text": "This holistic view on drought – comprising both the best available knowledge and gaps in the evidence base – will improve how the Environment Agency and others approach research, planning, and management. Having the latest science available is vital to keeping England on the front foot of resolving complex issues like drought in the face of a changing economy and climate."
        },
        {
            "text": "Leading the way on drought"
        },
        {
            "text": "Droughts – when we don’t have enough water to meet all our needs in an area – will impact our environment, our economy, and our lifestyle. Better predicting and managing these periods is therefore very important for sustainable development."
        },
        {
            "text": "Various organisations including the Environment Agency, Defra, water companies, farmers, and academics have a role in good water management, whether that’s through policy, research, or operations. With water scarcity predicted to increase as the climate warms, it is important to work together now to ensure resilient water supplies are available to meet future demand while protecting the water environment."
        },
        {
            "text": "The Environment Agency takes a leading role in drought planning for England.  Not only are we delivering Defra’s Plan for Water to ensure clean and plentiful supplies, but the Environment Agency also chairs the National Drought Group. The group brings together government, regulators, industry, and other stakeholders to provide a multi-sector overview and strategic management of drought."
        },
        {
            "text": "These joint efforts are designed to ensure that decision-makers across the country are as drought ready as possible, especially given the complexity and unpredictability of droughts in England."
        },
        {
            "text": "Navigating a world in flux"
        },
        {
            "text": "After the record-breaking temperatures of summer 2022, drought has once more become a topic of concern in England. Despite this interest, the causes and impacts of drought remain poorly understood."
        },
        {
            "text": "What makes drought so difficult to understand? Droughts are complex events that vary in duration, time of year, location, severity, and society’s preparedness and response. The infrequency of drought means there is limited data and experience of them. This is further complicated by uncertainty in how climate change may impact drought in years to come."
        },
        {
            "text": "England’s approach to drought management has developed incrementally over the last century, adding new experience from each new drought. Although this has proven very effective, a better understanding of future droughts could lead to big improvements in drought planning and management."
        },
        {
            "text": "Taking a multidisciplinary approach"
        },
        {
            "text": "The complex nature of drought means we must approach it from all sides. Drought isn’t just physical – it also elicits a social response. Social science will be as important as environmental science when managing future events."
        },
        {
            "text": "Alongside in-house expertise, the Environment Agency consulted over 40 of the UK’s leading drought scientists from 13 different universities, research institutes, and consultancies. Together this formed a rounded, objective view of drought science across disciplines."
        },
        {
            "text": "The report focuses on three themes: the physical processes that drive droughts, the impacts of droughts, and the management of droughts. Each theme was further divided into specialist topics, where an expert undertook a review and commented on what is known and not yet known within their specialist area."
        },
        {
            "text": "Bridging the knowledge gap"
        },
        {
            "text": "The project explored how drought may alter due to climate change, and what the implications are for both the catchment environment and water management. Working with the panel of experts, it uncovered core knowledge gaps that cut across drought management and research:"
        },
        {
            "text": "Having these knowledge gaps at our fingertips can help the Environment Agency, water companies, and academics target priority work. Advances in climate modelling and new understanding of catchment processes, for example, could improve drought forecasting, response, and management. Meanwhile, understanding the social context of drought management could change the actions of regulators, water suppliers, and users."
        },
        {
            "text": "Injecting science into future thinking"
        },
        {
            "text": "Although our science can help test the envelope for future droughts, there’s no crystal ball for predicting when drought will occur and where. We need to get ready for that variability."
        },
        {
            "text": "The project provides invaluable insight into drought in England, improving understanding of the issues we face and how we can work with others to enable change going forward. The Environment Agency is eager to keep working with experts to make sure we are as prepared as we can be. We also want to build on the review’s findings and identify where further research could deliver benefits for drought management and resilience, both now and into the future."
        },
        {
            "text": "This project was led by Stuart Allen, Principal Scientist, and Dr Glenn Watts, Deputy Director of Research, in the Environment Agency’s Chief Scientist’s Group. It was completed in collaboration with drought experts from the British Geological Survey (BGS), Cranfield University, HR Wallingford, Loughborough University, National Centre for Atmospheric Science (NCAS) at the University of Reading, Nottingham Trent University, The Open University, UK Centre for Hydrology & Ecology (UKCEH), University of Birmingham, and University of Bristol."
        },
        {
            "text": "Led by Dr Robert Bradburne, Chief Scientist, the Environment Agency’s Chief Scientist’s Group leads on science, research, monitoring, analysis, and evaluation for the Environment Agency. Read more about Environment Agency science in our 2022 Chief Scientist’s Annual Review."
        }
    ]
}