{
    "url": "https://governmentscienceandengineering.blog.gov.uk/2023/11/28/gse-awareness-courses-in-action/",
    "title": "GSE Awareness Courses in Action",
    "authors": [
        "gseprofession"
    ],
    "categories": [
        "Blog Series",
        "Guest Blog",
        "Learning & Development"
    ],
    "pub_date": "2023-11-28T15:18:41+00:00",
    "content": [
        {
            "text": "We asked two of our GSE members, Olivia and Mick about their experiences with the GSE Awareness Level Courses – here is what they said."
        },
        {
            "heading": 4,
            "text": "Mick, what role do you have, and what course have you completed?"
        },
        {
            "text": "I’m Head of the Science and Evidence Ecosystem Development Unit at the Home Office, and I have completed the course ‘Understanding and Accessing Science and Engineering Advice’."
        },
        {
            "heading": 4,
            "text": "Tell us more about your role"
        },
        {
            "text": "My role is focussed on supporting the department to get better at using science and evidence in decision-making. We are looking to upskill non-specialists to breed a culture of scientific inquisitiveness, helping them to navigate the science and evidence ecosystem in the Home Office. We are also looking to provide great L&D and professional development for people in the GSE and building a sense of community whilst supporting and championing innovation in all its forms."
        },
        {
            "heading": 4,
            "text": "What did you like about the course? "
        },
        {
            "text": "It was really useful and I liked the mix of short videos from seniors and more traditional e-learning. It struck a good balance and kept me interested. I really enjoyed the course, and it is definitely worth taking the time to complete  – particularly if you aren’t from a science or engineering background and want a good overview."
        },
        {
            "heading": 4,
            "text": "Since completing the course, how has your interaction with science and engineering advice changed?"
        },
        {
            "text": "For me, although I work with scientists and engineers regularly, I haven’t really done any science training since my school days – many years ago! So, things have changed. The course has enabled me to better understand some scientific concepts and better communicate them in our regular departmental communications."
        },
        {
            "heading": 4,
            "text": "What key actions have you taken since completing the course? "
        },
        {
            "heading": 4,
            "text": "Tell us more about how you have been promoting the courses "
        },
        {
            "text": "We have promoted them on our Science and Evidence and Knowledge Hub, the regular newsletter, and comms that go to all line managers as well as to our policy colleagues. We are also having a session on the learning during our Science and Evidence Week."
        },
        {
            "heading": 4,
            "text": "Olivia, what role do you have, and what course have you completed?"
        },
        {
            "text": "I am an Engineering Technical Advisor for Department for Transport, and I have completed ‘Communicating Science and Engineering Advice’."
        },
        {
            "heading": 4,
            "text": "Tell us about your role"
        },
        {
            "text": "In my role, I support with benchmarking cost estimates for project teams, as well as developing the offer to the engineering profession in the department, such as through running events and publishing blogs."
        },
        {
            "heading": 4,
            "text": "How has your communication of science and engineering advice changed since you completed the course? "
        },
        {
            "text": "The course has helped me to consider how the technical information can be tailored to best suit a particular audience based on their understanding.  It has also given me a greater understanding about how best to display different types of data. What’s more, the course has provided me with a wealth of additional links to continue developing my technical communication skills going forward."
        },
        {
            "heading": 4,
            "text": "Do you have any hints and tips for making use of the course? "
        },
        {
            "text": "Definitely save the course and the additional resources so you can return to them – they are very user-friendly and it is easy to jump to a particular section that you need when it is required."
        },
        {
            "text": "Huge thanks to Olivia and Mick for sharing their experiences. If you would like to share your experiences of any GSE Profession products, we’d love to hear from you."
        },
        {
            "text": "A comms pack for the courses is available on the GSE Knowledge Hub or you can contact us."
        }
    ]
}