{
    "url": "https://defradigital.blog.gov.uk/2023/11/28/how-were-harnessing-the-power-of-iot-to-safeguard-our-trees/",
    "title": "How we’re harnessing the power of IoT to safeguard our trees",
    "authors": [
        "Jonathan Griffiths"
    ],
    "categories": [
        "Defra digital",
        "Defra Science and Innovation",
        "Software tools"
    ],
    "pub_date": "2023-11-28T09:32:32+00:00",
    "content": [
        {
            "text": "In National Tree Week, Defra technology innovation consultant Jon Griffiths shares his insight on how a collaborative project has been investigating where Narrowband-Internet of Things (NB-IoT) technology could help monitor tree growth, and support research into the role trees play in tackling climate change."
        },
        {
            "text": "In a world increasingly driven by technology, it's heartening to get involved in innovative collaborations aimed at preserving our natural environment. One such partnership has emerged between us here in Defra, Royal Botanical Gardens (Kew), and Vodafone, centred around the Internet of Things (IoT) technology."
        },
        {
            "heading": 2,
            "text": "The Internet of Trees: monitoring our natural assets"
        },
        {
            "text": "This story begins in July 2020 when we successfully ran a project, using the Internet of Things (IoT) to link specialist sensors and transmit an abundance of data to Defra and our partner Forest Research, which enabled our scientists to measure the environmental impact on tree growth and function - a first of its kind in the United Kingdom."
        },
        {
            "text": "This was a ground-breaking initiative as it was able to leverage IoT technology to gather the data, while also demonstrating the potential to significantly advance Defra's sustainability goals, as outlined in our 25-year environment plan."
        },
        {
            "text": "Trees, often referred to as the lungs of our planet, offer a plethora of environmental, social, and economic benefits. From carbon capture and flood mitigation to improved air quality and enriched biodiversity, trees are indispensable to our ecosystem. Moreover, they hold historic, cultural, and educational value. Which makes this work even more exciting."
        },
        {
            "heading": 2,
            "text": "Next steps - a comprehensive approach to tree monitoring"
        },
        {
            "text": "Every year, trees or branches falling can lead to substantial economic cost, estimated at well over £10 million annually for the UK."
        },
        {
            "text": "We and the Royal Botanic Gardens at Kew are now undertaking a new exploration that will combine various data inputs, including soil moisture, temperature, rainfall, wind, and tree growth measurements, to create an early warning system for what the scientists refer to as tree failure; that is structural breakage of the trunk, branches, or roots."
        },
        {
            "text": "This proactive approach allows for timely remedial action to safeguard these natural assets by attaching tree sway and growth sensors as well as full weather stations on and around selected trees."
        },
        {
            "text": "The scientific community stands to gain significantly from this project. Understanding the precise combination of environmental factors contributing to tree failure is often challenging. Additionally, this initiative promises significant health and safety benefits by eliminating the need for personnel to manually collect data in adverse weather conditions."
        },
        {
            "heading": 2,
            "text": "Using emerging technology to help us visualise data for informed decision-making"
        },
        {
            "text": "The overarching technology goal of this project is to establish a monitoring network and a Software as a Service (SaaS) visualisation platform for Defra and its affiliated organisations, and with the potential to integrate all monitoring devices in our extensive estate. Such an approach could revolutionise how we manage and protect our natural resources, driving more efficiencies and sustainability."
        },
        {
            "text": "Ultimately, what we want to understand is how we can better manage our forests and our trees to maximise the amount of carbon they’re absorbing from the atmosphere. Our hope is that using these sorts of technologies will help us get there quicker, and in a more cost-effective and sustainable way."
        },
        {
            "text": "In conclusion, this current partnership between Defra, Vodafone, and RBG (Kew), and the previous project involving Forest Research, represent a shining example of how technology and environmental stewardship can go hand in hand."
        },
        {
            "text": "By harnessing the power of IoT, we have a chance to not only preserve our precious trees but also usher in a new era of sustainability and environmental protection. Together, we can safeguard our natural assets for future generations."
        },
        {
            "text": " "
        }
    ]
}