{
    "url": "https://insidehmcts.blog.gov.uk/2023/11/28/improving-accessibility-in-our-courts-and-tribunals/",
    "title": "Improving accessibility in our courts and tribunals",
    "authors": [
        "Mike Williams, Deputy Director of Service Excellence"
    ],
    "categories": [
        "Court and tribunal reform",
        "Customer experience and research",
        "Training and support"
    ],
    "pub_date": "2023-11-28T13:00:43+00:00",
    "content": [
        {
            "text": "[English] - [Cymraeg]"
        },
        {
            "text": "It’s vital that everyone has access to court and tribunal services and can participate in our justice system easily and effectively.  "
        },
        {
            "text": "That means thinking about how we can remove common barriers for people or where we can’t remove the barrier, providing support so they can be overcome.  Some of the things we’re doing in this area may be known and visible to most people. But we’re making progress in other ways through a lot of work that goes on behind the scenes, so I wanted to update on a few of these areas through this blog. "
        },
        {
            "heading": 2,
            "text": "Leading the way at the Royal Courts of Justice  "
        },
        {
            "text": "Staff at the Royal Courts of Justice (RCJ) are working to improve support for court users with accessibility needs and as part of that, we recently relaunched our Disability Contact Officer network.   "
        },
        {
            "text": "This network of staff devote time to supporting users with disabilities. When they need additional support or specific provisions, a dedicated officer can help put these measures in place. "
        },
        {
            "text": "We’ve also introduced accessibility workshops to raise awareness and help our colleagues on things like using accessible language.   "
        },
        {
            "heading": 2,
            "text": "Providing reasonable adjustments "
        },
        {
            "text": "Reasonable adjustments are the measures put in place to provide something different, so that an individual can access and use our services in the same way as a person without a disability.   "
        },
        {
            "text": "We do many things to make sure that people can access our services, like providing forms in large print, making sure hearing enhancement systems are available and making sure ramps and lifts are available.  "
        },
        {
            "text": "We also discuss requests for reasonable adjustments with judges, who are committed to making sure everyone can give their best evidence and has a fair hearing.  "
        },
        {
            "text": "To help embed all of this, we’ve recently updated our reasonable adjustment learning which provides information, advice and support for our staff.  "
        },
        {
            "text": "We know that the reasonable adjustment process does not always work perfectly for those requesting them or for our staff delivering them. We’re committed to making this better and have inbuilt a new process to collect reasonable adjustment requirements more consistently within services that have been reformed as part of our ongoing Reform Programme.  This should ultimately improve the service we provide and the experience of people who rely on reasonable adjustments. "
        },
        {
            "heading": 2,
            "text": "What else are we doing to support people? "
        },
        {
            "text": "This year, we joined the Hidden Disabilities Sunflower Network which helps people visiting court and tribunal buildings who may need additional support.   "
        },
        {
            "text": "People who wear the Hidden Disabilities Sunflower are discreetly indicating they may need support or help. "
        },
        {
            "text": "We have also created a signposting strategy, which helps our staff to understand  "
        },
        {
            "text": "the extent, boundaries and expectations of their role in helping court users access support. We’re training staff on how to identify people’s needs and signpost them to support effectively.  "
        },
        {
            "text": "We’re working to support users who are unable to or find it difficult to use our online services. Our free National digital support service has been live since June 2022 and has supported more than 3,500 users so far, offering face-to-face or remote support. "
        },
        {
            "heading": 2,
            "text": "The first deaf juror  "
        },
        {
            "text": "In July 2022, at Croydon Crown Court, our first deaf juror,  Karen, served in a trial aided by British Sign Language (or BSL) interpreters.  "
        },
        {
            "text": "Changes to the Police, Crime, Sentencing and Courts Act let BSL interpreters into the jury deliberation room as a thirteenth person, allowing adults who rely on a BSL interpreter to take part in jury service.  "
        },
        {
            "text": "We worked closely with Karen before the trial, to consider things like the layout of the courtroom to plan where Karen and the interpreters would sit to best allow all jurors to follow the trial.    "
        },
        {
            "text": "The result was resoundingly positive and since then almost 40 other deaf jurors have now taken part in trials with the support of a BSL interpreter. "
        },
        {
            "heading": 2,
            "text": "Funding for estate improvements "
        },
        {
            "text": "Looking ahead, we know that we need to improve those court and tribunal buildings that are not fully accessible. "
        },
        {
            "text": "This isn’t without challenges, due to the complexity of our estate. Our buildings range from the historic to the modern and most were built before the Equality Act 2010. Some have listed status which can restrict the ways we can make them accessible.  "
        },
        {
            "text": "You might be aware that the Lord Chancellor recently announced that we will spend £220 million by March 2025 to maintain, improve and modernise our buildings.  "
        },
        {
            "text": "We’re also working to improve public-facing information about our buildings and their accessibility, so that court users can easily find out what facilities they can expect.  "
        },
        {
            "heading": 2,
            "text": "Finding more information "
        },
        {
            "text": "We know there’s more for us to do to improve accessibility and support court users with additional needs and we’re committed to doing this. "
        },
        {
            "text": "You can find out more about the Sunflower Lanyard Scheme and how we support court and tribunal users with disabilities at our GOV.UK pages. "
        },
        {
            "text": " "
        },
        {
            "text": "[English] - [Cymraeg]"
        },
        {
            "heading": 1,
            "text": "Gwella hygyrchedd mewn llysoedd a thribiwnlysoedd"
        },
        {
            "text": "Mae'n hanfodol bod gan bawb fynediad at wasanaethau llysoedd a thribiwnlysoedd ac y gallant gymryd rhan yn ein system gyfiawnder yn hawdd ac yn effeithiol."
        },
        {
            "text": "Mae hynny'n golygu meddwl am sut y gallwn gael gwared ar rwystrau cyffredin i bobl neu, lle nad yw hynny’n bosibl, darparu cymorth fel y gellir eu goresgyn. Efallai y bydd rhai o'r pethau rydyn ni'n eu gwneud yn y maes hwn yn hysbys ac yn weladwy i'r rhan fwyaf o bobl. Ond rydyn ni'n gwneud cynnydd mewn ffyrdd eraill trwy lawer o’r gwaith sy'n mynd ymlaen y tu ôl i'r llenni, felly roeddwn i eisiau rhoi'r wybodaeth ddiweddaraf ichi am rai o'r meysydd hyn trwy'r blog hwn."
        },
        {
            "heading": 2,
            "text": "Arwain y ffordd yn y Llysoedd Barn Brenhinol"
        },
        {
            "text": "Mae’r staff yn y Llysoedd Barn Brenhinol (RCJ) yn gweithio i wella'r gefnogaeth i ddefnyddwyr y llysoedd sydd ag anghenion hygyrchedd, ac fel rhan o hynny, gwnaethom ail-lansio ein rhwydwaith Swyddogion Cyswllt Anabledd yn ddiweddar."
        },
        {
            "text": "Mae'r rhwydwaith hwn o staff yn neilltuo amser i gefnogi defnyddwyr ag anableddau. Pan fydd angen cymorth ychwanegol neu ddarpariaethau penodol arnynt, gall swyddog penodol helpu i roi'r mesurau hyn ar waith."
        },
        {
            "text": "Rydym hefyd wedi cyflwyno gweithdai hygyrchedd i godi ymwybyddiaeth a helpu ein cydweithwyr ar bethau fel defnyddio iaith hygyrch."
        },
        {
            "heading": 2,
            "text": "Darparu addasiadau rhesymol"
        },
        {
            "text": "Addasiadau rhesymol yw'r mesurau a roddir ar waith i ddarparu rhywbeth gwahanol, fel y gall unigolyn gyrchu a defnyddio ein gwasanaethau yn yr un modd ag unigolyn heb anabledd."
        },
        {
            "text": "Rydym yn gwneud llawer o bethau i sicrhau bod pobl yn gallu cyrchu ein gwasanaethau, fel darparu ffurflenni mewn print bras, sicrhau bod systemau gwella clyw ar gael a sicrhau bod rampiau a lifftiau ar gael."
        },
        {
            "text": "Rydym hefyd yn trafod ceisiadau am addasiadau rhesymol gyda barnwyr, sydd wedi ymrwymo i sicrhau y gall pawb roi eu tystiolaeth orau a chael gwrandawiad teg."
        },
        {
            "text": "Er mwyn helpu i ymgorffori hyn i gyd, rydym wedi diweddaru ein hyfforddiant addasiadau rhesymol yn ddiweddar sy'n darparu gwybodaeth, cyngor a chefnogaeth i'n staff."
        },
        {
            "text": "Rydym yn gwybod nad yw'r broses addasiadau rhesymol bob amser yn gweithio'n berffaith i'r rhai sy'n gofyn amdanynt neu i'n staff sy'n eu darparu. Rydym wedi ymrwymo i wneud hyn yn well ac rydym wedi adeiladu proses newydd i gasglu gofynion addasiadau rhesymol yn fwy cyson o fewn gwasanaethau sydd wedi'u diwygio fel rhan o'n Rhaglen Ddiwygio barhaus. Yn y pen draw, dylai hyn wella'r gwasanaeth a ddarparwn a phrofiad pobl sy'n dibynnu ar addasiadau rhesymol."
        },
        {
            "heading": 2,
            "text": "Beth arall rydyn ni'n ei wneud i gefnogi pobl?"
        },
        {
            "text": "Eleni, fe wnaethom ymuno â’r Rhwydwaith Blodyn Haul Anableddau Cudd sy'n helpu pobl sy'n ymweld ag adeiladau'r llys a'r tribiwnlys a allai fod angen cymorth ychwanegol."
        },
        {
            "text": "Mae pobl sy'n gwisgo'r cortyn gwddf Blodyn Haul Anableddau Cudd yn dangos mewn ffordd gynnil y gallai fod angen cymorth neu help arnynt."
        },
        {
            "text": "Rydym hefyd wedi creu strategaeth gyfeirio, sy'n helpu ein staff i ddeall"
        },
        {
            "text": "maint, ffiniau a disgwyliadau eu rôl wrth helpu defnyddwyr llysoedd i gael gafael ar gymorth. Rydym yn hyfforddi staff ar sut i adnabod anghenion pobl a'u cyfeirio at gefnogaeth effeithiol."
        },
        {
            "text": "Rydym yn gweithio i gefnogi defnyddwyr nad ydynt yn gallu defnyddio ein gwasanaethau ar-lein neu'n ei chael hi'n anodd defnyddio ein gwasanaethau ar-lein. Mae ein gwasanaeth cymorth digidol cenedlaethol  am ddim wedi bod yn weithredol ers mis Mehefin 2022 ac mae wedi cefnogi mwy na 3,500 o ddefnyddwyr hyd yn hyn, gan gynnig cefnogaeth wyneb yn wyneb neu o bell."
        },
        {
            "heading": 2,
            "text": "Y rheithiwr byddar cyntaf"
        },
        {
            "text": "Ym mis Gorffennaf 2022, yn Llys y Goron Croydon, cymerodd ein rheithiwr byddar cyntaf, Karen, ran mewn treial a gynorthwywyd gan gyfieithwyr Iaith Arwyddion Prydain (neu BSL)."
        },
        {
            "text": "Mae newidiadau i Ddeddf yr Heddlu, Troseddu, Dedfrydu a'r Llysoedd yn caniatáu mynediad i gyfieithydd BSL i ystafell drafod y rheithgor fel trydydd unigolyn ar ddeg, gan ganiatáu i oedolion sy'n dibynnu ar gyfieithydd BSL gymryd rhan mewn gwasanaeth rheithgor."
        },
        {
            "text": "Buom yn gweithio'n agos gyda Karen cyn yr achos, i ystyried pethau fel cynllun yr ystafell llys hyd at drefnu lle byddai Karen a'r cyfieithydd yn eistedd i ganiatáu i'r holl reithwyr ddilyn y treial yn y ffordd orau."
        },
        {
            "text": "Roedd y canlyniad yn hynod gadarnhaol ac ers hynny mae bron i 40 o reithwyr byddar eraill bellach wedi cymryd rhan mewn treialon gyda chefnogaeth cyfieithydd BSL."
        },
        {
            "heading": 2,
            "text": "Cyllid ar gyfer gwella ystadau"
        },
        {
            "text": "Wrth edrych ymlaen, rydym yn gwybod bod angen i ni wella'r adeiladau llysoedd a thribiwnlysoedd hynny nad ydynt yn gwbl hygyrch."
        },
        {
            "text": "Nid yw hyn heb ei heriau, oherwydd cymhlethdod ein hystad. Mae ein hadeiladau'n amrywio o'r hanesyddol i'r modern ac adeiladwyd y rhan fwyaf ohonynt cyn Deddf Cydraddoldeb 2010. Mae gan rai statws rhestredig a all gyfyngu ar y ffyrdd y gallwn eu gwneud yn hygyrch."
        },
        {
            "text": "Efallai eich bod yn ymwybodol bod yr Arglwydd Ganghellor wedi cyhoeddi yn ddiweddar y byddwn yn gwario £220 miliwn erbyn mis Mawrth 2025 i gynnal, gwella a moderneiddio ein hadeiladau."
        },
        {
            "text": "Rydym hefyd yn gweithio i wella gwybodaeth sy'n wynebu'r cyhoedd am ein hadeiladau a'u hygyrchedd, fel y gall defnyddwyr y llysoedd ddarganfod yn hawdd pa gyfleusterau y gallant eu disgwyl."
        },
        {
            "heading": 2,
            "text": "Dod o hyd i fwy o wybodaeth"
        },
        {
            "text": "Rydym yn gwybod bod mwy i’w wneud i wella hygyrchedd a chefnogi defnyddwyr llysoedd ag anghenion ychwanegol ac rydym wedi ymrwymo i wneud hyn."
        },
        {
            "text": "Gallwch ddarganfod mwy am Gynllun Cortyn Gwddf Blodyn Haul a sut rydym yn cefnogi defnyddwyr llysoedd a thribiwnlysoedd ag anableddau ar ein tudalennau GOV.UK."
        }
    ]
}