{
    "url": "https://dragonsden.blog.gov.uk/2023/11/28/march-muses-diversifying-celebrations-one-decoration-at-a-time/",
    "title": "March Muses – diversifying celebrations one decoration at a time",
    "authors": [
        "Kayleigh Enticknap"
    ],
    "categories": [
        "Business",
        "Designs",
        "Licensing",
        "Trade marks"
    ],
    "pub_date": "2023-11-28T15:58:20+00:00",
    "content": [
        {
            "text": "In my house it’s never too early to talk about Christmas! With that in mind, fasten your sleigh belt and hear all about March Muses and their decorations of colour that are bringing diversity to celebrations throughout the year."
        },
        {
            "text": "We caught up with Dragons’ Den entrepreneur and March Muses co-founder Alison Burton as she unwrapped the story of her success in the Den along with business partner Natalie Duvall."
        },
        {
            "text": "From Santa and fairies to ballerinas and angels, the duo’s story is a festive delight."
        },
        {
            "heading": 3,
            "text": "What was your inspiration?"
        },
        {
            "text": "We wanted to know where Project Director Alison and Creative Director Natalie got their inspiration."
        },
        {
            "text": "Alison explained how Natalie was struck by the question that her daughter had asked her. That year the family ended up using a black Barbie as a tree topper."
        },
        {
            "text": "Natalie and Alison searched online and on the high street for decorations in a variety of skin tones but found nothing. They had come across a huge glaring gap in the market."
        },
        {
            "heading": 3,
            "text": "\"Decorations that look like us\""
        },
        {
            "text": "Alison explained how, behind everything they create, they’re passionate about making their decorations available far and wide and as accessible as possible."
        },
        {
            "text": "After a successful 2 years of trading, the entrepreneurs applied to pitch for investment on Dragons’ Den."
        },
        {
            "heading": 3,
            "text": "Tell us about your Dragons’ Den experience"
        },
        {
            "text": "Negotiations in the Den are nerve-racking, Alison explained. She had often seen people push back and then walk away with nothing. The March Muses team was successful, however."
        },
        {
            "text": "With the two Dragons taking 15% each, the pair remained the majority stakeholders. Alison told us how securing investment from the Dragons helped shine a light on their products, lending credibility to their business.  Their success in the Den was a huge achievement for the pair, as black women in business. Alison highlighted the fact that in a recent report looking at diversity in access to venture capital between 2009 and 2019, black female-led companies received 0.02% of the total amount invested. [Diversity beyond Gender, Erika Brodnock]."
        },
        {
            "text": "March Muses is now the leading brand for decorations of colour in the UK. After signing a 5-year licensing deal with Tesco, the pair have launched their exclusive range in more than 700 stores stocking a variety of cards, wrapping paper, gift bags, napkins, pyjamas and festive decorations in two skin tones."
        },
        {
            "heading": 3,
            "text": "How has intellectual property benefited your business?"
        },
        {
            "text": "With 2023 being their fifth Christmas, we asked Alison about the growth of March Muses and the value behind owning their intellectual property."
        },
        {
            "text": "Having initially started with six designs, Alison told us how intellectual property had played an important part in their business."
        },
        {
            "heading": 3,
            "text": "How does it feel to have your designs in stores nationwide?"
        },
        {
            "text": "Stocked by Tesco, Selfridges, Liberty, Royal Albert Hall and many small gift shops, their business is going from strength to strength having licensed their products."
        },
        {
            "text": "From traditional, to modern and everything in between, we think the March Muses team has shown how to make everyone feel included in the magic of Christmas."
        }
    ]
}