{
    "url": "https://socialcare.blog.gov.uk/2023/11/28/ncasc-2023-back-to-bournemouth-for-big-conversations/",
    "title": "NCASC 2023: back to Bournemouth for big conversations",
    "authors": [
        "Mark Osterloh"
    ],
    "categories": [
        "Care and support",
        "Carers",
        "Communities",
        "Digital skills and technologies",
        "Events",
        "Social care reform",
        "social work",
        "Workforce"
    ],
    "pub_date": "2023-11-28T15:31:35+00:00",
    "content": [
        {
            "text": "The National Children and Adults Services Conference (#NCASC23) returns to the Jurassic Coast and the Bournemouth International Conference Centre (BIC) this week (29 November – 1 December)."
        },
        {
            "text": "One of the biggest conferences in the social care calendar, it is a coming together of care sector partners, policy makers and organisations with responsibilities for children and adult services in the statutory, voluntary and private sectors. Helen Whately, Minister for Social Care, will be addressing conference on Thursday 20 November, 11am - 11.45am."
        },
        {
            "text": "You can view the full programme online, but here are some highlights…"
        },
        {
            "heading": 2,
            "text": "Come and meet Lyn Romeo, Chief Social Worker for Adults"
        },
        {
            "text": "Once again, Lyn Romeo, Chief Social Worker for Adults (CSW) at the Department of Health and Social Care (DHSC) will be attending to promote adult social work and engage in the big issues facing the profession and social care more generally."
        },
        {
            "text": "She will be holding various meet and greet sessions at the DHSC stand in the exhibition hall throughout the conference. This will include opportunities to discuss the CSW/Principal Social Worker proportionate assessment guide."
        },
        {
            "text": "On Wednesday, 12.10pm - 1.10pm, Lyn will be attending a session showcasing a collaborative model preparing young people and their families for adulthood, led by Bournemouth, Christchurch and Poole Council colleagues."
        },
        {
            "text": "She will also be contributing to the Accelerating Reform Fund event on at the Bournemouth Highcliffe Marriott later that day from 4-6pm, then back to a Social Care Futures event in the Purbeck Bar of the BIC to discuss ways to generate public support for the transformation of social care."
        },
        {
            "heading": 2,
            "text": "Digitising Social Care"
        },
        {
            "text": "Tommy Henderson-Reay, Social Worker & Digital Engagement Programme Manager (NHSE):"
        },
        {
            "heading": 2,
            "text": "Social care workforce reform"
        },
        {
            "text": "On Thursday, 30 December 9.30am – 10.30am, DHSC’s Gareth Young, Deputy Director, Adult Social Care Workforce, will be participating in ‘Adult social care: a career, not just a job’, focusing on the future of this complex and diverse profession. The session will be chaired by Oonagh Smyth, CEO of Skills for Care:"
        }
    ]
}