{
    "url": "https://ofsi.blog.gov.uk/2023/11/28/ofsi-successfully-defends-first-court-review/",
    "title": "OFSI successfully defends first Court Review",
    "authors": [
        "OFSI"
    ],
    "categories": [
        "Financial Sanctions",
        "Licensing",
        "Russia",
        "UK"
    ],
    "pub_date": "2023-11-28T10:09:33+00:00",
    "content": [
        {
            "text": "On 26 October 2023, the High Court of Justice, Administrative Court, delivered its judgment rejecting a legal challenge by Mikhail Fridman against OFSI’s decision to refuse to grant certain licence requests."
        },
        {
            "text": "OFSI has been at the front and centre of an unprecedented financial sanctions response following Putin’s full-scale invasion of Ukraine. OFSI welcomes the judgment and the Court’s approval of OFSI’s decision-making under the UK’s financial sanctions licensing regime in this case. This judgment indicates that OFSI properly implements financial sanctions through its licensing powers."
        },
        {
            "text": "OFSI will robustly defend baseless challenges against its decisions and ensure financial sanctions are implemented to support the objectives of the Russia sanctions regime and applicable licensing grounds."
        },
        {
            "text": " "
        },
        {
            "text": "Summary of Judgment"
        },
        {
            "text": "On 22 March 2023, a claim was filed against HMT (OFSI) by Mr Fridman. This was the first ever claim filed against OFSI to the High Court under section 38(2) of the Sanctions and Anti-Money Laundering Act 2018 (SAMLA). It was also the first ever challenge to OFSI’s licensing decision-making under the Russia (Sanctions) (EU Exit) Regulations 2019 (the Russia Regulations)."
        },
        {
            "text": "Mr Fridman argued that OFSI was wrong to refuse certain licence requests made under the prior obligations, basic needs and routine holding and maintenance licensing grounds in respect of his primary residence in the UK."
        },
        {
            "text": "In his judgment, the Honourable Mr Justice Saini dismissed the claim on all grounds of challenge."
        },
        {
            "text": " "
        },
        {
            "text": "Key Points"
        },
        {
            "text": "The Judge supported OFSI’s long-standing view that OFSI does have a “residual discretion to refuse to grant a licence, even if the conditions for the grant of a licence are met”. OFSI’s decisions were rational and within the bounds of this residual discretion. However, in recognising this residual discretion, the Judge determined that it “must be exercised consistently with the purposes of the” statutory regime."
        },
        {
            "text": "The Judge also agreed with OFSI’s position that the onus is on the applicant to provide all relevant information in their licence application to enable OFSI to make a decision as to whether a licensing ground applies. He remarked that this approach was “perfectly sensible and a matter of common sense.” He commented that, “OFSI cannot be expected to know whether or not all information has been provided.” He also found that OFSI is not required to act as an “adviser to applicants” or “identify gaps” in licence applications."
        },
        {
            "text": "Further to this, the Judge commented that, “OFSI directed itself correctly in law and came to a lawful conclusion,” on its interpretation of the prior obligations licensing ground: specifically, that a payment cannot be made directly or indirectly to another designated person, including where the payment is made to a person or entity which is owned or controlled by that designated person."
        },
        {
            "text": "Finally, it was found that the review proceedings should not be used as a vehicle to pursue a “rolling application” and, therefore, evidence submitted post-decision was irrelevant."
        },
        {
            "text": " "
        },
        {
            "text": "Guidance"
        },
        {
            "text": "OFSI has issued extensive guidance to outline what is expected from individuals and organisations when submitting licence requests. As a first step, we recommend reading Chapter 6 of the General Guidance."
        }
    ]
}