{
    "url": "https://ukhsa.blog.gov.uk/2023/11/28/the-importance-of-national-flu-surveillance-data-swine-flu/",
    "title": "How GPs help us monitor the spread of flu and the effectiveness of vaccines",
    "authors": [
        "Blog Editor"
    ],
    "categories": [
        "Health Protection"
    ],
    "pub_date": "2023-11-28T17:23:36+01:00",
    "content": [
        {
            "text": "GPs and general practice have access to valuable data that is vital to the health of the public. In this blog post we will explore the importance of surveillance data collected in general practice and how it underpins our understanding of health across the nation."
        },
        {
            "heading": 2,
            "text": "What is GP surveillance data?"
        },
        {
            "text": "A third of GPs in England opt to share pseudonymised patient data with the Oxford Royal College of GPs Research and Surveillance Centre (RSC).  Some also take swabs and samples – virology swabs are sent to the UK Health Security Agency (UKHSA) to monitor infections and vaccine effectiveness, and serology samples are used to report background levels of natural immunity and measure vaccine waning."
        },
        {
            "heading": 2,
            "text": "Who is collecting this data?"
        },
        {
            "text": "The RSC is a collaboration between the Royal College of GPs, UKHSA, and the University of Oxford. It has been collecting data for over 55 years and continues to be internationally renowned as a source of analysis and interpretation of primary care data."
        },
        {
            "heading": 2,
            "text": "What is GP surveillance data used for?"
        },
        {
            "text": "Our scientists use GP surveillance data not only to monitor the spread of respiratory diseases such as flu, but also to better understand patient risk factors and plan public health interventions."
        },
        {
            "text": "In November 2023, the first confirmed case of Influenza A(H1N2)v in humans in the UK, unofficially referred to by the media as \"swine flu\", was detected through routine national flu surveillance undertaken by the network."
        },
        {
            "text": "The RSC has been monitoring a range of respiratory viruses circulating in the community for over 55 years, tracking new viruses as they appear."
        },
        {
            "text": "Since the 1990s, it has asked patients with illnesses that could be flu to contribute swab samples for further analysis. These results go on to help GPs advise on suitable care for their patients and contribute to a wider understanding of the spread of respiratory diseases – informing public health policy. The data is also used to assess how well influenza and COVID-19 vaccines work in preventing illness in patients who would otherwise need to be seen by a GP."
        },
        {
            "heading": 2,
            "text": "Why do we want to expand the collection of surveillance data?"
        },
        {
            "text": "Since 2020, efforts have been made to expand patient swabbing and blood sampling to include year-round testing for respiratory viruses. These samples help better understand the effectiveness of vaccines and assess the overall immunity of the UK population. Many practices make use of the Take a Test postal swabbing service that enables telephone and video consultation patients to send in a surveillance swab, which can also be used for patients seen in person."
        },
        {
            "text": "We’re hugely grateful to those practices in the RSC who are already participating in data collection and research. We’re asking more practices to participate and all those currently participating to expand on the sampling they’re currently doing."
        },
        {
            "text": "Through small increases in swabbing and blood sampling in each practice, we can generate much greater insight overall into clinical and demographic risk factors in patients, our understanding of the effectiveness of influenza and COVID-19 vaccines in at-risk groups such as the immunosuppressed, the effectiveness of the annual flu vaccine, and produce data on characterisations of influenza viruses to inform WHO advice on vaccine composition."
        },
        {
            "text": "To understand the level of immunity across the population we are asking practices to contribute blood samples from children, working age adults and older adults."
        },
        {
            "heading": 2,
            "text": "Why is monitoring respiratory diseases important?"
        },
        {
            "text": "The data collected for respiratory disease and flu rates continues to be a central tool in our work to address and reduce health inequalities. We want to increase participation from under-represented communities. We would like to have more GPs signed up and participating, especially those in areas of deprivation. Data from the RSC is vital for our understanding of how to plan future public health interventions."
        }
    ]
}