{
    "url": "https://environmentagency.blog.gov.uk/2024/05/24/anglian-water-services-ltd-convicted-in-case-brought-by-environment-agency/",
    "title": "Anglian Water Services Ltd convicted in case brought by Environment Agency",
    "authors": [
        "pressoffice"
    ],
    "categories": [
        "Environment Agency"
    ],
    "pub_date": "2024-05-24T17:07:23+00:00",
    "content": [
        {
            "text": "It is two and a half years since we announced the launch of a major investigation into potential widespread non-compliance by water and sewerage companies at wastewater treatment works."
        },
        {
            "text": "This is the largest ever criminal investigation we have undertaken to date. The investigation is examining potential breaches of environmental permit conditions by all water and sewerage companies operating in England. The extent of potential non-compliance involves more than 2,000 wastewater treatment works."
        },
        {
            "text": "This week, as part of the investigation, we were in court after bringing a case against Anglian Water Services Ltd which arose out of the investigation."
        },
        {
            "text": "Anglian Water Services Ltd has been found guilty of failing, without reasonable excuse, to comply with a requirement to provide records requested by the Environment Agency."
        },
        {
            "text": "The water company was convicted with the case adjourned to 5 July 2024 for a sentencing hearing to take place at Peterborough Magistrates’ Court."
        },
        {
            "text": "Since launching this investigation, the Environment Agency has served several requirements for records on the company. Anglian Water Services Ltd has been convicted of failing, without reasonable excuse, to respond to one of these notices, served under Section 108 of the Environment Act 1995, contrary to Section 110(2)(a) of the Environment Act 1995 between dates in January 2022 and January 2023."
        },
        {
            "text": "Anglian Water Services Ltd had entered a not guilty plea to the charge, claiming that they had a reasonable excuse for non-compliance. However, having heard the evidence in the case, District Judge Kenneth Sheraton rejected that claim."
        },
        {
            "text": "This ruling is an important step forward in our regulation and driving transparency from the water industry. Our investigation into potential cases of non-compliance across the sector continues."
        },
        {
            "text": "Latest progress"
        },
        {
            "text": "In our last update we told you about the range of indicator sites that have been included in the investigation. These specially selected ‘indicator sites’ have been identified to be representative of all the wastewater treatment works where offending may have occurred."
        },
        {
            "text": "Our specialist investigators have now reviewed all the evidence gathered from their visits to all 114 identified indicator sites which cover a spectrum of works ranging in size, across the entire area covered by each water company, and discharging to differing environmental and amenity sensitivities. Each water company has had around 10 different site visits from our investigators. Following the review of evidence gathered from the indicator site visits, further requirements for information will be requested from water companies where needed."
        },
        {
            "text": "To date, the investigation team has reviewed over 30,000 exhibits and taken over 700 statements. The team is now approaching external witnesses for statements to help them further build their case."
        },
        {
            "text": "When the investigation is complete, we will consider all options available under our enforcement and sanction policy. Environmental permits exist to protect our environment and limit the impact of pollution; water companies have a legal responsibility to comply with their permit conditions."
        },
        {
            "text": "While our investigation continues, our teams continue to conduct normal water company regulation activity at wastewater treatment works including auditing their compliance records and responding to reports of pollution incidents."
        },
        {
            "text": "As with any live criminal investigation, we are very limited as to what we can share about our inquiries. However, we are committed to sharing information where we can."
        },
        {
            "text": "You can find more information about this investigation here."
        }
    ]
}