{
    "url": "https://moderncivilservice.blog.gov.uk/2024/05/24/did-you-know-the-operational-delivery-profession/",
    "title": "Did you know...? The Operational Delivery Profession",
    "authors": [
        "Government Reform"
    ],
    "categories": [
        "A Modern Civil Service",
        "Capability",
        "Government Reform",
        "Interoperability",
        "Modernisation and Reform",
        "Operational Delivery",
        "Professional Networks",
        "Proud Civil Servant"
    ],
    "pub_date": "2024-05-24T11:15:49+01:00",
    "content": [
        {
            "text": "The Operational Delivery Profession (ODP) is the Civil Service’s largest profession, with its members making up over half of the Civil Service workforce. They provide services to millions of citizens at home and abroad. It’s likely that you’ll find ODP members in some unexpected places! Did you know that…"
        },
        {
            "text": "Operational delivery professionals handle a huge range of different transactions. "
        },
        {
            "text": "These range from passport applications and vehicle tax to supporting people with cost-of-living payments and licences for fishing or explosives. They are the public face of government, providing essential support to citizens and communities across the country. "
        },
        {
            "text": "The largest concentration of operational delivery professionals is in the North West of England."
        },
        {
            "text": "That’s over 45,000 colleagues, which is more than 16% of all operational delivery professionals. \n"
        },
        {
            "text": "Operational delivery professionals are involved with the preservation of language. "
        },
        {
            "text": "Cadw is the Welsh Government’s historic environment service and is also the Welsh word which means to keep or protect. The Cadw Lifelong Learning Team works with stakeholders to enable access and engagement to Welsh historic sites and stories, helping to embed Welsh traditions and culture and encouraging community cohesion. "
        },
        {
            "text": "Operational delivery professionals help deliver cultural events.  "
        },
        {
            "text": "The Department for Work and Pensions’ Eurovision Task Force in Merseyside helped to make the Eurovision Song Contest a reality by supporting claimants into jobs which supported the creation of the event. They held 13 massive recruitment events over a 12 week span including claimants on Universal Credit. They worked with 143 employers and nearly 4,000 claimants, resulting in 468 job offers made on the day and over 3,000 potential follow ups. This was an incredible step towards helping claimants into meaningful employment while also supporting the local Merseyside economy. "
        },
        {
            "text": "Operational delivery professionals support innovative and creative industries in the UK."
        },
        {
            "text": "They do this by offering services to register intellectual property rights designating valuable assets like patents, trademarks and designs through registration with the Intellectual Property Office. This gives these assets protection, making it easier to take action against individuals or companies who may copy them. "
        },
        {
            "text": "The Home Office has over 25,000 members of the Operational Delivery Profession. "
        },
        {
            "text": "This accounts for 75% of all people working in the department\n"
        },
        {
            "text": "Operational delivery professionals help support the UK economy by offering services to incorporate and dissolve limited companies.   "
        },
        {
            "text": "Providing limited liability to business and operating a transparent register of UK companies helps drive confidence in the UK economy. "
        },
        {
            "text": "There’s a lot more to learn about ODP "
        },
        {
            "text": "As the world of work is changing fast it’s important to keep up to date with the latest thinking and resources across the profession. ODP offers numerous qualifications and learning opportunities for colleagues across all grades. You can sign up to the ODP website to find out more."
        }
    ]
}