{
    "url": "https://deframedia.blog.gov.uk/2024/05/24/draft-determinations-for-water-companies/",
    "title": "Draft determinations for water companies",
    "authors": [
        "Defra Press Office"
    ],
    "categories": [
        "water",
        "Weekly stories"
    ],
    "pub_date": "2024-05-24T13:54:49+01:00",
    "content": [
        {
            "text": "The economic regulator of the water sector Ofwat has confirmed it will delay its publication of water company draft determinations until 11 July 2024."
        },
        {
            "text": "Previously due to be published on 12 June, the new publication date follows Cabinet Office guidance in light of the general election taking place on 4 July."
        },
        {
            "text": "The price review process is run by Ofwat to determine the investment plans for water companies every five years (in this case from 2025 to 2030)."
        },
        {
            "text": "Water companies submitted their proposed business plans to Ofwat in October 2023 setting out details of how much investment they plan to put forward. Ofwat will now scrutinise these plans to ensure they meet the targets for environmental improvements and deliver value for money for consumers."
        },
        {
            "text": "This assessment will be reflected in the upcoming draft determinations, with final determinations published later this year."
        },
        {
            "text": "A government spokesperson said: "
        },
        {
            "text": "“Investment in the water industry has not kept pace with where it needs to be. This needs to change and we want to see ambitious plans from water companies that meet our targets and deliver for customers."
        },
        {
            "text": "“Ofwat’s job is to ensure that these plans deliver effectively for customers and the environment. This process will resume post-election to ensure customers do not pay for water companies’ poor performance.”"
        }
    ]
}