{
    "url": "https://environmentagency.blog.gov.uk/2024/05/24/environment-agency-explains-that-pollution-in-windermere-is-reducing-but-more-needs-to-be-done-to-tackle-all-sources-of-pollution-not-just-sewage/",
    "title": "Environment Agency explains that pollution in Windermere is reducing but more needs to be done to tackle all sources of pollution, not just sewage",
    "authors": [
        "pressoffice"
    ],
    "categories": [
        "Environment Agency"
    ],
    "pub_date": "2024-05-24T15:24:22+00:00",
    "content": [
        {
            "text": "In my role I get asked about water quality on Lake Windermere a lot. There are confusing messages and pictures being shared with the public which tend to over simplify the sources of pollution in the lake and damage public confidence in the quality of bathing waters.  "
        },
        {
            "text": "It is important to remember that all four designated bathing waters have excellent bathing water status  and are monitored on a weekly basis throughout the bathing waters season to test for bacteria that can impact human health. "
        },
        {
            "text": "Despite the excellent ratings, there are a number of challenges that we need to continue to address to drive further improvements in water quality across the entire lake, especially given the impacts of climate change.  To do so it’s important that we have a clear picture of water quality in the lake, and all sources of pollution that impact on it. "
        },
        {
            "text": "We pride ourselves on our collection of accurate data and evidence, along with our scientific knowledge. This ensures our interventions make the most impact. Environment Agency scientists have quantified the different sources of pollution (Science and data – Love Windermere) in Windermere and their impact in different parts of the lake so that we can target our efforts to improve water quality. "
        },
        {
            "text": "To help us ensure that we can collect data on an on-going basis we have been installing additional water quality monitors in Windermere.  Read more: New sensors track water quality in Esthwaite – Love Windermere. "
        },
        {
            "text": "Evidence shows that key pollutants peaked in the 1990s. And since then, phosphorus and nitrate levels have been declining. For example, there has been a 30% reduction in phosphorus going into Windermere since 2020, following improvements to sewage treatment works, driven by the Environment Agency, Ofwat and government as part of the Water Industry National Environment Programme (WINEP). "
        },
        {
            "text": "Our modelling shows around 52 % of the phosphorus in Windemere’s north basin comes from sewage and approximately 48 % from runoff from both built up and rural areas. Sewage is coming from United Utilities and private sewage treatment works, septic tanks and storm overflows. "
        },
        {
            "text": "In the south basin, around 59 % of the phosphorus in Windemere is from sewage and about 41 % from runoff. This is set out in the table below. "
        },
        {
            "text": " "
        },
        {
            "text": "There is a risk that people will not realise that the phosphorus entering Windermere comes from wide range of different sources, including farmland and homes, and is not just the result of sewage pollution. This could mean that people do not take the action that we need them to and may lead to more pollution entering the lake. To really make a difference, we need to take action to reduce phosphorus from every source. Read more: Reedbed Restoration - SCRT "
        },
        {
            "text": "One of the questions I am often asked is why we are seeing an increase in algal blooms in Windermere if phosphorus levels are declining? To answer that we need to consider the impact of climate change. The surface temperature of the lake has increased by 1C since the 1950s which doesn’t sound like a lot, but it can have a big impact. Higher temperatures, less rainfall during the summer and more intense rainfall events which increase the amount of phosphorus entering the lake from runoff can lead to more algal blooms.  "
        },
        {
            "text": "I hope this has made it clearer that levels of pollution in Windermere have reduced significantly. However, there is a lot more we can and need to do and we continue to work to bring pollution levels down from all sources to ensure that the lake is protected now and for future generations.  Read more: Latest news – Love Windermere  "
        },
        {
            "text": "For further information visit Love Windermere "
        }
    ]
}