{
    "url": "https://ruralpayments.blog.gov.uk/2024/05/24/george-from-rpas-grants-service-tells-us-about-the-training-course-at-the-allerton-project/",
    "title": "George from RPA's Grants Service tells us about the training course at the Allerton Project",
    "authors": [
        "RPA Editor"
    ],
    "categories": [
        "External engagement"
    ],
    "pub_date": "2024-05-24T16:03:01+01:00",
    "content": [
        {
            "text": "George from RPA’s Grants Service team talks about the two-day training course he attended at the Allerton Project in Leicestershire. The Allerton Project is a 320 hectare demonstration farm which researches the effects of different farming methods on wildlife and the environment."
        },
        {
            "text": "The farm also showcases a range of land management techniques which balance farming productivity with environmental benefits, to about two thousand visitors a year, which include businesses, policy makers, non-government organisations, regulators, farmers, advisors, students and schools."
        },
        {
            "text": "The course is intensive, with a lot of good information coming thick and fast. Day one started at 10am, which luckily gave me time to get stuck in a cow traffic jam on the way! There were 18 of us on the course, plus two very friendly Jack Russells, Toby and Teddy, owned by course leader Joe Stanley."
        },
        {
            "text": "Joe is a former farmer and author of the book ‘Farm to Fork: The Challenge of Sustainable Farming in 21st Century Britain’. He’s incredibly knowledgeable and infectiously passionate about his subject, which made the training extremely engaging and thought provoking."
        },
        {
            "text": "We started off by discussing the challenges faced by farmers: climate change, trade, agricultural inflation, labour shortages and complex grants. He introduced us to different farming methods, the pros and cons of traditional versus more ecological, organic and regenerative farming, the possible pitfalls associated with the use of pesticides and relation to the potential success of schemes like the Sustainable Farming Incentive."
        },
        {
            "text": "Game management and predator control was led by Jemma Clifford, who discussed the unexpected connection between the conservation of native songbirds and organised pheasant shoots. We were shown the various techniques used by gamekeepers for controlling predators and the importance of doing so from an ecological perspective. We went for a tour of the farm and were shown different soil treatment options including pesticides, fertilisers and the benefits of sheep, alongside new experiments to lock in greenhouse gasses like ‘bio char’."
        },
        {
            "text": "On day two, Joe talked to us about the importance of biodiversity and the huge role farmers play in providing ecosystem services (72% of the UK is farmland). Joe explained some unintended consequences for increasing the efficiency of farm technology, for instance harvesters now spill less grain, meaning that wild bird populations cannot benefit and are declining as a result. He also discussed the differences that can be made by landowners by making changes on small-scale farms (bird population) against larger global issues which require much wider changes (insect population). We took another walk out into the surrounding fields with John, an ecologist who showed us the moth monitoring systems, RPA funded wildflower borders under a Countryside Stewardship agreement, and the ponds and grassland habitats which benefit insects and the wider ecosystem."
        },
        {
            "text": "The last walk of the day showed us the benefits of native tree planting for the soil, ecosystem and atmosphere. We experienced the look, smell and texture of soil types and the difference between healthy and degraded soils. Joe also discussed carbon sequestration and an example of carbon offsetting in the form of a wildlife pond at Allerton, funded by housing developers in Cheshire! The course is a fascinating insight into the meaningfulness of what we do in RPA. The course brings to life the reality of what our payments support, and the important benefit it brings to the farming community, wildlife and the environment as a whole."
        }
    ]
}