{
    "url": "https://deframedia.blog.gov.uk/2024/05/24/high-court-ruling-on-farming-rules-for-water/",
    "title": "High court ruling on Farming Rules for Water",
    "authors": [
        "Defra Press Office"
    ],
    "categories": [
        "Environment Agency"
    ],
    "pub_date": "2024-05-24T14:47:50+01:00",
    "content": [
        {
            "text": "Today (24th May) the High Court has rejected all claims that the Environment Agency has failed to effectively enforce its Farming Rules for Water (FRfW)."
        },
        {
            "text": "In his ruling, Justice Dove found no fault with the Environment Agency’s approach to enforcing the Farming Rules for Water, noting that its approach has been ‘grounded in the correct interpretation of the 2018 Regulations’."
        },
        {
            "text": "This judgment reflects the important work being done by the regulator with farmers to reduce diffuse pollution and ensure compliance with regulatory obligations in the FRfW in order to protect England’s watercourses from agricultural pollution."
        },
        {
            "text": "The FRfW were drawn up in 2018 with input from agricultural and environmental stakeholders to build on the good progress that many farmers are already making to tackle pollution as a result of their activities. The Rules set out that farmers are responsible for always taking reasonable precautions to minimise the risk of pollution from applications of nutrients to land and livestock management."
        },
        {
            "text": "If breaches of these regulations are identified, the Environment Agency will not hesitate to take appropriate action, up to and including enforcement."
        },
        {
            "text": "An Environment Agency spokesperson said:"
        },
        {
            "text": "Farming Rules for Water are just one means of managing nutrient load. Further key actions include:"
        },
        {
            "text": "Follow Defra on Twitter, and sign up for email alerts here."
        }
    ]
}