{
    "url": "https://hmlandregistry.blog.gov.uk/2024/05/24/how-sharing-your-experience-helps-to-improve-the-digital-registration-service/",
    "title": "How sharing your experience helps to improve the Digital Registration Service",
    "authors": [
        "Simon Herd, Senior User Researcher"
    ],
    "categories": [
        "Customer research",
        "Digital services"
    ],
    "pub_date": "2024-05-24T14:49:38+01:00",
    "content": [
        {
            "text": "HM Land Registry’s Digital Registration Service (DRS) was launched in 2021 to enable customers to submit their applications online. We now process just over 1.5 million applications per year, with more than 6,000 customers. "
        },
        {
            "text": "Since 2021, we have made countless upgrades to the service, including early checks to flag errors and expanding the range of applications our customers can use DRS to submit to us. "
        },
        {
            "text": "None of these changes could have happened without the involvement of conveyancers, legal professionals and other DRS users. "
        },
        {
            "heading": 2,
            "text": "User research – a heartfelt thank you! "
        },
        {
            "text": "If you are a DRS user you may have been invited to participate in user research to help improve the service. We would like to say a heartfelt thank you to all who have taken part. If you would like to take part in future research to shape the service, we’d love to hear from you. "
        },
        {
            "heading": 2,
            "text": "Your input has shaped DRS for the better "
        },
        {
            "text": "Each time a customer submits an application, we invite them to take part in a short survey.  This helps us understand what’s on their mind and what matters most to customers.  "
        },
        {
            "text": "At the end of each month we review every comment received and prioritise them into the planned upgrades we’ll make in the next quarter."
        },
        {
            "text": "The recent introduction of greater edit capabilities is a perfect example of how customers’ feedback via this survey helped us make the case for these important changes. Your feedback made it a priority, which justified allocating some of our finite development resource onto it.  "
        },
        {
            "heading": 2,
            "text": "Designing to complement, not disrupt "
        },
        {
            "text": "User research with customers influenced how we designed our ‘colleague access’ feature. We surveyed DRS users and also ran user sessions to understand more about how you worked and the extent to which collaboration was needed. You told us that being able to complete the application of a colleague who was off sick or had left the firm was vital to ensuring your work could carry on."
        },
        {
            "text": "We took your ideas and preferences and created an open model, allowing you to access and complete draft applications from anyone within your business unit, as well as nominating colleagues to take on applications. This ensured it would work in the way you needed it to, adding capability without any unnecessary new barriers. "
        },
        {
            "heading": 2,
            "text": "What’s next "
        },
        {
            "text": "Through user research you are helping to steer upcoming enhancements. In the DRS survey you told us that you couldn’t add additional parties such as executors to applications. We created designs to support this and tested these with DRS users (including those who’d raised the issue). This is in development now and should start to be launched in the next few months. "
        },
        {
            "text": "We’ve also tracked feedback on the way DRS asks you to categorise the application (by selecting a transaction type from a long menu). This information is used for a range of purposes, including defining the questions we ask, the fees applicable, as well as routing your application to the right caseworkers. We understand that the way we ask you to specify a transaction type does not always meet your needs and we are looking at further changes to make it easier and more capable. DRS users will be involved to ensure we progress the best ideas and then to test them to ensure they are usable. "
        },
        {
            "heading": 2,
            "text": "Work with us to design the future of DRS "
        },
        {
            "text": "We thank all our participants for making a difference.  "
        },
        {
            "text": "We will continue to develop DRS to respond to the needs and challenges faced by customers in submitting their applications to us. By being in the vanguard, you have a great opportunity to influence how that happens. "
        },
        {
            "text": "This could include looking at early prototypes and other ideas we’re considering, and sharing your thoughts and experiences. "
        },
        {
            "text": "If you would like to get involved, or just hear more about our user research on DRS, please get in touch with us at drs-ur@landregistry.gov.uk or offer your views via the DRS live survey. "
        }
    ]
}