{
    "url": "https://icsdigital.blog.gov.uk/2024/05/24/introducing-ics-digital/",
    "title": "Introducing ICS Digital",
    "authors": [
        "Karl Hoods - Group Chief Digital & Information Officer for DESNZ and DSIT, ICS Digital"
    ],
    "categories": [
        "Information"
    ],
    "pub_date": "2024-05-24T10:31:05+01:00",
    "content": [
        {
            "text": "Integrated Corporate Services (ICS) is an innovative approach to delivering central functions within the Civil Service."
        },
        {
            "text": "The opportunity arose from the Machinery of Government changes that split up the Department for Business, Energy, and Industrial Strategy (BEIS) and created the Departments for Energy Security & Net Zero (DESNZ), Science, Innovation & Technology (DSIT), and Business and Trade (DBT)."
        },
        {
            "text": "Bringing together Commercial, Digital, Estates, Finance, Human Resources and Security teams has not been done before. The decision to do this meant a chance to look at improving and future proofing core services."
        },
        {
            "text": "It is a step towards a future Civil Service that sees us investing in skills, making sure people have the tools they need to innovate, and empowering staff to take on risks, stripping back unnecessary hierarchy and bureaucracy."
        },
        {
            "heading": 2,
            "text": "Building for the future"
        },
        {
            "text": "The mission for the Integrated Corporate Services is “To provide high-quality, expert and efficient corporate services that enable our departments to deliver for the public”."
        },
        {
            "text": "Within ICS Digital, we have a specific team to help facilitate implementation of our new Target Operating Model.  From defining what it will be, to how it will work, the team have been working with colleagues across Digital to bring in these new ways of working."
        },
        {
            "text": "As well as embedding good agile and design processes, it allows us to really make use of the skills we already have within our department. We’re making sure we document as we go and have regular show and tells so everyone can get involved if they’re interested."
        },
        {
            "heading": 2,
            "text": "ICS Digital – our values"
        },
        {
            "text": "As digital and data experts, we advise, guide and help deliver the right outcome for our customers and theirs.  We do this by being:"
        },
        {
            "heading": 2,
            "text": "Our new blog"
        },
        {
            "text": "We can do all these wonderful things, learn new skills and be a great place to work, but if we don’t tell anyone, how would you know?"
        },
        {
            "text": "For example, did you know – not only does DSIT look after AI policy, innovation is a value for all staff, so we’re exploring with DSIT colleagues how to use AI and automation to simplify the mundane in lots of different projects."
        },
        {
            "text": "That’s why we’ve created this new blog – to keep up to date with what is happening in ICS Digital. You can expect to see monthly (or more frequent) updates on exciting projects we’ve been working on, new technologies we’re exploring, what makes us great to work for, challenges we’ve faced and hopefully overcome."
        },
        {
            "text": "We’re keen to start the conversation, get others involved, share our wisdom and seek answers to how others may have dealt with the same challenges we face."
        },
        {
            "text": "So tune in, sign up for updates, and keep in touch."
        }
    ]
}