{
    "url": "https://mattersoftesting.blog.gov.uk/making-the-move-to-digital-for-training-logs/",
    "title": "Making the move to digital for training logs",
    "authors": [
        "Chris Price"
    ],
    "categories": [
        "Annual training and assessment",
        "MOT testing service"
    ],
    "pub_date": "2024-05-24T16:41:54+01:00",
    "content": [
        {
            "text": "In our April special notice (02.24), we set out the changes we’re making to how you need to record your annual training going forwards. Since the 2022/2023 training and assessment year finished in April, we have added the functionality for you to record your training digitally via MTS.  "
        },
        {
            "text": "As we go into the new training year, I want to remind you that all new training for this year will need to be captured on your digital training log.  "
        },
        {
            "heading": 2,
            "text": "Providing a modern service"
        },
        {
            "text": "DVSA’s strategy and vision set out our commitment to providing a better, more modern and efficient service for all our customers. Part of this is improving the digital services we offer and making them the default option where we can.   "
        },
        {
            "heading": 2,
            "text": "Improving sustainability"
        },
        {
            "text": "I blogged last year about what we’re doing to cut down on paper within the MOT, starting with asking you to consider whether you need to print a copy of a customer's MOT pass certificate for example. The move to digital training logs is part of this wider ambition to be more sustainable where we can.   "
        },
        {
            "heading": 2,
            "text": "Making it easier for you"
        },
        {
            "text": "As the paper used for training logs can sometimes be damaged or lost, this change will make it quicker and easier for you to access your training from different locations when it’s convenient. It also makes it easier for you to show any DVSA colleagues your training log. We carried out lots of user research before making this change, to make sure the new log was easy to use and worked for testers. "
        },
        {
            "heading": 2,
            "text": "Where to record training in MTS"
        },
        {
            "text": "To record training, you will need to access the training log section within your MTS profile. This will then give you the option to record the amount of time you spent training, what you covered and what you learnt. Most of you will have already had a look through this new section, but if you haven’t, I’d encourage you to familiarise yourself with it.  "
        },
        {
            "text": "We know some of you use external training providers to complete your training, who may have provided a training record for you. On the new system you will need to enter your record of this training yourself, so it captures what you have individually learnt.  "
        },
        {
            "heading": 2,
            "text": "Sharing your training record with others"
        },
        {
            "text": "From the middle of June, we will be releasing additional functionality to the service to allow others within your organisation, such as your Authorised Examiner Designated Manager (AEDM) or authorised examiners (AE), to view others' training logs.  "
        },
        {
            "text": "We will provide this information by vehicle test station (VTS), then by testing class, to make it easy for you to find the right tester’s log.  "
        },
        {
            "text": "We know many managers have found our new tool to extract tester annual assessment results in an excel spreadsheet format really useful. We’re working over the next few months to make the same available for viewing training log information in bulk. We’ll let you know once we’ve made these additional changes live. "
        },
        {
            "text": " We hope these changes will make it easier, and more efficient for you, as we move through this year's annual training year. "
        }
    ]
}