{
    "url": "https://moderncivilservice.blog.gov.uk/2024/05/24/meet-the-modern-civil-service-carol-bernard/",
    "title": "Meet the Modern Civil Service: Carol Bernard",
    "authors": [
        "Government Reform"
    ],
    "categories": [
        "A Modern Civil Service",
        "Ambitious",
        "Capability",
        "Government Reform",
        "Interview",
        "Modernisation and Reform",
        "Operational Delivery",
        "Proud Civil Servant"
    ],
    "pub_date": "2024-05-24T15:00:20+01:00",
    "content": [
        {
            "text": " "
        },
        {
            "text": "What does A Modern Civil Service mean to you? "
        },
        {
            "text": "It means a number of things. I'm part of the Government People Group so for me, A Modern Civil Service is all about people. Within the Civil Service we have highly capable and engaged civil servants, as a modern Civil Service we are helping civil servants develop further capability and identify skill gaps. This helps to create the right environment to enable us to really deliver great services for the public. "
        },
        {
            "text": "A personal journey through the Civil Service"
        },
        {
            "text": "I was just reflecting back this morning on my career as it started in the public sector. I began my career in youth and community work, and it just comes back to the same thing for me: it's about supporting local communities and creating life chances for people."
        },
        {
            "text": "I trained as a social worker in the probation service. Since joining the Civil Service, I've had some amazing roles; I’ve worked on the Olympics, and in the Ministry of Justice, Ministry of Defence and within the Cabinet Office. "
        },
        {
            "text": "I’ve always found that my line managers have encouraged me to be myself in the Civil Service, and I think that started very early on in my career. As one of my early line managers said, it's about bringing your best self to work. And I would share that advice with everyone; be authentic, be yourself. Someone said to me a few years ago “Carol, your difference is your superpower.” I'm a northerner. I'm a black woman. I came from a working class background, which is not the typical civil servant that I have always seen."
        },
        {
            "text": "Within the Civil Service, you realise there's a lot of difference and a lot of people with different experiences, different backgrounds and different ways of thinking about the world. So when this colleague said that, it kind of reminded me that if you bring your authentic self to work, bringing all your diversity, whatever that might be, it will enable us to develop, to deliver the best service for communities, the public and for civil servants as well. "
        },
        {
            "text": "The impact of supportive line managers"
        },
        {
            "text": "The best line managers that I've had have taken the time to know me as a person. I’ve mentioned differences and that's so important when you're different from other people in your team. They've got to know me as a person and they have identified the support that would help me deliver a better service. So for example, when I became a chief probation officer, my line manager at the time put me in touch with some experienced chief probation officers, as part of an action learning set. This meant I could actually learn from them directly and gain that valuable insight and experience."
        },
        {
            "text": "Another line manager gave me space to work on my deliverables with regular check-ins. I’ve also been empowered and enabled by previous line managers to create change within departments and organisations."
        },
        {
            "text": "A supportive line manager is someone that gets alongside you, works to understand you, and creates opportunities for you to thrive in. A line manager should also support you when things don’t go to plan and work with you to find a solution. "
        },
        {
            "text": "How do leaders inspire ambitious behaviours in new and existing line managers?"
        },
        {
            "text": "One thing leaders can do is understand the motivations from within their team. In turn, leaders should have confidence that they receive clear direction from their own line manager while also inspiring the same behaviours in their supporting teams. But you also have to be a manager that challenges your colleagues to be their best and see their potential and really listen. Another thing that’s important is to show vulnerability and that means sometimes admitting you don't know all the answers.  "
        },
        {
            "text": "Creating new Line Management Standards for the Civil Service"
        },
        {
            "text": "I set out to create something that recognised the importance of line management and what managers in the Civil Service can offer. My aim has been to create a system that everyone was clear on, understanding what the expectations, opportunities and the training and development offers are. "
        },
        {
            "text": "Within the Standards, we have produced a clear pathway of continuous improvement and opportunities. The Standards have got three levels, core, advanced and executive. The core level is the standard that all civil service line managers will be expected to deliver.  "
        },
        {
            "text": "We ensured that there was a robust evidence base to support the Standards. We identified an academic institution in order to develop standards that would be world class. We also worked with the Chartered Institute of Personal Development and Chartered Management Institute to develop them and University East Anglia for our evaluation framework."
        },
        {
            "text": "We did a significant amount of research across departments. We worked with HR teams to understand existing best practice and we also had conversations with line managers and colleagues to identify what was going well and what needed to be improved upon. We road tested the Standards with over 500 civil servants from across a wide range of departments. We've involved a plethora of people and groups to ensure the Standards are representative and really serve line managers and civil servants. "
        },
        {
            "text": "I have to say, our Civil Service colleagues have been absolutely amazing. We've worked very closely with HR teams, occupational health, and civil servants — people have been really generous with their time. We found that the quality of the line management experience is absolutely crucial to employee experience. We learned from the research what affects delivery performance and business outcomes — this is all about how we can better deliver for the public. Research showed that high capability line management equals higher performance and better outcomes. "
        },
        {
            "text": "As a Civil Service, we are continually looking at productivity, how we can do things differently. And we know that having great line managers is one of the most significant things that we can do. "
        },
        {
            "text": "The essential qualities of a capable Civil Service line manager"
        },
        {
            "text": "When developing the standards, we talked to a lot of civil servants, and there were several things that came out of those discussions: communication, empathy, purpose and outcomes."
        },
        {
            "text": "We found that civil servants would value communication around the purpose of the organisation and their team as well as clear outcomes their line manager requires. Civil servants also want to be challenged by their line managers but also to be managed with empathy. Managers reflected on the importance of creating space and time to prioritise line management activities. I would say, listen, listen, listen, and reflect. It's important to provide feedback and also be open to receiving feedback. So there's some active listening, reflecting, being able to provide feedback and clear direction. "
        },
        {
            "text": "The listening is not just about listening in the line management relationship, it's listening to colleagues and it's learning from colleagues as well. I’m excited to see how the Line Management Standards will help people and help inform their journey along the way. "
        }
    ]
}