{
    "url": "https://naturalengland.blog.gov.uk/2024/05/24/our-natural-health-service/",
    "title": "Our Natural Health Service",
    "authors": [
        "Natural England"
    ],
    "categories": [
        "Connecting People with Nature",
        "Education",
        "Mental health and wellbeing",
        "Natural England"
    ],
    "pub_date": "2024-05-24T13:20:23+01:00",
    "content": [
        {
            "text": "By Esther Smith, Senior Adviser, Health and Environment, Yorkshire and North Lincolnshire Area Team"
        },
        {
            "text": "The links between health and nature have arguably never been clearer."
        },
        {
            "text": "The healing power of nature is taking centre stage for people’s health and nature’s recovery – and in my role at Natural England I’m lucky enough to see that first-hand."
        },
        {
            "text": "One of our Nature Recovery Projects (NRP) is helping to highlight the importance of connecting people with nature for the sake of their well-being."
        },
        {
            "text": "I’ve recently been working alongside colleagues on the innovative Bradford and the South Pennines Nature Recovery Project. Part of this work has been to plan for a prospective National Nature Reserve in West Yorkshire so as part of our planning and research we asked more than two thousand people for their “top three” reasons for visiting a green space. More than half named benefits to physical and mental health."
        },
        {
            "text": "The NRP also supports a “Nature Therapy” project within the Bradford District Care NHS Foundation Trust’s hospital and community mental health services."
        },
        {
            "text": "Nature Therapy is any therapeutic activity that involves connecting with nature – outside and even inside. The project includes activities including gardening, decorating bird boxes and the use of virtual reality to increase connection with nature for health benefits."
        },
        {
            "text": "We have worked with the Yorkshire Wildlife Trust to help train staff to use 5 pathways to nature: contact, emotion, beauty, meaning and compassion so that they can make use of nature with patients, even when going outside is not an option. Flash cards have been used to great effect to help patients make more informed decisions about taking part in Nature Therapy. These cards show a range of activities such as gardening and walking in nature. On the back of each card is information on what those activities involves – who you do them with, what benefits they can bring you (relaxation, a new skill, etc.).  To make it even more interactive there is an interest checklist which can be ticked off by the patient. This also provides a record of activities and how helpful they have been that can be reflected on by both staff and patients."
        },
        {
            "text": "In parallel, areas within the hospital grounds such as gardens and courtyard areas are being transformed into urban oases for local nature recovery. On one site alone, 260 trees are being planted, courtesy of the NHS Forest, to create a thriving natural space for patients, visitors and staff, with environmental benefits such as heat spot and air pollution reduction. Already we are seeing staff, patients and visitors coming up with new uses and activities for these spaces, such as herb gardening."
        },
        {
            "text": "Therese Patten, Bradford District Care Trust’s Chief Executive, said:"
        },
        {
            "text": "“We know that being active outdoors is good for all of us, but it can be particularly beneficial for mental wellbeing. We have pockets of green therapy across our hospital and community services, but we want to test the benefits of connecting patients with nature as part of their care plans. We know from smaller projects that patients feel calmer when they’re involved in nature-based activities, and their feedback is overwhelmingly positive.”"
        },
        {
            "text": "As part of this project, we have even been able to bring nature ‘inside’ for our patients to help them recover. Using innovative virtual reality, we have run sessions which provide a ‘nature experience’ from within hospital wards. This involved putting on a headset and having a choice of places to visit, from woodlands full of birdsong to a relaxing beach which sparked happy memories. Once in the virtual environment users can see and hear everything all around them and have the option to move to different areas within that location using the controller.  We’ve had very positive feedback from patients. This is a great example of the ways in which Natural England’s Nature Recovery Projects are connecting people with nature – even from within a hospital’s walls.  Our work with the University of Bradford has helped us to understand more about how nature therapy might link with virtual reality research."
        },
        {
            "text": "Bird box decorating sessions were also a hit, with three quarters of patients reporting an improvement in both positive mood and nature connection.  Patients discussed the different local birds that might use the houses and are keen to keep an eye out for the birds. Staff have told me that they are exploring the idea of installing a camera in one of the boxes to watch the activity inside."
        },
        {
            "text": "There is still work to be done so that patients can continue Nature Therapy and to explore diversity and inclusion implications so as many people as possible can benefit."
        },
        {
            "text": "But Nature Therapy is gaining recognition in the Bradford NHS Trust. Every single doctor said that they would like to refer their patients for Nature Therapy.  A webpage has been established on the internal Trust internet with details of a “secret garden”, seed library, gardening equipment and the gardening activities available at the hospital café."
        },
        {
            "text": "This is just the tip of the iceberg but thankfully there are other great projects up and down the country reaping the benefits of connecting people with nature for the good of their health."
        },
        {
            "text": "A similar project, as part of Natural England’s Sussex Nature Recovery Area, is trialling the training of 22 NHS staff in nature-based interventions, working with young people with complex mental health issues. They have had a combination of in-person and online training over 5 months. They are all enthusiastic about bringing their therapy group outside and have self-organised a community of practice to support each other and bid for shared kit."
        },
        {
            "text": "NHS Ambulance Fairfields outside of York is another fantastic example of the way in which NHS estates can be used to support nature recovery. Living willow gazebos provide welcome spots for nature connection for the hardworking NHS Ambulance staff who work from the site. Alexis Percival, Yorkshire Ambulance Service, Sustainability Manager, invited staff to use their volunteering time to dig ponds, plant fruit trees and create dead hedges for wildlife, in particular, planting Tansy to encourage the iconic local Tansy Beetle. This links to wider nature recovery work in York Vale."
        },
        {
            "text": "It's been a fantastic start. Our nature recovery work will continue to grow and help more new partnerships for people and nature to flourish, for the health and wellbeing of all."
        },
        {
            "text": "Learn more about NHS Forest’s plans for healthcare sites, bringing nature closer to people: Biodiversity plans for healthcare sites - NHS Forest"
        },
        {
            "text": "Our Green Social Prescribing programme also offers many opportunities for therapies which connect people with nature. Find out more here: NHS England » Green social prescribing"
        }
    ]
}