{
    "url": "https://rpc.blog.gov.uk/2024/05/24/rpc-provides-greater-transparency-on-government-impact-assessments/",
    "title": "RPC provides greater transparency on  Government Impact Assessments",
    "authors": [
        "Stephen Gibson"
    ],
    "categories": [
        "Better regulation",
        "Independent scrutiny"
    ],
    "pub_date": "2024-05-24T13:51:09+01:00",
    "content": [
        {
            "text": "The Regulatory Policy Committee assesses the quality of Government Impact Assessments (IAs). We publish our opinions on IAs, which state whether the department’s estimate of the direct costs of the measure and the assessment of the impacts on small and micro businesses is fit for purpose or not; we also rate the quality of the assessment of: ‘rationale and objectives’, ‘cost-benefit analysis’, ‘wider impacts’, and ‘monitoring and evaluation’ (these are rated either ‘good’, ‘satisfactory’, ‘weak’ or ‘very weak’)."
        },
        {
            "text": "While our ratings and quality assessments are in the public domain, they sit in individual RPC opinions, it is therefore difficult to see trends in the data and to compare the performance of different departments. The Government’s White Paper on Smarter Regulation  (published last week) stated that it would “support the Regulatory Policy Committee to publish data that enables scrutiny of departments’ performance against the Better Regulation Framework”. We believe that the transparency and accountability that this provides will help to strengthen adherence to the Framework. We have therefore decided to publish a spreadsheet that summarises the key information across all of our published IA opinions since late 2020 (when we started using our current template)."
        },
        {
            "text": "We plan to provide similar information for our opinions on Post Implementation Reviews and also opinions on Options Assessments (after we transition to the new Better Regulation Framework)."
        },
        {
            "text": "The spreadsheet is now on the RPC website and a table summarising the ratings by department is below."
        },
        {
            "text": "Some interesting observations from the data in the spreadsheet include:"
        },
        {
            "text": "However there are many other inferences that can be drawn from the data. By all means comment below!"
        },
        {
            "text": " "
        },
        {
            "text": " "
        }
    ]
}