{
    "url": "https://icsdigital.blog.gov.uk/2024/05/24/tom-more-than-just-a-name/",
    "title": "TOM – more than just a name",
    "authors": [
        "Nindy Scott"
    ],
    "categories": [
        "How we work",
        "Information"
    ],
    "pub_date": "2024-05-24T10:31:33+01:00",
    "content": [
        {
            "text": "I’ve noticed that Digital folk seem to lean towards the side of direct communication, less fluffy and more matter of fact. It’s not surprising really when you think about it: they’re usually in reactive roles and so are juggling many different plates at the same time.  It also means that when they come together in a big group, they’re interested in defining the problems and finding the solutions quickly."
        },
        {
            "text": "In ICS Digital we all had our opinions on what problems needed to be fixed by our new ways of working – although I’m not sure we’d ever get consensus of what the priority for those should be."
        },
        {
            "text": "Now ordinarily, that’s good – having an engaged team that all want to fix things. But with our two new departments being set up, having to onboard 1000s of staff, create new secure systems for each, dealing with staff from different departments having different knowledge levels of what processes and governance they should be following but all wanting to try new things, as well as us not having defined processes for everything…..we needed a team that could help push forward the changes, so we didn’t lose momentum or direction."
        },
        {
            "text": "Thankfully, we have TOM: a team that are helping us to find our way, look at the problem as a whole and work with everyone to find solutions that will improve how we work."
        },
        {
            "text": "Ultimately the aim is to provide functions to our science and energy departments in an agency type way - making sure our key roles are resourced correctly and supplementing other areas with contractors as needed."
        },
        {
            "heading": 2,
            "text": "So who or what is TOM in ICS Digital?"
        },
        {
            "text": "You’ve probably heard of Target Operating Models before – they’re strategic frameworks defining how an organisation will meet its business objectives. In ICS Digital, it’s the word you’ll hear mentioned whenever there’s something that needs to be fixed with how we work. It encompasses all the work everyone is doing to bring in change to our ways of working."
        },
        {
            "text": "There are 7 streams of work within TOM, all with a roadmap for the way forward."
        },
        {
            "text": "These are:"
        },
        {
            "text": "I’m sure we’ll be blogging about TOM more in the future, including what we’ve learnt, how we measured success and what challenges we faced."
        },
        {
            "heading": 2,
            "text": "Managing change well?"
        },
        {
            "text": "This is a marathon, not a sprint (even though we’re breaking the work into sprints) so everyone is at different stages of coping with change.  The project is expected to last multiple years as we continue to iterate and improve on our processes."
        },
        {
            "text": "After a prolonged period of uncertainty, another good thing about this project is that whether you want to be part of finding the solution or just want to be told what the new way of working is – that’s fine. The day job keeps going on around us all, but hopefully by the end, even if you’ve not decided to engage, you’ll be working in a team that is more joined up and effective."
        },
        {
            "text": "As a digital business partner, I’m at the front end of all these changes.  My team will be the first point of contact whenever someone in either departments wants a new “thing”. We’re also changing the way that we work in our team, to adopt a more account management approach. So we can get in on the conversations a lot earlier, improve Digital understanding within the departments and be a point of escalation when things aren’t going to plan."
        },
        {
            "text": "What does that mean for me? Well surprisingly, it means that after 25 years in the civil service, it turns out I’m not quite as cynical as I thought I was. I have a lot of hope that the TOM will achieve what is intended and we’ll get rid of a lot of the pain points we’ve already identified."
        },
        {
            "heading": 2,
            "text": "Want to know more?"
        },
        {
            "text": "Let us know in the comments what you are interested in and we’ll try to make sure future blogs include this."
        },
        {
            "text": "If you’re another government department that wants to find out more about our TOM work and how it relates to other wider governance standards or are considering embarking on your own similar project and want to know how we’ve done it, please contact Garry Crowley."
        }
    ]
}