{
    "url": "https://civilservice.blog.gov.uk/2021/08/03/covids-impact-on-grief/",
    "title": "COVID’s Impact on Grief ",
    "authors": [
        "Adam Land, Senior Director at the Competition and Markets Authority"
    ],
    "categories": [
        "A great place to work",
        "A Modern Civil Service"
    ],
    "pub_date": "2021-08-03T09:05:30+00:00",
    "content": [
        {
            "heading": 3,
            "text": "As lockdown eases, life slowly returns to normal but for those bereaved, COVID has wreaked a devastating impact. Part 4 in our Bereavement and Loss series by Adam Land. "
        },
        {
            "text": "Death during normal times is tough to cope with, however, during COVID, the grieving process was disrupted and sense of loss heightened. Cabinet Office Permanent Secretary Alex Chisholm recently spoke about the impact on civil servants touched by COVID and loss. Two colleagues have shared their personal stories with me, highlighting the impact.  "
        },
        {
            "heading": 4,
            "text": "Shagufta Sharif – Inclusion Lead, Department for Transport"
        },
        {
            "text": "My name is Shagufta and my Dad Mohammed Sharif passed away earlier this year. Dad arrived in the UK in the Seventies from Pakistan. He worked in the mills and set up a vibrant business with his entrepreneurial spirit. "
        },
        {
            "text": "Mohammed had four daughters and two sons and he instilled the passion for education in us all - with a focus on ensuring his daughters became independent, strong women. "
        },
        {
            "text": "Dad always said, “Money comes and goes but a good education stays with you forever.” He enforced equality at home, going against the norm in Pakistani homes back then. We all shared chores, responsibilities and leadership. My Dad is the reason I do the work that I do. "
        },
        {
            "text": "Mentor, guide and friend"
        },
        {
            "text": "My Dad the feminist was my mentor, guide and friend. Dad was passionate about equality and taught me to see blessings every day. He was spontaneous, hard-working, charitable and kind. He had strong morals and always advocated doing the right thing over the easy option. Dad taught me about women’s rights in Islam - not the view of Islam the general public is often privy to. "
        },
        {
            "text": "Ramadan"
        },
        {
            "text": "My Dad died in the blessed month of Ramadan and when he passed away, he left an enormous wedge in our hearts. "
        },
        {
            "text": "COVID had a huge impact on our grieving process. As Muslims, funerals take place very quickly after death. My Dad’s death was unexpected, he died of a heart attack on Thursday and was buried next day. Burial is normally followed by three days of mourning – an opportunity for everyone to pay their respects, mourn with you and support you. "
        },
        {
            "text": "It allows you to grieve to your heart’s content, cry and let it all out. During COVID, mourning is taking a greater toll on us all. The support systems that would normally help pull you get through aren’t there. Phone calls can never replace hugs."
        },
        {
            "text": "Family attending the funeral was restricted and nobody was able to visit our home and mourn with us. We are six siblings, and being together with our Mum is what we all needed, yet that had to be limited. "
        },
        {
            "text": "A couple of months on, our pain remains raw. Relatives and friends wishing to pay their respects must do so separately. Every time I meet someone again, the pain is relived over and over again. "
        },
        {
            "text": "My Dad’s brother was unable to attend the funeral, and with Pakistan on the red list, he had to quarantine alone in a hotel, before he could reach us. I can’t imagine how tough that was for him."
        },
        {
            "text": "All of us need to go back to work and get on with life, however, it feels like there’s unfinished business."
        },
        {
            "heading": 4,
            "text": "Laura Murfin – Organisational and Employee Development Consultant, Her Majesty’s Land Registry"
        },
        {
            "text": "My father-in-law, Brian, aka Grandad Lion to his grandchildren, died of Covid-19 on 15 April 2020. Brian had Alzheimer’s and was in a care home and initially we felt quite complacent. We couldn’t keep him safe at home, the care home locked down early, he’d be safe, we reassured ourselves. We quickly realised this wasn’t the case.\n"
        },
        {
            "text": "On Easter Sunday, Brian developed a temperature, then rapidly deteriorated. We couldn't visit, the hospital wouldn't admit him and the GP would only video call. By Wednesday he died. "
        },
        {
            "text": "The grieving process in that first lockdown was surreal - with none of the 'normal' markers of grief. We supported my mother in law from the doorstep, couldn't see the body and couldn’t accept childcare while we grieved. "
        },
        {
            "text": "There was a socially distanced funeral, no funeral cars, instead, we drove ourselves. The wake consisted of five of us spaced out in the garden with a flask of tea and a brandy each, but even that bent the tight restrictions.\n"
        },
        {
            "text": "Robbed of goodbye"
        },
        {
            "text": "This odd ‘arms-length’ grieving process has been tough, especially as COVID remains so pervasive. Although Brian was vulnerable, he was in good shape physically, still recognised us all and got pleasure from our visits. We weren't ready to write him off.  We feel cheated how fast the end came, robbed of the opportunity to say goodbye. "
        },
        {
            "text": "Laura and Shagufta found that sharing their loss provided comfort and I want to thank them both. I hope they provide you with some comfort."
        },
        {
            "text": "If you’ve been bereaved during COVID, your colleagues will be supportive so don’t be afraid to seek help. "
        }
    ]
}