{
    "url": "https://dluhcdigital.blog.gov.uk/2021/08/03/new-fund-to-enhance-community-engagement-in-planning/",
    "title": "New fund to enhance community engagement in planning",
    "authors": [
        "Digital Planning"
    ],
    "categories": [
        "Digital Planning",
        "PropTech"
    ],
    "pub_date": "2021-08-03T09:00:28+01:00",
    "content": [
        {
            "text": "The Digital Planning team at MHCLG are delighted to announce the new PropTech Engagement Fund, set up to support the PropTech sector and local authorities to accelerate adoption of technology that will enhance community engagement and deliver a modern planning system. "
        },
        {
            "heading": 3,
            "text": "Planning for the Future"
        },
        {
            "text": "The Planning for the Future White Paper set out a vision to increase the use of digital engagement within the planning process, to make the planning system more accountable and democratic by offering alternative routes to engage alongside traditional forms of engagement. An Expression of Interest launches today for local authorities who would like to apply for funding to run a digital engagement pilot addressing one of four themes.   "
        },
        {
            "text": "The PropTech Engagement Fund will begin with engagement around the plan-making process and development management, key areas of consultation where digital can help broaden the range of voices being heard. We recognise there is an emerging market offering digital citizen engagement tools and services; these council-led funded projects will enable us to better understand the barriers to be overcome to allow local authorities to adopt these tools at scale."
        },
        {
            "heading": 3,
            "text": "Funding up to 12 digital engagement pilots"
        },
        {
            "text": "Pioneering local authorities have already been incorporating digital into their engagement plans, but it is not yet standard practice and national guidance has not kept pace with technological developments. Through the fund activities and projects supported, MHCLG will work with local authorities to help establish best practice and scope requirements for digital engagement guidance."
        },
        {
            "text": "This round of funding will provide 10-12 local authorities with up to £100k each for their selected project. Local authorities will then be able to procure a supplier to work with on their engagement project, utilising the range of innovative tools that are available in the market. We will support local authorities to use G-Cloud or Spark DPS for procurement, with assistance for commercial teams as well."
        },
        {
            "heading": 3,
            "text": "Q&A session and how to apply"
        }
    ]
}