{
    "url": "https://space.blog.gov.uk/2021/08/03/the-night-sky-in-august/",
    "title": "The night sky in August",
    "authors": [
        "Derek Smale"
    ],
    "categories": [
        "Astronomy"
    ],
    "pub_date": "2021-08-03T11:18:00+01:00",
    "content": [
        {
            "text": "If you’ve been thinking about trying a night of star-gazing, August is the perfect month to try."
        },
        {
            "text": "This month, you can see the Sun, Moon, and brightest planet Venus set in the west, watch gas giant planets Jupiter and Saturn rise in the east, see the summer constellations and Milky Way overhead, and see one of the most spectacular meteor showers in the calendar."
        },
        {
            "text": "Anyone up in the early hours of the morning can also see the re-appearance of the autumn constellations, rising in the east before dawn."
        },
        {
            "text": " "
        },
        {
            "heading": 3,
            "text": "The Perseid Meteor Shower"
        },
        {
            "text": "Around the middle of August each month, the Earth’s journey around the Sun intersects with the orbit of another object, Comet Swift-Tuttle.  This comet is a 26km (16 mile)-wide ball of rock and ice with a very eccentric, or elongated orbit, passing closer to the Sun than the Earth, but extending out beyond Pluto in our outer-Solar System."
        },
        {
            "text": "Every 133 years or so as this comet approaches the inner part of its orbit, the heat and radiation from the sun causes fragments of rock, ice, gas and dust to break off, leaving a stream of debris behind it."
        },
        {
            "text": "When our planet travels through this debris each year, the fragments heat up rapidly in our atmosphere to temperatures of around 1,600 degrees Celsius (3,000 Fahrenheit), streaking across the sky at around 58km (36 miles) per second, as meteors of the Perseids meteor shower."
        },
        {
            "text": "Last seen in 1992, there are records of Comet Swift-Tuttle being observed by Chinese astronomers more than 2,300 years ago.  Its size makes it the largest known object to directly cross Earth’s path around the Sun and it has therefore, understandably, been the focus of a great deal of research."
        },
        {
            "text": "Thankfully it appears to pose no threat to Earth for the next 1,000 years at least, though its next pass through the inner Solar System will be remarkably close to Earth in galactic terms. In 2126, Comet Swift-Tuttle, which is ten times the size of Comet Neowise (see photograph), will pass just over 10 million miles from Earth. It will be a truly phenomenal sight."
        },
        {
            "text": "Perseid meteors can be seen all month, though greater numbers are expected between 9 and 16 August, and between 60 and 100 meteors an hour can be spotted at the peak of the shower, which this year is expected to fall between 11 and 13 August."
        },
        {
            "text": "This year the peak of the shower falls in the week after the new Moon (which falls on 8 August), and with very little light from the Moon, it should be possible to see more of the fainter meteors."
        },
        {
            "text": " "
        },
        {
            "heading": 4,
            "text": "Meteor shower observing tips "
        },
        {
            "text": "Wishing you clear skies and lots of meteors!"
        },
        {
            "text": " "
        },
        {
            "heading": 3,
            "text": "A good month for planet hunters"
        },
        {
            "text": "With brightest planet Venus visible soon after sunset in the west, and gas giants Jupiter and Saturn rising shortly after that in the east, it’s a great month to look out for the planets of our Solar System. Look low in the west after sunset on 11 August in particular, to see a 10% illuminated slice of Moon chase Venus to the horizon."
        },
        {
            "text": "At distances of 600 million kilometres (370 million miles) and 1,340 million kilometres (830 million miles) from Earth respectively, Jupiter and Saturn are both at ‘opposition’ this month, the point where the two planets are closest to Earth in their orbits around the Sun, meaning they appear at their biggest and brightest."
        },
        {
            "text": "If you have powerful binoculars, you may get a glimpse of tiny points of light near to Jupiter.  These are the four Galilean moons, Io, Europa, Ganymede and Callisto, first discovered by Italian astronomer Galileo Galilei in 1610."
        },
        {
            "text": "Those with small telescopes will be able to see these more clearly, and may also be able to see the bands in Jupiter’s atmosphere, as well as the Great Red Spot, a storm more than twice the size of planet Earth, that’s been raging for over 350 years!"
        },
        {
            "text": "Telescopic views of Saturn will reveal the beautiful rings of ice that orbit the planet, and may also reveal coloured banding on the planet itself, the result of winds travelling over 1,800km/h (1,000mph)."
        },
        {
            "text": "Did you know:  There is currently a NASA mission called ‘JUNO’ in orbit around Jupiter.  For more information and some stunning photographs, check out https://www.nasa.gov/mission_pages/juno/."
        },
        {
            "text": "Look out on the evenings from 18 August to see an increasingly illuminated Moon form a line with, and then slide past Saturn (on 20 August) and then Jupiter (on 21 August)."
        },
        {
            "text": "As the Moon appears full on the night of 22 August sitting to the left of the gas giants, look towards the horizon beneath the Moon to see bright star Fomalhaut. This star is around twice the size of our Sun, and is actually the brightest of a system of three stars that orbit each other, around 25 light years away from us."
        },
        {
            "text": "Scientists have also photographed a mass of dusty material orbiting Fomalhaut, and are seeking to establish whether this is a planet being formed from within the dust cloud, or one (or more) that has previously been destroyed in a collision with another object."
        },
        {
            "text": "Fomalhaut is sometimes referred to as the Autumn Star, and along with the re-appearance of the Pleiades star cluster in the east in the early hours of the morning, is very much a sign of the approaching season that will be discussed more in next month’s blog!"
        },
        {
            "text": " "
        },
        {
            "heading": 3,
            "text": "Spotting the Space Station(s)"
        },
        {
            "text": "There are only a couple of visible passes of the International Space Station (ISS) this month, just before dawn in the last few days of August."
        },
        {
            "text": "With China having launched their own space station, the Tiangong or ‘Heavenly Palace’, earlier this year, this too can be seen though it is much more challenging to find.  It is much less bright and only appears very briefly, low above the horizon from UK skies.  You can find timings for passes of these objects from your location at https://www.heavens-above.com/."
        }
    ]
}