{
    "url": "https://phescreening.blog.gov.uk/2021/08/03/what-we-blogged-about-in-june-and-july-2021/",
    "title": "What we blogged about in June and July 2021",
    "authors": [
        "Jonny Fertray"
    ],
    "categories": [
        "General information"
    ],
    "pub_date": "2021-08-03T13:45:13+01:00",
    "content": [
        {
            "text": "Here is a round-up of each and every Public Health England (PHE) screening blog post published in June and July 2021. There were 21 in total."
        },
        {
            "heading": 2,
            "text": "Abdominal aortic aneurysm (AAA) screening"
        },
        {
            "heading": 3,
            "text": "Virtual clinical skills trainers and quality assurance leads (AAA) regional networking events"
        },
        {
            "text": "Register now for a regional AAA networking event in September."
        },
        {
            "heading": 2,
            "text": "Breast screening"
        },
        {
            "heading": 3,
            "text": "Tomosynthesis – training requirement update for staff reporting images"
        },
        {
            "text": "The training requirements for staff reporting digital breast tomosynthesis images within the NHS breast screening programme have been revised."
        },
        {
            "heading": 2,
            "text": "Diabetic eye screening"
        },
        {
            "heading": 3,
            "text": "Excellent new video underlines importance of attending NHS diabetic eye screening"
        },
        {
            "text": "A new short film emphasises the importance of attending regular diabetic eye screening (DES) for everyone living with Type 1 and Type 2 diabetes."
        },
        {
            "heading": 2,
            "text": "Fetal anomaly screening programme"
        },
        {
            "heading": 3,
            "text": "NIPT rolls out to all areas of England as part of the existing NHS screening pathway for Down’s syndrome, Edwards’ syndrome and Patau’s syndrome"
        },
        {
            "text": "All maternity providers across England are now offering non-invasive prenatal testing (NIPT) as part of the existing NHS screening pathway for Down’s syndrome, Edwards’ syndrome and Patau’s syndrome."
        },
        {
            "heading": 3,
            "text": "New ‘all-in-one’ FASP handbook published"
        },
        {
            "text": "The newly updated handbook is now available in HTML format, making it easier to use and keep up to date."
        },
        {
            "heading": 3,
            "text": "New image review tool for ultrasound practitioners"
        },
        {
            "text": "An image review tool has been developed to help the screening support sonographer working in antenatal screening to review ultrasound images of nuchal translucency and crown rump length."
        },
        {
            "heading": 3,
            "text": "Easy guide for Down’s syndrome, Edwards’ syndrome and Patau’s syndrome screening updated thanks to expert users"
        },
        {
            "text": "An updated easy guide has been published that explains NHS screening for Down’s syndrome, Edwards’ syndrome and Patau’s syndrome, including information about non-invasive prenatal testing (NIPT)."
        },
        {
            "heading": 2,
            "text": "General information"
        },
        {
            "heading": 3,
            "text": "Cancer Research UK’s role in supporting health professionals on informed choice in NHS screening"
        },
        {
            "text": "In this guest blog, CRUK explains how health professionals have an important role to play in supporting people to make an informed choice to access cancer screening."
        },
        {
            "heading": 3,
            "text": "A big thank you to NHS screening services"
        },
        {
            "text": "This blog thanks everyone working in the young person and adult screening programmes for the huge efforts made during the COVID-19 pandemic."
        },
        {
            "heading": 3,
            "text": "Updated screening information for GPs and other primary care staff"
        },
        {
            "text": "Public Health England has updated its screening information for GPs and practice staff on GOV.UK."
        },
        {
            "heading": 3,
            "text": "NHS antenatal screening standards data report 2019 to 2020 published"
        },
        {
            "text": "We are pleased to publish our third NHS antenatal screening standards data report."
        },
        {
            "heading": 3,
            "text": "25 years on: how the UK NSC has transformed screening for the better"
        },
        {
            "text": "The UK National Screening Committee is celebrating its 25th anniversary. Dr Angela Raffle looks back at its creation and how it has transformed screening for the better."
        },
        {
            "heading": 3,
            "text": "Lay members wanted for antenatal and newborn screening programmes research advisory committee"
        },
        {
            "text": "The research advisory committee (RAC) reviews applications to carry out research involving NHS screening programme participants or requiring access to screening data or samples."
        },
        {
            "heading": 3,
            "text": "Celebrate the first International Neonatal Screening Day today, 28 June 2021"
        },
        {
            "text": "Professional and patient organisations and health systems around the world celebrate International Neonatal Screening Day for this first time."
        },
        {
            "heading": 3,
            "text": "Supporting informed choice in NHS screening – a view from Cancer Research UK"
        },
        {
            "text": "Public Health England Screening asked Cancer Research UK to tell us about their work on informed choice. Sophia Lowes, a health information manager at CRUK, tells us more."
        },
        {
            "heading": 3,
            "text": "Inequalities consistently addressed in quality assurance visits to local NHS screening services"
        },
        {
            "text": "A national audit of quality assurance visits to local screening services found that SQAS teams consistently address inequalities in visits across all screening programmes."
        },
        {
            "heading": 3,
            "text": "New guidance on improving access to NHS screening programmes for people with learning disabilities"
        },
        {
            "text": "New national guidance for health professionals to support people with learning disabilities to understand and access the NHS screening programmes."
        },
        {
            "heading": 3,
            "text": "Thank you, thank you, thank you – what you do makes a difference"
        },
        {
            "text": "A message recognising the huge contribution of all staff who work so hard to deliver the NHS antenatal and newborn screening programmes."
        },
        {
            "heading": 2,
            "text": "Infectious diseases in pregnancy screening"
        },
        {
            "heading": 3,
            "text": "Integrated Screening Outcomes Surveillance Service (ISOSS) reports published"
        },
        {
            "text": "We are pleased to announce the publication of the first annual ISOSS report, and a one-off retrospective report into congenital syphilis."
        },
        {
            "heading": 2,
            "text": "Newborn and infant physical examination"
        },
        {
            "heading": 3,
            "text": "Call for practitioners in neonatal and infant cardiology"
        },
        {
            "heading": 2,
            "text": "Newborn blood spot screening"
        },
        {
            "heading": 3,
            "text": "New inherited metabolic disease (IMD) information leaflets have been published on GOV.UK"
        },
        {
            "text": "PHE has public information leaflets for all NBS conditions, including the IMDs, to support parents throughout screening and diagnosis."
        },
        {
            "heading": 2,
            "text": "Other new and updated publications"
        },
        {
            "text": "Other new publications we published in June and July included:"
        },
        {
            "text": "Other existing publications we updated in June and July included:"
        },
        {
            "text": "Please use the ‘show all updates’ link at the bottom of each publication to see what’s new."
        },
        {
            "heading": 2,
            "text": "PHE Screening blog"
        },
        {
            "text": "The PHE Screening blog provides up to date news from all NHS screening programmes. You can register to receive updates direct to your inbox, so there’s no need to keep checking for new blogs. If you have any questions about this blog article, or about population screening in England, please contact the PHE screening helpdesk."
        }
    ]
}