{
    "url": "https://companieshouse.blog.gov.uk/2021/08/03/working-for-companies-house-leadership/",
    "title": "Working for Companies House: leadership",
    "authors": [
        "Spencer Vignes - Campaigns Manager",
        "Louise Smyth - Chief Executive and Registrar of Companies",
        "John-Mark (JM) Frost - Director of Transformation and Delivery",
        "Michelle Wall - Director of Finance"
    ],
    "categories": [
        "People and culture",
        "Working at Companies House"
    ],
    "pub_date": "2021-08-03T15:13:57+01:00",
    "content": [
        {
            "text": "At Companies House, we like to think of ourselves as an inclusive, innovative and welcoming employer, one that supports people and encourages them to ‘find their passion’ by developing their skills and careers. But don’t just take our word for it. Here, our series of features in which employees reflect on what makes Companies House so special concludes with 3 members of the executive team – Chief Executive Louise Smyth, Director of Transformation Delivery John-Mark Frost, and Director of Finance Michelle Wall."
        },
        {
            "text": "There’s an old saying that the Civil Service is at its best when it reflects the diversity of the country it serves and understands what the people of that country needs.  "
        },
        {
            "text": "While we at Companies House would never claim to be perfect, we are without doubt an arm of the Civil Service that always strives to do the right thing. "
        },
        {
            "text": "What exactly is our role? Companies House makes information contained on the formal register of all companies in the UK available to a wide range of users including: "
        },
        {
            "text": "Those users can then make important decisions based on that information. "
        },
        {
            "text": "As for our staff? We come from all walks of life, backgrounds and cultures. And we’re proud of it. "
        },
        {
            "text": "Take Louise Smyth, Chief Executive of Companies House, for instance. Louise started her working life as a trainee manager at McDonalds which, in reality is not so different from her current position. "
        },
        {
            "text": "“There are so many parallels between the 2 roles,” says Louise. “Whether you are chief executive of Companies House, as I am now, or a trainee manager at McDonalds, as I was then, your job is all about managing people and delivering good service. "
        },
        {
            "text": "“I’m basically steeped in the people side of things and have been ever since I walked into McDonalds on my very first day. "
        },
        {
            "text": "“Before coming to Companies House in 2017, I spent 26 years at the Intellectual Property Office working across a whole range of different positions from human resources to chief operating officer. I was also the Director of Digital for 3 years which gave me a really good insight, and prepared me well, to begin the transformation process that we’ve been going through at Companies House. A process that is based around our vision of brilliant people using brilliant systems to deliver brilliant services.”  "
        },
        {
            "text": "So what, in Louise’s opinion, is so unique about Companies House? “I always say it’s magical. I’ve never worked anywhere that has such a positive attitude. There’s a willingness to try new things and think differently that does not exist elsewhere. That, together with our absolute commitment to our customers, just really blows me away.” "
        },
        {
            "text": "Hailing from what he describes as “the middle of nowhere” in Wales, John-Mark Frost, Director of Transformation Delivery at Companies House, was the first person from his family ever to go to university. "
        },
        {
            "text": "In 2018, having spent 13 years in various roles across both the public and private sectors and with a young family to support, John-Mark decided that he wanted to strike a better work/life balance. Which is where Companies House came in. "
        },
        {
            "text": "“It’s a fantastic organisation to work for, one in which the culture genuinely exudes from everything it does,” says John-Mark.  "
        },
        {
            "text": "“That culture is really important in terms of how we work together, but it also helps us serve our customers and deliver really great, brilliant services that make a real difference to the citizens of the UK. "
        },
        {
            "text": "“Companies House is like one huge family consisting of talented, dedicated people who are incredibly passionate about their roles and the difference they can make. From my perspective, I simply could not ask for anything else. "
        },
        {
            "text": "“Many years ago, when I was just starting out in my career, a mentor of mine told me that I had longer left to work than I’d been alive, so I’d better find something that I really enjoy doing. At Companies House, I’ve found that something.” "
        },
        {
            "text": "Michelle Wall, Director of Finance at Companies House, agrees wholeheartedly with John-Mark in terms of the positive culture and the people. For her, it’s also the thrill of being able to make a real contribution through the Civil Service to the health of the British economy.  "
        },
        {
            "text": "“You sometimes hear people say that we’re just a register – but Companies House is so much more than just a register,” says the Swansea University management science graduate, who qualified as an accountant and gained valuable experience working across different industries before joining Companies House in 2018. "
        },
        {
            "text": "“For relatively small amounts of money, in the context of government, investments in us can deliver good value. Recent research into the value of our register identified that it’s worth between £1 billion and £3 billion to the UK economy. If Companies House can increase the register’s value by just 5%, then that’s an annual increase to the economy of £150 million. "
        },
        {
            "text": "“The contribution we make to the economy is enormous, but internally our culture and community are, in my opinion, unrivalled. I never imagined when moving to Companies House that it would be such a rewarding experience. The culture and engagement of the whole team means that every day is fun and productive. "
        },
        {
            "text": "“I’ve been really lucky in that I’ve had a good career in the Civil Service, one that I’ve been able to build upon as the years have gone by. I’m attracted to the values of the Civil Service and the opportunity to do public service.  But I also sincerely believe that, within the Civil Service, there is no better place to be than Companies House.” "
        }
    ]
}