{
    "url": "https://buyingforschools.blog.gov.uk/2025/04/02/a-new-way-to-buy-energy-for-your-school-or-trust/",
    "title": "A new way to buy energy for your school or trust",
    "authors": [
        "Bel Pennington, DfE Energy for schools lead"
    ],
    "categories": [
        "Advice and support",
        "Services"
    ],
    "pub_date": "2025-04-02T11:55:10+01:00",
    "content": [
        {
            "text": "In this blog post, Bel Pennington, who leads the Energy for Schools pilot at DfE, tells us why changing the way schools and trusts buy energy could save money, and protect school budgets from the volatility of the energy market."
        },
        {
            "text": "In September 2022 energy prices hit a record high. Homes and businesses across the country were impacted – and so were the many schools and trusts whose energy contracts were due to be renewed around that time. Many were locked into long term, fixed price contracts at a time when the energy prices were at their peak. This would have a serious impact on those schools’ budgets for years to come."
        },
        {
            "text": "The Get help buying for school team was able to help some schools and trusts negotiate contract extensions with existing suppliers, but it was obvious it was a priority for the Schools Commercial Team at DfE to look for a longer-term solution to offer better protection from this unregulated part of the market."
        },
        {
            "text": "Energy prices have increased, and the long-term outlook is for prices to remain high with the market continuing to be susceptible to volatility. Most schools currently have fixed term, fixed price contracts. Whilst offering some certainty in pricing they are inherently risky and leave a school exposed to whatever the daily rate is upon their contract expiry; in the case of the 2022 crisis schools adopting this method of buying their energy saw their bills more than double."
        },
        {
            "text": "My colleagues, working closely with the energy industry, began to look at which suppliers and types of contracts could offer schools the best deal."
        },
        {
            "text": "We know energy procurement for schools is challenging due to the complexities they face navigating the market, volatile prices and the reliance on third party intermediaries."
        },
        {
            "text": "Energy whilst a commodity is volatile and complex to purchase with many options of contract types, suppliers, additional service elements like half hourly meters to mention just a few."
        },
        {
            "text": "We undertook a research project to understand more about what was available to schools including the scope of services offered, using both surveys and interviews to help us understand the challenges and complexities faced and how could DfE help."
        },
        {
            "text": "This research identified the main pain points for schools which included:"
        },
        {
            "text": "• It was hard to determine whether a good energy price deal had been achieved• Difficult to compare prices of energy deals• Brokers get better rates from energy providers than schools do directly• Energy price volatility• Locked into expensive contracts that are difficult to get out of• Fast turnarounds for making decisions on energy deal proposals"
        },
        {
            "text": "We obviously recognised that schools needed to achieve a good price on their energy contract so that they can keep costs down, but looking more widely at the features of a DfE Energy for schools service, we explored what the key features of the service could look like with users. These included:"
        },
        {
            "text": "• Pricing and Benchmarking• Account management• Contract Management• Onboarding support• Metering• Dashboards"
        },
        {
            "text": "Following the research phase we needed to run a pilot. We identified three key objectives for delivery of DfE Energy for schools pilot:"
        },
        {
            "text": "• Simplifying the buying of energy• Reducing the risk to schools in what is largely an unregulated market• Securing best value"
        },
        {
            "text": "In our pilot we have embedded these user needs with the aim of providing schools with information to understand the cost of the deal, whether it is competitive in the wider market, detail on how prices are calculated and identify the level of risk associated with this deal. "
        },
        {
            "text": "We began an energy pilot with 1,500 schools across 50 MATs of different sizes and geographical locations, to see if our preferred solution on paper would save schools as much money as we predicted."
        },
        {
            "text": "All of the schools in the pilot used a 3rd party to manage their energy contract procurement, half were using a fixed price contract and half a flexible contract."
        },
        {
            "text": "The results were impressiveUsing a Crown Commercial Service (CCS) Energy contract, the same contract that all government departments including the DfE use, schools taking part saved on average 36%* on energy costs."
        },
        {
            "text": "Whilst this contract is flexibly priced, rather than fixed, some of the energy is bought up front, during the 30 months prior to delivery and then during the delivery period itself. This helps to level out the peaks and troughs in price variances."
        },
        {
            "text": "How does it work?Essentially, schools are joining the DfE’s existing energy contract. The DfE become the ‘contracting authority’ and help schools to onboard to the new contract. Schools continue to get their own energy usage data and pay their own bills direct to the supplier."
        },
        {
            "text": "You can add additional sites during the contract. You will just need to provide site information, and they can be added to the DfE account like any other school in your trust."
        },
        {
            "text": "It is a rolling contract, and to terminate your contract you will need to give 30 months, plus a minimum of 15 working days notice.  You can only terminate within 1 month if the building is sold, demolished or change of tenancy. "
        },
        {
            "text": "What next?We hope that now we have proved this option can deliver savings during the pilot, that more schools and trusts will review their options for energy as and when their contracts come up for renewal."
        },
        {
            "text": "To get further information about how your school or trust can access the service, please email: DFE-Energy.SERVICES-TEAM@education.gov.uk"
        },
        {
            "text": "The DfE's approved Energy cost recovery service can also help you understand your energy bills, conduct historical audits to identify any anomalies or billing errors and recover any mistakenly paid funds."
        },
        {
            "text": "*Percentage saving is based on what schools actually paid versus what they would have paid under the DfE contract."
        },
        {
            "text": "If you’ve found this article useful and want to learn more about how we’re supporting schools, click ‘sign up and manage updates’ to subscribe to our blog and receive notifications when we next post."
        }
    ]
}