{
    "url": "https://services.blog.gov.uk/2025/04/02/adding-sustainability-to-the-government-design-principles/",
    "title": "Adding sustainability to the Government Design Principles",
    "authors": [
        "Rebecca Cottrell - Design Lead, NHS England",
        "Hazal Arpalikli, Senior Interaction Designer, GDS",
        "Mia Allers, Senior Graphic Designer, GDS"
    ],
    "categories": [
        "New lenses and perspectives",
        "Service Standard",
        "Service transformation"
    ],
    "pub_date": "2025-04-02T11:40:13+01:00",
    "content": [
        {
            "text": "Image: NASA"
        },
        {
            "text": "The Government Design Principles have been guiding the design for government services since their creation in 2012. They’re pithy, easy to remember, and can be easily applied."
        },
        {
            "text": "We’re adding a new design principle for sustainability. This will help teams take responsibility and ownership for the sustainability of services. It also starts to tie together existing work that is taking place to make information technology and services greener within government."
        },
        {
            "text": "The new principle is:"
        },
        {
            "heading": 2,
            "text": "How we created the principle"
        },
        {
            "text": "This work grew out of a small community group looking at design and sustainability at the Government Digital Service (GDS). We knew we needed to look more broadly outside our department, so we set up a working group. We recruited people from across the government, from different disciplines, departments and organisations. We facilitated 2 workshops: the first around design principles: how they’re used in general, and how a design principle around sustainability might be used. We used this list of ingredients to draft the principle, which we then took into a second workshop for critiquing, editing and rewriting. "
        },
        {
            "text": "This principle provides a starting point for practitioners from all user centred design (UCD) roles to ensure that their services take short and long term environmental impacts into consideration. The principle encourages small, achievable action on what can be considered an overwhelming and intimidating topic. It reminds practitioners of the power and influence they hold by designing services."
        },
        {
            "text": "The first and most important aspect of this principle is to remind practitioners that digital services are made up of tangible materials and require energy and resources to run. We have found that many people consider the internet, the cloud and digital environments to be 'ephemeral' and often do not take their materiality into account. There can be an assumption that ‘digital is free’. By putting this materiality front and centre, we are prompting practitioners to reframe their thinking and take the same approach that they would to more real-world services."
        },
        {
            "text": "This builds on other work around sustainability that's happening in GDS, including measuring the climate impact of our digital services at GDS and developing a set of principles for the design and delivery of greener services."
        },
        {
            "heading": 2,
            "text": "The bigger picture of sustainability in government"
        },
        {
            "text": "Aside from adding a new principle, many more things are going on to make government services more sustainable. Defra has created a set of principles for greener services, the NHS created their own design principle for sustainability, GOV.UK One Login is focusing on delivering a green service by measuring their impact. We also have new guidance in the Service Manual on Environmentally sustainable services."
        },
        {
            "heading": 2,
            "text": "How you can get involved"
        },
        {
            "text": "Take part in the UK Government Digital Slack #planet-centred-design design community group."
        }
    ]
}