{
    "url": "https://gfie.blog.gov.uk/2025/04/02/thanks-to-the-gfie-scheme-we-were-fortunate-not-to-miss-out-on-welcoming-such-a-talented-capable-and-dedicated-team-member-someone-who-has-truly-become-a-valued-asset-to-our-organisation/",
    "title": "A talented, capable, and dedicated team member; someone who has truly become a valued asset!",
    "authors": [
        "karlharvey1"
    ],
    "categories": [
        "#GFIEsuccessstory",
        "Autism",
        "Inclusion",
        "Life Chance Recruitment",
        "Neurodiversity"
    ],
    "pub_date": "2025-04-02T15:00:00+01:00",
    "content": [
        {
            "text": "World Autism Awareness Day (Wednesday 2nd April 2025) is dedicated to raising awareness about Autism and promoting acceptance, inclusion, and support for Autistic People."
        },
        {
            "text": "To celebrate World Autism Day and Autism Acceptance Month throughout April, this blog edition provides an update of some of the things we are doing across Government in supporting Autistic People which includes the Autism Exchange Internship Programme (AEIP), the GFiE Scheme for Autistic People and the Cross Government Autism Network."
        },
        {
            "heading": 3,
            "text": "Civil Service Autism Exchange Internship Programme"
        },
        {
            "text": "The Civil Service Autism Exchange Programme (AEIP), in partnership with charity Ambitious About Autism, offers paid quality work experience to autistic young people."
        },
        {
            "text": "The programme offers individuals the opportunity to learn new work skills while providing career development and networking advice. In exchange, participants teach managers and government departments about autism awareness. Interns undertake an 8 week paid employment within a government department throughout the Summer, with this year's programme starting at the end of June 2025."
        },
        {
            "text": "Annual recruitment is run through the Ambitious About Autism, with opportunities advertised on the Ambitious About Autism Webpages here. "
        },
        {
            "text": "For any Civil service departmental queries only, please contact the Internship team at Diversity.internships@cabinetoffice.gov.uk."
        },
        {
            "heading": 3,
            "text": "GFiE Scheme for Autistic People"
        },
        {
            "text": "The GFiE Scheme for Autistic People offers employment opportunities across the civil service working with the Civil Service ‘Autism Exchange Internship Programme’, to ensure that departments can retain interns and bring brilliant new voices into the Civil Service."
        },
        {
            "text": "Roles offered via the scheme are on a Fixed Term Appointment (FTA) for a minimum of 12 months, with an option to extend for up to 2 years. There may be opportunities for permanent employment after the first 12 months of the appointment.  "
        },
        {
            "text": "Below we hear from some of the GFiE Scheme Candidates and a Departmental Line Manager about the impact of the GFiE Scheme for Autistic People. "
        },
        {
            "heading": 3,
            "text": "GFiE Life Chance Schemes"
        },
        {
            "text": "The Civil Service has over 20 Going Forward into Employment (GFiE) Life Chance Schemes in operation across Government, using innovative approaches to recruitment and providing Individuals from a wide range of backgrounds, and who face barriers to employment, with opportunities and experience.  You can find out more about GFiE at our Civil Service Careers Page  www.civil-service-careers.gov.uk/about-gfie/"
        },
        {
            "text": "If you would like to discuss providing life changing opportunities for  live vacancies, or vacancies you have coming up in the future, please get in contact with us at GFiE@cabinetoffice.gov.uk"
        },
        {
            "heading": 3,
            "text": "Cross Government Autism Network "
        },
        {
            "text": "The Cross Government Autism Network is a Civil Service staff network."
        },
        {
            "text": "The network's mission is to improve the experiences of autistic Civil Servants and to support non-autistic allies in the Civil Service."
        },
        {
            "text": "The network delivers a range of projects including workshops about supporting autistic colleagues please email us to find out more crossgovautismnet@gmail.com"
        },
        {
            "text": "You can also find more details about what we do at our .gov.uk page."
        },
        {
            "text": " "
        }
    ]
}