{
    "url": "https://naturalengland.blog.gov.uk/2025/04/02/welcoming-the-corry-review-nature-recovery-and-sustainable-growth-through-regulatory-reform/",
    "title": "Welcoming the Corry Review — Nature recovery and sustainable growth through regulatory reform ",
    "authors": [
        "Oliver Harmar"
    ],
    "categories": [
        "Development",
        "Growth",
        "Nature",
        "Nature Recovery"
    ],
    "pub_date": "2025-04-02T08:00:22+01:00",
    "content": [
        {
            "text": "The Corry Review was set up by Defra Secretary of State Steve Reed, in October last year to examine whether the inherited regulatory landscape is fit for purpose and to develop recommendations to ensure that regulation across the Department is driving economic growth while protecting the environment. "
        },
        {
            "text": "Today sees the publication of the Review’s findings and 29 recommendations for reforms and improvements to the way regulation is designed and implemented. We welcome the report as a vital step towards a fresh approach to regulation that delivers for growth and nature recovery at scale. "
        },
        {
            "text": "Natural England has led the way with new approaches to enabling growth while protecting nature such as District Level Licencing, the Thames Basin Heath Approach and the Nutrient Mitigation Scheme.  "
        },
        {
            "text": "Many of the recommendations echo what we said to the review, reflect our practical experience and strongly align with our new strategy and our proposals for investment through the current Spending Review. "
        },
        {
            "text": "We’ve built a great relationship with Dan Corry and the review team, and we are ready for the next steps "
        },
        {
            "text": "We supported the review team with information about examples raised by others, made a joint site visit with the Area Team to Thames Basin Heaths to demonstrate the highly successful regulatory approach there to mitigate recreational disturbance to the SPA from new housing plus our case for nature recovery as an essential component of sustainable growth.  "
        },
        {
            "text": "Many of our messages are picked up in the report and supported by the recommendations "
        },
        {
            "text": "We said: "
        },
        {
            "text": "What next? "
        }
    ]
}