{
    "url": "https://dcmslibraries.blog.gov.uk/2016/09/02/keeping-libraries-relevant-and-enhancing-community-wellbeing/",
    "title": "Keeping libraries relevant and enhancing community wellbeing",
    "authors": [
        "Cllr Ian Stewart"
    ],
    "categories": [
        "Good practice",
        "Library news"
    ],
    "pub_date": "2016-09-02T12:00:49+01:00",
    "content": [
        {
            "text": "[Editors note: This blog was written by Cllr Ian Stewart following Kathy’s visit to libraries in Cumbria]"
        },
        {
            "text": "Cumbria is a large rural county, internationally known for being the home of the Lake District National Park. With a population of around half a million residents, and let’s not forget the 42.9 million visitors to Cumbria in 2015, we have a rare mix of medium-sized towns (and the city that is Carlisle) amongst small villages and vast open spaces."
        },
        {
            "text": "The challenges of delivering a library service in this geographic footprint are exacerbated by the current funding constraints within local government. Additionally we all have the challenge of ensuring that these wonderful places are relevant to this day and age. Libraries have always been places of knowledge, learning, and understanding, as well as a place for seeking entertainment (don’t anyone try and tell me that reading a good book isn’t entertainment of the highest order) and cultural experiences. Let’s keep it so, and make sure that they continue to deliver opportunities for our residents to increase, improve, and maximise their wellbeing."
        },
        {
            "text": "Wellbeing is something we all care about, and as to be expected there is plenty of information available in Cumbria libraries which helps people have greater understanding about their health and well-being. Yet we know that there is much more that can be achieved, especially by working in partnership. Thus, working with one of our local NHS Trusts we will be celebrating “Older People’s Day” on 30th September in Whitehaven Library by hosting an event that will give health checks, as well as advice and support, to help promote active ageing."
        },
        {
            "text": "This is able to happen because not only do we see a library as having a pivotal role within our communities, but we also make sure that it has a pivotal role within our council. To do this we have library services that are open and outward facing, not inward or “reverential”. The skills of engagement with people which are core to many library functions are needed by the whole council in these times of change. The listening skills of library staff, allied to a deep knowledge of their community can also be harnessed and utilised to make that community a better place for all."
        },
        {
            "text": "So if you want drama workshops, Murder Mystery evenings, even Pokemon Go parties, go to a Cumbria library. If you want to build your job-searching skills, or find volunteering opportunities, go to a Cumbria library. If you know someone who is one of the 12% of the population that won’t get anywhere near this blog because they’ve never touched a computer keyboard, tell them to go to a Cumbria library."
        },
        {
            "text": "This last point takes us towards a personal passion: the crucial role that libraries have in bridging the digital divide. Neither the fact that Cumbria libraries have won awards for their digital engagement work, nor our Google Digital Garage experiences are for now. For now, quite simply, we have great people doing a wonderful job with commitment, enthusiasm, and innovation. I am proud of having Cumbria cabinet responsibility for “Community Services” and I am especially grateful for the work done by of our library staff."
        },
        {
            "text": "Note: this blog was also published on Public Sector Executive"
        },
        {
            "text": "-------------------------------------------------------------------\nPlease note, this is a guest blog. Views expressed here do not necessarily represent the views of DCMS or the Libraries Taskforce"
        }
    ]
}