{
    "url": "https://vmd.blog.gov.uk/2024/11/23/unza-vmd-postgraduate-programme-evaluating-prescribing-practices-for-treating-mastitis-in-cattle/",
    "title": "UNZA-VMD postgraduate programme: evaluating prescribing practices for treating mastitis in cattle",
    "authors": [
        "Sannah Malik",
        "Claire Gilbert"
    ],
    "categories": [
        "Antimicrobial Resistance (AMR)",
        "VMD News"
    ],
    "pub_date": "2024-11-23T09:00:00+00:00",
    "content": [
        {
            "text": "In our second interview with students participating in the UNZA-VMD postgraduate programme, we spoke to Amon Bwalya, who is undertaking a MSc. This programme is a collaboration supporting students and research in Zambia."
        },
        {
            "text": "More details about this partnership can be found in UNZA-VMD postgraduate programme: Improving antimicrobial stewardship in Zambia – Veterinary Medicines Directorate. "
        },
        {
            "text": "In this blog we learn about his research looking into how antibiotics are accessed in Zambia for the treatment of mastitis in dairy cattle."
        },
        {
            "text": "Please start by telling us about your career so far"
        },
        {
            "text": "I am a Master’s student (MSc-Veterinary Public Health) at The University of Zambia, School of Veterinary Medicine, under the Department of Disease Control. I am grateful for the award of the UNZA-VMD scholarship, which intends to evaluate the prescribing practices of veterinary medicines for treating mastitis in dairy cattle among non-veterinary personnel in Lusaka and Chongwe districts of Zambia."
        },
        {
            "text": "I am a veterinarian by profession, with a Bachelor's degree in veterinary medicine from The University of Zambia. Following my graduation (2019), I have served as a small animal clinician, animal welfare organization veterinarian, agroveterinary responsible person (veterinarian and consultant) as well as dairy animal veterinarian. My wide knowledge of experience provides a link among the fields veterinary medicine, agriculture and public health. Thus, this gives me an opportunity to ensure responsible antimicrobial use (AMU) through regulating non-prescription sale of veterinary medicines. Hence, my research will generate evidence-based insights that will inform policy reforms, regulatory interventions, and public health strategies to promote responsible antimicrobial use and mitigation of risks of antimicrobial use (antimicrobial resistance), thus improving animal health and animal welfare in the dairy industry."
        },
        {
            "text": "Could you describe the research you are doing for your PhD and how you shaped your research questions?"
        },
        {
            "text": "The core aim of my research is to reduce the non-prescription sale and dispensing of veterinary medicines among non-veterinary personnel in dairy cattle. My research questions, were structured around the Simulated farmer (SF) survey approach which allows the researcher to collect reliable data regarding the non-prescription sale of medicines without alarming prescribers. The approach was adopted from the human medicine setup."
        },
        {
            "text": "How did you develop your research—who has influenced your thinking?"
        },
        {
            "text": "My research has been developed through a combined effort from researchers of different expertise from both human and veterinary medicine fields.  Dr. Mudenda Steward and Dr. Ethel M’kandawire as supervisors provided so much needed help in developing the research questions. Also, Dr. Catrina Prince, from the VMD provided supervisory and technical expertise regarding my research work."
        },
        {
            "text": "What has your research shown so far? "
        },
        {
            "text": "So far, the findings from the preliminary data collected revealed the evidence of non-prescription sale and dispensing of veterinary medicines for treating mastitis in dairy cattle among non-veterinary personnel. Preliminary findings have shown that agroveterinary and retail pharmacy attendants can sell and dispense veterinary medicines without a prescription as long as the products are stocked. The findings revealed that the majority of the prescribers were willing to dispense the products without asking about the symptoms of the disease, previous medication used to treat the infection and possible symptoms to look out for in case of future infections. The study also revealed that the non-veterinary personnel did not give further instruction regarding the duration of treatment, route of administration and withdrawal period for the products dispensed, thus resulting in a high chance of future antimicrobial resistance (AMR) cases."
        },
        {
            "text": "Additionally, the findings revealed that penicillin products were the most prescribed antimicrobials for treating mastitis in dairy cattle followed by oxytetracycline products."
        },
        {
            "text": "What impact do you hope your work will have?"
        },
        {
            "text": "This study will generate evidence-based insights that will inform policy reforms, regulatory interventions, and public health strategies to promote responsible antimicrobial use and mitigation of the risks of antimicrobial use, improve animal health and welfare in the dairy industry.  Reducing non-prescription sale and dispensing of veterinary products will reduce the impact of AMR in both humans and animals that result from consumption of antimicrobial residues from milk products."
        },
        {
            "text": "How do you think the scholarship will benefit your long-term career and impact?"
        },
        {
            "text": "This scholarship provides with an opportunity to be one among future national and global impactors in the One Health aspect, thus reducing the effects of AMR resulting from non-prescription sale and dispensing of veterinary medicines, and emergence of zoonotic diseases, and other related infectious diseases. It is also a stepping stone for me as it paves a way for my future academic excellence as I wish to pursue a PhD in the same field, and perhaps contribute to the future research success of this country."
        },
        {
            "text": "Any thoughts on the global perspective—what can we all learn from each other (e.g., UK-Zambia partnership, One Health collaboration at UNZA)?"
        },
        {
            "text": "This collaboration is a recommendable move at a global level, for it provides a ground for combating and/or reducing the impact of AMR.  AMR is a global threat, hence knowledge acquired from the UK-Zambia partnership may result in developing strategies and much needed surveillance systems that will promote responsible antimicrobial use (AMU) through regulating the non-prescription sale of veterinary medicines."
        }
    ]
}