{
    "url": "https://naturalengland.blog.gov.uk/2023/01/24/a-blueprint-for-a-better-future-new-green-infrastructure-advice/",
    "title": "A blueprint for a better future: new Green Infrastructure advice",
    "authors": [
        "Alan Law"
    ],
    "categories": [
        "Biodiversity",
        "Climate change",
        "Mapping",
        "Mental health and wellbeing",
        "Natural England"
    ],
    "pub_date": "2023-01-24T16:32:43+00:00",
    "content": [
        {
            "text": "My connection with nature started when I was a small boy, aged 9, sat by a small pond no more than 10 feet across, watching sticklebacks swimming around in the weeds. As I sat there a kingfisher arrived and started fishing, right in front of me which was thrilling. That sense has never left me and has led to a career in nature conservation and a love of the outdoors. Green Infrastructure, for the many aware of it, conjures ideas of parks for recreation, wildlife rich spaces, trees that cool urban areas and channels in the floodplain that reduce flood risk. The common factor is that each is enjoyed by people for reasons that are important to them."
        },
        {
            "text": "Green Infrastructure puts people and nature together at the heart of towns and cities. Often these sorts of places are an important part of our everyday life but may not be deemed remarkable on any single merit; they can become lost to the needs of development. And sadly, over the last half century we have seen many such places lost to communities, filled in incrementally by planning that has delivered tidy and apparently efficient use of space, often squeezing out these important elements of nature and green spaces. Public benefit of parks and green spaces is valued at £28.7 billion p.a. - any loss of these spaces comes at a huge cost."
        },
        {
            "text": "When Covid struck, such places of peace and sanctuary were sought out by millions of people, each for the unique personal meaning that such access provided them. This quite instinctive response, from people of all backgrounds, has put a real spotlight on the true importance of time spent outdoors with nature for our health and wellbeing."
        },
        {
            "text": "Nature and green spaces are effectively a free resource for exercise, contemplation, birdwatching or fresh air, provided they are easily accessible close to where people live. This is especially important as the costs of everyday life go up. But the green spaces that remain aren’t evenly distributed across the country and, in many cases those with the greatest pressures in their lives had, and still have, the least opportunity to find release through nature."
        },
        {
            "text": "It doesn’t have to be like this, our Green Infrastructure tools provide the blueprint for a better future. Green Infrastructure, at one end of the spectrum, might involve parks of mature and high-quality habitat, like some of those run by the Corporation of London; new areas like these could take a century or more to establish. But nature fills open spaces with remarkable speed, and new green spaces can be created that quickly deliver multiple benefits for people. And this is the exciting thing for me about our work on green infrastructure – we really can deliver this quickly and affordably, in ways that can improve the quality of life for millions of people. We now have the tools that will enable planners, developers and people leading local nature recovery strategies to build better and more resilient communities and economies."
        },
        {
            "text": "The tools are a result of the Government’s 25 Year Environment Plan and have been overseen by a cross departmental steering group:"
        },
        {
            "text": "It only took a small pond and a couple of paths to some small, scrubby woods to spark my interest as a child; but it made a big difference. I’d like to think that any child in this country might have at least this much opportunity. And beyond childhood, that people of all ages and backgrounds in our towns and cities can have the spaces to enjoy nature, slow down and decompress from the urgency of their day to day lives. Such opportunity is a basic need - just as vital as the water we drink and the air we breathe, and as valuable as education and healthcare: an essential piece of infrastructure for life."
        },
        {
            "text": "The Green Infrastructure Framework will be launched on Tuesday 31st January with an online webinar. If you are interested in learning more, please see the link to register for a free ticket: https://greeninfrastructure.eventbrite.co.uk"
        }
    ]
}