{
    "url": "https://buyingforschools.blog.gov.uk/2023/01/24/join-a-new-training-pilot-to-help-you-manage-your-contracts-and-maximise-your-budget/",
    "title": "Join a new training pilot to help you manage your contracts and maximise your budget",
    "authors": [
        "Charlene Pink, Innovation Lead, DfE"
    ],
    "categories": [
        "Advice and support",
        "Services",
        "Uncategorized"
    ],
    "pub_date": "2023-01-24T10:15:35+00:00",
    "content": [
        {
            "text": "Charlene Pink is an Innovation Lead at the Department for Education and is currently working on a project which aims to give those who buy for their school the knowledge, skills and confidence to do so as effectively as they can. In this blog post, Charlene highlights a new training pilot which launches in February 2023.  "
        },
        {
            "text": "I’ve worked in the DfE’s Commercial Division since 2006, supporting different policy areas with their procurement activities. When an opportunity came up to join the enhancing schools’ commercial capability (ESSC) project team I jumped at the chance. I was keen to use my skills and experience to directly support school business professionals. "
        },
        {
            "text": "I’ve been working on the project since January 2022, supporting schools and multi-academy trusts (MATs) to develop their buying skills so that they can get greater value from their non-staff budgets. This is an ambitious project which aims ensure people who buy for schools and MATs in England are more confident and capable when dealing with suppliers and managing contracts."
        },
        {
            "text": "Contract Management Foundation Training  "
        },
        {
            "text": "One of my key priorities this year will be the contract management foundation training pilot. This pilot - which is free to join - will look at managing contracts at both an individual and organisational level. It aims to equip participants with the knowledge, skills and confidence they need to manage contracts effectively, maximising their budget to get the best value for their school or MAT.  "
        },
        {
            "text": "The pilot will test an existing contract management programme, training originally developed by the Cabinet Office for civil servants, with schools and MATs. We want to see whether it works in its current format or whether it needs some additional work to better meet the needs of people managing contracts in schools and MATs. Participants will play an important role in helping identify any possible areas where the training can be improved to better meet their needs.  "
        },
        {
            "text": "The training is suitable for anyone within a school or MAT who is responsible for managing contracts, not just those in a specific commercial role. Participants will leave the course with an understanding of all elements of the contract lifecycle and a broader understanding of the principles of contract management.  "
        },
        {
            "text": "How will the training be delivered? "
        },
        {
            "text": "The training and assessment are online, giving you the flexibility to learn at a time that best suits you. The training consists of 6 online modules which cover topics such as procurement and mobilisation, managing contract delivery and change control.  Each module should take between 1 and 3 hours to complete, and work can be saved so you don’t have to complete it in one go.  "
        },
        {
            "text": "Once a participant has worked through all the modules, they will complete an online assessment. This assessment is scenario based and if a participant does not pass a certain module, they can revisit the training and attempt the assessment again as many times as they need until they pass. "
        },
        {
            "text": "To make sure we get the insight that we need from this pilot, we will ask participants to complete a short (around 5 mins) survey before and after the training. "
        },
        {
            "text": "What are the benefits of the course? "
        },
        {
            "text": "Participants should leave the course better equipped to negotiate, manage and monitor contracted suppliers more effectively, to ensure their schools or MATs receive the goods and services they pay for at the quality they expect. "
        },
        {
            "text": "I’ve been really pleased with the positive feedback from learners who’ve already worked through the course, who have said they found the content really informative and that it highlighted the processes that all contract managers should be carrying out. "
        },
        {
            "text": "How to apply "
        },
        {
            "text": "The training will start in February and there are still places available.  "
        },
        {
            "text": "If you would like to express an interest in joining the pilot training, please send your name and job title to: ESCC.PROJECT@education.gov.uk by close of play Friday 3 February 2023. "
        },
        {
            "text": " "
        }
    ]
}