{
    "url": "https://environmentagency.blog.gov.uk/2023/01/24/preparing-for-future-droughts/",
    "title": "Improving drought situation - but the work doesn't stop here",
    "authors": [
        "Environment Agency"
    ],
    "categories": [
        "Climate change"
    ],
    "pub_date": "2023-01-24T16:35:43+00:00",
    "content": [
        {
            "text": "With above average rainfall in the last few months, and precautionary activity by water companies and abstractors, water levels are returning to normal across most of the country. Water storage reservoirs are rapidly refilling, and most river and groundwater levels are as expected for this time of year."
        },
        {
            "text": "However, getting back to normal isn’t going to be like a light that you can switch on or off. The environment takes time to recover and return to where it was before the drought started."
        },
        {
            "text": "Some areas of the country, particularly reserves in Cornwall, East Anglia and Lincolnshire and Northamptonshire, are not where we’d like them to be – even with the recent heavy rainfall. Groundwater levels are improving but it takes time for rain falling today to filter through and refill underground aquifers. We are still seeing negative impacts on agriculture with limited supplies available for irrigation and, in some areas, water levels in chalk streams are still low. At the height of last summer the environmental impacts of drought were plain to see with impacts on river habitats and species; low water levels in wetland reserves; lower than normal populations of birds; wildfires; algal blooms and mortality of newly planted and mature trees. Some areas of the country are still showing signs of stress on the environment, and the Environment Agency continues to focus its ongoing efforts to monitor how well fish and invertebrates are recovering."
        },
        {
            "text": "Are we at risk of another drought this summer?"
        },
        {
            "text": "Quite simply – yes. If we have another long period of dry weather as we did in 2022, demand for water from public drinking supplies, business and agriculture (irrigation) could outstrip supply. Wildlife could suffer from low rivers and drying wetlands."
        },
        {
            "text": "The heavy persistent rainfall through this season has caused typical winter flooding in many areas – but even then, an acute drought could still happen this summer. It is not possible to store such a volume of water right now in case of prolonged hot weather. Across the country, there were reasonable levels of water at the start of 2022 – but by the summer usage was so high, and for so long, that reserves were not being replenished by rainfall."
        },
        {
            "text": "How are we preparing?"
        },
        {
            "text": "In conjunction with others, we are actively planning for drought – should similar conditions return this year."
        },
        {
            "text": "Through the National Drought Group, Government, Defra, the Environment Agency, water companies, farmers, environmental and angling groups continue to work together to balance water needs and conserve water. We are taking measures to do everything we can now to reduce the impact on water supplies to communities, including farmers and reducing impacts on the environment."
        },
        {
            "text": "Like in 2022 we will work together to protect essential water supplies and reduce the impact of drought on the environment."
        },
        {
            "text": "Large parts of England that are no longer in drought are in, what the Environment Agency refers to as, a “recovering state”. Our teams continue to monitor water reserves and check for environmental impacts."
        },
        {
            "text": "Across the country, the Environment Agency is reviewing how we managed last year’s drought and how water companies managed their supplies to meet demand. This will help us all improve and strengthen our plans to be prepared should we experience the same, or more severe conditions, in the future. We need to be more agile in how we manage our water reserves and respond to drought. Together we all need to use water wisely and recognise it is a precious and limited resource."
        },
        {
            "text": "To inform future drought planning we use rainfall and weather forecasts to run models of how well reservoirs and underground aquifers may refill under different rainfall scenarios. Weather conditions can quickly change from those that are expected, leaving us with some unavoidable uncertainty. We continue to produce monthly water situation reports, which communicate developments in groundwater levels, river flows, reservoir stocks and rainfall to our external and internal customers: Water situation reports for England - GOV.UK (www.gov.uk)"
        },
        {
            "text": "Is this the new normal with climate change? What is the Environment Agency doing to prepare the country?"
        },
        {
            "text": "We are experiencing more extreme weather more often. 2022 was the hottest summer on record for England and the driest summer since 1995. Most of England was in drought."
        },
        {
            "text": "We rely on a variety of sources (rivers, reservoirs and groundwater) for our drinking water; in an increasingly uncertain climate the Environment Agency plays a key role in balancing the needs of water users, while ensuring there is enough to support the environment. Society’s growing needs for water, the impacts of climate change on water supplies and ensuring we protect the environment are complex challenges, all of which requires new ways of planning, evaluating and investing in water supply and demand management options."
        },
        {
            "text": "The country needs greater resilience to drought."
        },
        {
            "text": "In the next blog we will look at how we’re refreshing our National Framework for Water Resources and working with others to ensure our future water supply is secure."
        },
        {
            "text": "First released in March 2020, the framework was ground-breaking in in planning for the nation’s water resources to be more resilient to climate change, droughts, and population growth, alongside a new approach to enhancing the environment. We used our best estimate of future supply shortfalls and worked with water companies and other water users to set out a framework of regional-scale planning to develop efficient solutions to the problem."
        },
        {
            "text": "Now we need to look at new evidence, lessons identified and emerging challenges, to further improve water supply resilience across agriculture, power generation, public water supply and other sectors."
        },
        {
            "text": "We need to ensure  collectively that we  protect the environment, ensure water is available for food production and low carbon energy production and of course, ensure water still comes out of your tap."
        }
    ]
}