{
    "url": "https://prisonjobs.blog.gov.uk/2023/01/24/shaunas-journey/",
    "title": "Shauna's journey",
    "authors": [
        "Ministry of Justice"
    ],
    "categories": [
        "Career progression",
        "Personal stories",
        "Probation"
    ],
    "pub_date": "2023-01-24T15:27:56+00:00",
    "content": [
        {
            "heading": 3,
            "text": "Working in the Probation Service can open up a lot of interesting opportunities. We talk to Shauna who joined us as a case administrator and now works in one of our key probation services officer roles. She specialises in working with people who have complex mental health needs such as personality disorders, pre and post release."
        },
        {
            "text": "How did you come to work for the Probation Service?"
        },
        {
            "text": "After I finished school, I completed a Business Administration Apprenticeship and worked at an accountancy firm for a short while after, but I didn’t enjoy it. Looking for a new challenge, I came across the case administrator role within the prison."
        },
        {
            "text": "I drew on the skills I had gained from my previous admin roles and applied them to the prison case admin role. I enjoyed working in the prison and reading through the case files, understanding how the system worked and speaking to and shadowing probation service officers. This work gave me a really good foundation of knowledge on the probation services role so I felt confident applying for a probation services officer role when an opportunity came up."
        },
        {
            "text": "Tell us a bit about your current role as a probation services officer "
        },
        {
            "text": "I now work within the Intensive Intervention Risk Management Service (IIRMS). This is a pathway specifically for people on probation who have been screened into the Offender Personality Disorder (OPD) pathway and often have complex mental health needs. We work closely with offender managers both in prison and the community to understand:"
        },
        {
            "text": "How would you describe your day-to-day work?"
        },
        {
            "text": "It’s very varied and busy. It’s a hands-on role that requires you to be adaptable. We co-work with clinicians (psychologists and occupational therapists) and different teams both in prison and the community, including mental health and drug and alcohol services. We also help people learn new skills such as cooking, crafts and setting up things required in a home. The role is a mix of hands-on and desk based, for example carrying out risk assessments and writing reports. Every person is different, so we work alongside a number of other agencies to create tailored plans for people. We typically work with people six months prior to release and up to two years after."
        },
        {
            "text": "What qualities do you think are important in the probation services officer role?"
        },
        {
            "text": "I believe empathy and understanding are really important for this role. You need to be able to contextualise a person’s behaviour but without excusing it. In addition, having good communication skills and being adaptable and resilient are key. It’s also extremely important to be able to work independently as well as within a team."
        },
        {
            "text": "What are the most rewarding parts of the role?"
        },
        {
            "text": "Working with people on probation and building trusting relationships with them is one of the most rewarding parts of the role. We can work with people for two years giving quite high intensity support. I love being able to advocate for people through tough times, play a part in stopping them “spiralling” and providing them with hope for their future in the community."
        },
        {
            "text": "And the challenges?"
        },
        {
            "text": "I would say not really having a set day-to-day structure and the unpredictability of the role can be challenging. The high intensity of the work also means you can get emotionally invested. I do have a really supportive team in place though and I have a weekly debrief with supervisors. It’s a challenging but very rewarding role."
        },
        {
            "text": "What would you say to anyone considering applying for a role as a probation services officer?"
        },
        {
            "text": "I would say to just go for it. If you find this type of work interesting it can open lots of doors for you in terms of career progression and training. I’ve been challenged in the role, but I’ve developed as a person as a result."
        },
        {
            "text": "No day is the same and the role has its challenges, but I love the nature of the work and the job."
        }
    ]
}