{
    "url": "https://companieshouse.blog.gov.uk/2023/01/24/supporting-working-families-to-achieve-their-own-work-life-balance/",
    "title": "Supporting working families to achieve their own work-life balance",
    "authors": [
        "Leane Whelan - Recruitment Officer"
    ],
    "categories": [
        "Personal blog posts",
        "Working at Companies House"
    ],
    "pub_date": "2023-01-24T14:01:13+00:00",
    "content": [
        {
            "text": "In our 2019 annual people survey the idea of a working families network was planted. Then the coronavirus (COVID-19) pandemic meant more people started working from home and the need for a support network increased rapidly."
        },
        {
            "text": "Many of us were juggling work and parenting. With this came a need for support and a reminder that we weren’t alone. There's no one way to be a working family, and all our colleagues have a different story."
        },
        {
            "text": "This is mine."
        },
        {
            "text": "In 2020 I returned from maternity leave into lockdown. It was my third child but still needed to find the balance between work and home life. I’d never worked from home before and now I also had 3 young children in the house. I felt out of my depth as a parent and really isolated. My team were amazing and supported me in any way they could, but I was struggling with being a mum, a home-schooling teacher, and doing my job. I worried that I wasn't putting enough into any of these roles and about letting everyone down. My wellbeing was at an all-time low."
        },
        {
            "heading": 2,
            "text": "Our working families' network"
        },
        {
            "text": "Then I got a call from a work friend asking whether I’d like to join a brand-new working families' network. I jumped at the chance to chat with other parents who were probably feeling the same as me. Before long, my passion for the network shone through, and I was asked to become the co-chair, a role I jumped into with joy and enthusiasm."
        },
        {
            "text": "During lockdown, the network created well-being sessions for parents to bring their children along to. We also shared home-schooling tips and gave each other a virtual shoulder to cry on when needed. The wellbeing of our working families was paramount to us as a network, helping us to find balance and highlighting mental health as a priority. We’re continuing this support now in our new hybrid working lives."
        },
        {
            "heading": 2,
            "text": "Our buddy scheme"
        },
        {
            "text": "As our membership continued to grow, reaching over 100 members before the summer of 2022, I began to think about how we could support Companies House as a whole. I created our buddy scheme, an initiative where people can sign up to be paired with a buddy to chat through anything related to wellbeing or being a working family. It can be for 1 session or more, and sessions can be tailored to what you need."
        },
        {
            "text": "We’ve had people reaching out just because they want a regular catch-up with another mum. We’ve also been able to signpost some colleagues to services for post-natal depression."
        },
        {
            "text": "The working families network aims to empower and support working families to achieve their own work-life balance and reach their full potential. We regularly collaborate with other people-led networks within the organisation to support national campaigns and support our colleagues in any way we can."
        },
        {
            "text": "We raise awareness of issues that impact working families, highlighting them to senior leaders and decision-makers. We also challenge discrimination and promote understanding of the difference in people's needs. Above all, we provide a supportive, open space for people to talk and share, and come together to celebrate their successes - something that Companies House embraces too."
        }
    ]
}