{
    "url": "https://deframedia.blog.gov.uk/2017/11/21/tuesday-21-november-non-executive-directors-avian-flu-plastic-pollution/",
    "title": "Tuesday 21 November: Non-executive directors, Avian Flu, plastic pollution",
    "authors": [
        "Press Office"
    ],
    "categories": [
        "Uncategorized"
    ],
    "pub_date": "2017-11-21T14:02:28+00:00",
    "content": [
        {
            "heading": 2,
            "text": "Non-executive directors"
        },
        {
            "text": "Sky News have run a story today reporting that Defra's lead non-executive director Steve Holliday is expected to stand down from his role. The piece also covers ongoing recruitment to fill other non-executive director (NED) vacancies."
        },
        {
            "text": "We are expecting a formal letter of resignation from Steve Holliday, stepping down from his position as Defra's lead non-executive director."
        },
        {
            "text": "Two other non-executive directors - Catherine Doran and Paul Rew - are stepping down having served for a full 6 years, which is the normal maximum length for a departmental NED. The need to recruit replacement NEDs therefore pre-dated the Secretary of State’s appointment in June."
        },
        {
            "text": "The existing fourth NED -Peter Bonfield - remains on the Board. One additional post - taking the total number of NEDs to five - is being created in recognition of the significant role the department is playing in our preparations for leaving the EU."
        },
        {
            "text": "A Defra spokesperson said:"
        },
        {
            "text": "The Sky piece also alleges “efforts to politicise the supposedly impartial Whitehall roles”. To be clear, NEDs are Secretary of State appointments. They are not civil servants. This is set out in the ministerial code, which states that NEDs are “drawn from the commercial private sector and appointed by the Secretary of State in accordance with Cabinet Office guidelines.”"
        },
        {
            "text": "This is further confirmed in Cabinet Office guidelines which states 'Non-executive board members, appointed by the Secretary of state, will be experts from outside government.'"
        },
        {
            "text": " "
        },
        {
            "heading": 2,
            "text": "Avian influenza"
        },
        {
            "text": "This morning’s instalment of Farming Today included a package on Avian Influenza. The virus does not affect humans but presents a real threat to our poultry industry and it is essential that anyone who keeps birds, whether a few in their garden or thousands on farm, is vigilant, aware of the signs, and maintains good biosecurity."
        },
        {
            "text": "Gary Ford, Chief Poultry Adviser at the NFU is interviewed as part of the package where he emphasises the importance of ensuring ‘backyard keepers’ who keep birds in their back garden are aware of the threat as outbreaks in backyards can have a big knock on impact on the commercial sector:"
        },
        {
            "text": "You can find our recently updated information and advice on bird flu here: https://www.gov.uk/government/news/avian-influenza-bird-flu-in-winter-2017-to-2018"
        },
        {
            "heading": 2,
            "text": "Plastic pollution"
        },
        {
            "text": "Environment Secretary Michael Gove has pledged tackle plastic waste in the world’s oceans following the latest episode of the BBC’s Blue Planet II."
        },
        {
            "text": "The Secretary of State said there was an imperative to do more, and that work would continue at Defra to identify further action in a bid to stop plastic rubbish."
        },
        {
            "text": "This followed scenes in the BBC’s Blue Planet II series in which a pilot whale was filmed carrying her dead newborn baby around the ocean after being possibly poisoned by pollution in its mother’s milk."
        },
        {
            "text": "The story was covered by the Daily Mail, Daily Telegraph, and The Sun."
        },
        {
            "text": "A Defra spokesperson said:"
        },
        {
            "text": "Subscribe to the blog for email updates."
        },
        {
            "text": "Follow us on Twitter: @defragovuk"
        }
    ]
}