{
    "url": "https://ofqual.blog.gov.uk/2022/07/07/evaluating-the-reforms-of-functional-skills-qualifications/",
    "title": "Evaluating the reforms of Functional Skills Qualifications",
    "authors": [
        "Emma Scott"
    ],
    "categories": [
        "Coronavirus (COVID-19)",
        "Exams",
        "Functional skills"
    ],
    "pub_date": "2022-07-07T14:35:10+01:00",
    "content": [
        {
            "heading": 2,
            "text": "Introducing reformed Functional Skills"
        },
        {
            "text": "Reformed Functional Skills qualifications (FSQs) were first awarded in 2019 and today we have published research that we did in 2019 as part of our initial evaluation of those qualifications.  "
        },
        {
            "text": "Ofqual’s role is to make sure that awarding organisations produce qualifications that are fit for purpose and that those qualifications, where relevant, reflect government policy.   "
        },
        {
            "text": "The Department for Education (DfE), responsible for subject content, introduced much more specific common content into the reformed qualifications. While the overall level of demand was to remain the same, there was more emphasis on spelling, punctuation and grammar, without the aid of dictionaries or spell checks, in English. And in maths, there was greater focus on solving mathematical problems, both with and without a calculator. In April 2019 we explained, in a blog, what these reforms to Functional Skills would mean for students.  "
        },
        {
            "heading": 2,
            "text": "Research findings"
        },
        {
            "text": "Our research considered whether the reformed maths qualifications were more or less challenging than the legacy qualifications they replaced, and whether this was consistent between maths Functional Skills qualifications offered by different awarding organisations.  "
        },
        {
            "text": "Teachers of Functional Skills mathematics were asked to compare questions from the legacy Functional Skills maths papers and questions from the sample papers produced by awarding organisations for the reformed Functional Skills qualifications. They judged that the expected difficulty of individual questions in legacy assessments and reformed sample assessments was very similar. The research findings therefore suggest that awarding organisations successfully introduced the new content without increasing demand.   "
        },
        {
            "text": "Before awarding organisations could offer any FSQs they also had to submit their qualifications to Ofqual for a ‘technical evaluation’. This technical evaluation checked that the new tests were appropriate and that awarding organisations had suitable arrangements to deliver these qualifications safely. In August 2019 we explained how standards would initially be set in these qualifications.  "
        },
        {
            "text": "The research was carried out as part of this technical evaluation of assessment materials for these new qualifications.  "
        },
        {
            "heading": 2,
            "text": "COVID disruption"
        },
        {
            "text": "After only a few months of students taking the new assessments, exams were cancelled. Functional Skills assessments, like many qualifications, could not take place safely and students instead received Centre Assessed Grades (CAGs).   "
        },
        {
            "text": "Awarding organisations worked swiftly to introduce online versions of the assessments from September 2020. During the pandemic, Ofqual changed its monitoring activity. We turned to focus on awarding organisations’ progress in rolling out onscreen and remotely invigilated assessments and monitored awarding organisations’ issue of CAGs. "
        },
        {
            "text": "In response to government’s decision in 2021 that assessments for Functional Skills should continue unless students could not access them, we checked how awarding organisations were adapting their assessments in response to the pandemic. Ofqual monitored the issue of Teacher Assessed Grades (TAGs).   "
        },
        {
            "text": "To date, more than 135,000 students have been able to take assessments remotely so that they could progress to the next stage in their studies or careers. And, up until September 2021, those who couldn’t safely access an assessment could receive a result based on a TAG if they had sufficient evidence.  "
        },
        {
            "text": "This mammoth, collective effort from students, teachers, tutors and awarding organisations meant that more than 400,000 Functional Skills certificates were issued between September 2020 and March 2022.  "
        },
        {
            "heading": 2,
            "text": "Overall volumes"
        },
        {
            "text": "Ofqual published an interactive app last month, showing certification volumes for vocational qualifications over the past 10 years. The number of students taking FSQs has been falling steadily since 2016, against a backdrop of a gradual decrease in the overall number of certificates issued for vocational qualifications. This may be due to various factors including funding decisions, the impact of wider policy reforms and the reforms to FSQs themselves.   "
        },
        {
            "heading": 2,
            "text": "We are listening"
        },
        {
            "text": "Whenever a new suite of qualifications is introduced, or existing ones reformed, Ofqual evaluates how the reformed qualifications are performing, and a fundamental part of any evaluation is listening to the sector. Some representative bodies said they believe the reforms have made FSQs more difficult. Ofqual’s Chief Regulator, Dr Jo Saxton, recently spoke at the AELP conference and was clear that she had heard the concerns. "
        },
        {
            "text": "Teachers of Functional Skills, representatives from AELP, Holex and the Association of Colleges have told us that they think fewer students are passing the reformed qualifications. They said that some of the language used in assessments was unnecessarily difficult and some students struggled to understand what they were being asked to do, particularly in maths. They said that teachers found the content harder to teach.   "
        },
        {
            "text": "We have shared concerns about the content and teaching support needed with DfE. DfE will conduct their own evaluation. The Education and Training Foundation delivers a series of courses in both English and maths to support those teaching Functional Skills. Any concerns about the qualifications themselves will be a focus of our ongoing programme of monitoring and evaluation.   "
        },
        {
            "text": "We expect assessments to contain accessible language, clear layouts and that any context, images or colours do not disadvantage students. Ofqual recently published new guidance which supports awarding organisations to design assessments to meet rules on accessibility.  "
        },
        {
            "heading": 2,
            "text": "Next steps"
        },
        {
            "text": "We expect all awarding organisations to keep their assessments under review and to respond to relevant feedback about the development, delivery and award of their qualifications. We meet regularly with the awarding organisations that award Functional Skills qualifications and will check that they are doing this.   "
        },
        {
            "text": "In parallel with DfE, Ofqual is now finalising evaluation and monitoring plans for these qualifications. We will shortly invite students, employers and providers to help us understand whether the reformed qualifications help students prepare for work and further study, to gather general perceptions of the reforms and to understand the value of the new qualifications in the labour market.   "
        },
        {
            "text": " "
        },
        {
            "text": "Emma Scott"
        },
        {
            "text": "Director of Operations, Vocational and Technical Qualifications"
        }
    ]
}