{
    "url": "https://marinedevelopments.blog.gov.uk/2022/07/07/i-vms-update-5/",
    "title": "I-VMS update 5",
    "authors": [
        "Sean Douglas, Head of Enforcement, Intelligence and Investigations"
    ],
    "categories": [
        "Uncategorized"
    ],
    "pub_date": "2022-07-07T09:24:11+01:00",
    "content": [
        {
            "text": "It’s really encouraging that so many vessels across our English inshore have installed their onboard I-VMS devices and received the grant funding to re-imburse their costs, but we realise there is still much work to do. We have now hit a milestone with more than a quarter of under-12m fleet installing devices."
        },
        {
            "text": "At this point, as we pass the half-way point in the project rollout, it’s important to remember what we’re trying to achieve with I-VMS (Inshore Vessel Monitoring System(s), and what long term benefits it will bring to the industry."
        },
        {
            "text": "We will use the data shared with us by individual fishers through the digital technology of their chosen I-VMS device, to create the clearest ever picture of inshore fishing activity within English coastal waters."
        },
        {
            "text": "That, combined with data the MMO also collects such as catch volumes and scientific evidence of stock levels, will help us influence future fisheries policies to protect and promote the interests of individual fishers and the wider industry."
        },
        {
            "text": "Mapping and recording fishing activity through I-VMS will also help the MMO and its maritime partners to balance the needs of fishing grounds and protected marine habitats, against the competing demands of other marine developments such as those we’re facing from offshore energy."
        },
        {
            "text": "I hope that our aims for I-VMS are clear, but we can only achieve them with the continuing help and support of the industry and all our fishers in the under-12m fleet which is why we value the continuing feedback our support and engagement team receive from fishers on the quayside and through the advice line 01900 508 618 and ivms@marinemanagement.org,uk"
        },
        {
            "text": "When we know what type of problems and concerns people have, we can hopefully provide the help and support to overcome them. From what documentation you need for your grant and how best to apply, to what kind of I-VMS type approved devices are available to choose to buy."
        },
        {
            "text": "That advice and the online guidance (( https://www.gov.uk/guidance/list-of-i-vms-type-approved-devices-for-under-12-metre-english-vessels) has already helped a quarter of the fleet install their devices, and process almost £250,000 in grant payments to re-imburse costs but as I mentioned earlier there is still more work for us to do."
        },
        {
            "text": "This includes contacting all those fishers in Tranche 1 (10m – 11.99m) and Tranche 2(8m-9.99m) who still haven’t ordered or bought their chosen device to tell them to act as quickly as possible, or face delays in the grant funding payments they’re entitled to claim to re-imburse these initial costs."
        },
        {
            "text": "We’re now well into Tranche 3 (6m-7.99m) and the increased demand for devices, installation and arranging with suppliers for a test-signal verification transmission from these smaller vessels, will obviously affect those larger T1 and T2 vessels and the fishers who should have completed that process already within the deadlines."
        },
        {
            "text": "We set those tranche deadlines at the start of the project rollout to allow fishers within each tranche sufficient time to make arrangements for their vessel, and manage the increased supply and demand from other tranches, to ensure that all devices are installed before it becomes a legal requirement."
        },
        {
            "text": "As Tranche 3 continues we’ll organise more visits by the Support and Engagement team to ports around the country, and make more targeted contact with those individual fishers who we know from our intelligence gathering are still hesitating to get involved with I-VMS to find out why and provide some re-assurance, encouragement or support."
        },
        {
            "text": "That re-assurance and reminders of what benefits I-VMS will bring to the English inshore fishing industry, also comes with a message from the MMO that every fisher has a role to play in deciding future fisheries policies to protect their interests."
        },
        {
            "text": "The individual data they share with us from their onboard devices to the I-VMS Hub, will be a huge and important part of that continuing process in the years ahead."
        }
    ]
}