{
    "url": "https://food.blog.gov.uk/2022/07/07/starting-the-conversation-on-food-safety-and-net-zero-carbon/",
    "title": "Starting the conversation on food safety and net zero carbon",
    "authors": [
        "Professor Robin May, Chief Scientific Adviser"
    ],
    "categories": [
        "Science"
    ],
    "pub_date": "2022-07-07T12:30:09+01:00",
    "content": [
        {
            "text": "Cymraeg"
        },
        {
            "text": "For Net Zero Carbon Week, our CSA discusses the findings from the Science Council’s newly published interim report on food safety and net zero carbon."
        },
        {
            "text": "To help drive and support the achievement of net zero by 2050, in April 2021 the UK government set the world's most ambitious climate change target into law, to reduce emissions by 78% by 2035 compared to 1990 levels. This builds on all UK government departments, and their agencies, commitment to taking actions to reduce their impacts on the environment in Greening Government Commitments."
        },
        {
            "text": "The food chain is a major contributor to climate change. Food production accounts for more than 25 per cent of all greenhouse gas emissions. Reducing this will mean dramatic changes to how we grow, process and transport food. But what will that mean for food safety?"
        },
        {
            "text": "Food is vital to everyone, every day, and food safety cannot be compromised. So we asked the Science Council to focus on the potential implications for food safety of the changes needed to achieve net zero in the food system. These findings will be used to help guide our future policy and evidence needs, for example, in identifying areas where we may need to obtain more evidence or recruit specific experts."
        },
        {
            "text": "The Science Council is our independent expert committee. It provides high-level, expert strategic insight, challenge and advice to me, as Chief Scientific Adviser, and to the Board and executive of the FSA on our use of science to deliver our objectives. Its purpose is to help ensure the FSA can identify and benefit from the best scientific evidence and expertise from all relevant disciplines to inform and evaluate its work."
        },
        {
            "text": "It’s been a year since the Science Council began their work on this Net Zero project. They have now published their interim report, focused on the implications for food safety changes being made to the food system over the next 10 years to achieve net zero carbon. The focus of this study has been on primary food production. This includes the growing and harvesting of plants as food for humans or feed for animals, and the rearing and slaughter of animals, including livestock, fish and marine organisms."
        },
        {
            "heading": 2,
            "text": "What has been learnt so far"
        },
        {
            "text": "The Science Council has talked with many experts in academia and industry and several points to consider have emerged from these discussions:"
        },
        {
            "text": "We’ve already seen innovations in farming practices that help to reduce the carbon footprint in the food system and reduce some risks. For example, new systems reducing conventional plant exposure to ‘open air’ risks, reducing human contact with crops and closed systems. But they also have the potential to introduce new risks around pathogens, toxins and hygiene if not properly managed. There may be a need to support entrepreneurs developing this technology who have had little to no experience in managing food safety risks."
        },
        {
            "text": "This is an area that we are already reviewing, but the Science Council has identified several concerns that may need greater awareness in due course.  These include the impact of replacement novel proteins on the nutritional profile of animal products, the use of food waste as animal feed and the suitability of the current regulatory framework for assessing developments in animal feed, such as using supplements to reduce methane from livestock."
        },
        {
            "text": "As with livestock farming, fish farming is also exploring alternative protein sources for feed, which can impact nutrition profiles both positively and negatively. Any increase in ‘wild’ farming, for example, molluscs and seaweed from the ocean whose food is brought to them on the currents, can be susceptible to contamination if poorly located and therefore may need to have controls put in place to manage food safety risks."
        },
        {
            "text": "Reducing our carbon footprint could also see a return to more traditional farming practices, such as mixed arable and livestock farming, circular use of waste and reducing the use of fertilisers. While there are many benefits associated with this shift, it may affect the balance and type of food risks to be managed, such as increased wildlife contact with food production changing exposure to diseases transferred from animals to humans."
        },
        {
            "text": "We should also consider the potential for increased recycling of waste or by-products in animal feed or food packaging, and the impact this could have on food safety (although we are already working on a project looking at potential food safety impacts of a change in food contact materials through the reduced use of plastics and the increased use of alternative packaging materials)."
        },
        {
            "text": "While the Science Council have been focusing on changes to primary production, consumer choice and demand is a strong driver for change in the production system. Consequently, another of our independent committees, the Advisory Committee on Social Sciences (ACSS), are doing their own review exploring consumer behaviour trends which may be motivated by climate concerns, and their impact on food safety. This work is being carried out by the Climate Change and Consumer Behaviour Working Group and will be published in the next few weeks."
        },
        {
            "text": "This work has already highlighted the trend towards plant-based diets, which raises concerns about the potential to increase allergen and toxin risks, as well as nutritional deficits, such as calcium deficiencies from substituting cows’ milk with certain plant-based ‘milk’ products."
        },
        {
            "text": "Labelling could also be affected by changes due to net zero carbon, for example, allergen risks in foods which have been reformulated to reduce animal products or had new proteins added to it (such as insect proteins). Another area of interest is ‘sustainability’ food labelling (often termed ‘eco-labelling’). There is currently no consistent standard for sustainability claims when labelling foods, so there is significant potential for inaccurate claims about net zero and sustainability credentials that may mislead consumers."
        },
        {
            "heading": 2,
            "text": "Next steps"
        },
        {
            "text": "The Science Council are still working on this review, with further work planned to understand the nature of the risks in more depth. The final report is due to be presented to our Board in spring 2023. The report will be critical in shaping the scope of our policy and science work in the coming years so we’re keen to get as much expert input into the working group as possible."
        },
        {
            "text": "As the Science Council continue to build its understanding of the landscape on net zero carbon, they want to expand its network of experts. If you have relevant expertise in the area and would like to contribute to this work, please get in touch with the Science Council secretariat."
        },
        {
            "heading": 1,
            "text": "\nDechrau’r sgwrs am ddiogelwch bwyd a charbon sero net"
        },
        {
            "text": "Ar gyfer Wythnos Carbon Sero Net, mae ein Prif Gynghorydd Gwyddonol yn trafod canfyddiadau adroddiad dros dro’r Cyngor Gwyddoniaeth sydd newydd ei gyhoeddi ar ddiogelwch bwyd a charbon sero net. "
        },
        {
            "text": "Er mwyn helpu i ysgogi a chefnogi cyflawni carbon sero net erbyn 2050, fe wnaeth Llywodraeth y DU drosi un o dargedau newid hinsawdd mwyaf uchelgeisiol y byd yn gyfraith ym mis Ebrill 2021, sef i leihau allyriadau 78% erbyn 2035 o gymharu â lefelau 1990. Mae hyn yn adeiladu ar ymrwymiad holl adrannau Llywodraeth y DU a’u hasiantaethau i gymryd camau er mwyn lleihau eu heffeithiau ar yr amgylchedd yn Ymrwymiadau Gwyrddu’r Llywodraeth."
        },
        {
            "text": "Mae’r gadwyn fwyd yn cyfrannu’n fawr at newid hinsawdd – mae cynhyrchu bwyd yn gyfrifol am fwy na 25% o’r holl allyriadau nwyon tŷ gwydr. Bydd lleihau hyn yn golygu newidiadau dramatig i’r modd rydym yn tyfu, prosesu a chludo bwyd. Ond beth bydd hynny'n ei olygu o ran diogelwch bwyd?"
        },
        {
            "text": "Mae bwyd yn hanfodol i bawb, bob dydd, ac ni ellir cyfaddawdu yn ei gylch. Felly fe wnaethom ofyn i’r Cyngor Gwyddoniaeth ganolbwyntio ar y goblygiadau posib i ddiogelwch bwyd yn sgil y newidiadau y mae eu hangen i gyflawni sero net yn y gadwyn fwyd. Bydd y canfyddiadau hyn yn cael eu defnyddio i helpu i lywio ein hanghenion polisi a thystiolaeth yn y dyfodol, er enghraifft, wrth nodi meysydd lle gallai fod angen mwy o dystiolaeth arnom neu recriwtio arbenigwyr penodol."
        },
        {
            "text": "Y Cyngor Gwyddoniaeth yw ein pwyllgor arbenigol annibynnol. Mae’n darparu mewnwelediad strategol lefel uchel arbenigol, heriad a chyngor i fi, fel y Prif Gynghorydd Gwyddonol, ac i’r Bwrdd a thîm gweithredol yr ASB ar ein defnydd o wyddoniaeth i gyflawni ein hamcanion. Ei bwrpas yw helpu i sicrhau bod yr ASB yn nodi ac yn elwa ar y dystiolaeth a chyngor gwyddonol gorau o bob disgyblaeth berthnasol i lywio a gwerthuso ei gwaith."
        },
        {
            "text": "Mae’n flwyddyn ers i’r Cyngor Gwyddoniaeth ddechrau ei waith ar y prosiect Sero Net hwn ac mae bellach wedi cyhoeddi ei adroddiad dros dro sy’n canolbwyntio ar oblygiadau’r newidiadau diogelwch bwyd a fydd yn cael eu cymhwyso at y system fwyd dros y 10 mlynedd nesaf er mwyn cyflawni carbon sero net.  Ffocws yr astudiaeth hon oedd cynhyrchu bwyd cynradd – mae hyn yn cynnwys tyfu a chynaeafu planhigion fel bwyd i bobl neu fwyd i anifeiliaid, a magu a lladd anifeiliaid, gan gynnwys da byw, pysgod ac organebau morol."
        },
        {
            "heading": 2,
            "text": "Yr hyn rydym wedi’i ddysgu hyd yma"
        },
        {
            "text": "Mae’r Cyngor Gwyddoniaeth wedi siarad â nifer o arbenigwyr yn y byd academaidd a’r diwydiant, ac mae sawl pwynt trafod wedi codi yn sgil y trafodaethau hyn."
        },
        {
            "text": "Rydym eisoes wedi gweld arloesi mewn arferion ffermio – megis systemau newydd sy’n atal planhigion rhag dod i gysylltiad â risgiau ‘awyr agored’, gan leihau cysylltiad pobl â chnydau a systemau caeedig – sy’n helpu i leihau ôl troed carbon yn y system fwyd a lleihau rhai risgiau. Ond mae hefyd ganddynt y potensial i gyflwyno risgiau newydd o ran pathogenau, tocsinau a hylendid os na chânt eu rheoli’n iawn. Efallai y bydd angen cefnogi entrepreneuriaid sy’n datblygu’r dechnoleg hon, nad ydynt wedi cael rhyw lawer o brofiad, os o gwbl, o reoli risgiau diogelwch bwyd."
        },
        {
            "text": "Dyma faes rydym eisoes yn ei adolygu, ond mae’r Cyngor Gwyddoniaeth wedi nodi sawl pryder y gallai fod angen mwy o ymwybyddiaeth yn eu cylch maes o law.  Mae’r rhain yn cynnwys pethau fel effaith proteinau amgen ar broffil maethol cynhyrchion sy’n deillio o anifeiliaid, defnyddio gwastraff bwyd fel bwyd anifeiliaid, a chynaliadwyedd y fframwaith rheoleiddio cyfredol ar gyfer asesu datblygiadau ym maes bwyd anifeiliaid, fel defnyddio atchwanegiadau i leihau allyriadau methan gan dda byw."
        },
        {
            "text": "Fel ffermio da byw, mae ffermio pysgod hefyd yn archwilio ffynonellau protein amgen ar gyfer bwyd anifeiliaid a allai gael effaith cadarnhaol a negyddol fel ei gilydd ar broffiliau maethol. Gall unrhyw gynnydd ym maes ffermio ‘gwyllt’ – er enghraifft, molysgiaid a gwymon o’r môr y mae eu bwyd yn cael ei gludo atynt gan y ceryntau – fod yn agored i halogi os ydynt mewn lleoliad gwael, ac o’r herwydd gallai fod angen rhoi mesurau ar waith i reoli risgiau diogelwch bwyd."
        },
        {
            "text": "Gall lleihau ein hôl troed carbon hefyd olygu ein bod yn ail-ymgymryd ag arferion ffermio mwy traddodiadol, fel ffermio tir âr a da byw cymysg, defnydd cylchol o wastraff a lleihau’r defnydd o wrtaith. Er bod llawer o fanteision yn gysylltiedig â’r newid hwn, gallai effeithio ar gydbwysedd a mathau’r risgiau y bydd angen eu rheoli, fel mwy o gysylltiad rhwng bywyd gwyllt a phrosesau cynhyrchu bwyd, gan newid y cysylltiad â chlefydau a drosglwyddir o anifeiliaid i bobl."
        },
        {
            "text": "Dylem hefyd ystyried y potensial ar gyfer ailgylchu mwy o wastraff neu sgil-gynhyrchion ym maes bwyd anifeiliaid neu becynnu bwyd, a’r effaith y gallai hyn ei chael ar ddiogelwch bwyd (er ein bod ni eisoes yn gweithio ar brosiect sy’n archwilio effeithiau diogelwch bwyd posib a ddeuai o newid deunyddiau a ddaw i gysylltiad â bwyd trwy leihau’r defnydd o blastig a chynyddu’r defnydd o ddeunyddiau pecynnu amgen)."
        },
        {
            "text": "Er bod y Cyngor Gwyddoniaeth wedi bod yn canolbwyntio ar newidiadau i gynhyrchu cynradd, mae dewis a galw gan ddefnyddwyr yn sbardun cryf ar gyfer newid yn y system gynhyrchu. O’r herwydd, mae un arall o’n pwyllgorau annibynnol, y Pwyllgor Cynghori ar y Gwyddorau Cymdeithasol (ACSS), yn cynnal ei adolygiad ei hunan sy’n archwilio tueddiadau yn ymddygiad defnyddwyr, a allai gael eu cymell gan bryderon am yr hinsawdd, a’r effaith ar ddiogelwch bwyd. Mae’r gwaith hwn yn cael ei gynnal gan y  Gweithgor Newid Hinsawdd ac Ymddygiad Defnyddwyr, a fydd yn cael ei gyhoeddi yn yr wythnosau nesaf."
        },
        {
            "text": "Mae’r gwaith hwn eisoes wedi amlygu tuedd tuag at ddeietau planhigion, sy’n codi pryderon am risgiau alergenau posib, a chynnydd yn y defnydd o ddeunydd pecynnu amgen, gan gynnwys cynwysyddion ailddefnyddadwy, a allai arwain at risgiau halogi."
        },
        {
            "text": "Gallai labelu hefyd gael ei effeithio gan newidiadau o ganlyniad i garbon sero net, er enghraifft, risgiau alergenau mewn bwydydd sydd wedi’u hailfformiwleiddio er mwyn lleihau cynhyrchion sy’n deillio o anifeiliaid, neu fwyd yr ychwanegwyd proteinau newydd ato (fel proteinau pryfed). Maes arall o ddiddordeb yw labelu bwyd mewn perthynas â chynaliadwyedd (a elwir yn aml yn ‘eco-labelu’). Ar hyn o bryd nid oes safon gyson ar gyfer honiadau cynaliadwyedd wrth labelu bwydydd, felly mae potensial sylweddol i honiadau anghywir am gymwysterau sero net a chynaliadwyedd a allai gamarwain defnyddwyr."
        },
        {
            "heading": 2,
            "text": "Y camau nesaf"
        },
        {
            "text": "Mae’r Cyngor Gwyddoniaeth yn dal i weithio ar yr adolygiad hwn, gyda gwaith pellach wedi’i gynllunio i ddeall natur y risgiau mewn mwy o fanylder. Disgwylir i’r adroddiad terfynol gael ei gyflwyno i’n Bwrdd yng ngwanwyn 2023. Bydd yr adroddiad yn hanfodol wrth lunio cwmpas ein gwaith polisi a gwyddoniaeth yn y blynyddoedd i ddod, felly rydym yn awyddus i gael cymaint o fewnbwn arbenigol â phosib i’r gweithgor."
        },
        {
            "text": "Wrth i’r Cyngor Gwyddoniaeth barhau i feithrin ei ddealltwriaeth o’r sefyllfa o ran carbon sero net, maent am ehangu eu rhwydwaith o arbenigwyr. Os oes gennych chi arbenigedd perthnasol yn y maes a hoffech gyfrannu at y gwaith hwn, cysylltwch ag ysgrifenyddiaeth y Cyngor Gwyddoniaeth."
        }
    ]
}