{
    "url": "https://educationhub.blog.gov.uk/2025/02/national-apprenticeship-week-meet-darke-and-taylor-ltd/",
    "title": "National Apprenticeship Week: Meet Darke and Taylor Ltd ",
    "authors": [
        "mediaofficer"
    ],
    "categories": [
        "Apprenticeships",
        "Careers"
    ],
    "pub_date": "2025-02-13T12:00:00+00:00",
    "content": [
        {
            "text": "This series of National Apprenticeship Week Education Hub posts was curated and written by Lauren, the Department for Education’s new communications apprentice. "
        },
        {
            "text": "During National Apprenticeship Week we want to hear from the employers who champion apprenticeships by providing career opportunities for young people in a range of sectors as well as training for their existing employees to help them progress in their roles.   "
        },
        {
            "text": "Electrical engineering firm Darke and Taylor Ltd (D&T) was founded in 1958 by John Darke and one apprentice, Harold Taylor. Today it is one of the largest privately owned building services in the southeast of England, with apprentices still at the heart of their work.  "
        },
        {
            "text": "Here is what they had to say. "
        },
        {
            "text": "What does your organisation do?  "
        },
        {
            "text": "“We are a mechanical and electrical services operator, and we do installations in multiple sectors, including high-end residential, offices, educational, historic and listed buildings and many more.” "
        },
        {
            "text": "Why did you decide to invest in apprenticeships and training opportunities? "
        },
        {
            "text": "“Historically, Darke and Taylor have had a progress internally ethos and apprentices have been taken on at D&T since the company started in 1958. As the company has grown, most senior managers and directors are individuals who previously started as apprentices.  "
        },
        {
            "text": "“Investing in apprenticeships and training is investing in the future of the business. The young engineers will be the future directors and management of the company.” "
        },
        {
            "text": "How do apprentices benefit from your programme? "
        },
        {
            "text": "“Apprentices and trainees benefit from continual improvement and learning. D&T invests in further training, for example many of our electricians who completed apprenticeships have been put through management training or gone on to complete degrees.” "
        },
        {
            "text": "What advice would you give to employers considering a training and employment scheme?  "
        },
        {
            "text": "“Investing in apprenticeships and training has been a huge success at Darke & Taylor. It is a great way of growing a business and it is hugely rewarding seeing young people succeeding. It is also a great way to help close any skills gaps in the industry.” "
        },
        {
            "text": "What do your existing employees say about the apprenticeship programme? "
        },
        {
            "text": "As an employer at Darke and Taylor Ltd Aidan Burns, 21, received his training to be an electrician with JTL. JTL are a leading work-based learning provider offering apprenticeships in the building services engineering sector across England and Wales. Here is what he said about his experience: "
        },
        {
            "text": "“My apprenticeship with Darke and Taylor and JTL has been amazing. Over the span of four years, their support has made my journey smooth sailing. Whenever I faced questions or uncertainties, they were consistently available to guide me.  "
        },
        {
            "text": "“What sets them apart is their commitment to my growth. Darke and Taylor went the extra mile by providing additional training opportunities, like the confined Space and Site Supervisors Safety Training Scheme courses. These empowered me to take on greater responsibilities and gain a comprehensive understanding of not only the electrical sector, but also of the broader trade industry.  "
        },
        {
            "text": "“In summary, my apprenticeship has been nothing short of exceptional!’”  "
        }
    ]
}