{
    "url": "https://mhclgmedia.blog.gov.uk/2025/02/13/new-towns-update/",
    "title": "New towns update",
    "authors": [
        "mhclgpress"
    ],
    "categories": [
        "Affordable housing",
        "Communities",
        "Housing"
    ],
    "pub_date": "2025-02-13T17:34:48+00:00",
    "content": [
        {
            "text": "There has been prominent, widespread national reporting on the latest update on the next generation of new towns."
        },
        {
            "text": "The story has been covered by outlets including The Guardian, Financial Times, Telegraph, Independent and Express."
        },
        {
            "text": "The outlets report on the government’s plan for the next generation of new towns - well-designed, beautiful communities with affordable housing, GP surgeries, schools and public transport where people will want to live. "
        },
        {
            "text": "The reporting further outlines how over 100 proposals across every region in England have been submitted via a national call for evidence to the New Towns Taskforce for consideration. Areas like London, the South and East of England have the most proposals, but the government is clear it wants to build these new towns in areas where they are needed most."
        },
        {
            "text": "The Taskforce has today set out clear principles on what the next generation of new towns will deliver: affordable housing, vital infrastructure and access to open green spaces and nature, to transform the lives of working people.  Every new town will have the potential to deliver 10,000 homes or more and will include a mix of tenures. The precise mix and numbers of homes will be influenced by the location of the sites."
        },
        {
            "text": "No decisions have yet been made on the locations for and number of new towns. The Taskforce will submit its recommendations to the government in the summer and further details will be set out following this. The Taskforce’s recommendations will be made in the national interest, and on the basis of defined criteria."
        },
        {
            "text": "Deputy Prime Minister and Secretary of State for Housing, Angela Rayner said:  "
        },
        {
            "text": "“Time and again we are seeing too many new homes stuck or stalled that not only act as a barrier to growth but also has real-world consequences for working people and families who see homeownership as nothing more than a distant dream.  "
        },
        {
            "text": "“I will not run away from the tough choices to fix the housing crisis we inherited that has left thousands of families on housing waiting lists, allowed homelessness to spiral out of control, and stopped an entire generation from picking up the keys to their first home.  "
        },
        {
            "text": "“While our vision for the next generation of new towns is setting the stage for a housebuilding revolution in the years to come, urgent action is needed now to build the homes and infrastructure that our local communities are crying out for. That’s why our New Homes Accelerator is working at pace to find solutions and remove blockages in the system, executing long-lasting solutions to get spades in the ground.  "
        },
        {
            "text": "“Today we are embarking on the next chapter in our Plan for Change to build 1.5 million new homes, deliver the biggest boost in social and affordable housing in a generation, and raise living standards for working people and families across the country.”"
        }
    ]
}