{
    "url": "https://competitionandmarkets.blog.gov.uk/2025/02/13/new-cma-proposals-to-drive-growth-investment-and-business-confidence/",
    "title": "New CMA proposals to drive growth, investment and business confidence",
    "authors": [
        "Sarah Cardell"
    ],
    "categories": [
        "Growth and investment"
    ],
    "pub_date": "2025-02-13T08:30:34+00:00",
    "content": [
        {
            "text": "A robust, independent competition regime should both drive growth and investment, and uphold consumer interests."
        },
        {
            "text": "This was at the heart of a speech I gave at Chatham House last November, and a view shared by our new Chair in his first published statement. It is also clearly expressed in the draft Strategic Steer for the CMA, to be published by government later today. The Steer sets out how free and fair competition, and robust consumer protection, can support innovation, productivity and investment."
        },
        {
            "text": "This is core to the CMA’s work and foundational to the value we deliver every day for UK consumers and businesses. "
        },
        {
            "text": "But I have heard clearly from businesses and investors (both domestic and international) that 4 aspects of how the CMA carries out our work also really matter to perceptions of the UK as a great place to do business."
        },
        {
            "text": "These are:"
        },
        {
            "text": "At Chatham House, I laid out my commitment to rapid, meaningful change based on these principles, starting with the mergers process – a particularly critical area for investment, including inward investment, to the UK."
        },
        {
            "text": "That is what I am delivering today: a package of carefully considered proposals for rapid change."
        },
        {
            "text": "To be successful, they rely not only on the CMA’s commitment to change, but also the willingness of businesses and advisors to engage constructively and co-operatively with what we are proposing."
        },
        {
            "text": "Taken together, I am confident they will deliver an approach that compares favourably with international peers, enhances business and investor confidence, and enables us to continue protecting effective competition for the benefit of UK businesses and consumers. "
        },
        {
            "text": "It is open to government to go further, through legislative change, both by locking some of these changes into the statutory framework and making further legislative changes to embed our 4Ps approach. We will continue to work closely with government should it wish to do so.  "
        },
        {
            "heading": 2,
            "text": "Pace – reaching faster decisions on mergers, and minimising in-depth reviews"
        },
        {
            "text": "We know speed of decision making is vital to reduce uncertainty and costs for businesses. Given the vast majority of deals the CMA looks at ultimately end in clearance (either unconditionally or with remedies), we must move as quickly as possible to get to the right decisions. Our proposals will deliver these outcomes more quickly and help us minimise the end-to-end length of merger investigations."
        },
        {
            "text": "By June 2025 we will: "
        },
        {
            "text": "These changes require a major streamlining of our approach, with earlier prioritisation of potential concerns, focused information-gathering, and shorter published decisions. With the cooperation of merging parties, I am confident they are achievable.  "
        },
        {
            "heading": 2,
            "text": "Predictability – clarifying the CMA’s remit"
        },
        {
            "text": "We hear consistently that predictability is key to investor confidence. Under the UK’s ‘voluntary’ system, parties may choose to notify a merger where they think it meets jurisdictional thresholds. But the CMA can also ‘call in’ deals, and UK law gives us an unusually broad jurisdiction by international standards. This can create uncertainty over whether we will review a particular deal or not."
        },
        {
            "text": "Two specific ‘tests’ we apply are relevant:"
        },
        {
            "text": "To strengthen business certainty about which deals might attract the CMA’s attention, we will clarify and delineate our remit (as far as legally possible) by updating our guidance on how we interpret and apply these tests. We will issue the updated guidance for consultation in June."
        },
        {
            "heading": 2,
            "text": "Proportionality – getting to the right outcomes while minimising burden on business, and sharpening our focus on UK impact"
        },
        {
            "text": "Our objective is for as many of the deals as possible which raise competition concerns to be cleared with effective remedies, rather than be prohibited. Our process also needs to support us reaching the best remedial outcomes as quickly and efficiently as possible. "
        },
        {
            "text": "So, in March we are launching a review of our approach to remedies, looking not just at process but also how we strike the right balance between different types of remedies. "
        },
        {
            "text": "We will also consider the potential for deals to deliver pro-competitive investment benefits, as we saw recently with Vodafone/Three. I am confident this will help us to deliver on proportionality - so long as businesses and advisors engage with these objectives in good faith, only putting forward robust remedies proposals and well-evidenced claims around benefits."
        },
        {
            "text": "We also want to take a proportionate approach to looking at global deals, which we know is important to investor confidence. We will always uphold our duty to protect UK consumers and businesses. But we are now carefully exploring how far (under existing law) we might be able to more clearly distinguish between deals with a distinct and direct UK impact, versus those where it may be more appropriate to watch closely whether action by other authorities could resolve UK concerns.  "
        },
        {
            "heading": 2,
            "text": "Process – a step change in direct business engagement, underpinned by a new Mergers Charter"
        },
        {
            "text": "It is vital for investor confidence that all businesses feel listened to by the CMA; understand what we are doing and why; and recognise a sense of fairness and consistent treatment across all investigations."
        },
        {
            "text": "That’s why, in March, the CMA will publish a Mergers Charter. The charter will include our firm public commitment to pace, predictability, proportionality and process, as well as laying out what will be needed - from the CMA, businesses and advisors - to ensure the success of this new approach. "
        },
        {
            "text": "Underpinning the Charter will be a number of meaningful actions to break down barriers to more direct engagement, both outside of and during investigations: a targeted outreach programme for businesses and investors; more senior meetings early in the review process; a suite of accessible, engaging, business-friendly materials and so on. "
        },
        {
            "text": "Building on the success of our recently introduced Phase 2 reforms, I think we can now deliver a step change in more direct, open and constructive engagement with businesses and investors."
        },
        {
            "heading": 2,
            "text": "Moving forward"
        },
        {
            "text": "We are already working at pace to bring about a step change in the operation of the mergers regime over the coming months. But we will not stop there. I am committed to applying the 4Ps framework across all areas of the CMA’s work to deliver robust, independent competition and consumer protection regimes that have the confidence of businesses and investors, and help to support the government’s growth mission."
        }
    ]
}