{
    "url": "https://design102.blog.gov.uk/2024/07/10/how-to-get-the-most-out-of-your-agency-briefing/",
    "title": "How to get the most out of your agency briefing",
    "authors": [
        "Design102 team"
    ],
    "categories": [
        "Advice",
        "Creative",
        "Design",
        "Services"
    ],
    "pub_date": "2024-07-10T14:51:41+01:00",
    "content": [
        {
            "text": "When you embark on a creative partnership with an agency, it’s very likely that it will begin with a brief. At Design102, we have seen thousands of briefs over the past 10 years, so we know a thing or two about what makes a good one. A strong brief can save you time and money, and ultimately lead to a better creative output. So read on to learn how to get the most out of your agency briefing."
        },
        {
            "heading": 2,
            "text": "The basics"
        },
        {
            "text": "Objectives – What are you trying to achieve?"
        },
        {
            "text": "This could be fully formed SMART objectives (objectives that are specific, measurable, attainable, relevant and timely), or a simple outline of your aims."
        },
        {
            "text": "Audience – Who are your communications aimed at?"
        },
        {
            "text": "What do you know about the audience, and what do you need them to do? Be specific if you can."
        },
        {
            "text": "Timelines – What are your key milestones and delivery dates, and who needs to sign off on the work?"
        },
        {
            "text": "Knowing this up front will help your agency create an accurate timeline and ensure time is factored in for stakeholder approvals."
        },
        {
            "text": "Budget – What is your budget?"
        },
        {
            "text": "Being transparent with budget, even if it’s just a ballpark, will allow your agency to provide a realistic scope for your project, saving you time down the line."
        },
        {
            "heading": 2,
            "text": "Additional extras"
        },
        {
            "text": "Insights – Let your agency know if you have already gathered insight on your audience. If you’re looking to find out more, we can factor that into our support."
        },
        {
            "text": "Messages – You may not have these fully formed yet, but if you have central messages you want to communicate with your target audience, these are worth including as a starting point."
        },
        {
            "text": "Context – Share as much wider context as you think is relevant. It’s helpful for agencies to have a full picture to support building the communications."
        },
        {
            "text": "Specifics – Let us know any specific requirements. For instance, does the work need to adhere to specific criteria, like brand guidelines? Or are you required to deliver certain assets?"
        },
        {
            "text": " "
        },
        {
            "text": "At Design102, we provide our clients with a clear briefing template which includes helpful prompts and questions. However, if you are still unsure where to start with your brief, then reach out to us. We’d be happy to discuss your requirements and create your brief with you."
        },
        {
            "text": "Design102 is a creative communications agency for government and the public sector. Discover our work at www.design102.co.uk or reach out to us at hello@design102.co.uk to find out more."
        },
        {
            "text": " "
        }
    ]
}