{
    "url": "https://food.blog.gov.uk/2025/11/07/a-message-from-fsa-ceo-katie-pettifer/",
    "title": "A message from FSA CEO Katie Pettifer",
    "authors": [
        "Katie Pettifer, Chief Executive"
    ],
    "categories": [
        "Our mission"
    ],
    "pub_date": "2025-11-07T13:09:10+00:00",
    "content": [
        {
            "text": "Cymraeg"
        },
        {
            "heading": 3,
            "text": "CIEH Wales Conference: Embracing change, empowering environmental health"
        },
        {
            "text": "I'm constantly inspired by the dedication of environmental health professionals—people who quietly and consistently keep our communities safe. So, I was pleased to speak at the Chartered Institute of Environmental Health’s (CIEH) conference in Wales recently, where I could thank them for their vital work."
        },
        {
            "text": "We discussed the critical role environmental health teams play in keeping food safe, but also the challenges they face. We’re seeing teams stretched, posts unfilled, and the number of food businesses growing. More work, with less resources. At the FSA, we’re responding by adapting the way we regulate, and supporting the workforce. We're empowering local teams to prioritise how they use their resources, and we’re exploring the use of data to enhance oversight of food businesses. In Wales, we’re also piloting changes to the registration system which give local authorities better information about the businesses they regulate."
        },
        {
            "text": "Reform is essential, but it must be collaborative. This theme of working together to protect the public also formed part of the discussion I had giving evidence recently to the Environment, Food and Rural Affairs Committee. Alongside Geoff Ogle, Chief Executive of Food Standards Scotland (FSS), we set out how the FSA and FSS work together across the four nations of the UK, to make sure food is safe and authentic."
        },
        {
            "text": "We covered a range of topics with the committee, including import controls and how we’re supporting the UK Government to negotiate and implement a new SPS agreement with the EU that will protect consumers in the UK and safeguard public health. I explained that delivering the agreement well is one of the biggest things the FSA can help do to promote growth in the UK."
        },
        {
            "text": "We will keep you updated on the FSA’s work to support the new SPS agreement and in the meantime, if you would like to stay up to date with other news from the FSA, you can sign up here."
        },
        {
            "heading": 1,
            "text": "Neges gan Brif Weithredwr yr ASB, Katie Pettifer"
        },
        {
            "heading": 3,
            "text": "Cynhadledd CIEH Cymru: Croesawu newid, grymuso iechyd yr amgylchedd"
        },
        {
            "text": "Dw i wastad yn rhyfeddu at ymroddiad gweithwyr proffesiynol ym maes iechyd yr amgylchedd – pobl sy’n gweithio’n ddiflino i gadw ein cymunedau’n ddiogel. Felly, roeddwn i’n falch o gael y cyfle’n ddiweddar i siarad yng nghynhadledd Sefydliad Siartredig Iechyd yr Amgylchedd (CIEH) yng Nghymru, a diolch i’r gweithwyr hynny am eu gwaith hanfodol. "
        },
        {
            "text": "Gwnaethom drafod rôl hanfodol timau iechyd yr amgylchedd wrth gadw bwyd yn ddiogel, yn ogystal â’r heriau sy’n eu hwynebu. Rydym yn gweld timau dan bwysau, swyddi heb eu llenwi, a thwf cyson yn nifer y busnesau bwyd – sy’n golygu mwy o waith, gyda llai o adnoddau. Yn yr Asiantaeth Safonau Bwyd (ASB), rydym yn ymateb drwy addasu’r ffordd rydym yn rheoleiddio, ac yn cefnogi’r gweithlu. Rydym yn grymuso timau lleol i flaenoriaethu sut maen nhw’n defnyddio eu hadnoddau, ac yn archwilio sut y gellir defnyddio data i wella’r gwaith o oruchwylio busnesau bwyd. Yng Nghymru, rydym hefyd yn treialu newidiadau i’r system gofrestru sy’n rhoi gwell gwybodaeth i awdurdodau lleol am y busnesau maen nhw’n eu rheoleiddio."
        },
        {
            "text": "Mae diwygio’n hanfodol, ond rhaid iddo fod yn gydweithredol. Roedd y thema hon o gydweithio i ddiogelu’r cyhoedd hefyd yn ganolog i’r drafodaeth a gefais yn ddiweddar wrth roi tystiolaeth i Bwyllgor yr Amgylchedd, Bwyd a Materion Gwledig. Ar y cyd â Geoff Ogle, Prif Weithredwr Safonau Bwyd yr Alban (FSS), gwnaethom amlinellu sut mae’r ASB ac FSS yn cydweithio ar draws pedair gwlad y DU, er mwyn sicrhau bod bwyd yn ddiogel ac yn ddilys."
        },
        {
            "text": "Gwnaethom drafod amrywiaeth o bynciau gyda’r Pwyllgor, gan gynnwys rheolaethau mewnforio a sut rydym yn cefnogi llywodraeth y DU i negodi a gweithredu cytundeb SPS newydd gyda’r UE a fydd yn diogelu defnyddwyr yn y DU ac iechyd y cyhoedd. Esboniais mai cyflawni’r cytundeb yn effeithiol yw un o’r pethau pwysicaf y gall yr ASB ei wneud i helpu i hybu twf yn y DU."
        },
        {
            "text": "Byddwn yn rhannu’r diweddaraf am waith yr ASB i gefnogi’r cytundeb SPS newydd. Yn y cyfamser, os hoffech gael yr wybodaeth ddiweddaraf am newyddion eraill gan yr ASB, gallwch danysgrifio yma."
        }
    ]
}