{
    "url": "https://childrenssocialcare.blog.gov.uk/2025/11/07/building-inclusive-safeguarding-workplaces/",
    "title": "Building Inclusive Safeguarding Workplaces",
    "authors": [
        "LeSiran Edwards"
    ],
    "categories": [
        "Leadership",
        "Working in children's social care"
    ],
    "pub_date": "2025-11-07T14:41:24+00:00",
    "content": [
        {
            "heading": 2,
            "text": "From Coaching to National Conference Success"
        },
        {
            "text": "As the founder of the Black & Diverse Safeguarding Professionals Conference (BDSC), I never imagined that what started as coaching conversations with social workers would grow into a national movement. Yet here we are—two sold-out conferences later and a community that continues to prove belonging in the workplace isn’t just “nice to have,” it’s essential."
        },
        {
            "text": "The first BDSC in 2024 made history as the UK’s first national event for Black and global majority (black and diverse) safeguarding professionals. With support from Isabelle Trowler, George the Poet, and others, the conference created what we’d all been waiting for: a safe space where we could speak honestly about our experiences without fear of being silenced or dismissed."
        },
        {
            "text": "This year, over 100 attendees came together once again—social workers, HR leads, inclusion leads, probation, police and more. Some colleagues travelled from Scotland, Manchester, and Sunderland to this West Midlands event, while local authorities invested by buying tickets for their staff. More than 40 Black-owned businesses filled our exhibitor stands since 2024, creating a powerful bridge between social care and business. We were proud to have Nala’s Baby support us by donating products for children entering care—highlighting a real gap in provision for global majority children. Over 40 speakers delivered workshops, keynotes, and panel discussions in a packed learning programme."
        },
        {
            "heading": 2,
            "text": "Tackling Workplace Racism in Safeguarding"
        },
        {
            "text": "Why did I create this space? Because I’ve lived it. I know what it feels like to face microaggressions and racism in the workplace, to feel unseen despite giving your all. In my coaching practice, I noticed the same painful themes resurfacing: racial trauma, exclusion, and the exhaustion of fighting to be heard. One-to-one support wasn’t enough. We needed a community. A national voice. A movement.BDSC demonstrated this power. Global majority managers and anti-racist group leaders spoke candidly about workplace trauma and resilience, creating a ripple of honesty that gave others permission to share. Our workshops reminded us that lasting change in frontline practice requires collective effort and the courage to challenge systems head-on. Wellbeing wasn’t forgotten: from massages to skincare, we made self-care part of the agenda."
        },
        {
            "text": "The feedback speaks volumes: “We are not alone in our struggles.” “This is a movement which can change the nature of how we care and safeguard.”"
        },
        {
            "heading": 2,
            "text": "Building the Future of Inclusive Safeguarding"
        },
        {
            "text": "BDSC is now moving into a community interest company, with the first National Black & Diverse Safeguarding Professionals Awareness Day launching on 1 September 2026. Plans are underway for the next national conference in 2026."
        },
        {
            "text": "I’m honoured to be shortlisted for Social Justice Champion at the Social Worker of the Year Awards 2025, recognition that this movement is already shaping change. My hope? That these aren’t just calendar dates but calls to action—for safeguarding that is stronger, fairer and unapologetically inclusive."
        },
        {
            "heading": 2,
            "text": "Find out more"
        }
    ]
}