{
    "url": "https://vets.blog.gov.uk/2025/11/07/ems-extra-mural-studies-week-for-vet-students/",
    "title": "EMS (Extra Mural Studies) week for Vet students",
    "authors": [
        "Government Vets Blog Team"
    ],
    "categories": [
        "Government Veterinary Services"
    ],
    "pub_date": "2025-11-07T08:14:35+00:00",
    "content": [
        {
            "text": "Engaging with the veterinary community is vital in helping to promote the roles of Official Veterinarians (OVs) in the FSA as an attractive career path, so we do lots of work on this and the FSA EMS offer is an important part of this. The FSA run two weeks of EMS per year, in 2025 we had the first week in March and the second in September."
        },
        {
            "text": "What is EMS"
        },
        {
            "text": "EMS is basically work experience for veterinary students to gain practical experience in as many aspects of veterinary work as possible. The students have placements throughout their degree to prepare them for work and to increase their awareness of career opportunities after graduation. EMS placements are an essential part of veterinary education and students need to complete 26 weeks in the last 3 years of their degree."
        },
        {
            "text": "What the FSA placements involve"
        },
        {
            "text": "Our EMS placements focus on both FSA field and office-based work, which allows the student to experience day to day life across various veterinary roles in the FSA. Students shadow our vets in different teams. Placements are for five days, Monday and Tuesday in field visits and Wednesday to Friday in the London office. All placements include a mix of the following shadowing opportunities:"
        },
        {
            "text": "Students have the opportunity to see veterinary work from a non-practice perspective, gaining an awareness and understanding of animal health, welfare and veterinary public health in relation to food production, including One Health."
        },
        {
            "text": "We believe that if we invest this time into the veterinary student community this will promote the FSA and contribute to recruiting vets in the future."
        },
        {
            "text": "Particularities of our last EMS week in September"
        },
        {
            "text": "As the FSA have only recently had access to our new office in London and given the timing of the EMS week, we needed to look for an alternative solution for our EMS office programme. The RCVS was really kind to us and allowed us the use of their almost brand new offices in Clerkenwell. The facilities were great and our special thanks go to Ben Myring who facilitated a seamless experience. He gave us a tour of the building and talked to students about current veterinary issues, while Britta Crawford also delivered a talk about VetGDP."
        },
        {
            "text": "We had the full allocation of 8 students (4 from Bristol and one each from Liverpool, RVC, Cambridge and Surrey)."
        },
        {
            "text": "The feedback has been great as always and these are a couple of quotes from the students:"
        },
        {
            "text": "We would like to thank everyone who helped with field visits and with sessions at the RCVS office, for helping us to deliver this important piece of work in our engagement with Universities and the future vets in the UK."
        }
    ]
}