{
    "url": "https://teaching.blog.gov.uk/2025/11/07/governors-pupil-premium-strategies/",
    "title": "How governors can support effective pupil premium strategies in schools",
    "authors": [
        "Governor at Ark Greenwich Free School"
    ],
    "categories": [
        "Pupil Premium"
    ],
    "pub_date": "2025-11-07T13:06:46+00:00",
    "content": [
        {
            "text": "Quick summary"
        },
        {
            "text": "Ark Greenwich Free School (AGFS) is a co-educational secondary school in south-east London. According to the 2019 Index of Multiple Deprivation, its catchment includes areas ranked in the 2nd-4th deciles nationally. The school has 600 pupils (42% eligible for pupil premium) and serves high numbers of students with additional learning needs and English as an additional language."
        },
        {
            "text": "Governing boards oversee pupil premium impact by reviewing strategies and discussing grant usage with senior leaders. They scrutinise a school's pupil premium strategy and discuss how the grant is used with senior leaders. We spoke to AGFS' pupil premium link governor about their role in supporting the school's strategy."
        },
        {
            "heading": 2,
            "text": "Identifying key barriers facing disadvantaged pupils "
        },
        {
            "text": "Following years of improvement, AGFS achieved an outstanding Ofsted rating across all areas and is considered “among the highest performing schools in the country” by the Evening Standard. The school has adopted a “Pupil Premium Grant (PPG) first” approach to address key challenges facing disadvantaged pupils: "
        },
        {
            "text": "Our pupil premium strategy details these challenges and outlines how we spend the grant to address them systematically. "
        },
        {
            "text": "At AGFS, outcomes for PPG students are excellent, with a provisional average Attainment 8 score in 2025 of 62.4, compared to 34.9 for the national average of all disadvantaged pupils. This success demonstrates that effective PPG strategies works for everyone, including those children with SEND. "
        },
        {
            "heading": 2,
            "text": "How Pupil Premium Grant Link Governors help drive success "
        },
        {
            "text": "As a PPG Link Governor, my role centres on providing strategic support and challenge to raise the profile, attainment, and progress of students eligible for the Pupil Premium.  "
        },
        {
            "text": "Working with our Local Governing Body (LGB), we developed a research-based approach linked to the Sutton Trust. LGB meetings focus on analysing the grant’s impact on targeted groups, examining their attainment, and progress compared to peers, and reviewing their participation in school performances, visits, and extra-curricular activities.  "
        },
        {
            "text": "Regular conversations with school leaders explore student needs and optimal spending strategies."
        },
        {
            "text": "Our comprehensive PPG strategy clearly outlines expected outcomes and success criteria, providing an invaluable framework for questioning whether measures are being met."
        },
        {
            "text": "Throughout the school year, I monitor whether our challenge and support approaches are working, using LGB meetings to examine data trends, such as attendance gaps between pupil premium and non-pupil premium pupils."
        },
        {
            "heading": 2,
            "text": "Steps to become an effective Pupil Premium Link Governor "
        },
        {
            "text": "The most effective way to understand your school's disadvantage strategy is spending time in your school. Organise specific visits to meet with the Pupil Premium Lead, reviewing annual activities or discussing performance data to understand whether gaps narrowing. "
        },
        {
            "text": "Additional school visits beyond pupil premium-focused meetings provide valuable context about your school's environment and the specific challenges facing disadvantaged students. "
        },
        {
            "text": "While awareness of your school’s demographic composition matters, a high proportion of pupil premium pupils shouldn’t be seen as a barrier to success. AGFS exemplifies strategic thinking in understanding and addressing disadvantaged pupils’ needs. Despite having a high proportion of pupil premium students in 2024-25, the school maintains its outstanding Ofsted rating as one of the highest-performing secondary schools in the country.  "
        },
        {
            "heading": 2,
            "text": "Further resources  "
        },
        {
            "text": "Department for Education publications  "
        },
        {
            "text": "Education Endowment Foundation resources  "
        },
        {
            "text": "DfE pupil premium webinars  "
        }
    ]
}