{
    "url": "https://gfie.blog.gov.uk/2025/11/07/introducing-the-gfie-pathway-to-stem/",
    "title": "Introducing the GFiE Pathway to STEM",
    "authors": [
        "karlharvey1"
    ],
    "categories": [
        "#GFIEsuccessstory",
        "Break down barriers to opportunity",
        "Life Chance Recruitment",
        "National STEM Day",
        "Pathway to STEM"
    ],
    "pub_date": "2025-11-07T11:03:11+00:00",
    "content": [
        {
            "text": "This National STEM Day (8th November), we’re proud to spotlight an exciting new initiative: Pathways to STEM, a Civil Service recruitment pathway accredited under Going Forward into Employment (GFiE)."
        },
        {
            "text": "The pathways purpose is to create structured routes into Science, Technology, Engineering, and Mathematics (STEM) careers for individuals from underrepresented backgrounds, helping to break down barriers and build a more diverse, skilled workforce."
        },
        {
            "heading": 3,
            "text": "What is GFiE Pathways to STEM?"
        },
        {
            "text": "Pathways to STEM was designed to:"
        },
        {
            "text": "This pathway enables Civil Service departments to recruit talented individuals from underrepresented groups into STEM roles through education and fixed-term posts, with the potential for permanent employment."
        },
        {
            "heading": 3,
            "text": "Who Does It Support?"
        },
        {
            "text": "Departments can use the accreditation to recruit individuals who:"
        },
        {
            "text": "Come from underrepresented backgrounds, including: "
        },
        {
            "text": "Face barriers such as limited access to education or lack of role models. "
        },
        {
            "heading": 3,
            "text": "How Does It Work?"
        },
        {
            "text": "Departments identify their skills gaps and areas of underrepresentation in STEM roles. The pathway lead then collaborates with charities, organisations, and training providers dedicated to supporting individuals from these groups. Together, they deliver tailored education and training so candidates can hit the ground running in their new roles."
        },
        {
            "text": "We are currently working with multiple providers, organisations, and charities to explore education opportunities and identify underrepresented groups we can support. In parallel, we’re engaging with government departments across the UK to understand their diversity and STEM challenges—and how they can utilise the Pathways to STEM GFiE programme to bring individuals into roles and give them meaningful opportunities."
        },
        {
            "heading": 3,
            "text": "Celebrating Success with Code First Girls"
        },
        {
            "text": "The Intellectual Property Office (IPO) has a strong history of supporting women in tech through its partnership with Code First Girls (CFG). This photo shows the most recent cohort graduating from their CFG nano-degree—a testament to the incredible talent and commitment these programmes foster."
        },
        {
            "text": "Building on this success, we’re thrilled to announce the first CFG pilot under the Pathways to STEM scheme, which takes this collaboration to the next level by creating structured routes into Civil Service STEM roles"
        },
        {
            "text": "The Intellectual Property Office (IPO) has recruited and sponsored four Code First Girls through a 16-week nano-degree bootcamp. These talented individuals will join the IPO in February 2026 for a two-year fixed-term opportunity in DevOps, development, and testing, with the chance of permanent employment."
        },
        {
            "text": "This is just the beginning and we’re excited to see the impact this scheme will have across the Civil Service."
        }
    ]
}