{
    "url": "https://nationalscreening.blog.gov.uk/2025/11/07/sign-up-for-uk-nsc-online-seminar-on-assessing-screening-programme-effectiveness/",
    "title": "Sign up for UK NSC online seminar on assessing screening programme effectiveness",
    "authors": [
        "TJ Day"
    ],
    "categories": [
        "Abdominal Aortic Aneurysm Screening",
        "UK National Screening Committee"
    ],
    "pub_date": "2025-11-07T09:06:09+00:00",
    "content": [
        {
            "text": "The UK National Screening Committee holds online seminars on important themes related to screening tests and programmes."
        },
        {
            "text": "Our next seminar will look at assessing the effectiveness of screening programmes, using the 10-year effectiveness review of abdominal aortic aneurysm (AAA) screening as a case study."
        },
        {
            "text": "The seminar, held via MS Teams, will be on Monday 1 December 2025, 10.30am to 12.00pm (GMT)."
        },
        {
            "text": "Presentations will be followed by a panel Q&A session."
        },
        {
            "heading": 2,
            "text": "Measuring the success of screening"
        },
        {
            "text": "This seminar will look at:"
        },
        {
            "text": "We will hear from colleagues involved in the AAA screening effectiveness review, and how the resulting report has been used."
        },
        {
            "text": "The seminar will be chaired by Professor Anne Mackie, UK NSC Director of Programmes. Our presenters will be:"
        },
        {
            "heading": 2,
            "text": "UK NSC seminars"
        },
        {
            "text": "Anyone with a role or interest in screening is welcome to register for this event. Feel free to share the details with colleagues."
        },
        {
            "text": "Please note our seminars are not recorded, but we share the presentation slides in our blog and via our UK NSC seminars webpage."
        },
        {
            "heading": 2,
            "text": "Keep up to date "
        },
        {
            "text": "The UK NSC blog provides up to date news from the UK NSC. You can register to receive updates direct to your inbox, so there is no need to keep checking for new articles. If you have any questions about this blog article, or about the work of the UK NSC, please email uknsc@dhsc.gov.uk. "
        }
    ]
}