{
    "url": "https://space.blog.gov.uk/2025/11/07/uk-leads-global-earth-observation-as-ceos-chair-in-2025/",
    "title": "UK Leads Global Earth Observation as CEOS Chair in 2025 ",
    "authors": [
        "UK Space Agency"
    ],
    "categories": [
        "Earth from space",
        "Earth observation"
    ],
    "pub_date": "2025-11-07T10:28:28+00:00",
    "content": [
        {
            "text": "The United Kingdom has concluded its tenure as Chair of the Committee on Earth Observation Satellites (CEOS), marking a transformative year for the global Earth observation (EO) community. "
        },
        {
            "text": "Under the leadership of the UK Space Agency, the UK has advanced national priorities while elevating EO’s role in international climate action, youth engagement, methane monitoring, and public sector innovation – culminating in an international Plenary held this week in Bath, UK. "
        },
        {
            "text": "CEOS brings together more than 60 space agencies and international organisations to coordinate civil EO satellite missions worldwide."
        },
        {
            "text": "In 2025, the UK took the helm with a bold vision: to unite the EO community under the theme ‘Unlocking EO for Society’, which explores how satellite data can inform global decisions, inspire future generations and drive meaningful impact. "
        },
        {
            "heading": 2,
            "text": "Success in UK Chair Objectives "
        },
        {
            "text": "In partnership with Japan Aerospace Exploration Agency (JAXA), the UK Space Agency led work to strengthen CEOS and Coordination Group for Meteorological Satellites (CGMS) contributions to the UNFCCC’s Global Stocktake. "
        },
        {
            "text": "Through targeted training and lessons learned for inventory compilers, the UK helped enhance the credibility and usability of satellite-derived climate data. "
        },
        {
            "text": "These efforts have further aligned EO activities with IPCC priorities and reinforced EO’s role as a cornerstone of the Paris Agreement’s Enhanced Transparency Framework. "
        },
        {
            "text": "To inspire the next generation, the UK hosted a dedicated Youth Summit on 4th November, giving students the opportunity to present their EO research posters to CEOS delegates."
        },
        {
            "text": "This exchange between students and senior space leaders sparked fresh ideas and showcased the power of EO to engage and empower future scientists and innovators. "
        },
        {
            "text": "Jointly led by the UK’s National Physical Laboratory (NPL) and NASA’s Jet Propulsion Laboratory (JPL), CEOS also launched a major global initiative to standardise methane emissions monitoring."
        },
        {
            "text": "Collaborating with UNEP’s International Methane Emissions Observatory (IMEO), the UK helped develop robust, reproducible guidelines for facility-scale methane quantification using satellite data."
        },
        {
            "text": "This will guide the growing constellation of Greenhouse gas (GHG) satellites, ensuring their outputs meet the highest scientific standards."
        },
        {
            "text": "These efforts directly support the UK Government’s Methane Action Plan, which prioritises enhanced detection and quantification of methane emissions through satellite technologies and international collaboration. "
        },
        {
            "text": "Recognising the untapped potential of EO for public services, the UK Space Agency convened CEOS agencies to share national strategies and explore new pathways for data-driven transformation."
        },
        {
            "text": "A dedicated workshop at the 2025 SIT Technical Workshop catalysed discussions on bridging the gap between EO data and public sector applications from urban planning to disaster response. "
        },
        {
            "heading": 2,
            "text": "A Legacy of Collaboration "
        },
        {
            "text": "Throughout its chairship, the UK created space, literally and figuratively, for EO to be seen and heard in the COP process."
        },
        {
            "text": "By fostering collaboration, innovation, and strategic engagement, the UK has helped CEOS evolve into a more inclusive and impactful force for global good. "
        },
        {
            "text": "The Plenary is just the tip of the iceberg. Throughout the year, CEOS technical experts meet virtually and in person to progress the work areas that range from virtual constellations, calibrations, tiger teams and study groups."
        },
        {
            "text": "The Plenary provides an opportunity to acknowledge this excellent work, celebrate progress, and set the visons for the future.  "
        },
        {
            "text": "As the baton passes to the next CEOS Chair – an Australian consortium of CSIRO, Geoscience Australia and Bureau of Meteorology, the UK’s legacy will endure: a year of bold leadership, meaningful partnerships, and a renewed global commitment to harnessing Earth observation for a better future. "
        }
    ]
}