{
    "url": "https://planninginspectorate.blog.gov.uk/2025/11/07/what-does-the-future-of-planning-look-like-to-you/",
    "title": "What does the future of planning look like to you? ",
    "authors": [
        "pinscomms"
    ],
    "categories": [
        "apprenticeships",
        "Local plans",
        "Recruitment"
    ],
    "pub_date": "2025-11-07T14:50:07+00:00",
    "content": [
        {
            "text": "Every year on 8 November, planners and communities across the world come together to celebrate World Town Planning Day – a moment to recognise how good planning improves lives, creates vibrant places to live, work and play, and shapes sustainable, inclusive communities for the future. "
        },
        {
            "text": "This year's theme is 'With Planning We can!' – celebrating planning as part of the solution to the social, economic and environmental challenges we face. From delivering the right homes in the right locations to working with nature to address climate challenges, planning empowers communities and creates pathways to prosperity for all. "
        },
        {
            "text": "Here at the Planning Inspectorate, we're proud to play our part in this mission, ensuring decisions are fair, robust and consider both local needs and the bigger picture. On this 75th anniversary of World Town Planning Day, we're reflecting on what planning means to us and the difference we can make together. "
        },
        {
            "heading": 2,
            "text": "Building diverse careers in planning"
        },
        {
            "text": "To better serve our community, we encourage many routes into working with the Planning Inspectorate, with people coming into our organisation from all sorts of backgrounds and experiences.  "
        },
        {
            "text": "Katy Dryden, Jamauri Brown and Stephen Barnes, recently recruited to the Planning Inspectorate, tell us how they got here and what they want to see and contribute to the future of planning. "
        },
        {
            "text": "Katy Dryden joined as a planning inspector after 27 years working within local planning authorities. "
        },
        {
            "text": "\"I’m hoping that the future of planning will involve building respect and understanding of its meaningful role and value to society. The planning profession can be seen negatively in the public gaze, and we can help influence this perception through education. Greater interaction is needed with education establishments to promote the career for students interested in human geography and environmental/ social issues. Innovative pathways such as apprenticeships should be fully explored to widen access to planning careers and to ensure that the workforce truly reflects our diverse communities.\""
        },
        {
            "text": "Jamauri Brown is a case officer for the Planning Inspectorate, and came to us as an apprentice. "
        },
        {
            "text": "\"I started my journey in planning back in May last year as an administrative apprentice, and it's been eye-opening to see how much teamwork, organisation, and communication go into shaping fair and sustainable decisions. Since then, I've developed a real appreciation for how planning impacts everyday lives - from communities to infrastructure. Looking ahead, I'd like to continue leveraging my skills and confidence as a case officer, gaining deeper technical knowledge and contributing to projects that use innovation, like AI in an ethical way - this would help streamline the repetitive processes, improve data analysis and free up time for planners to focus more on decision making. For me, the goal is to keep developing while helping make the planning process more transparent, efficient, and accessible for everyone Involved.\" "
        },
        {
            "text": " Stephen Barnes is a planning inspector and has a background in development management in local government and working with councils across England to promote digital planning. "
        },
        {
            "text": "\"Growing up on a housing waiting list, I’m keenly aware that some voices that we hear from the least in our planning process are those with the greatest need. Becoming an inspector is a huge privilege - it allows me to help ensure decisions are both technically sound and consider the big picture, including the interest of local communities . Looking ahead, I hope we use this moment of huge pressure to rethink how planning processes work: to make them more responsive, inclusive, and able to meet today’s challenges.\""
        },
        {
            "heading": 2,
            "text": "Shape the future of planning"
        },
        {
            "text": "At the Planning Inspectorate, we're undertaking the largest expansion of the planning inspector profession in decades. We're keen to build a team that reflects the communities we serve, bringing diverse perspectives to the appeals process and local plan examinations. We're recruiting planning inspectors to conduct local plan examinations across England – and we want to hear from experienced planning professionals. "
        },
        {
            "text": "This is a rare opportunity to use your planning expertise to influence strategic development across England, work on varied and complex casework, and enjoy flexible, predominantly home-based working. As part of the Civil Service, you'll benefit from excellent pension schemes, generous annual leave and flexible working. "
        },
        {
            "text": "Could you be part of shaping planning's future? Register your interest to be notified when applications open."
        }
    ]
}