{
    "url": "https://mhclgmedia.blog.gov.uk/2025/11/07/widespread-reaction-to-social-housing-and-brownfield-funding/",
    "title": "Widespread reaction to social housing and brownfield funding",
    "authors": [
        "mhclgpress"
    ],
    "categories": [
        "Affordable housing"
    ],
    "pub_date": "2025-11-07T12:08:00+00:00",
    "content": [
        {
            "text": "There has been widespread national and regional coverage about our announcement today setting out further details of the historic £39 billion Social and Affordable Homes Programme as well as freeing up £150 million from the Brownfield Housing Fund."
        },
        {
            "text": "Coverage across the board highlighted Mayors will for the first time ‘lead the charge’ to prioritise indicative spending of £7 billion, split across six regions, as part of the Housing Secretary’s drive to accelerate the biggest increase in social and affordable housebuilding in a generation. This is alongside more money for Mayors to transform derelict brownfield sites into thousands of new homes in their regions."
        },
        {
            "text": "This announcement has been covered by I News, The Independent, The Sun that all mention mayors and councils being urged to ‘go bold’ with their plans for new social housing ahead of bidding for grant funding officially opening in February next year. This is on top of sweeping measures to remove barriers for councils to build social housing at a scale not seen in years. There is also further pick up in Inside Housing, Housing Today, Local Government Chronicle, Municipal Journal, Property Week and Big Issue reporting about the £7 billion boost for regional Mayors."
        },
        {
            "text": "Comments from the Housing Secretary featured in The Daily Mirror setting out how the new measures will be “empowering people, including our great mayors and great councils” who will be “firmly in control of what types of homes get built”."
        },
        {
            "text": "Various regional outlets have also covered the funding in their respective regions, including Yorkshire Post and Birmingham Live,who both quote the Housing Secretary talking about how the new investment will be lifechanging for thousands of families waiting for a safe, secure home of their own. Other regional coverage includes London Standard, Liverpool Echo, Telegraph & Argus, Chronicle Live, Manchester Evening News, Express and Star, Bury Mercury and Wilts and Gloucestershire Standard.  "
        },
        {
            "text": "The social housing and brownfield funding news has been warmly welcomed by seven regional Mayors and several organisations across the sector, with comments from groups including Homes England, National Housing Federation and the G15."
        },
        {
            "text": "The Housing Secretary undertook the broadcast round this morning speaking to the new funding on Times Radio, Sky News, BBC 5 Live, LBC, ITV’s Good Morning Britain, and GB News."
        },
        {
            "text": "Housing Secretary Steve Reed said:  "
        },
        {
            "text": "\"Families have been trapped in so-called temporary accommodation for years or stuck on council waiting lists with no hope of a secure home.   "
        },
        {
            "text": "“We're changing that for good with the biggest boost to social housebuilding in a generation and getting behind mayors who are ready to build affordable housing across their regions.  "
        },
        {
            "text": "\"We're also backing councils to build again and transform derelict sites into thriving neighbourhoods, urging them to go big, go bold and go build.”   "
        },
        {
            "text": "Mayor of the Liverpool City Region, Steve Rotheram said:  “This marks the single biggest earmarked investment in housing our region has ever seen – and the largest pot of funding we’ve ever seen for social and affordable homes. It’s a massive vote of confidence from the government in our region’s ability to deliver."
        },
        {
            "text": "“Since I was elected, we’ve built more than 32,000 homes, invested a further £60m developing brownfield sites, and retrofitted 10,000 houses. We’ve built up real momentum – but now we’re ready to turbocharge our housebuilding plans. "
        },
        {
            "text": "“This new funding will help us go even further towards our target of building 16,000 new social and affordable homes over the next decade – good quality homes that local people can be proud of while also helping us to tackle the homelessness crisis. "
        },
        {
            "text": "“We’ve got the vision, the skills, and an abundance of ambition to help the government hit its national targets – but, most importantly, this is about helping more local people and families into safe, secure, and affordable homes of their own. Homes where people can put down roots, build their futures, and get on the housing ladder. "
        },
        {
            "text": "“We’re ambitious, we’re excited, and we’re ready to get to work – so let’s build, baby, build!” "
        },
        {
            "text": "Mayor of Greater Manchester Andy Burnham said:  "
        },
        {
            "text": "“Having a decent, secure home in a healthy and safe place is one of the foundations of a good life. But too many people in our city region are being held back because of a housing crisis that has gripped the country. "
        },
        {
            "text": "“Today’s announcement is a major step towards changing that: unlocking land, building the right homes in the right places, and giving local areas more of a say in how our communities grow. "
        },
        {
            "text": "“The investment in social and affordable homes is especially important. It means we can get on with the job of delivering 10,000 new, energy efficient homes for social rent by 2030 - homes that people can actually afford and that will stand the test of time. \"Working with Homes England, we’re determined to make this funding count for every community across Greater Manchester.” "
        },
        {
            "text": "Mayor of the North East, Kim McGuinness said:  "
        },
        {
            "text": "\"I am going to make sure we use every penny of the £1.1bn earmarked to help build thousands more homes to rent and more affordable homes across the North East.“The next step is making sure Homes England are ready to match this ambition and will move at speed to start building the houses we need.“While we work up those plans we're getting on with the job of preparing sites for new housing,  ready to far exceed the 705 new homes we have so far cleared the way for on brownfield land in Gateshead, Easington, Ashington and many other parts of the region.\" "
        },
        {
            "text": "Mayor of West Yorkshire, Tracy Brabin said: "
        },
        {
            "text": "“With council house waiting lists and private rents at breaking point, addressing the housing crisis is the most fundamental step our government could take to build a brighter Britain. "
        },
        {
            "text": "“By increasing the amount of affordable homes funding and aligning it to regional priorities, this government is empowering Mayors to accelerate the delivery of affordable homes across the country. This is a welcome first step towards the full devolution of affordable homes funding. "
        },
        {
            "text": "“With £1 billion earmarked for West Yorkshire, we will be able to go even further to build on our success, where last year our partners built more affordable homes than at any time since the financial crash. "
        },
        {
            "text": "“Working with the government, our councils and our social housing providers, we’re determined to guarantee a safe and secure roof over the heads of the 2.4 million people who call our region home.” "
        },
        {
            "text": "Mayor of South Yorkshire, Oliver Coppard, said:  "
        },
        {
            "text": "“This money from Government is game-changing for us; giving us the opportunity to clear hundreds of derelict sites and build thousands of homes.  "
        },
        {
            "text": "“£700m will allow us to focus on helping to build social and affordable housing meaning we can offer everyone in our community a high-quality home in South Yorkshire, so they can stay near and go far.” "
        },
        {
            "text": "Mayor of York and North Yorkshire, David Skaith said:  "
        },
        {
            "text": "“Our region is home to beautiful rural and coastal towns but, with rising rents, costs and second home ownership, working families are being priced out.  "
        },
        {
            "text": "“That’s why we’re taking action. I’m proud that Government has backed our work with a £7.3 million boost to build nearly 300 new affordable homes on brownfield land. "
        },
        {
            "text": " “This takes our Brownfield Housing Fund to a total of 1,400 homes across the region - a great step forward, but just the start. We’ll keep going until every young person has the chance to stay, build a life, and thrive in the communities they call home.” "
        },
        {
            "text": "Mayor of the West Midlands, Richard Parker, said: "
        },
        {
            "text": "“For too long there’s been chronic underinvestment in social and affordable housing. That’s blighted thousands of West Midlands families who have been left struggling to pay expensive private sector rents or stuck in temporary accommodation that can often be poor quality.  "
        },
        {
            "text": "“Helping these families into safe, warm homes that are genuinely affordable is the cornerstone of my Homes for Everyone priority. We’ve made a strong start, but the scale and ambition of this funding will help us go much further, faster.  "
        },
        {
            "text": "“I look forward to continuing to work with Homes England so we can use this money to provide the homes local people need and change thousands more lives for the better.” "
        },
        {
            "text": "Mayor of the East Midlands, Claire Ward, said:  "
        },
        {
            "text": "“Securing this funding marks another opportunity to transform communities in our region. Part of our vision for inclusive growth in the East Midlands is to build 100,000 homes – unlocking new, affordable, and modern places for our residents to live. "
        },
        {
            "text": "“Already, the Government is supporting our ambition and recognising our ability to deliver. These developments will bring brownfield land back into use, deliver high-quality homes, and create jobs for local people. This is about more than housing – it’s about building a stronger, fairer future for the East Midlands. "
        },
        {
            "text": "“I’m committed to ensuring that every new home built is part of a bigger story: one of opportunity, sustainability, and pride in place for the people of the East Midlands.” Homes England Chief Executive Amy Rees CB said:    “The importance of this funding cannot be underestimated in opening the door to thousands of new, affordable homes for communities across the country – and we will do everything in our power to ensure every penny of grant allocation helps deliver the right homes in the right places, at pace, for the people who need them. "
        },
        {
            "text": "“Our team is incredibly proud and driven to help create a new generation of affordable and social rent homes, working alongside local leaders who know their communities best, and providers who have the expertise and commitment to deliver with our support.” "
        },
        {
            "text": "Chief Executive of the National Housing Federation, Kate Henderson said:   “Today’s announcements send a clear signal that social and affordable housing remains a pillar of the government’s housebuilding ambitions. "
        },
        {
            "text": "“While the housing crisis touches all parts of the country, different areas have different needs. These plans will empower mayors to work alongside housing associations to meet the specific housing requirements of their local communities – be that family-sized homes, or homes for older people. "
        },
        {
            "text": "“With a record 170,000 children now homeless and living in damaging temporary accommodation, delivering on a decade of renewal for social housing has never been more important. Housing associations are already ramping up their plans for housebuilding and are committed to working in partnership with the government to deliver the homes our country needs.” "
        },
        {
            "text": "Peabody CEO and Chair of the G15, Ian McDermott said: "
        },
        {
            "text": "“It’s great to see the government backing Mayors to help build more social and affordable homes. This will help regional leaders to support communities and drive local growth through social and affordable housebuilding, and we’re ready to play our part.   "
        },
        {
            "text": "“As not-for-profit social landlords, we work alongside mayors and councils to regenerate places and provide more and better social homes across the country. We warmly welcome the government’s ambition and commitment and will continue to do all we can to help deliver a decade of growth and renewal for social housing.”"
        }
    ]
}