{
    "url": "https://educationhub.blog.gov.uk/2016/07/education-in-the-media-5-july-2016/",
    "title": "Education in the media: 5 July 2016",
    "authors": [
        "Media Officer"
    ],
    "categories": [
        "Careers",
        "Exams and qualifications",
        "Trade Unions"
    ],
    "pub_date": "2016-07-05T12:33:48+01:00",
    "content": [
        {
            "text": "Today's news review looks at the response from ministers to the NUT's strike action, the publication of Key Stage 2 results this morning and a report on careers education."
        },
        {
            "heading": 2,
            "text": "NUT strike"
        },
        {
            "text": "The Education Secretary and Schools Minister have been quoted in the Times today criticising the NUT today’s strike action. Nick Gibb called it a 'futile politically motivated gesture' and warned that the strike could put pupils' education at risk, damage the reputation of the teaching profession and inconvenience parents who are forced to take time off work."
        },
        {
            "text": "Nicky Morgan was interviewed on various broadcast media this morning, reiterating the points from her letter to the NUT's Kevin Courtney on Saturday. She said it is disappointing that the union has chosen to take this damaging action instead of continuing with the programme of talks with the Department. As she made clear in her letter, the NUT should share the Department’s focus of giving children the best start in life and spreading educational excellence everywhere, rather than playing politics with children’s futures over the issue of pay and conditions."
        },
        {
            "text": "It is especially disappointing that strike action has been taken when less than a quarter of NUT members took part in the ballot – less than 10% of the teaching profession."
        },
        {
            "text": "On funding, the Education Secretary made clear in her interviews today that the schools budget for this year will total around £40 billion, an increase of around £4bn since 2011-12, and is now the highest it has ever been. Going forward, it has been protected in real terms at a time when other areas of spending are facing reductions. She also highlighted that we have more teachers in our schools than ever before - latest figures show that the number of new teachers entering our classrooms outnumbers those who retire or leave. There are also more teachers returning to the profession, demonstrating how many people relish the prospect of a career where they can transform lives every day."
        },
        {
            "text": "We have published statistics on the number of schools that have been affected by the strike today, highlighting that 7 out of 8 schools remain open or partially open."
        },
        {
            "heading": 2,
            "text": "Key Stage 2 results"
        },
        {
            "text": "Today we have published national Key Stage 2 results for 2016, showing that schools and pupils are rising to the challenge of meeting the new higher standard expected of them."
        },
        {
            "text": "The results show that more than half of pupils (53%) met the new expected standard in reading, writing and mathematics. Two thirds (66%) achieved the expected standard in reading, 70% of pupils achieved the expected standard in maths, 72% achieved it in the grammar, punctuation and spelling test and nearly three quarters of pupils (74%) achieved it in writing."
        },
        {
            "text": "The Education Secretary has made clear in comments she made to the BBC on Monday - and reported by the Telegraph today - that this year's results cannot be compared with those of previous years. This is the first year of a more rigorous curriculum, of new tests and new teacher assessments based on the best evidence from around the world."
        },
        {
            "text": "Education Secretary Nicky Morgan said today:"
        },
        {
            "text": "Results were released at 11am today and are published here. Read our press notice here."
        },
        {
            "heading": 2,
            "text": "Careers education"
        },
        {
            "text": "The Sub-Committee on Education, Skills and the Economy (ESE) has published a report on the provision of careers advice in schools, suggesting that too many young people are not getting the quality of advice they need to make informed decision about their future."
        },
        {
            "text": "The Sun and the Metro have run small articles today. BBC online has also covered the story."
        },
        {
            "text": "We are clear that our reforms are working.  Pupils are leaving education better prepared for further study and work - we now have the lowest number of NEETs on record and the highest ever number of young people going into higher education."
        },
        {
            "text": "But we agree that the careers advice available to young people in our schools is not yet good enough. Good careers advice is vital in helping young people, whatever their background, make informed choices and go on to fulfilling jobs. That's why are investing £90m over this Parliament to transform careers education and guidance and build on the progress we have made in improving the life chances of the next generation."
        },
        {
            "text": "We have established the Careers & Enterprise Company, which is taking a leading role strengthening the links between employers, schools and colleges and careers and enterprise organisations - to inspire young people and help prepare them for the world of work. We have also made it mandatory for all schools and colleges to secure independent careers guidance for all 12 to 18-year-olds, on the full range of education and training options including apprenticeships."
        },
        {
            "text": "Later this year we will publish the Government’s strategy for improved careers education for young people which will provide a roadmap for this parliament and set out what we want to achieve by 2020."
        },
        {
            "text": "Education and Childcare Minister Sam Gyimah said:"
        },
        {
            "text": "The National Careers Service supports young people and their parents to make informed decisions about their career pathways and future options.  It is available online and by freephone (0800 100 900) and webchat and provides free, up to date, impartial information and advice and guidance on careers, skills and the labour market."
        }
    ]
}