{
    "url": "https://icsdigital.blog.gov.uk/2025/08/13/our-experience-on-a-cyber-threat-intelligence-placement/",
    "title": "Our experience on a cyber threat intelligence placement",
    "authors": [
        "Chloe Rowe",
        "Ethan Clifford"
    ],
    "categories": [
        "How we work",
        "People and recruitment",
        "Skills and development"
    ],
    "pub_date": "2025-08-13T10:48:22+01:00",
    "content": [
        {
            "text": "Our journey at ICS as Cyber Threat Intelligence Analysts began in June 2024 where we joined as two placement students from Sheffield Hallam University studying cyber security. "
        },
        {
            "text": "This is the first proper job within the cyber security sphere for both of us and it has already met and exceeded our expectations. "
        },
        {
            "heading": 2,
            "text": "First impressions and initial challenges "
        },
        {
            "text": "Transitioning from being university students to working full time in cyber with ICS was certainly something we both looked forward to since getting our offers. "
        },
        {
            "text": "We have been surrounded by a fantastic team who have encouraged us and have been consistently supportive since we have joined. This made for a smooth transition and helped take away that overwhelming aspect. "
        },
        {
            "heading": 2,
            "text": "Skills acquired "
        },
        {
            "text": "One aspect to our placement that we have particularly enjoyed is that we have not been assigned to one direct role, we have had the flexibility to emerge ourselves in various aspects of cyber security that ICS provide. "
        },
        {
            "text": "This includes threat intelligence research, rule creation and alert investigation in our SOC, indulging in Red Team Activity and much more. "
        },
        {
            "text": "We are gaining experience of an array of industry-specific tooling, most of which neither of us had used before. As well as learning on the job, we have been able to consolidate and showcase our new skills by taking on two professional certifications related to cyber. This wouldn’t have been possible without the opportunity to work at ICS. "
        },
        {
            "heading": 2,
            "text": "Key experiences "
        },
        {
            "text": "As well as being integrated within the cyber team, we have also worked alongside the wider ICS community. We have had the opportunity to present our recent work to colleagues at an Architecture meet up which was a new and exciting experience for us. "
        },
        {
            "text": "We have also had the opportunity to attend conferences associated with our work. These conferences have provided us with a wider view of cyber as well as allowing us to engage with the wider cyber community. "
        },
        {
            "text": "We have worked together to develop the threat matrix which has enabled us to conduct our threat research and analyse our red team testing in a simple and structured format, this is one of our projects that we have been particularly proud of. "
        },
        {
            "heading": 2,
            "text": "Personal growth "
        },
        {
            "text": "We have also noticed a strong personal development. Working as threat analysts has helped us develop the understanding of being aware 24/7 and the necessity of maintaining focus when working, something that can be easily forgotten about at university. "
        },
        {
            "text": "We feel our time at ICS has helped us with public speaking and being able to communicate with colleagues. "
        },
        {
            "text": "Alongside all the technical skills we have learned, we have also had the freedom and opportunity to display and improve our soft skills. Skills that enable us to communicate and interact with our colleagues and the wider community, these skills have been imperative in our development here at ICS. "
        },
        {
            "text": "These things, alongside working with some amazing, caring and knowledgeable people, have enabled us to maximise our experience so far with ICS. "
        }
    ]
}