{
    "url": "https://skillsengland.blog.gov.uk/2025/08/13/skills-england-better-skills-for-better-jobs/",
    "title": "Skills England: Better skills for better jobs ",
    "authors": [
        "Communications Team"
    ],
    "categories": [
        "News and announcements",
        "Strategy"
    ],
    "pub_date": "2025-08-13T11:04:14+01:00",
    "content": [
        {
            "text": "Skills England is creating better skills for better jobs. Our vision is to: "
        },
        {
            "text": "In our first blog, Phil Smith CBE, Skills England Chair, explains what's been happening over the last few weeks, expands on the Skills England vision and what this means for our work to drive economic growth and enable opportunity for all. "
        },
        {
            "text": "Over the last month I've had the opportunity to talk at many events and meet lots of extremely engaged and committed people and organisations and there is overwhelming interest in what Skills England is going to do in the skills space and how this will be done and also a re-assuring groundswell of support. Let me highlight a few areas."
        },
        {
            "heading": 2,
            "text": "Understanding our nation’s skills needs and improving our skills offer "
        },
        {
            "text": "Improving skills across the nation, as you will understand, is a huge task. To make sure we have maximum impact and to attempt to address the right areas, our starting point will be to identify skills gaps which are holding back growth and opportunity. "
        },
        {
            "text": "Currently, a third of job vacancies are driven by skills shortages. Employer investment in training per employee fell by a fifth from 2011 to 2022. Meanwhile, by 2035 we expect 1.4 million new jobs to be created, with potentially very different skills requirements, driven by technological change. "
        },
        {
            "text": "Addressing the reasons behind the decline in employer investment is complex, and multi-faceted but important that we understand much better. For example, as the shortages in the UK economy have grown, the pressure to recruit from abroad has increased, even where there is capacity and capability to train at home. Skills England will work with employers, providers and regions amongst others help understand the reasons for and reverse that trend. We will support employers to equip their domestic workforce with the skills they need for now and in the future. Working alongside the Plan for Change and Industrial Strategy, we will work to unify the currently fragmented skills landscape to help drive economic growth across all regions and access to high quality skilled jobs."
        },
        {
            "heading": 2,
            "text": "Simplifying access to skills "
        },
        {
            "text": "The skills system is complex and particularly challenging, although not exclusively, for individual learners trying to improve their access to high quality jobs as well as small business owners. Apprenticeships and technical education have a powerful and well relevant part to play in providing opportunities for school leavers and career changers and existing workers, but their uptake and acceptance needs to be radically improved if we they are going to play the role they could have in the future of our skills system.  "
        },
        {
            "text": "As part of this, we will make sure education and training pathways are clear. This will help both young people starting out in their careers, and adults who need to reskill. This means examining the existing pathways, removing duplication, and clarifying how people can enter and progress in high demand occupations. "
        },
        {
            "text": "Building on the occupational maps and the range of apprenticeships, T Levels, HTQs and other qualifications, Skills England will identify where training and qualifications need to be optimised to reduce skills gaps, support economic growth and help people build productive careers.  "
        },
        {
            "heading": 2,
            "text": "Co-creating solutions to local, regional and national skills needs with partners and employers "
        },
        {
            "text": "Collaboration must be at the heart of how we work to reshape the skills landscape. We want to co-design and co-creation of new approaches with industry and regional partners. This means on-going collaboration and dialogue, rather than occasional engagement with stakeholders in central and local government, businesses, employers, training providers, further and higher education, unions and representative bodies. It is vital that this is a productive and solution-oriented dialogue and we need all the help we can get from sectors, regions, employers, providers and others to coordinate this for agility and impact.  "
        },
        {
            "text": "The necessity to create a world-class, highly skilled workforce is critical and we are committed with your help to shape our system, which already had tremendous strengths to be the very best it can be."
        },
        {
            "text": "Phil Smith"
        },
        {
            "text": "Skills England Board Chair"
        },
        {
            "heading": 2,
            "text": "Follow our progress "
        },
        {
            "text": "You can follow us through a number of channels: "
        }
    ]
}