{
    "url": "https://naturalengland.blog.gov.uk/2025/08/13/the-species-recovery-programme-capital-grant-scheme-a-natural-england-partnership-success-story/",
    "title": "The Species Recovery Programme Capital Grant Scheme – a Natural England partnership success story",
    "authors": [
        "James Phillips",
        "Karen Shelley-Jones"
    ],
    "categories": [
        "Biodiversity",
        "Natural Capital",
        "Natural England",
        "Nature",
        "Nature Recovery",
        "Species recovery",
        "Wildlife"
    ],
    "pub_date": "2025-08-13T08:20:39+01:00",
    "content": [
        {
            "text": "By James Phillips - Principal Officer – Species Recovery and Species Re-introductions and Karen Shelley-Jones - Senior Officer – Funding and Grant Scheme Management"
        },
        {
            "text": "England’s species charm, intrigue, amaze and inspire us, sparking interest and concern in the natural world.  They have deep cultural resonance featuring in music, poetry and folklore. However, many of our native species are struggling.  Evidence shows that some 12% of our species are at risk of extinction in England and in the six years from 2012 to 2018, the average abundance of species declined approximately 3% per year."
        },
        {
            "text": "Natural England’s Species Recovery Programme (SRP) supports targeted action for England’s most vulnerable species. The Government’s Environment Act targets for species created renewed focus and Natural England developed a Capital Grant Scheme designed to support a wide range of new projects through grants of up to half a million pounds."
        },
        {
            "text": "Two Years of Action, A Future for Wildlife"
        },
        {
            "text": "We are now celebrating two years since Natural England announced the grants awarded by the Species Recovery Programme Capital Grant Scheme in September 2023. It has been an exciting period of delivery. Natural England has worked with and helped fund 63 projects involving 78 different partners across England, from the Lizard Peninsula in Cornwall to Cumbria and Northumberland."
        },
        {
            "text": "The Grant Scheme provided £12.8 million of funding, which generated £5.4 million of match funding by our partners, and a strong volunteer element, valued at £1.2 million."
        },
        {
            "text": "The range of activity and work completed to help our most threatened species is impressive. From research into the reasons for decline, testing recovery solutions, propagation of seeds, and conservation translocations, to direct bespoke habitat enhancement and creation on the ground, all these efforts deliver the key elements needed to drive species recovery. In 18 months, the Grant Scheme has created and enhanced of over 2,400ha of wildlife-rich habitats including over 260 hectares of flower-rich grassland meadows, 405 hectares of floodplain grasslands and 354 hectares of broadleaved and wet woodland enhanced. With 50 hectares of lowland and upland heathland, 100 hectares of wetlands, 13 hectares of lowland fen and 215 wildlife ponds created or restored. "
        },
        {
            "text": "150 species across a variety of taxonomic groups have directly benefitted from the targeted actions of these partnership projects, including amazing species such as the crystal moss animal, large marsh grasshopper, greater horseshoe bat, black grouse, willow tit, Eurasian curlew, wood white butterfly, Duke of Burgundy butterfly, large Atlantic pocket-moss, hazel dormouse, Lizard crystalwort, Atlantic salmon and northern pool frog."
        },
        {
            "text": "Highlights for our most threatened species have included:"
        },
        {
            "text": "Powered by People, Benefiting People"
        },
        {
            "text": "People are central to making all of this happen. Through the Grant Scheme we have directly funded over 60 full time equivalent staff into new and existing conservation roles. Volunteering plays a key role in delivering nature conservation with people’s passion for wildlife helping to make the difference. The Grant Scheme has helped over 4,000 people get more involved as volunteers in species recovery and 100,000 hours of volunteer time has been recorded, showing the importance of volunteers and citizen science. "
        },
        {
            "text": "Steve, a volunteer with the ‘White Cliffs and White Chalk’ National Trust project, said “It's been a real delight to meet and benefit from the knowledge of the professionals involved with the project, who have been so generous in sharing their knowledge. This and a feeling of real engagement with an amazing natural environment has been a huge psychological boost for me, especially after the isolation of COVID and only recently moving to the area. This has been, and continues to be, a great way to gain a better understanding of local ecology and to improve my understanding of the protected areas and species at risk.”"
        },
        {
            "text": "Partners have helped people engage more with nature by holding 465 public facing and educational events and activities, attended by over 80,000 members of the public from school children to contractors."
        },
        {
            "text": "What Next?"
        },
        {
            "text": "While we celebrate these achievements, there is still much to do. Many once common species continue to decline at an alarming rate."
        },
        {
            "text": "Natural England has evaluated the Grant Scheme, reviewed the feedback from partners and considered the latest species population assessments. This has helped us refine how we target and prioritise the Species Recovery Programme and how we streamline it for partners."
        },
        {
            "text": "Natural England will shortly be making an announcement about future plans. We look forward to working with, and expanding the range of partners involved in the Species Recovery Programme and are excited to see what successes we will be celebrating in 2030."
        },
        {
            "text": "To stay up to date with developments please email SRP@naturalengland.org.uk to be added to our mailing list."
        }
    ]
}