{
    "url": "https://insidehmcts.blog.gov.uk/2025/08/13/the-enquiries-team-the-human-face-of-the-royal-courts-of-justice/",
    "title": "The enquiries team – the human face of the Royal Courts of Justice",
    "authors": [
        "Stephen Clarke, Enquiry Desk Clerk, Royal Courts of Justice",
        "Steven Sanders, Customer Service, Royal Courts of Justice"
    ],
    "categories": [
        "General",
        "User experience and research",
        "Working at HMCTS"
    ],
    "pub_date": "2025-08-13T12:03:34+01:00",
    "content": [
        {
            "text": "[English] - [Cymraeg]"
        },
        {
            "text": "When you walk through the doors of the Royal Courts of Justice (RCJ) in London, you might feel a bit overwhelmed. The Victorian Gothic architecture, the hustle and bustle of legal professionals in their robes, and the sheer size of the building can be daunting."
        },
        {
            "text": "Whether you’re a seasoned barrister, a judge or a member of the public attending your first court hearing, we’re the first people you’re likely to meet. Between us we’re the unofficial welcomers, problem-solvers, and guides to one of our best-known court buildings."
        },
        {
            "heading": 2,
            "text": "More than just directions"
        },
        {
            "text": "Despite its grand appearance, the RCJ is a working court at the heart of the justice system. Each day justice is delivered across up to 96 courtrooms and a number of hearing rooms, where complex civil cases are heard and judges preside over matters ranging from commercial disputes to public law challenges."
        },
        {
            "text": "Our day starts at 8:15am when we prepare court lists for the day. Once the building opens to the public, we’re non-stop, dealing with enquiries from court users in person and on the phone, until closing time."
        },
        {
            "text": "We try to direct people to get their problems resolved as quickly as possible. Often, they’re going through complex and stressful situations and we’re the first people they meet. We don’t just see ourselves as intermediaries between court users and the departments they’re contacting - we’re the human face of the RCJ and HMCTS for the people that need us."
        },
        {
            "heading": 2,
            "text": "Ensuring everyone can access justice"
        },
        {
            "text": "One of the most important parts of our job is helping people who need extra support. We’re proud of our role in ensuring everyone has equal access to our services. We have a team of Disability Contact Officers (including Steven) who are specially trained to assist with disability-related queries and requests from our visitors. Disability Contact Officers help to coordinate reasonable adjustments for disabled court users, advise on accessibility, and help to ensure we meet our obligations under the Equality Act 2010."
        },
        {
            "text": "Recently a lady visited the RCJ who was partially blind. She was running late for her appointment with the Support Through Court charity. Understandably, she felt flustered, so we escorted her to her appointment, and offered to help her leave the building safely when she was ready. Things like that are important to people when they’re in an unfamiliar environment."
        },
        {
            "text": "We’re also here to help people with hidden disabilities. A positive change in recent years is the introduction of the Hidden Disabilities Sunflower lanyard, which helps us identify and offer help to people who have hidden disabilities. Hidden disabilities can range from chronic illnesses to sensory and processing difficulties, so we listen carefully to what each person needs. We’re proud to have pioneered this at the RCJ and it’s now been adopted by all our buildings."
        },
        {
            "heading": 2,
            "text": "The changing face of justice"
        },
        {
            "text": "We have 30 years of service between us and we’ve seen many changes over the years. Technology has transformed how the courts operate, with many processes now digital rather than paper based. Years ago, we’d see ushers carrying three sets of books into courtrooms for hearings. Now the information they need is on their laptops, which is much more efficient."
        },
        {
            "text": "Despite these technological advances, the human touch is still essential and our role on the front-line is even more important. Every day is different whether we’re helping a nervous person find their hearing, guiding a visitor with mobility issues through the building, or simply providing reassurance in an intimidating environment. We’re always ready to help and make a positive difference."
        },
        {
            "text": "[English] - [Cymraeg]"
        },
        {
            "heading": 2,
            "text": "Y tîm ymholiadau - wyneb ddynol y Llysoedd Barn Brenhinol"
        },
        {
            "text": "Pan fyddwch yn cerdded drwy ddrysau’r Llysoedd Barn Brenhinol (RCJ) yn Llundain, efallai y byddwch yn cael eich llethu. Mae pensaernïaeth Gothig Fictoraidd, prysurdeb y proffesiwn cyfreithiol yn eu gynau, a maint yr adeilad yn gallu bod yn frawychus."
        },
        {
            "text": "Pa un a ydych yn fargyfreithiwr profiadol, yn farnwr neu’n aelod o’r cyhoedd yn mynychu eich gwrandawiad cyntaf yn y llys, ni yw’r bobl gyntaf yr ydych yn debyg o gwrdd â nhw.   Rhyngom, ni yw’r croesawyr answyddogol, datryswyr problemau a thywyswyr i un o’n hadeiladau llys mwyaf adnabyddus."
        },
        {
            "heading": 2,
            "text": "Mwy na chyfarwyddiadau yn unig"
        },
        {
            "text": "Er gwaethaf ei ymddangosiad mawreddog, mae’r RCJ yn lys gweithredol sy’n ganolog i’r system gyfiawnder. Pob dydd, caiff cyfiawnder ei gyflawni ar draws hyd at 96 o lysoedd a nifer o ystafelloedd gwrandawiadau, ble gwrandewir ar achosion sifil cymhleth a barnwyr yn llywyddu dros faterion yn amrywio o ddadleuon masnachol i heriau cyfraith gyhoeddus. "
        },
        {
            "text": "Mae ein diwrnod yn dechrau am 8:15am pan fyddwn yn paratoi ein rhestrau llys am y diwrnod. Unwaith mae’r adeilad yn agor i’r cyhoedd, rydym yn brysur yn delio gydag ymholiadau gan ddefnyddwyr y llys yn bersonol a dros y ffôn, tan amser cau."
        },
        {
            "text": "Rydym yn ceisio cyfeirio pobl i gael datrys eu problemau gynted â phosibl. Yn aml, byddant yn mynd drwy sefyllfaoedd cymhleth a llawn straen a ni yw’r bobl gyntaf maent yn cwrdd â nhw. Nid ydym yn ystyried ein hunain fel cyfryngwyr rhwng defnyddwyr llys a’r adrannau maent yn cysylltu â nhw yn unig - ni yw wyneb ddynol yr RCJ a GLlTEF i bobl sydd ein hangen ni."
        },
        {
            "heading": 2,
            "text": "Sicrhau y gall pawb gael mynediad at gyfiawnder"
        },
        {
            "text": "Un o rannau pwysicaf ein swydd yw helpu pobl sydd angen cefnogaeth ychwanegol. Rydym yn falch o’n rôl i sicrhau bod gan bawb fynediad i’n gwasanaethau. Mae gennym dîm o Swyddogion Cyswllt Anabledd (gan gynnwys Steven) a hyfforddwyd yn arbennig i gynorthwyo gydag ymholiadau cysylltiedig ag anabledd a cheisiadau gan ein hymwelwyr.  Mae Swyddogion Cyswllt Anabledd yn helpu i gydlynu addasiadau rhesymol ar gyfer defnyddwyr llys anabl, cynghori ar hygyrchedd a helpu i sicrhau ein bod yn cwrdd â’n rhwymedigaethau o dan y Ddeddf Cydraddoldeb 2010."
        },
        {
            "text": "Yn ddiweddar, ymwelodd gwraig oedd yn rhannol ddall â’r RCJ. Roedd yn rhedeg yn hwyr ar gyfer ei hapwyntiad gyda’r elusen Support Through Court.  Yn naturiol, roedd yn teimlo’n ddryslyd, felly gwnaethom ei thywys i’w hapwyntiad, a chynnig ei helpu i adael yr adeilad yn ddiogel pan oedd yn barod. Mae pethau felly yn bwysig i bobl pan fyddant mewn amgylchedd anghyfarwydd."
        },
        {
            "text": "Rydym hefyd yma i helpu pobl gydag anableddau cudd. Newid cadarnhaol mewn blynyddoedd diweddar yw cyflwyno’r cortyn gwddf Blodyn Haul Anableddau Cudd, sy’n ein helpu i nodi a chynnig cymorth i bobl ag anableddau cudd. Gall anableddau cudd amrywio o salwch cronig i anawsterau prosesu a synhwyraidd, felly rydym yn gwrando’n ofalus ar beth mae pob unigolyn ei angen. Rydym yn falch o fod wedi arloesi hyn yn yr RCJ, a bellach mae wedi’i fabwysiadu gan bob un o’n hadeiladau."
        },
        {
            "heading": 2,
            "text": "Trawsnewid amlwg cyfiawnder "
        },
        {
            "text": "Mae gennym 30 mlynedd o wasanaeth rhyngom ac rydym wedi gweld llawer o newidiadau dros y blynyddoedd. Mae technoleg wedi trawsnewid sut mae’r llysoedd yn gweithredu, gyda nifer o brosesau bellach yn ddigidol yn hytrach nag ar bapur.  Flynyddoedd yn ôl, byddem yn gweld tywyswyr yn cario tri set o lyfrau i’r llysoedd ar gyfer gwrandawiadau. Bellach, mae’r wybodaeth maent ei hangen ar eu gliniaduron, sy’n llawer mwy effeithlon."
        },
        {
            "text": "Er gwaethaf y datblygiadau technolegol hyn, mae’r cyswllt dynol yn dal yn hanfodol ac mae ein rôl ar y rheng flaen hyd yn oed yn bwysicach. Mae pob diwrnod yn wahanol, pa un a ydym yn helpu rhywun nerfus i ddod o hyd i’w gwrandawiad, yn arwain ymwelydd gyda phroblemau symudedd drwy’r adeilad, neu’n syml, yn rhoi sicrwydd mewn amgylchedd brawychus.  Rydym bob amser yn barod i helpu a gwneud gwahaniaeth cadarnhaol."
        }
    ]
}