{
    "url": "https://foresightprojects.blog.gov.uk/2021/07/29/building-our-vision-for-government-technology-scanning/",
    "title": "Building our vision for government technology scanning",
    "authors": [
        "Tom Wells, Head of Foresight, GOS",
        "Charlie Rogers"
    ],
    "categories": [
        "Emerging Technologies"
    ],
    "pub_date": "2021-07-29T15:38:14+01:00",
    "content": [
        {
            "text": "The Government Office for Science’s (GOS) emerging technologies (EmTech) team is growing, and we’ve developed a whole range of capabilities to tell you about."
        },
        {
            "text": "If you work in EmTech, we want to hear your ideas and explore ways that we can collaborate."
        },
        {
            "text": "What is our vision? "
        },
        {
            "text": "GOS has been doing horizon scanning for emerging technologies for over 25 years."
        },
        {
            "text": "Our team is designed to improve Government understanding of the technologies of the future, and ensure policy is supported by the best available scientific evidence."
        },
        {
            "text": "The technology and horizon scanning teams across Whitehall do fantastic work. These teams explore technology risks and opportunities in relation to policy and cover everything from environment to defence and security. We want to aggregate the amazing work that is done across departments."
        },
        {
            "text": "The UK needs a central team to coordinate and bring together cross departmental insights into one place and that’s where we come in. Our work ties into the Government science and technology strategy and its ambitions to become a science superpower."
        },
        {
            "text": "We looked at technology scanning across the world. We learned:"
        },
        {
            "text": "What is our approach? "
        },
        {
            "text": "We are making use of new data science capabilities to support our expert-led insights."
        },
        {
            "text": "Our approach is centred on:"
        },
        {
            "text": "What’s next?"
        },
        {
            "text": "If you are a civil servant with an interest in EmTech – join our community, collaborate with us, and contribute ideas, data, or resources – we would love to hear from you. Contact us here."
        },
        {
            "text": "If you are in academia, industry or work in the tech sector more broadly, we want to hear your ideas about what tech topics should be on our radar."
        },
        {
            "text": "We’re also very keen to explore opportunities to work together, such as secondments, so please do reach out to us via our mailbox. Our doors are always open!"
        }
    ]
}