{
    "url": "https://environmentagency.blog.gov.uk/2021/07/29/combatting-the-illegal-export-of-construction-and-demolition-waste-plastic-film-and-wrap/",
    "title": "Combatting the illegal export of construction and demolition waste plastic film and wrap",
    "authors": [
        "elenaholmes"
    ],
    "categories": [
        "Regulated industry",
        "Waste"
    ],
    "pub_date": "2021-07-29T11:39:17+00:00",
    "content": [
        {
            "text": "The EA’s Illegal Waste Exports Team (IWE) have identified an emerging issue in the illegal export of highly contaminated plastic film and wrap from the construction and demolition (C&D) sector."
        },
        {
            "text": "Following Intelligence led targeting, an increasing number of shipments of contaminated C&D waste plastic film and wrap are being stopped by our officers. This material is increasingly being exported from England under ‘low risk’ Green List waste controls when the level of contamination we are observing means those exporting such waste actually require prior consent from us and overseas regulators. When they don’t obtain consent, the export is illegal!"
        },
        {
            "text": "Our Port officers are on the front-line each day inspecting waste shipments and they have intercepted and stopped numerous shipments of poor grade, contaminated C&D plastic film and wrap from leaving England over the last year. Hundreds of thousands of tonnes of plastic waste is exported from the UK each year and it is the responsibility of our officers to inspect shipments and to prevent its illegal export."
        },
        {
            "text": "What is the emerging issue with contaminated C&D plastic film and wrap? A port officer perspective.  "
        },
        {
            "text": "There is nothing wrong with clean, uncontaminated C&D plastic film and wrap being exported under ‘low risk’ Green List waste controls. However, this year alone my colleagues and I have seen a marked increase in the number of shipments of this waste which is contaminated and therefore requires prior consent to export. The plastic is often dirty and contaminated with materials such as mud, sand, rubble, and bricks which means the waste will require further treatment after export."
        },
        {
            "text": "Plastic waste, including wrap and film, being exported under Green List waste controls must"
        },
        {
            "text": "If this and other waste controls are not adhered to, exporters risk their shipments being stopped at the ports by me and my colleagues in the IWE team. Not only is this a potentially costly issue for those involved, we’ll also target any accredited packaging exporters who issue PERNs against such waste in breach of their Conditions of Accreditation."
        },
        {
            "text": "We all have a responsibility to ensure we are recycling our waste appropriately to ensure we protect human health and the environment now, and for future generations. We are already tackling the threats and risks posed by illegal waste exports head on and will not hesitate to use the enforcement tools at our disposal! We also recognise the importance of maintaining a ‘level playing field’ so those investing significant financial sums in their businesses, are not unfairly undercut by those not properly dealing with waste. However, we can only achieve so much on our own and we want to emphasise how important information provided by the public and those in the industry is in tackling the issue."
        },
        {
            "text": "If you have information on those suspected of illegally exporting waste, including contaminated C&D plastic, we encourage you be part of the solution by providing us with any information you have to help us tackle the issue and therefore help to protect human health and the environment overseas."
        },
        {
            "text": "Contact information\nAnyone with information regarding the illegal export of waste including C&D waste plastic can contact the EA’s Illegal Waste Exports team at intelligence@environment-agency.gov.uk or anonymously via Crimestoppers on 0800 555 111 or via their website https://crimestoppers-uk.org/give-information"
        },
        {
            "text": "Anyone requiring information on waste exports and obtaining notification to export from the EA can find information online at Waste: import and export - GOV.UK (www.gov.uk) or by contacting our International Waste Shipments Team at Askshipments@environment-agency.gov.uk"
        }
    ]
}