{
    "url": "https://publicpolicydesign.blog.gov.uk/2021/07/29/commissioning-public-policy-and-services-differently/",
    "title": "Commissioning public policy and services differently",
    "authors": [
        "Andrew Knight"
    ],
    "categories": [
        "Research"
    ],
    "pub_date": "2021-07-29T12:00:17+01:00",
    "content": [
        {
            "text": "Policymakers say that the early life of a new policy or service is its most important. This is the time when its future direction is orientated. But it is precisely as policymakers are trying to pin down the intent, that uncertainty is at its highest. This makes policy inception some of the most exciting and most difficult work that policymakers do."
        },
        {
            "text": "The way that we ask policymakers to tackle opportunities or problems is vital because the ‘exam question’ determines the answers that you get back."
        },
        {
            "heading": 2,
            "text": "Common mistakes when commissioning"
        },
        {
            "text": "There are 2 types of common mistakes when commissioning:  1 commissioning for process, 2 prescribing solutions."
        },
        {
            "text": "Policymakers say they are frequently commissioned to deliver part of a bureaucratic process like ‘do a write-round’ or ‘draft a sub’ or ‘manage stakeholders’. This is problematic because sometimes the intent gets drowned out, instead of maintaining a crystal clear focus on delivering an outcome for the public. "
        },
        {
            "text": "Wendy Williams noted this in her review of Windrush, “...caseworkers have followed the guidance set out for them and have not been encouraged to challenge decisions where the guidance had led them to what they felt was the wrong outcome…” Windrush Review, 2020"
        },
        {
            "text": "There is also particular frustration felt by colleagues who work on the delivery side of government who say that sometimes commissions can contain prescribed solutions that may not deliver the public value expected. These commissions often have baked-in unproven assumptions on what is needed and how deliverable it is. This stores up risk and leaves the potential for a nasty surprise later on when it is discovered that something else could have delivered much better public value."
        },
        {
            "text": "\"Not going into solution mode and really unpicking the basic policy intent is good training for my team. [Such as] stripping things back to basics in terms of what's the desired outcome what does good look like... Putting the customer at the centre of that, and seeing how different customers are affected differently is fascinating. It has really changed the way we are trying to bring customer insight upstream pre announcements” Policymaker, department with in-house delivery"
        },
        {
            "text": "\"Because we have the service delivery in our organisation, we’re also quite good at getting that perspective on deliverability. You might have a grand idea but no idea of how to make it happen, whereas our policymakers have worked in service delivery”  Senior policymaker, in-house delivery department"
        },
        {
            "heading": 2,
            "text": "Commissioning more effectively"
        },
        {
            "text": "The important features of a good commission are: 1 state the people who you intend to affect, 2 state what you intend to change for them, 3 state how you will measure the outcome. "
        },
        {
            "text": "Public policies and services mostly aim to improve outcomes for a group of people. So it is really important to be explicit about that in the commission and to not take it for granted that everyone along the delivery chain will understand the intent."
        },
        {
            "text": "Policymakers also need a system-level understanding of a policy area because the public services that individual citizens use can cut across multiple policy areas. Increasingly, the problems that government are planning for are multifaceted, cutting across policy areas and the remits of public organisations. These are issues like zero-carbon, Brexit and coronavirus."
        },
        {
            "text": "\"When dealing with complex problems, there is no ‘optimum solution’ or ‘silver bullet’ ...concerted action by several parts of the collaborating community rather than singular policy changes [is required]\" Strategic Framework, Systems Unit"
        },
        {
            "text": "However working across organisations is not easy for policymakers due to differing culture, technology, processes, and especially the difficulty of sharing of data and evidence. More importantly, policymakers are often not incentivised to work together across public bodies or civil society, even if they are working on the same issue. "
        },
        {
            "text": "By increasing the number of leaders who commission well and incentivise a focus on outcomes for citizens and collaboration across public organisations with a system-wide perspective, policymakers can deliver public services that better meet the day-to-day needs of citizens."
        }
    ]
}