{
    "url": "https://environmentagency.blog.gov.uk/2021/07/29/earth-overshoot-day-movethedate/",
    "title": "Earth Overshoot Day - #MovetheDate",
    "authors": [
        "georgehinton"
    ],
    "categories": [
        "Climate change",
        "Greener business"
    ],
    "pub_date": "2021-07-29T13:06:46+00:00",
    "content": [
        {
            "text": "Earth Overshoot Day was first launched in 2006. Here Van Griffiths, the Environment Agency’s deputy director for Sustainable Business, talks about the 2021 results and what we can do to #MovetheDate."
        },
        {
            "text": "I became aware of Earth Overshoot Day when the World Wide Fund for Nature (WWF) championed it in 2007. I have followed its progress ever since. It was developed by the New Economics Foundation and Global Footprint Network. It marks the date when humanity’s demand for ecological resources and services in a given year exceed what the Earth can regenerate in that year."
        },
        {
            "text": "In 2020 Earth Overshoot Day was 22 August, which was three weeks later than the 2019 date. This shift was due to the contraction in our ecological footprint caused by the pandemic. The 2020 results demonstrated that we are capable of rapid reductions in our resource consumption. However, in 2021 Earth Overshoot Day will be on 29 July (and it was on 19 May in the UK)."
        },
        {
            "text": "The figures for 2021 show that in less than eight months we have exhausted nature’s annual budget. From August to December we will now be “overshooting”: drawing down local resources unsustainably, and accumulating carbon dioxide in the atmosphere. We have effectively started to see a global bounce back in emissions and consumption post-pandemic."
        },
        {
            "text": "In the face of these global trends, it is easy to feel overwhelmed. But our situation is far from hopeless. There is a great deal we can do - individually and collectively - to #MovetheDate. As outlined on the excellent Earth Overshoot Day website, there are many opportunities for us to play our part in nurturing nature and reducing our carbon emissions."
        },
        {
            "text": "I am grateful to work for an organisation which is committed to tackling our climate and nature emergencies. The EA has a key role to play as a regulator and operator, to help to create a net zero nation, resilient to climate change. Aim 9 of our business plan states that by 2025 we will be on track to deliver our sustainable business commitments, including to be net zero by 2030. At the Environment Agency we have an eMission plan, which will help us contribute to #MoveTheDate by walking the walk on carbon reduction and nature gain."
        },
        {
            "text": "The EA’s direct carbon emissions reduced by 32% last year due to the impact of the pandemic on travel and buildings emissions. However, in the first quarter of this year financial year we saw business travel emissions increase by 25% on the previous year. Just like the global and UK ecological footprints, the EA is starting to see the impact of lockdown lifting and we need to take action to prevent our emissions levels rebounding."
        },
        {
            "text": "Our commuting carbon is one of the top five elements of our organisational carbon footprint. Before the pandemic it stood at 13,000 tonnes a year. As we emerge from the pandemic, we need to explore ways to commute less often and do what we can – safely and economically – to choose low carbon options whenever possible, such as walking, cycling and using public transport."
        },
        {
            "text": "We are asking lines managers to ensure commuting is on the agenda for their Team Charter discussions over the coming months. This is a key way in which you can contribute to our EA Net Zero Roadmap and help us reduce our emissions by 45% this decade. Our Sustainable Business Team is supporting teams with tools such as a carbon calculator, to help staff model the relative impacts of working at home and commuting."
        },
        {
            "text": "And we can each do a great deal to support #MoveTheDate in our personal lives too. Each time I take responsibility - by switching to a domestic green energy supplier, doing what I can to reduce my family’s food waste and increase recycling, trying to eat a more plant-based diet and tending to our small garden - I know that this is helping too."
        },
        {
            "text": "I encourage you to do whatever you can, with whatever you have, wherever you are, today. Your individual actions - and our collective actions as an organisation - will make a difference. What you do, at work and at home, will help us to honour the commitments which were made in Paris in 2015, to limit global temperature increases to below 2˚C, and to live within our ecological footprint."
        }
    ]
}