{
    "url": "https://ipo.blog.gov.uk/2021/07/29/ip-matters-to-love-island/",
    "title": "IP matters...to Love Island",
    "authors": [
        "Kelsey Lewis"
    ],
    "categories": [
        "Business",
        "Copyright",
        "Licensing",
        "Trade marks"
    ],
    "pub_date": "2021-07-29T16:24:49+01:00",
    "content": [
        {
            "text": "Love it or hate it, Love Island has fast become one of the UK’s most watched shows, peaking at 5.9 million viewers back in 2020. As ITV2’s most successful show of all time, it’s no surprise that it attracts such huge sponsors and advertisers to invest."
        },
        {
            "text": "This year, “the most commercialised show on British television” allegedly netted more than £12 million in revenues before the first episode aired on 28 June."
        },
        {
            "text": "The premise of the show is, as the name suggests, to find love. The couples fight it out to bag the £50,000 cash prize. As only one couple can win (or one person if they decide to ‘steal’ the money), the show ends with most contestants leaving empty handed. That is, of course, until they leave the villa and begin to capitalise on their new-found fame."
        },
        {
            "text": "Take Molly Mae Hague as an example. Molly Mae rose to fame following 2019’s season where she came in second place with her now long-term boyfriend Tommy Fury."
        },
        {
            "text": "Molly Mae is one of the most successful contestants from the show, boasting a joint net worth of £2 million with boyfriend Tommy. The 21-year-old is the sole director of MMH Group Holdings which plays host to 3 businesses: Filter, MMH International and FM Cosmetics."
        },
        {
            "text": "A huge chunk of Molly Mae’s success comes from social media channel Instagram, where she is reported to charge over £10,000 for each sponsored post. This is a great example of Molly Mae understanding her IP rights and using them for commercial gain."
        },
        {
            "text": "To account for this, Instagram rolled out its branded content features, which allows Instagram influencers to create branded partnerships with businesses on the platform and tag the brand in the content they sponsor."
        },
        {
            "text": "There’s often confusion regarding who owns the content posted to Instagram. According to their Terms of Use, the user owns the copyright to the image posted but automatically agrees to license that image to Instagram."
        },
        {
            "text": "The specific wording states 'non-exclusive, royalty-free, transferable, sub-licensable, worldwide license to host, use, distribute, modify, run, copy, publicly perform or display, translate, and create derivative works of your content'."
        },
        {
            "text": "This license only ends when the image is deleted from the platform."
        },
        {
            "text": "A huge part of Love Island’s revenue comes from clothing companies. Each year, fashion brands such as Pretty Little Thing and Missguided compete for their clothing to be worn by the islanders on the show."
        },
        {
            "text": "This year, the official fashion sponsor is ISAWITFIRST who have paid for the privilege to provide all contestants with a whole new wardrobe to wear. They have dedicated a whole section of their website to Love Island so that viewers can shop easily based on each individual contestant’s style."
        },
        {
            "text": "In its first year as a partner back in 2019, sales of ISAWITFIRST rose 67% when the show started, with web traffic increasing by 60%. While on Instagram, its follower numbers leapt by 254% and 61% on Twitter. So it's safe to say that the sponsorship has been worth every penny."
        },
        {
            "text": "As well as ISAWITFIRST, Love Island has 9 sponsors this year and it’s been reported that each brand was asked to pay at least £100,000 to be affiliated with the show. The 9 partners include JD Sports, Boots, dating app Tinder and drinks brand WKD. 'Headline sponsor’ JustEat have struck up a long-term deal thought to be worth well in excess of £5m annually."
        },
        {
            "text": "Between these sponsorships, merchandise, smartphone apps and the 20+ trade marks that are registered under the name Love Island, it’s clear that ITV is an expert in brand and IP management."
        },
        {
            "text": "Registering a trade mark isn’t as expensive as you might think. Starting from £170 when applying online, a trade mark will last 10 years until it needs to be renewed. The cost of an initial trade mark application depends on the number of ‘classes’ in which it needs to be registered."
        },
        {
            "text": "When applying to register, you use the classification system to define the goods and/or services area you'll be marketing in. One class is included in the cost of a trade mark application and extra classes cost an additional £50 per class. Read our guide on how to classify trade marks for more information."
        },
        {
            "text": "The revenue from IP allows ITV to invest in more shows, employ more talent and contribute to the UK’s creative sector. Brands such as Love Island and ITV are able to commercialise the relevant IP rights, and as a result, contribute greatly to the UK economy."
        },
        {
            "text": "We’ve talked about a lot of different types of intellectual property in tonight’s blog. If you’re wondering what IP assets you might have in your business, the free and easy-to-use online IP Health Check tool can help you identify your IP assets and provide you with the next steps on how to protect them."
        },
        {
            "text": "To keep in touch, sign up to email updates from this blog, or follow us on Twitter"
        }
    ]
}