{
    "url": "https://deframedia.blog.gov.uk/2021/07/29/more-than-1000-flood-schemes-to-benefit-from-record-investment/",
    "title": "More than 1,000 flood schemes to benefit from record investment",
    "authors": [
        "Defra Press Office"
    ],
    "categories": [
        "Uncategorized"
    ],
    "pub_date": "2021-07-29T17:10:37+01:00",
    "content": [
        {
            "text": "Today there has been widespread positive coverage of the Government’s announcement to invest £860 million in 1,000 flood defence schemes this year, with the majority of outlets leading on the role that climate change has to play in the increased threat from flooding."
        },
        {
            "text": "It is all part of the Flood and Coastal Erosion Investment Plan, which sets out how new flood and coastal schemes will better protect 336,000 properties by 2027, helping to avoid £32 billion in wider economic damages and reducing the national flood risk by up to 11 per cent."
        },
        {
            "text": "An article on the front page of the Daily Telegraph draws on comments by Environment Secretary George Eustice on the link between global warming and flooding in an op-ed for today’s the paper. As well as covering the £860 million in 1,000 flood defence schemes this year, the article highlights the improvements to flood insurance to encourage the installation of flood doors, air brick covers and flood-resistant plasterboard in homes previously damaged by water, and the forthcoming consultation this autumn."
        },
        {
            "text": " Elsewhere, writing in the Express, Emma Howard Boyd highlighted not only the record investment, but also the importance of signing up to flood warnings as we adapt to the changing climate. The Guardian highlights the government’s plans to invest record funding for flood defences in England while The Yorkshire Post takes a similar position noting the £146m investment to bolster Yorkshire's flood defences. The Evening Standard focuses its coverage on the new investment in flood prevention schemes across the UK over the next year, which the piece notes, comes as heavy downpours battered the country. Environment Agency Chief Executive Sir James Bevan was also interviewed on BBC Radio 4’s Today programme about the announcement."
        },
        {
            "text": "More than £860 million will be spent in 2021-22 boosting design and construction of more than 1,000 schemes across England as part of the Environment Agency’s annual capital programme, with thousands more homes and businesses to be better protected from flooding and coastal erosion, as part of plans published today by the Government outlining a record £5.2 billion of investment over the next six years."
        },
        {
            "text": "Environment Secretary George Eustice said:"
        },
        {
            "text": "Emma Howard Boyd, Chair of the Environment Agency, said:"
        },
        {
            "text": "The funding will be accompanied by a consultation in the autumn, where the Government will look at how to better protect frequently flooded communities, following a call for evidence earlier this year. It will consider how to strengthen the assessment of local circumstances, such as where areas have flooded on multiple occasions, when allocating funding during the six-year plan."
        },
        {
            "text": "New guidance for local planning authorities, designed to drive up compliance with planning rules, will reaffirm that they must refer planning decisions to Ministers when the Environment Agency is sustaining an objection on flood risk. Under the plans, the Government will also consider how planning decisions in areas at risk from surface water flooding could be subject to the equivalent rules in future."
        }
    ]
}