{
    "url": "https://environmentagency.blog.gov.uk/2021/07/29/science-behind-the-samples-2/",
    "title": "Science behind the samples",
    "authors": [
        "Environment Agency"
    ],
    "categories": [
        "Water"
    ],
    "pub_date": "2021-07-29T08:51:39+00:00",
    "content": [
        {
            "text": "By Sean, scientist at the Environment Agency’s Starcross laboratory"
        },
        {
            "text": "Every year millions of us visit coastal and inland waters across England. With many more of us staycationing this year, blue spaces will be more popular than ever."
        },
        {
            "text": "The Environment Agency monitors over 400 of these waters and tests them so we can let people know the standard of water quality. This helps people decide where and when to swim."
        },
        {
            "text": "Our team of bathing water samplers are out come rain or shine between May and the end of September collecting water samples from the bathing waters we monitor. And once the samples are in, they head over to our Starcross laboratory near Exeter."
        },
        {
            "text": "Early roll call"
        },
        {
            "text": "It’s an early start for bathing water testing as registering all the bottles that have arrived overnight begins at 6am between Tuesday and Saturday. Between 100 and 200 bathing water samples can arrive each day and once registered it’s over to the Microbiology and Molecular team - that’s where I step in. It’s my team’s job to test the water for two types of bacteria that can indicate pollution in the water."
        },
        {
            "text": "We receive the water samples within 24 hours of them being taken. It’s really important that they’re kept cold and they arrive within this time otherwise the bacteria can change and that means the results won’t be accurate. When the bottles arrive, we can’t see what or how much bacteria is in the water, so in very simple terms, it’s our job to make it show up."
        },
        {
            "text": "We do this by using special filters to trap the bacteria in the water and then add them to a jelly-like substance called agar. Agar basically acts as a food for the bacteria. To help the bacteria grow, we create real-life growing conditions by incubating the agar samples at different temperatures. It then takes about 48 hours for the bacteria to show up."
        },
        {
            "text": "Once they’ve been checked, the test results wing their way over to our reporting team, whose job it is to upload them onto our bathing water quality website - Swimfo"
        },
        {
            "text": "Regular testing of bathing waters during the bathing water season (May to September) means we can let people know how clean the water is. The test results are also used to classify each of the designated bathing waters. There are four classifications; Excellent, Good, Sufficient and Poor and are these are based on how much bacteria we find in water. The majority of bathing waters in England have a very high standard of quality. Anyone can find out the classification for their local bathing spot by visiting the Swimfo website."
        },
        {
            "text": "Seaside sleuths"
        },
        {
            "text": "We can run DNA tests on water which can tell us whether the bacteria originate from – humans, animals or birds.  Finding out the source of pollution is important as there are often several catchment areas that feed into bathing waters and having this information helps to narrow it down. Action plans can then be put in place including work with local partners to help drive improvements to local bathing waters."
        },
        {
            "text": "Online information"
        },
        {
            "text": "When it rains, more bacteria can be washed into rivers, lakes and the sea. The Environment Agency uses Met Office data to make pollution risk forecasts to work out when water quality might take a temporary dip due to factors such as heavy rain or high tides. Most bathing waters have a consistently high standard of water quality, but at some it can go up and down – this is where forecasting works best."
        },
        {
            "text": "When the forecasts highlight reduced water quality, pollution risk warnings will be issued and advice against bathing is displayed on Swimfo and also on signs at the beach."
        },
        {
            "text": "We want everyone to get the most out of trips to blue spaces this summer. Our water quality testing means people can get regular updates on how clean the water is and make decisions on when and where to go."
        },
        {
            "text": "To see our scientists in action, you can follow the bathing water sample from Holland Haven beach as it arrives at the labs for testing on our video diary"
        },
        {
            "text": "Know before you go – check Swimfo for details of over 400 bathing waters in England. Read our bathing water sampling blog and find out more about where the Holland Haven sample started."
        }
    ]
}