{
    "url": "https://mojdigital.blog.gov.uk/2021/07/29/the-roadmap-towards-our-mission/",
    "title": "The roadmap towards our mission",
    "authors": [
        "Gina Gill"
    ],
    "categories": [
        "D&T mission"
    ],
    "pub_date": "2021-07-29T15:33:10+01:00",
    "content": [
        {
            "text": "A couple of months ago I wrote about the MoJ Digital & Technology mission for this year. We have now completed the first quarter of the year (already!), and I thought I’d share just some of the great progress we’ve made so far."
        },
        {
            "heading": 2,
            "text": "Build confidence"
        },
        {
            "text": "Our services work for our users"
        },
        {
            "text": "We redesigned part of the Claim Criminal Injury Compensation Service, simplifying the service to reduce trauma for people claiming on behalf of minors. User satisfaction in May was a very good 94%."
        },
        {
            "text": "They are secure and our data is protected"
        },
        {
            "text": "We ran our inaugural staff training session on staying safe online with over 100 attendees now having been trained, and rolled out Veracode to 84 services which means we automatically scan the code (in circa 3m30secs!) for common security problems before it goes live."
        },
        {
            "text": "We are specialists, brilliant at what we do, and create more delivery certainty"
        },
        {
            "text": "We completed the delivery of the technology and digital services required for the handover of probation services back to public control.  This included roll out of over 8000 devices to new colleagues at home, migration of data and applications, and building a brand new interventions service to ensure we can support people in getting out of the cycle of crime."
        },
        {
            "heading": 2,
            "text": "Create simplicity"
        },
        {
            "text": "We seek to simplify and improve our existing services"
        },
        {
            "text": "We worked with policy and operational colleagues to launch a consultation of a modern Legal Power of Attorney (LPA). This brings us one step closer to a fully digital LPA service becoming a reality. We migrated CWA (Contracted Work and Administration), the second biggest Legal Aid Agency legacy application, to AWS."
        },
        {
            "text": "We build new services that are user centred and simple"
        },
        {
            "text": "We published the first HMPPS Digital and Data Strategy in collaboration with our operational colleagues, deployed the first MoJ Official laptops to prison users (a massive milestone for a complex programme), and deployed in-cell devices and digital services to our first set of users in HMP Cookham Wood.  These devices and services enable offenders to manage their own administration and access educational content helping to improve wellbeing and reduce the administrative burden on prison officers."
        },
        {
            "text": "We invest in tools, processes and common components to create simplicity and efficiency"
        },
        {
            "text": "We updated our MoJ Forms tool which enables users to build forms in line with the government service standard without any technical training or knowledge. We have a number of teams across the organisation now utilising this service including for complaints and money claims queries."
        },
        {
            "text": "Underpinning all of this we’ve set out performance measures and a Delivery Board to track progress. We welcomed colleagues from our Information Services Division, 96 new colleagues from Community Rehabilitation Companies (CRCs) and recruited 103 new civil servants - including 26 colleagues from across the MoJ and 8 promotions within the function."
        },
        {
            "text": "There’s lots more, but hopefully, this gives you a flavour of our work and progress."
        },
        {
            "text": "I’ll finish by saying a massive thank you to each and every one of my team for getting us off to a flying start this financial year - they truly are awesome."
        },
        {
            "text": "Gina"
        }
    ]
}