{
    "url": "https://dfedigital.blog.gov.uk/2023/06/06/boosting-collaboration/",
    "title": "Useful tips from a user researcher on boosting collaboration",
    "authors": [
        "Costa Christou"
    ],
    "categories": [
        "community of practice",
        "culture",
        "professions",
        "user research"
    ],
    "pub_date": "2023-06-06T11:20:17+01:00",
    "content": [
        {
            "text": "As a user researcher and a Fast Streamer I’ve moved between different teams to learn and get experience. At first, I was intimidated by how mature most of the DfE service teams were. But I soon learned that developing teams is an ongoing process and everyone has a part to play."
        },
        {
            "text": "I’m drawn to the idea of building and growing teams, so in this post I’ve shared some tips that have helped me steer my team into being a more collaborative one."
        },
        {
            "heading": 2,
            "text": "Regular check-ins"
        },
        {
            "text": "It sounds obvious but having regular check-ins (outside of sprint events) with the people you’re collaborating with, can transform your team's culture."
        },
        {
            "text": "Even ad hoc ‘huddles’ on Slack can become safe spaces to challenge and address issues and help brainstorm solutions. The brilliance of the hive mind in a high-pressure environment is the secret to solving problems."
        },
        {
            "heading": 2,
            "text": "Bringing professions closer"
        },
        {
            "text": "In a hybrid workplace, it’s easy to get overwhelmed by channels and group message threads. Bringing together connected disciplines in one chosen channel was a game-changer."
        },
        {
            "text": "I began by setting up a channel for user researchers, content designers and interaction designers. This channel was largely self-sustaining, with colleagues from different teams asking each other questions. Our professions overlap, so this channel also became the epicentre of team-level changes that had real impact. For example, advocating to adopt Figma for sharing designs with the wider team."
        },
        {
            "text": "In any government department, alignment can be challenging at the best of times. Having this collaborative channel was helpful to workshop ideas - be it around ways of working or decisions around tools. Once issues were raised, we could act to prioritise them and champion them in conversations with our wider teams, and in sprint events such as retrospectives."
        },
        {
            "heading": 2,
            "text": "Filter out the noise"
        },
        {
            "text": "A frequent pain point was feeling overwhelmed by comments on our work. My response was a simple ‘bucketing’ system to filter out noise and streamline actions."
        },
        {
            "text": "When kicking off a piece of work that involved all 3 professions, we decided to bring 3 different streams of feedback into a single ‘canvas’. Having advocated as a group to move from Lucid to Figma, we put our proposed designs on a digital whiteboard and used themed ‘buckets’ to sort comments, creating a list of actions in order or priority. Figma was better for us due to improved user-friendliness and it being easier for guests and contractors to access for collaboration purposes."
        },
        {
            "heading": 2,
            "text": "24-hour cut off for design comments"
        },
        {
            "text": "Although there were lots of us trying to capture and respond to over 50 comments, it was still overwhelming."
        },
        {
            "text": "As user-centred design (UCD) professionals we naturally welcome comments and feedback. But we also need time to digest and experiment without being constantly mindful of non-UCD people’s opinions."
        },
        {
            "text": "The best compromise was to establish a ‘window’ for comments with a hard cut off period of 24 hours before testing. This gave UCD colleagues a reasonable amount of time to review and respond instead of being rushed, which would compromise the quality of our data."
        },
        {
            "heading": 2,
            "text": "Ideas for future improvements"
        },
        {
            "heading": 3,
            "text": "Getting everyone in the team involved"
        },
        {
            "text": "As our research continued, I noticed that more and more colleagues from our wider team were coming to the user research presentations (sometimes known as ‘playbacks’). This was positive. But there were still people within the team that didn’t attend any sessions."
        },
        {
            "text": "This was likely due to their workloads, but a team retrospective revealed some other factors. For example, one developer didn’t feel connected to our project and wanted more visibility."
        },
        {
            "text": "The next step here would be to establish a culture where everyone feels willing and able to attend at least one research session in a round. Posting a link in a channel to encourage team members to sign-up is not enough."
        },
        {
            "text": "As a user researcher, I need to try to actively encourage other disciplines to attend sessions. Approaching team members directly is a better method. This can help to build empathy within the team and make work tickets feel more tangible. Hearing feedback directly from users adds context and value to your work – it creates a more nuanced understanding of their needs."
        },
        {
            "heading": 3,
            "text": "Simplifying user research playbacks makes a big difference"
        },
        {
            "text": "For future playbacks, we could perhaps focus on the 'need to know' points. For example, promoting the playback as ‘the top 3 to 5 ‘need-to-know’ insights from this round’."
        },
        {
            "text": "In a multidisciplinary team we had a split – half the team were there for most of what was presented, but the other half were not. How does the team navigate this? This is something I am continuing to explore as part of the user research community of practice. Watch this space."
        },
        {
            "text": "Follow DfE Digital, Data and Technology on Twitter."
        },
        {
            "text": "Subscribe to this blog."
        }
    ]
}