{
    "url": "https://socialworkwithadults.blog.gov.uk/2023/06/06/carers-week-and-our-role-in-building-support/",
    "title": "Carers Week and our role in building support",
    "authors": [
        "Lyn Romeo"
    ],
    "categories": [
        "Care and support",
        "Our profession",
        "Society"
    ],
    "pub_date": "2023-06-06T13:48:43+00:00",
    "content": [
        {
            "heading": 2,
            "text": "Carers community spirit"
        },
        {
            "text": "This year’s theme for Carers Week (5-11 June),  ‘recognising and supporting carers in the community’, really chimes with me, especially after my recent visit to Sefton Carers Centre in Merseyside."
        },
        {
            "text": "The centre, the largest in England, is 30 years old. Until six years ago, the charity focused on adult carers but has now expanded to support young carers too."
        },
        {
            "text": "Colleagues and volunteers at the centre provide free advice and guidance, emotional and practical support, training and a range of holistic therapies for unpaid carers living in the Sefton area.  This includes assistance with carers’ assessments and a focus on training courses and social activities designed to bolster carers’ community connections, fitness and general wellbeing."
        },
        {
            "text": "The work going on there and across the country to support carers across all age groups is fantastic and dovetails well with our role as social workers. Our holistic, person-centred practice enables us to connect carers to local resources like Sefton Carers Centre and support them in the pursuit of life goals alongside their caring responsibilities."
        },
        {
            "text": "Just like the wonderful colleagues working there, we recognise the role relatives, friends and neighbours have in helping people to remain with their families and communities. We will always look for ways to make and strengthen these connections, empowering people to lead the lives they need and want."
        },
        {
            "heading": 2,
            "text": "Nuance and empathy"
        },
        {
            "text": "Understanding and facilitating the right kind of support for unpaid carers is, understandably, skilled and important work. Many Carers Centre workers are now trusted assessors and carry out carers assessments on behalf of the local authority, helping the council to provide appropriate support."
        },
        {
            "text": "We all recognise how essential it is for unpaid carers to look after themselves and be supported to carry on in their caring roles if they have the desire to do so. Their mental wellbeing is just as important as their physical health. I am pleased that adult social workers, in tandem with other health and care professionals, understand this duality of support and work hard to strike the right balance."
        },
        {
            "text": "On this point, carers often tell us how important it is to have breaks and to receive emotional and psychological support, not just practical help. While access to the right information helps them better navigate social care and health services, they also deserve the advocacy of those who can protect and promote their rights as carers – and their human rights more generally."
        },
        {
            "text": "Effective social work recognises their unique value to our communities and their right to be supported, validated and empowered to live the best lives possible, just like anyone else."
        }
    ]
}