{
    "url": "https://socialcare.blog.gov.uk/2023/06/06/carers-week-recognising-we-are-all-carers/",
    "title": "Carers Week: recognising we are all carers",
    "authors": [
        "Deborah Sturdy"
    ],
    "categories": [
        "Care and support",
        "Carers",
        "Communities",
        "Social care reform",
        "Workforce"
    ],
    "pub_date": "2023-06-06T18:27:38+00:00",
    "content": [
        {
            "heading": 2,
            "text": "Shared experience"
        },
        {
            "text": "It’s Carers Week (5-11 June), an opportunity to not only ‘recognise and support unpaid carers in the community’ (this year’s theme), but also reflect on our personal and professional relationships to caring."
        },
        {
            "text": "Many of us have been - or will be - carers in our lifetime, for siblings, parents or children. While caring for relatives and partners is often a privilege bringing joy, fun and peace of mind, it can also take its physical and mental toll."
        },
        {
            "text": "There’s the never-ending feeling of responsibility and a sense of never quiet doing enough, to the point where caring for others often leads to neglect of our own wellbeing. This is no surprise when so many people work full time and in the case of younger carers, are juggling school or college with caring obligations at home."
        },
        {
            "text": "In my own family, I watched my elderly aunt and uncle be advocates, carers and defenders of my cousin who had Down’s syndrome, making sure she had access to health care, work opportunities and support. Throughout her life, they demonstrated absolute commitment to her care until her death at 51."
        },
        {
            "text": "I have also been that person living with the irrational but understandable guilt so many of us feel when we are overwhelmed with exhaustion. I cared for my mother, whilst working in a new job at the height of the pandemic. Until her death in 2020, there were many gruelling moments."
        },
        {
            "text": "Having worked in front line services, where no one catches their breath, the feeling of drowning was very familiar. Yet these experiences only strengthened my respect and empathy for health and care colleagues, not just unpaid carers."
        },
        {
            "heading": 2,
            "text": "Encouraging carers to seek support"
        },
        {
            "text": "By definition, caring is often a private matter, so we have much further to go to raise awareness and support carers to identify themselves and come forward to receive the support they deserve."
        },
        {
            "text": "In her latest blog, Lyn Romeo, our Chief Social Worker for Adults, highlights the great work of the Sefton Carers Centre. Colleagues and volunteers at the centre offer an amazing range of practical, social and emotional support for unpaid carers, including carers’ assessments."
        },
        {
            "text": "From a professional perspective, carers are critical in helping our social care workforce better understand the people they support. In our roles providing additional care, respite services and support in community settings, their insight helps us treat those we serve with dignity, respect and a more nuanced understanding of their care needs."
        },
        {
            "text": "In this context, unpaid carers are our partners in care and we must give them due recognition as they help us deliver the best outcomes for people. I am confident the workforce reforms underway, in tandem with the expansion of the NHS volunteer responder programme into social care, will further enhance our offer and make lives easier for carers throughout England."
        }
    ]
}