{
    "url": "https://forestrycommission.blog.gov.uk/2023/06/06/forestry-apprenticeship-becoming-a-tree-family/",
    "title": "Forestry Apprenticeship: becoming a 'tree family'",
    "authors": [
        "Gareth Biggins"
    ],
    "categories": [
        "Careers",
        "Woodland creation",
        "Woodland management"
    ],
    "pub_date": "2023-06-06T08:40:00+01:00",
    "content": [
        {
            "text": "In June 2022 I took a walk through the woods at Cannock Chase Forest, part of the assessment centre for the Development Woodland Officer programme. To my left were Scots and Corsican pine, to my right a mix of oak and other native broadleaves. It’s almost year later and I have returned to the same spot, but this time helping to run the assessment centre for this year’s intake of degree apprentices.  Amongst the assessment team is Field Manager David Beadle who guided me on the walk last year, assessing my knowledge, transferable skills and enthusiasm while putting me at ease. It’s good to reflect with David on how far me and my cohort have come. The language I use may have become more technical when describing the woodland in front of me, but I still feel the same sense of excitement about pursuing a career in forestry, and a new certainty that I’m pursuing the right path for me."
        },
        {
            "heading": 3,
            "text": "Starting out"
        },
        {
            "text": "It’s hard to believe that it is just 9 months I joined the Forestry Commission as a Development Woodland Officer (DWO), one of the first people on the UK’s first degree-level Forestry Apprenticeship programme. As a 41-year-old career changer I was a little apprehensive about being the eldest at both the assessment centre and then again when joining the group. But I was reassured to discover a real mix of people, including school leavers, recent graduates, and career changers from a variety of backgrounds."
        },
        {
            "text": "Making the step into forestry was not a whim. I’d spent time building some basic knowledge through a Level 2 certificate and gained valuable practical skills through time volunteering with my local Wildlife Trust, initially as a weekend volunteer then as a full-time volunteer for 6 months. The DWO programme was advertised at the perfect time when I was looking to consolidate the change and make it permanent. And what better way to start a career in forestry than an apprenticeship that allows you to study at the University of Cumbria’s National School of Forestry and following a pathway towards the Institute of Charted Foresters’ (ICF) professional forester status, while gaining experience through paid work at the Forestry Commission?"
        },
        {
            "text": "Our induction as both Civil Servants, and students at the University of Cumbria, started last September with an intensive month of training including Lantra’s Forestry in a Nutshell course, visits to active felling sites, Risk Assessment training, biosecurity, and Forestry First Aid. Our first university module introduced us to the academic study of forestry and included learning to identify 50 conifer and broadleaf tree species. We also found time to have fun and get to know each other, both on the high ropes course at GoApe and over evening meals. We gelled instantly despite our varied experiences, and it was easy to see what everyone in the group had to bring and why they had applied, our shared passion for trees and woodlands unites us as a group, so much so that our Signal chatgroup is named 'Tree Family'."
        },
        {
            "text": "On the first day our energetic leader, Gareth Hopkins, told us to look around because in forestry people often became friends for life. It’s perhaps too early to say that is true but I certainly met friends that day, not just colleagues. That’s particularly true of Emma and Lara who I’m teamed with in the East and East Midlands area team. I can genuinely say that they are two of my favourite people and there is rarely a day without laughter in our office in Santon Downham."
        },
        {
            "heading": 3,
            "text": "Becoming part of the team"
        },
        {
            "text": "We joined our regional teams in October, and here in the East, Emma, Lara and I soon felt at home. We quickly realised that our manager and mentor, Sid Cooper, possessed a wealth of knowledge and sagely advice that we could draw upon, as well as an incredible ability to locate some of the most spectacular veteran and specimen trees."
        },
        {
            "text": "I was asked recently what an average day looked like for an apprentice and found this difficult to answer. While we have 8-week cycles of university study and assessment, our daily activities vary. Working alongside Woodland Officers, we consolidate the skills and knowledge gained at university by processing Felling Licences, advising woodland owners and surveying Alleged Illegal Felling sites. Many of the highlights of the last 9 months have been during visits to woodlands and the opportunity to discuss these with the owners, managers, foresters, and rangers who nurture them."
        },
        {
            "text": "Following a silviculture module, we were tasked with writing an establishment plan for a new woodland and Sid took us to visit Bayfield estate in Norfolk, where he asked us to apply what we had learned to a proposed planting site. The visit allowed us to assess the site using newly gained knowledge and to discuss the viability of the proposed areas. I was surprised by how quickly I was able to assess site constraints, consider options for deer management and present valid arguments in favour of specific tree species based on site conditions and landowner objectives. We were then able to explore parts of the estate usually off limits to members of the public and visited some spectacular oaks that were clinging to one of Norfolk’s rare hills."
        },
        {
            "text": "The opportunity to work alongside beat foresters from Forestry England and apply practical skills and knowledge learned at university has really helped to embed things that I have learned. A  week carrying out pre-thinning assessments in Thetford Forest brought the subject of forest mensuration (measuring trees and woodlands) to life.  This involved surveying over 100 sample plots using a mix of traditional approaches, clinometers, dbh tapes and tariffing sheets, and later modern technology including digital callipers, and Vertex devices which automatically record and geolocate the collected data. By plot 120 we were all convinced by the benefits of technology while impressed by the consistent level of accuracy we were able to achieve with more analogue techniques."
        },
        {
            "text": "Other highlights have been visits to sawmills and processing sites during our wood utilisation and processing module. These put into perspective the importance of increasing the volume of quality homegrown construction timber, enabled us to follow the journey of a tree from forest to building site and to understand the range of co-products that can be manufactured from forest residue and milling off-cuts."
        },
        {
            "heading": 3,
            "text": "Growing the family"
        },
        {
            "text": "Back to Cannock and this year’s candidates. Some look nervous, others chat amongst themselves or with other members of the assessment team. Over the course of the day candidates undertake a series of written challenges, an interview, team exercise and the same walk that I undertook with David.  During breaks and an unassessed competition, with chocolate prize, I chat with candidates about why they decided to apply.  Many are seeking careers changes and I can see similarities with my own experience and fears about making a career change, especially amongst those with young children like me, and a shared desire to be involved in an industry that has a vital role to play in creating a more sustainable, biodiverse and carbon lean economy. It was great to see the range of transferable skills that people had to offer. I hope that those who were unsuccessful continue to pursue a career in forestry, the industry needs more skilled workers if it is to meet its objectives and I hope that some may even take time over the next 12 months to find volunteer opportunities and apply again for the DWO programme."
        },
        {
            "text": "Those who are successful will be assigned to one of the Forestry Commission's Area Teams and I’m really looking forward to welcoming the three candidates who will join us in the East and East Midlands later this year. They've got some exciting times ahead."
        }
    ]
}