{
    "url": "https://defradigital.blog.gov.uk/2023/06/06/how-content-design-and-teamwork-contributed-to-countryside-stewardship/",
    "title": "How content design and teamwork contributed to Countryside Stewardship",
    "authors": [
        "Tom Metcalf",
        "Caroline Lumley"
    ],
    "categories": [
        "Defra content design",
        "User centred design"
    ],
    "pub_date": "2023-06-06T14:48:41+01:00",
    "content": [
        {
            "text": "\nOn World Environment Day we hear how colleagues from the Rural Payments Agency (RPA) worked with content designers from the Defra farming content team to improve the scheme guidance on GOV.UK, ahead of the launch of this year’s Countryside Stewardship (CS) schemes. "
        },
        {
            "heading": 2,
            "text": "What Countryside Stewardship is "
        },
        {
            "text": "Countryside Stewardship (CS) provides financial incentives for farmers, foresters and land managers to look after and improve the environment through a range of schemes. "
        },
        {
            "text": "RPA manages CS, and each year it publishes guidance on GOV.UK to help people apply and understand what they need to do if they’re successful. "
        },
        {
            "heading": 2,
            "text": "What we wanted to do "
        },
        {
            "text": "Caroline Lumley, a senior content designer at Defra, explains what they aimed to achieve: "
        },
        {
            "text": "\"Farmers told us the existing CS guidance was hard to navigate and they were struggling to find what they needed. There was too much to read. The content was also in manual format, which was difficult to use. "
        },
        {
            "text": "‘We wanted to work collaboratively with RPA to simplify the user journey and make the content easier to find and understand.\""
        },
        {
            "text": "Gillian Kilburn, RPA customer content lead, explains how bringing together colleagues from the two organisations was beneficial: "
        },
        {
            "text": "\"Our team had the in-depth knowledge of the CS schemes, but we didn’t have the content design skillset the Defra content team had, so it was a good partnership. Right from the beginning everybody wanted to achieve the same goal.\""
        },
        {
            "heading": 2,
            "text": "Working together "
        },
        {
            "text": "Together, they came up with an approach to improve the content. This approach would: "
        },
        {
            "text": "The next step was making sure everyone involved was on board. The teams met at the RPA office in Carlisle and Caroline outlined the vision for the new guidance. She says: "
        },
        {
            "text": "\"I explained how they could make all the usual annual updates while also making the guidance more user focused. I did an introduction to content design presentation for the whole team and showed how content design principles could be applied to create patterns for each CS scheme, remove repetition and reduce the amount of content. "
        },
        {
            "text": "\"It was a really positive day. We made sure everyone was included and kept everything open and transparent in terms of how we were going to get to the end result. Everyone knew what they were doing and what their role was. It was open collaboration all the way through.\""
        },
        {
            "heading": 2,
            "text": "Sharing the load "
        },
        {
            "text": "The teams then got to work. The RPA content team took the lead on project management, running workshops with the subject matter experts (SMEs) to review new iterations of the guidance and collating comments and feedback. "
        },
        {
            "text": "Meanwhile, another Defra content designer worked closely with RPA copywriters to review and improve the guidance. At the same time, Caroline and Gillian reviewed all supporting guidance, all titles and summaries and planned the publishing schedule.  "
        },
        {
            "heading": 2,
            "text": "Obstacles to overcome "
        },
        {
            "text": "There were some challenges along the way, not least the changing deadlines, as Gillian outlines: "
        },
        {
            "text": "\"It was a huge undertaking and at times it was challenging. As well as reviewing all the content, as we do every year, we were looking to improve, update and restructure it at the same time. In total, there were around 800 pages to review.  "
        },
        {
            "text": "\"We were also working under time pressure to tight deadlines. We ended up reviewing a lot of the guidance while comments from SMEs were still coming in, which was tricky, but we stuck at it and achieved our goal.\" "
        },
        {
            "heading": 2,
            "text": "Publication success "
        },
        {
            "text": "Despite the obstacles, everything was ready in time for each publication day and the launch of all eight schemes went without a hitch. "
        },
        {
            "text": "The finished versions of the scheme guidance represent a 34% reduction in total content compared with the previous year. From a new landing page, the application journey was reduced from five clicks to two. As a result, users have less information to wade through and can find what they need more easily. The page title changes also meant the new landing page hits number one in Google, Bing and GOV.UK search.  "
        },
        {
            "text": "The guidance has also received positive feedback from stakeholders, with one farmer saying it was ‘better than it had ever been’. "
        },
        {
            "heading": 2,
            "text": "The key to successful working across organisations "
        },
        {
            "text": "Caroline says having a clear plan, good communication and mutual respect are vital: "
        },
        {
            "text": "\"Because we had such a clear plan, we were able to fulfil it. As soon as we were given the green light to publish everyone knew exactly what they were doing. It’s about communication and a willingness to have the same goal. "
        },
        {
            "text": "\"It’s also about respect. Everyone can bring an idea to the table. For me, it was also about respecting the amount of knowledge the RPA team has and how they’ve managed the schemes in the past. We couldn’t have done it without them.\" "
        },
        {
            "text": "Gillian agrees the project couldn’t have been achieved without expertise from both sides. She adds she’s learned so much from the experience: "
        },
        {
            "text": "\"I’ve learned a lot more about content design in a few months. Having Defra content designers on hand has given me and the team more knowledge and experience. We can now go from strength to strength.\""
        }
    ]
}