{
    "url": "https://food.blog.gov.uk/2023/06/06/lj-hugs-street-food-business-that-sees-the-kitchen-as-their-stage/",
    "title": "LJ Hugs - Street food business that sees the kitchen as their stage",
    "authors": [
        "Here to Help"
    ],
    "categories": [
        "Case studies"
    ],
    "pub_date": "2023-06-06T11:39:28+01:00",
    "content": [
        {
            "text": "Cymraeg"
        },
        {
            "text": "We spoke to Lewis, founder of LJ Hugs, a Cajun Street food business operating in Bath and Bristol. They’re open six days a week, specialising in grilled chicken and beef. "
        },
        {
            "text": "This blog is part of our Here to Help series, making it easier for businesses to do the right thing through business stories, resources and our improved hub of business guidance on our website."
        },
        {
            "text": "Grown from modest beginnings 9 years ago, former teacher, Lewis started LJ Hugs with the desire to create a job that was fun and to create jobs for other people. It now employs 18 members of staff, who are all regularly trained on the importance of food safety and hygiene. Both venues now have 5 hygiene ratings with good relationships with both Local Authorities."
        },
        {
            "heading": 3,
            "text": "“Your Kitchen is your stage”"
        },
        {
            "text": "Food safety and hygiene have a particular significance to street food businesses. According to Lewis, when operating from a gazebo, “your kitchen is your stage.” He goes on to say that “the way we cook our chicken, the way we prep our beef is all part of the show, it’s all done in front of people”. Lewis describes how people “eat with their eyes”, “If you want them to buy from you, they have to trust you, and to trust you they need to see that you’re clean”."
        },
        {
            "text": "When LJ Hugs first began operating in the centre of Bath, they had done their own Food Safety and Hygiene Training Levels 1 and 2 but they were “still getting to grips with how it should be run daily”. Lewis says the Environmental Health Officer (EHO) came onboard and started “working alongside us… she was amazing, she was really happy with what we’d done… she pointed out what was needed. We got a 5 hygiene rating, but we also had things to work on. It’s the little bits in the detail that we’ve been working on over the years now”. This includes details from changing gloves after handling cash, not overlaying knives that have opened packets of meat, and clearing your space before taking a product over to a customer."
        },
        {
            "heading": 3,
            "text": "“She didn’t use our naivety or us being beginners against us”"
        },
        {
            "text": "Lewis says, that following the first visit, he and the EHO “stayed in contact over the next couple of months”. Following the EHO’s advice and helpful “little hints”, Lewis would get in contact to say, “I’ve got this now, can you come in and have a look and see if it’s right?”. The EHO would respond and would usually say “That’s perfect or that’s even better”."
        },
        {
            "text": "LJ Hugs have worked with three EHOs, who have “all been equally helpful”. However, Lewis describes that first relationship with their first EHO as being “an important one”. Lewis says, “She came in and laid the foundation, she didn’t use our naivety or us being beginners against us. She worked with us to make it happen, so she was a major factor in us being successful in where we are today”."
        },
        {
            "text": "For more information on how to keep your business on track whilst keeping consumers safe head to our business guidance hub. Alternatively, head to our easy-to-navigate guide for those starting up a new food business"
        },
        {
            "heading": 1,
            "text": "LJ Hugs – Busnes bwyd stryd sy’n defnyddio’r gegin fel ei lwyfan"
        },
        {
            "text": "Cawsom sgwrs â Lewis, sylfaenydd LJ Hugs, sef busnes bwyd stryd Cajun sy’n gweithredu yng Nghaerfaddon a Bryste. Mae’r busnes ar agor chwe diwrnod yr wythnos, ac yn arbenigo mewn cyw iâr a chig eidion wedi’u grilio. "
        },
        {
            "text": "Mae’r blog hwn yn rhan o’n cyfres Yma i Helpu, sy’n ei gwneud hi’n haws i fusnesau wneud y peth iawn trwy rannu straeon ac adnoddau busnes yn ogystal â chanllawiau busnes yn ein hyb ar ein gwefan."
        },
        {
            "text": "Naw mlynedd yn ôl, dechreuodd y cyn-athro, Lewis, LJ Hugs. Ei nod oedd cael swydd roedd yn ei mwynhau a chreu swyddi i bobl eraill. Mae’r busnes bellach yn cyflogi 18 aelod o staff sy’n cael eu hyfforddi’n rheolaidd ar bwysigrwydd diogelwch a hylendid bwyd. Mae’r ddau leoliad wedi ennill sgôr hylendid o 5 erbyn hyn, gan feithrin perthynas dda gyda’r ddau awdurdod lleol."
        },
        {
            "heading": 3,
            "text": "“Eich cegin yw eich llwyfan”"
        },
        {
            "text": "Mae diogelwch a hylendid bwyd yn arbennig o arwyddocaol i fusnesau bwyd stryd. Yn ôl Lewis, wrth goginio’r bwyd mewn gasebo, “eich cegin yw eich llwyfan.” Mae’n dweud bod “y ffordd rydyn ni’n coginio ein cyw iâr, y ffordd rydyn ni’n paratoi ein cig eidion yn rhan o’r sioe; mae’r cyfan yn cael ei wneud o flaen pobl”. Mae Lewis yn disgrifio sut mae pobl yn “bwyta â’u llygaid. Os ydych chi eisiau iddyn nhw brynu gennych chi, mae’n rhaid iddyn nhw ymddiried ynoch chi, ac i ymddiried ynoch chi mae angen iddyn nhw weld eich bod chi’n lân”."
        },
        {
            "text": "Pan ddechreuodd LJ Hugs weithredu yng nghanol Caerfaddon am y tro cyntaf, roedd y busnes wedi cwblhau Hyfforddiant Diogelwch a Hylendid Bwyd Lefelau 1 a 2, ond roedd Lewis “yn dal i fynd i’r afael â sut y dylid ei redeg o ddydd i ddydd”. Cysylltodd Lewis â Swyddog Iechyd yr Amgylchedd ac yn fuan iawn, roedd hi’n “gweithio ochr yn ochr â ni… roedd hi’n anhygoel. Roedd hi’n hapus iawn gyda’r hyn roedden ni wedi’i wneud… tynnodd sylw at yr hyn roedd angen ei wneud. Cawsom sgôr hylendid o 5, ond mae wastad lle i wella. Rydym wedi bod yn mireinio’r pethau bychain dros y blynyddoedd nawr”. Mae’r manylion bach hyn yn cynnwys newid menig ar ôl trin arian parod, peidio â rhoi cyllyll sydd wedi agor pecynnau o gig ar ben ei gilydd, a chlirio arwynebau cegin cyn mynd â chynnyrch i gwsmer."
        },
        {
            "heading": 3,
            "text": "“Wnaeth hi ddim defnyddio ein naïfrwydd na’r ffaith ein bod ni’n newydd i’r maes yn ein herbyn”."
        },
        {
            "text": "Yn dilyn yr ymweliad cyntaf, dywed Lewis fod y Swyddog Iechyd yr Amgylchedd ac yntau wedi “aros mewn cysylltiad dros yr ychydig fisoedd nesaf”. Yn dilyn cyngor ac “awgrymiadau bach” defnyddiol y Swyddog Iechyd yr Amgylchedd, byddai Lewis yn cysylltu i ddweud, “mae hwn gen i nawr, allwch chi ddod i’r safle i weld a yw’n iawn?”. Byddai’r Swyddog Iechyd yr Amgylchedd yn ymateb ac fel arfer byddai hi’n dweud “mae hynny’n berffaith neu mae hynny hyd yn oed yn well”."
        },
        {
            "text": "Mae LJ Hugs wedi gweithio gyda thri Swyddog Iechyd yr Amgylchedd, sydd “i gyd wedi bod yr un mor barod eu cymorth”. Fodd bynnag, mae Lewis yn dweud y bu’r berthynas gyntaf honno â’i Swyddog Iechyd yr Amgylchedd yn hollbwysig. Dywed Lewis; “daeth hi yma a gosod y sylfaen. Wnaeth hi ddim defnyddio ein naïfrwydd na’r ffaith ein bod ni’n newydd i’r maes yn ein herbyn. Fe weithiodd hi gyda ni i wireddu’r freuddwyd, felly mae hi wedi chwarae rhan enfawr yn ein llwyddiant heddiw”."
        },
        {
            "text": "I gael mwy o wybodaeth am sut i gadw eich busnes ar y trywydd iawn a diogelu defnyddwyr ar yr un pryd, ewch i’n hyb canllawiau busnes. Fel arall, ewch i’n canllaw hwylus i’r rhai sy’n dechrau busnes bwyd newydd. "
        }
    ]
}