{
    "url": "https://gds.blog.gov.uk/2023/06/06/putting-growth-at-the-heart-of-gov-uks-strategy/",
    "title": "Putting growth at the heart of GOV.UK’s strategy",
    "authors": [
        "Chris Bellamy, Director of GOV.UK, Government Digital Service"
    ],
    "categories": [
        "GOV.UK"
    ],
    "pub_date": "2023-06-06T10:11:21+01:00",
    "content": [
        {
            "text": "The Government Digital Service (GDS) exists to make the user experience of the government simple, consistent and welcoming for everyone. To do this, GDS builds, iterates and maintains digital tools and platforms that are part of everyday life in the UK; platforms like GOV.UK - the online home of government information and services."
        },
        {
            "text": "GOV.UK is an integral part of our national infrastructure. Millions of people visit daily for everything from registering a death to paying their taxes."
        },
        {
            "text": "But, we know GOV.UK can do more - and must do more - for its users. This is why we have growth at the heart of our plans. We want to grow our product offer, grow our user base, and grow our team."
        },
        {
            "text": "Why does growth matter? It’s about making sure more people are getting better outcomes from government. We want to make it quicker and easier for users to access information and services, in formats and channels of their choice, helping them to receive the full support that they are entitled to."
        },
        {
            "text": "So in this blog post I’m going to set out our strategy for GOV.UK until 2025."
        },
        {
            "heading": 2,
            "text": "Where GOV.UK is now "
        },
        {
            "text": "Before we look ahead, let’s explain where we are now. "
        },
        {
            "text": "Since we launched 10 years ago, GOV.UK is now the established digital interface between government and the public. It’s well used - with over 28 billion page views since go-live - and is consistently among the most-visited websites in the country. It's extremely well known according to YouGov, and the signature design and logo is instantly recognisable as the trusted source of government information and services. GOV.UK has become truly essential to living, working and studying in the UK."
        },
        {
            "text": "Over that time, we’ve experimented with providing a more interactive service on GOV.UK, for example: "
        },
        {
            "text": "These case studies show that by providing a more proactive, interactive and relevant GOV.UK user experience, we can help people to get the right support from government, and help government to communicate and deliver services to people. "
        },
        {
            "heading": 2,
            "text": "What more GOV.UK can do "
        },
        {
            "text": "We want to:\n"
        },
        {
            "text": "How does this translate into delivery for the next year or so? Below are our programme priorities:"
        },
        {
            "heading": 2,
            "text": "What's next?"
        },
        {
            "text": "GDS is adopting a new, ambitious and exciting direction for GOV.UK, and we know it will be challenging to deliver, but it's what government needs and what users expect."
        },
        {
            "text": "It will involve trying new things. Like any good product team, we should never stand still. We're going to experiment, test our ideas and iterate quickly, using data and evaluation to measure the impact on users. "
        },
        {
            "text": "It will also involve revisiting product decisions we've made in the past. A decade is a lifetime in tech and some of the choices made at the birth of GOV.UK may no longer be the right ones."
        },
        {
            "text": "We also know this can’t be done within a single team. Within GDS, we’re working closely with colleagues on GOV.UK One Login for Government to make sure we’re delivering an even more useful experience for the growing number of signed-in users. This includes aligning our app work with the GOV.UK One Login programme’s identity checking app. And, looking across government, it’s only through partnerships with departments that we’re able to provide a consistent and high-quality user experience on GOV.UK, so we’ve created this strategy by engaging with cross-government stakeholders and will continue to partner with them every step of the way."
        },
        {
            "text": "There’s a lot of information in here, and while this is my first blog post, it definitely won’t be my last. We’re going to be shortly updating our public roadmap over on Inside GOV.UK to show our new workstreams, along with a deep dive into how we created the strategy and data behind it; and I’ve committed to quarterly updates on this blog to give more details. "
        }
    ]
}