{
    "url": "https://environmentagency.blog.gov.uk/2023/06/06/tackling-the-metal-pollution-legacy-of-britains-mining-history/",
    "title": "Tackling the metal pollution legacy of Britain’s mining history",
    "authors": [
        "Environment Agency"
    ],
    "categories": [
        "Environment Agency"
    ],
    "pub_date": "2023-06-06T09:11:09+00:00",
    "content": [
        {
            "text": "Metal mines played a major part in Britain’s history and, although almost all the mines closed 100 years ago, abandoned mines are still the largest source of metals to our rivers and seas. Hugh Potter, the Environment Agency’s Water and Abandoned Metal Mines lead, looks at the action being taken to address the legacy."
        },
        {
            "text": "Abandoned metal mines release contaminated groundwater through old tunnels from the18th and 19th Century, dug by miners so they could gain access to the minerals."
        },
        {
            "text": "Rainfall also washes metals out of the millions of tonnes of waste produced when the miners were extracting metals from rocks."
        },
        {
            "text": "The metals, including lead, cadmium, zinc and arsenic, harm fish and river insects, reduce water quality and accumulate in river and estuary sediments."
        },
        {
            "text": "This pollution will continue into the next century unless action is taken."
        },
        {
            "text": "Because the mines all closed before the year 2000, the former mine operators do not have to deal with the polluting legacy they left behind. It therefore falls to government to act."
        },
        {
            "text": "Through the Water and Abandoned Metal Mines (WAMM) programme, the Environment Agency, the Coal Authority and Defra are working to clean up the 1,500km of rivers polluted by abandoned metal mines in England. Parliament recently approved a new legally binding target, under the Environment Act, to halve the length of English rivers currently polluted by harmful metals from abandoned metal mines by 2038."
        },
        {
            "text": "This will mean a tenfold increase in the WAMM programme and boosting the existing three mine water treatment schemes to around 40, with a similar number of diffuse interventions – which is where work is carried out to prevent metals being washed out of mine wastes into rivers. "
        },
        {
            "text": "The issue of mine water pollution is particularly prominent in the North East due to its extensive mining history for industrial metals such as lead and zinc, as well as coal."
        },
        {
            "text": "The first WAMM mine water treatment scheme in the North East started operating in 2015 at Saltburn in East Cleveland. The abandoned ironstone mines were releasing about 100 tonnes of iron each year, causing serious pollution of a stream and discolouring a popular surfing and bathing water beach."
        },
        {
            "text": "By the end of 2023, a second mine water treatment scheme will be up and running at Nent Haggs, near Alson. "
        },
        {
            "text": "The River Nent is the most metal polluted river in northern England and the effects on water and sediment quality, and aquatic life, can be seen for up to 60km along the River South Tyne and into the Tyne Estuary. Our surveys have found only half the number of fish and river flies that we’d expect to find in a clean river."
        },
        {
            "text": "Mine water treatment schemes involve tackling pollution at the source by removing the metals from the contaminated groundwater released from abandoned mines before they can pollute rivers."
        },
        {
            "text": "The Nent Haggs mine water releases up to 3 tonnes of cadmium and zinc into the river every year which means metal concentrations in the river can be up to 200 times the level considered safe for wildlife."
        },
        {
            "text": "The treatment scheme will capture the metal-polluted groundwater at the old mine drainage tunnel [see photo above] and pump it through a 2.5km long pipeline to treatment ponds where natural reactions will remove at least 90% of the metals before returning the clean water back into the River Nent."
        },
        {
            "text": "The scheme is located in the North Pennines Area of Outstanding Natural Beauty and so we’ve engaged closely with the local community and others throughout the development and construction of the Nent Haggs mine water treatment scheme."
        },
        {
            "text": "As well as improving water quality in up to 60km of rivers, we’ve been able to improve the Isaac's Tea Trail footpath and boost environmental benefits for the local community who have supported the creation of a new nature reserve as part of the project."
        },
        {
            "text": "Jointly funded by the WAMM Programme and Northumbrian Water, the Tyne Rivers Trust has planted hundreds of trees, shrubs and wildflowers, and created a marshy wetland, to encourage wildlife to flourish on the field used for the mine water pumping station."
        },
        {
            "text": "In addition, we are using metal-contaminated sediments removed from local rivers to encourage rare ‘calaminarian’ (metal-loving) plants, that are distinctive to these former metal mining areas, to grow in a ‘nursery’ area."
        },
        {
            "text": "Normally, these sediments would have to be disposed of in a landfill. We plan to harvest seeds from the nursery to encourage more plants to grow on metal-contaminated mine wastes in the North Pennines, increasing biodiversity whilst also helping to decrease metals being washed out of the wastes and polluting rivers."
        },
        {
            "text": "It's not the first time the WAMM Programme has recycled metal mine wastes. At Saltburn, some of the iron ‘ochre’ waste collected by the mine water treatment scheme is being used by the artist Onya McCausland to create sustainable wall paint – known as ‘Saltburn Yellow’."
        },
        {
            "text": "The work at Saltburn and Nent Haggs shows that by working together with the community and other stakeholders, we can clean up the polluting legacy of our industrial past in the North East and around the country while also bringing an additional boost to water quality, wildlife, tourism and the economy."
        },
        {
            "text": "Follow the Environment Agency Yorkshire and North East, and Coal Authority on Twitter."
        },
        {
            "text": "If you want to see some of the projects in the WAMM Programme, please visit the WAMM YouTube channel or visit https://www.gov.uk/government/collections/metal-mine-water-treatment "
        }
    ]
}