{
    "url": "https://food.blog.gov.uk/2023/06/06/the-clucking-pig-serving-scotch-eggs-from-sunderland-to-sandringham/",
    "title": "The Clucking Pig - Serving scotch eggs from Sunderland to Sandringham",
    "authors": [
        "Here to Help"
    ],
    "categories": [
        "Case studies"
    ],
    "pub_date": "2023-06-06T11:13:14+01:00",
    "content": [
        {
            "text": "Cymraeg"
        },
        {
            "text": "We spoke to David from The Clucking Pig about his experience of running a food business and how he ensures his business is keeping consumers safe."
        },
        {
            "text": "This blog is part of our Here to Help series, making it easier for businesses to do the right thing through business stories, resources and our improved hub of business guidance on our website."
        },
        {
            "heading": 3,
            "text": "Can you describe your business for us?"
        },
        {
            "text": "I was a police officer but retired in 2002. I then purchased a smallholding up in the northeast which developed into a scotch egg business, and it’s really taken off. We first started working in our kitchen in the house but moved to the garage when we outgrew it. Since we started, we’ve supplied several celebrities, been at Buckingham Palace with the Royal Family and we’re regularly trading at small food festivals and farmers markets."
        },
        {
            "heading": 3,
            "text": "What were your priorities and who did you get advice from?"
        },
        {
            "text": "Registering with my local authority was at the top of the list because it ensured that what we were doing was correct. I spoke to several food hygiene professionals, I always speak to them for advice. A member of the food team at Redcar and Cleveland was full of excellent advice on how to start up our food business. I’ve worked with a few members of my local authority’s food team, and I’ve always had a good relationship with them. They’ve been very forthcoming and helpful."
        },
        {
            "text": "On the initial design of our kitchens, I was advised to change it slightly and to do bits and pieces, so that before anybody came for an inspection, everything was there. My Environmental Health Officer (EHO) had a look and advised me that I needed two sinks, one for handwashing and one for pot washing."
        },
        {
            "text": "Honestly, they’ve been fantastic. They're not there to cause you a problem, they’re there to give you advice and help. They’ve always been brilliant with me. I think if you do your part to keep customers safe and you’re honest with them, they’ll tell you what you need to do."
        },
        {
            "heading": 3,
            "text": "How did you feel before and during engaging with your local authority?"
        },
        {
            "text": "Before my inspection, I made sure I knew what I needed and what the basic requirements were. They’re not there to catch you out, they’re there to give you advice, they’re there to help you along the way, and they want you to be successful. It’s about doing it right and making sure that the public gets a good, safe service and a very good product."
        },
        {
            "heading": 3,
            "text": "What advice would you give to new businesses?"
        },
        {
            "text": "If you’re building a business from the ground up, you have to get all the infrastructure right first. It’s like building a house on solid foundations. Once you’re confident with all the basics, everything else goes up quickly."
        },
        {
            "text": "For more information on how to keep your business on track whilst keeping consumers safe head to our business guidance hub. Alternatively, head to our easy-to-navigate guide for those starting up a new food business."
        },
        {
            "heading": 1,
            "text": "The Clucking Pig – Gweini wyau Sgotaidd o Sanclêr i Sandringham"
        },
        {
            "text": "Buom yn siarad â David o The Clucking Pig am ei brofiad o redeg busnes bwyd a sut mae’n sicrhau bod ei fusnes yn cadw defnyddwyr yn ddiogel."
        },
        {
            "text": "Mae’r blog hwn yn rhan o’n cyfres Yma i Helpu, sy’n ei gwneud hi’n haws i fusnesau wneud y peth iawn trwy rannu straeon ac adnoddau busnes yn ogystal â chanllawiau busnes yn ein hyb ar ein gwefan."
        },
        {
            "heading": 3,
            "text": "Allwch chi ddisgrifio’ch busnes i ni?"
        },
        {
            "text": "Swyddog heddlu o’n i, ond gwnes i ymddeol yn 2002. Yna, gwnes i brynu tyddyn yng ngogledd-ddwyrain Lloegr a ddatblygodd i fod yn fusnes wyau Sgotaidd, ac mae wedi mynd o nerth i nerth. I ddechrau, roedden ni’n gweithio yn ein cegin yn y tŷ, ond symudon ni i’r garej wrth i’r busnes dyfu’n rhy fawr ar gyfer y gegin. Ers i ni ddechrau, rydyn ni wedi cyflenwi nifer o enwogion, wedi bod ym Mhalas Buckingham gyda’r Teulu Brenhinol ac rydyn ni’n masnachu’n rheolaidd mewn gwyliau bwyd bach a marchnadoedd ffermwyr."
        },
        {
            "heading": 3,
            "text": "Beth oedd eich blaenoriaethau ac oddi wrth bwy y cawsoch gyngor?"
        },
        {
            "text": "Roedd cofrestru gyda fy awdurdod lleol ar frig y rhestr er mwyn sicrhau ein bod ni’n gwneud pob dim yn gywir. Siaradais â sawl gweithiwr proffesiynol hylendid bwyd, dw i wastad yn siarad â nhw am gyngor. Roedd aelod o’r tîm bwyd yn Redcar a Cleveland yn llawn cyngor ardderchog ar sut i ddechrau ein busnes bwyd. Dw i wedi gweithio gydag ychydig o aelodau o dîm bwyd fy awdurdod lleol, a dw i wastad wedi bod â pherthynas dda â nhw. Maen nhw wedi bod yn agored ac yn barod iawn i helpu."
        },
        {
            "text": "Wrth drafod cynllun cychwynnol ein ceginau, dywedon nhw y byddai’n syniad newid y cynllun ychydig a gwneud mân bethau eraill fan hyn fan draw, felly, cyn i unrhyw un ddod i gynnal arolygiad, roedd popeth yn ei le. Gwnaeth fy Swyddog Iechyd yr Amgylchedd (EHO) fwrw cipolwg dros y gegin a dywedodd fod angen dwy sinc arna’ i; un ar gyfer golchi dwylo ac un ar gyfer golchi llestri."
        },
        {
            "text": "Wir yr, maen nhw wedi bod yn wych. Dydyn nhw ddim yno i fod yn boendod, maen nhw yno i roi cyngor a chymorth i chi. Maen nhw wastad wedi bod yn wych gyda fi. Fel hyn dw i’n ei gweld hi: os byddwch chi’n gwneud pob ymdrech i gadw cwsmeriaid yn ddiogel ac yn siarad yn onest â’r swyddogion, byddan nhw’n dweud wrthych chi beth sydd angen i chi ei wneud."
        },
        {
            "heading": 3,
            "text": "Sut roeddech chi’n teimlo cyn ac wrth ymgysylltu â’ch awdurdod lleol?"
        },
        {
            "text": "Cyn fy arolygiad, gwnes i’n siŵr fy mod i’n gwybod beth oedd ei angen arna’ i a beth oedd y gofynion sylfaenol. Dydyn nhw ddim yno i’ch dal chi ar eich bai. Maen nhw yno i roi cyngor i chi, i’ch helpu ar hyd y ffordd. Maen nhw am i chi fod yn llwyddiannus. Yn ei hanfod, mae’n golygu gwneud pethau’n iawn a gwneud yn siŵr bod y cyhoedd yn cael gwasanaeth da, diogel a chynnyrch da iawn."
        },
        {
            "heading": 3,
            "text": "Pa gyngor byddech chi’n ei roi i fusnesau newydd?"
        },
        {
            "text": "Os ydych chi’n dechrau busnes o ddim, mae’n rhaid i chi gael yr holl seilwaith yn iawn yn gyntaf. Mae fel adeiladu tŷ ar sylfeini cadarn. Unwaith y byddwch chi’n hyderus gyda’r holl bethau sylfaenol, bydd popeth arall yn codi’n gyflym."
        },
        {
            "text": "I gael mwy o wybodaeth am sut i gadw’ch busnes ar y trywydd iawn a diogelu defnyddwyr ar yr un pryd, ewch i’n hyb canllawiau busnes. Fel arall, ewch i’n canllaw hwylus i’r rhai sy’n dechrau busnes bwyd newydd."
        }
    ]
}