{
    "url": "https://ukhsa.blog.gov.uk/2023/06/06/ukhsas-asymptomatic-avian-influenza-surveillance-programme/",
    "title": "UKHSA’s asymptomatic avian influenza surveillance programme",
    "authors": [
        "Blog Editor"
    ],
    "categories": [
        "Health Protection"
    ],
    "pub_date": "2023-06-06T12:17:44+01:00",
    "content": [
        {
            "text": "Since December 2021, 10 human cases of avian influenza H5N1 (of clade 2.3.4.4b) have been reported globally and between 1 October 2022 and 31 May 2023, influenza H5N1 has been confirmed in birds at 185 premises in the UK."
        },
        {
            "text": "During the same time period, H5N1 has also been detected in 1,024 wild birds across the UK."
        },
        {
            "text": "Our surveillance and diagnostic expertise coupled with our genomic sequencing abilities are crucial to the early detection, assessment and response to emerging health and biosecurity threats such as avian influenza."
        },
        {
            "text": "Through these surveillance systems we aim to detect potential human avian influenza cases early, assess the risk to human health and scale up the public health response at pace."
        },
        {
            "text": "Our work also contributes to initiatives such as the WHO Global Influenza Surveillance and Response System, helping the world detect and respond to emerging influenza viruses with pandemic potential."
        },
        {
            "heading": 2,
            "text": "Enhanced surveillance programme"
        },
        {
            "text": "Across the UK and globally, levels of avian influenza infections in birds and mammals have increased, however, very few human cases of the H5N1 (2.3.4.4b) avian influenza virus have been reported internationally, making it difficult to assess how serious the threat is to human health. To support improved scientific understanding of the threat,  in March 2023 UKHSA launched a new asymptomatic avian influenza surveillance programme."
        },
        {
            "text": "This programme aims to detect possible animal to human infections in people who are exposed to infected birds, for example poultry workers and those involved in culling birds in infected commercial and domestic premises, so that we can better understand whether transmissions from birds to humans occur and if so, how often. This information will enable us to better understand the overall risk to human health and tailor our public health response."
        },
        {
            "text": "Individuals taking part in the programme are sampled through virological nose and throat swabs. Samples are then processed by UKHSA testing laboratories, with any positive samples being sent to the WHO designated National influenza reference laboratory in our Colindale lab for genomic analysis."
        },
        {
            "text": "If a positive test is returned, individuals will be managed in line with current UKHSA guidance. As part of the public health response to any positive detections, our health protection teams follow up all individuals who have been in contact with a confirmed human case of avian influenza."
        },
        {
            "text": "The asymptomatic avian influenza surveillance programme has already successfully identified positive tests for potential cases in two people working on an infected poultry farm in England. This scheme builds on a previous asymptomatic testing programme which took place in winter 2021/22, included around 120 samples and identified one positive case with a history of unprotected contact with birds in a close domestic setting."
        },
        {
            "heading": 2,
            "text": "NHS surveillance"
        },
        {
            "text": "Alongside this asymptomatic avian influenza surveillance programme, we are working with the NHS to ensure patients admitted to intensive care with severe acute respiratory infections, or influenza-like-illnesses are tested for respiratory viruses, including influenza. UKHSA public health labs and the influenza reference laboratory undertake additional testing of samples that are positive for influenza A but where normal seasonal influenza is not found, to confirm that the detection is not due to avian influenza."
        },
        {
            "text": "Monitoring of these samples is an important mechanism for the early detection of avian influenza / novel influenza viruses. As people developing avian influenza infections are likely to be severely ill, intensive care units are a good place to target disease surveillance; this work fits within wider surveillance programmes alongside the existing contact management process, where people who are exposed to birds with avian influenza are monitored by UKHSA Health Protection Teams."
        },
        {
            "text": "The latest evidence continues to suggest that the avian influenza virus we’re seeing circulating in birds does not currently spread easily to people."
        },
        {
            "text": "Guidance from Defra on the signs of bird flu and how to report it in poultry and other birds is available on GOV.UK, while further guidance on avoiding the risk of infection when working with infected poultry is published by the Health and Safety Executive."
        }
    ]
}