{
    "url": "https://ruralpayments.blog.gov.uk/2023/06/06/updating-your-land-details/",
    "title": "Updating your land details",
    "authors": [
        "RPA Editor"
    ],
    "categories": [
        "Mapping"
    ],
    "pub_date": "2023-06-06T11:50:31+01:00",
    "content": [
        {
            "text": "Providing timely land mapping updates when applying for agri-environment schemes will ensure you receive timely and accurate payments."
        },
        {
            "text": "You need to update your land details as soon as there’s a change as, unlike the Basic Payment Scheme, you’re unable to apply for schemes like Countryside Stewardship Mid Tier or the Sustainable Farming Incentive if there’s outstanding mapping work."
        },
        {
            "text": "Your land information must be current and complete before you begin the application process, so if you have any land updates, changes or corrections, it is important to notify RPA of any changes as the land data is needed to ensure accurate payment. These must be actioned first by submitting an RLE1 form."
        },
        {
            "text": "We will be publishing further blogs giving detailed RLE1 guidance to support you through the process, so look out for those. But generally, you can help us by making sure all the required fields are completed within the RLE1 form, make clear and accurate annotations on any maps, respond promptly to RPA requests for further information and follow the guidance when emailing forms."
        },
        {
            "text": "RPA maps and tracks 2.6million land parcels, using a range of intelligence and technology to keep these as accurate as possible and receives over 20,000 RLE1 forms each year requesting mapping changes."
        },
        {
            "text": "You can see digital maps of all the land parcels registered to your holding using the Rural Payments service on GOV.UK."
        },
        {
            "text": "You can read more about our approach to mapping and geospatial services in our blog from November 2022 here."
        },
        {
            "text": "To stay up to date with the latest information and updates from RPA, sign up to our blog and follow us on social media on the following accounts:  "
        },
        {
            "text": "By following and subscribing to our social channels and blog, you’ll be able to see the latest updates about important information. We also share top tips and announcements. You can also listen to The RPA Podcast which we have launched to help farmers, landowners and rural communities keep up to date with the latest news from RPA.   "
        },
        {
            "text": " "
        }
    ]
}