{
    "url": "https://digitalpeople.blog.gov.uk/2023/06/06/what-is-pride-month-to-me/",
    "title": "What is Pride Month to me?",
    "authors": [
        "Josephine Holman"
    ],
    "categories": [
        "Community",
        "Diversity and Inclusion",
        "Pride Month"
    ],
    "pub_date": "2023-06-06T08:35:58+01:00",
    "content": [
        {
            "text": " "
        },
        {
            "text": "Awareness months at their core are about bringing global attention to important social issues, not only celebrating people in specific communities, but showing that they deserve a fair and equal place in the world. "
        },
        {
            "text": "Pride is not simply parades and rainbows. As someone who didn’t have the easiest journey into finding myself, I make a point to remember that there are people like me around the world who are less fortunate and in danger because of who they are and where they live. "
        },
        {
            "text": "The start of Pride Month this year coincided with strict new laws established in some countries that further criminalise LGBTQ+ people and set out sentences of life imprisonment, or even execution, in some cases. These people are at risk simply because of who they are, and who they love."
        },
        {
            "text": "When I started secondary school, Section 28 had only just been repealed in England. “Gay” was a dirty slur in my Yorkshire town, and in my own family the expectations to meet a nice boy and get married were clear. I hid that part of me deep down and was forced down a path before I was able to choose one for myself. "
        },
        {
            "text": "University gave me freedom, and distance, and by the time I was in my early twenties I had decided enough was enough and that life was too short to not be who I wanted to be, and to not be with a person I truly loved. I was promptly and unceremoniously ostracised from some members of my family."
        },
        {
            "text": "In early jobs, before I became a Civil Servant, I felt deeply anxious and scared about opening up to colleagues and being myself at work. I spoke in vague terms about my home life, shared very little and deflected personal questions. I was worried about discrimination I might face, because although society has made great progress in visibility and acceptance for LGBTQ+ individuals, coming out at work still takes great courage and can feel like a risky step to take. I have faced discrimination walking hand in hand with my wife in public, been heckled in the streets and subjected to harassment or even denied entry from venues. But, I have also met the most wonderful people in this life and shared joy in finding community. "
        },
        {
            "text": "As I walked into my first day as a Civil Servant I decided to be brave, and I am so very glad I did. I’ve found the Civil Service to be a safe and welcoming place, where I can be my authentic self at work. That means when someone asks me about my weekend, I can say I spent it with my wife, with no shame or fear of judgement. I can speak freely and share all those overlapping and intersecting parts of my life without having to carefully dissect out elements. And this is important. "
        },
        {
            "text": "Varying studies have found that when we can be open about our identity we can experience increased emotional and physical wellbeing. For transgender people meanwhile, gender affirmation has been found to be a significant positive factor in mental health and can save lives. So, this June I invite you to celebrate Pride Month, not only for the LGBTQ+ community and its allies but also for all marginalised communities."
        }
    ]
}