{
    "url": "https://forestrycommission.blog.gov.uk/2024/03/26/fast-tracking-woodland-creation-in-low-sensitivity-areas/",
    "title": "Fast-tracking woodland creation in low sensitivity areas",
    "authors": [
        "Ewan Calcott"
    ],
    "categories": [
        "Woodland creation"
    ],
    "pub_date": "2024-03-26T12:29:40+00:00",
    "content": [
        {
            "heading": 2,
            "text": "Mapping the opportunity "
        },
        {
            "text": "Government has set a legally binding target to increase tree and woodland cover from 14.5% to 16.5% by 2050 in England. This equates to around 250,000 hectares of land in total (subject to tree stocking density) being converted to woodland cover – that is roughly 9,000 hectares of new woodland per year.  "
        },
        {
            "text": "The potential for woodland creation in England can be broken down as follows:"
        },
        {
            "text": "These figures show that, with support for land use change by landowners and managers, there’s plenty of scope to meet the targets for woodland creation in England, and through the new woodland creation sensitivity mapping, we are able to show that there is plenty of scope to achieve this within low sensitivity mapped areas as well. "
        },
        {
            "text": "By providing clear evidence as to where best to create new woodland, and how we can better promote and manage the pipeline of proposals coming forward. As the regulator, we can be confident in making quick and efficient decisions, especially in low sensitivity areas, while being more consistent in our approach to proposals in areas of higher sensitivity. "
        },
        {
            "text": "I have assessed hundreds of woodland creation applications over my years in the Forestry Commission and I really believe that sensitivity mapping is the most significant ‘new’ tool that has been developed in the last 30 years. Alongside Ecological Site Classification (ESC), a mapping tool which helps match the suitability of commonly used tree species with land parcels in England, sensitivity mapping plays a pivotal role in helping to inform whether to agree new woodland proposals and so deliver against woodland creation targets. "
        },
        {
            "heading": 2,
            "text": "How it works "
        },
        {
            "text": "Sensitivity mapping involves analysing multiple national datasets to determine the sensitivity levels of different areas. Since 2016, we have collaborated with local authorities, environmental NGOs, and other partners within Defra (including Natural England and Environment Agency), to enhance access to and the quality of environmental data.  "
        },
        {
            "text": "The new woodland creation sensitivity map (version 4.0) uses over 20 environmental datasets to create a combined sensitivity map to pinpoint areas in England with: "
        },
        {
            "text": "Users can quickly spot areas with minimal environmental and or societal pressures and so identify the best opportunities for locating tree planting prior to putting in their application. Additionally, we at the Forestry Commission can use the mapping to identify places where tree planting should be avoided due to existing protections, designations or other constraints. This helps us continue to ensure the right trees and woodland are planted in the right locations. "
        },
        {
            "text": "Not everyone will agree with the approach we have used in developing this product and to fast-track applications in the identified low sensitivity areas. To provide reassurance, a proposal within a low sensitivity area does not automatically have a green light (just as proposals outside do not have a stop light) to tree planting. Each proposal is unique and will be fully assessed on its merits.  "
        },
        {
            "text": "Sensitivity mapping is only one part of the evidence base and that decision-making process. All our checks and controls remain in place, but taking a data-driven approach allows us to identify proposals where there are likely to be fewer sensitivities or constraints to woodland creation which can lead to simpler, faster decisions. "
        },
        {
            "heading": 2,
            "text": "Maintaining standards "
        },
        {
            "text": "As well as the sensitivity mapping, we also provide a Land Information Search (LIS) service to help individuals identify the specific constraints, opportunities and obligations on the land, as well as who to talk to for more information. That advice should then be used to inform the design of a proposal, including any mitigation needed to avoid tree planting having negative impacts. "
        },
        {
            "text": "The LIS report will soon include data from the Botanical Society of Britain and Ireland (BSBI) on rare and threatened species as a constraint to check. While use of this data is still to be rolled out, initial analysis suggests that there are very few records of rare or threatened plants in areas mapped as low sensitivity. As would be expected, there are far more BSBI records in high sensitivity areas, where we expect to see priority species and species rich habitats. "
        },
        {
            "text": "To ensure decision-making remains robust, we will always undertake a site visit to make sure that documentary evidence in a woodland creation application is accurate. A site visit will help identify any unmapped or unrecorded environmental features that are likely to be adversely affected by tree planting, such as ancient hedgerows, veteran trees, fragments of priority habitats, wet flushes etc., even in low sensitivity areas. We can then apply appropriate mitigation measures to protect important features or conversely, refuse an application to protect those environmental features.  "
        },
        {
            "text": "When assessing woodland creation proposals, we don’t just consider the land sensitivity for where planting trees is proposed. We also consider what tree species are intended to be planted and their suitability in the location, as well as the planning for new woodland design and its implementation. For example, we will consider the appropriateness of soil preparation, the use of novel tree species, or the means of tree protection during establishment, all of which have a potential environmental risk. These are all parts of the Environmental Impact Assessment (EIA) regulation screening. "
        },
        {
            "text": "Proposals will also continue to be checked against the UK Forestry Standard (UKFS) which provides a baseline framework of legal requirements and good practice guidelines. Proposals which fail to demonstrate compliance with UKFS will be returned to the proposer as unacceptable.  "
        },
        {
            "heading": 2,
            "text": "What this means for woodland creation proposals "
        },
        {
            "text": "For proposals in low sensitivity areas, our target is to make a decision in 12 weeks on eligible applications. This compares to potentially more than a year for some proposals in high sensitivity locations where seasonal habitat or species surveys may be required. "
        },
        {
            "text": "If we can confidently identify low sensitivity areas for woodland creation, and appropriate site visit checks are put in place on individual proposals, then in most cases these proposals will enjoy simpler, faster decisions. This will then generate more time and resource to be available to consider proposals in the medium or high sensitivity areas. "
        },
        {
            "heading": 2,
            "text": "Conclusion "
        },
        {
            "text": "We have difficult targets to achieve and are starting from a low rate of land use change. To best achieve the targets, we want to encourage many more proposals in low sensitivity areas where, through our analysis, we have shown there’s plenty of scope for appropriate UKFS compliant woodland creation proposals. "
        },
        {
            "text": "To further help encourage and support planting in low sensitivity areas, on the 18 March a new payment available for England Woodland Creation Offer applications on low sensitivity land was introduced. This, alongside use of the new woodland creation sensitivity mapping (V4.0) will provide further financial benefit to the applicant and speed up decision making in these areas. "
        }
    ]
}