{
    "url": "https://educationhub.blog.gov.uk/2024/03/how-were-upgrading-school-buildings-across-england/",
    "title": "How we're upgrading school buildings across England",
    "authors": [
        "mediaofficer"
    ],
    "categories": [
        "Condition Improvement Fund",
        "School building",
        "Schools"
    ],
    "pub_date": "2024-03-26T15:50:32+00:00",
    "content": [
        {
            "text": "We’ve allocated over £17 billion since 2015 for keeping schools all over the country in good condition. That includes £1.8 billion for the 2024-25 financial year."
        },
        {
            "text": "Most of the funds are given to local authorities, large multi-academy trusts, and large voluntary aided school groups, to invest in maintaining and improving the condition of their schools."
        },
        {
            "text": "Other funding is targeted on essential maintenance projects at small and stand-alone academy trusts, other voluntary aided schools, and sixth-form colleges."
        },
        {
            "text": "Schools and sixth form colleges are also allocated their own capital funding to spend on smaller projects, or improvements to facilities, such as ICT."
        },
        {
            "text": "We regularly monitor the condition of school buildings across England, and our recent condition survey shows that over 95% of the grades given to the different elements of buildings assessed were As and Bs – meaning they’re in a good or satisfactory condition."
        },
        {
            "heading": 3,
            "text": "What are you doing to keep school buildings safe?"
        },
        {
            "text": "We have allocated over £17 billion since 2015 for keeping schools in good working order, including £1.8 billion committed for 2024-25."
        },
        {
            "text": "Included in this funding for 2024-25 is £1.15 billion in School Condition Allocations (SCA). This is funding for local authorities, large multi-academy trusts, dioceses, and other large voluntary aided school groups, to invest in maintaining and improving the condition of their schools."
        },
        {
            "text": "Almost £450 million has also been made available for the Condition Improvement Fund (CIF) programme this year. This includes support for over 850 essential maintenance projects at small and stand-alone academy trusts, voluntary aided schools, and sixth-form colleges."
        },
        {
            "text": "The fund also provides Urgent Capital Support for these schools where there are serious issues that threaten immediate school closure."
        },
        {
            "text": "Also included in the funding this year is over £200 million that has been allocated directly for schools to spend on projects to meet their own capital priorities. This is called Devolved Formula Capital (DFC)."
        },
        {
            "text": "We are also investing in new and refurbished buildings at over 500 schools through our  School Rebuilding Programme."
        },
        {
            "text": "Our approach with this investment is working - over 95% of school building elements surveyed as part of the Condition Data Collection (CDC) between 2017 and 2019 were in good or satisfactory condition (condition grade A or B)."
        },
        {
            "text": "Only a very small percentage - 0.3% - of building components needed replacing straight away (Grade D)."
        },
        {
            "text": "As a department we are most concerned by the grade Ds - which refer to materials that are due to be replaced – for core elements of buildings."
        },
        {
            "text": "Early indications in our successor survey, Condition Data Collection 2, (CDC2), alongside feedback from responsible bodies, shows that in almost every case where a Grade D component was identified in the first survey has now been addressed."
        },
        {
            "heading": 3,
            "text": "What is the School Rebuilding Programme?"
        },
        {
            "text": "Over this decade, our  School Rebuilding Programme is transforming over 500 schools in the most need of renovation."
        },
        {
            "text": "Schools are selected for the programme according to their condition."
        },
        {
            "text": "A list of confirmed projects is available, including information on when each was announced."
        },
        {
            "heading": 3,
            "text": "How are you supporting schools where there is RAAC?"
        },
        {
            "text": "Last year, to ensure schools continue to be safe for staff and pupils, we changed our approach to managing a building material found in some school buildings and other education settings, known as Reinforced Autoclaved Aerated Concrete (RAAC)."
        },
        {
            "text": "The new guidance advises education settings to vacate areas that are known to contain RAAC, unless or until suitable mitigations are in place."
        },
        {
            "text": "We’ve supported schools with confirmed RAAC with additional funding for mitigation work where needed, such as propping and temporary accommodation on site."
        },
        {
            "text": "We are also working to permanently remove RAAC from school and college buildings across England."
        },
        {
            "text": "This is being funded either through grants or the School Rebuilding Programme."
        },
        {
            "text": "Schools and colleges where removing RAAC will typically be on a smaller scale, will receive grant funding, while those where works to remove RAAC are more extensive or complex will be funded through the School Rebuilding Programme."
        },
        {
            "text": "It’s important to remember that only around 1% of schools and colleges in England have confirmed RAAC in some areas of their buildings."
        },
        {
            "heading": 3,
            "text": "What about schools where there is asbestos?"
        },
        {
            "text": "Asbestos management in schools is regulated by the Health and Safety Executive (HSE) and we follow their expert advice."
        },
        {
            "text": "The HSE advises that, as long as materials are in good condition, well protected, and unlikely to be damaged or disturbed, it is usually safer to manage them in place."
        },
        {
            "text": "However, if the asbestos is found to be at a significant risk of disturbance or accidental damage and it’s not safe to leave where it is, it is the duty holder’s responsibility to make sure it is removed by a trained specialist."
        },
        {
            "text": "We’re working with the sector to promote best practice and guidance so that schools are aware of their duties to keep children and teachers safe."
        },
        {
            "text": "We previously run an Asbestos Management Assurance Process (AMAP) - a voluntary survey we launched in March 2018 to understand the steps schools and those responsible for their estate were taking to manage asbestos."
        },
        {
            "text": "Over 20,600 schools in England responded and it showed that most schools continue to follow core statutory duties."
        },
        {
            "text": "We are now collecting Information from schools on how they are managing asbestos through our Condition Data Collection 2 (CDC2), which started in 2021 and will complete in 2026. It is expected to cover all state funded schools."
        },
        {
            "heading": 3,
            "text": "Whose responsibility is it to maintain school buildings?"
        },
        {
            "text": "It is the responsibility of those who run our schools – typically academy trusts, local authorities, and voluntary-aided school bodies – who work with their schools’ day-to-day to manage the safety and maintenance of their schools. They should alert us if there is a serious concern with a building they cannot manage."
        },
        {
            "text": "We provide access to funding, targeted towards where it is most needed, to help them carry out these responsibilities, alongside a package of other guidance and support."
        },
        {
            "text": "We provide additional support on a case-by-case basis if we are alerted to a serious safety issue."
        },
        {
            "heading": 3,
            "text": "What about the old schools that were built in the 1960s, will these be replaced?"
        },
        {
            "text": "31% of the floor area of the school estate is modern – having been built since 2000.\nThe age of a building does not mean it is at the end of its life."
        },
        {
            "text": "While schools can expect reasonable wear and tear, buildings that are well kept can be fit for purpose beyond their original design."
        },
        {
            "text": "To support schools that do need buildings replaced, our School Rebuilding Programme will transform buildings at over 500 schools over the next decade, prioritising schools in poor condition and with evidence of potential safety issues."
        },
        {
            "heading": 3,
            "text": "What are you doing to ensure the sustainability of schools?"
        },
        {
            "text": "As part of our climate change and sustainability strategy, we are assessing emissions and the risk posed to schools by the impact of climate change, like flooding."
        },
        {
            "text": "This will allow us to set targets and act efficiently, cost-effectively and with the least disruption."
        },
        {
            "text": "Any new or refurbished school delivered centrally by the DfE will be designed to be Net Zero in operation and include a wide set of adaptive measures to respond to climate change."
        },
        {
            "text": "We have also published guidance for settings on how to become more sustainable and worked closely with other departments to support access to government funding for schools and colleges to help reduce or eliminate their carbon dioxide emissions."
        },
        {
            "text": "From May 2025, all schools will be able to access a new Sustainability Leadership digital hub and support service."
        }
    ]
}