{
    "url": "https://educationhub.blog.gov.uk/2024/03/improving-support-children-young-people-special-education-needs-send/",
    "title": "How we’re improving support for children and young people with special education needs",
    "authors": [
        "mediaofficer"
    ],
    "categories": [
        "Schools",
        "SEND"
    ],
    "pub_date": "2024-03-26T00:01:10+00:00",
    "content": [
        {
            "text": "All pupils should have access to the resources and support needed to fulfil their potential."
        },
        {
            "text": "Last year, we unveiled an ambitious plan, which set out our aims to change the special educational needs and disabilities (SEND) and alternative provision system in England."
        },
        {
            "text": "Over the past year, we’ve been delivering against this plan and rolling out measures to ensure the educational system meets the needs of all children and young people."
        },
        {
            "text": "Here’s everything you need to know."
        },
        {
            "heading": 3,
            "text": "What are we doing to improve provision for pupils with SEND?"
        },
        {
            "text": "Councils are required to provide services for children and young people with SEND but we know that it’s not always easy for parents to find the support they need for their child in their local area."
        },
        {
            "text": "To help, we are investing £850 million into local authorities across the country to improve services. Local authorities can use this money to create new places in mainstream and special schools, as well as other specialist settings, and to improve existing buildings to make them more accessible and suitable for all."
        },
        {
            "text": "This funding is part of a £2.6 billion package we’ve committed to improve SEND services between 2022 and 2025."
        },
        {
            "text": "This will provide over 60,000 new places for children or young people with SEND or who require alternative provision."
        },
        {
            "text": "We’ve also allocated £13 million for mainstream schools to make sure they have the resources to cater to neurodiverse children and help them to thrive."
        },
        {
            "heading": 3,
            "text": "Are you going to build more special schools?"
        },
        {
            "text": "While reasonable adjustments are made in mainstream schools for pupils with SEND, we know that for some children, a specialist setting may be a better fit."
        },
        {
            "text": "Special schools are specifically designed for pupils with complex needs, with tailored support and specialist equipment such as sensory appliances and communication aids."
        },
        {
            "text": "As well as the funding for local authorities, we’re improving the availability of these facilities through the special free schools programme."
        },
        {
            "text": "108 of these schools are now open and 92 more will open in due course, which includes the 30 new successful applications to run special free schools."
        },
        {
            "heading": 3,
            "text": "What is being done to support young people with SEND in apprenticeships?"
        },
        {
            "text": "Apprenticeships are a brilliant option for young people looking to develop their skills and gain a degree-level education. It’s vital that these programmes remain accessible to everyone."
        },
        {
            "text": "In January 2024, we launched a year-long mentoring support pilot for apprentices with learning difficulties or disabilities."
        },
        {
            "text": "Through this scheme, we offer advice and training for prospective mentors and providers to ensure they’re equipped to offer apprentices the support they need. The training offer is now live, and mentors are currently being matched with their apprentices."
        },
        {
            "text": "We’re aware that achieving a level 2 qualification in English and Maths can be a barrier to completing apprenticeships for students with learning difficulties and disabilities."
        },
        {
            "text": "Last May, a pilot was launched, allowing these students to take these subjects at a lower level (entry level 3), irrespective of whether or not they currently have an Education, Health and Care Plan (EHCP)."
        },
        {
            "text": "This means more students are able to study English and Maths at this level, helping more young people to achieve their apprenticeships."
        },
        {
            "heading": 3,
            "text": "Where can I find out more about what support is available in my area?"
        },
        {
            "text": "You can find out more about the funding granted to your local authority, here."
        },
        {
            "text": "To find out what support is available where you live, visit your local authority’s website and search for SEND."
        },
        {
            "text": "You can also find out more on your area’s Local Offer website – simply type your local authority’s name and ‘SEND local offer’ into your search engine."
        }
    ]
}