{
    "url": "https://openpolicy.blog.gov.uk/2024/03/26/manifest-artists-policy-and-the-process-of-making-change/",
    "title": "MANIFEST: Artists, policy and the process of making change",
    "authors": [
        "Stephen Bennett",
        "patrycjakaszynska"
    ],
    "categories": [
        "Policy Lab"
    ],
    "pub_date": "2024-03-26T13:51:07+01:00",
    "content": [
        {
            "text": "As part of our 10th anniversary year, this blog reflects on some initial outputs and outcomes of MANIFEST, a Policy Lab initiative supported by the Arts and Humanities Research Council to bring outstanding UK-based artists into policy processes.  "
        },
        {
            "text": "Over the past year, Christopher Samuel, Semiconductor and Dryden Goodwin were each embedded in a different government policy team and produced work in response to that placement. Outputs were first exhibited in Somerset House in a work-in-progress show in May 2023, then at Bloc Projects in Sheffield in December 2023. We, Policy Lab and the University of the Arts London, have recorded the ways that the programme can be said to have made a difference. We have observed that both policymaking and artmaking have been impacted. Policy professionals involved not only appreciated the effects/outcomes but were able to link them to specific – core – needs and problems they encounter in their work. This can be classified under the following categories: "
        },
        {
            "text": "The next sections explain these themes in more detail, with quotes gathered from various participants and policy professionals, alongside photographs from the exhibition in Sheffield.  "
        },
        {
            "heading": 3,
            "text": "Contributing towards innovation in policy development"
        },
        {
            "text": "MANIFEST has tapped into the innovation agenda in policymaking. This is not only the sense that policy professionals see the need to do things differently given various technological and societal trends, but there is a desire to find new solutions for entrenched policy challenges. Dryden Goodwin spent time with Changing Futures, a cross-government programme seeking to improve outcomes for adults experiencing ‘multiple disadvantage’, defined as a challenging set of overlapping circumstances including homelessness, substance misuse, mental health issues, domestic abuse and contact with the criminal justice system. Dryden combined drawings, film and sound recordings to connect to a diversity of people within the complex policy system, including disadvantaged individuals, those involved in front line support and an assembly of people looking to redesign an entire approach to policy.  "
        },
        {
            "text": "Policy professionals considered that Dryden’s approach invited a ‘much broader perspective’ which inspired and challenged them to ‘look’ at a complex system from perspectives of care, humanity and emotion. "
        },
        {
            "heading": 3,
            "text": "Drawing attention to the aspects of policymaking that might otherwise go unnoticed "
        },
        {
            "text": "The MANIFEST artists showed an ability to draw attention to things which may otherwise have been overlooked and could cause detriment to people, groups and the achievement of intended policy outcomes.  "
        },
        {
            "text": "Christopher Samuel worked with a team in DLUHC which develops policy for, and is delivering, the £150m Community Ownership Fund (COF) scheme aimed at enabling people and groups across the UK to save local assets at risk of loss. Christopher’s practice is rooted in identity and disability politics, often echoing facets of his own lived experience. He channelled this into an artwork which articulates his own policy green paper, surfacing questions relating to equality of access, application processes for the Fund, subjectivity, lived experience and modes of engaging people in policy.  "
        },
        {
            "text": "Semiconductor worked with the Foresight, Futures, and Emerging Technology team at the Government Office for Science. This team focuses on the policy implications of medium-long term trends and scenarios for technology development and wider societal change. Semiconductor created a series of drawings using programming, carbon and a computer plotter, exploring the ways in which humankind seeks to position itself in relation to notions of time and the future. They took the Government Office for Science’s Futures Toolkit as a starting point, before exploring other words or phrases relating to time and the future from psychology, physics, government research and science fiction.  "
        },
        {
            "text": "Terms on these future maps include ‘neuro imaging’, ‘daydreaming’, ‘abstract representations’ and ‘astronomical horizon of time’. Through the act of hand-picking their reference points from a variety of disciplines and systems of knowledge-making, Semiconductor emphasise the subjective nature of the gathering and editing process, raising questions around whose voice is heard and who is best placed to imagine potential futures. The need for people and policy professionals to consider long term trends in our policy decisions today is emphasised by Semiconductor’s chosen medium – the black carbon in the images is the residue of diesel vehicle exhaust emissions.   "
        },
        {
            "heading": 3,
            "text": "Bringing out human elements in the policy system "
        },
        {
            "text": "Through their ways of seeing, the artists have indicated to various policy professionals a range of approaches which humanise the policymaking process. This might be through the questions asked which ‘cut through Civil Service language’ or by putting emphasis on different agents in the system which bypass customary structures and notions of success. "
        },
        {
            "text": "One policy professional explicitly spoke of ‘art breathing oxygen that helps policy become more caring and human’, helping policy thinking ‘move beyond scarcity and austerity’. "
        },
        {
            "text": "The very care and attention with which Dryden sketched people impacted by, and working on, multiple disadvantage made everyone stop, slow down and engage with the fact that policy systems comprise individual people – who ultimately determine the very failure or success of policy."
        },
        {
            "text": "All three artists explored human dimensions of policymaking. As a result, one of the policy teams is foregrounding lived experience more squarely in developing their policy work. A policy professional in the Government Office for Science was prompted by Semiconductor’s work to critique the neutral character of evidence which might be used in policy and that ‘where you choose to look [for evidence] is political.’ "
        },
        {
            "text": "As an intriguing reverberation to this, the artists reflected on seemingly small but important observations that there are human beings behind the policymaking process contending with many complexities. Christopher Samuels thought that ‘the biggest surprise for me was hearing how in-depth, complicated, researched, and thoughtful, the policymaking process is’. "
        },
        {
            "heading": 3,
            "text": "Making space for and prompting reflection "
        },
        {
            "text": "Policy professionals spoke of the role that artists can play, in effect, as critical friends, helping policy professionals reflect upon their practice to improve outcomes for citizens. "
        },
        {
            "text": "A simple, yet powerful, point emerges from this and other feedback: MANIFEST provided exposure to different points of view and an opportunity to reflect, something for which the drive and focus of typical policy processes can often leave little room.  "
        },
        {
            "heading": 3,
            "text": "Greater engagement in policy issues by representing them visually and materially  "
        },
        {
            "text": "Policy professionals identified a clear link between artworks, artists and communicating policy issues. Going into the programme, this was one of the most promising roles that we believed art could play in policy (and informed the title of the programme, MANIFEST). After the programme, this was still seen as a powerful role of art in policy, albeit nested in broader and more sophisticated assessment of how art can engage people in complex and emotional issues, possibly even changing how policy questions are articulated and framed. "
        },
        {
            "heading": 3,
            "text": "Effects on wellbeing for policymakers and stakeholders "
        },
        {
            "text": "On the most basic level, lots of unprompted feedback highlighted that participation in the initiative brought benefits in terms of wellbeing for policy professionals, stakeholders, and artists."
        },
        {
            "heading": 3,
            "text": "Learning from the pilot "
        },
        {
            "text": "The pilot has unearthed many constructive learnings for bringing artists into policy in the future. We have learnt about the enthusiasm of policy professionals to be exposed to the day-to-day studio processes adopted by artists in their practices, potentially as an inspiration for bringing more creative thinking to their own policy practice. Policy professionals have expressed interest in using artworks directly in key decision-points relating to policies, for example as part of a consultation, stakeholder engagement workshop and cross-government deliberation. This highlights that there is ‘internal’ demand for engaging with artmaking, and artists, among the policy professionals. One dynamic that could be further tested would be the location in which the artworks might be displayed. Exhibiting work on a gallery wall, in a Minister’s office or in a public-facing location could have profoundly different effects upon people involved at different stages of the policy cycle. "
        },
        {
            "heading": 3,
            "text": "Concluding thoughts "
        },
        {
            "text": "The placements offered by MANIFEST in the pilot year provoked, inspired and enriched ways of thinking and acting in the policy environment. The programme has provided a platform for starting to piece together the complex and complicated ways that artmaking and policymaking interact, and what the use of art in policy is and what it can be in the future.  "
        },
        {
            "text": "We are planning to put these learnings into practice - and continue to develop an evidence base on the roles that art may play in policy - with a second iteration of MANIFEST. If you are a policymaker who is interested in deploying innovative approaches like art, super forecasting, co-design, or collective intelligence in policymaking then please contact us. "
        }
    ]
}