{
    "url": "https://companieshouse.blog.gov.uk/2024/03/26/our-new-powers-to-challenge-and-change-company-names/",
    "title": "Our new powers to challenge and change company names",
    "authors": [
        "Alun Howells - Principal Policy Advisor"
    ],
    "categories": [
        "Changes to UK company law",
        "Companies House transformation",
        "Company guidance"
    ],
    "pub_date": "2024-03-26T11:11:37+00:00",
    "content": [
        {
            "text": "On 4 March 2024, the first measures under the Economic Crime and Corporate Transparency Act came into force. We started using our new and enhanced powers to clean up and improve the integrity of the register, which over time, will help to disrupt economic crime and provide greater transparency across the UK business environment."
        },
        {
            "text": "As part of these new measures, we’re running stronger checks on company names which may give a false or misleading impression to the public. This will help us improve the accuracy and quality of the data we hold and help tackle the misuse of company names."
        },
        {
            "heading": 2,
            "text": "New powers to challenge company names  "
        },
        {
            "text": "These new measures build on existing controls on company names. Names cannot be the same as or too similar to an existing name, and certain terms are restricted, such as terms implying a connection to the UK government or using a sensitive word or expression."
        },
        {
            "text": "Under the Economic Crime and Corporate Transparency Act, we can now also reject an application to register a name where we have reason to believe:"
        },
        {
            "text": "We can also direct companies to change their name in more circumstances, for example, where the name has been used, or is intended to be used, by the company to facilitate fraudulent activity."
        },
        {
            "text": "If a company fails to change its name within 28 days, we can now determine a new name for the company, for example, changing the company name to its registered company number."
        },
        {
            "text": "We also have the power to suppress a name from the register while a company responds to a direction to change its name."
        },
        {
            "heading": 2,
            "text": "Failure to comply is an offence"
        },
        {
            "text": "If a company does not respond to a direction to change their company name within 28 days, an offence is committed."
        },
        {
            "text": "It’s also an offence to continue using a company name which we have directed to change."
        },
        {
            "heading": 2,
            "text": "Company Names Tribunal"
        },
        {
            "text": "The Company Names Tribunal continues to be responsible for considering objections to the use of a name which is:"
        },
        {
            "heading": 2,
            "text": "Stay up to date on the changes that affect you"
        },
        {
            "text": "The work will continue at pace as we implement more changes over the coming years, including identity verification, streamlining accounts filing options for small and micro entity companies, and transitioning towards filing accounts by software only. We’ll let you know when all these changes will come into effect as soon as we can."
        },
        {
            "text": "We're confident that, over time, these new powers will make a difference to the accuracy and integrity of the information on the register and will help to make sure the UK remains a great place to do business."
        }
    ]
}