{
    "url": "https://defencedigital.blog.gov.uk/2024/03/26/three-two-one-get-hacking/",
    "title": "Three...Two...One...Get Hacking!",
    "authors": [
        "jithinsajan"
    ],
    "categories": [
        "Digital skills"
    ],
    "pub_date": "2024-03-26T17:25:26+00:00",
    "content": [
        {
            "text": "Don’t worry, I’m not referring to unethical hacking, this type of hacking can bring a whole host of benefits in helping us secure our digital future."
        },
        {
            "text": "If you haven't guessed, I’m talking about hackathons. But why exactly is this important for defence?"
        },
        {
            "heading": 2,
            "text": "Road to a digitally savvy workforce"
        },
        {
            "text": "As you may have read in our secondment blog, our people are critical in our mission to effectively deliver and exploit the Digital Backbone. We require personnel with a diverse skillset if we want to accelerate our journey towards a digital defence and this is exactly what hackathons provide."
        },
        {
            "text": "The obvious benefit from hackathons is the opportunity for people to work with new and cutting edge technology. From hardware including robotics and military devices to software utilising AI and the Internet of Things, the list is endless and you have it all at your fingertips when devising solutions to tackle some of defence’s complex challenges. This equips people with a range of digital and technical skills that can then be brought back to benefit our projects."
        },
        {
            "text": "In a hackathon, you have to develop solutions over a relatively short period of time, working in a dynamic and collaborative environment. This brings with it a whole host of transferrable soft skills for people to pick up. By working alongside a team, you can look to build on your communication and teamwork skills and the fast-paced environment is ideal to improve your ability to think on your feet and make quick decisions."
        },
        {
            "text": "People from all areas of industry come together to compete in hackathons. This means you can meet some incredible people, widen your network and make some really good friends. Surrounding yourself with new people is also a great way to learn. You can get to see their ways of working and how they approach problems which you can look to apply yourself."
        },
        {
            "text": "It’s not often you can experience the above benefits whilst working on some really cool stuff that can have a global impact. Moreover, it is these skills that are key when shaping the digital leaders of the future."
        },
        {
            "text": "But don’t just take my word for it, below you can see a showcase of hackathons our personnel have attended and the above benefits in action."
        },
        {
            "heading": 3,
            "text": "Defence Hackathon 2023"
        },
        {
            "text": "This annual hackathon was hosted with industry experts from Microsoft and Amazon. Three real-world defence problems were presented to ten teams and over the course of five days, we saw several innovative solutions that can help streamline the MOD services including:"
        },
        {
            "text": "Watch our video to see some of the highlights from last year's Defence Hackathon: Defence Hackathon 2023: looking back (youtube.com)"
        },
        {
            "heading": 3,
            "text": "NATO TIDE Hackathon 2024"
        },
        {
            "text": "This year’s hackathon was held in Amsterdam and we had colleagues across various teams in Defence Digital attend. Not only did they attend, but they went one step further and won one of the challenges (‘Noisy Speech-to-Text’ challenge), a fantastic achievement!"
        },
        {
            "text": "The ‘Noisy Speech-to-Text’ challenge looked to tackle the difficulty in accurately transcribing audio intelligence in military environments due to the many types of background noise pollution. The winning solution effectively tackled this interoperability challenge by leveraging the power of AI and it supported multiple languages whilst being run either virtually or locally."
        },
        {
            "text": "The winning team was composed of Bethan Padbury, Megan Jones and Jessica Winterborne, all graduates from Defence Digital and here’s what they had to say:"
        },
        {
            "text": "Megan: \"I was very proud to represent Defence Digital in this year’s NATO Hackathon. It was an amazing opportunity to be a part of, with a big focus of the event being on interoperability between nations. As well as this, there was a strong emphasis on sharing ideas between groups and from this, I have met many talented people that I am excited to keep in touch with.\""
        },
        {
            "text": "Beth: \"I had a great time at this year’s NATO TIDE Hackathon. It was exciting to work in such a collaborative environment where we all aimed to bring our very best to create solutions for the challenges that were set. I hope to participate in more events like this in the future, learning different ways to approach problems and perhaps create new tools to help us in the work we do.\""
        },
        {
            "text": "Jess: \"I’m very grateful to have been given the opportunity to be involved in this hackathon. It’s been an invaluable experience where I’ve learned and tested many new skills. I’m excited to bring our solution back to DD to continue improving on it and hopefully utilise it.\""
        },
        {
            "text": " "
        },
        {
            "heading": 3,
            "text": "Women in Data ‘Hidden Reality’ Hackathon 2024"
        },
        {
            "text": "This hackathon was run during the Women in Data event this year and we had eight personnel from Defence Digital participate. They utilised sophisticated analytical techniques, including the use of AI, to explore and understand survey results from a nationwide research task undertook by Women in Data."
        },
        {
            "text": "Unlike other hackathons which has a competitive element, this was more centred around multi-team collaboration to come up with effective data-led decisions that can have a lasting impact on society. This allowed people to develop their interpersonal skills and relationships with people across industry."
        },
        {
            "text": "Alexandra, a graduate from the Data Exploitation Team who participated in this hackathon, said: \"I think events like this are a really good way to meet new people, discuss ideas and learn new things and are also a good opportunity to put to use the skills that I have learnt through training. In my role as a data analyst, it is important to be able to tackle projects creatively and often there is no one solution, so hackathons offer a great way of challenging your current ways of thinking to come up with different ways to solve problems. I found the event very insightful and I will definitely be signing up for more in the future.\""
        },
        {
            "text": "We have more hackathons coming up this year and we want to continue giving our people the opportunity to participate and gain the skills and experience, in the hope that one day, they will become our next innovators, collaborators and digital leaders."
        }
    ]
}