{
    "url": "https://environmentagency.blog.gov.uk/2024/03/26/water-company-employees-how-to-report-serious-wrongdoing-to-the-environment-agency/",
    "title": "Water company employees: How to report serious wrongdoing to the Environment Agency",
    "authors": [
        "Environment Agency"
    ],
    "categories": [
        "Environment Agency",
        "Regulated industry",
        "Water"
    ],
    "pub_date": "2024-03-26T08:17:36+00:00",
    "content": [
        {
            "text": "Today, Tuesday 26th March, the Environment Agency (EA) has launched a new whistleblowing portal enabling water company staff to report environmental wrongdoing by their own organisations and industry.  "
        },
        {
            "text": " Our message to water company workers is that if you suspect the organisation where you work has done, is doing, or going to do something wrong, and you’ve already raised these concerns with them but nothing, or not enough, has been done, there is now a dedicated route for you to report those concerns in confidence – securely, safely and directly. "
        },
        {
            "text": " The information provided via the whistleblowing portal will be handled in a secure and confidential way and assessed by our intelligence teams, to be used in our regulatory role to prevent, guide or enforce where harm or mismanagement of the environment is happening. The portal, which builds on EA’s existing arrangements for whistleblowing, will provide a safe route to enable workers in the water industry to report – in confidence – concerns about wrongdoing they have witnessed at work. The portal is also open to workers from waste, nuclear, fishery, farming, agricultural and chemical companies as well as water firms, and includes a section to report EA members of staff.  "
        },
        {
            "text": "Whistleblowing is not meant for reporting emergencies or environmental incidents that require an immediate or rapid response. These should continue to be reported to the 24/7 Environment Agency incident hotline instead (Tel: 0800 80 70 60).   "
        },
        {
            "text": "As a regulator of the water industry and the organisation responsible for protecting England’s environment, the Environment Agency is designated as a “Prescribed Person” to receive whistleblowing concerns. This means that the employment rights of a person making a report to us should be protected, where the disclosure meets the criteria. The Environment Agency is also empowered to listen to and act on reports from whistleblowers about serious environmental wrongdoing.   "
        },
        {
            "text": "The new whistleblowing portal reinforces our continued commitment to stronger regulation and tougher enforcement to improve water quality. We are playing our part by transforming the way we regulate the sector. Only last month (February) we announced a fourfold increase in water company inspections to hold companies to account. Inspections carried out by the EA will rise to 4000 a year by the end of March 2025, and then to more than 10,000 from April 2025.  We are embedding a new approach that targets our resource and interventions to uncover non-compliance and drive better performance from the water industry – the whistleblowing portal is an important part of this. Ensuring people and wildlife have clean and plentiful water is one of the biggest challenges we face but also one of the biggest gifts we can give to future generations.  "
        },
        {
            "text": " What is the portal? "
        },
        {
            "text": "If you suspect an organisation is involved in environmental wrongdoing, you can raise concerns by visiting https://www.gov.uk/guidance/whistleblowing-report-serious-wrongdoing-to-the-environment-agency "
        },
        {
            "text": "and using our new dedicated email address. The information is routed directly and confidentially to our specialist intelligence team who will assess it. You will receive an automatic acknowledgment that we have your report of wrongdoing. If we need more information from you, we may contact you to request more details. The information that we gather could then play an important part in our regulation and checking of businesses and may lead to us taking enforcement action if justified.  "
        },
        {
            "text": "EA also has its own established internal whistleblowing process for EA staff to raise concerns. Alternatively, individuals employed by the EA can reach out to a prescribed person such as the Office for Environmental Protection or their MP if they wish. "
        },
        {
            "text": "Why is whistleblowing important? "
        },
        {
            "text": "Whether by mistake, or on purpose, it’s possible for all regulated companies to commit wrongdoing. The EA can look into instances where a worker suspects their employer could be participating in any of the following: "
        },
        {
            "text": " As part of the EA’s commitment to providing effective regulation and oversight of our areas of responsibility, we’re dedicated to addressing environmental harm caused by companies.  "
        },
        {
            "text": "What to do "
        },
        {
            "text": "When you contact the portal email, in order for us to look into any concerns you might have, it’s important that you include the right information. This includes: "
        },
        {
            "text": " Don’t try and gather more evidence to support your concerns without contacting us first. This is to prevent you from putting yourself at risk or compromising an investigation. If you feel the need to tell us anonymously then we can accept your report, but it makes it difficult for us to investigate fully and we will not be able to provide feedback. "
        },
        {
            "text": "What we do with the information "
        },
        {
            "text": "Any information you provide to us will be kept on a secure database, accessible only by a few specially trained staff. Any reports made to us are kept confidential at all times, unless you choose otherwise. "
        },
        {
            "text": "The EA is committed to being an effective regulator and addressing areas of public concern around water. If you work for a water industry company and you suspect your employer is involved in harmful or illegal practices, please visit https://www.gov.uk/guidance/whistleblowing-report-serious-wrongdoing-to-the-environment-agency  to raise a concern.  "
        }
    ]
}