{
    "url": "https://naturalengland.blog.gov.uk/2026/02/25/defining-success-for-wildlife-what-does-thriving-really-mean/",
    "title": "Defining Success for Wildlife: What Does \"Thriving\" Really Mean?",
    "authors": [
        "John Holmes"
    ],
    "categories": [
        "Biodiversity",
        "Evidence",
        "Favourable Conservation Status",
        "Monitoring",
        "Natural England",
        "Nature",
        "Nature Recovery",
        "Wildlife"
    ],
    "pub_date": "2026-02-25T09:00:00+00:00",
    "content": [
        {
            "text": "How do we know when a species is truly thriving, rather than just surviving? This is the question Natural England has been working to answer. We've now published new definitions that set out exactly what success looks like for four of England's most vulnerable mammals: the Leisler's Bat, the Serotine, the Pine Marten, and the Water Vole."
        },
        {
            "text": "These definitions have informed our latest Habitats Regulations 9A report for England 2019 to 2024, published on 22 January 2026."
        },
        {
            "text": "Why This Matters"
        },
        {
            "text": "When it comes to protecting wildlife, it's not enough to simply stop species from going extinct. We need to know what a healthy, thriving population actually looks like and have a clear target to work towards."
        },
        {
            "text": "That's what Favourable Conservation Status (FCS) gives us. Think of it as a science-based definition of success: the point at which a species has enough individuals, living across enough of its natural range, with enough good-quality habitat, that we can be confident it will continue to thrive for generations to come."
        },
        {
            "text": "We've now published over 40 of these definitions, each one a detailed blueprint for species recovery, available on our  Access to Evidence website."
        },
        {
            "text": "How We Define Success"
        },
        {
            "text": "Creating these definitions is meticulous work. Our scientists examine the best available evidence to answer three fundamental questions about each species:"
        },
        {
            "text": "Each definition goes through rigorous review by leading experts, both within Natural England and from external organisations. The result is an ambitious but achievable target one that can be updated as new evidence emerges."
        },
        {
            "text": "This isn't about maintaining the bare minimum. It's about genuine recovery. Knowing what Favourable Conservation Status means and what success looks like is essential, and we cannot deliver Natural England’s Strategy without it. The strategy places species recovery at the heart of everything we do, and these definitions set out what that looks like."
        },
        {
            "text": "Four Species, Four Stories"
        },
        {
            "text": "Each of the four species we're featuring faces different challenges. Here's what we've learned about what they need to thrive."
        },
        {
            "text": "Leisler's Bat: The Stealthy One"
        },
        {
            "text": "The Leisler's Bat is one of the UK's larger bat species, with a distinctive shaggy coat and a fast, direct flight. It's classified as Near Threatened on the international Red List."
        },
        {
            "text": "Our analysis suggests we need around 89,000 Leisler's bats for a truly healthy population. Current estimates put the number at just 9,750 though we believe the true figure may be higher, as these bats can be difficult to survey."
        },
        {
            "text": "Either way, our 2025 assessment found this species to be in Unfavourable-Bad condition. There's work to do."
        },
        {
            "text": "Serotine: Loyal to a Fault"
        },
        {
            "text": "The Serotine is one of Britain's largest bats, often spotted flying at dusk over gardens and parkland. It's classified as Vulnerable on the Red List."
        },
        {
            "text": "We've set a target population of 129,000 this is about 10% more than current numbers. While the species was assessed as stable in 2019, our latest 2025 assessment has downgraded its status to Unfavourable-Inadequate, largely due to habitat concerns."
        },
        {
            "text": "One of the Serotine's characteristics is also its vulnerability: these bats are remarkably loyal to their roosts, often returning to the same building year after year. This makes them particularly at risk when roosts are lost through building work or deliberate exclusion. Since 1999, roost numbers have declined by nearly 4%."
        },
        {
            "text": "Why Bats Matter"
        },
        {
            "text": "Bats are the only mammals capable of true flight, and they make up more than a quarter of all mammal species in the UK. They're also brilliant indicators of environmental health when bat populations are doing well, it usually means the wider ecosystem is too."
        },
        {
            "text": "On a practical level, bats provide valuable services. They consume vast quantities of insects, benefiting farmers and gardeners while helping to control pests that can spread disease."
        },
        {
            "text": "All UK bat species are legally protected. When developers or homeowners need to carry out work that affects bats, they apply to Natural England for a licence. Our new FCS definitions help us make better decisions about these applications ensuring that any impact on bats is properly understood and, where necessary, compensated for."
        },
        {
            "text": "Pine Marten: A Woodland Specialist Making a Comeback"
        },
        {
            "text": "The Pine Marten is an elusive member of the weasel family, with rich brown fur and a distinctive cream throat patch. Once widespread across Britain, it was driven to near-extinction in England by habitat loss and persecution. Today, it's classified as Critically Endangered."
        },
        {
            "text": "But there's hope. Natural England has a 10-year strategy for pine marten recovery, and carefully managed reintroduction projects are starting to bring this species back to English woodlands. (It's worth noting that illegal releases remain a problem and can actually harm recovery efforts.)"
        },
        {
            "text": "Pine Martens need more than just woodland. They thrive in landscapes with a mix of habitats: forest edges, scrubby areas, hedgerows, and even grassland and heathland. We'll know we've achieved Favourable Conservation Status when healthy populations are established not just in existing woodlands, but in the new broadleaved woodlands and connected habitats being created across England."
        },
        {
            "text": "Water Vole: Britain's Fastest-Declining Mammal"
        },
        {
            "text": "The Water Vole, a once common sight across English riverbanks has suffered one of the most dramatic declines of any British mammal, now classified as Endangered."
        },
        {
            "text": "The main culprit? The American Mink, an invasive species that escaped from fur farms and spread across the country. Minks are devastating predators of water voles, able to pursue them into their burrows. Their numbers have also further declined due to habitat loss and fragmentation."
        },
        {
            "text": "Our FCS definition sets an ambitious target. Water Voles currently occupy just 615 of the 10km grid squares in England where suitable habitat exists. For Favourable Conservation Status, we need them present in all 1,163 squares nearly doubling their range. That will require at least 184,000 kilometres of healthy riverbank habitat, plus thriving populations in wetland areas."
        },
        {
            "text": "It's a significant challenge, but Water Voles can recover quickly when the conditions are right. Targeted mink control and habitat restoration projects are already showing results in some areas."
        },
        {
            "text": "What Happens Next"
        },
        {
            "text": "Publishing these definitions is just the beginning. They give us clear, evidence-based targets to work towards and a way to measure whether our efforts are succeeding."
        },
        {
            "text": "Over the coming years, we'll use these definitions to guide our licencing decisions, shape our conservation priorities, and track the progress of species recovery across England."
        },
        {
            "text": "If you'd like to explore our other FCS definitions, or learn more about how we're working to restore England's wildlife, visit our Access to Evidence website."
        },
        {
            "text": "Links to the Favourable Conservation Status publications:"
        },
        {
            "text": "Leisler's bat"
        },
        {
            "text": "Serotine"
        },
        {
            "text": "Pine Marten"
        },
        {
            "text": "Water Vole"
        },
        {
            "text": "You can also read more about Natural England's strategy and how we're putting nature recovery at the heart of our work."
        }
    ]
}