{
    "url": "https://digitaltrade.blog.gov.uk/2026/02/25/levelling-the-playing-field-with-microsoft-accessibility/",
    "title": "Levelling the playing field with Microsoft accessibility",
    "authors": [
        "Dylan Boyer, Digital Engagement Manager in Corporate Systems Solutions (Microsoft)"
    ],
    "categories": [
        "People"
    ],
    "pub_date": "2026-02-25T09:27:21+00:00",
    "content": [
        {
            "heading": 3,
            "text": "Dylan Boyer"
        },
        {
            "text": "In today’s rapidly expanding digital landscape, especially with the introduction of AI, technology is advancing at a pace that can be overwhelming for many people. In Digital Data and Technology, our mission is to support a tech-enabled workforce where everyone can thrive. However, not everyone experiences technology the same way.  "
        },
        {
            "text": "According to the employment of disabled people 2025 Q2 reports, there are 5.5 million disabled people in work across the UK. However, the employment rate for disabled people is still much lower. It is at 52.8% compared to 82.5% for non‑disabled people. "
        },
        {
            "text": "There may be many disabled people in work, but the difference in employment rate suggests it may be more challenging for them to use their skills effectively in a work environment. By creating a more inclusive work environment, we could be helping and unlocking a variety of skills that could benefit the whole of the UK.  "
        },
        {
            "heading": 2,
            "text": "Understanding the everyday barriers and the tools that help remove them"
        },
        {
            "text": "After attending an internal learning session on accessibility, I had the opportunity to see how people use the accessibility tools on their computers. It was enlightening to witness the experiences and challenges they face when working on their day-to-day tasks. Something as simple as accessing a hyperlink, reading titles or reading text in a paragraph: if digital content is not designed inclusively, it can cause significant barriers for accessibility users. "
        },
        {
            "text": "I asked accessibility users, \"Do Microsoft products have a sufficient amount of accessibility tools available for use?\" The response was overwhelmingly positive, showing that the tools are at a satisfactory level and are continuously improving. But does everyone who could benefit from the tools know about them? My objective was to recognise the challenges and create an environment where all individuals can contribute their skills and talents without unnecessary barriers.  "
        },
        {
            "heading": 2,
            "text": "Driving accessibility awareness across DBT "
        },
        {
            "text": "I am the Digital Engagement Manager in the Corporate Systems Solutions (Microsoft) Team. A crucial part of my role is to make sure DBT can use the tools it has at its disposal efficiently. A large part of my work has been centred around Microsoft 365 support.  "
        },
        {
            "text": "I have found that accessibility has become an increasing driving force over the last few years. As demand has grown, there is still a long way to go to bring awareness to what we can all be doing in our work to make it accessible to everyone.  "
        },
        {
            "text": "Microsoft 365 is a huge part of DBT’s day-to-day work, and more great accessibility features are being released with the regular updates. Take the relatively new Sign language mode in Microsoft Teams meetings. This accessibility feature is designed to improve the meeting experience for deaf and hard of hearing participants who use British Sign Language (BSL) or other sign languages.  "
        },
        {
            "text": "This is just one of the many ways we can make Microsoft 365 work accessible. I want to promote these ways of working to as many people as possible.  "
        },
        {
            "heading": 2,
            "text": "A central hub to help everyone work more accessibly "
        },
        {
            "text": "Alongside Eilís McNicholl, our Digital Engagement Officer for the Corporate Systems Solutions (Microsoft) team, I helped create a Microsoft Learning Hub on our team’s SharePoint site. The Hub includes a section dedicated to accessibility. The inspiration for this came from my involvement in DBT Digital Data and Technology’s Digital Accessibility Working Group (DAWG), which provided invaluable insights and resources. "
        },
        {
            "text": "Microsoft support pages contain so much information that it can take time to find what you need. I decided to embark on a mission to pull all the information into a singular place, so colleagues didn’t have to. "
        },
        {
            "text": "Our Microsoft Learning Hub now offers helpful tools and guidance for both Windows and Mac users relating to using Microsoft 365 applications. Our goal is to ensure that everyone, regardless of their abilities or preferences, can access and benefit from inclusive digital content. "
        },
        {
            "text": "The SharePoint site provides a wide range of guidance designed to support individuals with various impairments or personal preference, making accessibility resources available to all. "
        },
        {
            "heading": 2,
            "text": "Uncovering simple changes that make a big difference "
        },
        {
            "text": "During my research, I discovered a wealth of simple, effective ways of working that I was guilty of overlooking. For example, if the space between the lines on a Microsoft Word document are too small, they can become jumbled to visually impaired people. There's also an on-screen keyboard if you have mobility issues, and you can change the text colour in OneNote to help maintain contrast standards across different pages. "
        },
        {
            "text": "Minor changes like these may take time to adopt, but they quickly become second nature and can make our Microsoft 365 content more inclusive for everyone. "
        },
        {
            "text": "As of writing this blog post, we have created guides for Windows and Mac accessibility for mobility, vision and hearing. We have also created Microsoft 365 guides for Microsoft Word, Outlook, OneNote and PowerPoint. We are currently working on 2 other guides for Microsoft Teams and Copilot 365, so watch this space.  "
        },
        {
            "heading": 2,
            "text": "Accessibility: Opening doors for everyone"
        },
        {
            "text": "The response to this work has been overwhelmingly positive, with outstanding feedback from various sources. I've frequently heard from individuals about how impactful it has been for them across multiple areas. This project ranks among one of our most popular SharePoint pages released so far.  "
        },
        {
            "text": "A colleague provided this feedback after reviewing the Microsoft Word guide: "
        },
        {
            "text": "‘The level of thought and detail that has gone into the page is fantastic - I was struggling to find any gaps in information about the tools available. This guide will significantly benefit the department and move us closer towards being accessible for all colleagues. I know that Dylan's intent was to produce guidance, but this would be an excellent knowledge base or foundation for a set of standards. ‘ "
        },
        {
            "text": "This is not just resource for those with a disability, but resource that can benefit everybody.  "
        },
        {
            "text": "Making accessibility part of everyday digital practice isn’t just about meeting a standard. It’s about making sure disabled people can take part fully in work and bring their talents to the UK economy. With millions of people using assistive tools every day, raising awareness of what already exists in Microsoft 365 can help remove barriers quickly and at scale. The more confident we all become in creating accessible content, the more inclusive and productive our workplaces will be. That’s good for colleagues across the department, and it’s good for the wider economy that depends on a skilled, diverse and fully enabled workforce. "
        },
        {
            "text": "If you use Microsoft 356 in your workplace, how are you supporting and engaging your colleagues to access its full suite of accessibility features? Let us know in the comments. "
        }
    ]
}