{
    "url": "https://space.blog.gov.uk/2026/02/25/reflections-from-the-space-communicators-network/",
    "title": "Reflections from the Space Communicators’ Network ",
    "authors": [
        "UK Space Agency"
    ],
    "categories": [
        "Championing Space"
    ],
    "pub_date": "2026-02-25T09:30:00+00:00",
    "content": [
        {
            "text": "Last year, the UK Space Agency’s External Affairs team organised and hosted the Space Communicators’ Network Workshop at the UK Space Conference in Manchester. Bringing together communications experts from across the space sector, we wanted to move the conversation about space communications from talking about the challenges to taking meaningful action. "
        },
        {
            "text": "The UK space sector is a remarkable engine of innovation and economic growth. Satellite services alone underpin activities worth £454 billion - an astonishing 18% of the UK’s GDP. Yet, despite this significance, misconceptions about space careers and the sector’s role in everyday life persist. Our workshop set out to address these communication gaps and find new ways to tell the story of space in the UK and beyond. "
        },
        {
            "text": "We structured the workshop around four central themes: "
        },
        {
            "text": "Each group brought together passionate voices and practical ideas, and the energy in the room was palpable. "
        },
        {
            "heading": 2,
            "text": "Inspiring the Next Generation"
        },
        {
            "text": "One of the most urgent topics was how to inspire young people - especially those from underrepresented backgrounds - to pursue STEM careers in space. We discussed the importance of close collaboration with the Department for Education to embed space careers into the curriculum. It's not enough to talk about astronauts and rocket launches; we must also showcase the full spectrum of opportunities, from graphic design to the development of applications and services that touch every aspect of modern life. "
        },
        {
            "text": "One of the ideas discussed was to draw inspiration from NASA’s Solar System Ambassadors programme to create a network of volunteers to inspire their local communities about space and science through outreach and events. By leveraging high-profile influencers and educators, we can reach young audiences in a relatable way. We also recognised the importance of “getting on the ground” to understand what truly excites young people, using research that leads to actionable outcomes. Industry placements and internship programmes were highlighted as powerful tools to make space careers both accessible and exciting. "
        },
        {
            "heading": 2,
            "text": "Communicating Space Science"
        },
        {
            "text": "Another key theme was the need to improve communication skills among the space industry. Technical and scientific brilliance is essential, but so is the ability to explain complex ideas to the public, policymakers, and funding bodies, to advocate for their work and defend their ideas persuasively. "
        },
        {
            "text": "Changing negative perceptions around the role of defence and national security in the space sector was also identified as an area to address. Protecting satellites is about safeguarding our economy and way of life, not just narrow military interests.  "
        },
        {
            "heading": 2,
            "text": "Making Space Applications Relatable"
        },
        {
            "text": "Space applications - commercial products and services that use satellites - are often taken for granted. We agreed that communications campaigns need to create an emotional connection with the public, using storytelling and relatable examples. Partnering with industries like agriculture, finance, and transport can help us highlight the real-world benefits of space technology.  "
        },
        {
            "heading": 2,
            "text": "Strengthening International Collaboration"
        },
        {
            "text": "Finally, we explored how the UK can enhance its reputation as a leader in space through international collaboration. Organising networking events alongside major conferences, supporting long-term partnerships, and showcasing our expertise in areas like Earth Observation and space situational awareness are all vital steps. We must also collaborate with non-space industries to foster bilateral technology transfers and ensure our messaging resonates globally. "
        },
        {
            "heading": 2,
            "text": "Looking Ahead"
        },
        {
            "text": "By working together - across education, industry, and government - we can ensure that the story of UK space is told with clarity, passion, and impact. The workshop was just the beginning; now it’s time to turn these ideas into action.  "
        },
        {
            "text": "We have already begun putting insights from this session into action, working more closely with science communicators and academia to shape our messaging. We have also increased our engagement with non-space sector organisations in the financial services, maritime and logistics sectors to reach those businesses that benefit most from space technology on Earth. "
        },
        {
            "text": "We are very excited to be hosting the next Space Communicators’ Network, at Space-Comm Europe, taking place in March 2026 at the Excel London. The session will focus on the UK’s image abroad, how the UK space sector can play a role in advancing the UK’s soft power by positioning Britain as a global leader, and why Soft Power should matter for the space sector. "
        }
    ]
}