{
    "url": "https://nationalscreening.blog.gov.uk/2026/02/25/uk-nsc-consults-on-screening-for-biliary-atresia-in-newborns/",
    "title": "UK NSC consults on screening for biliary atresia in newborns",
    "authors": [
        "Dr David Thompson"
    ],
    "categories": [
        "Newborn screening"
    ],
    "pub_date": "2026-02-25T15:19:02+00:00",
    "content": [
        {
            "text": "The UK National Screening Committee (UK NSC) has opened a consultation on evidence relating to screening for biliary atresia in newborns."
        },
        {
            "text": "Biliary atresia is one of the health conditions the committee reviews regularly for evidence relating to newborn screening."
        },
        {
            "text": "Evidence summaries are typically the second step in the UK NSC process of reviewing evidence. We are asking individuals and organisations to provide feedback on the findings and conclusions of a 2025 evidence summary on screening for biliary atresia in newborns."
        },
        {
            "text": "The 2025 evidence summary concludes that there is currently not enough evidence to recommend screening for biliary atresia in newborns."
        },
        {
            "heading": 2,
            "text": "How to respond"
        },
        {
            "text": "To take part in the consultation, download the consultation documents by clicking on the grey ‘View documents’ button on the UK NSC’s biliary atresia  condition recommendation page. Then submit your response by clicking on the green ‘Submit comments’ button."
        },
        {
            "text": "The deadline for responses is 11.59pm on 20 May."
        },
        {
            "heading": 2,
            "text": "About biliary atresia"
        },
        {
            "text": "Biliary atresia is a rare disease where the bile ducts become inflamed and blocked. Bile ducts are thin tubes that carry bile from the liver and gallbladder to the small intestine, where bile helps digest fats in food."
        },
        {
            "text": "Symptoms develop within a few weeks of birth. Without treatment, biliary atresia can cause death by the age of 2 years old. There are approximately 37 cases of biliary atresia in the UK each year. The only treatment for biliary atresia is a type of surgery called the Kasai procedure. This surgery is more likely to be successful if done before 60 days of age."
        },
        {
            "text": "The use of newborn dried blood spots and stool colour cards are 2 possible ways to screen for biliary atresia. There are national screening programmes using stool colour cards in Japan and Taiwan, where the condition is more common than in Western nations."
        },
        {
            "text": "The UK NSC does not currently recommend screening newborns for biliary atresia because:"
        },
        {
            "heading": 2,
            "text": "The 2025 evidence summary"
        },
        {
            "text": "The 2025 evidence summary considered new evidence published since 2012. It found:"
        },
        {
            "text": "During the public consultation we are asking individuals and organisations to provide feedback on this evidence and to flag any issues they think should be considered."
        },
        {
            "heading": 2,
            "text": "Keep up to date"
        },
        {
            "text": "The UK NSC blog provides up to date news from the UK NSC. You can register to receive updates direct to your inbox, so there is no need to keep checking for new articles. If you have any questions about this blog article, or about the work of the UK NSC, please email uknsc@dhsc.gov.uk."
        }
    ]
}