{
    "url": "https://teaching.blog.gov.uk/2022/01/17/embracing-technology-in-school-has-changed-how-we-teach/",
    "title": "Embracing technology in school has changed how we teach",
    "authors": [
        "Emma Darcy"
    ],
    "categories": [
        "COVID-19 support",
        "Professional Development",
        "Remote education",
        "Secondary schools"
    ],
    "pub_date": "2022-01-17T17:19:50+00:00",
    "content": [
        {
            "text": "Emma Darcy received the Pearson National Teaching Award for Digital Innovator of the Year in 2021. She works as a Director of Technology for Learning at Denbigh High School in Luton and across the Chiltern Learning Trust."
        },
        {
            "text": "It is easy with hindsight to say that the effective use of technology in schools should be a priority. I have been fortunate to work with a series of leaders who saw the importance of developing a robust technology for learning strategy and supporting all the schools in the Trust in this way. This meant that, when we went into the first lockdown in March 2020, our staff and pupils were in a good position to move to online learning."
        },
        {
            "text": "Supporting staff to upskill themselves"
        },
        {
            "text": "That is not to say it has been easy. Fully remote learning and then the move to a hybrid model has meant that all staff have had to evolve their pedagogy and practice. I have been hugely inspired by how some teachers who would previously have described themselves as “technophobes” have got to grips with working in an online environment."
        },
        {
            "text": "To support the staff who may lack confidence with technology, it has been essential to first demonstrate the benefits of incorporating the use of technology into their teaching practice but also to offer a variety of ways for them to upskill themselves including:"
        },
        {
            "text": "Using technology to enhance learning"
        },
        {
            "text": "There is no “one size fits all” solution as all schools are different, but it has been encouraging to see how diverse new ways of teaching have emerged during periods of remote learning and have then continued to be used once pupils were back in the classroom. For example:"
        },
        {
            "text": "On a more personal note, I was honoured to be a Gold Award winner at the recent Pearson National Teaching Awards. For the past two years, everyone working in a school, college or university has had to be a digital innovator whether they expected to be or not, so to be recognised in this way has been the absolute highlight of my career."
        },
        {
            "text": " "
        },
        {
            "text": "Get support from an EdTech Demonstrator school"
        },
        {
            "text": "Denbigh High School is part of the EdTech Demonstrator programme which provides EdTech support and expertise to schools and colleges for both in person and remote education. The programme offers short term operational assistance, through to longer term support on embedding technology and developing a digital strategy."
        },
        {
            "text": "Find out more about the EdTech Demonstrator Programme. "
        },
        {
            "text": "Celebrate a teacher or leader who has made a difference"
        },
        {
            "text": "Nominations are open for the National Teaching Awards until 4 March 2022. You can also send a free Thank a Teacher card to any member of staff who deserves a special mention."
        }
    ]
}