{
    "url": "https://educationhub.blog.gov.uk/2022/01/17/face-to-face-teaching-is-a-vital-part-of-getting-a-high-quality-student-experience-education-secretary-nadhim-zahawi-writes-to-students/",
    "title": "\"Face-to-face teaching is a vital part of getting a high-quality student experience\": Education Secretary Nadhim Zahawi writes to students",
    "authors": [
        "mediaofficer"
    ],
    "categories": [
        "Universities"
    ],
    "pub_date": "2022-01-17T11:26:16+00:00",
    "content": [
        {
            "text": "Education Secretary Nadhim Zahawi has written an open letter to students on face to face teaching in higher education settings. "
        },
        {
            "text": "Thanks to the incredible success of the vaccine roll out, the UK has one of the highest vaccine uptake rates in the world. I want to start by thanking you for your role in this: approximately 90% of students have had at least one dose."
        },
        {
            "text": "Students are playing a massive part in turning the tide from pandemic to endemic. You have been decisive in ensuring that universities and colleges remain open and Covid-secure, as well as protecting your friends on campus."
        },
        {
            "text": "Many of our universities and colleges have been working hard to ensure Covid-secure face-to-face teaching is offered and I know that, for many of you, this face-to-face teaching is a vital part of getting a high-quality student experience. As you know, whilst the country was implementing wide-spread restrictions, the majority of teaching had to be moved online. There are some great examples of effective and innovative online teaching, and universities and colleges have been delivering a high-quality blended approach since before the pandemic. Maintaining the option of online teaching for those who are vulnerable or isolating is to be encouraged. However, face-to-face teaching should remain the norm and the pandemic and must not be used as an opportunity for cost saving or for convenience. I know that students expect and deserve face-to-face teaching and support, and you have my full backing."
        },
        {
            "text": "That is why last week I set out my expectation that universities should deliver face-to-face education. I know that my colleague Michelle Donelan, the Minister for Higher and Further Education, has written to all Higher Education providers across the country to emphasise this. While virtual learning is a fantastic innovation, it should only ever be used to complement and enhance your learning experience, not detract from it. You should rightly expect high-quality teaching, including the face-to-face education you were promised, and universities and colleges must listen to students when making changes to the way courses are delivered. You should be in no doubt that you deserve a fair deal and should understand what options are available if you feel you have not received what you were promised by your HE provider. As I know many universities and colleges are doing, it is important that they continue to support you, both to ensure you are able to engage with teaching and learning, and to ensure you have access to welfare and mental health support."
        },
        {
            "text": "If you feel that you are not getting the face-to-face teaching you signed up for, or that you would expect, talk to your university or college. Do this as soon as you can, so that there is time for them to respond to your concerns. If you don’t know who to contact, you could ask your personal tutor or your student representative body for help. If you would like to raise concerns as a group to your university, your student union may be able to support this."
        },
        {
            "text": "If you are still not satisfied after your provider has considered your complaint, you can take your complaint to the Office of the Independent Adjudicator (OIA). If you would like to raise an issue as a group, another option is the OIA’s Large Group Complaints process. This is intended for complaints from a large group of students at a single provider where there is a high degree of commonality between the complaints and where they could be considered collectively – for example if a particular faculty was not putting on any, or insufficient, face-to-face teaching. Again, this is something your student union may be able to help co-ordinate. In 2020, the OIA made recommendations in over 280 cases to put things right for students who complained about a range of issues, including disruption caused by Covid-19. The recommendations included practical remedies as well as compensation totalling over £450,000, and an additional £282,000 was paid to students under settlement agreements reached by the OIA."
        },
        {
            "text": "In addition, the Office for Students (OfS) has a notification process which allows students, staff, or members of the public to let them know about issues at providers registered with the OfS that may be of regulatory interest, including issues relating to quality in higher education and that might affect particular courses or groups of students. While OfS do not have a direct role in dealing with individual complaints or disputes, they use this information as part of their regulatory monitoring activity to ensure Higher Education providers comply with the ongoing conditions of registration with the OfS. They are able to take action, including investigating and issuing monetary penalties, if they consider a university or college has breached its conditions of registration. More information can be found in their guide to the OfS notifications process."
        },
        {
            "text": "Please do take a test before you travel back to your term time accommodation if you have not returned already. You should then continue to test twice weekly at home with LFD test kits. It is also vital that you get boosted as soon as you become eligible unless you are medically exempt Many of you will be able to find pop-up vaccine centres on your university campuses, or close to wherever you are studying."
        },
        {
            "text": "Finally, I would like to wish you all the best for the spring term. I still look back on my days as a student at UCL with great fondness. This is a special time in your life, a great opportunity to broaden your horizons and make life-long friends."
        },
        {
            "text": "Enjoy it."
        }
    ]
}