{
    "url": "https://civilservice.blog.gov.uk/2022/01/17/how-i-turned-a-full-time-job-into-a-job-share/",
    "title": "How I turned a full-time job into a job-share",
    "authors": [
        "Ila Patermann Cornick"
    ],
    "categories": [
        "A great place to work",
        "A Modern Civil Service",
        "A Skilled Civil Service",
        "Better policymaking"
    ],
    "pub_date": "2022-01-17T09:44:58+00:00",
    "content": [
        {
            "heading": 3,
            "text": "Want a job share, but don’t know where to start? For those dreaming of  working part-time in a job share, the biggest challenge is often finding your professional ‘other half.’ Some simple steps in your recruitment campaign will increase your chance of success."
        },
        {
            "text": "You know people that look like they have it all - a good career, free time outside work, and a best buddy in the workplace? Well, I’m talking about job-sharers. Realising I could become one of them was the clincher that persuaded me to join the Civil Service from private industry. So, if you want to find a job share partner, but don’t know where to start, read on."
        },
        {
            "text": "I applied for my role when it was advertised as full time. Before applying, I asked in an informal conversation if it was open to flexible working - which it was - and stated my preference of working 60%, ideally in a job share. I was hired in a part-time role with a view to finding my professional ‘other half’. "
        },
        {
            "text": "For more on why job sharing is brilliant and how to convince your line manager, have a read here: Job sharing in the Civil Service - GOV.UK (www.gov.uk)"
        },
        {
            "text": "Once your line manager is happy to advertise the other part of the job share vacancy, here are my top tips on how to attract good candidates."
        },
        {
            "heading": 4,
            "text": "Advertising the vacancy "
        },
        {
            "text": "Initially, we advertised the other half of my role seeking a ‘part-time or job share’ to keep options open. However, we drew  few applicants and some dropped out, so we were unable to appoint. The second time round we put ‘job share’ in the title of the job advert and ran a successful campaign."
        },
        {
            "heading": 4,
            "text": "Get involved in recruitment"
        },
        {
            "text": "Offer informal chats to tell people about the role and yourself and how you envisage a job share working. People can then best decide if the role suits them, and if they can see themselves working successfully with you, before they apply. "
        },
        {
            "text": "Whilst the selection process runs like any other, you can add a section at the end of the interviews to outline expectations relating to the job share. For example, when and how handovers will work and any job share related questions they may have."
        },
        {
            "heading": 4,
            "text": "Show flexibility "
        },
        {
            "text": "Given that the work pattern is one of the key constraints for many applicants, it’s good to show where there is flexibility and what is a non-negotiable requirement. For example, we need cover for Thursday and Friday. Some candidates wanted to work Thursday/Friday/Monday instead of the typical Wednesday handover and others wanted two short days and two long days. Other job sharers split mornings-evenings and overlap at lunch time. Be clear about what is a set requirement and what is flexible. "
        },
        {
            "heading": 4,
            "text": "Marketing campaign"
        },
        {
            "text": "To increase visibility of the job share advert, we did a marketing campaign. On LinkedIn, I commented on the latest blog posts for all specialist part-time recruiters that I could find (e.g. 2to3days, mumreturners, workingmum, etc). Once you’re on one of their sites, LinkedIn shows you similar sites. All their blogs are read by job hunters seeking  part-time or flexible jobs, so they’re the exact target audience you want, and often connected to others with a similar mindset. "
        },
        {
            "heading": 4,
            "text": "Get involved"
        },
        {
            "text": "I wrote comments along the lines of “Interesting post. Great to see you’re talking about X to do with flexible working. Did you know the Civil Service is great for flexibility and job-sharing? For example, here is this job share vacancy link.” "
        },
        {
            "text": "I went on the Civil Service Job Share Finder and searched for similarly graded colleagues (level transfer and promotion) who listed Strategy as one of their interests or skills, since it was a strategy job. I then shared the vacancy, offered informal chats and asked people to share the link with others who may be interested."
        },
        {
            "text": "I shared the job on the Teams channels of my various work networks, e.g. parents network, job share network and gender equality network. The team and I all posted the vacancy on LinkedIn and other social media."
        },
        {
            "heading": 4,
            "text": "Great network"
        },
        {
            "text": "We attracted  many applications and drew up a shortlist of five strong candidates… and voila! I now have my brilliant job-share partner. Over the process, I’ve also gained a great network of other job sharers, with whom we continue to share best practice."
        },
        {
            "text": "Setting up a job share doesn’t happen by itself, but it’s being supported more and more and attracting a growing group of people. And, by the way, job sharers are not just stereotypical mums. "
        },
        {
            "text": "No matter the reason why you want to work flexibly in a job share, do have the courage to ask. Some people want to study, some are close to retirement, and others want to carve out time for a hobby. You don’t have to justify your reasons if you can prove the value to the team. "
        },
        {
            "text": "If you think job sharing is for you, make it happen. If I can do it, so can you!"
        }
    ]
}