{
    "url": "https://mojdigital.blog.gov.uk/2022/01/17/not-so-blue-monday/",
    "title": "Not so Blue Monday",
    "authors": [
        "Stuart Thompson"
    ],
    "categories": [
        "Brew Monday",
        "Mental Health",
        "Wellbeing"
    ],
    "pub_date": "2022-01-17T11:52:15+01:00",
    "content": [
        {
            "text": "Today is Monday 17th January 2022. Today marks almost one year to where I was in the worst state of depression I had been in some time. Today is not Blue Monday."
        },
        {
            "text": "Blue Monday is a marketing ploy.\n\nIn 2005, a travel agent claimed to have calculated the 3rd Monday in January as the most depressing day of the year. They claimed to use data and science to come to this conclusion but all they were really doing was encouraging you to book a holiday."
        },
        {
            "text": "Someone telling you that today is Blue Monday does not mean that today has to be a bad one. Own the day and make it what you want it to be. "
        },
        {
            "text": "Clinical and seasonal depression are real illnesses that affect huge amounts of people in the UK, so to be exploiting this does seem wrong."
        },
        {
            "text": "Last year at this time I was struggling with depression. I had come off my medication, I was struggling with another lockdown and was in a job that I had long since fallen out of love with. Luckily I have been very open with my mental health since my first major scare with depression and I reached out to my friends and my wife. There were numerous socially distanced cups of coffee, walks in the woods and park visits (and visits to my GP, don’t forget that part) that helped guide me out of it last year and cleared the fog. Sometimes being honest and saying it out loud is the first step."
        },
        {
            "text": "So with that in mind and remembering that there will be people who, like me last year, will be struggling with their mental health today, even if Blue Monday is just a marketing ploy, MoJ D&T are encouraging our colleagues to get involved in the Samaritans ‘Brew Monday’ campaign by reaching out to their friends and colleagues for a cup of tea and a chat. "
        },
        {
            "text": "If you are asked how you are feeling, give a real answer. "
        },
        {
            "text": "Be an ear to listen for anyone who needs it.*\n\nReclaim Blue Monday."
        },
        {
            "text": "Have a Brew Monday."
        },
        {
            "text": "*Remember though, if someone is honest with you and tells you that they are struggling with their mental health, professional help is the best help so please encourage them to reach out to a professional."
        }
    ]
}