{
    "url": "https://ruralpayments.blog.gov.uk/2022/01/17/the-rural-payment-agency-looks-back-on-2021/",
    "title": "The Rural Payment Agency looks back on 2021",
    "authors": [
        "Sandy Kapila"
    ],
    "categories": [
        "Agricultural Transition",
        "Basic Payment Scheme",
        "Countryside Stewardship",
        "Environmental Stewardship",
        "Farming Investment Fund",
        "Sustainable Farming Incentive"
    ],
    "pub_date": "2022-01-17T15:57:30+00:00",
    "content": [
        {
            "text": "While I’ve been working at the RPA for 10 years this month, I continue to be surprised and proud at the breadth of services we provide agricultural and rural communities. I think January is a really important time to reflect as our minds turn to the year ahead. Last year was really challenging for many but it is important to take time to recognise  what was achieved."
        },
        {
            "text": "We published our 5 Year Strategy in February which set out three objectives:"
        },
        {
            "text": "We continued to deliver the range of its services to rural businesses building on the progress made in 2020. In addition, the Agency worked closely with Defra to develop and implement schemes and services which saw the launch of the Sustainable Farming Incentive (SFI) pilot with over 2,500 expressions of interest and over 900 applicants."
        },
        {
            "text": "Applications were received from a broad range of farms types and sizes from across the country. The first of the SFI pilot agreements started in November 2021. We, working with Defra, are using the learning from the pilot to help develop the early rollout of SFI due later this year."
        },
        {
            "text": "In recognition of the importance of cashflow in 2021 we continued to issue payments to farming and rural businesses. RPA helped farmers, in delivering environmental outcomes, through the Basic Payment Scheme (BPS), Countryside Stewardship Scheme (CS) and Environmental Stewardship Scheme (ES). Just under 101,300 eligible 2021 claims received in the region of £1.8bn (92%) by the end of December (2020: 98,400; £89.5%). This represented 98.3% of BPS, 62.2% of CS revenue and 64.6% of ES eligible claims. In addition, just under 5,700 CS Capital claims received £66.75m within an average of 30 working days which helped the establishment and maintenance of woodland and hedges."
        },
        {
            "text": "We introduced a new approach for where a rural business was due more than one 2021 scheme payment (i.e. combinations of BPS/CS/ES). The Agency wanted farmers to get at least one payment in December and over 98% did."
        },
        {
            "text": "The Countryside Productivity Small Grants scheme providing investment towards specific items of equipment which improve productivity and efficiency for farming and horticultural businesses released £16m payments on just over 2,800 eligible claims. In December the RPA launched the initial Farming Investment Fund, including the Farming Equipment and Technology Fund and the Water Management theme of the Farming Transformation Fund. Farmers will benefit from a £27 million pot to invest in productivity-boosting equipment."
        },
        {
            "text": "In the early part of 2021, we opened up the window for 2022 CS agreements to allow farmers to apply for funding to improve their local environment from restoring wildlife habitats and creating woodlands to managing flood risk. Working closely with farmers and land managers, changes were made to the scheme this year to expand the options available and make it easier to apply for."
        },
        {
            "text": "Building on the earlier simplification measures, there was a 40% increase in applications compared to 2020. The Agency saw an improved interest for the new Capital Grants scheme for 2021 with over 3,000 applications received to improve air quality, water quality, boundary trees and orchards or a mixture of these options. While many agreement offers were issued before the end of 2021, the RPA were still working on applications with a view to issuing offers on the remainder early in 2022."
        },
        {
            "text": "The sixth round of the popular Countryside Stewardship Facilitation Fund opened in December 2021. The £2.5 million fund encourages collaboration and knowledge-sharing amongst the farming community to protect and enhance their local environment, in line with their local Countryside Stewardship priorities. The fund includes support for new environmental priorities such as the improvement of air quality through slurry removal, reduction of ammonia emissions, tree planting and shelters, and managing beaver activity that will offer support and advice for landowners when beavers move onto their land."
        },
        {
            "text": "The Government announced a package of measures to support the pig industry, seeking to reduce the animal welfare implications of pigs backing up on farms. This package included measures to increase the throughput of pigs through processors. We opened up both the Slaughter Incentive Payment Scheme (SIPS) aiming to increase the throughput of pigs by contributing towards the extra costs involved in operating additional slaughter shifts at abattoirs and a Private Storage Aid (PSA) scheme to contribute towards the costs of cold storage of the product."
        },
        {
            "text": "In 2021 for certain schemes under domestic legislation, we started a new approach to regulation and enforcement. Where breaches occurred, the Agency utilised a wider range of options, including early warnings and opportunities for farmers to put things right instead of moving straight to reductions. We continue to learn lessons from this approach."
        },
        {
            "text": "We know the importance of listening to farmers and land managers about the impact of their services on rural communities. The RPA attended shows and events across the country providing regular progress updates and heard first-hand about farmers' experiences which has helped improve future services. We also hosted several regional roundtables with English Members of Parliament and their constituents. Across 2022 we will continue to engage with farmers, land managers and representative organisations."
        },
        {
            "text": "Our people play an important role in our success. Across 2021 we continued to build the confidence, capability and diversity of our people. A refreshed focus on improved learning and development; enhancement of leadership and change capabilities; strengthening diversity and inclusion; evolving the internal ways of working; and improving the overall quality of the internal engagement. I was very proud that the RPA was named as best practice leaders, alongside other leading UK organisations, in values-based leadership by the Institute of Leading and Management (ILM) and City and Guilds."
        }
    ]
}