{
    "url": "https://apprenticeships.blog.gov.uk/2022/01/17/update-on-construction-route-review/",
    "title": "Update on construction route review",
    "authors": [
        "Jill Nicholls"
    ],
    "categories": [
        "Apprenticeship standards",
        "Technical education"
    ],
    "pub_date": "2022-01-17T10:48:42+00:00",
    "content": [
        {
            "text": "In 2021, the Institute reviewed the way it undertook route reviews. As a result, a new approach was suggested and this is currently being piloted in the construction route. We have been working closely with our route panel members and trailblazer chairs to agree how to approach the review and ensure a timely outcome to ensure that we can implement the findings quickly and help the sector meet its future skills needs."
        },
        {
            "text": "We have completed a public consultation on the occupational map and are currently collating the findings with a view to presenting them to our route panel and trailblazer chairs in February. This will be in parallel with the agreement of the principles and characteristics of the route which need to be reflected in our technical education products. Once agreed, we aim to publish the route review report in spring 2022."
        },
        {
            "text": "It is important to note that the route review will not contain recommendations for individual standards, however, we would expect the recommendations in it are considered by trailblazers in the revision or creation of their occupational standards to ensure graduating apprentices and learners are ready for the future needs of the sector."
        },
        {
            "text": "This new approach coincides with our restructure into route-specific teams which will ensure that employers are supported to bring the outcomes of the report to fruition in a timely manner."
        },
        {
            "text": "As part of the route review, we expect the work of our green apprenticeships advisory panel (GAAP) to be featured heavily. The GAAP, supported by a wider community of specialists, has undertaken a mapping exercise to advise where existing apprenticeships map to new green jobs or could be made greener and where new apprenticeships could be created to address new and emerging skills gaps in the green economy."
        },
        {
            "text": "The GAAP have identified that our current apprenticeship offer supports the green economy in one of three ways:"
        },
        {
            "text": "The findings of their work will be shared with trailblazer groups this month so that they can be incorporated into the revisions and new standard creation that will ensue following the route review."
        },
        {
            "text": "Once we have completed this initial burst of work against the National Green Jobs Taskforce Report we know we have more to do and so we will continue to support trailblazer groups to take forward new and significant green occupations and also work on a green strategy that encompasses all of our technical education products. Ultimately, our aim is that all Institute products from apprenticeships to T Levels and Higher Technical Qualifications will support the greening of the UK economy and this work is just the start of our journey together."
        },
        {
            "text": "Employers stand at the heart of the work we do, and we have worked closely with them throughout this review. We would like to thank all those who have taken the time to contribute and look forward to working with you over the coming months to achieve our shared ambitions for technical education in construction."
        }
    ]
}