{
    "url": "https://socialcare.blog.gov.uk/2022/01/17/youve-got-a-friend-in-social-care-talk/",
    "title": "You've got a friend in Social Care Talk",
    "authors": [
        "Kate Baxter"
    ],
    "categories": [
        "Care and support",
        "Carers",
        "Communities"
    ],
    "pub_date": "2022-01-17T16:55:52+00:00",
    "content": [
        {
            "heading": 2,
            "text": "The power of testimony"
        },
        {
            "text": "Friends, family and colleagues are all great sources of information. Sometimes, information comes from chance encounters, when you’re walking the dog or dropping off the kids. It doesn’t matter what the situation is, hearing about what other people did in that situation can help."
        },
        {
            "text": "It can help with finding out what the options are, the pros and cons of those options, how long it takes to arrange something, or who else to talk to. And, importantly, it can help to know that other people have been in your situation and that they found it tricky too!"
        },
        {
            "text": "But what happens if your friends and family have no experience of your situation? Or you don’t want to talk to colleagues. Or they have very limited experience? What then?"
        },
        {
            "text": "People find themselves in this situation when they need to pay for social care. I’m thinking particularly about older people who are self-funders, and their grown up children who often play an essential role in arranging care. They are faced with a triple whammy of figuring out what care the older person needs, how to arrange it and how to pay for it."
        },
        {
            "text": "Yes, local council adult social care departments are there to help. But people don’t always ask them for help. And it can be hard to digest the information offered, as we’ve discovered in previous research."
        },
        {
            "text": "So how can older self-funders and their families learn from the experiences of people outside their usual networks? By clicking on Social Care Talk."
        },
        {
            "heading": 2,
            "text": "Showing the way"
        },
        {
            "text": "This site aims to help people understand and navigate the social care system. All resources are based on rigorous academic research. We recorded 29 interviews with self-funders and family carers in a project funded by the National Institute for Health Research, called ‘Finding and funding social care’. We grouped video and audio clips from the interviews into major issues and placed them on the site."
        },
        {
            "text": "The result is a section called ‘Paying for social care (older people)’. It is aimed primarily at members of the public but will also help social care, finance and health professionals learn more about self-funders’ experiences and how they could help."
        },
        {
            "text": "‘Paying for social care’ includes an overview, summaries of 23 issues, profiles of people we interviewed and links to useful resources. Each summary features a written account of people’s experiences, illustrated with video, audio and text clips of selected people talking about those experiences."
        },
        {
            "text": "The summaries are presented under various headings, including ‘Getting the right care’, ‘Assessments and eligibility’ and ‘Family and friends’."
        },
        {
            "text": "How much self-funders will need to pay towards care is changing in 2023. Will this mean they will find the system easier to navigate? Will it mean people no longer benefit from listening to others’ stories? Definitely not. Take a look at Social Care Talk and find the help you need."
        }
    ]
}