{
    "url": "https://naturalengland.blog.gov.uk/2018/12/20/biodiversity-gain-matters/",
    "title": "Biodiversity net gain matters",
    "authors": [
        "Natural England"
    ],
    "categories": [
        "Biodiversity"
    ],
    "pub_date": "2018-12-20T16:28:12+00:00",
    "content": [
        {
            "heading": 2,
            "text": "Guest blog from Nicola Thomas, Partnership Manager at Buckinghamshire & Milton Keynes Natural Environment Partnership"
        },
        {
            "text": "Buckinghamshire and Milton Keynes faces an unprecedented scale of development.  The area lies right in the heart of the Government’s Oxford to Cambridge growth corridor, earmarked for one million new homes, and up to three million more people by 2050. That’s on top of around 80,000 new homes anticipated across Buckinghamshire and Milton Keynes in the next local plan period."
        },
        {
            "text": "With all that in mind, and against a backdrop of unparalleled biodiversity decline internationally, the Buckinghamshire and Milton Keynes Natural Environment Partnership (NEP), the area’s local nature partnership, is working to protect and enhance local biodiversity. It is putting in place a biodiversity accounting scheme to help measure biodiversity changes as a result of development to help ensure the area works consistently to demonstrate biodiversity net gain as a result of coming development."
        },
        {
            "text": "The first step for the group was to ensure net biodiversity gain was adopted as a phrase in local plans, which are currently being revised.  The group asked local authorities across Buckinghamshire and Milton Keynes for explicit commitments to include measurable net biodiversity gain in emerging local plans, along with adherence to the mitigation hierarchy and reference to a supplementary planning document (SPD), where details would be provided as to the workings of the scheme.  The NEP has liaised with all local authorities within the area on this, which has been a time-intensive process, but ensuring these policy commitments is an important hook for developing the scheme."
        },
        {
            "text": "The NEP was also keen to draw on good practice, learn from others who operate the scheme, and ensure compatibility with movements in national policy developments related to net biodiversity gain. This included considering the wording of the new national planning policy framework and the phrasing of the Government’s 25 Year Plan, which looks to make net environmental gain mandatory, with an immediate ambition to make the use of existing biodiversity net gain approaches mainstream. The NEP is also considering developments in terms of expected updates to the Defra metric."
        },
        {
            "text": "The NEP has also worked with another local authority with experience in developing net gain approaches. It commissioned David Lowe and his team from Warwickshire County Council to assist with making the case across the NEP’s area, working with development control planners in particular on resolving a number of issues. This included questions about the threshold for which to apply the Defra metric, what impact on the viability of developments a net gain requirement could have and how best to write a model SDP for the county."
        },
        {
            "text": "The NEP is working towards a Christmas deadline for its draft SPD to be reviewed by its partners with a draft metric available for review soon after.  Time is tight, there are many decisions to make, evidence is needed, and it’s not an easy road.  However, the need is great and the partnership is determined that Buckinghamshire and Milton Keynes will do things right for biodiversity in the face of unprecedented development pressures."
        },
        {
            "text": "Give your views on proposals to make biodiversity net gain necessary for developments when granting planning permission."
        }
    ]
}