{
    "url": "https://traderemedies.blog.gov.uk/2025/01/06/arac_finance/",
    "title": "Recruitment - independent member of ARAC (finance expert) ",
    "authors": [
        "TRA Communications"
    ],
    "categories": [
        "People",
        "Recruitment"
    ],
    "pub_date": "2025-01-06T10:34:36+00:00",
    "content": [
        {
            "text": "The Trade Remedies Authority  (TRA) is an arm’s length body of the Department for Business and Trade. Since 2021  we’ve had responsibility for guarding the UK against economic harm caused by unfair trading practices. We undertake investigations into imports to the UK which may be unfair due to dumping or subsidies, or part of an unforeseen import surge.  "
        },
        {
            "text": " Our expert team of investigators, lawyers, verification specialists and analysts make evidence-based recommendations to the Secretary of State for Business and Trade on appropriate measures to defend UK economic interests.  "
        },
        {
            "text": "We are recruiting an expert independent member to the  Trade Remedies Authority Audit and Risk Assurance Committee. Our Audit and Risk Assurance Committee (ARAC) provides advice to the Board on the assurance and the soundness of TRA’s financial, risk, control and governance processes. We are looking for someone with a strong and sustained track record in finance.  Private sector experience is particularly welcomed. "
        },
        {
            "text": "ARAC "
        },
        {
            "text": "The ARAC Chair is currently supported in their role by three independent members who bring specialist knowledge and further independent oversight (one a digital expert, one a trade lawyer and one a finance expert).  We will also be adding an additional non-executive Board member to the ARAC early next year.   We are now seeking to replace our finance expert member due to the ending of their term. "
        },
        {
            "text": "About you "
        },
        {
            "text": "You must be a qualified accountant and it is essential that you have recent and relevant financial experience sufficient to allow you to competently analyse financial statements, understand good financial management disciplines and complex financial transactions.  You’ll  also need to have good communication skills and be prepared to challenge ARAC colleagues and TRA  staff in a constructive, straightforward and open manner. "
        },
        {
            "text": "About the role "
        },
        {
            "text": "This role is offered for an initial period of two years. You will be an independent member of the TRA’s ARAC and not an employee of the TRA.  "
        },
        {
            "text": "Remuneration is £6,000 per year (plus all travel expenses in line with TRA policies).  The fee will be subject to standard tax and NI deductions.  "
        },
        {
            "text": "Your time commitment will be attendance at 4 in-person meetings (in Reading), one away day per year, meeting preparation time plus occasional catch up chats with TRA staff involved with finance & risk.   "
        },
        {
            "text": "How to apply "
        },
        {
            "text": "To apply for this post please send the following to:"
        },
        {
            "text": "resourcing.enquiries@traderemedies.gov.uk  no later than  11:55pm on Sunday  26 January 2025:  "
        },
        {
            "text": "Applications will be sifted to select those demonstrating the best fit with the post. Feedback will only be offered to those who attend an informal chat. Please note that references and open-source due diligence checks (including into social media accounts) may be undertaken for all short-listed candidates.  "
        },
        {
            "text": "Timelines                         6 January until 26 Jan   Ad live on LinkedIn  31 January  Sift complete  w/c 3 Feb   Informal chat with ARAC Chair and TRA Head of Governance  w/c 10 February Informal chat with either TRA Chair or TRA Chief Executive  17 February Appointment offered     "
        }
    ]
}