{
    "url": "https://icsdigital.blog.gov.uk/2025/01/06/otherwise-theyd-be-stationaries-a-few-thoughts-on-innovation/",
    "title": "Otherwise they’d be stationaries - a few thoughts on innovation",
    "authors": [
        "markmerifield"
    ],
    "categories": [
        "How we work"
    ],
    "pub_date": "2025-01-06T10:25:57+00:00",
    "content": [
        {
            "text": "Innovation is going to be a big thing for the Civil Service in 2025. We in ICS Digital will be playing our part. Before we go into the detail of what we will be doing, I thought it would be fun to look again at what innovation means with the help of three wise men."
        },
        {
            "text": "Innovation and the Civil Service go way back. Think of Sir Henry Cole, looking for a way to catch up on all his 1843 Christmas correspondence to family and friends. He asks a friend to design and print a card to send. An idea which became quite popular. Yes indeed, a civil servant invented the commercial Christmas card."
        },
        {
            "text": "So what is innovation? It can often be made to sound like a skill we need to learn. We are asked to go forth and innovate yet how many of us are never clear on what it is we are being asked to do. "
        },
        {
            "text": "Since there are as many definitions for innovation as there are people trying to come up with them, let’s turn to the first of our three wise men, US inventor Thomas Edison (1847-1931):"
        },
        {
            "text": "“There’s a better way to do it - find it”"
        },
        {
            "text": "I like Edison’s words because there is a real, active mission there: to make things better whether it’s a process, or a service, or a way of working of any kind. I can get behind that. And it’s universal, it’s something we can all do, that we do all do, but perhaps more often than not, we leave the ideas unspoken."
        },
        {
            "text": "So how, and when to start? Over to Marcus Aurelius (121-180), one of the greatest of Roman Emperors, diarist, and Stoic philosopher:"
        },
        {
            "text": "“Waste no more time arguing about what a good person should be. Be one.”"
        },
        {
            "text": "How often have you held back from a making a comment in a meeting only to find out afterwards everyone was thinking and doing the same thing. Procrastination is the enemy of innovation, start now."
        },
        {
            "text": "Let us make a quick jump back from the Stoics to the Taoists. It was Lao Tzu, not Confucius, that wrote:"
        },
        {
            "text": "“A journey of a thousand miles begins with a single step.”"
        },
        {
            "text": "Of course, all journeys begin with a single step. Otherwise they’d be stationaries. You don’t need to be ripping up the rule books or changing the legislation on day one. You’re not leaping into the void, you just need to tie your shoelaces."
        },
        {
            "text": "So how to proceed? A phrase I remember hearing often in early introductions to innovation is: ‘fail fast, fail often’. I never liked it. It had a sense of being used solely as a safety-net for a risk averse culture. It was that use of the word 'fail'. But it’s also only partially quoted. The full quote is: ’fail early, fail often, but always fail forward’ which gives a better sense that it is the progress that is important. But it’s still that pesky 'fail'. "
        },
        {
            "text": "Let us return to Edison for another quote that never seems to be completely agreed on, but the gist remains the same:"
        },
        {
            "text": "“I did not fail, it took 1000 goes to get it right.”"
        },
        {
            "text": "With those words, I see a better reflection of a digital and data culture, of a Modern Civil Service: experimenting, iterating, prototyping, gathering data, responding to change. Learning, using evidence, responding to change. That feels like a more positive way forward."
        },
        {
            "text": "So go forth and innovate. Or rather, find a way to improve something you do at work, start now, experiment, learn, enjoy the journey, have fun. Happy New Year."
        }
    ]
}