{
    "url": "https://publicpolicydesign.blog.gov.uk/2021/07/01/11-things-policymakers-need-to-improve-outcomes-for-citizens/",
    "title": "11 things policymakers need to improve outcomes for citizens",
    "authors": [
        "Andrew Knight"
    ],
    "categories": [
        "Research"
    ],
    "pub_date": "2021-07-01T12:00:32+01:00",
    "content": [
        {
            "text": "In 2020, the UK government’s policymaking and innovative policy design communities worked together to understand how policymakers might be supported to deliver more meaningful outcomes for citizens."
        },
        {
            "text": "This groundbreaking collaboration brought together a multidisciplinary team of 24 people from 11 government departments, plus universities and a think tank. They looked at a broad range of evidence that combined hundreds of pieces of existing research with brand new ethnographic research about the day-to-day experience of policymakers across government."
        },
        {
            "text": "It confirmed what we already know, that policymakers are talented and caring people who are driven by a sense of public duty and they go to work every day because they want to make a positive difference to people’s lives. But it also revealed that they don’t always have what they need to make those outcomes as meaningful to citizens as possible."
        },
        {
            "text": "By giving policymakers the right tools to navigate complexity and reduce uncertainty we can be more sure that the policies and services that they make on our behalf will have the effect that is intended and that they provide the public with the highest possible value."
        },
        {
            "heading": 2,
            "text": "Commission work differently"
        },
        {
            "text": "The challenges that policymakers are currently facing are bigger and more complex than ever before, like responding to coronavirus, leaving the European Union, and meeting the net-zero target for carbon emissions. Frequently citizens’ individual experience of these global events cuts across several government policy areas. For the government to provide citizens with joined-up services, policymakers need to understand these complex systems and to collaborate across organisational boundaries."
        },
        {
            "text": "Policymakers told us they would be able to deliver better outcomes if they were commissioned to do their work in a way that explicitly focused on outcomes for citizens, instead of being asked to deliver part of a bureaucratic process. It is also very important for policymakers to think about all the different types of citizen who will use their policy or service so that they can ensure that no group is treated unfairly."
        },
        {
            "heading": 2,
            "text": "Enable evidence-led policymaking"
        },
        {
            "text": "UK policymakers are clear about how important it is to make policies and services based on good evidence. They regularly work with experts like analysts, economists and statisticians, but they rarely use citizen-centred, ethnographic research about the reality of people’s daily lives. This means that there isn’t always a clear view on the exact nature of what services citizens need or how they will respond to any intervention. Civil Service should make it much simpler for policymakers to find existing evidence about different types of citizens. "
        },
        {
            "text": "Policymakers also need to be able to easily create new evidence where there are gaps in knowledge. One of the most effective ways to do this is by working directly with the public to design, test and iterate policies and services at an early stage before the government commits to building or implementing them. There are some fantastic pockets of government that excel in this type of research like labs and What Works centres, but many policymakers have low confidence in working with the public."
        },
        {
            "heading": 2,
            "text": "Work in diverse multidisciplinary teams"
        },
        {
            "text": "There has been lots of progress on diversifying the workforce in Civil Service but there is still more to do. Policymaking teams do not reflect the characteristics of the communities they serve. This limits their understanding of people that use the policies and services they make, and might have an adverse effect on how meaningful citizens find them."
        },
        {
            "text": "Policymakers say that their time is often consumed by ‘fire-fighting’. This is tactical, reactive work to get something completed on time. They say they need more space to think strategically and to develop deep expertise in topics of national importance."
        },
        {
            "text": "Finally, they say it’s just difficult to collaborate when in government. Policymakers want to work in multidisciplinary teams with subject matter experts and technical experts but bureaucratic barriers like HR or procurement processes are just too slow for the pace of political work, so they just have to do without these helpful people."
        },
        {
            "heading": 2,
            "text": "The policymaking community is extraordinary"
        },
        {
            "text": "2020 has highlighted how reliant on policymakers we are to keep us safe and well in our lives. This research reveals an untold story of how that unique and valued national institution works day-to-day. If we want policymakers to keep getting better at what they do - and in turn deliver even more meaningful outcomes for citizens - then we must invest in providing them with the tools and infrastructure to get on with their work."
        },
        {
            "heading": 2,
            "text": "11 ways to support policymakers:"
        },
        {
            "text": "You can explore our research in more detail by reading our report."
        }
    ]
}