{
    "url": "https://socialcare.blog.gov.uk/2021/07/01/care-home-open-week-a-chance-to-share-happiness/",
    "title": "Care Home Open Week: a chance to share happiness",
    "authors": [
        "Sue Ann Nnamani"
    ],
    "categories": [
        "Care and support",
        "coronavirus",
        "Events"
    ],
    "pub_date": "2021-07-01T10:40:22+00:00",
    "content": [
        {
            "heading": 2,
            "text": "Maintaining normality and having fun"
        },
        {
            "text": "COVID-19 has led to many changes in the way residential care is provided to people and the way care colleagues work together. One thing that hasn’t changed is the sense of family and community within Priscilla Wakefield House, our teaching care home in Haringey, north London."
        },
        {
            "text": "Despite the outside world being turned up-side-down, we have succeeded in keeping a sense of normality, and making sure we continue to encourage laughter and fun among residents and staff."
        },
        {
            "text": "We have always participated in care home open days. Now these days have become a whole week,  it’s even more exciting, as we can run more events for our residents, staff and the wider community to showcase the hard work, determination and resilience of our team."
        },
        {
            "text": "With the gradual relaxation of visiting restrictions, in and out of care homes, we can open our doors again to welcome in schools, churches and the wider community (whilst following all the necessary testing and infection prevention controls) which bring the home to life."
        },
        {
            "heading": 2,
            "text": "Best part of the job"
        },
        {
            "text": "As a manager, it gives me so much joy to see the smiles on residents’ faces when they see their family and friends on outdoor trips to the seaside, trips to local parks and other recreational activities."
        },
        {
            "text": "For Care Home Open Week, we are pleased to be hosting a PRIDE event full of activities to help our residents feel free and open about their sexuality and orientation."
        },
        {
            "text": "We also have a Caribbean themed event packed with steel pan music. I will be reciting a poem featured in a book called “Poems in a pandemic” featuring compositions from health and social care colleagues."
        },
        {
            "text": "What a difference a year makes. Thanks to the success of the vaccination programme and our staff’s incredible commitment to the wellbeing of our residents, we are all feeling much more optimistic about the future – and looking forward to next year’s Care Home Open Week."
        }
    ]
}