{
    "url": "https://dfedigital.blog.gov.uk/2021/07/01/director-technology/",
    "title": "We're hiring a Director of Technology",
    "authors": [
        "Emma Stace, Chief digital technology officer"
    ],
    "categories": [
        "recruitment",
        "software and services",
        "technology"
    ],
    "pub_date": "2021-07-01T10:47:21+01:00",
    "content": [
        {
            "text": "This role is no longer being advertised."
        },
        {
            "text": "As the Digital and Technology team at DfE, we’re here to better serve the needs of the department and our users. To achieve this, we need the right people with the right skills, and tools in the right place."
        },
        {
            "heading": 2,
            "text": "This is a role centred on technology"
        },
        {
            "text": "We are now recruiting a Director of Technology to be part of our team – a new role centred on technology, using it to deliver, operate and transform."
        },
        {
            "text": "When we say technology, we mean:"
        },
        {
            "text": "We need to make our technology more effective in education and care. To get this right we have to change a lot of our processes, practices and culture. This means we’re looking for someone who wants to transform organisations."
        },
        {
            "text": "We need to properly address some of our most systemic issues. In DfE, we have legacy technology like many other organisations. We know we have more to do than simply modernise our old technology, and raise standards for our new technology. It’s not that straight forward."
        },
        {
            "text": "This role is for someone who can work really well with financial, commercial and business colleagues to solve the root causes of problems such as short-term funding and lack of technology ownership."
        },
        {
            "text": "This role is about operating our technology – keeping more than 400 services running for users."
        },
        {
            "text": "In the short term this means getting better at managing our response to major incidents. In the longer term, it’s about being clear on how we manage risks around ageing technology or temporary solutions that have become permanent."
        },
        {
            "heading": 2,
            "text": "Influencing skills are essential"
        },
        {
            "text": "This director role needs someone who can show leadership skills particularly when:"
        },
        {
            "text": "There will also be opportunities for the post holder to develop these skills."
        },
        {
            "heading": 2,
            "text": "Who should apply?"
        },
        {
            "text": "We know the paths people take to technology leadership can vary. This makes us open to candidates with very different experiences. We’re open to applications from:"
        },
        {
            "text": "We welcome and encourage people of all backgrounds – all genders, people of all ages, sexual orientations, nationalities, religions, and beliefs – to apply."
        },
        {
            "heading": 2,
            "text": "If you’d like to apply, what’s in it for you?"
        },
        {
            "text": "DfE is a brilliant place to work. We love our mission and our diverse team. This is an opportunity to collaborate and grow."
        },
        {
            "text": "We have a good balance of working remotely, and in person – we offer the flexibility people need."
        },
        {
            "text": "And this is the Civil Service, the person who takes up this role will not only be part of DfE, they’ll also be joining a strong and passionate community that extends across the UK government."
        },
        {
            "text": "As a civil servant we’ll encourage you to learn, develop and progress your career."
        },
        {
            "text": "This director will be in an influential position within the wider global education and public sectors."
        },
        {
            "text": "Here's the job advert with more information, and details on how to apply."
        },
        {
            "text": "Come and join the team!"
        }
    ]
}