{
    "url": "https://communityinterestcompanies.blog.gov.uk/2021/07/01/fitzrovia-noir-cic-broadening-access-to-the-arts/",
    "title": "Fitzrovia Noir CIC - broadening access to the arts",
    "authors": [
        "Garry Hunter"
    ],
    "categories": [
        "Community Interest Companies in action"
    ],
    "pub_date": "2021-07-01T11:55:50+01:00",
    "content": [
        {
            "heading": 2,
            "text": "How and why Fitzrovia Noir became A CIC"
        },
        {
            "text": "Five artists were concerned with the disappearance of local characteristics in a hidden corner of The City of Westminster. The redevelopment of the area resulted in the disappearance of these unique characteristics."
        },
        {
            "text": "Our first Outreach was to invite former staff and patients back into the neighbourhood’s 250 year old Middlesex Hospital as it was being demolished. We created portraits in the rubble of wards, corridors and theatres, collecting oral histories and rescuing ephemera."
        },
        {
            "text": "We built up a reputation with public galleries and educational institutions and it became necessary to find a vehicle suitable for both trading and grant-funded research. The Community Interest Company model seemed best to fit our needs."
        },
        {
            "heading": 2,
            "text": "Key Projects In East London and the North East"
        },
        {
            "text": "Incorporation as a CIC coincided with us no longer being able to operate in central London due to rocketing rents. We relocated to Trinity Buoy Wharf where the River Lea meets The Thames. This proved to be a key move as we were then offered support from the Trust to establish an international residency programme. We invited artists originating from France, Denmark, Iraq, Korea, Morocco and Venezuela to create site- responsive work based around community engagement"
        },
        {
            "text": "From 2014-16 we led on the £2m Creative People and Places initiative Cultural Spring. We embedded our immersive idea of residents responding creatively to the names of the streets they live on. The initiative featured in a live BBC broadcast and the peer-reviewed Journal of Arts and Communities."
        },
        {
            "text": "As two of our directors grew up in the northeast, we understood how best to involve local residents in participatory creative learning. We went to produce another six Outreach programmes with support from the University of Sunderland and foundations such as Esmée Fairbairn and Paul Hamlyn. Our 'Lifelines' project was chosen by The New Economics Foundation as the central installation for their Art of Recovery conference at The Hepworth."
        },
        {
            "text": "We were invited to set up a community pub by Poplar HARCA housing association. We commissioned a mural of Tommy Flowers and a memorial window with details of Colossus - the first modern computer, which locally-born Tommy built for Bletchley Park."
        },
        {
            "text": "The pub quickly proved a much-needed social space and is celebrated as a ‘pioneering model for creative engagement’ by the Plunkett Foundation at The House of Lords."
        },
        {
            "heading": 2,
            "text": "How we coped during the COVID emergency"
        },
        {
            "text": "Community Fund, Arts Council and Heritage Fund grants allowed us to develop our core values of:"
        },
        {
            "text": "We continue our engagement with learning difficulties groups."
        },
        {
            "text": "Our new logo abstracts elements of identities in the areas in which we work, embracing:"
        },
        {
            "text": "We’ve handed the pub over to residents to run and are establishing a creative space next door in a long, empty post office. Our CIC status demonstrates our commitment to social justice, which reassures new funders. It also allows us to mentor emerging CIC’s such as Picture Utopia and also Wild Women Collective, a support group set up during lockdown."
        },
        {
            "heading": 2,
            "text": "Our vision for the future"
        },
        {
            "text": "As we enter our second decade as a CIC, we're working towards opening up fully this summer of 2021. We hope to be offering more outdoor activities and over the next year, expanding our reach to a national level."
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": "To keep in touch, sign up to email updates from this blog, or follow us on Twitter."
        }
    ]
}