{
    "url": "https://civilservicelocal.blog.gov.uk/2021/07/01/join-our-next-junior-leaders-networking-event-the-power-of-mentoring/",
    "title": "Join our next Junior Leaders Networking Event - The Power of Mentoring",
    "authors": [
        "Funke Oham"
    ],
    "categories": [
        "A National Spotlight",
        "East, South East & London"
    ],
    "pub_date": "2021-07-01T06:44:29+00:00",
    "content": [
        {
            "text": "The next Junior Leaders Networking Event (JLNE) is a Lunch and Learn session taking place on Tuesday 20 July 2021.  "
        },
        {
            "heading": 4,
            "text": "Why join us"
        },
        {
            "text": "It’s an opportunity for you to hear 3 Senior Leader Mentors and 3 former JLNE mentees share their mentoring insights, how you can get the most from mentoring, the benefits, challenges and your personal and professional development post-mentoring. There is also time for Q&A."
        },
        {
            "heading": 4,
            "text": "Who are JLNE?"
        },
        {
            "text": "JLNE is aimed at colleagues in the AO to EO grades from across government departments. It operates across the East, South East and London and provides junior leaders with the opportunity to network with peers in other departments, learn from Senior leaders and access tools to enhance both their personal and professional development."
        },
        {
            "text": "Last year, JLNE went virtual due to the pandemic and widened its reach beyond the East, London and South East region. Colleagues across 14 departments and 28 agencies/public bodies took advantage of the JLNE personal and professional development offer. A total of 3,058 registrations across 11 bite size sessions covering personal branding, leadership, well-being, resilience, bullying, harassment and discrimination, confidence building, success profiles and interview preparation."
        },
        {
            "text": "Following feedback from our April event, we are running our third virtual event - a Mentoring Lunch and Learn session. "
        },
        {
            "text": "Our 3 diverse Mentor Senior Leader Speakers are"
        },
        {
            "text": "Our 3 Mentee speakers are "
        },
        {
            "text": "This online event is your opportunity to listen, learn and get answers to your mentoring dilemmas! "
        },
        {
            "heading": 4,
            "text": "Before you sign up for the Lunch and Learn Mentoring session"
        },
        {
            "text": "Ensure you can attend."
        },
        {
            "text": "Please discuss attendance at this event with your line manager."
        },
        {
            "heading": 4,
            "text": "Next steps when booking"
        },
        {
            "text": "Register using your civil service email address only."
        },
        {
            "text": "Registration is required for join the session, please use the relevant link above."
        },
        {
            "text": "Joining instructions will be emailed to registered participants, at least 24 hours before the event. The event will be hosted on MS Teams."
        },
        {
            "text": "If having booked a ticket you are no longer able to attend, please ensure you cancel your ticket promptly, so another colleague has the opportunity to join the session."
        },
        {
            "heading": 4,
            "text": "Online access requirements"
        },
        {
            "text": "Please note that you must be able to access Microsoft Teams via the app or browser to join this online event. Please use your work email address to register on Eventbrite. If you are unable to access Microsoft Teams on your work device, you may wish to join using a personal device. "
        },
        {
            "heading": 4,
            "text": "Upcoming Offer"
        },
        {
            "text": "For the very first time, kicking off this autumn, we will launch the JLNE Group Mentoring scheme - look out for more details on this blog in the coming months."
        },
        {
            "heading": 4,
            "text": "Why join us - JLNE success stories"
        },
        {
            "text": "Here are some positive impacts from a couple of delegates who attended the last JLNE event:"
        },
        {
            "text": "Find out more about our past offerings at JLNE past events"
        }
    ]
}