{
    "url": "https://dwpdigital.blog.gov.uk/2021/07/01/moving-forward-as-one-creating-a-unified-digital-function/",
    "title": "Moving forward as one: creating a unified digital function",
    "authors": [
        "Simon McKinnon, Chief Digital and Information Officer"
    ],
    "categories": [
        "BPDTS Ltd",
        "DWP Digital"
    ],
    "pub_date": "2021-07-01T09:00:04+01:00",
    "content": [
        {
            "text": "Back in September, I wrote about how our digital services provider BPDTS would join with DWP Digital to create a single, unified digital organisation. A review into BPDTS recommended bringing the two organisations together, and since then we’ve been working hard behind the scenes to make that happen. I’m delighted to confirm that from today we will move forward as one."
        },
        {
            "text": "As we move forward, I wanted to share some thoughts on why we’ve created a new organisation, and what it will mean for everyone involved. I hope that by bringing BPDTS and DWP Digital together, we can continue to improve those services using our shared skills and experience, in order to deliver on our ambitions for the future."
        },
        {
            "heading": 2,
            "text": "Why we’re doing this now"
        },
        {
            "text": "The experiences of the last year or so have underlined the critical role that our department plays, and our work will be at the heart of the UK’s economic recovery from COVID-19. Everyone across DWP is working tirelessly to get people into work and to improve their quality of life. Beyond that, we are also committed to the modernisation and digitisation of our services, and putting the user’s needs at the heart of everything. That work is powered by the new unified DWP Digital, who are building joined-up, digital-first services shaped around people’s life events."
        },
        {
            "text": "I wrote recently about our ambitions for the future, which are focused in four areas – delivering great services, building new user-centred solutions, using new technologies and data to innovate, and building our capacity and capability. Digital, data and technology are the essential drivers for those ambitions, and that’s why we feel that now is the ideal time for us to create the biggest and best digital organisation in government."
        },
        {
            "text": "We want to take the opportunity to harness the talents, skills, expertise and experience of our colleagues across both organisations in order to build something even better. It’s a change that empowers DWP to become the most influential digital function in government."
        },
        {
            "heading": 2,
            "text": "How we’ve arrived at this point"
        },
        {
            "text": "As I mentioned earlier, we formally came together today, and will move forward from this point as a single, integrated organisation. To get to this point has taken a lot of work across both teams. We’ve created five working groups that focused on the key areas that arose from listening sessions and discovery groups. These groups looked at our shared vision, smarter working, recruitment processes, people development practices and inclusion."
        },
        {
            "text": "The groups, which were made up of people from both DWP Digital and BPDTS, listened to the ideas, experiences and challenges suggested by colleagues at all levels. It gave us an opportunity to reflect and listen to people, to consider what might change, and what people value about their work. From there, we were able to agree on a set of principles for the ambitious, collaborative, people-focused organisation we want to be:"
        },
        {
            "text": "• Empowering teams and individuals, within the ‘guide rails’ of a consistent approach to design, architecture and data\n• Making the most of communities of practice to build capability at individual and organisational level, and support personal career development\n• Valuing expertise, creativity and what we’re working on to deliver together, rather than hierarchy or the organisations we’ve come from\n• Ensuring that colleagues feel rewarded and valued for what they deliver, and cherish work-life balance\n• Recognising and reaping the benefits of diversity of backgrounds and ideas"
        },
        {
            "text": "The role of those working groups doesn’t stop here. They will continue to work as we move forward to address any concerns that develop, and to ensure these values are implemented. Like any union, I’m sure there will be things along the road that come up unexpectedly, but I feel that we’re in a great position to deal with them."
        },
        {
            "text": "Bringing these two organisations together gives us a fantastic opportunity to build a vibrant, inclusive, successful digital organisation, with a clear sense of purpose. From an external point of view, I’m sure it will only make DWP Digital a more attractive place to work, and a stronger partner in any collaboration across government."
        },
        {
            "text": "I look forward to grasping this opportunity with both hands, and delivering on the ambitions we’ve set out for the new department."
        }
    ]
}