{
    "url": "https://phescreening.blog.gov.uk/2021/07/01/nipt-rolls-out-to-all-areas-of-england-as-part-of-the-existing-nhs-screening-pathway-for-downs-syndrome-edwards-syndrome-and-pataus-syndrome/",
    "title": "NIPT rolls out to all areas of England as part of the existing NHS screening pathway for Down’s syndrome, Edwards’ syndrome and Patau’s syndrome",
    "authors": [
        "Nadia Permalloo"
    ],
    "categories": [
        "NHS Fetal Anomaly Screening Programme"
    ],
    "pub_date": "2021-07-01T13:26:50+01:00",
    "content": [
        {
            "text": "Many of you will have seen our blog article on 1 June 2021 saying that NIPT can now be offered in most areas of England to women who receive a higher chance result from the NHS pathway for combined or quadruple screening for Down’s syndrome, Edwards’ syndrome and Patau’s syndrome.  A higher chance result is between 1 in 2 and 1 in 150. A lower chance result is a chance of 1 in 151 or above."
        },
        {
            "text": "We are pleased to confirm that non-invasive prenatal testing (NIPT) for Down’s syndrome, Edwards’ syndrome and Patau’s syndrome as an additional step in the existing FASP pathway has now begun for the remaining maternity providers in England."
        },
        {
            "text": "All women in these areas who have a combined or quadruple screening test taken on or after 1 July 2021 and receive a higher chance result now have a choice of:"
        },
        {
            "heading": 2,
            "text": "Resources"
        },
        {
            "text": "As you will be aware, we recently published new operational guidance on NIPT which includes:"
        },
        {
            "text": "Services will also now be familiar with the updated Down’s syndrome, Edwards’ syndrome and Patau’s syndrome screening pathway, which incorporates the offer of NIPT into the existing pathway."
        },
        {
            "heading": 2,
            "text": "PHE Screening blog"
        },
        {
            "text": "The PHE Screening blog provides up to date news from all NHS screening programmes. You can register to receive updates direct to your inbox, so there’s no need to keep checking for new blogs. If you have any questions about this blog article, or about population screening in England, please contact the PHE screening helpdesk."
        }
    ]
}