{
    "url": "https://planninginspectorate.blog.gov.uk/2021/07/01/the-path-to-better-customer-service-starts-with-listening-understanding-and-acting-on-feedback/",
    "title": "The path to better customer service starts with listening, understanding and acting on feedback",
    "authors": [
        "dancawdron"
    ],
    "categories": [
        "Appeals",
        "Performance",
        "Service improvement"
    ],
    "pub_date": "2021-07-01T13:22:08+01:00",
    "content": [
        {
            "text": "Dan Cawdron, Customer Insights Lead, presents the results of the recent Institute of Customer Service business benchmarking, and looks at what the results mean for the organisation, the action we are going to take and what’s next."
        },
        {
            "heading": 2,
            "text": "A Customer Focused Organisation"
        },
        {
            "text": "I am responsible for setting the Customer Strategy for the organisation, creating opportunities for our customers to provide feedback, understanding our customer needs and expectations, and ensuring we listen to feedback and take action. This work underpins the Planning Inspectorate’s aspiration to become a more customer focused organisation, which is one of our strategic priorities and values."
        },
        {
            "heading": 2,
            "text": "The Institute of Customer Service – Business Benchmark"
        },
        {
            "text": "In 2020 we joined the Institute of Customer Service (ICS) to give us access to research, training, network opportunities with other members and business benchmarking.  The Institute of Customer Service are the UK’s independent professional customer service body, they exist to improve business performance by improving customer experience."
        },
        {
            "text": "As an organisation, we decided to take advantage of the Business Benchmarking offered by the ICS as an opportunity to gather independent feedback from our customers, as well as understanding how we stack up against some other public services. The survey is a standard question set created by the ICS based on their experience and is not tailored specifically to our industry and the work we do."
        },
        {
            "text": "The ICS contacted just under 3,000 appellants and agents, focused mainly on our appeals service and some of our specialist casework, offering them the chance to give feedback. They received just over 300 responses and the ICS were able to provide a report detailing the results."
        },
        {
            "text": "We focused on our appeals service as that is where the greatest volume of our work lies, but I recognise that we need to find ways to gather feedback from customers across all the services we provide, which is something we are currently working on."
        },
        {
            "heading": 2,
            "text": "How did we do?"
        },
        {
            "text": "You can find a full set of results here with some explanations around the approach the ICS take to measuring and calculating their index."
        },
        {
            "text": "The results are not where we would have liked them to be, but we asked the ICS to conduct the benchmarking to get real insight into our organisation. Having discussed the results internally, we want to focus on action and making an impact on how satisfied our customers are and how they feel about the Planning Inspectorate as an organisation."
        },
        {
            "text": "Some of the key results were:"
        },
        {
            "text": "Customers were generally satisfied with how helpful (6.6 out of 10) and competent (6.4 out of 10) our staff are. I think this goes to show how professional and dedicated our staff are and continue to be, even in the face of a very difficult year during the COVID-19 pandemic. It’s great that our customers recognise that, but there is still more we can do as an organisation to give our staff the skills to meet their expectations as best we can."
        },
        {
            "heading": 2,
            "text": "Further analysis and key themes"
        },
        {
            "text": "As part of the survey questions, customers were asked to provide us with comments on how we can improve as an organisation and any further comments they may have. We have analysed these comments and identified 5 key themes."
        },
        {
            "heading": 2,
            "text": "What’s next?"
        },
        {
            "text": "There are already projects and work going on across the organisation that go some way to addressing the feedback we have been given by our customers."
        },
        {
            "text": "Our Operations Director, Graham Stallwood recently wrote a blog about how we have had to adapt and become more agile in our approach during the pandemic, and how we might operate in the future."
        },
        {
            "text": "We are building new appeals, application, and examination digital services, ensuring that the services we are developing are:"
        },
        {
            "text": "Parts of our Operations Team are trialling new ways of working, challenging our existing processes and focusing on enhancing our customer experience."
        },
        {
            "text": "Our customers have recognised how helpful and competent our staff are, but we would like to increase our customer service skills across the organisation. As part of this work, we will be piloting some learning and development for a cohort of leaders and frontline staff, which will be delivered through the ICS Academy."
        },
        {
            "text": "We have a plan to improve our customers’ experience with us. This may take time, but we have started on this path and we are committed to listening to, understanding, and acting upon our customers’ feedback. As I said earlier, to be customer focused is one of our strategic priorities and values, which means everyone in the Planning Inspectorate is responsible for playing their part."
        },
        {
            "text": "I hope to post again soon to talk about more activities we have agreed to take forward in response to the ICS benchmark, and tell you more about the positive impact on our customers’ experience."
        }
    ]
}