{
    "url": "https://space.blog.gov.uk/2021/07/01/the-night-sky-in-july/",
    "title": "The night sky in July",
    "authors": [
        "Derek Smale"
    ],
    "categories": [
        "Astronomy"
    ],
    "pub_date": "2021-07-01T12:33:57+01:00",
    "content": [
        {
            "text": " "
        },
        {
            "text": "Even though the shorter nights prevail for the next couple of months, the summer months are a great opportunity to see many of the most exciting astronomical sights."
        },
        {
            "text": "Noctilucent clouds, the core of our Milky Way galaxy, the summer triangle, meteors, the gas giants Jupiter and Saturn, and an early evening conjunction of Venus and Mars are all on show this month."
        },
        {
            "text": " "
        },
        {
            "heading": 3,
            "text": "The Moon and Planets"
        },
        {
            "text": "Mars and Venus continue to move closer together in our evening skies in the first half of this month, being at their closest from 9 – 17 July.  Unmistakably bright Venus can be seen shining low in the west soon after sunset, while significantly fainter Mars (slightly closer to the horizon and to the left of Venus), will appear briefly before the planets dip below the horizon."
        },
        {
            "text": "Try to see the sunset on the evening of 12 July in particular, as in the hour that follows, our neighbouring planets, just a Moon’s width apart in our night sky, will be chased to the north-western horizon by a 7% illuminated slice of the Moon."
        },
        {
            "text": "Meanwhile Earth is catching up rapidly on the orbits of the gas giants Jupiter and Saturn. At the start of the month, they rise shortly before midnight, but towards the end of the month, they rise by 10pm, and are the brightest objects visible low in the south-east."
        },
        {
            "text": "Having partially eclipsed the Sun here in the UK last month, this month’s Moon will appear full, just a short distance from Saturn on 24 July, while the new Moon will bring darker skies on the nights around 10 July."
        },
        {
            "text": " "
        },
        {
            "heading": 3,
            "text": "Meteor showers"
        },
        {
            "text": "The second half of the month is a good time to try to spot meteors. Two lesser showers, the Delta Aquarids and the Alpha Capricornids, will bring a handful of meteors each hour, but it’s likely that early arrivals from the great Persieds meteor shower that peaks in August will also be visible."
        },
        {
            "text": " "
        },
        {
            "heading": 3,
            "text": "Noctilucent clouds"
        },
        {
            "text": "Noctilucent clouds were spotted in various sites across the UK in June, so keep your eyes peeled for these beautiful electric blue clouds in the northern night skies, especially an hour or two after sunset, and before sunrise. For more details on these, see May’s astronomy blog."
        },
        {
            "text": " "
        },
        {
            "heading": 3,
            "text": "Rho Ophiuchi, Scorpius and the Rival to Mars"
        },
        {
            "text": "Last month’s blog described some of the brightest summer stars, but no list of remarkable summer stars would be complete without mentioning Antares, which can be seen low in the south-west after nightfall through July."
        },
        {
            "text": "Antares’ name derives from the ancient Greek for ‘Rival to Mars’, likely due to its reddish hue. It sits around 600 light years away, is the 15th brightest star in the night sky, and is the heart of the constellation of Scorpius, whose body and tail sit mostly below the horizon from the UK."
        },
        {
            "text": "Antares is 700 times larger than our sun, and around 60,000 times more luminous!  Such is its size, if you replaced our sun with Antares, the planets Mercury, Venus, Earth and Mars would be engulfed. The solar winds and radiation that Mercury experiences from our star would, from Antares, be blasting the planet Uranus."
        },
        {
            "text": "At ‘just’ 11 million years old (compared to our sun’s 4.5 billion years), it has likely already burnt through almost all of its hydrogen fuel and is expected to end its life in a giant explosion called a supernova within the next million years."
        },
        {
            "text": "And yet despite its remarkable size, Antares is likely cooler than our own star, and its mass (the measure of how much ‘matter’ is in an object) is just one-millionth of that of our Sun. Interestingly, the light we see from Antares is actually the light from two stars. Antares has a companion star orbiting around it that is around five times larger than our Sun."
        },
        {
            "text": "This great star sits within a beautiful patch of sky called the Rho Ophiuchi cloud complex, which features reflection nebulae (clouds of gas illuminated by the stars around them) and dark bands of dust clouds that obscure light from the stars behind."
        },
        {
            "text": " "
        },
        {
            "heading": 3,
            "text": "The International Space Station"
        },
        {
            "text": "The orbit of the ISS brings it back over UK skies at night-time this month, and with the Sun sitting just below the horizon at night, it easily illuminates the ISS as it passes 400km (250 miles) overhead, travelling at around 27,700km (17,200 miles) per hour."
        },
        {
            "text": "There are bright, visible passes of the Space Station almost every night this month, and two or three on many nights, though many fall in the early hours of the morning. The high, bright passes that are easiest to spot are listed below, but you can enter your location at https://www.heavens-above.com/ to get a list of all of the passes visible to you."
        },
        {
            "text": " "
        },
        {
            "text": "Not managed to catch a meteor shower yet?  Join us next month to find out about the Perseids, one of the most spectacular meteor showers!"
        }
    ]
}