{
    "url": "https://dluhcdigital.blog.gov.uk/2021/07/01/transforming-the-way-mhclg-delivers-funding/",
    "title": "Transforming the way MHCLG delivers funding  ",
    "authors": [
        "Sam Selmon",
        "Gemma Matthews"
    ],
    "categories": [
        "Funding service design"
    ],
    "pub_date": "2021-07-01T14:01:53+01:00",
    "content": [
        {
            "text": "Delivering funding to where it is needed most is a core mission of MHCLG. And we do lots of it - distributing £8.5bn in general grants in 2019/20 – to local authorities, charities and businesses across the UK.   "
        },
        {
            "text": "This funding is a key part of the Levelling Up agenda so it’s vital we get it right. "
        },
        {
            "text": "In 2020, the Funding Service Design team was set up to help do just that. Through embedding a user-centered approach and creating reusable tools and standards, our ambition is to transform the way we deliver funding by designing a modern cross-department service. "
        },
        {
            "text": "In this blog post, we explain the problem we’re trying to solve and the approach we’re taking to transform our funding services. "
        },
        {
            "text": "You may have heard of some of the funds we deliver, which include the: "
        },
        {
            "heading": 2,
            "text": "What problem are we trying to solve? "
        },
        {
            "text": "MHCLG’s funds often share a common user base, require the same underlying functions and have a similar set of user needs, but these shared elements could be better incorporated into the design of how the department manages funds like this. "
        },
        {
            "heading": 2,
            "text": "Discovery and Alpha… "
        },
        {
            "text": "During our Discovery and Alpha phases, we’ve done lots of work to understand user needs across our funding services. We’ve run in-depth interviews with over 100 people, mapped how we design and deliver funding and reviewed over 150 guidance documents. "
        },
        {
            "text": "We found the pain points fell into two clear categories: our users desired further reductions in complexity, and greater consistency in processes used across programmes. "
        },
        {
            "text": "For people outside the department, this results in too much time spent interpreting our guidance and working across different spreadsheets and tools."
        },
        {
            "text": "For users in the department, the process of designing funds is laborious – as is managing delivery across divergent fund structures. "
        },
        {
            "heading": 2,
            "text": "So, what’s our vision? "
        },
        {
            "text": "Our ambition is to transform the way we deliver funding by designing a modern cross-department service, which will include: "
        },
        {
            "text": "Together, this will help us improve the user experience and the outcomes of our funded programmes. "
        },
        {
            "heading": 2,
            "text": "Our approach "
        },
        {
            "text": "Having mapped our riskiest assumptions across the entire service, we agreed that issues around complexity and consistency manifested in the application stage. Zooming in on this stage also allowed us to get a better understanding of other areas, such as how the funds had been designed, and the later management and reporting stages.  "
        },
        {
            "text": "Constantly prioritising the needs of applicants in our designs and prototypes, we’ve been testing our riskiest assumptions and building confidence about what is needed, desirable and feasible. On 3 June we successfully passed our GDS Alpha assessment, meaning we can now move into a private Beta phase. "
        },
        {
            "heading": 2,
            "text": "Our recommendations  "
        },
        {
            "text": "The focus of the Application Beta will be on building and testing a digital tool that will allow applicants to see information about multiple funds and apply for MHCLG funding online. Alongside this, we want to design and test a service for internal teams to design and publish application forms easily. Both services will be connected, creating a modern system. We’re excited to explore opportunities around the re-use of data and building a flexible architecture that will allow us to re-use underlying technology across multiple funds.  "
        },
        {
            "heading": 2,
            "text": "Next Steps "
        },
        {
            "text": "Now that we’ve passed our Alpha assessment things are about to get even more exciting!  "
        },
        {
            "text": "Our plan is to pilot our new Application Service with one fund in Private Beta and then roll out to more funds in Public Beta.  "
        },
        {
            "text": "While this is happening, we’ll start work to prototype on other parts of the wider service and continue supporting other funds.  "
        },
        {
            "text": "These are all exciting opportunities for us to make a difference to the lives of all our users and we look forward to measuring our success in the months to come. "
        },
        {
            "heading": 2,
            "text": "Join Us "
        },
        {
            "text": "We're a constantly growing our team and we have roles right now for people who are passionate about the change we want to make - check out our available roles.   "
        }
    ]
}