{
    "url": "https://teaching.blog.gov.uk/2021/07/01/unlocking-learning-recovery-through-professional-development/",
    "title": "Unlocking learning recovery through professional development",
    "authors": [
        "Matt Hood"
    ],
    "categories": [
        "COVID-19 support",
        "Professional Development",
        "Teachers' reflections"
    ],
    "pub_date": "2021-07-01T11:16:23+01:00",
    "content": [
        {
            "text": "Matt Hood is principal of Oak National Academy. He is a founder at Ambition Institute and an independent adviser to the Department for Education on teacher and school leader professional development. In this guest blog, he writes about how National Professional Qualifications represent an exciting opportunity for teachers and leaders in the professional development space."
        },
        {
            "text": "After an unprecedented school year, the finishing line that is the end of the summer term is now in sight. Between now and then, leaders will be thinking about what their priorities should be when the new school year begins. Calculating how to best manage recovery for every child will be close to the top of most headteachers' lists. But I would urge leaders to prioritise something else too - their own development and the development of their teachers and leaders through the reformed suite of National Professional Qualifications (NPQs)."
        },
        {
            "text": "The truth is that there really is only one good bet when it comes to learning: more expert teaching. Expert teaching has the greatest impact on pupil outcomes. Its impact is three times that of any other school-based factor.  Pupils in the most effective classrooms learn at four times the speed of those in the least effective classrooms. Great teaching benefits all pupils regardless of their starting point but has a disproportionately strong impact on pupils from disadvantaged homes."
        },
        {
            "text": "To get more expert teaching we need better professional development, both directly for those teachers and for the leaders in schools who work with them."
        },
        {
            "text": "Over the last 18 months we have seen countless examples of how important effective school leadership is. Effective school leaders create the conditions in which children thrive and teachers do their best work, in good times and bad."
        },
        {
            "text": "School leaders should be forgiven if they missed the news that NPQs are changing this year - they have had lots of pressing things to focus on. But as we’re all able to lift our heads a little it’s worth taking another look at the new suite of specialist NPQs and three refreshed leadership NPQs and thinking through how you and your school could make the most of them."
        },
        {
            "text": "Specialist National Professional Qualifications"
        },
        {
            "text": "Three new specialist NPQs replace the middle leadership qualification (NPQML). They shift the focus away from generic management and instead build the knowledge and skills teachers and aspiring middle leaders need to tackle the particular challenges they face in specialist roles most middle leaders are in."
        },
        {
            "text": "First, there is the new NPQ Leading Teacher Development - for those responsible for the training and development of others. Second, the NPQ Leading Teaching - for those responsible for leading teaching across a subject or phase. Finally there is the NPQ Leading Behaviour and Culture - for those who have a wider pastoral role within a school."
        },
        {
            "text": "The suite of specialist NPQs recognises that being a pastoral specialist requires different skills and knowledge to being responsible for, say, early career teacher development or running the geography department. But crucially, it means classroom teachers can develop their expertise, grow professionally and progress in their career as teachers."
        },
        {
            "text": "Leadership National Professional Qualifications "
        },
        {
            "text": "For more senior staff, the three existing NPQs in Senior Leadership, Headship and Executive leadership have been brought up-to-date, largely to acknowledge the sheer complexity of school leadership and address the reality that leadership is delivered through leadership teams, on top of the responsibilities towards the whole school."
        },
        {
            "text": "There is now also additional, tailored support available alongside the NPQ in Headship for those in their first two years of being a headteacher, to support those stepping up to the challenges of leading a school for the first time."
        },
        {
            "text": "These reforms to NPQs come on top of significant reforms to Initial Teacher Training and the ground-breaking Early Career Framework reforms. Taken together they are the realisation of a longed-for ambition within the profession, so that everyone builds and develops from the same evidence-base. While this is an exciting development for any year, it’s particularly timely now because better professional development will also form a major part of unlocking learning recovery for our pupils."
        },
        {
            "text": "Every school leader in the land has been deluged with well-meaning, often contradictory advice on how to plug the learning holes that opened up during the pandemic."
        },
        {
            "text": "There are no shortcuts to accelerate learning recovery for eight million young people. Having an expert teacher in every classroom, well trained and continually improving, led effectively from the top is the best way to make sure that every pupil, regardless of their background, gets a great education. In fact, it is the only way, so seize this opportunity."
        },
        {
            "text": " "
        },
        {
            "text": "The first cohort of teachers and leaders on these reformed NPQs will begin their qualifications in November 2021. To find out more about how an NPQ can help you take the next step in your career, and the providers offering these qualifications, go to GOV.UK."
        },
        {
            "text": "Want to receive blog posts in your inbox?"
        },
        {
            "text": "Sign up to receive blog updates."
        }
    ]
}