{
    "url": "https://aphascience.blog.gov.uk/2023/08/20/world-mosquito-day-2023/",
    "title": "What is all the buzz about mosquitoes?",
    "authors": [
        "Nick Johnson"
    ],
    "categories": [
        "Science Capability in Animal Health Programme",
        "Viral diseases"
    ],
    "pub_date": "2023-08-20T09:00:49+01:00",
    "content": [
        {
            "text": "With climate change impacting mosquito populations in the UK and Europe attention is turning to the increased risk of new diseases becoming established in our mosquito populations. APHA’s Vector-Borne Diseases Workgroup Head, Nick Johnson, and Dr Karen Mansfield, Dr Estela Gonzalez-Fernandez, Sanam Sewgobind and Insiyah Parekh from the Arbovirus Research Team reveal more."
        },
        {
            "text": "August 20 is World Mosquito Day. The day acknowledges the importance of mosquitoes as disease vectors of parasites and also a long list of viruses that affect humans, pets and farm animals. It also raises awareness of the importance of trying to prevent mosquito bites."
        },
        {
            "text": "Cases of dengue fever, the most common virus infection transmitted by mosquitos have globally increased recently. There have even been cases of this disease in southern Europe and travellers can return to the United Kingdom (UK) infected with this virus."
        },
        {
            "text": "Global climate change is already starting to have far-reaching impacts, and one of these includes changes to insect (arthropod) populations in the UK and Europe. Increased temperatures and more frequent flooding events cause mosquito populations to flourish and provide conditions that could enable a non-native species such as the Asian tiger mosquito to become established. When these changes are combined with an increase in global travel and movement of animals and humans around the world, there is an increased risk of a new vector-borne disease becoming established in our mosquito populations or entering the UK through a non-native species. Research on the impact of climate change to the UK arthropod distribution and disease transmission is therefore vital."
        },
        {
            "text": "At APHA, research on mosquito-borne diseases is the responsibility of the Arbovirus Research Team within the Virology Department. This team is interested in insect-borne viruses (also known as ‘arthropod-borne viruses’ or ‘arboviruses’). Our research includes horizon scanning for the next potential disease threat, and current viruses of interest are Japanese encephalitis virus and West Nile virus (WNV) – both are mosquito-borne viruses that are not currently in the UK, but could potentially arrive in the future, and can cause severe neurological disease in humans and animals."
        },
        {
            "text": "As well as developing new diagnostic tests to support early detection of these viruses, we also investigate the potential for native UK mosquito populations to become infected and transmit these viruses. To support our research, we have insectary facilities for rearing live mosquitoes, and we currently maintain three colonies of UK mosquitoes (Culex pipiens pipiens, Culex pipiens molestus and Culex modestus)."
        },
        {
            "text": "The mosquitoes are housed in mesh cages in a temperature and humidity-controlled environment, and they are regularly fed a bloodmeal at mammalian body temperature to encourage them to lay egg rafts. These eggs are transferred to larval trays, where the eggs develop into pupae and eventually emerge as the next generation of adults."
        },
        {
            "text": "Importantly, we also have an insectary within our containment laboratory where we can safely infect mosquitoes with a virus, then investigate whether they are able to transmit the virus onward through their saliva if they were to bite another animal or human. It is exciting to work in an interesting, relevant, and rapidly expanding research area."
        },
        {
            "text": "We were pleased to have recently secured support from a United Kingdom Research and Innovation (UKRI) and Department for Food, Environment and Rural Affairs (Defra) initiative to foster vector-borne research and we are currently involved in several collaborative projects. Such projects include the alignment of diagnostic tests for Japanese encephalitis virus between several European laboratories, and developing recombinant viruses to investigate changes in the genetic sequence of WNV that may affect virus transmission in the mosquito vector."
        },
        {
            "text": "APHA’s research on mosquitoes at its Surrey headquarters showcases just part of the vital work APHA does providing critical capabilities for UK biosecurity."
        },
        {
            "text": "Funding for a major investment in the animal health science campus at APHA Weybridge was announced in the March 2020 Budget and will enable us to respond to animal disease threats in the decades ahead. The Science Capability in Animal Health (SCAH) Programme, led by Defra, will secure and futureproof the APHA Weybridge Campus; safeguard and enhance the UK’s capability to respond to the threat from zoonotic diseases; underpin the UK’s trade capability and protect public health."
        },
        {
            "heading": 3,
            "text": "Find out more"
        },
        {
            "text": "If you are interested in this topic, please look at some of our other related blogs:"
        },
        {
            "text": "Exploring the rise of vector-borne diseases"
        },
        {
            "text": "Spotlight on APHA’s zoonotic disease research"
        },
        {
            "text": "What is lurking in Britain’s hedgerows?"
        }
    ]
}