{
    "url": "https://socialcare.blog.gov.uk/2023/02/09/bridging-the-gap-from-hospital-to-home/",
    "title": "Bridging the gap – from hospital to home",
    "authors": [
        "Hayley Robertshaw"
    ],
    "categories": [
        "Care and support",
        "Workforce"
    ],
    "pub_date": "2023-02-09T11:19:47+00:00",
    "content": [
        {
            "heading": 2,
            "text": "How it was..."
        },
        {
            "text": "Convalescent homes were a common aspect of the health care system from the mid-nineteenth century until the 1980’s. They supported individuals to recuperate, following a stay in hospital. By focusing on nutrition, hydration and general health and well-being they enabled individuals to return home when they were fully rehabilitated."
        },
        {
            "text": "They were often in locations which could be considered ‘therapeutic’, for example, close to the coast. This was an approach which predates the models of person-centred care we know today, where the link between emotional, physical and mental well-being is now well established."
        },
        {
            "text": "It could not be more relevant to the challenges we are experiencing across the whole health and social care system in 2023. We need to be putting the person at the centre of care and focusing on long-term outcomes, rather than short-term fixes."
        },
        {
            "heading": 2,
            "text": "How it is..."
        },
        {
            "text": "We hear every day of unsafe discharges, people entering the system in crisis, reactive rather than proactive service design and a lack of connection between social isolation, low mood and self-neglect."
        },
        {
            "text": "People are living longer, advances in medical interventions for complex health conditions requiring longer term support models and increased customer expectations. That combined with reduced living standards, health inequalities and the impact of COVID have seen the pressure on the NHS and social care increase past breaking point."
        },
        {
            "text": "We know that recruitment is a national issue and there are many delayed transfers of care due to domiciliary care shortages. The evidence suggests lack of activity in hospital leads to reduced functional ability, deconditioning, as well as the worsening of cognition, particularly in older people. These are all major factors that can prevent discharge and increase reliance and pressure on social care."
        },
        {
            "text": "We regularly receive admissions with people who were continent on admission and return catheterised, people who were mobile and return requiring hoist transfers and people who had no pressure damage returning with grade 3 pressure sores. This is not a criticism of health settings; they are not set up to provide holistic outcomes."
        },
        {
            "heading": 2,
            "text": "How it could be…"
        },
        {
            "text": "A fresh perspective on the ‘convalescent home’ could provide vital short-term care and support interventions to individuals that enable them to return and remain at home."
        },
        {
            "text": "I am thinking of a ‘social prescribing plus’ model, where short-term stays are commissioned as part of an admission avoidance strategy and support hospital discharge. During a 7-day period an individual could have a full medication review, maintain good nutrition and hydration, enjoy restful sleep, and encourage daily routines of physical, mental and emotional activity."
        },
        {
            "text": "An individual could be reconnected or introduced to their community and returned home with a full holistic MOT completed."
        },
        {
            "text": "We should never underestimate the power of TLC and the positive impact it can have on an individual’s mental, physical, and emotional well-being. This approach could delay the need for 24/7 care or remove the need completely."
        }
    ]
}