{
    "url": "https://digitaltrade.blog.gov.uk/2023/02/09/celebrating-national-apprenticeship-week/",
    "title": "Celebrating National Apprenticeship Week",
    "authors": [
        "Joanne Granton, Capability Lead",
        "Andy Palmer, Workforce Planning and Capability Manager",
        "Hameda Akther, Head of Portfolio Management Office",
        "Joanna Everest, Governance, Risk and Compliance Manager",
        "James Kennett, Delivery Manager"
    ],
    "categories": [
        "People"
    ],
    "pub_date": "2023-02-09T15:03:59+00:00",
    "content": [
        {
            "heading": 2,
            "text": "Jo Granton - DDaT Capability Lead"
        },
        {
            "text": "I lead apprenticeships for the Digital, Data and Technology directorate (DDaT) in the Department for Business and Trade (DBT) and have been involved in National Apprenticeship Week since it began in 2007. My passion for apprenticeships comes from seeing the great success that they can help people achieve in their lives and careers. They give you the chance to change direction, to grow within your role, and to learn new skills. "
        },
        {
            "text": "In DBT, we champion apprenticeships and are innovative in the way we offer them to both new and existing staff. National Apprenticeship Week is a chance for us to remind current and prospective staff that apprenticeships are for everyone, whatever age or ability. From career entry to Senior Leadership, we have apprenticeships that span every part of your career. "
        },
        {
            "text": "In this blog, we’ll be highlighting the different experiences of DBT staff who have taken up apprenticeships during their career. "
        },
        {
            "heading": 2,
            "text": "Andy Palmer – Workforce Planning and Capability Manager"
        },
        {
            "text": "I’m relatively new to DBT, having transferred from the Department of Work and Pensions (DWP). Whilst I was in the DWP I completed a one-year Apprenticeship in Customer Service. This was in support of my role as an Employer Adviser (and later Employer Engagement Manager) in Jobcentre Plus."
        },
        {
            "text": "I was a little unsure about it at first. I had previously been a secondary school teacher for many years and appreciated the value of workplace qualifications. I was concerned it would be a distraction from my job. However, I couldn’t have been more wrong! Study time was ring fenced – every Friday was dedicated to my coursework. Moreover, colleagues were supportive and helpful when I asked for support with assignment-based activities such as recorded conversations or witness statements."
        },
        {
            "text": "When I started my new role within Capability and Workforce Planning in DDaT, I was given the opportunity to embark upon an eighteen-month apprenticeship in HR Consultancy. Because my last one was so successful, I jumped at the chance. Apprenticeships are an excellent way to get recognised and acquire useful qualifications whilst still doing your job. My next one includes a Chartered Institute of Personnel and Development (CIPD) certificate – an industry benchmark that is recognised within the private sector and the Civil Service."
        },
        {
            "heading": 2,
            "text": "Hameda Akther – Head of Project Management Office"
        },
        {
            "text": "Having decided that I would like a career in Project Delivery, I weighed up the relative merits of full-time university against an apprenticeship scheme. I realised that the wealth of experience gained through 'on the job' training would benefit me and be a deciding factor for future employers to consider."
        },
        {
            "text": "I approached the Level 4 Civil Service Project Delivery Fast Track once I had completed my A Levels. I was thrilled to become a DIT apprentice on an 18-month scheme. It was a great experience navigating my way through digital projects as an associate and dabbling in the world of a Project Management Office (PMO) as a Project Support Officer (PSO). I developed my passion for project management and leadership and actively looked for opportunities to further my career."
        },
        {
            "text": "I have completed my Level 4 Project Delivery Programme and am now undertaking a DIT funded degree programme in Chartered Management and Leadership. I am currently working as Head of PMO in DDaT’s Business Operations Team. My apprenticeship gave me a good base from which to build, and I have worked across multiple, complex, yet exciting projects. I have experienced different roles and worked on some pretty amazing things."
        },
        {
            "text": "Apprenticeships are as diverse as you are. Believe that there is one out there for you. I would recommend the apprenticeship route to anybody who is considering it. It will showcase the skills, knowledge, and behaviours you need to be successful in your chosen career. You will also benefit from gaining on-the-job experience, have access to bespoke support and achieve a qualification at the same time."
        },
        {
            "heading": 2,
            "text": "Joanna Everest – Governance, Risk and Compliance Officer"
        },
        {
            "text": "An apprenticeship is a chance for those who are already in the Civil Service to make a career change or turbo charge their career.  As a non-fast streamer this was my only opportunity to develop my knowledge and capability to build competence in an area that I wanted to work in."
        },
        {
            "text": "The traditional barriers to getting access to training courses can include high costs and a lack of senior support to training outside of a narrow view of job roles. These were washed away with the funding and central support available for apprenticeships."
        },
        {
            "text": "Apprenticeships take a serious investment of time and effort outside of office hours. It has been the biggest challenge of organisation and time management for me so far, but very satisfying as I pass each module."
        },
        {
            "text": "If you want to develop your career, you need to invest time and effort in yourself. If you don’t why should anyone else?"
        },
        {
            "heading": 2,
            "text": "James Kennett – Delivery Manager in great.gov.uk"
        },
        {
            "text": "I am passionate about apprenticeships and the opportunity they bring to learn and do at the same time. I am someone that likes learning practically and putting things into action, so for me it felt like the right choice."
        },
        {
            "text": "I completed a four-year degree apprenticeship in Engineering in 2022, but decided I would rather pursue projects in the digital space. So, I joined DDaT in DBT back in September. Even though I didn’t quite end up where I set off, I learnt a huge amount from my apprenticeship that I wouldn’t have learnt at university. This ranged from commercial skills to team working to even just learning how to work in an office environment!"
        },
        {
            "text": "Now I am an apprenticeships ambassador, shouting about how they can help us all, be it a school leaver, a mid-career changer or even a senior manager."
        },
        {
            "text": "I also want to help employers and training providers improve the quality of apprenticeships. I work with the Institute of Apprenticeships and Technical Education to help improve apprenticeship quality and access. This is another great source of information for anyone looking at apprenticeships!"
        },
        {
            "text": "If these stories have inspired you to learn more about apprenticeships, you can find out more on the National Apprenticeship Week website."
        }
    ]
}