{
    "url": "https://food.blog.gov.uk/2023/02/09/chief-executives-message-to-stakeholders-the-horsemeat-crisis-ten-years-on/",
    "title": "Chief Executive’s message to stakeholders - The horsemeat crisis ten years on",
    "authors": [
        "Emily Miles, Chief Executive"
    ],
    "categories": [
        "Our mission"
    ],
    "pub_date": "2023-02-09T10:12:47+00:00",
    "content": [
        {
            "text": "Cymraeg"
        },
        {
            "text": "This year marks the tenth anniversary of the horsemeat crisis, a food scandal that rocked consumer confidence in UK food and cost the industry hundreds of millions of pounds. In 2013, the discovery of horsemeat in products that were labelled as beef led to the recall of millions of products across Europe."
        },
        {
            "text": "As we look back over the ten years that have passed, the obvious question is whether such an incident could happen again. Indeed, with disruption to global supply chains caused by events like the pandemic and the war in Ukraine, it often feels like the risks to our food supply have never been greater."
        },
        {
            "text": "Of course, there will always be risks in a global food system as complex as ours, but I believe we’re in a better position to mitigate those risks than we were ten years ago."
        },
        {
            "text": "The FSA now works more effectively with industry, who in turn are much better at probing in detail along their supply chain. The sampling which industry carries out allows the FSA to make more informed decisions on the action we need to take to protect consumers. We have also improved the way the FSA gathers other intelligence, using data and predictive analytics to monitor risks."
        },
        {
            "text": "In the wake of the horsemeat crisis, the FSA established the National Food Crime Unit (NFCU) to boost our investigatory expertise in food fraud. The NFCU now has a team of more than 80 people whose focus is on preventing, detecting and investigating serious fraud within food supply chains."
        },
        {
            "text": "In its most recent report to the FSA Board, the NFCU showed it had registered 59 disruptions with the National Crime Agency in the first three quarters of 2022 and secured the first conviction following a Unit-led investigation, as recently covered in the BBC’s Defenders UK documentary series. While this work should reassure consumers, we are also conscious of the resource pressures that local authorities are under and the impact this could have on the vital work being carried out by their trading standards teams – a concern highlighted last year in our food standards report."
        },
        {
            "text": "If you have information about a food crime, please contact the NFCU on foodcrime@food.gov.uk , via our Food Crime Confidential hotline on 020 7276 8246 or via the online form on our website."
        },
        {
            "text": "Or, if you have any insights into how the food system is managing the risk of food crime, we would be really interested to hear them. Please do let us know in the comments section below."
        },
        {
            "heading": 2,
            "text": "Neges y Prif Weithredwr i randdeiliaid - Yr argyfwng cig ceffyl ddeng mlynedd yn ddiweddarach"
        },
        {
            "text": "Mae deng mlynedd ers yr argyfwng cig ceffyl, sgandal bwyd a siglodd hyder defnyddwyr mewn bwyd yn y DU, gan gostio cannoedd o filiynau o bunnoedd i’r diwydiant. Yn 2013, darganfuwyd cig ceffyl mewn cynhyrchion a oedd wedi’u labelu fel cig eidion, a arweiniodd at alw miliynau o gynhyrchion yn ôl ledled Ewrop."
        },
        {
            "text": "Wrth i ni edrych yn ôl dros y deng mlynedd diwethaf, y cwestiwn amlwg i’w ofyn yw a allai rhywbeth tebyg ddigwydd eto. Yn wir, gyda digwyddiadau fel y pandemig a'r rhyfel yn Wcráin yn tarfu ar gadwyni cyflenwi byd-eang, mae’n aml yn teimlo bod y risgiau i’n cyflenwad bwyd yn fwy nag erioed."
        },
        {
            "text": "Wrth gwrs, bydd risgiau bob amser yn bresennol mewn system fwyd fyd-eang sydd mor gymhleth â’n system ni, ond rwy’n credu ein bod mewn sefyllfa well i liniaru’r risgiau hynny nag yr oeddem ddeng mlynedd yn ôl."
        },
        {
            "text": "Mae’r Asiantaeth Safonau Bwyd (ASB) bellach yn gweithio’n fwy effeithiol gyda’r diwydiant, ac mae’r diwydiant yn llawer gwell am graffu’n fanwl ar eu cadwyni cyflenwi o’r dechrau i’r diwedd. Mae gwaith samplu gan y diwydiant yn galluogi’r ASB i wneud penderfyniadau mwy gwybodus ar y camau y mae angen i ni eu cymryd i ddiogelu defnyddwyr. Rydym hefyd wedi gwella’r ffordd y mae’r ASB yn casglu cudd-wybodaeth arall, gan ddefnyddio data a dadansoddiadau rhagfynegol i fonitro risgiau."
        },
        {
            "text": "Yn sgil yr argyfwng cig ceffyl, sefydlodd yr ASB yr Uned Genedlaethol Troseddau Bwyd (NFCU) i hybu ein harbenigedd ymchwiliol ym maes twyll bwyd. Mae gan yr NFCU bellach dîm o fwy nag 80 o bobl sy’n canolbwyntio ar atal, canfod ac ymchwilio i dwyll difrifol o fewn cadwyni cyflenwi bwyd."
        },
        {
            "text": "Yn ei hadroddiad diweddaraf i Fwrdd yr ASB, dangosodd yr NFCU ei bod wedi cofrestru 59 achos o darfu gyda’r Asiantaeth Troseddau Cenedlaethol yn ystod tri chwarter cyntaf 2022 a’i bod wedi sicrhau’r euogfarn gyntaf yn dilyn ymchwiliad a arweiniwyd gan yr Uned, fel y trafodwyd yn ddiweddar yng nghyfres ddogfen y BBC, Defenders UK. Er y dylai’r gwaith hwn dawelu meddwl defnyddwyr, rydym hefyd yn ymwybodol o’r pwysau sydd ar adnoddau awdurdodau lleol a’r effaith y gallai hyn ei chael ar y gwaith hanfodol sy’n cael ei wneud gan eu timau safonau masnach – pryder a amlygwyd y llynedd yn ein hadroddiad safonau bwyd."
        },
        {
            "text": "Os oes gennych wybodaeth am drosedd bwyd, cysylltwch â’r NFCU drwy foodcrime@food.gov.uk, drwy ein llinell gymorth Trechu Trosedd Bwyd yn Gyfrinachol ar 020 7276 8246 neu drwy’r ffurflen ar-lein ar ein gwefan."
        },
        {
            "text": "Neu, os oes gennych unrhyw sylwadau ar sut mae’r system fwyd yn rheoli’r risg o droseddau bwyd, hoffem glywed gennych. Rhowch wybod i ni yn yr adran sylwadau isod."
        }
    ]
}