{
    "url": "https://extremismcommission.blog.gov.uk/2023/02/09/commissioner-for-countering-extremism-on-the-independent-review-of-prevent/",
    "title": "Commissioner for Countering Extremism on the Independent Review of Prevent",
    "authors": [
        "Commission for Countering Extremism"
    ],
    "categories": [
        "Blog"
    ],
    "pub_date": "2023-02-09T14:37:06+00:00",
    "content": [
        {
            "text": "The Independent Review of Prevent, written by William Shawcross, is a vital contribution to the nation’s ongoing attempts to combat extremism and terrorism."
        },
        {
            "text": "Prevent aims to stop people becoming terrorists or supporting terrorism. The recommendations arising from the Independent Review seek to facilitate a more robust, balanced and transparent approach in doing so."
        },
        {
            "text": "Among the Independent Review’s findings is that “the government should place a high priority on work around counter-extremism and ensure that Prevent is active in this area”."
        },
        {
            "text": "This is an understandable response to a phenomenon where individuals or groups that do not plot acts of terrorism can still create permissive environments for the spread of extremist ideologies."
        },
        {
            "text": "The Independent Review identified several areas where the CCE should play a vital role in helping Prevent."
        },
        {
            "text": "It has been agreed that the CCE should offer support across a range of recommendations, including those relating to training and advisory boards."
        },
        {
            "text": "This work will take place alongside our existing role in offering advice and scrutiny to government on all forms of extremism."
        },
        {
            "text": "Reflecting on the publication of the review, Commissioner for Countering Extremism Robin Simcox said:"
        },
        {
            "text": "“The Independent Review of Prevent’s findings can only aid the quest to keep our country safe from the menaces of extremism and terrorism."
        },
        {
            "text": "The Review’s recommendations should prove a significant help to government."
        },
        {
            "text": "The CCE is uniquely placed to help scrutinise how the recommendations published in the Independent Review are now implemented and embedded.”"
        }
    ]
}