{
    "url": "https://userresearch.blog.gov.uk/2023/02/09/conducting-ethical-internal-research/",
    "title": "Conducting ethical internal research",
    "authors": [
        "Dr Erin Bramwell, Senior User Researcher"
    ],
    "categories": [
        "Ethics",
        "Tips and techniques",
        "User research",
        "User research methods"
    ],
    "pub_date": "2023-02-09T13:45:23+00:00",
    "content": [
        {
            "heading": 2,
            "text": "What is internal research? "
        },
        {
            "text": "In government, we sometimes do user research with colleagues - other civil servants or contractors who work for government departments. These people can be users, even if they’re in your department or team."
        },
        {
            "text": "Internal research could be on topics ranging from service or product work, like the GDS service manual, to surveys and interviews about experiences, like the reorganisation of departments. "
        },
        {
            "text": "If you’re consulting the users of your service, product, or project about their thoughts, opinions, and feelings, or testing how they behave or think in certain situations, it’s very likely to be internal research where ethical considerations must still apply."
        },
        {
            "heading": 2,
            "text": "Why is ethical research important?"
        },
        {
            "text": "Internal research is worthy of serious ethical consideration - just as external research is. "
        },
        {
            "text": "Although information about companies or public authorities is not subject to GDPR, employees’ information can be personal data. For example, when you’re doing internal research you usually collect an employee’s name, their role, their email address, and other information that can identify them. This is personal data. "
        },
        {
            "text": "Internal research also gathers the opinions, feelings, and experiences of employees, and can be on controversial topics, such as the reorganisations of departments, internal processes, and internal teams or services. As researchers, we have a duty to ensure that our research participants can’t be identified, even if they’re colleagues of ours."
        },
        {
            "text": "Some processes involved in internal research ethics may seem more rigorous than the processes used for external research. For example, it is far more likely that internal participants could be recognised from recordings of sessions – they could even be identified from quotes. They could also be identified through 'jigsaw identification', which is when someone can be identified based on a description of their work. This could potentially make participants feel uncomfortable, especially if you have discussed sensitive or controversial topics. "
        },
        {
            "heading": 2,
            "text": "Getting informed consent from internal participants"
        },
        {
            "text": "Even if you know your participant and they’re a colleague, it’s best practice to get consent from them to use their personal data, to take notes in research sessions, and to audio or video record sessions."
        },
        {
            "text": "You should explain in plain language:"
        },
        {
            "text": "As this blog post on how to carry out user research with colleagues points out, it’s also a good idea to give participants a choice of interviewer if you have multiple people conducting the research."
        },
        {
            "text": "You should also give internal participants the option to individually specify if they give consent to:"
        },
        {
            "text": "In addition, you should consider that participants may also feel obliged or pressured to take part in your research, especially if their manager or someone senior to them has put them forward for it. It’s a good idea to make it clear in your research information sheet and consent form that:"
        },
        {
            "heading": 2,
            "text": "Recruiting and anonymity "
        },
        {
            "text": "If you’re putting calls out for participants in public places like Slack, Teams, or Google Spaces, people might be able to see who’s volunteered to take part in your research. "
        },
        {
            "text": "When you’re recruiting participants and booking time in their calendars, other colleagues may also be able to see if they’re taking part in your research."
        },
        {
            "text": "There are several things you can do to maintain participants’ anonymity while you’re recruiting:"
        },
        {
            "heading": 2,
            "text": "Running the research session"
        },
        {
            "text": "Be aware that some participants may be in the office during your session. If your participant is surrounded by colleagues, this could affect what they say. To help mitigate this, you could book a room for them in their building. Or, you could ask them if they work at home some days and book the session for that day."
        },
        {
            "heading": 2,
            "text": "Your experiences"
        },
        {
            "text": "What have you learned during internal-facing research? Are there any tips you have for others who might be conducting internal research? Please add your comments below."
        },
        {
            "text": " "
        }
    ]
}