{
    "url": "https://dragonsden.blog.gov.uk/2023/02/09/dragons-den-series-20-episode-6/",
    "title": "Dragons’ Den, Series 20 Episode 6",
    "authors": [
        "kayleighenticknap"
    ],
    "categories": [
        "Copyright",
        "IP",
        "Licensing",
        "Patents",
        "Trade marks"
    ],
    "pub_date": "2023-02-09T21:05:52+00:00",
    "content": [
        {
            "text": "While February may still be a bit dark and cold, things have been heating up in the Den, with the Dragons’ fiery appetite for investment."
        },
        {
            "heading": 2,
            "text": "Barking up the right tree"
        },
        {
            "text": "First up were father and son, Peter and Chris Maxted. The duo were pitching for a 50k investment in return for a 10% cut in their dog safety gate business, The Dog-G8 Company."
        },
        {
            "text": "As a dog owner myself, I was immediately intrigued as I watched little Hudson the beagle, happily demonstrate the retractable gate, which can be extended to fit various openings including doors and stairs."
        },
        {
            "text": "The Dragons’ ears pricked up when Peter told them that the company had joined the popular social media channel TikTok, where three of their videos had gained 27.7 million views."
        },
        {
            "text": "Social media guru Steven Bartlett commented, ‘Isn’t social media just so powerful’, and with a following of 44k on the platform alone, it was clear that the duo are building and growing their brand via their social media presence."
        },
        {
            "text": "Cleverly, Chris and Peter have already protected the name Dog G8 with a trade mark, which is crucial for building their brand."
        },
        {
            "text": "Before applying for a trade mark, you should use The IPO’s free and easy search tool to:"
        },
        {
            "text": "Despite being hot under the collar at the start, all but one of the Dragons opted out of a deal. However, the doggy duo left the den with their tails wagging after Deborah Meaden offered all the money, for 20% of the business."
        },
        {
            "heading": 2,
            "text": "From pre-loved to premium"
        },
        {
            "text": "Next into the Den was co-founder Lucy Norris, asking for 70k in return for 12% of her company, Second Hand Styling UK."
        },
        {
            "text": "Lucy’s subscription-based business enables customers to swap clothes and provide a guilt-free shopping experience."
        },
        {
            "text": "I really liked the idea of what Lucy is trying to achieve. Not only has second hand clothing become trendy in today’s era, it’s also a way to maximise your wardrobe whilst lowing your carbon footprint."
        },
        {
            "text": "Unless Lucy is super tech savvy, it’s likely that her website and any promotional material will have been commissioned by another party and will be protected by copyright. With commissioned works, it is usually the case that the person or company who created the work owns the copyright, unless agreed otherwise in writing."
        },
        {
            "text": "Unfortunately for Lucy, despite initially intriguing her potential investors with a sustainable concept, none of the Dragons chose to invest in her business."
        },
        {
            "heading": 2,
            "text": "Game changing product"
        },
        {
            "text": "Adapt Ability founders Cristian Brownlee and Matthew Walker entered the Den looking for a 40k investment for 5% of their mobility business."
        },
        {
            "text": "From their personal experiences of using a wheelchair, the duo found that most chairs were outdated and don’t give the right postural support or independence, so they set about finding a solution."
        },
        {
            "text": "After sourcing various parts and technology from around the world, the duo created the Omeo - a hands-free mobility device, which is moved by shifting the body weight in any direction and is suitable for use on all terrains."
        },
        {
            "text": "After hearing Cristian’s story of finally being able to visit his local woods independently, I had my fingers crossed that the pair would bag a Dragon."
        },
        {
            "text": "Turning to the subject of IP, by having exclusive distribution rights for the state-of-the-art technology used to create the chairs, the pair must have an entered into a licencing agreement with the IP rights owner."
        },
        {
            "text": "The licence grants them permission to do something that would otherwise be an infringement of the owners’ rights."
        },
        {
            "text": "To find out more, watch our video:"
        },
        {
            "text": "After Peter Jones and Deborah declared themselves out, a surprising turn of events saw Sara Davies, Steven and Touker Suleyman each offer all the money, in return for 15% of the business."
        },
        {
            "text": "Taking a gamble, the entrepreneurs asked if the Dragons were willing to combine. On this occasion, the Dragons were more than happy to share, giving the pair 40k in return for 5% each."
        },
        {
            "text": "The atmosphere in the room was full of delight as Matthew and Cristian left the Den with three new shareholders. Congratulations!"
        },
        {
            "text": " "
        }
    ]
}