{
    "url": "https://teaching.blog.gov.uk/2023/02/09/empowering-primary-school-children-to-take-a-proactive-approach-to-wellbeing/",
    "title": "Empowering primary school children to take a proactive approach to wellbeing",
    "authors": [
        "Claire Lee"
    ],
    "categories": [
        "Pupil wellbeing and behaviour",
        "Teacher wellbeing",
        "Uncategorized"
    ],
    "pub_date": "2023-02-09T12:47:11+00:00",
    "content": [
        {
            "text": " "
        },
        {
            "text": "Claire Lee, head teacher at Burley Oaks Primary School in West Yorkshire, shares how her school is supporting pupil wellbeing to help them as they grow up."
        },
        {
            "text": "Early intervention and support for wellbeing "
        },
        {
            "text": "Pupil wellbeing is at the heart of our curriculum, which has been refocused by the impact of the pandemic and our focus on positive mental health."
        },
        {
            "text": "Our wellbeing approach and offer is well established, having evolved gradually over time. The initial impetus to make a change arose from discussions with a local clinical psychologist and the oversubscription for private mental health services for teenagers locally. Our local consortium of primary schools bid for local authority funding to address this great need from our position in primary schools; it was clear to us that preventative and proactive work was needed to empower our children and prepare them for their teenage years."
        },
        {
            "text": "The outcome of this bid was a programme of learning based on topics such as ‘anxiety’ and ‘big feelings’ which were targeted to need. Demand was great, with children and families keen to sign up to sessions, resulting in most children in school accessing at least one of the programmes by the end of the second year of roll out."
        },
        {
            "text": "We have since harnessed the DfE offer of funded training for a senior mental health lead and collaborated with local partners and local authority to develop our practice further. Our provision is wide-ranging and includes a DfE trained senior mental health lead, a wellbeing mentor, dedicated wellbeing Wednesdays, peer mentoring and lunchtime leaders."
        },
        {
            "text": "From our wellbeing team, we have trained staff to deliver specific programmes of work such as ‘drawing and talking’, to help pupils talk about their feelings and emotions. Our trained ‘wellbeing ambassadors’ are pupils who lead on and provide a voice for all things mental health and wellbeing, opening up conversations and ensuring relationships are supportive. They have recently set up our intergenerational project which brought together different age groups from across the community to mutually support wellbeing. Events organised have included a conker tournament with tea and cakes, a drop-in session at the parish council and a Christmas Bonanza."
        },
        {
            "text": "Of course, all these things are complemented by a cleverly designed PSHE curriculum. Our preventative approach is vital to empower children with the skills, knowledge and awareness to understand their mental health needs and identify issues early on, and we can see the difference this makes to our pupils. However, it is not only these factors that support happy, settled and confident children prepared for the world ahead of them."
        },
        {
            "text": "So what else makes a difference? "
        },
        {
            "text": "There is also vast research showing how music can affect our feelings, mood and wellbeing. Music at Burley Oaks is central to our curriculum offer. On most days, you can hear the bass of the drummers in our school creating the beat and singing is integral to our learning and helps children commit learning to memory very powerfully. With a self-taught, specialist music teacher, we can focus on a rigorous and carefully planned programme of work to ensure that children can both play and appreciate music and realise all of its benefits."
        },
        {
            "text": "The school culture of mental health awareness is paramount to our approach which is built on nurturing positive relationships, teamwork, care and compassion. At the centre of all of this is the power of our staff and the wider community who truly value one another and the contribution of each person’s unique role in making a difference. Our staff create a positive ethos and culture and from there, we build a jigsaw of learning opportunities through our vast curriculum."
        },
        {
            "text": "We are fortunate to have a school team who live and breathe our motto of ‘belong, believe, achieve’, and they help place mental health and wellbeing at the heart of everything we do."
        },
        {
            "text": "Find out more about mental health and wellbeing support "
        },
        {
            "text": "Head to gov.uk for more mental health and wellbeing support and resources and info on the Education Staff Wellbeing Charter which sets out shared commitments to promote, protect and enhance the wellbeing of staff. "
        }
    ]
}