{
    "url": "https://educationhub.blog.gov.uk/2023/02/09/family-hubs-everything-you-need-to-know/",
    "title": "Family Hubs: everything you need to know",
    "authors": [
        "mediaofficer"
    ],
    "categories": [
        "Families"
    ],
    "pub_date": "2023-02-09T10:59:13+00:00",
    "content": [
        {
            "text": "Strong families make for stable and happy communities. That’s why we’re launching Family Hubs across the country, making it easier for families – no matter what form they take – to access vital local services to help improve health and education outcomes."
        },
        {
            "text": "Here’s what you need to know about Family Hubs:"
        },
        {
            "heading": 3,
            "text": "What are Family Hubs?"
        },
        {
            "text": "Family Hubs bring together multiple organisations in a ‘one stop shop’ to make it easier to get the help you and your family need."
        },
        {
            "text": "Family Hubs unite lots of different organisations, so you only have to explain what you need help with once, rather than having to tell many different people. Meanwhile, professionals can work together more effectively to help you overcome any difficulties you might be facing. Previously these services could be disjointed and hard to navigate but Family Hubs offer guidance and advice on a range of circumstances including, infant feeding, mental health support, health visits and parenting classes."
        },
        {
            "text": "The hub itself may or may not be a single building – instead, it could be a network of different physical locations in the community, as well as online services."
        },
        {
            "heading": 3,
            "text": "Who are Family Hubs for?"
        },
        {
            "text": "Family Hubs are for families with babies, children and young people from birth until they reach the age of 19 (or up to 25 for young people with special educational needs and disabilities)."
        },
        {
            "heading": 3,
            "text": "Where can I find my local Family Hub?"
        },
        {
            "text": "We’re funding 75 councils in England to open new Family Hubs, or to expand existing hubs."
        },
        {
            "text": "For information on what is currently available in your area, search for your council’s local ‘family information service’."
        },
        {
            "heading": 3,
            "text": "What kind of services are available at Family Hubs?"
        },
        {
            "text": "Hubs help you to access a range of help, including support for your physical and mental health, housing and debt advice, youth services, domestic abuse support, as well as services run by charities."
        },
        {
            "text": "At the heart of Family Hubs are services that give babies a great start for life, helping parents build strong relationships with their babies by providing things like parenting classes, midwifery, health visiting, infant feeding advice and perinatal mental health support."
        },
        {
            "heading": 3,
            "text": "What have you announced?"
        },
        {
            "text": "All 75 councils eligible to take part have now successfully signed up to the Family Hubs and Start for Life programme. This means they’ll benefit from an investment of £300 million up to 2025 to transform services for parents, carers, babies, and children in their area."
        },
        {
            "text": "We’ve also announced the 14 ‘trailblazer’ councils who will receive extra funding to make the quickest improvements for families in their areas, and to support other areas with their expertise. They will lead the way for other family hubs across the country."
        },
        {
            "heading": 3,
            "text": "Why are Family Hubs so important?"
        },
        {
            "text": "All kinds of families face challenges from time to time. Family Hubs make it simpler to get the help that the whole family needs."
        },
        {
            "text": "Strong, supportive families make for more stable communities and happier individuals."
        },
        {
            "text": "Investing in families and making sure they get the support they need from birth through to adulthood helps with children’s educational attainment, wellbeing and life chances, while also improving wider outcomes such as mental health and unemployment."
        },
        {
            "text": "We also know that the time from conception to the age of 2 lays important foundations for children’s emotional and physical development. We want to support parents through the early years of a child’s life, understanding how challenging it can be."
        },
        {
            "text": "By helping to establish nurturing, supportive environments for the youngest members of society, family hubs will make it easier for parents and carers to give their children the best start in life."
        }
    ]
}