{
    "url": "https://traderemedies.blog.gov.uk/2023/02/09/national-apprenticeship-week-what-does-an-apprenticeship-at-the-tra-look-like/",
    "title": "National Apprenticeship Week: What does an apprenticeship at the TRA look like?",
    "authors": [
        "Sean Fitzpatrick, Investigator"
    ],
    "categories": [
        "HR",
        "Investigations"
    ],
    "pub_date": "2023-02-09T14:14:04+00:00",
    "content": [
        {
            "text": "This National Apprenticeship Week, we are reflecting on how apprenticeships can help individuals develop the skills and knowledge required for a rewarding career. Apprenticeships provide on-the-job training alongside studying, allowing individuals to gain essential workplace skills to aid their career development. Over 700 qualifications are available and the TRA can provide access to them for new entrants as well as those already in the Civil Service."
        },
        {
            "text": "We caught up with Sean Fitzpatrick, one of our Investigators who recently completed and passed his ACCA apprenticeship as part of his HEO learner journey. Sean had no accounting experience prior to working at the TRA, having spent 12-13 years in academic publishing before. Below, he shares his experience and some advice for anyone thinking about embarking on an apprenticeship."
        },
        {
            "heading": 2,
            "text": "Combining the day job with an apprenticeship"
        },
        {
            "text": "I started my apprenticeship journey back in September 2021 with an induction which included what to expect throughout."
        },
        {
            "text": "Between then and the end of 2022 when I completed my apprenticeship, every other week there were formal lectures covering the course materials we would need to know, which all tied in with the textbook and its structure too. There were three overarching aspects of the apprenticeship: financial accounting, management accounting and accounting for business, all of which had sub-topics that were clearly differentiated. This helped with identifying the areas I needed to brush up on with my revision."
        },
        {
            "text": "Throughout the course, I had to sit three formal exams that were structured as multiple choice, and I could book these whenever I felt ready to do so. We had access to practice questions and mock exams that helped me to assess my knowledge prior to sitting any formal assessments."
        },
        {
            "text": "I also had to ensure that I completed my portfolio, which consisted of record keeping and a written portfolio, in which I had to reflect on my own development and application of the learning into my role."
        },
        {
            "heading": 2,
            "text": "Learning new skills and how this benefits you in your role"
        },
        {
            "text": "My apprenticeship really helped me to understand the terminology used in accounting, how financial accounts are presented and the processes behind financial information. This has been applicable to my role and has especially helped me when working alongside colleagues in Verification."
        },
        {
            "text": "The maths aspect has also been very handy, especially as it's been a few years since using maths in an academic setting! Brushing up on maths and number handling has been useful for analytical aspects of my work including data handling and calculations. I definitely feel much more confident in speaking to companies regarding their financial information and feeling assured that what I'm saying and/or doing is correct!"
        },
        {
            "text": "I've also developed my time management skills, especially on the portfolio aspect of the apprenticeship. I've been able to practise my discipline skills by ensuring I dedicate time towards record keeping, rather than leaving it to the end and having to rack my brain for what I did when!"
        },
        {
            "heading": 2,
            "text": "What advice would you give to someone considering studying an apprenticeship?"
        },
        {
            "text": "My advice would absolutely be to do it! An apprenticeship is definitely a big win, as this is something that you do alongside your working day rather than trying to fit into your evening and weekends. For me and my personal commitments, having the opportunity to focus on my development during my working hours has been a huge advantage. It's also a way to boost your CV and your range of experience, and is a really good way to broaden your horizons."
        },
        {
            "heading": 2,
            "text": "Interested in joining the TRA?"
        },
        {
            "text": "Find out more about what it’s like working for the Trade Remedies Authority and keep an eye on our Linkedin page for upcoming vacancies."
        },
        {
            "text": "We have over 140 people working with us in different professions across the business: investigators, analysts, lawyers, accountants and corporate service professionals. Our office is in Reading but we offer flexibility on where people work. 82% of our staff recommend the TRA as a great place to work. We have a friendly, supportive culture, where you will quickly get to know everyone on first names’ terms and where you will be helped to realise your full potential."
        }
    ]
}