{
    "url": "https://defrafarming.blog.gov.uk/2023/02/09/new-round-of-farming-equipment-and-technology-fund-grants-opening-soon/",
    "title": "New round of Farming Equipment and Technology Fund grants opening soon  ",
    "authors": [
        "Sarah Evered"
    ],
    "categories": [
        "Payments for equipment, technology and infrastructure",
        "Payments to improve animal health and welfare"
    ],
    "pub_date": "2023-02-09T12:56:17+00:00",
    "content": [
        {
            "text": "The Farming Equipment and Technology Fund  is part of the Farming Investment Fund.  "
        },
        {
            "text": "It offers grants for specific items of equipment to increase productivity, boost environmental sustainability and improve animal health and welfare. "
        },
        {
            "text": "Farmers, foresters and growers in England, including contractors to these sectors, can apply for a grant between £1,000 and £25,000. Grants go towards the cost of specific items from a prescribed list. "
        },
        {
            "text": "After a successful first round, the fund will open again later this month.  "
        },
        {
            "text": "Today, we published the full list of items available through the fund. In this post, I’ll explain what is available, when you can apply for a grant and provide links for you to find out more. "
        },
        {
            "heading": 2,
            "text": "Grants guidance "
        },
        {
            "text": "The Farming Equipment and Technology Fund 2023 is split into 2 themes:"
        },
        {
            "text": "Through feedback, you told us that having early sight of guidance helps you to better prepare your applications.   "
        },
        {
            "text": "So, today we published detailed guidance on GOV.UK. Lists of items can be found for both grants."
        },
        {
            "text": "Productivity and Slurry grant "
        },
        {
            "text": "Animal Health and Welfare grant "
        },
        {
            "text": "Each item has a score assigned to it based on our assessment of how well it meets the objectives of the scheme.  "
        },
        {
            "text": "If the scheme is oversubscribed, we will allocate funding to those items with the highest score first.   "
        },
        {
            "heading": 2,
            "text": "Expanding the list of items "
        },
        {
            "text": "We reviewed the list of items available in the first round with farmers, vets, academics and industry groups.  "
        },
        {
            "text": "As a result, we added: "
        },
        {
            "text": "The grants to co-fund investment in equipment, technology and infrastructure that improve animal health and welfare is part of the Animal Health and Welfare Pathway. We will publish more information on this very soon."
        },
        {
            "text": "Standard costs across all items have been also reviewed and grant rates adjusted accordingly. "
        },
        {
            "heading": 2,
            "text": "Applying for a grant "
        },
        {
            "text": "In the first round, those who applied for a grant received approximately 44% of the total cost. The fund proved very popular, and the first round was significantly oversubscribed. "
        },
        {
            "text": "We encourage anyone who was unsuccessful in the first round to apply again. "
        },
        {
            "text": "There are 2 separate ‘portals’ to apply for each grant: one for Productivity & Slurry, and one for Animal Health and Welfare. "
        },
        {
            "text": "When the window to apply opens, simply visit the online portal and answer questions for the types of grants you are applying for.  "
        },
        {
            "text": "A clear grant value is assigned to each item.  "
        },
        {
            "text": "The minimum grant is £1,000 per portal so the minimum investment for those wishing to apply across both portals remains as it did in the first round. "
        },
        {
            "text": "If your application is successful, you can then buy the item. You will be able to claim the reimbursement using your receipt. "
        },
        {
            "heading": 2,
            "text": "Stay informed"
        },
        {
            "text": "We'll publish updates here on the blog, so do subscribe for the latest. I'll share the link to subscribe in the box below."
        }
    ]
}