{
    "url": "https://educationinspection.blog.gov.uk/2023/02/09/ofsteds-webinars-for-schools-spring-season/",
    "title": "Ofsted's webinars for schools - spring season",
    "authors": [
        "Lee Owston, Acting National Director Education"
    ],
    "categories": [
        "curriculum",
        "education inspection framework",
        "inspection",
        "reading"
    ],
    "pub_date": "2023-02-09T12:29:04+00:00",
    "content": [
        {
            "text": "Lee Owston and Jonathan Keay invite you to hear directly from Ofsted on school inspection policy."
        },
        {
            "text": "We wanted to start by thanking everyone who attended or watched our schools webinars last year. It was fantastic to speak to so many of you directly. We hope we have addressed and clarified the areas of inspection that interest you and provided some reassurance about what inspectors will look at during a school inspection."
        },
        {
            "text": "Over the course of last year, we hosted 6 webinars looking at different aspects of school inspection. In these, we discussed:"
        },
        {
            "text": "Each webinar is available on YouTube for anyone who might have missed the live sessions. We also publish the slides from the sessions on our SlideShare channel."
        },
        {
            "text": "Following these webinars, we've received a lot of requests for further sessions on different topics. We're therefore pleased to announce that we will be carrying on the series this year."
        },
        {
            "text": "Throughout March, we will be running webinars on:"
        },
        {
            "text": "Please sign up for as many sessions as you wish at this link: https://bit.ly/OfstedWebinars."
        },
        {
            "text": "Due to restrictions on our webinar platform, we can only accommodate 1,000 attendees per live event. We therefore recommend joining the sessions early to avoid disappointment. We will also continue to publish the recordings of these sessions shortly after the event for those that are unable to attend."
        }
    ]
}