{
    "url": "https://companieshouse.blog.gov.uk/2023/02/09/race-equality-at-companies-house/",
    "title": "Race equality at Companies House",
    "authors": [
        "John-Mark (JM) Frost - Director of Transformation Delivery"
    ],
    "categories": [
        "People and culture",
        "Personal blog posts",
        "Working at Companies House"
    ],
    "pub_date": "2023-02-09T10:44:49+00:00",
    "content": [
        {
            "text": "One of the most important things that I feel sets Companies House apart from other organisations is our sense of family, combined with our desire to serve our customers as well as we can. Despite the challenges of COVID-19 and the need for organisational change to support legislative reform, it’s something we’ve worked hard to retain. A key part of that, I feel, is the sense of fairness and opportunity in the organisation - something that we are keen to maintain and expand."
        },
        {
            "heading": 2,
            "text": "Equality, diversity and inclusion"
        },
        {
            "text": "In our Equality, Diversity and Inclusion (EDI) strategy, we outline that EDI is the golden thread that runs through everything we do.  We want to make sure that we provide equal opportunities, and we’ve already taken great steps in creating an inclusive environment at the core of our organisational culture. We also recognise how integral diversity is to inclusive policy making, understanding our customers and widening organisational talent and innovation."
        },
        {
            "text": "But there is so much more that we can and should do to ensure an inclusive workplace."
        },
        {
            "text": "As a member of the executive team, I, along with my colleagues, believe that although EDI is the responsibility of everyone within an organisation, visible leadership around these matters is essential. As a team we’re all committed to EDI - championing it and making it a reality. But it’s not just us as the senior team. Leaders at all levels of the organisation need to role model our values and lead the way in promoting conscious inclusion and fair access to opportunities for all colleagues."
        },
        {
            "heading": 2,
            "text": "Our Race at Work charter"
        },
        {
            "text": "To reinforce the commitments we’ve made around EDI, and to help turn our ambition into a reality, in March 2021 Companies House became a signatory of the Business in the Community Race at Work Charter. In doing this we committed to improving racial equality in the workplace."
        },
        {
            "text": "The charter consists of 7 calls to action to make sure that ethnic minority employees are represented at all levels in an organisation:"
        },
        {
            "text": "By signing the charter, it sets out our clear pledges of what we are committing to do as an organisation to make sure we are focused on being diverse and inclusive."
        },
        {
            "text": "It’s my privilege to have been appointed as the Companies House executive sponsor for race and to chair the Race at Work charter sub-group. Meeting monthly, this group brings colleagues from across the organisation together to identify opportunities for progression, deliver the charter’s calls to action and make sure we deliver against our agreed aims and goals. The group looks to support and challenge current approaches in the organisation and identify gaps within our current practices. We raise awareness of the charter internally and engage with relevant colleagues to make sure that EDI is integral to policy development and service delivery."
        },
        {
            "text": "All our members recognise that we're on an exciting learning curve and are being given the opportunity to explore areas of the business that we may not have otherwise had contact with. We’ve been proactive in collating examples of work already underway and exploring the steps we can take to deliver on the calls to action, such as supporting processes for capturing ethnicity data to establish a baseline and measure progress."
        },
        {
            "heading": 2,
            "text": "Reverse mentoring"
        },
        {
            "text": "We’ve also run a successful reverse mentoring pilot programme, where we paired our executive board members with a mentor from our colleague-led equality networks."
        },
        {
            "text": "Being mentored by more junior colleagues allows senior leaders to gain new perspectives and broaden their understanding of the lived experiences of our people throughout the organisation and the challenges facing them. From an EDI perspective, it helps to build awareness of how someone experiences Companies House and their career differently, including the barriers they may have faced. It helps to create an inclusive culture where all experiences, skills and ideas are valued and utilised to their full potential."
        },
        {
            "text": "For me personally, I found it to be incredibly helpful and informative and it opened my eyes to the challenges and opportunities out there. I think I got as much from it as (I hope) my mentor did."
        },
        {
            "text": "We’re now introducing another programme across the wider organisation, recognising that not only did the programme benefit mentees, but it also provided a brilliant opportunity for mentors to develop leadership skills, build links across the organisation and be part of our cultural change."
        },
        {
            "text": "I’ve previously blogged about my own mixed heritage and background and my involvement with our faith, allyship, culture and ethnicity (FACE) network. I’ve been fortunate not to suffer the racism or challenges others have faced and continue to face. But that makes me even more determined to make sure that Companies House is a diverse organisation that celebrates our differences, learns from each other and enables everyone to bring their whole selves to work."
        },
        {
            "text": "The culture and ethos of what makes us special as Companies House is central to becoming the transformed organisation we will be in the future - delivering brilliant services through brilliant people."
        }
    ]
}