{
    "url": "https://queensawards.blog.gov.uk/2023/02/09/samarkand-celebrate-their-queens-awards-for-enterprise-in-international-trade/",
    "title": "Samarkand celebrate their Queen’s Awards for Enterprise in International Trade",
    "authors": [
        "The Queen's Awards for Enterprise"
    ],
    "categories": [
        "Advice",
        "International trade",
        "London",
        "Lord-Lieutenants",
        "Queen's Awards",
        "Uncategorized",
        "Winners"
    ],
    "pub_date": "2023-02-09T08:00:15+00:00",
    "content": [
        {
            "text": "In 2016 it was clear to entrepreneurs and co-founders David Hampstead and Simon Smiley that international brands were not capturing the full market opportunity in China. Together, they set out to build a business that would close the cultural, commercial, and technological gap between Western brands and Chinese consumers – thus, Samarkand Global was born. "
        },
        {
            "text": "Fast forward to 2023 when Samarkand, a leading provider in the China eCommerce space, was recognised with a Queen's Award for Enterprise in International Trade. "
        },
        {
            "text": "The Queen’s Award has allowed Samarkand to stand out as an exceptional contributor in this field, proudly delivering the expertise and technology that their customers have used to enter the market. As a global company with London and Shanghai offices, Samarkand has found the response to this achievement, both at home and abroad, staggering. The honour of a Queen’s Award is held in high regard by both national and international stakeholders, and they have seen first-hand how it can raise the profile of a business. "
        },
        {
            "text": "In August 2021, Samarkand Global decided to pursue the prestigious Queen's Award for Enterprise. They felt it had been a challenging time for all businesses yet the significant barriers they had to navigate over the past couple of years in the face of the pandemic only served to make The Queen’s Award process a more uplifting and beneficial experience. Samarkand completed the application, and finally, in March 2022, received the incredible news that Her Majesty The Queen had approved the Prime Minister’s recommendation that Samarkand should receive a Queen’s Award for Enterprise.  "
        },
        {
            "text": "They found there were many ways the company could highlight this accomplishment, not least through The Queen’s Award presentation ceremony. Samarkand was delighted to welcome Piers Storie Pugh OBE TD DL FRGS to their London office to formally present The Queen’s Award. The presentation ceremony, held on July 15th 2022, was a significant milestone for the company and brought the team together. With years of events cancelled and postponed due to COVID still fresh in their minds it was extra special to celebrate in person in the glorious July sunshine. Colleagues from all parts of the business, as well as a special guest, Stephen Hammond MP, joined the celebrations.  "
        },
        {
            "text": "On receiving the Award, David Hampstead, CEO, noted:  "
        },
        {
            "text": "Presentation day is a fantastic, unforgettable memory for the Samarkand Global team. To any business considering applying for a Queen’s Award, Samarkand would say it is a truly worthwhile endeavour and one you will continue to reap reward from for years to come. "
        },
        {
            "text": "Find out more about Samarkand Global here: https://www.samarkand.global/ "
        },
        {
            "text": "Contact The Queen's Awards for Enterprise helpline if you have any questions: queensawards@beis.gov.uk or 020 7215 6880 "
        }
    ]
}