{
    "url": "https://publicpolicydesign.blog.gov.uk/2023/02/09/what-does-policymaking-look-like/",
    "title": "What does policymaking look like?",
    "authors": [
        "Paul Cairney"
    ],
    "categories": [
        "PublicPolicyDesign",
        "Research"
    ],
    "pub_date": "2023-02-09T12:00:16+00:00",
    "content": [
        {
            "text": "Wouldn’t it be nice if policy scholars and professionals could have frequent and fruitful discussions about policy and policymaking? Both professions could make valuable contributions to our understanding of policy design in a wider political context."
        },
        {
            "text": "However, it is notoriously difficult to explain what policy is and how it is made, and academics and practitioners may present very different perspectives on what policymakers or governments do. Without a common reference point, how can they cooperate to discuss how to (say) improve policy or policymaking?"
        },
        {
            "text": "One starting point is to visualize policymaking to identify overlaps in perspectives. To that end, if academics and policymakers were to describe ‘the policy process’, could they agree on what it looks like?  To help answer this question, in this post I’m presenting some commonly-used images in policy research, then inviting you to share images that you would use to sum up policy work."
        },
        {
            "heading": 2,
            "text": "Why produce different images of policy processes?"
        },
        {
            "text": "One obstacle to a shared description is that we need different images for different aims, including:"
        },
        {
            "heading": 2,
            "text": "Why seek a common image? Would it help or hinder discussion?"
        },
        {
            "text": "If we have such different aims, is it (a) possible, and (b) desirable to produce an image that satisfies each aim? For example, it is possible but undesirable to use the policy cycle image to that end."
        },
        {
            "text": "This image may be shared by academics and practitioners, but it means something different each time:"
        },
        {
            "text": "In each case, the policy cycle image represents a confusing mix of (1) valuable to prompt further discussion, and (2) not valuable because it is so misleading. Indeed, even (one small part of) the European Commission presents a very different image, to superimpose an unwieldy mess onto the traditional cyclical image."
        },
        {
            "heading": 2,
            "text": "What images do academics use to explain complexity?"
        },
        {
            "text": "While an image of messy policymaking makes a simple point well (policymaking is far messier than the cycle suggests), it does not do much else. What other images convey this complexity while also providing specific insights to guide research or action?"
        },
        {
            "text": "Policy theories help to visualise complexity in a range of useful ways. What follows are some examples..."
        },
        {
            "heading": 2,
            "text": "Visualizing with metaphors"
        },
        {
            "text": "The multiple streams framework: much like a space launch, major policy change will not happen unless many requirements come together simultaneously. In policymaking, the requirements are: attention rises to a problem, a feasible solution already exists, and policymakers have the motive and opportunity to select it. Policy entrepreneurs may help, but as surfers riding a wave, not controllers of the sea (apologies for the mixed metaphors)."
        },
        {
            "text": "Take home message from image 1: ‘stages’ of a policy cycle matter, but the process (1) is not linear, and (2) does not lead inevitably to policy change."
        },
        {
            "heading": 2,
            "text": "Visualising data"
        },
        {
            "text": "Punctuated equilibrium theory: this image sums up the distribution of policy change in liberal democracies: there is a huge number of very small changes, and a very small number of huge changes. This distribution is akin to the frequency and magnitude of earthquakes! What is the cause? (1) Policymaker attention to problems does not relate strongly to (a) the size of the problem, or (b) the available information. (2) A lack of attention results - in most cases - in limited change (since high attention may be required to help overcome existing rules and practices)."
        },
        {
            "text": "Take home message from image 2: Policymaking is largely about governments managing existing policies which can change very little for long periods. Major changes can happen, but they are rare. They can be explained, but are not easy to predict."
        },
        {
            "heading": 2,
            "text": "Visualising important factors"
        },
        {
            "text": "The advocacy coalition framework flow diagram: people join ‘advocacy coalitions’ to turn their beliefs into policy and they compete with other coalitions to influence policy in subsystems (specialist networks of policymakers and influencers). Policy change relates to how coalitions manage internal dynamics (such as learning from policy failure) or deal with external events (such as a crisis or change of government)."
        },
        {
            "text": "Take home message from image 3: Most policy is processed in a large number of specialist policy networks, which are more or less insulated from the wider political system."
        },
        {
            "heading": 2,
            "text": "Visualising concepts in a non-threatening way"
        },
        {
            "text": "The blue turtle: - my aim is to introduce concepts in a visually pleasing way (to compete with the policy cycle). The image provides an introductory story about how policymakers deliberate and make choices (drawing on psychology to show how they frame problems and identify trusted sources of information) while surrounded by their policymaking environment (consisting of many policy actors spread across many venues, each with their own rules, networks, and reference points)."
        },
        {
            "text": "Take home message from image 4: Policy is processed by many different ‘centres’ – each with their own ways of working - rather than one single central government. The overall effect  cannot be summed up by one single cycle of activity, and the overall ‘policy mix’ does not emerge from one source."
        },
        {
            "heading": 2,
            "text": "What images do you find more useful?"
        },
        {
            "text": "My main aim has been to present these images to prompt discussion: what does each image say about how we describe policymaking, our role in policy processes, and how we would like others to understand what we do? Do you prefer other images, such as to describe the ‘strategic triangle’?"
        },
        {
            "text": "I would welcome your thoughts in the comments below. Or, if you have some valuable images to share, please send them to p.a.cairney@stir.ac.uk"
        }
    ]
}