{
    "url": "https://civilservice.blog.gov.uk/2022/05/25/getting-a-grip-on-civil-service-change/",
    "title": "Getting a GRIP on Civil Service Change",
    "authors": [
        "Jack Allman"
    ],
    "categories": [
        "A great place to work",
        "A Modern Civil Service",
        "A Skilled Civil Service",
        "An Ambitious Civil Service"
    ],
    "pub_date": "2022-05-25T08:33:48+00:00",
    "content": [
        {
            "heading": 3,
            "text": "If you're a civil servant, we want your ideas to help shape innovation and drive progress across the Civil Service."
        },
        {
            "text": "Around 58% of Civil Service staff are at grade EO and below, which equates to around 270,000 colleagues. We see junior staff in these grades as the beating heart and potential future leaders within the Civil Service. Therefore, we want your ideas, energy, and passion to help shape progress across the organisation."
        },
        {
            "text": "A few months ago, some Wales-based colleagues and I formed GRIP: Grass Roots Innovation Project. This project, led by me and others, includes a community of practice (more on that later) open to civil servants from grade AA to EO, anywhere in the UK, in frontline operational delivery roles."
        },
        {
            "heading": 4,
            "text": "What is involved?"
        },
        {
            "text": "GRIP will involve sharing best practice, encouraging innovative ideas, providing feedback and data to Civil Service leaders to improve workplace methods, and supporting progression for those staff members in grades AA to EO."
        },
        {
            "text": "The new and exciting community of practice was formed by a group from across the Civil Service, ranging from the Department for Work and Pensions to the Land Registry to the Driver and Vehicle Licensing Agency (DVLA). We are encouraging colleagues from all corners of the Civil Service to sign up and join us to help change the future for yourselves and others."
        },
        {
            "heading": 4,
            "text": "Community of practice"
        },
        {
            "text": "A community of practice (CoP) is a group of people who share a common concern, a set of problems, or an interest in a topic and who unite to fulfil both individual and group goals."
        },
        {
            "text": "There are many communities of practices within individual government bodies but not, until now, a collective one which everyone can access, designed to improve outputs/effectiveness? and deliver better customer service."
        },
        {
            "heading": 4,
            "text": "Closer together"
        },
        {
            "text": "Collaboration should be at the heart of all we do – It improves the way we work, helps us problem solve, and brings us closer together. But how often do you get to collaborate and network with other colleagues from departments from across the Civil Service?"
        },
        {
            "text": "Our newly formed network aims to ensure this is the future for the way the Civil Service works."
        },
        {
            "heading": 4,
            "text": "Gain new experiences"
        },
        {
            "text": "GRIP came about after several colleagues felt stuck in their roles and wanted to learn and gain new experiences which would help them towards their future career goals. We wanted to improve customer service in operational delivery across the Civil Service. It’s a bottom-up approach to innovation and change as opposed to top-down."
        },
        {
            "heading": 4,
            "text": "Our survey says…"
        },
        {
            "text": "We’ve completed a cross-government survey amongst our departmental colleagues and identified a few common operational delivery and customer service themes we would like to tackle. One common ask was for more opportunities within the department to gain diverse experience, particularly leadership experience. "
        },
        {
            "text": "We have the backing of numerous senior civil servants and are ready to make a difference in your futures!"
        },
        {
            "text": "Are you hungry to learn, develop and progress your career in the Civil Service? Would you value the opportunity to work in a cross-government team on a project that can have a positive impact on colleagues and citizens? Then join us at the GRIP launch event on 14 June, 12:15-12:45 (civil servants only)."
        },
        {
            "text": "‘Grass Roots Transformation and Change in the Civil Service’"
        },
        {
            "text": "Matt King, Non-Executive Director of the DVLA and formerly PwC’s UK Transformation Leader, will open the discussion by sharing his experience of empowering frontline staff to champion organisational change. After Matt’s presentation, a Q&A session will expand the discussion of grass roots innovation and change within the Civil Service."
        },
        {
            "heading": 4,
            "text": "Find out more"
        },
        {
            "text": "For more information on events or to join the GRIP mailing list for regular updates, you can email jack.allman@dwp.gov.uk, james.waddell@dvla.gov.uk or ronald.fezigha@justice.gov.uk "
        }
    ]
}