{
    "url": "https://defradigital.blog.gov.uk/2022/05/25/how-were-supporting-defra-to-adapt-to-blended-working/",
    "title": "How we’re supporting Defra to adapt to blended working",
    "authors": [
        "Christiaan Olivier"
    ],
    "categories": [
        "Defra services"
    ],
    "pub_date": "2022-05-25T09:37:18+01:00",
    "content": [
        {
            "text": "Christiaan Olivier, a Project Manager in the Defra MyWorkspace team, explains how the team has been working on a digital delivery project which is enabling Defra to transition to a blended working model, following the gradual lifting of Covid-19 restrictions over the past year."
        },
        {
            "text": "MyWorkspace is a project that encompasses software and mobile app development, as well as website design and development. We’ve been working on it for over a year."
        },
        {
            "text": "As more Defra colleagues have gradually begun returning to our Defra group workplaces, embedding a new hybrid working approach is critical to ensuring an even more inclusive and professional culture across our organisation."
        },
        {
            "text": "Under the new Defra blended working framework, as employees we have a degree of choice over when, where and how we work, in order to deliver our desired business outcomes and to meet customer and business needs."
        },
        {
            "text": "For many colleagues, this means working some of the time in a Defra group workplace, and some of the time from home, where this is possible and practical. For this approach to work though, a system needs to be in place that will enable Defra to combine the benefits of face-to-face interaction and collaboration, with the flexibility of working in a virtual way."
        },
        {
            "heading": 6,
            "text": "The front page of the MyWorkspace application."
        },
        {
            "heading": 2,
            "text": "Integrating desk and meeting room booking"
        },
        {
            "text": "Which is where our project comes in. Our role in moving Defra towards blended working has been to replace the previous room booking system, with a more integrated and capable application called MyWorkspace, that can do much more than just book rooms."
        },
        {
            "text": "The first phase of the project - enabling people to book desks, essentially our minimum viable product – was successfully completed in July last year. The next step involved integrating this new system with Microsoft Outlook to enable colleagues to book meeting rooms, using either MyWorkspace or their Outlook Calendar."
        },
        {
            "text": "More recently further functionality has been added, which means colleagues can also now book collaborative spaces, pool cars and bikes, electric charging spaces and visitor spaces."
        },
        {
            "text": "In the current phase of the project, we are working to add our Arm’s Length Body (ALB) organisations to MyWorkspace, so they too can book meeting rooms and desks in this way."
        },
        {
            "text": "Looking ahead Microsoft Teams integration will be implemented in the next couple of months, further enhancing the user experience to enable users to seamlessly include Teams in their meeting room bookings. This in turn aligns well with the new Visual Conferencing facilities which have been introduced, increasing our ability to hold hybrid, inclusive meetings."
        },
        {
            "heading": 2,
            "text": "Building trust and growing relationships"
        },
        {
            "text": "MyWorkspace is completely new technology, and Defra is the first organisation to be implementing this in the UK. Inevitably this brought some unique challenges. To mitigate and overcome these, maintaining a close relationship with our supplier has been key."
        },
        {
            "text": "Likewise, building trust with our customer – the Defra Facilities Management team. We worked closely together, demonstrating the importance of teamwork, open and transparent communication, and with plenty of humour thrown in!"
        },
        {
            "text": "In terms of stakeholders, during this project we’ve engaged with over 70 different stakeholder groups, due to the wider impact of the work and because Defra is such a large organisation. Which just underlines the importance of communication in delivering a project successfully."
        },
        {
            "heading": 2,
            "text": "People make projects work"
        },
        {
            "text": "It’s the people who make projects like this successful. Those involved need to feel they are being listened to, and support given where needed. This is where softer skills, such as empathy, emotional intelligence, coaching, and mentoring comes into play. The understanding of the need for different approaches, for example what works, for who, in such a diverse team, is key."
        },
        {
            "text": "It’s not all just about just delivering the project and meeting the deadlines. It’s also about listening, supporting, and working together. After all, to deliver any project successfully, people are the most important element to achieving that."
        },
        {
            "text": "Blended working reflects Defra’s broader strategy to reduce our environmental footprint by making the smartest use of our buildings, reducing our travel, and benefiting from IT to support smarter ways of working."
        },
        {
            "text": "Managing our workspaces differently, moving away from fixed spaces allocated to individual teams to the introduction of landing zones and a more fluid use of space, has been enabled through the introduction of these new digital booking tools such as MyWorkspace, that can be used both by individuals and teams."
        },
        {
            "text": "So, it feels good to have contributed to that, not least because ultimately, it’s giving our people choice. Being able to choose the best way of working and the right workspace for you, when you need it, whilst at the same time reducing the inflexibility of having fixed allocated areas which may not always be occupied, is more efficient for people and organisations."
        }
    ]
}