{
    "url": "https://educationhub.blog.gov.uk/2022/05/how-were-working-with-the-open-university-to-help-more-people-access-higher-and-technical-education-where-they-live/",
    "title": "How we’re working with the Open University to help more people access higher and technical education where they live",
    "authors": [
        "mediaofficer"
    ],
    "categories": [
        "Further education"
    ],
    "pub_date": "2022-05-25T14:41:58+01:00",
    "content": [
        {
            "text": "People are set to benefit from high-quality higher education in their hometown, as the Open University partners up with further education providers to create more training to fill skills gaps and raise job prospects."
        },
        {
            "text": "Here’s everything you need to know."
        },
        {
            "heading": 3,
            "text": "I can’t access the higher education or training course I want to take where I live – what are you doing to help?"
        },
        {
            "text": "The Open University will partner up with local colleges to offer high-quality higher education and training, so everyone has the chance to upskill wherever they live."
        },
        {
            "text": "Backed by £10 million in government funding, The Open University will work with colleges that do not currently offer higher education or training or want to expand the courses they offer, to help them put on a wider range of technical courses, supporting more people to secure jobs with higher wages and grow the economy to tackle the cost of living."
        },
        {
            "heading": 3,
            "text": "Who are these courses for? "
        },
        {
            "text": "The courses will be open to everyone."
        },
        {
            "text": "People wanting to train and upskill throughout their life will have access to a new type of higher education, focused on providing the higher-level skills that meet local need, shorter courses than degrees, and blended face-to-face and online learning."
        },
        {
            "text": "Students will have the confidence that they are receiving a qualification backed by The Open University, an institution with international recognition and prestige."
        },
        {
            "heading": 3,
            "text": "Why is this needed? "
        },
        {
            "text": "Colleges are the beating heart of local economies offering more options to study close to home will boost local businesses and job prospect for more people."
        },
        {
            "text": "Working with colleges will help to level up communities and opportunities for individuals, opening doors that would otherwise be closed."
        },
        {
            "heading": 3,
            "text": "When will I be able to apply for these courses? "
        },
        {
            "text": "The Open University will announce the initial participating colleges in the Autumn."
        },
        {
            "heading": 3,
            "text": "What else is the government doing to support higher and technical education?"
        },
        {
            "text": "Colleges and universities are also set to benefit from up to £32 million of additional funding so they can invest in equipment and facilities that will support technical studies, and boost training opportunities with businesses in key areas such as digital, construction and health care, available as part of the Higher Technical Education Skills Injection Fund."
        },
        {
            "text": "The funding announced today follows an £18 million investment last year which supported 100 further and higher education providers to invest in new equipment, such as virtual reality goggles and air quality testing equipment."
        },
        {
            "text": "The funding also helped them to boost links with local businesses so employers can tap into the talented workforce they need for the jobs of the future."
        },
        {
            "text": " "
        }
    ]
}