{
    "url": "https://insidehmcts.blog.gov.uk/2022/05/25/improving-the-criminal-justice-process-for-victims-and-witnesses/",
    "title": "Improving the criminal justice process for victims and witnesses",
    "authors": [
        "William Slade"
    ],
    "categories": [
        "Court and tribunal reform",
        "Crime"
    ],
    "pub_date": "2022-05-25T14:00:41+01:00",
    "content": [
        {
            "text": "Have you ever stopped to consider what the criminal justice system looks like through the eyes of a victim? Or a witness?"
        },
        {
            "text": "Our staff in courts, alongside volunteers from the Witness Service and other organisations, do so every day."
        },
        {
            "text": "\nSince the Victims Strategy was published by the government in 2018, we’ve continued work to improve the system for victims, including through the recent Victims Bill consultation."
        },
        {
            "text": "The Victims Bill aims to ensure that victims are at the heart of the criminal justice system, that the right support is available at the right time, and that if they choose to report their crime, the system will deliver a fair outcome."
        },
        {
            "text": "This work follows the refreshed Victims Code, introduced in April 2021, which provides victims with a simplified and stronger set of entitlements."
        },
        {
            "text": "We play a vital role in improving the criminal court process for victims and witnesses by working effectively with third sector organisations, like the Witness Service. We know that when people use the courts, it can often be at one of the most difficult points in their lives. The service we provide, alongside those of other support networks, can make all the difference to their experience."
        },
        {
            "heading": 2,
            "text": "Working with the Witness Service  "
        },
        {
            "text": "The Witness Service provides free, confidential, practical and emotional support for witnesses attending trials and hearings in every criminal court in England and Wales."
        },
        {
            "text": "The current provider is Citizens Advice. Its staff and volunteers support victims and witnesses to give their best evidence in court. Support is available to defence and prosecution witnesses as well as witnesses who are victims. It includes those who may be vulnerable and intimidated, and those who have been bereaved."
        },
        {
            "text": "Between April and December last year the service supported 65,000 witnesses, of which almost 29,000 were victims."
        },
        {
            "text": "We support the Witness Service by providing space in all our criminal court buildings and working together through regular meetings. In this way, we not only complement each other but also put the needs of victims and witnesses at the heart of everything we do."
        },
        {
            "heading": 2,
            "text": "In-court support"
        },
        {
            "text": "The Witness Service provides volunteers at all criminal courts across England and Wales. Alongside our court staff, they play a vital role in ensuring consistent and appropriate care is available when victims and witnesses attend court. They can tailor that support depending on individual needs."
        },
        {
            "text": "For example, with advance referrals, pre-trial support might involve a visit to the court before the trial date, to show witnesses where they’ll give their evidence, explain the process and discuss any specific needs or concerns. Enhanced support for vulnerable and intimidated witnesses can incorporate support away from the courthouse, guided by the witness in preparation for giving evidence."
        },
        {
            "text": "Not all victims or witnesses will be referred for support before they come to court but can access support on the day. Typically, this involves being met at court, answering questions about the court process, providing emotional support and advocating for their needs."
        },
        {
            "text": "All support is provided within a safe environment and separate waiting areas are provided for witnesses, away from any other people involved in the case. If further support is required, they can refer witnesses to specialist support organisations such as domestic abuse and sexual abuse support services."
        },
        {
            "text": "Fiona Beazer, Regional Manager for Citizens Advice Witness Service, commented:"
        },
        {
            "heading": 2,
            "text": "Stronger together"
        },
        {
            "text": "By working together to improve witnesses’ court experiences we can continuously improve the ways support is provided and continue to advocate for them. Our strong collaborative partnership meant we were more resilient and able to adapt quickly to the impacts of the pandemic."
        },
        {
            "text": "While HMCTS continued to hold trials, opened Nightingale Courts, made greater use of video and audio technology and introduced safety measures across our sites, the Witness Service also adapted. It provided remote support for witnesses, as well as ensuring that in-court support (including in Nightingale Courts) was COVID-secure."
        },
        {
            "text": "The partnership is equally invaluable in supporting witnesses with new ways of giving evidence. For example, vulnerable or intimidated witnesses can record their evidence before the full trial and away from the courtroom, through the pre-recorded cross examination special measure (section 28). We play the recording during the live trial, helping to make the experience less distressing for the person involved. It also means they don’t have to wait for the trial to present their evidence."
        },
        {
            "text": "We’ll continue to work with our partners and third sector agencies to support victims and witnesses in court. We’re committed to ensuring they remain at the centre of our conversations and enable us to provide support at the right time and in the right place."
        }
    ]
}