{
    "url": "https://deframedia.blog.gov.uk/2022/05/25/media-coverage-of-government-plans-to-introduce-genetic-technology-precision-breeding-bill/",
    "title": "Media coverage of Government plans to introduce Genetic Technology (Precision Breeding) bill",
    "authors": [
        "Defra Press Office"
    ],
    "categories": [
        "Farming",
        "Weekly stories"
    ],
    "pub_date": "2022-05-25T14:48:35+01:00",
    "content": [
        {
            "text": "There has been coverage this week in The Guardian, Daily Express, The Times, Daily Mail, Farmers Guardian, Farmers Weekly, the New Scientist and BBC News Online of the government’s plans to streamline rules governing genetic technologies for plants and animals."
        },
        {
            "text": "The Genetic Technology (Precision Breeding) bill is to be introduced in the House of Commons today and enables researchers to more quickly develop plants that are resistant to disease, pests and the effects of climate change. With 20-40 percent of global crops being lost to pesticides and disease every year, these changes represent a significant step towards securing our food supply for decades to come."
        },
        {
            "text": "This builds on previous legislative activity earlier in the year, which removed certain obstacles researchers faced when attempting to develop more resilient crops. The new regulations will create a category for genetically edited crops and animals, separate from those which govern genetically modified organisms (GMOs). This news follows this week’s announcement from the John Innes Centre of their plans to begin field trials on tomatoes gene edited to increase their Vitamin D levels."
        },
        {
            "text": "The bill is possible following the UK’s departure from the European Union and is the first step in securing our future food security as a nation. It will reduce the number of crops lost every year, enable healthier more resilient food to be grown, and continue the support of our world-leading scientific sector."
        },
        {
            "text": "Environment Secretary, George Eustice, said: "
        },
        {
            "text": "Defra’s Chief Scientific Adviser, Gideon Henderson, said:"
        },
        {
            "text": "Follow Defra on Twitter, and sign p for email alerts here."
        }
    ]
}