{
    "url": "https://environmentagency.blog.gov.uk/2022/05/25/reinvesting-in-our-fisheries-through-the-fisheries-improvement-programme/",
    "title": "Reinvesting in our fisheries through the Fisheries Improvement Programme",
    "authors": [
        "pressoffice"
    ],
    "categories": [
        "Uncategorized"
    ],
    "pub_date": "2022-05-25T16:00:23+00:00",
    "content": [
        {
            "text": "Chris Middleton, Fisheries Technical Officer, East Anglia explains how fishing licence income is reinvested in fisheries across England"
        },
        {
            "text": "Have you ever wondered how the Environment Agency invests fishing licence income? It is certainly something I often get asked by anglers and clubs here in East Anglia."
        },
        {
            "text": "Whenever this question comes up, one of the best examples I can give is the Fisheries Improvement Programme (FIP), designed to reinvest licence holder’s money into projects which benefit fisheries and anglers across the country."
        },
        {
            "text": "I have been lucky enough to have worked on FIP projects since the programme’s establishment in 2015, and have seen first-hand the benefits it can bring about, not only to angling but to wider habitat improvement."
        },
        {
            "text": "Within the programme, the Environment Agency and partners have improved long stretches of river and hundreds of hectares of stillwaters across the country. Over the past 12 months, more than £3.5 million has been invested through FIP, funding more than 100 projects, including habitat conservation to protect fish species and boost stocks, and improving accessibility by creating new fishing platforms, pathways and car parking."
        },
        {
            "text": "Ultimately these projects are about improving the environment for anglers and creating new opportunities. As a snapshot, since FIP was established, we have completed around 850 projects across the length and breadth of the country, with £6 million invested from fishing licence sales alone."
        },
        {
            "text": "We have worked with hundreds of different partners such as the local Rivers Trusts, the Wild Trout Trust and the Canal and River Trust. Angling Clubs can get involved too - many projects are completed with the help and assistance of local anglers."
        },
        {
            "text": "What really makes a difference is the match funding partners can bring to a project: they can apply for external grants or connect us with volunteers who are willing to use their free time to give back to the community. We are delighted to have received £2.9M in total match funding this year. It is also great to recognise that over the last 5 years we estimate the amount of match funding has been in the region £11.5M. Therefore, the total value of our investment has more than tripled, delivering significantly more benefits for fish and for our local anglers!"
        },
        {
            "text": "The variety of improvements are diverse, but some typical projects supported through FIP include:"
        },
        {
            "text": "In my patch of East Anglia, we spent almost £55,000 in 2021/22 on 16 local projects. The money has certainly been put to good use…"
        },
        {
            "text": "Every penny we receive in fishing licence money is reinvested into angling. The Fisheries Improvement Programme is all about using some of that money to improve fisheries, fish stocks and fishing, benefitting anglers up and down the country."
        },
        {
            "text": "By deciding to take up fishing and buy a licence, anglers will be contributing to fantastic local outcomes that will ultimately enhance their experience. The more people who go fishing, the more projects we can deliver!"
        },
        {
            "text": " "
        }
    ]
}