{
    "url": "https://hodigital.blog.gov.uk/2022/05/25/want-to-work-on-digital-services-at-the-heart-of-government-applications-for-the-home-office-digital-career-development-programme-are-now-open/",
    "title": "Want to work on digital services at the heart of Government? Applications for the Home Office Digital Career Development Programme are now open",
    "authors": [
        "Katrina Murphy, Product Manager"
    ],
    "categories": [
        "Digital Career Development Programme",
        "Recruitment"
    ],
    "pub_date": "2022-05-25T14:48:48+01:00",
    "content": [
        {
            "text": "I've always been interested in a digital career but having not come from a specialist digital background I wasn’t sure which profession I’d be suited to. When I saw the job advert for the Home Office Digital Career Development Programme (DCDP) I was interested in the Product Manager role straight away. The job description sounded exciting - I wanted to use my knowledge of user needs and business goals to frame problems and set priorities for delivery teams."
        },
        {
            "text": "I was conscious I had no direct experience in Product Management, so I attended an open evening to find out more and see if I would be a good fit for the role. The next thing I knew I was handing in my notice ready to start a new and exciting career!"
        },
        {
            "heading": 2,
            "text": "My work as a Product Manager is already having an impact"
        },
        {
            "text": "I joined the programme in January 2022 and so far I’ve had such a great experience."
        },
        {
            "text": "My first project has involved developing a new data and security incident reporting tool for Home Office staff. It was a steep learning curve at first, getting used to a new role and a new organisation. But with the support of my project team, manager, and mentors it didn’t take long to settle in."
        },
        {
            "text": "One thing I’ve appreciated the most is being encouraged to take on responsibility early and get stuck into the role. In such a short time I see that my work has had an impact, and it’s been really rewarding watching the work of our team come to life."
        },
        {
            "heading": 2,
            "text": "The Digital Career Development Programme at the Home Office"
        },
        {
            "text": "Being new to product management, I was aware I had a lot to learn. However, the programme really empowers you to take control of your own learning and development. We have allocated study time where we can learn more about the role and agile working. This has really helped my confidence grow and it’s been invaluable to then put my learning into practice."
        },
        {
            "text": "I've recently started working on a charity project, where different professions within the DCDP come together to build a product for a charity. This is a really rewarding project to work on, and I’m excited to see how our work will help the charity achieve their goals."
        },
        {
            "heading": 2,
            "text": "From programme to a permanent position"
        },
        {
            "text": "I’ll be rotating onto a new project shortly, which will help fill any gaps in my knowledge before I apply for a permanent position in the Home Office. I also have the support of my career mentor, who is guiding me through the whole process."
        },
        {
            "text": "Although I still have lots to learn, I’m looking forward to seeing where the next steps take me in my career."
        },
        {
            "heading": 2,
            "text": "Why join the Home Office?"
        },
        {
            "text": "The Home Office is the lead government department for immigration and passports, drugs policy, crime, fire, counter-terrorism and police.  It has been at the front line of keeping citizens safe and the country secure since 1782."
        },
        {
            "text": "Digital Data and Technology (DDaT) enables the Home Office to keep the UK safe and secure. We design and build the services that help people apply for visas or passports; support policing and counter-terrorism operations; and protect the UK’s borders. This is an exciting time to be at the Home Office. You’ll have a chance to shape the future and support our mission to deliver exceptional public services that work for everyone."
        },
        {
            "text": "You’ll receive a starting salary of £24,883 or £28,654 if you’re based in London (£30,817 or £35,954 for software engineering and test engineering interns) and you’ll get 25 days’ annual leave plus bank holidays."
        },
        {
            "text": "You’ll also be able to join the Civil Service pension scheme and will have access to other benefits such as flexible working options and season ticket loans."
        },
        {
            "heading": 2,
            "text": "What is the Digital Career Development Programme?"
        },
        {
            "text": "The Home Office DCDP offers an 18-month paid accelerated learning experience to those with a passion for user-centred digital services."
        },
        {
            "text": "You’ll follow a structured development path, tailored to your chosen role, with access to senior mentors and recognised qualifications. At the end of the placement, you’ll be able to apply for a permanent position at the Home Office."
        },
        {
            "heading": 2,
            "text": "Want to join us?"
        },
        {
            "text": "Applications are now live! We’re offering programmes in the following eight roles:"
        },
        {
            "text": "Product Manager"
        },
        {
            "text": "Software Engineer"
        },
        {
            "text": "DevOps"
        },
        {
            "text": "Content Designer"
        },
        {
            "text": "Interaction Designer"
        },
        {
            "text": "Service Designer"
        },
        {
            "text": "IT Operations"
        },
        {
            "text": "Automation Developer (opportunity for current Civil Servants only)"
        },
        {
            "text": " "
        },
        {
            "text": "How to apply:"
        },
        {
            "text": "You’ll need to apply on the Civil Service Jobs website."
        },
        {
            "text": "There are up to three stages in the recruitment process:"
        },
        {
            "text": "The Home Office is committed to attracting and retaining talent from diverse communities and so we follow the Guaranteed Interview Scheme (GIS). This means applicants with disabilities only need to meet the minimum qualifying criteria to progress to the telephone interview stage of assessment. You’ll be able to tell us about any reasonable adjustments you might need to complete any part of the recruitment process."
        },
        {
            "text": "If you’re offered a role, you’ll be put forward for security clearance. If you apply for security clearance you should usually have been continuously resident in the UK for five years."
        }
    ]
}