{
    "url": "https://environmentagency.blog.gov.uk/2025/12/11/bio-beads-what-are-they-what-are-they-used-for-and-what-risk-do-they-pose-to-the-environment/",
    "title": "Bio-beads: what are they, what are they used for and what risk do they pose to the environment? ",
    "authors": [
        "Environment Agency"
    ],
    "categories": [
        "Cleaner Seas",
        "Environment Agency",
        "Regulated industry",
        "Water",
        "Water Monitoring"
    ],
    "pub_date": "2025-12-11T14:07:33+00:00",
    "content": [
        {
            "text": "On the week of 3 November a vast number of small black plastic pellets started to wash up on the beach at Camber Sands in East Sussex. "
        },
        {
            "text": "It immediately, and naturally, drew considerable concern from the public and local community. We quickly started an investigation to understand where this plastic pollution came from, what it was, and who caused it.   "
        },
        {
            "text": "A lot of progress has been made and the pellets were swiftly identified as ‘bio-beads’."
        },
        {
            "text": "Southern Water have publicly apologised for a failure at their Eastbourne Sewage Treatment works, and the local authority, Rother District Council, has driven forward efforts to clean up the beach along with many committed volunteers.  "
        },
        {
            "text": "Sadly, despite huge efforts from volunteers, some of the beads are still in the sea and may continue to wash up along local beaches. However, a clear up plan is in place and resources identified to respond as that happens. "
        },
        {
            "text": "We are leading the investigation into what happened and why, and as part of that will consider what enforcement action is necessary. As a live investigation we cannot comment on any element of this investigation. We will also continue to support partners with advice and guidance on the clean-up operation.  "
        },
        {
            "text": "What are these small (approx. 5mm) plastic pellets, known as ‘bio-beads’, and what are they used for?  "
        },
        {
            "text": "They are called ‘bio-beads’ because they support the biological breakdown of sewage effluent when used in sewage treatment works, but they are not biologically active themselves.  Essentially, they just provide a surface for billions of microscopic bacteria to call home.  "
        },
        {
            "text": "In the wastewater treatment process, once solid matter has been removed, liquid sewage effluent is passed into aerated tanks containing millions of these beads. The bacteria living on them then get to work devouring the remaining organic matter in the liquid. "
        },
        {
            "text": "If the sewage effluent went directly into rivers or seas, without that treatment stage, naturally occurring bacteria would do the same. But as many bacteria require oxygen to break down the organic matter they would strip the oxygen from the local environment (as opposed to within the treatment works), potentially harming anything that needs oxygen to survive, like fish. "
        },
        {
            "text": "What are bio-beads made of and are they harmful? "
        },
        {
            "text": "Generally, plastic bio-beads will be made from a form of polyethylene, like High Density Polyethylene (HDPE). The sort of plastic you might find around the house or even in some food and drink packaging. They may be made from new or recycled plastic. Typically for bio-beads, which might be used for many years, the composition of the plastic used will be slow to degrade.  "
        },
        {
            "text": "Like all plastics, chemical additives are used in the manufacture of polyethylene which help give it the characteristics required for its intended use, such as strength, flexibility or durability. Over time some of these chemicals may eventually be released as the plastic degrades. If recycled plastic is used it may also contain other contaminants, such as metallic elements, from the original plastic. Whether these chemicals have a harmful impact in the environment will depend on the nature of the chemical, the concentration of that chemical and how long anything is exposed to it. Chemical levels released from such plastics are usually extremely low, but the risks increase where the chemicals are persistent, not readily diluted and exposure to wildlife is prolonged. "
        },
        {
            "text": "There is a more immediate physical risk to wildlife from plastics in the environment. Bio-beads are small so could be easily swallowed by wildlife if they were mistaken for food. If not subsequently rejected or released, then they could build up and cause a physical hazard in the stomach or gut resulting in the deterioration or death of the animal.   "
        },
        {
            "text": "As they float, bio-beads will also disperse with any water currents and so are likely to spread over a considerable area. Sadly, any release of bio-beads to the water environment adds to the already huge burden of plastic pollution in the water environment today. The United Nations Environment Programme (UNEP) has estimated that every year, worldwide, 19-23 million tonnes of plastic waste leak into aquatic ecosystems, polluting lakes, rivers and seas.  "
        },
        {
            "text": "Why are bio-beads used and are there alternatives? "
        },
        {
            "text": "Plastic bio-beads are an effective and lightweight option to provide a large surface area for bacteria to break down organic material in sewage effluent. Bio-beads are not used in all sewage treatment works but may be useful where there are physical constrictions on a site. Their use is decreasing however as water companies invest in new technologies to treat sewage. There are alternative materials for beads which have been used, such as glass or clay and some treatment plants use other processes to treat their effluent, such as fixed filters. "
        },
        {
            "text": "What is our role in the regulation and use of bio-beads? "
        },
        {
            "text": "Our primary concern for the use of bio-beads in industry is ensuring that those beads are contained within any works, managed appropriately, and not allowed to escape to the environment. "
        },
        {
            "text": " We have been increasingly concerned about the instances of bio-beads appearing on beaches having been lost from industrial processes by various routes. This is unacceptable and industry must take responsibility to prevent this happening. If beads are allowed to escape into the environment from water treatment processes for example, water companies should immediately report this to us as a pollution incident, and we will not hesitate to take enforcement action where appropriate.  "
        },
        {
            "text": "If you suspect pollution from bio-beads or any other pollutant we encourage you to call our free 24-hour hotline 0800 807060. "
        }
    ]
}