{
    "url": "https://defrafmp.blog.gov.uk/2025/12/11/lobster-size-rules-are-changing-heres-what-you-need-to-know/",
    "title": "Lobster size rules are changing – here’s what you need to know",
    "authors": [
        "Shellfish FMP policy team, Defra"
    ],
    "categories": [
        "- Defra led FMPs",
        "Implementation"
    ],
    "pub_date": "2025-12-11T15:00:00+00:00",
    "content": [
        {
            "text": "Marine Management Organisation (MMO) and Defra will be introducing a new national minimum conservation reference size (MCRS), also known as theminimum landing size, for European lobster (Homarus gammarus), increasing it from 87mm to 90mm, as committed in the 2023 crab and lobster fisheries management plan.From 1 March 2026, the new MCRS for lobster will be:"
        },
        {
            "heading": 2,
            "text": "Why is this happening?"
        },
        {
            "text": "This increase is one of the first of the proposed ‘initial management interventions’, or early actions to be taken, in the crab and lobster fisheries management plan (FMP)."
        },
        {
            "text": "It’s designed to:"
        },
        {
            "text": "Scientific assessments from Cefas (the Centre for Environment, Fisheries and Aquaculture Science) show that an increased MCRS will improve English lobster stocks in the long-term. Moving to a 90mm MCRS will support a healthier fishery."
        },
        {
            "text": "Stakeholders told us in the FMP consultation that economic impacts could be high for inshore fishers, particularly in the North East. We committed in the government response to consider ways to lessen the impacts, like using a phased approach."
        },
        {
            "text": "We also considered economic and biological factors and held two meetings with fishermen in Whitby and Amble to discuss the approach. The decision to phase the increase over 3 years was taken to balance the stock and economic needs of the fishery."
        },
        {
            "heading": 2,
            "text": "What's changing and when?"
        },
        {
            "text": "The new size limit will first be applied through a license condition for commercial fishermen licensed and fishing in English waters.It will then be moved into legislation later in 2026 (subject to parliamentary timings) to apply to all commercial and recreational fishermen in English waters."
        },
        {
            "text": "Here’s how it will roll out:"
        },
        {
            "heading": 3,
            "text": "South West England – Increase to 90mm on 1 March 2026"
        },
        {
            "text": "A 3mm increase to 90mm will be applied through a license condition on 1 March 2026."
        },
        {
            "text": "Inshore rules in Cornwall, Isles of Scilly, and Devon and Severn IFCA districts already require a 90mm minimum size. So, this change will align offshore rules with existing inshore ones, making things clearer and fairer."
        },
        {
            "text": "This applies to all vessels fishing in English waters  west of 2°56.78’W and south of 52°0.0’N, from the high-water mark out to the UK’s Exclusive Economic Zone (EEZ)."
        },
        {
            "heading": 3,
            "text": "Rest of England – phased over three years"
        },
        {
            "text": "To help fishers adjust and reduce economic impacts, the increase will happen gradually:"
        },
        {
            "text": "This phased approach was shaped by feedback from fishermen, IFCAs, Cefas, and scientific advisory groups. A longer five-year phase-in was considered but not chosen, as it would delay the benefits to lobster stocks without significantly reducing short-term impacts."
        },
        {
            "heading": 2,
            "text": "What's next?"
        },
        {
            "text": "Licences will be updated to reflect the changes from 1 March 2026."
        },
        {
            "text": "Defra, with the support from MMO and stakeholder groups will be moving forward to develop new fishing effort management to support the sustainability of the crab and lobster fishery."
        },
        {
            "heading": 2,
            "text": "Find out more"
        },
        {
            "text": "If you want to find out more, check out the updates on the crab and lobster FMP on the FMP blog and find regional information on the Regional Fisheries Groups - GOV.UK page."
        },
        {
            "text": " If you have any questions, contact MMO and Defra’s teams by email:"
        }
    ]
}