{
    "url": "https://defrafmp.blog.gov.uk/2025/12/11/minimum-brown-crab-size-backed-by-south-west-fishermen/",
    "title": "Minimum brown crab size backed by South West fishermen",
    "authors": [
        "Fisheries Management Team, Marine Management Organisation"
    ],
    "categories": [
        "Implementation"
    ],
    "pub_date": "2025-12-11T12:20:17+00:00",
    "content": [
        {
            "text": "Brown crab (Cancer pagurus, also called edible crab) is a species found in the crab and lobster fisheries management plan (FMP).  It’s a non-quota species, meaning fishing of these stocks is not currently subject to catch limits."
        },
        {
            "heading": 2,
            "text": "Changes in the South West from 1 February 2026"
        },
        {
            "text": "The species is important for many fishers in the South West, especially for the smaller inshore fleet."
        },
        {
            "text": "To support the stock, a harmonised minimum conservation reference size (MCRS), also known as minimum landing size (MLS), will come into place to align the offshore and inshore sizes."
        },
        {
            "text": "This will be done through a fishing vessel licence condition and will apply to all UK and EU commercial vessels fishing in South West English waters (west of 2°56.78W and south of 52°0N) - see boundaries in the map below."
        },
        {
            "text": "From 1 February the minimum size that can be landed will be:"
        },
        {
            "text": "🦀 160 mm for male brown crabs"
        },
        {
            "text": "🦀 150 mm for female brown crabs"
        },
        {
            "text": "This means fishermen can only keep crabs this size or above, and must return any that are smaller to the sea."
        },
        {
            "heading": 2,
            "text": "How did we get here?"
        },
        {
            "text": "When it was published in December 2023, the FMP proposed new measures including a trial of management options in the South West crab fishery."
        },
        {
            "text": "Defra commissioned us, the Marine Management Organisation (MMO) to work on this."
        },
        {
            "heading": 2,
            "text": "Working together"
        },
        {
            "text": "Seafish and MMO set up the South West Crab Trial Group with members including fishermen, regulators, and other experts."
        },
        {
            "text": "The group looked at many options, but one measure stood out, which was making the MCRS the same across the region."
        },
        {
            "heading": 2,
            "text": "Why a regional MCRS is good"
        },
        {
            "text": "• More female crabs can spawn, helping crab numbers grow.• One clear rule to follow makes things easier for everyone.• Introduces management on a regional scale."
        },
        {
            "heading": 2,
            "text": "Stakeholder views"
        },
        {
            "text": "The option was proposed to stakeholders in a survey in August 2025."
        },
        {
            "text": "Fishermen and others in the industry shared their views and out of 78 responses, over 80% said they liked the proposal."
        },
        {
            "text": "You can find a summary of the survey and document on the decision to progress the proposal on GOV.UK: South West Regional Fisheries Group."
        },
        {
            "heading": 2,
            "text": "What’s next?"
        },
        {
            "text": "The MCRS in the South West will be brought in through a fishing vessel licence condition, starting on 1 February 2026."
        },
        {
            "text": "Defra, with the support from MMO and the Crab and Lobster Implementation Group (CLIG) are now starting work on the medium- and long-term goal of looking at crab and lobster fishing effort. This will build on work completed for the South West and North East trials."
        },
        {
            "heading": 2,
            "text": "Find out more"
        },
        {
            "text": "If you want to find out more, check out the updates on the crab and lobster FMP on the FMP blog and find regional information on the South West Regional Fisheries Group page on GOV.UK."
        },
        {
            "text": "If you have any questions, contact MMO and Defra’s teams by email:"
        },
        {
            "text": "• MMO FMP team: FMP@marinemanagement.org.uk• Defra Shellfish policy team: shellfish@defra.gov.uk"
        }
    ]
}