{
    "url": "https://mhclgmedia.blog.gov.uk/2025/12/11/national-plan-to-halve-long-term-rough-sleeping-and-prevent-homelessness/",
    "title": "National plan to halve long-term rough sleeping and prevent homelessness",
    "authors": [
        "mhclgpress"
    ],
    "categories": [
        "Homelessness"
    ],
    "pub_date": "2025-12-11T13:22:21+00:00",
    "content": [
        {
            "text": "There has been widespread, national print and broadcast coverage, alongside extensive positive stakeholder reaction, on the Ministry of Housing, Communities and Local Government’s cross-government plan to prevent homelessness and rough sleeping."
        },
        {
            "text": "The strategy is backed by £3.5 billion of investment and is informed by people with lived experience, frontline workers and the sector, and puts real world insight into action."
        },
        {
            "text": "The plan has been positively welcomed by various stakeholders including homelessness charities including St Mungo’s, Shared Health Foundation, Justlife, Revolving Doors, Centrepoint, St Basils and the Lived Experience Forum."
        },
        {
            "text": "The Mirror leads with the story as its splash on its front page, leading with the fact that the ‘scandal’ of homelessness will be halved by 2030 under the strategy, highlighting the three key pledges which include halving the number of long-term rough sleepers, ending the unlawful use of B&B’s for families, and preventing more families from becoming homeless in the first place."
        },
        {
            "text": "Meanwhile, the Guardian reports on their interview with the Minister McGovern and coverage can be seen in Sky, the Big Issue, the I paper and Politico London Playbook who highlight the reception from MP’s and stakeholders."
        },
        {
            "text": "This morning, Homelessness Minister, Alison McGovern, also gave interviews to Times Radio, Sky News, LBC, Bauer, ITV Good Morning Britain, ITN, and GB News to talk about the impact the measures will have and how it will support the most vulnerable in our society to find their feet and improve their lives.  "
        },
        {
            "text": "Housing Secretary Steve Reed said:   "
        },
        {
            "text": "“Homelessness is one of the most profound challenges we face as a society, because at the heart, it’s about people. Families deserve stability, children need a safe place to grow, and individuals simply want the dignity of a home.  "
        },
        {
            "text": "“This strategy is shaped by the voices of those who’ve lived through homelessness and the frontline workers who fight tirelessly to prevent it.   "
        },
        {
            "text": "“Through our new strategy we can build a future where homelessness is rare, brief, and not repeated. With record investment, new duties on public services, and a relentless focus on accountability, we will turn ambition into reality.”  "
        },
        {
            "text": "Homelessness Minister Alison McGovern said:      "
        },
        {
            "text": "“Everyone deserves a roof over their head.  And for those experiencing the worst of homelessness right now – our children – they deserve a place to play and a bedroom to do their homework in. It’s our collective responsibility to make that a reality, for anyone at risk of homelessness, be it sofa-surfing or getting stuck on the streets.  "
        },
        {
            "text": "“By working together including government, local leaders, charities, and communities, we can stop homelessness before it happens and ensure that when people do fall into crisis, support is swift and effective.    "
        },
        {
            "text": "The prize is big.  Right now, taxpayers are paying the price of failure, with temporary accommodation costs skyrocketing.  And the next generation of British young people can’t succeed without the space they need. "
        },
        {
            "text": "“This strategy sets us on a better path – to save money and change lives.” "
        },
        {
            "text": "Emma Haddad, Chief Executive of St Mungo’s, said:  "
        },
        {
            "text": "“The homelessness strategy published today is a watershed moment and is strongly welcomed by St Mungo’s. Homelessness has no place in modern society. The ambition set out today offers the start of a blueprint for ending homelessness and rough sleeping for good. There is no time to lose, we hope the strategy will galvanise decisive action from the whole system.    "
        },
        {
            "text": "“After 15 years of almost consistent rises in the number of people being affected by homelessness, we are relieved to see the Government recognising the scale of the crisis and the pressing need to address it.  Last year St Mungo’s supported over 26,000 out of homelessness. We see how damaging even a single night on the streets can be, and how quickly that one-off crisis can turn into a complex cycle of homelessness. The new targets need to focus all our minds.  "
        },
        {
            "text": "“We welcome the focus on prevention as well as on long-term rough sleeping.  We also particularly welcome the new ‘duty to collaborate’; there is a huge opportunity to end the needless homelessness that we see from people leaving hospitals, prisons and asylum accommodation through joining up how government agencies work together.  And we are very pleased to see the continuing commitment to utilise the knowledge, expertise and experience of frontline organisations like St Mungo’s and the lived experience of our clients to help inform the way forward.” "
        },
        {
            "text": "Dr Laura Neilson, Chief Executive, Shared Health Foundation, said:  "
        },
        {
            "text": "\"It is heartening to see that ministers have heard the plight of the record number of children and families who are homeless. Alongside the child poverty strategy this strategy is ambitious in reducing the impact of homelessness on families. We urge the government to continue to show brave leadership and look forward to working together to go faster and beyond what is outlined today. Homelessness should be rare, brief and non recurring and is not detrimental to the life chances of children and young people\". "
        },
        {
            "text": "Simon Gale, CEO at Justlife, part of the Lived Experience Forum, said: "
        },
        {
            "text": "“This strategy sets out some important steps that reflect what people living in temporary accommodation need most: earlier support, safer places to stay and services that work together rather than in silos. The investment in prevention and frontline capacity is especially crucial at a time when more households are being pushed into crisis. "
        },
        {
            "text": "“There is still a long way to go, but this is a crucial step forward. Long stays in poor-quality temporary accommodation remain far too common, and the supply of genuinely affordable homes must grow if we’re serious about lasting change. We’re ready to work with government and local partners to make sure these commitments translate into real improvements for the people who need them most.” "
        },
        {
            "text": "Balbir Kaur Chatrik, Director of Policy and Prevention at Centrepoint, said: "
        },
        {
            "text": "\"We have seen record levels of youth homelessness so it’s very welcome to see government looking at young people specifically. "
        },
        {
            "text": "“This is a multi-faceted issue and, while on the one hand, there is an urgent need to support those without anywhere safe or stable to stay, we can only solve this crisis by supporting those who may face similar circumstances in the future. The emerging evidence is quite clear that working in schools can identify children who would have otherwise remained hidden and have a positive impact on their risk of homelessness. "
        },
        {
            "text": "“That is why the government’s plans to create a duty to collaborate and support in-school prevention, modelled on Centrepoint's Upstream England pilot, has the potential to be a game-changing development. We are hugely excited to continue working with the government and our partners to reach as many vulnerable children as possible.” "
        },
        {
            "text": "Revolving Doors on behalf of the National Expert Citizens Group (NECG), said:  "
        },
        {
            "text": "“Members of the National Expert Citizens Group have experienced the cycle of trauma and hopelessness that homelessness brings. They know it as more than just a policy problem: for them and thousands of others, it’s something far more personal. We are therefore pleased to see their voices and insights reflected in the strategy and welcome the Government’s recognition of the scale of the homelessness crisis. We share their ambition in tackling this issue so that people can rebuild their lives with hope and dignity.” "
        },
        {
            "text": "Jean Templeton, Chief Executive, St Basil's said:"
        },
        {
            "text": "“The adoption of a National Plan to End Homelessness is very welcome and in particular, the recognition of collective responsibility across government, systems, and sectors for enabling positive life course experiences. The Duty to Collaborate will move beyond a Duty to Refer and hopefully lead to Inclusion being designed into mainstream systems helping to prevent the ultimate exclusion that is homelessness.” "
        },
        {
            "text": "Rachel Brennan, Director of Participation, Progression & Change at Groundswell, part of the Lived Experience Forum said:"
        },
        {
            "text": "\"We welcome the commitment to involving people with lived experience in the design and implementation of the strategy. When people with lived experience help shape solutions alongside systems and services the solutions are stronger, more compassionate and more effective. It is encouraging to see recognition of how closely homelessness is linked to our health and the important shift in ensuring that people are not discharged from hospitals or other services into crisis. The focus on collaboration and cross-sector working is a vital step forward recognising everyone has a role to play in ending homelessness.\" "
        }
    ]
}