{
    "url": "https://ipo.blog.gov.uk/2025/12/11/paws-patents-and-protection/",
    "title": "Paws, patents and protection  ",
    "authors": [
        "Rachel Gilmore"
    ],
    "categories": [
        "Design",
        "Design right",
        "Innovation",
        "Patents"
    ],
    "pub_date": "2025-12-11T10:00:00+00:00",
    "content": [
        {
            "text": "I love dogs, and the number of products that exist out there now makes owning a dog all the more enjoyable.  "
        },
        {
            "text": "We adopted a rescue bulldog named Rosa just over two years ago, and she quickly became the love of our lives. From the very first day, it felt like she knew she was finally home. She’s a curious little thing and rummaged through everything in her path, grabbed a toy and raced around the coffee table with pure delight (nearly sending our coffees flying in the process).  "
        },
        {
            "text": "She’s a bundle of joy, always eager for walks, naps and most of all, food.  "
        },
        {
            "heading": 3,
            "text": "Designs for hungry pups "
        },
        {
            "text": "Her love of food, however, came with a challenge. She used to eat her food so quickly that one day she struggled to swallow it, and we had a terrifying moment where she seemed to be choking. She toppled onto her side, her legs moving as if she were running, but thankfully that motion dislodged the food and she was fine, but it gave us quite a scare! We soon looked into how to perform the Heimlich Maneuver on a dog, which is really handy to know! "
        },
        {
            "text": "Since then, we’ve invested in a slow feeder bowl, which has been a lifesaver, literally. This registered design (GB6263701) protects the visual appearance of a slow feeder dog bowl, featuring raised obstacles and compartments that help prevent pets from gulping their food too quickly. The distinctive structure combines safety with practicality, making mealtimes much safer for dogs prone to bloat."
        },
        {
            "text": "Although Rosa sometimes gets frustrated and flips the bowl across the floor to get to her food faster, it still does its job of slowing down her eating."
        },
        {
            "heading": 3,
            "text": "The long and short of lead innovation "
        },
        {
            "text": "She can sometimes feel a little anxious around other dogs, so we use a retractable lead to walk her with. This allows her the freedom to explore on her walks, while still giving us full control if another dog comes too close.  Interestingly, a patent for this type of retractable pet lead was filed by Philip Martin Nicholson in 1977 (GB1546235A )"
        },
        {
            "text": "Because she can be a little anxious, we often bring along a snuffle mat to keep her happily occupied at bars and restaurants. For car journeys, we also use a specially designed travel water bowl (Patent GB2428551B) invented by Natalie Ellis. The bowl's floating inner section and liquid feed holes prevent spills when we're on the move, keeping both Rosa hydrated and our car seats dry!"
        },
        {
            "heading": 3,
            "text": "Sniffing out the fakes "
        },
        {
            "text": "It’s not just toys and accessories where intellectual property matters, it also plays a vital role in keeping our pets safe with medicines and treatments. Sadly, there are people who try to cut corners with cheap, unsafe products just to make a profit and this puts our pets at great risk which is not ok. This campaign explains all about that. So next time you’re shopping for products for your pet, take a moment to make sure it’s the real deal and not a fake alternative – it could save your pets life! "
        },
        {
            "text": "I’ll wrap up by saying just how much adopting Rosa has transformed our lives for the better. She fills our days with endless joy, greeting us with excitement and love (even when we’re at our worst). Adopting Rosa has been one of the most rewarding decisions we’ve ever made. "
        },
        {
            "text": "But dogs are for life, not just for Christmas! They require a lot of time, effort and commitment, but the love and companionship they offer in return are second to none. When you adopt, you’re not just giving a dog a second chance, you’re also getting a best friend for life which is exactly why adoption is one of the best things you can do if you ever get the chance.  "
        }
    ]
}