{
    "url": "https://naturalengland.blog.gov.uk/2025/12/11/rethinking-how-we-approach-the-design-of-reservoirs/",
    "title": "Rethinking how we approach the design of reservoirs",
    "authors": [
        "Jacqui Jobbins"
    ],
    "categories": [
        "Climate change",
        "Development",
        "Evidence",
        "Green Infrastructure",
        "Growth",
        "Landscape",
        "Natural England"
    ],
    "pub_date": "2025-12-11T10:01:53+00:00",
    "content": [
        {
            "text": "By Jacqui Jobbins, Landscape Senior Specialist, Natural England"
        },
        {
            "text": "As our climate changes and demand for water grows, water companies across the country are planning new reservoirs and expanding existing ones. But these projects aren’t just about storing water – they’re also a chance to create beautiful, nature-rich places that benefit both people and wildlife."
        },
        {
            "heading": 4,
            "text": "A new way of thinking: The landscape-led approach"
        },
        {
            "text": "When we talk about a landscape-led approach, we mean designing with the land, not just on it. It’s about understanding the unique character of a place – its natural features, history, and how people connect with it – and using that understanding to shape how new developments, like reservoirs, are planned and built."
        },
        {
            "text": "When we think of reservoirs, we often picture vast bodies of water quietly storing the supply we rely on for drinking, farming, and industry. But behind every reservoir lies a deeper story — one of transformation, trade-offs, and potential."
        },
        {
            "text": "No matter how big or small, every reservoir reshapes the landscape around it. The ecosystems that once thrived in these spaces are disrupted, and the natural balance shifts. It’s a reality that can’t be ignored."
        },
        {
            "text": "While these changes are inevitable, in the longer term they don’t have to be destructive. With thoughtful, landscape-led design, reservoirs can do more than just store water — they can become hubs of ecological resilience. Imagine a reservoir that not only meets our water needs but also supports wildlife, restores degraded land, and creates new green spaces for communities to enjoy."
        },
        {
            "heading": 4,
            "text": "What are the ‘Reservoirs in the Landscape: Design Principles’?"
        },
        {
            "text": "To support this way of thinking, Natural England and the APEM Group have created a publication called ‘Reservoirs in the Landscape: Design Principles.’"
        },
        {
            "heading": 4,
            "text": "Why it matters"
        },
        {
            "text": "When it comes to building new reservoirs, it’s not just about storing water – it's about how these structures fit into the landscape around them. That’s why the new Reservoir Design Principles take a landscape-led approach, focusing on how water infrastructure can work in harmony with nature."
        },
        {
            "text": "To help shape this vision, Natural England brought together water companies and regulators, national landscape organisations, environmental non-government organisations and Local Planning Authorities. Their combined expertise has helped to shape the Reservoir Design Principles and will ensure that future reservoirs are not only practical and efficient, but also enhance the character and beauty of the places they’re built in."
        },
        {
            "text": "The publication encourages developers to think beyond function and consider how reservoirs can contribute to the wider landscape. It is not a rulebook, but a set of principles that complement existing policies and help unlock the full potential of these projects."
        },
        {
            "text": "Reservoirs are large and often transformative developments. Done well, they can become valued parts of the landscape – places where people walk, sail, fish, or simply enjoy nature. Many existing reservoirs have already become beloved local landmarks."
        },
        {
            "text": "With today’s challenges—like climate change, biodiversity loss, and the need for sustainable infrastructure—we have a unique opportunity. By designing reservoirs that work with the landscape, we can deliver water security and create places that support nature and bring joy to communities."
        },
        {
            "heading": 4,
            "text": "Who is it for?"
        },
        {
            "text": "It’s a practical resource for anyone involved in designing reservoirs – from engineers and planners from the water industry to landowners and local communities."
        },
        {
            "text": "While the publication is aimed primarily at the water industry, it’s also useful for:"
        },
        {
            "text": "It can be used at every stage of a reservoir project – from early planning and feasibility studies to design, construction, and long-term management. It’s also flexible enough to apply to smaller projects or the repurposing of existing reservoirs."
        },
        {
            "heading": 4,
            "text": "Want to know more?"
        },
        {
            "text": "We’re excited to invite professionals working in the water sector, protected landscapes, Local Planning Authorities and environmental national government organisations to an upcoming webinar focused on the Reservoir Design Principles. If you’re interested in joining us, please email clare.foster@naturalengland.org.uk"
        },
        {
            "text": "Read more: ‘Reservoirs in the Landscape: Design Principles.’"
        }
    ]
}