{
    "url": "https://educationinspection.blog.gov.uk/2025/12/11/school-inspections-frequently-asked-questions/",
    "title": "School inspections: frequently asked questions",
    "authors": [
        "Lee Owston, National Director, Education"
    ],
    "categories": [
        "education inspection framework",
        "schools"
    ],
    "pub_date": "2025-12-11T12:52:25+00:00",
    "content": [
        {
            "text": "Since we published the renewed inspection framework on 9 September 2025, we’ve put on lots of online and face-to-face engagement with schools to answer your questions. We’re publishing the most frequently asked questions below, so you can see all the answers in one place."
        },
        {
            "text": "We’ll regularly update this as we continue to inspect with our renewed approach, so do bookmark it and check back in future."
        },
        {
            "text": "If you want to watch any of our webinars, you can find them on our YouTube playlist."
        },
        {
            "heading": 2,
            "text": "1. When will my school be inspected?"
        },
        {
            "text": "When your school is due to be inspected is based on a number of factors, including its previous inspection outcome."
        },
        {
            "text": "We’ve published a video on inspection timing for schools to explain when your school will be inspected. Timings for 9 out of 10 schools (those judged ‘good’ or ‘outstanding’ at their last inspection) are covered in the opening minute of the video."
        },
        {
            "text": "We also have a school monitoring operating guide for inspectors, which sets out how we will monitor schools where one or more evaluation areas have been graded ‘needs attention’ or ‘urgent improvement’ in the latest inspection."
        },
        {
            "heading": 2,
            "text": "2. Who can take on the role of nominee and what do they do? "
        },
        {
            "text": "The nominee is a new role on all school inspections. We explain the role of the nominee in our inspection guidance."
        },
        {
            "text": "When you’ve decided who might be the nominee for your school, you can watch our nominee training video."
        },
        {
            "heading": 2,
            "text": "3. What happens on the planning call?"
        },
        {
            "text": "The planning call is important to help the lead inspector understand the structure, organisation and context of your school, as well as its strengths, successes and priorities."
        },
        {
            "text": "It’s helpful if you have key leaders and the nominee (if you have one) present for the planning call. To ensure we build professional working relationships from the very start of an inspection, we always offer to do the planning call as a video call. This has worked particularly well on our pilot inspections."
        },
        {
            "text": "Our inspection information for state-funded schools explains how we notify you of an inspection and what information we’ll need for the planning call. See the sections:"
        },
        {
            "text": "Our school inspection operating guide for inspectors sets out what inspectors need to do when it comes to the planning call."
        },
        {
            "heading": 2,
            "text": "4. How does case sampling of pupils work?"
        },
        {
            "text": "Our school inspection operating guide for inspectors explains case sampling. We’ll agree with you the pupils selected for case sampling on day 1 (we select approximately 6 pupils for this)."
        },
        {
            "text": "To help us select the pupils, we will ask you to provide a list of pupils who:"
        },
        {
            "heading": 2,
            "text": "5. How do you take into account the context of small schools?"
        },
        {
            "text": "Our state-funded school inspection toolkit sets out how our inspectors are mindful of potential differences when inspecting small schools."
        },
        {
            "text": "Some examples of how we do this include:"
        },
        {
            "heading": 2,
            "text": "6. How do you apply the toolkit in specialist settings or university technical colleges?"
        },
        {
            "text": "If your school or setting is a special school, alternative provision or university technical college (UTC), inspectors take this into account and make some adaptations. Each evaluation area in the state-funded school inspection toolkit includes a section on how it applies across different phases, age groups and types of educational provision."
        },
        {
            "text": "Inspectors use the planning call (see question 3) to start understanding the structure and context of your school. Working with leaders, they use this information to decide what’s best to focus on during the inspection:"
        },
        {
            "text": "We recently held a series of live webinars, which we’ve published on our YouTube channel, giving more information for:"
        },
        {
            "heading": 2,
            "text": "7. What is the governors’ role in school inspections?"
        },
        {
            "text": "The ‘leadership and governance’ evaluation area in the state-funded school inspection toolkit considers the impact of governance. The impact of leadership is a thread that runs throughout all evaluation areas. The toolkit, school inspection operating guide for inspectors and the inspection information for state-funded schools set out the role of governors on inspection."
        },
        {
            "text": "During the inspection, inspectors will meet with those responsible for governance in your school, either face to face or on a call – whichever works best for them."
        },
        {
            "text": "We’ve based the standards relevant to governors on the Department for Education’s ‘academy trusts: governance guide’ and ‘maintained schools: governance guide’."
        },
        {
            "heading": 2,
            "text": "8. What do you mean by ‘barriers to learning and/or wellbeing’ and how do you define 'disadvantaged'?"
        },
        {
            "text": "Inspectors want to understand your school’s context, including the demographics of the pupils and their needs. As part of the inspection planning process they’ll review your school's inspection data summary report (IDSR) and other contextual information such as the relevant area SEND inspection and local authority’s children’s services inspection. They’ll also speak with leaders and your nominee during the planning calls and throughout the inspection to find out more about the community you serve and the opportunities and challenges this may bring."
        },
        {
            "text": "Our inspections focus on the most vulnerable learners, such as those who are socio-economically disadvantaged (as defined in our glossary of education inspection terminology), those with SEND and those who are known (or previously known) to children’s social care. Inspectors focus on these pupils through various inspection activities and also use case sampling to gather first-hand evidence of their experiences. We want to find out how your school is helping pupils overcome barriers they may face to their learning and/or wellbeing."
        },
        {
            "text": "When we talk about barriers to learning and/or wellbeing, this means any factors that may make it difficult for a pupil to achieve as well as they should, and develop positive wellbeing."
        },
        {
            "text": "Barriers can be caused by a pupil’s individual circumstances, such as their health, development or emotional needs, or by external factors, including their family, community or wider social conditions. They can include protected characteristics. There may also be barriers that pupils face that are specific to the school’s context. These may require tailored approaches to reduce their impact on learning and/or wellbeing."
        },
        {
            "text": "Schools have a responsibility, through statutory duties or government guidance, to address barriers for certain groups of pupils. This includes pupils who are disadvantaged, pupils with SEND and pupils known (or previously known) to children’s social care."
        },
        {
            "text": "We recently recorded a webinar on how we use the IDSR on inspection, which we’ll be publishing soon on our YouTube channel. You can also read our blog about the role of data on school inspections."
        },
        {
            "heading": 2,
            "text": "9. How do you grade achievement in selective education/grammar schools?"
        },
        {
            "text": "We evaluate and grade achievement in selective education schools and grammar schools the same way as we do in other schools. However, we recognise that the context in which any school operates is important in understanding leaders’ priorities and why they have made certain decisions in the best interests of pupils."
        },
        {
            "text": "This is why inspectors want to develop an accurate understanding of your school’s context, including the demographics of the pupils and their needs. It will help them reflect on the impact of leaders’ actions on pupils."
        },
        {
            "text": "They will want to find out:"
        },
        {
            "text": "Inspectors take into account that published outcomes data may have gaps or limitations in how comprehensive the overall picture is. They’ll use evidence they gather on site to get a fuller picture of pupils’ achievement over time and the progress they make from their starting points."
        },
        {
            "text": "The state-funded school inspection toolkit also explains how we consider achievement for different ages, phases and provision types."
        },
        {
            "heading": 2,
            "text": "10. What is the difference between the old ‘best fit’ model and new ‘secure fit’ model that inspectors use to grade schools?"
        },
        {
            "text": "Our inspectors use a ‘secure fit’ model of evaluation to award grades. This means that each standard within each grade must be met before it can be awarded."
        },
        {
            "text": "We designed this model to keep grading as consistent as possible."
        },
        {
            "heading": 2,
            "text": "11. Is ‘expected standard’ a high standard?"
        },
        {
            "text": "The ‘expected standard’ is what we would typically expect to see on inspection. It covers the statutory, professional and non-statutory guidance that you are already expected to follow. It is a high bar, particularly as we use a secure fit model (as explained in question 10) to determine whether all of the standards have been met. Inspectors will report on the ‘expected standard’ positively, though there will be some areas identified that prevent the ‘strong standard’ from being met."
        },
        {
            "text": "It is important to remember that inspectors will start the process of evaluating your school by automatically considering it to be at the ‘expected standard’ (see question 10). In order to get a ‘strong standard’, then all expected standards would need to be met first."
        },
        {
            "heading": 2,
            "text": "12. Is ‘exceptional’ the new ‘outstanding’?"
        },
        {
            "text": "There is no read-across from the previous grading system, so ‘exceptional’ is not the new ‘outstanding’. It is also important to say that the ‘expected standard’ or ‘strong standard’ do not equate to the old ‘good’ grade."
        },
        {
            "text": "For your school to achieve ‘exceptional’ for an area, it needs to show a transformational impact on the outcomes and experiences of disadvantaged pupils, those with SEND and those who are known (or previously known) to children’s social care, and there can be no significant areas of improvement identified that leaders have not already prioritised. Practice and/or outcomes (depending on the evaluation area) will also have been sustained over the last 3 years or more."
        },
        {
            "text": "Inspectors will consider awarding ‘exceptional’ when they see an area of practice that is of such high quality that it should be shared to support improvement internally, regionally and nationally."
        },
        {
            "heading": 2,
            "text": "13. Is ‘needs attention’ the new ‘requires improvement’?"
        },
        {
            "text": "As with question 12, the ‘needs attention’ grade is not equivalent to ‘requires improvement’."
        },
        {
            "text": "Inspectors will grade an evaluation area as ‘needs attention’ when the ‘expected standard’ of the particular evaluation area is not met because inconsistencies in practice have a negative impact on pupils in general, or on a particular group. The ‘needs attention’ grade is not a ‘fail’. As we explain in our video for parents, ‘needs attention’ is an indication that there is work to be done to reach the ‘expected standard’ and it highlights where issues can be addressed before they become bigger problems that need ‘urgent improvement’."
        },
        {
            "text": "Where ‘needs attention’ has been identified, we will describe what needs to improve and return to your school through our monitoring programme, which means we can regrade if we identify improvement (see question 1).  "
        },
        {
            "heading": 2,
            "text": "14. What are you doing to explain the new grade system to parents?"
        },
        {
            "text": "When we’ve notified you that your school is about to be inspected, the inspector will send you a letter to send to parents and carers on our behalf."
        },
        {
            "text": "That letter includes details of the changes to the report card and a link to our video 'New Ofsted report cards and grades: a guide for parents', which explains the changes in more detail for parents."
        }
    ]
}