{
    "url": "https://ofqual.blog.gov.uk/2025/12/11/what-teachers-need-to-know-about-our-on-screen-assessment-proposals/",
    "title": "What teachers need to know about our on-screen assessment proposals",
    "authors": [
        "Jo Handford"
    ],
    "categories": [
        "A levels and GCSEs",
        "Exams",
        "On-screen assessment",
        "Regulation"
    ],
    "pub_date": "2025-12-11T00:01:00+00:00",
    "content": [
        {
            "text": "As teachers, you know better than anyone that GCSEs, AS and A levels are high-stakes qualifications that shape young people's futures. Every decision about how these exams are delivered must start with one question: is this fair for students?"
        },
        {
            "text": "That's why we're consulting on a carefully balanced approach to on-screen assessment. One that protects the integrity of qualifications you and your students work so hard for, while enabling measured innovation where the evidence supports it."
        },
        {
            "heading": 2,
            "text": "A balanced approach"
        },
        {
            "text": "We're proposing a controlled approach that enables innovation while protecting what matters most: standards, fairness, and your ability to prepare students effectively."
        },
        {
            "text": "Here's what this means in practice:"
        },
        {
            "heading": 2,
            "text": "Protecting fairness for all students"
        },
        {
            "text": "We know you're concerned about fairness – and so are we. Our proposals include specific protections:"
        },
        {
            "heading": 2,
            "text": "Built on solid evidence"
        },
        {
            "text": "These proposals are informed by extensive research, including:"
        },
        {
            "text": "We've also been clear about the risks. On-screen assessment introduces new challenges around cyber-security, technical failures during exams, and maintaining standards across different modes. Our controlled approach ensures these risks are carefully managed."
        },
        {
            "heading": 2,
            "text": "We're listening to your concerns"
        },
        {
            "text": "Our research tells us that while there's interest in greater use of technology in assessment, teachers have legitimate concerns. You've told us about:"
        },
        {
            "text": "We've listened. Our proposals reflect these realities."
        },
        {
            "heading": 2,
            "text": "What won't change"
        },
        {
            "text": "Your professional expertise remains at the heart of preparing students for qualifications. The knowledge and skills being assessed won't change. The rigour and value of qualifications won't be compromised. And traditional pen and paper assessment will remain the primary mode for most exams."
        },
        {
            "heading": 2,
            "text": "We need your voice"
        },
        {
            "text": "This consultation runs for 12 weeks, and we particularly want to hear from teachers and school leaders. You understand the realities of exam delivery. You know your students. You see what works and what doesn't."
        },
        {
            "text": "Your responses will help us ensure that any changes serve students' interests and are deliverable in schools and colleges."
        },
        {
            "heading": 2,
            "text": "Looking ahead"
        },
        {
            "text": "If these proposals are taken forward, detailed rules and guidance will follow in 2026. We'll keep the 2-specification limit under review, learning from how on-screen assessments work in practice."
        },
        {
            "text": "This is about evolution, not revolution. It's about protecting the qualifications system that serves your students well, while carefully enabling innovation where the evidence supports it."
        },
        {
            "text": "It’s worth remembering that this is optional.  In the vast majority of cases you can choose the specification that suits your preferences."
        },
        {
            "text": "Read the full consultation and share your views here."
        },
        {
            "text": "Your expertise and experience are essential to getting this right. Together, we can ensure that any changes maintain the standards and fairness that make England's qualifications trusted and valued."
        },
        {
            "text": "Jo Handford"
        },
        {
            "text": "Associate Director Strategic Projects and Innovation, Ofqual"
        }
    ]
}