{
    "url": "https://environmentagency.blog.gov.uk/2025/12/11/world-first-as-ge-vernova-completes-step-2-generic-design-assessment/",
    "title": "World first as GE Vernova completes Step 2 generic design assessment",
    "authors": [
        "Environment Agency"
    ],
    "categories": [
        "Nuclear",
        "Regulated industry",
        "Uncategorized"
    ],
    "pub_date": "2025-12-11T12:38:58+00:00",
    "content": [
        {
            "text": "We’ve just announced that GE Vernova Hitachi Nuclear Energy is the first company in the world to successfully complete our two step generic design assessment (GDA) process."
        },
        {
            "text": "Its BWRX-300 reactor design, a 300 megaWatt electrical (MWe) boiling water reactor, has been issued with a Step 2 statement. What does this mean and what have we said about this reactor design. Our lead nuclear assessor for this reactor Paula Atkin explains."
        },
        {
            "text": "What’s a two step generic design assessment?"
        },
        {
            "text": "We created GDA back in 2007 after government asked us and the Office for Nuclear Regulation (ONR) to look at how to de-risk new nuclear reactor projects."
        },
        {
            "text": "We introduced an option of stopping or pausing after the initial two steps (Fundamental Assessment) back in 2019 following discussions with government about how to make our process more enabling for Small Modular Reactors (SMRs) and under-developed designs."
        },
        {
            "text": "Before this innovation all GDAs followed the full process including detailed assessment, taking up to five years."
        },
        {
            "text": "Our team of assessors has completed this two-step review in just under two years. Step 1 was completed last December and since then the project team has been examining the fundamentals of the BWRX-300 design."
        },
        {
            "text": "Our focus in Step 2 is on fundamentals related to environmental protection and waste management such as how the design avoids creating radioactive waste. Our colleagues in ONR focus on the safety and security fundamentals."
        },
        {
            "text": "What have we learned about this reactor design?"
        },
        {
            "text": "Our headline conclusion statement is that there are no ‘fundamental’ environmental protection shortfalls in this design. We’ve not identified anything that is ‘unacceptable’."
        },
        {
            "text": "At this stage the design is likely to be consistent with the application of BAT (best available techniques) for minimising the generation and impact of radioactive waste disposals on people and the environment. This is subject to the completion of the further work identified in our regulatory observation (that we have concerns about waste segregation that will need to be resolved) and completing a detailed assessment of the design. Currently the company proposes not to change the design to enable sorting and segregation of waste ion exchange resins and liquid waste arisings. If it can’t demonstrate that its proposals on waste segregation are BAT, then design changes may be required."
        },
        {
            "text": "The radiation dose to the public and wildlife is likely to be well below the dose limit during normal operations. Further work is required to specify expected discharges, including looking in more detail at the “source term” that discharges are based on. The source term is essentially the level of radioactivity that is expected to arise in the reactor’s cooling circuit. We consider that it is overly conservative and so discharges are overestimated."
        },
        {
            "text": "We are also recommending the company looks at sampling and monitoring provisions as soon as possible, to ensure space is available to fit the equipment."
        },
        {
            "text": "We studied the company’s estimates for low and higher activity solid wastes for operation and decommissioning and found that there is nothing novel and all are likely to be disposable. And we also agree with NWS’ conclusion that the fuel is likely to be able to be disposed of in a future GDF."
        },
        {
            "text": "We recommend a continued focus on decommissioning as the design work progresses to ensure that there is sufficient information for any future permit application."
        },
        {
            "text": "What’s next for BWRX-300 design?"
        },
        {
            "text": "The company didn’t ask for a more detailed Step 3 GDA so a full detailed assessment will be required if a developer wants to take it forward at a site in England and Wales."
        },
        {
            "text": "The detailed assessment could take place as part of pre-application work for permitting or by restarting GDA. We’d assess the detailed design for how it ensures environmental protection and would also assess design changes that have been made since we began our assessments."
        },
        {
            "text": "The reactor is still being designed – it’s not finished. There are currently no plans to deploy here but GE Vernova told us that the reactor is going to be used in projects in Canada, the US, Poland and the Czech Republic.   "
        },
        {
            "text": "Sharing design assessment information with regulators around the world"
        },
        {
            "text": "The value of GDA is that it enables us to identify regulatory concerns and design problems early – when the design is still “on paper” – so that we can ask the designer to address them and change the design. This avoids costly and time-consuming changes down the line at the construction site."
        },
        {
            "text": "New nuclear power stations are an important part of the government’s policy for us to have secure low carbon energy supplies and to have economic growth in the UK. Most recently the Prime Minister and the US President signed a new UK-US agreement called the Atlantic Partnership for Advanced Nuclear Energy that requires closer working between UK and US regulators to improve the coordination and efficiency of our assessments. We’re already talking to regulators around the world about our GDA work and the new Atlantic partnership will encourage this further."
        },
        {
            "text": "Getting involved"
        },
        {
            "text": "You can read about all our GDA work  New nuclear power stations: assessing reactor designs - GOV.UK"
        },
        {
            "text": "If a developer takes forward this design in the future you’ll be able to read information and share your views through site specific consultations and public engagement work we’ll organise at that time."
        }
    ]
}