{
    "url": "https://deframedia.blog.gov.uk/2023/02/12/coverage-of-payments-to-farmers-following-the-uks-exit-from-the-eu/",
    "title": "Coverage of payments to farmers following the UK's exit from the EU",
    "authors": [
        "defrablogs"
    ],
    "categories": [
        "Farming"
    ],
    "pub_date": "2023-02-12T13:09:13+00:00",
    "content": [
        {
            "text": "There has been inaccurate coverage in today’s Observer on payments to farmers following the UK’s exit from the EU."
        },
        {
            "text": "It is not true to suggest farmers are now paid less than 0.5% of the budget they received prior to Brexit. As per the Government’s manifesto, the full £2.4 billion per year previously awarded in EU farming subsidies is continuing to go to farmers. This has been guaranteed by the government for the lifetime of this parliament."
        },
        {
            "text": "There are a number of ways that farmers can receive this money as the EU's Basic Payment Scheme is phased out. This includes our Environmental Land Management schemes such as the Sustainable Farming Incentive, as well as our simplified Countryside Stewardship scheme. In 2021/22 we spent £109m on  Countryside Stewardship and £11m on the Farming in Protect Landscapes fund – alongside many other initiatives and one-off grants to ensure sustainable food production can go hand in hand with protecting the environment."
        },
        {
            "text": "This is all detailed in the farming annual report and is in line with the money spent in 2019/20. While there was a small degree of underspend in 2021/22, this money has been made available for farming schemes in 2022/23. As per the annual report, £1.65 billion in direct subsidies were awarded to farmers in 2021/22, in line with the figures set out in the Agricultural Transition Plan."
        },
        {
            "text": "The piece reports that only 0.44% of the £2.4 bn budget was spent on the Sustainable Farming Incentive last year. The Sustainable Farming Incentive only opened in July 2022 with a limited range of actions for farmers to be paid for. Payments are made quarterly, meaning any agreements starting after September are not reflected in the amount paid to farmers last year. More than 2,000 farmers are now signed up to the scheme and we expect this number to continue to rise – and with it more money reaching farmers’ bank accounts – with the introduction of six further standards this year and more to come in 2024 and 2025. This will ensure there is something on offer for every farmer."
        },
        {
            "text": "A number of farming organisations have recently said they are “encouraged” by the take up of the Sustainable Farming Incentive - as per ENDS Report’s recent piece."
        },
        {
            "text": "A Defra spokesperson said: "
        },
        {
            "text": "Follow Defra on Twitter, and sign up for email alerts here."
        },
        {
            "text": " "
        }
    ]
}