{
    "url": "https://insidedio.blog.gov.uk/2024/12/19/a-long-distance-relationship-upgrading-the-falkland-islands/",
    "title": "A long distance relationship: Upgrading the Falkland Islands",
    "authors": [
        "Dot Larmour"
    ],
    "categories": [
        "BFSAI",
        "Falkland Islands",
        "Worthy Down"
    ],
    "pub_date": "2024-12-19T12:46:23+00:00",
    "content": [
        {
            "text": "I’ve been working in the Falkland Islands for six months in what is now my fourth continuity tour to the Falklands. It’s an interesting place to live and work and being so far from the UK adds significant challenges to the work of DIO.  "
        },
        {
            "text": "The team here recently welcomed DIO Chief Executive Mike Green, accompanied by some other senior staff, for his first visit to the islands to see what we contribute and what it’s like to live and work so far from our home base in the UK.  "
        },
        {
            "heading": 2,
            "text": "Redeveloping the Falklands"
        },
        {
            "text": "We are nearing the end of a 10-year construction programme which has seen DIO deliver a number of projects on behalf of, and with, various organisations. These include UK Strategic Command, Defence Equipment and Support and of course, the Falkland Islands Government.   "
        },
        {
            "text": "The programme represents a significant investment towards maintaining the operational capability of the air, maritime and Army assets deployed to the UK overseas territory.  "
        },
        {
            "text": "Some of the projects completed in this period include building the Mare Harbour jetty, a new primary school, support for a ground-based air defence system, installing a district heating system, improvements to the swimming pool and building infrastructure for three air defence radar sites known as remote radar heads. "
        },
        {
            "text": "In the next six months it is anticipated further projects will be completed: the new power station; remote radar head accommodation at Mt Byron on the Western Falkland Islands; refurbishment of the main aircraft hangar to house the A400M Maritime Patrol Aircraft, and more runway repair work. It was great to be able to show off progress to Mike and explain the benefits these projects will have.  "
        },
        {
            "heading": 2,
            "text": "Challenges of remote work"
        },
        {
            "text": "Working and living in the Falklands is a unique experience. Being 8,000 miles from the UK, delivering the core contract and projects can be challenging. As well as the time difference and distance from the UK, the communications network has limitations to the bandwidth resulting in near impossible comms back to the UK. Additionally, the weather can be very harsh, leaving only a small window of opportunity available to undertake external construction.  "
        },
        {
            "text": "Careful logistical planning is needed as all material, supplies and most personnel needed to facilitate construction works arrive either by sea through the Falkland Island Resupply Ship, typically one every two months, or via the twice-weekly South Atlantic Air Bridge from RAF Brize Norton. Due to a weather phenomena called “rotors”, the air bridge is often subjected to delays or cancelations which impacts specialist contractor’s availability to come to site. "
        },
        {
            "text": "If it turns out we need some equipment that wasn’t accounted for, it could take weeks or months to arrive - at significant cost - so it’s particularly important to get it right first time. The challenges of living and working so far away fosters a closeness and a real ‘can do’ attitude among the team. As a civil engineer by trade, Mike was interested in these practicalities of working in the Falkland Islands and how we problem solve. "
        },
        {
            "text": "We’re also aware that the small community, both military and civilian, means that the work we do can have an especially significant impact. This is particularly true in even more distant areas like the remote radar heads, where there is nothing for miles around, but it applies everywhere on the islands. The swimming pool improvements, for example, benefit both service personnel and their families at the Mount Pleasant Complex. Unlike in the UK where they may have dozens of other options for activities, something like the swimming pool can be extremely important for our community and it’s always important for us to keep that in mind.  "
        },
        {
            "text": "Ultimately though, our job is to support military capability and the investment in the Falkland Islands over the last decade really shows that we are doing that. We look forward to wrapping up a few more projects in the coming months and then I’m sure there’ll be plenty more to get our teeth into! "
        }
    ]
}