{
    "url": "https://cddo.blog.gov.uk/2024/12/19/artificial-intelligence-must-have-skills-for-the-future/",
    "title": "Artificial Intelligence: must-have skills for the future",
    "authors": [
        "Tommaso Spinelli, Senior Artificial Intelligence Change Manager, CDDO",
        "Sarah Parry, Learning Design and Pathways Delivery Manager Lead, CDDO"
    ],
    "categories": [
        "AI",
        "CDDO",
        "Cross-government strategy",
        "Digital transformation",
        "Government Digital and Data"
    ],
    "pub_date": "2024-12-19T09:34:30+00:00",
    "content": [
        {
            "text": "Over 70 new AI e-learning courses were released on Civil Service Learning in response to departments’ increasing use of Artificial intelligence (AI) and the pace of change in this technology. These courses build on the Generative AI Framework for HMG published earlier this year."
        },
        {
            "text": "As AI transforms how government operates, comprehensive AI training for civil servants has become crucial. This training ensures that public servants can harness AI's potential for improved efficiency and enhanced public service delivery while maintaining the highest standards of ethics and responsibility. With generative AI offering new capabilities in text and image creation, civil servants must understand how to use these tools effectively while adhering to government frameworks, mitigating biases, and ensuring accuracy and inclusivity."
        },
        {
            "text": "This training will help build confidence in using emerging technologies appropriately, safeguarding public trust, and enabling civil servants to make informed decisions about AI implementation that align with Civil Service values and data protection requirements."
        },
        {
            "text": "At the Central Digital and Data Office (CDDO) we ran user research across government and collaborated with leading tech firms to make available free high quality e-learning courses on various aspects of AI."
        },
        {
            "heading": 2,
            "text": "Who the courses are for "
        },
        {
            "text": "The courses are for all civil servants who are new to AI or are interested in learning more about this technology and its business or ethical implications. Some courses are more technical than others, but each section includes at least one course that introduces the key concepts."
        },
        {
            "heading": 2,
            "text": "What the courses include"
        },
        {
            "text": "The new AI courses on Civil Service Learning (login required) are designed to enhance AI skills and knowledge in key areas including:"
        },
        {
            "text": "The courses are self-paced and use a mix of articles, videos, and optional tasks."
        },
        {
            "text": "Government Skills has also published a new Artificial Intelligence page on Prospectus Online. Here you’ll find a series of off-the-shelf courses made available through the Learning Frameworks on more specific aspects of AI."
        },
        {
            "text": "You are encouraged to check your department’s policy on the use of AI before using any of the tools described in the courses."
        },
        {
            "heading": 2,
            "text": "What’s next"
        },
        {
            "heading": 2,
            "text": "Read more "
        },
        {
            "text": "Artificial Intelligence: introducing our series of online courses on generative AI"
        }
    ]
}