{
    "url": "https://environmentagency.blog.gov.uk/2024/12/19/conservation-covenants-a-new-tool-to-support-nature-recovery/",
    "title": "Conservation covenants: a new tool to support nature recovery",
    "authors": [
        "Environment Agency"
    ],
    "categories": [
        "Nature",
        "Sustainability"
    ],
    "pub_date": "2024-12-19T09:53:31+00:00",
    "content": [
        {
            "text": "The Environment Agency is delighted to have been designated as a responsible body for conservation covenants. This new tool will help us in our work to protect and enhance nature in England."
        },
        {
            "text": "The bigger picture: the importance of nature"
        },
        {
            "text": "We rely on nature for almost everything we need. It provides food, renewable energy, and social spaces for leisure and exercise. Trees and plants help to clean the air we breathe and store carbon dioxide. Natural landscapes can slow the flow of water which can reduce the risk and impacts of floods. These are just a few simple examples of the huge variety of services and benefits that nature provides. But nature is increasingly threatened by pressures such as climate change, pollution, and land use change."
        },
        {
            "text": "What is a conservation covenant?"
        },
        {
            "text": "Conservation covenants are a new legal tool, introduced by the Environment Act 2021, that can be used to conserve natural, or heritage features of the land in England. They are private, voluntary agreements between a designated responsible body and a landowner (or leaseholder) to deliver lasting conservation benefits. Each conservation covenant will describe what the responsible body and landowner will do to help conserve the land for public good. They are bespoke agreements so they can be tailored to suit different circumstances.  "
        },
        {
            "text": "Conservation covenants may provide certainty and assurance that environmental outcomes will be realised, and that land will be managed in a particular way. Conservation covenants could therefore enable individual landowners or leaseholders to play an active role in protecting nature, whilst potentially also supporting opportunities to generate an income from carrying out environmentally friendly actions."
        },
        {
            "text": "Why has the Environment Agency become a responsible body?"
        },
        {
            "text": "The Environment Agency was established to protect and improve the environment. Our EA2025 plan sets out three key goals:"
        },
        {
            "text": "Conservation covenants provide us with an additional tool to support what we do. We will be able to enter into conservation covenants with landowners to secure environmental outcomes and protect nature. For example, a conservation covenant could be put in place to secure the restoration of a saltmarsh or the creation and management of a new wetland habitat."
        },
        {
            "text": "As conservation covenants are legal agreements that bind successive landowners, the commitment to conservation remains with the land even if it is sold or passed on. Conservation covenants offer the potential to ensure that the work that we do, in collaboration with partners, local communities, individual landowners, and land managers, will last into the future and continue to benefit both the environment and people."
        },
        {
            "text": "Introducing conservation covenants into the Environment Agency’s ‘toolkit’"
        },
        {
            "text": "Conservation covenants have the potential to be used for a wide variety of purposes. The Environment Agency will initially explore this with a small number identified through existing work areas and projects. The learning we gather will inform our longer-term approach to entering into conservation covenants as a responsible body. At this stage, we are therefore not seeking additional opportunities for the Environment Agency to be the responsible body for a conservation covenant from landowners or other parties.  "
        },
        {
            "text": "We look forward to sharing further updates on how the Environment Agency is utilising conservation covenants as a responsible body, to support our work to protect and improve the environment, in due course."
        },
        {
            "text": "Who are the other designated responsible bodies?"
        },
        {
            "text": "The Environment Agency is pleased to be joining a number of other organisations that have achieved responsible body status this year. View the list of designated responsible bodies on gov.uk."
        },
        {
            "text": "Where can I find out more?"
        },
        {
            "text": "Visit gov.uk for more information and guidance about conservation covenants and responsible bodies. Take a look at the Environment Agency Chief Scientist's Group report, ‘Working with Nature’, to learn more about the importance of nature, the reasons for its decline, and how nature-based solutions can be used to combat the climate and nature crises."
        }
    ]
}