{
    "url": "https://defrafarming.blog.gov.uk/2024/12/19/dartmoor-land-use-management-group-next-steps/",
    "title": "Dartmoor Land Use Management Group: next steps",
    "authors": [
        "Phil Stocker"
    ],
    "categories": [
        "Farming and Countryside Programme",
        "Guest post"
    ],
    "pub_date": "2024-12-19T12:40:31+00:00",
    "content": [
        {
            "text": "In October, we appointed the Independent Chair for the Dartmoor Land Use Management Group (DLUMG), Phil Stocker."
        },
        {
            "text": "The group will develop a land use framework and land use plan for this internationally significant site. It will also provide oversight and steward the delivery of the 25 recommendations put forward in our response to the Independent review of protected site management on Dartmoor. "
        },
        {
            "text": "In this guest post, Phil shares insights into his role, the published terms of reference, membership, and next steps for the group. "
        },
        {
            "text": "I am honoured to have been appointed as the Independent Chair of the Dartmoor Land Use Management Group (DLUMG). "
        },
        {
            "text": "This is a responsibility I take very seriously, as it provides an opportunity to tackle the complex and vital task of managing land use on Dartmoor in a way that benefits both people and nature. Dartmoor is one of England’s most iconic landscapes, valued for its open moorland, wooded valleys, and rich history and culture. "
        },
        {
            "text": "Today we’ve published the group's terms of reference, where you can find information on our purpose, objectives, governance and more. This and all other information related to the DLUMG will be available on our upcoming website.  "
        },
        {
            "text": "As Chair, I will be leading this group and its day-to-day running, with the support of Simon Lunniss who has been seconded to the group from the Rural Payments Agency (RPA).  "
        },
        {
            "text": "The DLUMG will act as a forum to build strong relationships, creating a culture of open decision making with effective governance. The group brings together farmers, landowners and commoners, Natural England, environmental NGOs and other key stakeholders, including a wider network of specialists. "
        },
        {
            "heading": 3,
            "text": "Purpose of the group "
        },
        {
            "text": "The DLUMG will seek to implement the 25 recommendations attributed to the group in the government response to the Dartmoor Review.  "
        },
        {
            "text": "The recommendations include strengthening the governance of Dartmoor’s commons, supporting sustainable land management practices, and fostering collaboration among stakeholders. Read more about the purpose of the group. "
        },
        {
            "heading": 3,
            "text": "Members of the group "
        },
        {
            "text": "The membership of the DLUMG is being carefully structured in collaboration with Defra to ensure balanced representation from key stakeholder groups, including farming, conservation, community, and local governance. The group will also include academic and research interests and relevant government agencies. "
        },
        {
            "text": "I believe this diverse representation is essential to making the right decisions and delivering the best future for Dartmoor.  "
        },
        {
            "text": "There will be wider involvement and inclusion via a series of working groups that will work on specific topics relating to the 25 recommendations. "
        },
        {
            "text": "I am in the process of finalising membership of the group in collaboration with Defra, and we will provide a full list of members as soon as they are confirmed. I hope to confirm the members in the new year. "
        },
        {
            "text": "The members of the DLUMG are not formal public appointments, and the DLUMG is not a formal public body. Read more about the terms of membership. "
        },
        {
            "heading": 3,
            "text": "Our First Meeting "
        },
        {
            "text": "The first meeting of the DLUMG will be an important step in setting the tone and direction for the group’s work. This is planned for the second half of January 2025, once all group members have been confirmed. "
        },
        {
            "text": "We will focus on clarifying our shared objectives, understanding the challenges we face, and agreeing on how we can work collaboratively to deliver meaningful outcomes. "
        },
        {
            "text": "During this meeting, we will begin discussing priorities for the Dartmoor Land Use Framework and Landscape Delivery Plan. "
        },
        {
            "text": "This framework will guide the group’s efforts in developing a sustainable and balanced strategy for Dartmoor. "
        },
        {
            "heading": 3,
            "text": "Looking Ahead "
        },
        {
            "text": "Recent years have highlighted the challenges facing Dartmoor. Balancing farming and food production with environmental stewardship has become increasingly difficult, with economics, climate change and biodiversity loss adding further pressures. "
        },
        {
            "text": "We will ensure Dartmoor’s strategy aligns with broader Government objectives for sustainability and environmental improvement by working closely with Defra on forthcoming national initiatives."
        },
        {
            "text": "The first quarterly report for DLUMG can be expected in March 2025. "
        },
        {
            "text": "The success of the DLUMG will depend on collaboration and consensus.  "
        },
        {
            "text": "My goal as Chair is to ensure all voices are heard, and our work reflects the needs of Dartmoor’s farming, environmental, conservation, and local communities. "
        },
        {
            "text": "I look forward to helping to create a sustainable and balanced future for Dartmoor. "
        },
        {
            "text": "Please contact DLUMG@defra.gov.uk if you have any questions or queries. "
        }
    ]
}