{
    "url": "https://mhclgdigital.blog.gov.uk/2024/12/19/digital-planning-programme-our-year-in-review/",
    "title": "Digital Planning Programme: our year in review ",
    "authors": [
        "Digital Planning"
    ],
    "categories": [
        "Digital Planning"
    ],
    "pub_date": "2024-12-19T09:24:57+00:00",
    "content": [
        {
            "text": "As we wrap up 2024, we’re reflecting on another exciting year for the MHCLG Digital Planning Programme. This year our journey to transform England’s planning system to make it fit for the 21st century has continued, with breakthrough innovations, stronger partnerships and real results that are making a difference across the country.  "
        },
        {
            "text": "Before we dive into our achievements, we want to thank the incredible network of Local Planning Authorities (LPAs), industry partners, the Open Digital Planning (ODP) and wider planning community, other government departments and colleagues at MHCLG, who’ve been a massive part of our success this year. Your collaboration and insights have been integral to our progress.  "
        },
        {
            "heading": 2,
            "text": "2024 milestones "
        },
        {
            "text": "Across the team, we’ve been working to develop tools, software, and guidance for planners.  "
        },
        {
            "heading": 3,
            "text": "Our work with PropTech (property technology)"
        },
        {
            "text": "Round 4 of the PropTech Innovation Fund applications closed at the end of last year, with a record number of submissions. That resulted in us supporting 37 projects across 49 LPAs, focusing on improving citizen engagement, site identification and speeding up the local plans process. We’ll be reporting on their outcomes next year. "
        },
        {
            "text": "Meanwhile, here are a few highlights from some of the other PropTech projects which have seen results: "
        },
        {
            "text": "To help LPAs adopt digital consultation tools, we launched a digital citizen engagement toolkit – a user-centred guide they can easily follow.  "
        },
        {
            "heading": 3,
            "text": "The Open Digital Planning community"
        },
        {
            "text": "2024 has been a landmark year for our Open Digital Planning (ODP) community, which continues to go from strength to strength. This year LPAs supported by the PropTech funding have joined the community and thanks to our Digital Planning Improvement Fund, an additional 43 councils have also come on board, bringing the total number to 107 members. These forward-thinking councils are benefiting from training, resources and networking and are leading the way to develop a more efficient, data-driven planning system.  "
        },
        {
            "text": "To support them on their digital journey this year we have launched a Digital Planning Maturity Assessment, which many have completed. This crucial first step helps authorities understand their current digital capabilities and maps out their journey towards a more digitally enabled future.  "
        },
        {
            "heading": 3,
            "text": "Better access to planning data"
        },
        {
            "text": "A vital part of this is to improve and publish datasets on the Planning Data platform, which has seen further growth this year, establishing itself as the authoritative hub for planning data across the country. With 158 high-quality datasets now available, we are supporting LPAs to add to this valuable, open resource which both the public and private sectors can trust, transforming how data is accessed and used to transform the planning system. "
        },
        {
            "heading": 3,
            "text": "Faster and more efficient planning decisions"
        },
        {
            "text": "Members of the ODP community have continued to work together to build software products which can dramatically improve people’s experiences of making and processing planning applications. "
        },
        {
            "heading": 3,
            "text": "Faster plan making"
        },
        {
            "text": "We’re also transforming how planners create or update their local plans and have this year been developing a new service which is due to launch soon. The new web pages for planners will bring all essential guidance and tools – both existing and new – into one user-friendly place, to help speed up the plan-making process. This has all been shaped by extensive user testing and feedback to meet LPA needs. "
        },
        {
            "heading": 2,
            "text": "Championing collaboration "
        },
        {
            "text": " We’ve been working with more LPAs than ever this year, particularly those in our ODP community. While virtual collaboration has been invaluable, a real highlight was our face-to-face gathering in Newcastle, in October. There we welcomed over 125 attendees from 35 LPAs and public sector organisations, for exciting discussions about digital maturity and planning innovation. "
        },
        {
            "text": "Our team also shared insights at major industry events, including the UK’s Real Estate Investment and Infrastructure Forum (UKREiiF) and the Public Sector Connect DigiTech event, highlighting how we’re #DoingPlanningDifferently.  "
        },
        {
            "text": "At UKREiiF, MHCLG also signed a new partnership with the Digital Task Force for Planning to accelerate the use of cutting-edge property technology to speed up the planning process so we can build the homes and infrastructure England needs.  "
        },
        {
            "text": "This year, we collaborated with Ordnance Survey to help LPAs navigate data sharing under the Public Sector Geospatial Agreement (PSGA), ensuring compliance while unlocking the potential of open data. By aligning our Planning Data platform with PSGA conditions, we provided clear guidance to support better digital planning processes. "
        },
        {
            "text": "We also partnered with Faculty AI, a specialist in applying artificial intelligence (AI) and technology, to explore the potential of using AI to extract specific information buried in planning documents. By harnessing AI technology, we’ve discovered promising ways to process and extract crucial information that was previously time-consuming to access.  "
        },
        {
            "text": "We’re always keen to invest in the next generation of planners and this year visited Kent and Sheffield universities, sharing insights from our digital transformation journey to inspire the planning students who will be shaping tomorrow’s communities.   "
        },
        {
            "heading": 2,
            "text": "Recognising excellence "
        },
        {
            "text": "This year, the programme was shortlisted for several prestigious awards, including Programme of the Year in the APM Project Management Awards and Digital Leaders 100 for Digital Public Service Innovation. Programme Director, Milan Bogunovic and Head of Adoption, Engagement and Innovation, Bridget Wilkins were also finalists in the Government Transformation Awards, celebrating their efforts to drive change in public services. "
        },
        {
            "heading": 2,
            "text": "Looking ahead "
        },
        {
            "text": "There’s been some big foundational steps taken this year and in 2025 we’re looking forward to working with more LPAs to improve data collection and releasing more resources for planning teams preparing and updating local plans. "
        },
        {
            "text": "As we gear up for 2025, we’ve a lot to look forward to: "
        },
        {
            "text": "For more information about the Digital Planning programme follow us on LinkedIn and X to stay connected, and subscribe to our newsletter for the latest updates. "
        },
        {
            "text": "You can also take a look at this previous MHCLG Digital blog about the programme, which was chosen as a case study to showcase the department's digital goals and progress."
        },
        {
            "text": "Wishing you a joyful December, happy holidays, and a bright start to the new year, from everyone at MHCLG Digital Planning. "
        }
    ]
}