{
    "url": "https://mhclgmedia.blog.gov.uk/2024/12/19/inaccurate-provisional-local-government-finance-settlement-reporting/",
    "title": "Inaccurate provisional Local Government Finance Settlement reporting",
    "authors": [
        "mhclgpress"
    ],
    "categories": [
        "Council finance"
    ],
    "pub_date": "2024-12-19T17:36:31+00:00",
    "content": [
        {
            "text": "There has been media reporting suggesting allocations set out in our provisional Local Government Finance Settlement will mean Shire districts or ‘more rural’ councils are being treated unfavourably."
        },
        {
            "text": "This is not correct, and does not account for the over £4 billion of funding committed to local government services. The provisional Local Government Finance Settlement alone ensures that no council will see a reduction in their Core Spending Power, and places with a significant rural population will on average receive around a 5% increase in their Core Spending Power. Across England, £69 billion will be made available for councils - which is a real-terms increase of 3.5% from 2024-25."
        },
        {
            "text": "The new £600 million Recovery Grant is a highly targeted, one-off emergency payment for the places that need it most with funding being determined based on deprivation and council tax raising ability, taking into account population. The government has been clear and transparent with the full methodology of the Grant allocations available on Gov.uk."
        },
        {
            "text": "In addition, councils in England will receive £1.1 billion in new funding from the Extended Producer Responsibility for packaging scheme (pEPR), which will be a significant funding increase for all councils including shire districts. Indeed, the Institute for Fiscal Studies has estimated that pEPR payments will amount to the equivalent to 7.8% of Core Spending Power across all shire districts, and even more for the shire districts serving the most rural areas."
        },
        {
            "text": "Reporting of council tax increases in response to the Settlement are purely speculative, with individual local authorities being responsible for setting their council tax levels. We are maintaining the previous government’s referendum threshold for council tax at 3% with 2% for the adult social care precept to protect local taxpayers."
        },
        {
            "text": "We have been clear on our commitment to fix the foundations of local government and the need for longer-term reform to the outdated system to distribute funding more fairly, make better use of public of public money and deliver high-quality services across the country. But these changes cannot happen overnight which is why we will be giving the sector a say on fixing the system and from 2026-27."
        },
        {
            "text": "Minister of State for Local Government and English Devolution Jim McMahon said:   "
        },
        {
            "text": "“We know councils are calling out for help which is why we have prioritised this vital increase in funding, but we must stop taxpayers’ money being thrown into a broken system."
        },
        {
            "text": "“As a former council leader I know too well that councils have suffered from short-term solutions. But we will fix this outdated system, turning to our partners in local government, working hand in hand to bring ambitious reform and do the long-term, necessary work to rebuild the foundations, and crucially, trust.” "
        },
        {
            "text": "The government will provide confirmation of the final local government finance settlement once the four-week consultation has closed and all responses have been considered in early 2025.  "
        }
    ]
}