{
    "url": "https://mhclgmedia.blog.gov.uk/2024/12/19/largest-every-cash-boost-to-tackle-homelessness-and-rough-sleeping/",
    "title": "Largest ever cash boost to tackle homelessness and rough sleeping",
    "authors": [
        "mhclgpress"
    ],
    "categories": [
        "Homelessness"
    ],
    "pub_date": "2024-12-19T09:55:58+00:00",
    "content": [
        {
            "text": "There has been prominent national and regional coverage following our announcement this week which confirms councils across England will receive almost £1 billion of new funding next year, including the largest-ever investment in homelessness prevention services, to get the country back on track to end homelessness for good."
        },
        {
            "text": "This was positively picked up in Sky News, The Independent and The Big Issue as well as trade coverage including Inside Housing and Housing Today. They all report about the new cash injection that will better equip councils to step in early to stop households becoming homeless in the first place and help get rough sleepers off the street and into secure housing. This is alongside new funding to support workers on the frontline providing essential services to tackle, reduce and prevent homelessness across the country."
        },
        {
            "text": "Regional papers including Manchester Evening News, Liverpool Echo, Northampton Chronicle, Blackpool Gazette, Yorkshire Post, Telegraph & Argus, and London Evening Standard have focused on the specific funding allocations and grants for their respective areas.  "
        },
        {
            "text": "Too many homeless families have been forced into temporary accommodation for far too long, and next year’s funding will deliver the first of many steps in the government’s long-term plan to turn the tide on homelessness.  "
        },
        {
            "text": "Deputy Prime Minister and Secretary of State for Housing, Angela Rayner said:"
        },
        {
            "text": "“Too many people have been failed by the system time and again.160,000 children face spending this Christmas without a stable place to call home. I am determined to break the cycle of spiralling homelessness and get back on track to ending it for good."
        },
        {
            "text": "“This largest-ever investment marks a turning point, giving councils the tools they need to act quickly and put in place support for people to tackle, reduce and prevent homelessness. It’s time to turn the tide."
        },
        {
            "text": "“This historic funding comes alongside our work developing a cross-government strategy back on track to end homelessness, pulling every lever of the state, to ensure that we deliver not just sticking plasters but a long-term plan."
        },
        {
            "text": "“Through our Plan for Change I am determined to tackle the housing crisis we inherited head on, building the homes we need, delivering the biggest boost in social and affordable housing in a generation and ending no fault evictions.”"
        },
        {
            "text": "Minister for Homelessness, Rushanara Ali said: "
        },
        {
            "text": "“We have inherited the worst housing crisis in living memory that has left far too many families trapped in temporary accommodation with no end in sight and soaring numbers of people sleeping rough on our streets."
        },
        {
            "text": "“This is the dire legacy we have inherited as a government, and we are fully determined to take immediate action. Our funding will not only support councils delivering vital services that meet the needs of their communities but also pave the way for our long-term plan to get us back on track to end homelessness once and for all.” "
        }
    ]
}