{
    "url": "https://services.blog.gov.uk/2024/12/19/services-week-is-back-for-2025/",
    "title": "Services Week is back for 2025",
    "authors": [
        "Ella Boyer - Senior Communications and Events Manager, CDDO",
        "Dani Wise - Content Designer, DWP",
        "Lisa Jeffery – Design Manager, Defra"
    ],
    "categories": [
        "Events",
        "Service transformation"
    ],
    "pub_date": "2024-12-19T09:48:35+00:00",
    "content": [
        {
            "text": "Technological advances are changing the way people interact with services. People expect more from government and our services need to keep pace with this change. Designing effective public services starts with innovation, a strong understanding of what people need from services, and close collaboration between different teams and specialisms. Services Week is an opportunity to share, to learn and to collaborate, all with the aim of transforming lives through high quality, technology-powered services."
        },
        {
            "heading": 2,
            "text": "What is Services Week?"
        },
        {
            "text": "Services Week is an annual event hosted by the Government Digital and Data community, bringing together professionals from across the UK public sector. Now in its seventh year, Services Week 2025 will take place from 17 to 21 March 2025 and will explore public services through the lenses of digital innovation and service design. The events are open to participants from all sectors and backgrounds, encouraging diverse perspectives and collaboration.  "
        },
        {
            "text": "Sessions at Services Week are created by the community, for the community, and we want you to be a part of it. Last year, the event featured over 60 sessions, including ‘Introduction to Service Design’ training by HM Revenue and Customs (HMRC), a look at website and service design challenges in local government programs by Birmingham City Council, and a ‘Greener Services Hack Day’ hosted by the Department for the Environment, Food and Rural Affairs (Defra). Check back in the new year for details on how to submit your session and register for the upcoming events."
        },
        {
            "heading": 2,
            "text": "Who is it for?"
        },
        {
            "text": "Services Week 2025 is for all civil servants and public sector employees. You’ll have the opportunity to both host your own sessions and attend those led by others throughout the week. It’s a great opportunity for you to see the fantastic services that are being delivered across the public sector."
        },
        {
            "heading": 2,
            "text": "The theme: People-centred services"
        },
        {
            "text": "This year’s theme is ‘People-centred services’. At the core of all public sector services are the people we serve. This theme will allow you to explore the connections between service providers and the communities they support."
        },
        {
            "heading": 2,
            "text": "When is it?"
        },
        {
            "text": "Week commencing 17 March to 21 March 2025."
        },
        {
            "heading": 2,
            "text": "Services Week 2025 sessions"
        },
        {
            "text": "Services Week 2025 will see an exciting line-up of sessions that will highlight the best of people-centred services. Some of the the sessions in development for this year are: "
        },
        {
            "text": "Stay tuned as the agenda develops."
        },
        {
            "heading": 2,
            "text": "Why take part and what you could do"
        },
        {
            "text": "Sessions can be run as online, hybrid or in-person events. Choices around session formats are yours. Tools, timings and attendance of sessions will differ depending on the outcomes you seek. You can run something live between 17 and 21 March 2025 or pre-record a session such as a webinar or podcast to release during the week itself. Session formats change every year but often include: "
        },
        {
            "text": "Always consider inclusivity, security and how people will sign up for your sessions. It might help to contact your own events team for advice on what best suits your organisation. GOV.UK has guidance on accessible communication formats. Adding your session to the Services Week 2025 playlist, which will be available from January, is another way to increase access. You can read what people had to say about Services Week 2024 in this blog post."
        },
        {
            "text": "Contact Ella Boyer to get involved."
        }
    ]
}