{
    "url": "https://thebluebeltprogramme.blog.gov.uk/beyond-the-reef-a-leg-of-surprises-in-the-turks-and-caicos-islands/",
    "title": "Beyond The Reef: A leg of surprises in the Turks and Caicos Islands  ",
    "authors": [
        "danielleanthony1"
    ],
    "categories": [
        "10 years",
        "Science",
        "Survey",
        "Turks & Caicos Islands",
        "UK Overseas Territories"
    ],
    "pub_date": "2026-02-24T14:28:50+00:00",
    "content": [
        {
            "text": "On the 31st of January, the RRS James Cook sailed into Turks and Caicos waters, ready to uncover an unknown world in the depths. Generations of local knowledge and extensive research is available for the shallow, coastal waters of the Turks and Caicos Islands (TCI). In contrast, there is limited knowledge of their deeper waters. In just 10 days, the scientific team worked around the clock to collect a wealth of data to change this. "
        },
        {
            "text": "Collecting data on this huge scale was achieved by a team of scientists working across a range of scientific techniques.  "
        },
        {
            "text": "To study habitats multibeam echosounders were used to map the depths of the seafloor. CTDs (an instrument that measure parameters including the conductivity, temperature and depth of the water) was used to analyse the physical and chemical profile of the water from surface to seafloor. Fisheries acoustics also uses sound, but this time to map the location and abundance of fish. Seabed camera systems and the RMT, a mid-water net designed to collect specimens at specific depths, provide more information on the types of habitats and species that are present.  "
        },
        {
            "text": "Each method provides specific information that layers together to give a 3D picture of the habitat and ecology of the sea. Through this, we can begin to understand how habitats and marine life interact and influence each other.  "
        },
        {
            "heading": 3,
            "text": "But why focus the deep sea now?  "
        },
        {
            "text": "The ocean is the backbone of coastal nations like TCI, providing a source of food, income, and cultural pride. TCI’s deeper waters represent new opportunities to develop their blue economy and better understand the processes that influence their current fisheries and climate vulnerability. With the scientific evidence collected on this expedition, TCI can better conserve and manage their marine ecosystems it resides over.  "
        },
        {
            "heading": 3,
            "text": "Extreme Geography "
        },
        {
            "text": "The Turks and Caicos Islands consist of two main limestone banks, the Caicos Bank on which the main archipelago sits and the smaller Turks Bank. The edge of these banks is marked by steep underwater cliffs that abruptly plunge to over 1000 metres deep. But these cliffs weren’t the only dramatic geography found on TCI’s seafloor.  "
        },
        {
            "text": "The expedition was the first to map a previously unknown 70 kilometre long ridge. Rising 3700 metres above the seabed at its peak, this imposing feature looks like somebody reached down and pinched the Earth. Current charts of TCI’s seabed are based off of data collected in the 1980's or even earlier. These charts suggested something was there, but there was no indication of such a continuously prominent ridge in this area of the seafloor. "
        },
        {
            "text": "The geography of the seafloor influences the surrounding oceanography. Steep seafloor features like those found in TCI, drive vital nutrient rich deeper water closer to the surface. Increased nutrient concentrations support the growth of more plankton. With more plankton, comes more small fish which then supports a greater population of larger economically important species like tuna, mahi mahi and billfish. As a result, richer, more diverse ecosystems are often found near ridges, seamounts, and the edge of banks.  "
        },
        {
            "text": "Therefore, having detailed maps of these features matters greatly. Such maps, in conjunction with the sampling undertaken during this survey can give an indication of which areas could support higher biodiversity. In the future, this information can support the potential diversification of TCIs fishing sector into pelagic fisheries such as tuna, billfish and mahi mahi.  "
        },
        {
            "heading": 3,
            "text": "Deep water residents "
        },
        {
            "text": "Through sampling via the RMT net and deploying numerous cameras, a lot was learnt about TCI’s deep-water residents. Each net brought up fish, crustaceans and gelatinous creatures that were almost other-worldly in their appearance compared to TCI’s shallow water residents. It’s the first time many of these specimens have been described in the region. As a result, scientists can now better  understand the biodiversity of TCI’s pelagic waters.  "
        },
        {
            "text": "Numerous Spiny lobster at various developmental stages were also caught around the islands. Spiny lobsters are on of the key fisheries in the TCI. Therefore, understanding the recruitment of TCI's lobsters is crucial to supporting sustainable management of these fisheries. There are many more questions to answer; however, findings these delicate larvae in the RMT net is an encouraging sign. "
        },
        {
            "text": "A baited camera trap was used to discover inhabitants of the seafloor. Amazingly, five different types of sharks were captured! They include Cuban dogfish and a six-gill shark. There is a common assumption that not much lives on the expansive mud plains that cover much of the deep ocean. However, images like this are a reminder that even the bleakest corner of the ocean is rich with life. Increasing understanding of the biodiversity of the deep sea will support future conservation efforts.  "
        },
        {
            "heading": 3,
            "text": "Increasing capacity on island  "
        },
        {
            "text": "Five representatives from TCI's government agencies joined the expedition, bringing with them a wealth of expertise built up over years of working in and around these islands. Alexander 'Roddy' McLeod, Christopher May and Jessly Robinson joined from the Department of Environment and Coastal Resources (DECR), while Destiny Missick and Rodney Smith represented the Department of Fisheries. "
        },
        {
            "text": "Between them, the team brought a wealth of knowledge in coastal ecology, fisheries management, and water chemistry and were keen to be at the forefront of expanding this knowledge to the deep.  "
        },
        {
            "text": "Destiny, Roddy and Chris were involved with camera work and biological sampling. Their familiarity with the local ecosystems greatly supported the identification of numerous specimens. This collaborative effort is central to the expedition. It brings together diverse skills and local insights, enabling scientists from the UK and Overseas Territories to work side by side on pioneering research."
        },
        {
            "text": "Outreach Officer for the DECR, Christopher May, reflected on his experience: “I was initially excited about the prospect of being a part of the expedition. I feel more confident relaying the information collected back to the Turks and Caicos Island community. I feel it will lead to more discussions directed to resources. I’m grateful for the experience and the group of scientists working together to gather information that will support the Turks and Caicos Islands.” "
        },
        {
            "text": "Water quality is an increasing focus for the DECR. During the expedition Jessly Robinson, laboratory manager at the DECR, received specialist training on two new machines. The first of these is a field-portable microtoxcology system (“MicroTox\") which can provide an indication of toxins present in sediment. The second piece of equipment is a spectrophotometric  system for measuring the concentrations of inorganic nutrients in seawater. Work on board included training in the use of this system to measure nitrite concentrations -  a useful indicator of sewage or agricultural pollution. Jessly’s training and this new equipment is providing TCI with the capacity to begin monitoring their water quality.  "
        },
        {
            "heading": 3,
            "text": "The final leg "
        },
        {
            "text": "The Beyond the Reef Caribbean Expedition is currently on the final leg of its voyage in the Cayman Islands. Here, scientists from the Cayman Government Department of Environment are working alongside the crew to continue investigations of the Caribbean’s lesser-known waters.  "
        },
        {
            "heading": 3,
            "text": "More about the Blue Belt Programme "
        },
        {
            "text": "The Blue Belt Programme is a collaborative partnership between the UK Overseas Territories and UK Government to enhance the protection and sustainable management of some of the world’s most unique marine environments. The Programme has established nearly 4 million square kilometres of marine protected areas. The Turks and Caicos Islands Government was the first Caribbean OT to partner with the Blue Belt Programme. Since joining in 2022, this partnership has gone from strength to strength.  "
        },
        {
            "text": "The Blue Belt Programme has supported TCI’s ambitions to conserve and manage its marine environments by providing technical and financial assistance, including a new research vessel. The data collected via the Beyond the Reef Caribbean Expedition is only the beginning. The  Programme will continue to work with the DECR and Department of Fisheries teams to utilise this new data to support TCI’s marine environment and blue economy. Enabling them to make evidence-based decisions on what happens within their waters. "
        },
        {
            "text": "This expedition builds on the success of previous missions, including the Discovery 159 survey to the Atlantic islands of Ascension and St Helena in 2022 – which saw the discovery of two new seamounts and some of the first recordings of cold-water coral reefs at a depth of 1,000 metres. "
        }
    ]
}