{
    "url": "https://defraenvironment.blog.gov.uk/2026/02/24/connecting-businesses-with-nature-relaunching-projects-for-nature/",
    "title": "Connecting businesses with nature: relaunching Projects for Nature ",
    "authors": [
        "Sarah Swash"
    ],
    "categories": [
        "Green finance",
        "Nature",
        "Wildlife"
    ],
    "pub_date": "2026-02-24T16:53:02+00:00",
    "content": [
        {
            "text": "Nature is one of our most valuable assets. It provides the food we eat, the water we drink and the landscapes that support our wellbeing and economy. Yet nature is under increasing pressure and public funding alone cannot deliver the scale of recovery that is urgently needed. That is why mobilising private investment into nature recovery is so important. "
        },
        {
            "text": "I’m Sarah Swash, Head of National Biodiversity at Defra, and in this post, I’m going to tell you about the next steps for Projects for Nature. Projects for Nature is a platform which connects corporate donations with government-screened nature recovery projects in England.   "
        },
        {
            "text": "As you may remember in our recent post, Projects for Nature is entering a new chapter led by Spacehive, a fundraising platform which connects businesses and other donors with credible, high-quality nature recovery projects across England. "
        },
        {
            "text": "Why nature needs private investment "
        },
        {
            "text": "Nature recovery needs investment at scale.  "
        },
        {
            "text": "Businesses are increasingly recognising both their dependence on nature and their impacts on it. Many are beginning to measure and address these impacts through initiatives such as the Taskforce on Nature-related Financial Disclosures and the Science Based Targets Network. But alongside reducing negative impacts, additional funding is needed to restore ecosystems and support large-scale species recovery. "
        },
        {
            "text": "Earlier this month countries from around the world came together in Manchester for the UK hosted IPBES 12th meeting, where 152 Member States signed off the Business and Biodiversity Assessment to guide the actions businesses can take to save nature. This is a significant milestone that helps bring clear, shared evidence into the decisions shaping our natural world. "
        },
        {
            "text": "The report is clear that every business depends on biodiversity, and every business impacts biodiversity. Nature loss is a clear systemic risk to all sectors and businesses, and to economic growth and wellbeing.  "
        },
        {
            "text": "What Projects for Nature offers businesses "
        },
        {
            "text": "Projects for Nature provides a simple, trusted way for businesses to support nature recovery in England.  "
        },
        {
            "text": "Projects on the platform have been screened to ensure they support local and national nature recovery priorities and are delivered by organisations such as the Wildlife Trusts and the National Trust. This helps businesses invest with confidence at the early stages of high-impact nature recovery projects. "
        },
        {
            "text": "To avoid greenwashing, businesses taking part in Projects for Nature undergo checks to ensure that their investment is genuinely additional to wider efforts to reduce carbon emissions and to minimise negative impacts on nature across their operations and supply chains. Investment through the platform cannot be used to claim ‘net zero’ or ‘nature positive’ status, but it can form part of a credible, transparent journey. "
        },
        {
            "text": "Proven impact from the pilot phase "
        },
        {
            "text": "Projects for Nature has already helped mobilise more than £800,000 of private investment in nature‑recovery projects across England, with this figure set to double based on existing commitments. Multi‑year corporate involvement has been central to this success, demonstrating the impact that long‑term partnerships can have in restoring and protecting our natural environment. "
        },
        {
            "text": "This funding has enabled the successful reintroduction of water voles to an area where they had been locally extinct for 20 years. Other funded projects will improve access to nature, deliver wider social benefits, create local jobs, strengthen habitat connectivity, and create and restore a range of habitats, including vital wetland areas. These habitats will support a variety of priority native species.  "
        },
        {
            "text": "Relaunching the platform with partners "
        },
        {
            "text": "Projects for Nature is now live on its refreshed online platform. The new platform makes it easier for businesses, individuals and project developers to explore opportunities and get involved. "
        },
        {
            "text": "We celebrated Projects for Nature, with an event at Camley Street Natural Park. The event brought together businesses already investing in nature recovery alongside organisations from across government, environmental charities, finance, infrastructure, engineering, energy, technology, community groups and professional services, all keen to learn more about the platform and how to get involved. "
        },
        {
            "text": "Minister Creagh attended, delivering a speech encouraging businesses to take action to be positive agents of change. This was followed by a panel discussion featuring a representative from Lloyd’s, a project funder, alongside a representative from Wildlife Countryside Link. In addition to representatives from National Trust and Heal Rewilding whose projects have received support through Projects for Nature, offering reflections from both sides of the funding relationship. "
        },
        {
            "text": "The Minister then shared her closing thoughts and reflections to round off the session. "
        },
        {
            "text": "Mary Creagh, Minister for Nature, said: "
        },
        {
            "text": "Nature underpins our economy, our communities and our wellbeing. Reaching our nature recovery goals depends on all of us, with every sector playing its part. "
        },
        {
            "text": "By backing nature recovery through private finance, businesses can become genuine agents of positive change. Projects for Nature shows the real impact businesses can have when they step forward to restore the natural world we all depend on\" "
        },
        {
            "text": "Misha Dhanak, CEO of Spacehive, said:  "
        },
        {
            "text": "\"The breadth of businesses interest in Projects for Nature demonstrates the growing commitment from the private sector to support nature recovery. The platform provides a clear and credible way for companies to convert that interest into action, backing local projects that deliver real benefits for landscapes, wildlife, and communities. "
        },
        {
            "text": "By connecting businesses with high-quality initiatives, the platform unlocks the investment needed to restore and protect our natural environment. We hope to inspire more businesses to step forward, fund projects, and help nature thrive where it's needed most\". "
        },
        {
            "text": "How to get involved "
        },
        {
            "text": "As we relaunch the platform, we invite businesses and partners to be part of the next chapter – supporting nature at the scale and pace it needs. There are several ways you can take part in Projects for Nature: "
        },
        {
            "text": "By providing trusted routes for private investment, Projects for Nature is helping turn ambition into action for nature recovery in England.  "
        }
    ]
}