{
    "url": "https://defrafarming.blog.gov.uk/2026/02/24/farming-equipment-and-technology-fund-2026-guidance-now-available/",
    "title": "Farming Equipment and Technology Fund 2026: guidance now available ",
    "authors": [
        "The Team"
    ],
    "categories": [
        "Payments for equipment, technology and infrastructure"
    ],
    "pub_date": "2026-02-24T16:51:46+00:00",
    "content": [
        {
            "text": "The application window for the next round of the Farming Equipment and Technology Fund (FETF 2026) will open on 17 March."
        },
        {
            "text": "Guidance for FETF 2026  is now available on GOV.UK to help you prepare."
        },
        {
            "heading": 2,
            "text": "Funding available"
        },
        {
            "text": "A total of £50 million will be available to farmers, growers, foresters and their contractors to invest in equipment and technology."
        },
        {
            "text": "Funding is split across 3 themes:"
        },
        {
            "text": "You can apply for a grant towards the cost of specific items from approved lists within these themes. In total, 290 items are eligible for funding."
        },
        {
            "text": "Grants range from £1,000 to £25,000 per theme. You can apply for items under more than one theme, up to a combined maximum of £75,000."
        },
        {
            "text": "We will pay a percentage of the cost of each item. The exact amount depends on the item you choose."
        },
        {
            "text": "These items can cut costs, improve efficiency and protect profits."
        },
        {
            "heading": 2,
            "text": "Changes in this round"
        },
        {
            "text": "We have made some changes to the fund:"
        },
        {
            "text": "This will be the final standalone round of FETF in its current form. We intend to bring together the strongest elements of our grant schemes from 2027 to simplify the application process and target funding more effectively."
        },
        {
            "heading": 2,
            "text": "Farm productivity  "
        },
        {
            "text": "This grant can help you improve efficiency on farm and strengthen profitability. "
        },
        {
            "text": "There are 70 productivity items available in this round, and you can apply for a grant towards any of them. We’ve added a range of new items this year, including autonomous UV-C light treatment.  "
        },
        {
            "text": "Items include: "
        },
        {
            "text": "The full list of items and specifications can be found in the guidance."
        },
        {
            "text": "Applications for productivity items are scored based on the extent to which they improve productivity, deliver environmental benefits, and how widely the items are used across the industry. "
        },
        {
            "heading": 2,
            "text": "Animal health and welfare  "
        },
        {
            "text": "Animal health and welfare grants are available to commercial farmers who keep pigs, sheep, dairy cows, beef cattle, laying hens or broilers.  "
        },
        {
            "text": "This grant can help you invest in equipment that improves livestock health and welfare — supporting productivity, product quality and more consistent production, while strengthening profitability.  "
        },
        {
            "text": "There are over 100 animal health and welfare items available in this round, and you can apply for a grant towards any of them."
        },
        {
            "text": "Items include: "
        },
        {
            "text": "We developed the list with input from farmers, vets, academics and industry groups. Following strong demand in FETF25, we’ve made only minor changes this year. "
        },
        {
            "text": "The full list of items and specifications can be found in the guidance."
        },
        {
            "text": "Your vet can help you identify the most useful improvements for your farm and the equipment that could support them. You can take advantage of our funded vet visit to have this conversation.  "
        },
        {
            "heading": 2,
            "text": "Slurry management "
        },
        {
            "text": "This grant can help you improve how you collect, store, test and apply slurry. "
        },
        {
            "text": "Better slurry management supports soil health and water and air quality, while helping you make the most of valuable nutrients — which can support nature and reduce the need for purchased fertiliser. "
        },
        {
            "text": "There are 17 slurry management items available in this round, including: "
        },
        {
            "text": "The full list of items and specifications can be found in the guidance."
        },
        {
            "text": "Applications for these items are scored based on how much they improve slurry management, the environmental benefits they deliver, and how widely the items are used across the industry. "
        },
        {
            "heading": 2,
            "text": "Preparing to apply "
        },
        {
            "text": "The guidance is available now, so you can decide which items best meet your business needs and start preparing your application. "
        },
        {
            "text": "The updated guidance includes: "
        },
        {
            "text": "When you apply, the contact details you enter must match the details registered in the Rural Payments service, so please check your information is up to date. "
        },
        {
            "text": "After the application window closes in late April, all applications will be reviewed and scored. As this is a competitive fund, you may not receive all or any of the funding you apply for. "
        },
        {
            "text": "Each theme has its own scoring rules to make sure public money is spent well.  "
        },
        {
            "heading": 2,
            "text": "Join our webinar  "
        },
        {
            "text": "We will host a webinar on Thursday 12 March at 10am."
        },
        {
            "text": "During the session, Defra and the Rural Payments Agency will cover:"
        },
        {
            "text": "We encourage anyone planning to apply to register for the webinar. "
        },
        {
            "text": "We will share the recording in this post and on our webinars page after the event. "
        },
        {
            "text": "If you’d like to receive an e-mail notification as soon as the grant opens for applications, subscribe to the Farming Blog. "
        }
    ]
}