{
    "url": "https://defrafarming.blog.gov.uk/2026/02/24/nfu26-how-were-building-farming-resilience/",
    "title": "NFU26: how we’re building farming resilience",
    "authors": [
        "The Team"
    ],
    "categories": [
        "Farming and Countryside Team"
    ],
    "pub_date": "2026-02-24T16:55:26+00:00",
    "content": [
        {
            "text": "Today at the National Farmers Union (NFU) conference, the Secretary of State Emma Reynolds shared more detail on how government will deliver its vision for agriculture in England."
        },
        {
            "text": "This vision is rooted in improving productivity, economic growth and innovation, building stronger partnerships across the supply chain and safeguarding food security."
        },
        {
            "text": "In this post, we’ll summarise the announcements in her speech and what they mean for the sector. You will find updates on:"
        },
        {
            "heading": 2,
            "text": "The Sustainable Farming Incentive (SFI)"
        },
        {
            "text": "For applicants eligible in the first window, SFI26 will open in June. In a dedicated post on SFI26, we set out what to expect, including specific updates to the scheme and a list of the actions with payment rates."
        },
        {
            "heading": 2,
            "text": "Grants"
        },
        {
            "heading": 3,
            "text": "The Farming Equipment and Technology Fund (FETF)"
        },
        {
            "text": "£50 million will soon be available to help farmers invest in kit that boosts productivity, improves slurry management, and strengthens animal health and welfare."
        },
        {
            "text": "Applications open on 17 March 2026 and will run for 6 weeks, closing on 27 April 2026. This will be the last FETF round in its current form. During 2026, we will look at how best to combine the strongest elements of our grants from 2027, making it easier to apply and ensuring we target funding effectively. "
        },
        {
            "text": "In a dedicated blog post on FETF, we share a link to the guidance and details of an upcoming webinar for you to learn more."
        },
        {
            "heading": 3,
            "text": "The Farming Innovation Programme"
        },
        {
            "text": "£70 million will be available through the Farming Innovation Programme to support new research and development that strengthens agriculture in this country."
        },
        {
            "text": "This includes £30 million for the Accelerating Development of Practices and Technologies (ADOPT) funding competition. ADOPT is designed to accelerate the uptake of innovative ideas on farms, helping farmers trial practical solutions and adopt approaches that build resilience."
        },
        {
            "text": "The next round will open on 9 April. We look forward to seeing more businesses access funding, share knowledge and adopt proven innovations."
        },
        {
            "text": "Visit the Farming Innovation Programme site for more information about the upcoming funding opportunities and how to apply."
        },
        {
            "heading": 3,
            "text": "Capital Grants"
        },
        {
            "text": "We will open a new round of the main ELM Capital Grants offer in July 2026."
        },
        {
            "text": "Capital Grants are payments that help cover the cost of one-off investments on farms, rather than ongoing payments. They fund tree planting, hedgerow restoration and improving water quality."
        },
        {
            "text": "Funding will increase from £150 million last year to £225 million in 2026."
        },
        {
            "text": "As before, we will provide updates on uptake when we reach 25%, 50% and 75% of the budget allocation. Guidance will be available on GOV.UK, closer to the opening."
        },
        {
            "text": "We'll share a more detailed blog post on Capital Grants in the next couple of weeks. Subscribe to the blog for a notification whenever we publish a new post. "
        },
        {
            "heading": 2,
            "text": "The Farming and Food Partnership Board"
        },
        {
            "text": "The Farming and Food Partnership Board will oversee the development of Sector Growth Plans, beginning with horticulture and poultry, with further sectors to follow."
        },
        {
            "text": "The plans will be practical in focus, identify ways to boost domestic production so more British produce reaches supermarket shelves."
        },
        {
            "text": "They will set out actions to increase productivity and improve resource efficiency. They will identify barriers to growth and profitability, including regulatory issues, and outline steps to address them. "
        },
        {
            "text": "The plans will assess how costs can be distributed more fairly across the farming and food supply chain."
        },
        {
            "text": "They will also look at how to predict and increase demand in different markets, including exports, supermarkets, hospitality and catering, and public-sector buying."
        },
        {
            "text": "Finally, the plans will make sure the sector grows in a way that supports wider goals, including protecting the environment and strengthening long-term food security."
        },
        {
            "text": "The first meeting of the board group is scheduled for March. The Secretary of State today confirmed that the NFU will sit on the board. More details on membership will follow."
        },
        {
            "heading": 2,
            "text": "The Farming Roadmap and Farming Profitability Review"
        },
        {
            "text": "The Secretary of State shared an update on progress with farmers, industry groups and other stakeholders to shape the Farming Roadmap."
        },
        {
            "text": "Over the past few months, workshops and meetings have taken place across the country to hear views and help ensure the roadmap reflects real experiences and the priorities that matter most."
        },
        {
            "text": "Engagement will continue, and the Farming Roadmap is due to be published later this year."
        },
        {
            "text": "Alongside the Farming Roadmap, we will also be publishing a full response to Baroness Batters’ Farming Profitability Review."
        },
        {
            "heading": 2,
            "text": "Animal health and welfare"
        },
        {
            "heading": 3,
            "text": "Consultation"
        },
        {
            "text": "A 12-week consultation, beginning today, seeks views on whether the Animal Health & Welfare Review (our annual vet visits offer, part of the Animal Health and Welfare Pathway) should become a mandatory requirement for all cattle, sheep, and pig farmers in England. "
        },
        {
            "text": "It also seeks feedback on a wider package of proposed mandatory measures, including:"
        },
        {
            "text": "These proposals have been developed in partnership with industry. During this work, everyone recognised that there is no single perfect solution. "
        },
        {
            "text": "There are several different approaches that could be taken, and this consultation is a chance to hear from a wider range of people so that the final approach is informed by the experience of those across the sector."
        },
        {
            "text": "The consultation opens today (24 February 2026) and will close 18 May 2026. "
        },
        {
            "text": "Share your views by responding to the consultation."
        },
        {
            "heading": 3,
            "text": "Support for poultry keepers"
        },
        {
            "text": "In addition to the consultation, we are today confirming a new grant providing funding for biosecurity advisory reviews for poultry keepers. These reviews will be delivered through on‑farm vet visits."
        },
        {
            "text": "This grant recognises both the cross‑government importance of food security to national security and the continued risk of Highly Pathogenic Avian Influenza to the poultry sector. This grant is funded by £390,000 from the Cabinet Office Integrated Security Fund. We plan to launch this summer."
        },
        {
            "text": "The measures are intended to support healthier animals, higher welfare, better productivity, stronger biosecurity, and more responsible use of medicines. "
        },
        {
            "text": "They also aim to help reduce greenhouse gas emissions and build greater resilience against future disease outbreaks. Strong standards can also help open new export opportunities and support the country in future trade discussions."
        },
        {
            "heading": 2,
            "text": "Farming Collaboration Fund"
        },
        {
            "text": "A series of workshops will take place through to April, bringing farmers together to hear the latest plans and take part in practical discussions about how the £30 million fund will work in practice."
        },
        {
            "text": "Each session will include a short presentation followed by a workshop discussion to gather feedback and shape delivery on the ground."
        },
        {
            "heading": 2,
            "text": "Stay up to date"
        },
        {
            "text": "We will keep you informed as details are confirmed and as new opportunities and guidance become available. There is more to do, and we will continue to share updates openly as we move forward."
        },
        {
            "text": "To follow progress on our work, subscribe to the Farming Blog. "
        },
        {
            "text": "Do bookmark the Funding for Farmers, growers and land managers page on GOV.UK. It lists grants and other funding to increase productivity, manage land to benefit the environment and support agricultural businesses."
        }
    ]
}