{
    "url": "https://hmlandregistry.blog.gov.uk/2026/02/24/right-first-time-planning-submissions/",
    "title": "Right-first-time planning submissions",
    "authors": [
        "Michael Kalam, Founder, UK Planning Gateway"
    ],
    "categories": [
        "Data"
    ],
    "pub_date": "2026-02-24T10:42:47+00:00",
    "content": [
        {
            "text": "UK Planning Gateway joined the Geovation Accelerator Programme in August 2025. The programme, backed by HM Land Registry and Ordnance Survey, provides geospatial and PropTech start-ups with grant funding and 12 months of support. "
        },
        {
            "text": "As Managing Director of Lapworth Architects for over 15 years, I realised the amount of friction caused by small inconsistencies in the planning system. That led me to found UK Planning Gateway to address the problem."
        },
        {
            "text": "We’re a small team working across England and Wales, focused on improving how planning applications are prepared and validated before they reach a local authority."
        },
        {
            "text": "Our primary users are architects and planning professionals, but the benefits extend further to planning officers, councils and anyone who wants a clearer route through the process."
        },
        {
            "heading": 2,
            "text": "Why we started"
        },
        {
            "text": "The idea came directly from experience. Time and again, I saw planning delays blamed on “the system”, but a lot of wasted time comes from smaller, fixable things. I kept seeing applications slowed down because the basics did not line up: boundaries that did not match the registered extent, unclear ownership, or site information being re-entered and re-checked across multiple steps. None of that improves decision-making. It just creates admin. "
        },
        {
            "text": "Even small clarification requests can extend the decision process, particularly where revised plans or notices are required."
        },
        {
            "text": "Across England alone, more than 400,000 planning applications are submitted each year. Even marginal reductions in clarification requests across a proportion of these applications can translate into meaningful time savings for applicants and local authorities alike."
        },
        {
            "heading": 2,
            "text": "How we use HM Land Registry data"
        },
        {
            "text": "UK Planning Gateway brings HM Land Registry data together with Ordnance Survey mapping and local authority validation requirements at the point of submitting a planning application. Rather than treating land data as something to review retrospectively, we help users consider it upfront, so that what is being applied for aligns more closely with what is actually owned and registered."
        },
        {
            "text": "We are currently supporting applications submitted to local authorities using this approach. By checking site boundaries and ownership information earlier in the process, clarification requests can often be resolved before submission, reducing the likelihood of revised drawings or additional correspondence after validation."
        },
        {
            "heading": 2,
            "text": "Meaningful benefits"
        },
        {
            "text": "While the precise time impact varies by project, practitioners report that avoiding even a single round of clarification can prevent several days of additional drafting, reissuing and coordination."
        },
        {
            "text": "Robert Kerr, Director at RK Design, put it like this:"
        },
        {
            "text": "While we are still at an early stage, feedback like this has reinforced the value of addressing land data issues before planning application submission. Even small reductions in clarification requests can translate into measurable time savings when applied consistently."
        },
        {
            "heading": 2,
            "text": "Geovation’s impact"
        },
        {
            "text": "Our participation in the Geovation Accelerator Programme was instrumental in shaping this thinking. We joined the programme in August 2025, gaining access not only to HM Land Registry datasets such as title register data and title extent polygons, but to expert challenge and insight into how land data can be applied more effectively within existing planning application workflows."
        },
        {
            "text": "The programme also connected us with other PropTech companies facing similar challenges and provided us with mentorship that helped us move from concept to working product. That support network continues to be valuable as we grow."
        },
        {
            "heading": 2,
            "text": "What’s next"
        },
        {
            "text": "Looking ahead, we are focused on continuing to bring greater clarity to site information at the earliest stage of the planning process. The next step is making it easier for applicants to check that boundaries and ownership details are consistent before they submit an application and sharing what we learn as more applications move through the system."
        },
        {
            "text": "Our goal at UK Planning Gateway is to help the planning infrastructure work more quickly and efficiently for everyone involved."
        },
        {
            "text": "https://www.linkedin.com/company/ukplanninggateway"
        }
    ]
}