{
    "url": "https://defrafarming.blog.gov.uk/2026/02/24/sfi26-details-definitions-and-what-to-expect/",
    "title": "SFI26: details, definitions and what to expect",
    "authors": [
        "The Team"
    ],
    "categories": [
        "Farming and Countryside Team"
    ],
    "pub_date": "2026-02-24T16:55:59+00:00",
    "content": [
        {
            "text": "In this post, we explain what to expect from the Sustainable Farming Incentive (SFI) offer in 2026."
        },
        {
            "text": "We also share the list of the 71 actions available in the new offer, with payment rates."
        },
        {
            "heading": 2,
            "text": "What to expect from SFI26"
        },
        {
            "text": "The overall ambition for SFI remains the same: to support farmers to manage their land in ways that deliver environmental benefits as they produce food."
        },
        {
            "text": "We’ve worked closely with stakeholders to shape the policy design of this year’s offer."
        },
        {
            "text": "Last year, we held workshops and forums with over 30 stakeholder organisations to discuss policy issues and the overall design principles for SFI. We used the insight from these discussions to develop options and proposals for the 2026 offer."
        },
        {
            "text": "In early 2026, we ran another series of workshops and forums to test those options and talk through the considerations in more detail. We then used stakeholders’ feedback to refine and strengthen the policy detail within the scheme."
        },
        {
            "text": "The SFI26 offer will be simpler, with fewer actions and less complexity while still having plenty of actions available for all farm types, so you can pick the actions that best fit your farm."
        },
        {
            "text": "The new offer includes 71 actions, down from 102 in the SFI24 offer. In practice, this means 31 actions have been removed (around one‑third of the previous offer)."
        },
        {
            "text": "We have focused on removing actions with low uptake or those that delivered less for food production, the environment, or our wider environmental targets."
        },
        {
            "text": "Fairness and access will improve. By reducing some payment rates, introducing an area cap for the enhanced overwinter stubble action, and applying a new annual agreement cap of £100,000, we can ensure that more farms are able to participate and benefit. These changes will also help us meet the Environmental Improvement Plan goal of doubling the number of farms delivering for wildlife."
        },
        {
            "text": "The list of actions is at the end of this post, and we will publish the full scheme guidance and the budget for the first window before it opens."
        },
        {
            "text": "We will provide clear updates as funding is committed in each window."
        },
        {
            "text": "The core design of SFI will provide a stable framework for the rest of this Parliament, though we expect to make refinements and improvements where we can."
        },
        {
            "heading": 2,
            "text": "Scheme updates"
        },
        {
            "heading": 2,
            "text": "Application windows and eligibility"
        },
        {
            "text": "To be eligible for SFI26 (for both Windows 1 and 2) farmers should have at least 3 hectares (ha) of agricultural land."
        },
        {
            "text": "We set this threshold following discussions with the sector and to reflect the recommendation made by Baroness Batters in her recent Farming Profitability Review."
        },
        {
            "heading": 3,
            "text": "Window 1"
        },
        {
            "text": "Window 1 will open in June 2026 and will remain open for around 2 months – although it may close sooner if demand is high and the Window 1 budget is fully allocated. It will be open to both small farms and also farms without an existing environmental land management (ELM) revenue agreement."
        },
        {
            "heading": 3,
            "text": "Window 2"
        },
        {
            "text": "Window 2 will open in September 2026 for all farms. "
        },
        {
            "text": "We cannot set a fixed end-date at this point, because this will depend on how many farmers apply."
        },
        {
            "heading": 2,
            "text": "Limits"
        },
        {
            "text": "For SFI26 agreements, caps will be placed on:"
        },
        {
            "heading": 2,
            "text": "Payment Rates"
        },
        {
            "text": "Some payment rates have been adjusted. The revised payment rates still follow the established approach used across SFI, based on ‘income foregone plus costs’."
        },
        {
            "text": "We will no longer offer the SFI management payment. It was intended as a time-limited payment to support farmers transitioning into the new scheme. This measure will release more funding so we can offer more agreements."
        },
        {
            "heading": 3,
            "text": "Rate increases"
        },
        {
            "text": "We're increasing payments for some moorland actions, namely 3 livestock grazing rates and 2 shepherding livestock rates."
        },
        {
            "text": "We will apply the uplift to existing SFI agreements and SFI26 agreements. This is to ensure upland farmers are properly compensated given recent changes in livestock prices."
        },
        {
            "heading": 3,
            "text": "Rate reductions"
        },
        {
            "text": "We will reduce payment rates for:"
        },
        {
            "text": "Reductions are being made because initial payment rates for these actions were set too high. This made it too attractive to take highly productive land out of food production. We're recalibrating them to reflect current margins and to support, not undermine, food production."
        },
        {
            "text": "This will help us to spread funding more widely, so more farmers can access agreements. They are also intended to help keep more land in production."
        },
        {
            "text": "The reductions won’t be retroactive. They will only apply to SFI26 agreements. Existing SFI23 and SFI24 agreements which contain these actions will not be affected."
        },
        {
            "heading": 2,
            "text": "Turning 5-year actions into 3-year actions"
        },
        {
            "text": "Actions with a 5-year duration will become 3-year actions in SFI26. This change is designed to simplify the scheme and make these actions more accessible for short-term tenant farmers."
        },
        {
            "heading": 2,
            "text": "Base and supplemental actions"
        },
        {
            "text": "Farmers applying for the SFI26 offer will only be able to apply for a base action and its supplemental action together, in the same agreement, at the same time."
        },
        {
            "text": "Supplemental actions can only be done alongside a base SFI action because they are designed to add to the base action and do not work on their own. Keeping them on the same timescales will improve value for money and help deliver better environmental outcomes."
        },
        {
            "heading": 1,
            "text": "The SFI26 offer"
        },
        {
            "text": "The tables below set out the 71 actions in the SFI26 offer, alongside the actions from SFI24 that will not be included. "
        },
        {
            "text": "We've grouped the actions by theme."
        },
        {
            "text": "We’ve designed the SFI26 offer to be simpler, while still giving farmers plenty of choice and supporting sustainable food production."
        },
        {
            "text": "We’ve prioritised actions that offer strong value for money and contribute to the government’s Environmental Improvement Plan targets for water quality and biodiversity. This includes the ambition to double the number of farms providing year-round resources for farm wildlife by December 2030 (compared with 2025)."
        },
        {
            "heading": 2,
            "text": "Number of SFI26 actions by theme "
        },
        {
            "heading": 2,
            "text": "Actions and payment rates by theme"
        },
        {
            "heading": 3,
            "text": "Table 1: Agroforestry "
        },
        {
            "text": "Reason for inclusion: AGF1 and AGF2 were first introduced in SFI24. Currently they have low/moderate uptake, but we expect this to increase over time. They have potential to make a moderate/high contribution to our environmental targets."
        },
        {
            "heading": 3,
            "text": "Table 2: Boundary features "
        },
        {
            "text": "Reason for including: CHRW2 has very high uptake and makes a moderate/high contribution to biodiversity targets. It provides an important habitat corridor across farmland for birds, mammals, butterflies and bees. "
        },
        {
            "text": "BND1 and BND2 have moderate uptake and form part of the SFI26 offer for upland farmers, and lowland farmers, for example in Devon and Cornwall. These actions are also part of our commitment to the historic environment. "
        },
        {
            "text": "Reason for removing: CHRW1 has very high uptake, but it is being removed because it does not deliver direct environmental benefits and therefore gives very low value for money. CHRW3 also has very high uptake and low value for money. The removal of CHRW3 means we will no longer pay specifically for the maintenance of existing hedgerow trees (which gives limited additional environmental benefit because most farmers maintain these trees anyway). However, farmers will still be able to manage hedgerows through CHRW2, which is being retained. There are capital grants (BN11 and TE1) which pay for the creation of new hedgerows, and the planting of new hedgerow trees."
        },
        {
            "heading": 3,
            "text": "Table 3: Buffer strips "
        },
        {
            "text": "Reason for including: CAHL4 has high uptake and the other 3 buffer strip actions have moderate uptake. All 4 actions deliver high-very high value for money and make a moderate/high contribution to our environmental targets. "
        },
        {
            "text": "Reason for removing: All of these actions had low or very low uptake and alternative actions will remain in the SFI26 offer which can be used to deliver similar aims. For example, BFS1: 12m-24m watercourse buffer strip on cultivated land can be used to buffer ponds and CAHL3: Grassy field corners or blocks can be used to protect in-field trees. "
        },
        {
            "heading": 3,
            "text": "Table 4: Farmland wildlife (arable/horticultural land) "
        },
        {
            "text": "* Decreased payment rate will apply to new SFI26 agreements only "
        },
        {
            "text": "Reason for including: Most of these actions have moderate to high uptake and deliver moderate to high value for money. Some (for example, AHW3: Beetle banks and AHW4: Skylark plots) are niche actions with low uptake but deliver high to very high value for money. Overall, this package of farmland wildlife actions makes a strong contribution to our environmental targets. "
        },
        {
            "text": "Reason for removing: AHW1 and AHW12 have low uptake and alternative actions will remain in the SFI26 offer which deliver similar aims (for example, CAHL1: Pollen and nectar mix, CAHL2: Winter bird food, and CAHL3: Field corners and blocks). "
        },
        {
            "heading": 3,
            "text": "Table 5: Farmland wildlife (grassland) "
        },
        {
            "text": "Reason for including: Like the arable farmland wildlife package, most of these grassland actions have moderate to high uptake and deliver moderate to high value for money. Some (for example, GRH1: Manage rough grazing for birds) currently have low uptake but deliver high to very high value for money. They also support important grassland habitat for birds in the uplands. Overall, this package of farmland wildlife actions makes a strong contribution to our environmental targets. "
        },
        {
            "text": "Reason for removing: GRH6 had moderate uptake. It was the only endorsed action in the SFI24 offer. It’s being removed as part of the simplification of SFI26 as it required bespoke Natural England adviser endorsement. An equivalent of GRH6 is in the CS Higher Tier offer.  "
        },
        {
            "text": "GRH11 is a supplemental action with moderate uptake. It makes little contribution to our water and biodiversity targets. Also, it is more suited to CS Higher Tier (which includes an equivalent action) where advice can be given on the suitability of sites and management can be tailored to suit the sites. "
        },
        {
            "heading": 3,
            "text": "Table 6: Heritage "
        },
        {
            "text": "Reason for including: While these actions make a smaller direct contribution to our environmental targets, we’re keeping them to recognise and support the historic rural environment. "
        },
        {
            "text": "Reason for removing: HEF2 has very low uptake, gives little or no contribution to our water quality or biodiversity targets. Also, we’re retaining the more popular alternative action (HEF1).  "
        },
        {
            "text": "HEF5 has very low uptake. Also, it is more suited to CS Higher Tier (which includes an equivalent action) where advice can be given on the suitability of sites and management can be tailored to suit the sites. "
        },
        {
            "text": "HEF8 has low uptake and makes little to no contribution to our environmental targets. Also, there are alternative SFI actions which partially deliver the same aims (for example, buffer strip actions). "
        },
        {
            "heading": 3,
            "text": "Table 7: Integrated pest management "
        },
        {
            "text": "Reason for including:  These 3 actions all have high or very high uptake and contribute to our environmental targets. CIPM2 and CIPM3 both have very high value for money, with CIPM4 having moderate value for money. CIPM2 creates habitats for pollinators. CIPM3 and CIPM4 both support sustainable crop production. "
        },
        {
            "text": "Reason for removing: CIPM1 has very high uptake, but (like other planning actions) it does not deliver direct environment benefits and therefore delivers poor value for money. "
        },
        {
            "heading": 3,
            "text": "Table 8: Moorland "
        },
        {
            "text": "* Increased payment rates will apply to existing SFI and new SFI26 agreements "
        },
        {
            "text": "Reason for including: We are keeping 8 moorland actions, all of which are actions first introduced in SFI24. Whilst uptake for these actions is either low or very low, many moorlands are still in legacy agri-environment agreements, which limits their access to similar actions in SFI.  "
        },
        {
            "text": "Reason for removing: CMOR1 has moderate uptake but (as with other planning actions) it does not deliver direct environmental benefits and therefore is likely to deliver poor value for money. UPL4, UPL7 and UPL9 have low uptake  and alternative actions exist in the 8 moorland actions we are keeping. "
        },
        {
            "heading": 3,
            "text": "Table 9: Nutrient management "
        },
        {
            "text": "*Decreased payment rate will apply to new SFI26 agreements only. "
        },
        {
            "text": "Reason for including: CNUM2 and CNUM3 have high uptake and deliver very high and medium value for money respectively. Both actions contribute strongly to our water quality and biodiversity targets and support food production by helping improve soil health. "
        },
        {
            "text": "Reason for removing: CNUM1 has very high uptake but (as with other planning actions) does not deliver direct environmental benefits and therefore delivers poor value for money. "
        },
        {
            "heading": 3,
            "text": "Table 10: Organic "
        },
        {
            "text": "Reason for including: We are keeping 11 specialist organic actions, even though currently they have relatively low uptake. This includes 5 organic conversion actions to support farmers in the process of conversion, and 6 organic management actions. Organic farmers can also apply for conventional SFI actions. "
        },
        {
            "text": "Reason for removing: We are removing OFA1, OFA3 and OFA6 because they have very low uptake, and alternatives are available (AHW6: Basic overwinter stubble, AHW2: Supplementary winter bird food, and CIPM3: Companion crops). "
        },
        {
            "heading": 3,
            "text": "Table 11: Precision farming "
        },
        {
            "text": "Reason for including: We are keeping 3 precision farming actions, all of which were introduced in SFI24. PRF1 has high uptake and very high value for money. It makes a moderate/high contribution to our water quality target and supports food production by helping improve nutrient use efficiency. PRF2 and PRF4 currently have low uptake but are being kept in the offer because they have potential to deliver for the environment and support food production (for example, by improving soil health and reducing use of herbicides). "
        },
        {
            "text": "Reason for removing: PRF3 is being removed because it has very low uptake. Very few contractors and farmers have the necessary equipment to do this action. "
        },
        {
            "heading": 3,
            "text": "Table 12: Soil health "
        },
        {
            "text": "* Decreased payment rate will apply to new SFI26 agreements only "
        },
        {
            "text": "Reason for including: CSAM2 and CSAM3 have very high uptake, while SOH1 and SOH3 have moderate uptake. All 4 actions deliver high to very high value for money. They make a moderate/high contribution to our environmental targets. Also, they all support food production by helping improve soil health. "
        },
        {
            "text": "Reason for removing: CSAM1 has very high uptake but (as with other planning actions) does not deliver direct environmental benefits and therefore delivers poor value for money. SOH2 and SOH4 have low/moderate uptake. Also, alternative actions are available that deliver similar benefits (for example, SOH3: Multi-species summer sown cover crop, CIPM3: Companion crop, and CSAM2: Winter cover crop).  "
        },
        {
            "heading": 3,
            "text": "Table 13: Species recovery and management "
        },
        {
            "text": "Reason for including: These 2 native breeds actions have low/moderate uptake and do not contribute directly to our water quality or biodiversity targets. However, we are keeping these actions to help show the government’s commitment to supporting the preservation of native breeds. "
        },
        {
            "text": "Reason for removing: SPM2 and SPM4 have low uptake and do not help us move towards our water quality or biodiversity targets. Also, we are keeping the 2 alternative versions of these native breeds actions. "
        },
        {
            "heading": 3,
            "text": "Table 14: Waterbodies "
        },
        {
            "text": "Reason for including: We are keeping these 6 actions because most of them deliver high value for money and make a vital contribution to our water quality and biodiversity targets.  "
        },
        {
            "text": "Reason for removing: WBD5, WBD8 and WBD9 are being removed as part of the simplification of the SFI offer. All have low uptake. "
        },
        {
            "heading": 2,
            "text": "Stay up to date  "
        },
        {
            "text": "To follow progress on all this work, subscribe to the Farming Blog. We will keep you informed as details are confirmed and as new opportunities and guidance become available. There is more to do, and we will continue to share updates openly as we move forward. "
        },
        {
            "text": "Do bookmark the Funding for Farmers, growers and land managers page on GOV.UK. It lists grants and other funding to increase productivity, manage land to benefit the environment and support agricultural businesses. "
        }
    ]
}