{
    "url": "https://naturalengland.blog.gov.uk/2026/02/24/the-bat-advice-service-bas-reforming-natural-englands-advice-for-householders/",
    "title": "The Bat Advice Service (BAS) – Reforming Natural England’s advice for householders ",
    "authors": [
        "Matthew Heard"
    ],
    "categories": [
        "Development",
        "Licensing",
        "Natural England",
        "Nature",
        "Protected sites and species"
    ],
    "pub_date": "2026-02-24T14:42:14+00:00",
    "content": [
        {
            "text": "By Matt Heard, National Delivery Director"
        },
        {
            "text": "In this blog we explain how we are reforming the Bat Advice Service, the free support available to householders and places of worship who have bat roosts in their buildings. We cover what the current service offers, why we're making changes, and what the new approach will mean for anyone who needs advice about living alongside bats or planning building work. We also set out the timeline for these changes and how you can provide feedback. "
        },
        {
            "text": "Bats play a crucial role in Britain's ecosystems. As the only flying mammals in the UK, they act as important indicators of environmental health. Thriving bat populations signals a healthy, balanced ecosystem. "
        },
        {
            "text": "The UK is home to 18 species of bat. However, their populations have suffered significant historical declines, this means that all species of bats in the UK are protected by law. Loss of natural habitats means some bat species have been forced to find safe havens in buildings including homes and places of worship."
        },
        {
            "text": "These roosts are becoming essential for the survival of many bat species, but this means that people may need advice to help them live with their bat roosts, especially if they are planning repairs or maintenance.  "
        },
        {
            "text": "Natural England are currently changing how we provide this free advice to householders who have bat roosts through the Bat Advice Service.  "
        },
        {
            "text": "If you are a householder or place of worship in England and think you have a bat roost then you may be able to get free advice if you: "
        },
        {
            "text": "This is the Bat Advice Service (BAS), and it is currently delivered as part of the National Bat Helpline by the Bat Conservation Trust (BCT) on behalf of Natural England.  "
        },
        {
            "text": "The helpline can provide advice over the phone in many cases. Other people will need to wait to receive written advice until after one of Natural England’s volunteer roost visitors have inspected their property. This is because the BAS relies on the generosity of our volunteers to do these inspections in their own time, and Natural England and BCT need time to review their reports before writing advice.  "
        },
        {
            "text": "There are also limits on the types of work that the BAS can advise on. For example, it does not provide free advice for works that need planning permission or for larger-scale repairs. "
        },
        {
            "text": "These limits aren’t caused by the BCT or their helpline – they’re just part of the restrictions and limits of the current BAS.  "
        },
        {
            "heading": 4,
            "text": "What is changing and why are we doing this? "
        },
        {
            "text": "Natural England’s new strategy sets out how we are streamlining regulation to not only focus on outcomes but also to prioritise resources in areas that deliver the greatest benefit for communities and nature. This includes situations where we provide regulatory advice, like we do through the BAS."
        },
        {
            "text": "Alongside this, Dan Corry’s review into environmental regulation recommended that we focus our efforts on the proportionality of regulation, and shift to providing more digital advice that can be accessed immediately."
        },
        {
            "text": "We have looked at how the BAS currently operates and we see an opportunity to move more of this support online, with that advice coming directly from Natural England. This will let us change our focus and reduce the wait many people have before receiving written advice, especially when they are planning or carrying out repair or maintenance works."
        },
        {
            "text": "We know online advice won’t work for everyone. Some people may struggle to use online resources and others will need the reassurance and expertise from a visit by a bat worker. We’re factoring this in, although the situations where you can expect a free site visit will change."
        },
        {
            "heading": 4,
            "text": "The benefits of the new service "
        },
        {
            "text": "Over the coming months we will be developing a new approach which will use an online service to allow a householder to provide information about their situation. The service will then aim to:"
        },
        {
            "text": "Our ambition is that this will make it easier for householders to get the advice they need, including some cases where they wouldn’t have been able to get free advice from the BAS in the past."
        },
        {
            "text": "We’ve learned a lot working with BCT and their expertise has helped thousands of households. We are using this knowledge to help shape our new approach."
        },
        {
            "heading": 4,
            "text": "When will this happen and what if I need the bat advice service before then? "
        },
        {
            "text": "We want to make sure we get this right, and so we don’t have an exact launch date yet. We are working on this over the coming year and would expect the new service to be launched before March 2027. We will make further announcements once the new service is ready."
        },
        {
            "text": "Until the new service is ready you can still access the BAS through the BCT helpline as normal. We will make sure there is a smooth transition once the new service is ready."
        },
        {
            "heading": 4,
            "text": "Places of worship"
        },
        {
            "text": "Unlike houses, places of worship often have complex issues living with bats as many support large and important bat roosts. We do not expect places of worship will use our new online service to access bat advice.  "
        },
        {
            "text": "As we develop our new approach, we will be looking at how we can continue to support places of worship who are living with bats. In the meantime, if you are responsible for a place of worship then you can continue to access the BAS through the BCT. "
        },
        {
            "heading": 4,
            "text": "Provide feedback "
        },
        {
            "text": "We understand that many of you may have feedback about our plans for the Bat Advice Service, especially if you have used it in the past. If you have any initial feedback, you can send this to  BatAdviceService.Feedback@naturalengland.org.uk. "
        },
        {
            "text": "We will not be able to respond to individual emails or questions, however all feedback will be considered as part of our work.  "
        }
    ]
}