{
    "url": "https://defrafarming.blog.gov.uk/2022/05/23/farming-investment-fund-a-new-grant/",
    "title": "Farming Investment Fund: a new grant",
    "authors": [
        "Gordon Jones"
    ],
    "categories": [
        "Payments for equipment, technology and infrastructure"
    ],
    "pub_date": "2022-05-23T15:00:12+01:00",
    "content": [
        {
            "text": "In November, we launched the Farming Investment Fund. "
        },
        {
            "text": "It included the Farming Equipment and Technology Fund and the Water Management theme of the Farming Transformation Fund. An Improving Farm Productivity theme was added in January 2022.  "
        },
        {
            "text": "We're really pleased with the level of interest across all the offers so far."
        },
        {
            "text": "Before we launched Improving Farm Productivity in January, we made the manual available for people to look at on GOV.UK. Feedback suggests you found this helpful. So ahead of its launch in June, we are making the manual for the next theme available today: Adding Value.   "
        },
        {
            "heading": 2,
            "text": "Adding Value"
        },
        {
            "text": "This £30 million fund will offer grants focused on supporting farmers and growers to process, diversify and add-value to their products.  It will offer grants of between £25,000 and £300,000 for up to 40% of eligible project costs.  "
        },
        {
            "text": "By way of a short introduction, the grants awarded through Adding Value will pay for capital items to enable you to add value to eligible agricultural products, after they’ve been harvested or reared. Details on eligible capital items is contained within the manual. They include:   "
        },
        {
            "text": "You can apply for a grant if you are: "
        },
        {
            "text": "The manual for Adding Value is available on GOV.UK."
        },
        {
            "heading": 2,
            "text": "Applying"
        },
        {
            "text": "You won’t be able to apply for Adding Value grants until it launches in June, but this manual should help you consider your options and to make a choice in a timely way. It provides information on eligibility and what is and isn’t included.  "
        },
        {
            "text": "Remember, you can also apply for more than one theme under the Farming Transformation Fund, so long as the application windows are open."
        },
        {
            "text": " This is in addition to an application under the Farming Equipment and Technology Fund up to the £25,000 maximum for that fund. "
        },
        {
            "heading": 3,
            "text": "Step 1: An eligibility and desirability check  "
        },
        {
            "text": "We’ve created an online checker, which will be available as soon as the application window opens in June. It will give you an idea of your chance of success. Please note, Adding Value grants apply to England only. "
        },
        {
            "heading": 3,
            "text": "Step 2: An invitation  "
        },
        {
            "text": "If your project scores highly enough, we will invite you to submit a full application. You will need to complete a full application form and send this with your supporting documents (including quotes) to the Rural Payments Agency (RPA) by email.  "
        },
        {
            "text": "Successful projects will be provided with details about how to do this when the scheme is open for applications.   "
        },
        {
            "text": "You will then have until 31 January 2024 to submit your full application. If you need planning permission, then this must be approved and submitted with your full application.  "
        },
        {
            "heading": 2,
            "text": "Dates for your calendars   "
        },
        {
            "text": "If you have any questions about the new Adding Value grant, or comments on our Farming Investment Fund offer, please comment below. For information about your personal situation, contact the Rural Payments Agency:  FTF@rpa.gov.uk ."
        },
        {
            "heading": 2,
            "text": "A webinar to learn more about funding opportunities"
        },
        {
            "text": "We are hosting a webinar for people to learn more about innovation and productivity funding opportunities. The team will be on hand to answer questions."
        },
        {
            "text": "Sign up for the event on Tue 31 May 2022 at 11:00."
        }
    ]
}