{
    "url": "https://defrafarming.blog.gov.uk/2022/05/23/further-funding-for-farmers-foresters-and-growers-to-innovate/",
    "title": "Further funding for farmers, foresters and growers to innovate",
    "authors": [
        "Niall Bradshaw"
    ],
    "categories": [
        "Payments for research and innovation"
    ],
    "pub_date": "2022-05-23T16:59:44+01:00",
    "content": [
        {
            "text": "The Farming Innovation Programme provides research and development funding to farmers and growers who want to develop and use new, innovative methods and technologies. "
        },
        {
            "text": "The aim of the fund is to support farmers to become more productive, environmentally sustainable and resilient to the global food security challenges of the future.  "
        },
        {
            "text": "You might remember that alongside UK Research & Innovation (UKRI) we launched the first rounds of funding in October, and 2 more in March. "
        },
        {
            "text": "In this post, I’ll share information about our latest funding opportunity: the Research Starter Projects Competition. "
        },
        {
            "heading": 2,
            "text": "A way into innovation  "
        },
        {
            "text": "The Research Starter Projects competition is designed to be an entry point to the innovation process for farmers, growers or foresters who have bold, ambitious, early-stage ideas for solving major problems. "
        },
        {
            "text": "Innovation in this space would benefit both you and the wider farming and growing community, and these small projects might lead to big impacts. "
        },
        {
            "text": "The specific aims of this competition are to:  "
        },
        {
            "text": "The application window for expressions of interest opens today, 23 May 2022. "
        },
        {
            "text": "This competition is for individual farming, growing or forestry businesses based in England. They will be able to apply for a share of up to £1 million for small, 1-year feasibility projects. "
        },
        {
            "text": "Read the full guidance on the Research Starter Projects competition on GOV.UK.  "
        },
        {
            "text": "We want to fund a portfolio of projects, across a variety of technologies, industry sectors, and business sizes. "
        },
        {
            "text": "We want your proposals to address a significant industry challenge across the farming subsectors of livestock, plants (including arable, horticulture and ornamentals), novel food production systems, bioeconomy and agroforestry.  "
        },
        {
            "heading": 2,
            "text": "The application process   "
        },
        {
            "text": "To lead an application, you must be an active farming, growing or forestry business of any size, and your business must be based in England. "
        },
        {
            "text": "This will be a 2-stage application. "
        },
        {
            "heading": 3,
            "text": "Stage 1 "
        },
        {
            "text": "The lead farmer, grower or forester must complete an expression of interest by answering a few simple questions setting out your idea in a video recording. It will then be assessed. "
        },
        {
            "heading": 3,
            "text": "Stage 2 "
        },
        {
            "text": "Following assessment, the best, most ambitious and feasible ideas will be invited to complete a full application.  "
        },
        {
            "text": "At this point, applicants will be offered help to make connections and find project partners from industry and academia who can assist with the full application, and eventually help applicants to complete their projects. "
        },
        {
            "text": "Businesses based elsewhere in the UK can’t lead a project, but they can be project partners. All we ask is that of the funding going to farming, growing or forestry businesses in a project team, at least half must go to farmers or growers based in England. "
        },
        {
            "text": "Projects can last up to 12 months, starting in spring 2023, and will have total project costs between £28,000 and £56,000, with the project expected to carry out all of its work in the UK.  "
        },
        {
            "text": "At the end of your project, if it is delivering some promising results, you and your new consortium could apply into one of our bigger funding opportunities in the Farming Innovation Programme.  "
        },
        {
            "heading": 2,
            "text": "Dates for your diary "
        },
        {
            "text": "The application window for expressions of interest opens today, 23 May 2022, and will close on 6 July 2022. More details can be found in the Research Starter Project application guidance. "
        },
        {
            "text": "If you want to find out more about the programme and application process, Innovate UK KTN (formerly the Knowledge Transfer Network) held an applicant briefing event. You can watch a recording of the event. "
        },
        {
            "text": "Defra will be holding a webinar providing more details on this competition, alongside more information on the third theme of the Farming Investment Fund on ‘Adding Value’, on Wednesday 31 May, at 11am. Register to attend."
        },
        {
            "text": " Visit the Farming Innovation Programme website for more information about the entire programme.   "
        },
        {
            "text": " Finally, if you have any questions about these new competitions, comment below.  "
        }
    ]
}