{
    "url": "https://educationhub.blog.gov.uk/2022/05/23/how-were-supporting-families-in-need-and-keeping-children-safe/",
    "title": "How we’re supporting families in need and keeping children safe",
    "authors": [
        "media officer"
    ],
    "categories": [
        "Child protection",
        "children in care",
        "Looked after children",
        "Social work"
    ],
    "pub_date": "2022-05-23T17:17:00+01:00",
    "content": [
        {
            "text": "This week, the results of a yearlong piece of work into children’s social care has been published."
        },
        {
            "text": "We are setting out initial new measures in response to recommendations set out in Josh MacAlister’s independent review of children’s social care, which looked at how children and their families interact with the care system and how it can be improved."
        },
        {
            "text": "We are at the start of a journey that will see a fundamental shift in how we think about children’s social care – here is what that means."
        },
        {
            "heading": 3,
            "text": "We want to support families "
        },
        {
            "text": "Our focus must be squarely on supporting families in need and providing the help they need before reaching crisis point, so that – wherever possible – they can stay together safely."
        },
        {
            "text": "That’s why we’ve announced a network of family hubs and this week we’ve announced seven more."
        },
        {
            "text": "Seven areas in England will receive a share of £12 million to set up a new Family Hub, increasing the number of families who can access this kind of help when they need it."
        },
        {
            "text": "Family hubs are one-stop-shops where families can access important services."
        },
        {
            "text": "Evidence shows that some of the most disadvantaged families don’t access these vital services."
        },
        {
            "text": "An effective family hub acts as a single ‘front door’, making it easier for families to get the help they need, and to improve the support on offer. This can include parenting support and infant feeding advice."
        },
        {
            "text": "All families need a bit of help at times and an effective family hub will make it easier for parents to get support and ensure better outcomes for them and their children."
        },
        {
            "text": "Alongside this funding, we are also carrying out work with the Anna Freud National Centre for Family Hubs to ensure all our investment is practice-led, evidence-based and informed by families’ own experiences."
        },
        {
            "heading": 3,
            "text": "More social workers in schools help us keep children safe"
        },
        {
            "text": " We are also ensuring there are more social workers working onsite with teachers to support the most vulnerable children with their learning and attendance."
        },
        {
            "text": "To support vulnerable children with their education, a trial that places social workers onsite in schools has been extended to 2023, benefitting 20 schools in England."
        },
        {
            "text": "The programme has already supported hundreds of young people in care or at risk of going into care since its launch in September 2020, keeping them engaged with their education and helping to boost their attendance, behaviour and attainment."
        },
        {
            "text": "We are also reframing and refocusing the support social workers receive in the early part of their careers, particularly to enhance their skills and knowledge in child protection."
        },
        {
            "heading": 3,
            "text": "Making better use of data"
        },
        {
            "text": " This is central to improving any complex system."
        },
        {
            "text": "We know that you can’t look at children’s safety in terms of numbers but at the same time it’s essential that we use the data that we do have about children and families to help us make better decisions as to how to support families."
        },
        {
            "text": "The transparency of data is paramount in helping boost performance and progress. We plan to join up data from across the public sector to increase transparency – both between safeguarding partners and to the wider public."
        },
        {
            "heading": 3,
            "text": "This builds on what we’ve already done"
        },
        {
            "text": "This all builds on measures we have taken to address the most urgent issues facing vulnerable young people, following a generous settlement for children’s social care at last autumn’s Spending Review."
        },
        {
            "text": "This includes:"
        },
        {
            "text": " "
        }
    ]
}