{
    "url": "https://buyingforschools.blog.gov.uk/2022/05/23/how-to-make-your-school-more-water-efficient/",
    "title": "How to make your school more water efficient",
    "authors": [
        "Laura Walton, Water Efficiency Education and Awareness Lead"
    ],
    "categories": [
        "Services"
    ],
    "pub_date": "2022-05-23T15:36:52+01:00",
    "content": [
        {
            "text": "Laura Walton is the Water Efficiency Education and Awareness Lead for DfE’s Schools Water Strategy. In this blog, Laura introduces the strategy and gives some tips on how you can increase your water efficiency to help save water and reduce your bills."
        },
        {
            "text": "Does helping your school become water efficient matter? The answer is a big resounding yes!"
        },
        {
            "text": "Up until nine months ago I would have wondered what the answer to that question was too, but since joining the Schools Water Strategy team I have learnt so much about the value of water, how we use it across the school estate and all the help and support that is available if you can make time to engage with it (which I know isn’t easy)."
        },
        {
            "text": "Water is a precious resource. When we see photos of floods across the country and around the world it is hard to believe that by 2050, we could see water shortages across the UK because we do not have the infrastructure to store water from the wetter winters to support the drier summers."
        },
        {
            "text": "Using our water in a more efficient way now will embed behaviours that can change our future relationship with water, resulting in less water being wasted and reduced water bills. Water efficiency measures are also good for the environment and allow schools to use the budget they have to the best advantage."
        },
        {
            "text": "Across the whole school estate there is a massive difference between the amount of water schools use, and while some of this is obviously due to the different sizes and shapes of schools, some of it is simply down to knowledge, understanding and maintenance. From visiting schools across the country, we know that many schools are looking at how they can save more water and we’d encourage all schools to look at any changes they can make."
        },
        {
            "text": "Waterwise research suggests that up to 3,100 litres of water can be saved every day in every school. Based on our 24,000-school estate, there could be up to 74,400,000 litres of unnecessary water use every single day."
        },
        {
            "text": "School life is busy and it is often the case that we prioritise what we can see and must deal with on a day-to-day basis, however there are hidden costs lurking around every corner. A leaky toilet can cost £100 per year - imagine what that saving alone could be in some of our biggest schools?"
        },
        {
            "text": "A small 3 mm diameter stream from one running cold tap can waste 330,000 litres per year, which could mean an annual saving of £580."
        },
        {
            "text": "A 15-litre urinal flushed on a timing device every 10 minutes would use 800,000 litres. If this is not related to usage for half the time, the 400,000 litres wasted water could mean a saving of as much as £800 per urinal, per year."
        },
        {
            "text": "So you might think, 'I can see that our water usage in school is not as efficient as it could be but what can we do about it with all the other priorities we have?'"
        },
        {
            "text": "My advice is to start small. Think about having a water assembly with your pupils - your water wholesaler may have resources that you can use to support this. Involve your pupils in a competition to make posters or for older children, why not write about the topic? There are many resources available to make this a fun activity that really drives learning."
        },
        {
            "text": "Make sure your water meters are being read. If they are not, contact your retailer. In some cases, your retailer may have the ability for you to enter your meter reads monthly so that you have a more accurate measure of your water usage."
        },
        {
            "text": "Highlight the issues with your maintenance or caretaking team and get them to have a look to see what quick wins there might be."
        },
        {
            "text": "Most importantly, please engage in the water conversation. See who can champion water efficiency in your school. If you can take part in any initiatives that look at water usage or water education in your area, please sign up and see what can be done to support you using less water. It really does make a difference."
        },
        {
            "text": "If you would like to hear more and have the opportunity to ask any questions, sign up and join our live, ‘How to Make Your School Water Efficient’ webinar. "
        },
        {
            "text": "You can also look at your local authority website and see what they are doing to encourage water efficiency."
        },
        {
            "text": "Finally, research your water wholesaler and retailer. Find out who your key contacts are and build a relationship. There will be lots of materials on their websites that you can use to build knowledge and enrich your curriculum."
        },
        {
            "text": " "
        }
    ]
}