{
    "url": "https://hodigital.blog.gov.uk/2022/05/23/recently-graduated-kick-start-your-tech-career-in-the-home-office/",
    "title": "Recently graduated? Kick-start your tech career in the Home Office",
    "authors": [
        "Yannis Leonardos, DDS Performance Analyst Associate"
    ],
    "categories": [
        "Graduates",
        "Recruitment"
    ],
    "pub_date": "2022-05-23T10:39:58+01:00",
    "content": [
        {
            "text": "The Dynamic Development Scheme (DDS) is an exciting two-year rotational programme for graduates with a minimum 2.2 degree in any subject who are passionate about working in Digital, Data and Technology (DDaT)."
        },
        {
            "text": "During your first year you will complete six-month placements supporting DDaT projects working within different DDaT multidisciplinary teams."
        },
        {
            "text": "In the second year you will complete a 12-month placement and choose a preferred specialism from five options. You will also have a great opportunity to develop and broaden your skills and undertake specialist training."
        },
        {
            "text": "You will form part of a diverse and supportive graduate network, with mentors to help support you shape your career."
        },
        {
            "text": "Our Associates on DDS receive a competitive starting salary (£35,054) London, (£30,817) National."
        },
        {
            "text": "Yannis Leonardos has completed a Data Analyst placement and is currently on his second placement as a Performance Analyst."
        },
        {
            "text": "Hi, I’m Yannis. After several years in education, I changed career by joining the Civil Service as a Casework Support Assistant in the Competition and Markets Authority. While looking for the next step in my career, the DDS at the Home Office immediately captured my attention for the hands-on learning opportunities offered on a rotational basis."
        },
        {
            "text": "What roles have you enjoyed as part of your DDS placements so far?"
        },
        {
            "text": "I began as a Data Analyst in the Forensics Policy Team. I worked on a project assessing the effectiveness of forensic disciplines aimed at introducing new policy. I produced metrics to summarise the data captured through multiple studies and liaised with stakeholders such as the police and academics. I also developed a template for data collection which is due to be published soon."
        },
        {
            "text": "I’m currently on my second placement, working as a Performance Analyst with the Data, Services and Analytics team. I’ve focused on process mapping and am now carrying out a cost-benefit analysis of a specific product based on data extracted from large government databases."
        },
        {
            "text": "What are the unique benefits of the DDS placements?"
        },
        {
            "text": "Being able to collaborate with people from multiple teams across the Home Office, to work on various projects and to develop bespoke digital products is fascinating!"
        },
        {
            "text": "It’s really motivating that most of the products I’ve developed were the first of their kind. Not only do they make a real difference to the work of the team, they also impact more widely on peoples’ lives."
        },
        {
            "text": "The Home Office runs some of the most sophisticated digital tools and some of the largest databases in the entire United Kingdom - and I’m learning how to use them!"
        },
        {
            "text": "What skills do you really need on the scheme?"
        },
        {
            "text": "In addition to analytical, communication and digital skills, a thirst for learning and the desire to take on challenges are the most important skills."
        },
        {
            "text": "Although my background is not purely digital or analytical, I’ve been able to adapt and develop entirely new skills in areas such as data and performance analysis, presentation of data and agile project management. I’ve learnt PowerBI and Structured Query Language (SQL) and have even studied a British Computer Society Foundation Certificate in Agile Project Management."
        },
        {
            "text": "What do you enjoy most about the DDS?"
        },
        {
            "text": "I am part of a very active and social team of DDS Associates who enjoy sharing knowledge and supporting each other."
        },
        {
            "text": "I love the variety of roles, tasks and learning opportunities that the scheme provides."
        }
    ]
}