{
    "url": "https://civilservice.blog.gov.uk/2022/05/23/right-people-right-training-right-job/",
    "title": "Right People. Right Training. Right Job",
    "authors": [
        "Mikey O’Donnell,"
    ],
    "categories": [
        "A Modern Civil Service",
        "A Skilled Civil Service",
        "An Ambitious Civil Service",
        "An Innovative Civil Service",
        "Uncategorized"
    ],
    "pub_date": "2022-05-23T11:57:59+00:00",
    "content": [
        {
            "heading": 3,
            "text": "The Civil Service has a wealth of learning and development and career opportunities across the UK. Ensuring such prospects don’t pass you by can sometimes be challenging, but here’s how you can avoid the pitfalls."
        },
        {
            "text": "The Civil Service is a huge employer and encompasses not only the UK Civil Service but the Scottish, Welsh, and Northern Irish Civil Service too. Each of the nations has its own dedicated recruitment site as well as Civil Service Jobs. "
        },
        {
            "text": "Filling in the application "
        },
        {
            "text": "One of the hardest tasks of applying for any role is knowing exactly what the recruiter is looking for. While ensuring you meet the essential criteria is key, it’s also about how you convey each skill that might be the crucial difference between landing  an interview or falling short. "
        },
        {
            "text": "When showcasing how you meet the essential criteria, it’s often recommended that you consider the STARR (Situation, Task, Action, Result, Reflection) approach when building your answers. This approach allows you to give a clear answer to each of the criteria in a way that’s straightforward and shows you meet all the requirements for the role. "
        },
        {
            "text": "It’s worth mentioning, there may be additional assessments on top of the traditional application and interview process, such as a presentation, verbal test and/or an external assessment, depending on the nature of the role. When you submit your application for the first stage, it will go through the sift stage. The sift will focus on the essential criteria and behaviours, and technical competencies bespoke to the role."
        },
        {
            "text": "Other considerations "
        },
        {
            "text": "While the essential criteria is a huge part of the recruitment process, the Civil Service also has other frameworks in which it weighs up candidates. When applying for a role within the UK Civil Service, it’s recommended that you familiarise yourself with success profiles. "
        },
        {
            "text": "Information about success profiles can be found on GOV.UK; the approach is summed up as introducing “a more flexible framework which assesses candidates against a range of elements using a variety of selection methods”. It’s worth noting that each of the nations uses its own framework. For example, the Scottish Government uses Skills for Success; the Welsh Government uses the Civil Service Competency Framework; and the Northern Irish Government uses the NICS Competency Framework. Further information on each can be found on the recruitment pages and should form part of your research before applying for any role. "
        },
        {
            "text": "What happens next? "
        },
        {
            "text": "If you’re successful at the sift stage, you’ll be invited to the next stage of the process which includes an interview. "
        },
        {
            "text": "At an interview, you’ll be tested on the behaviours outlined in the job application. Study the job advert carefully and read through specific guidance for your role. The STARR approach will come in handy when answering these questions, so it’s worth structuring your answers during the interview in this way. "
        },
        {
            "text": "Be aware, there may be extra assessments on top of the traditional application and interview process such as a presentation, verbal test and/or an external assessment, depending on the nature of a role. If you’re unsuccessful, try to seek feedback on your application to understand why you were not successful. When feedback is offered, always take it, despite any natural disappointment. If you understand what you can improve on, it will only help you do well at your next opportunity."
        },
        {
            "text": "Internship, Apprenticeship and Talent Programmes"
        },
        {
            "text": "Apprenticeships and internships are an excellent route into the Civil Service and can provide highly valuable experience. Both can lead to permanent jobs and the opportunity for further career progression, learning and development. There are many kinds of programmes available such as Modern Apprenticeships, Graduate Apprenticeships, Diversity Internships, and the Civil Service Fast Stream. Further information about these programmes can be found on GOV.UK."
        },
        {
            "text": "Plenty of opportunities"
        },
        {
            "text": "Hopefully this has helped you to understand all the opportunities the Civil Service can offer and how to tackle the recruitment process. Good luck!"
        },
        {
            "text": "If you have any questions or would like a copy of our help-card PDF (which gives a wider picture to improve understanding of the recruitment process) when it launches this summer, let me know by emailing me on "
        },
        {
            "text": "MICHAEL.O'DONNELL1@DWP.GOV.UK"
        }
    ]
}