{
    "url": "https://digitalpeople.blog.gov.uk/2024/01/11/7-lessons-in-mobilising-the-digital-community-building-a-single-definition-of-roles-and-skills/",
    "title": "7 lessons in mobilising the digital community - building a single definition of roles and skills",
    "authors": [
        "Capability Framework Team, CDDO"
    ],
    "categories": [
        "Capabilities",
        "Capability Framework",
        "Communities of practice",
        "Government Digital and Data",
        "People and Skills"
    ],
    "pub_date": "2024-01-11T00:05:52+00:00",
    "content": [
        {
            "heading": 2,
            "text": "Introduction"
        },
        {
            "text": "It has just been over a year since we last talked about our work with the Capability Framework Design Council (CFDC)."
        },
        {
            "text": "The CFDC is our governance body that decides on the prioritisation of changes to the capability framework. It is used by experts from across the Government Digital and Data community, as well as others who want to pursue a career in the Government Digital and Data profession - with approximately 5,000 visits to the capability framework each week. We wanted to share seven lessons we learned along the way and how they had a positive impact on transparency, accountability and participation. "
        },
        {
            "heading": 2,
            "text": "Growing the council"
        },
        {
            "text": "Led by Central Digital and Data Office (CDDO), the CFDC consists of capability specialists and subject matter experts from across government who analyse and assess change proposals to the Government Digital and Data Profession Capability Framework."
        },
        {
            "text": "We want to make sure that the CFDC gives a voice to a broad range of organisations in government. It has grown from nine to twenty-four department representatives (including arms-length bodies)."
        },
        {
            "text": "To keep the decision making strong and effective, we introduced an annual review of membership during the summer. The review helped us to make sure that the council:"
        },
        {
            "heading": 2,
            "text": "Making decisions together"
        },
        {
            "text": "Working with such a diverse group of people and organisations has brought challenges and rewards in equal measure. The CFDC has made tremendous progress to deliver a wide range of improvements to the Government Digital and Data professions capability framework such as:"
        },
        {
            "text": "We aim to publish all these changes by spring 2024."
        },
        {
            "heading": 2,
            "text": "What we’ve learned - so far"
        },
        {
            "text": "Here are the seven most precious lessons we learned to build trust, find common grounds and take into account diverse perspectives."
        },
        {
            "heading": 3,
            "text": "1. Changes to the framework are dynamic "
        },
        {
            "text": "Robust governance is paramount to maintaining the quality of the Capability Framework and should keep up with the pace at which skills and roles evolve in the digital and data profession. "
        },
        {
            "text": "We made clear to CFDC members that changes to the framework are dynamic and also based on wider market trends. Any decision made now, be it a yes or a no, can change next year and that's ok. Our change request process is open and transparent and allows for any digital and data professional in any area of government to propose a change."
        },
        {
            "heading": 3,
            "text": "2. Invite experts to the table "
        },
        {
            "text": "We found empowering experts really useful. Our CFDC members were concerned that they did not want to make decisions without consulting with the experts in their departments. We took it one step further and asked for the relevant departmental experts to sit in on our meetings so that they too feed into how decisions are made."
        },
        {
            "heading": 3,
            "text": "3. Empower members to make decisions "
        },
        {
            "text": "We want members to feel empowered to make decisions. In some instances, the organisations sponsoring a change were asked by the CFDC to either: gather more evidence against our acceptance criteria, link up with other government professions or make the intended impact on career progression clearer. When necessary, having multiple discussions to reach consensus was the only way for CFDC representatives to make informed decisions."
        },
        {
            "heading": 3,
            "text": "4. Understand when consensus is reached "
        },
        {
            "text": "Consensus can be hard to reach within a council environment, owing to the large number of members. We encourage open communications between members, made sure that the information provided is clear and that the acceptance criteria were known by everyone. This helps a lot and allows us to be transparent about how decisions are made. "
        },
        {
            "heading": 3,
            "text": "5. Use community powers "
        },
        {
            "text": "Community is another big thing that we try to take advantage of. We don’t want to reinvent the wheel so we reach out to cross-government communities of practices that already exist when a change request comes through, and we ask these experts to consult on what these changes look like. "
        },
        {
            "text": "In some cases, there are expert areas that do not have an established community of practice. With help from CFDC representatives we then set up bespoke working groups and ensure that the experts in their respective organisations can feed into changes."
        },
        {
            "heading": 3,
            "text": "6. Apply co-design to governance  "
        },
        {
            "text": "The landscape of governance is constantly changing, because of that we need to evolve the council to stay relevant and efficient. The only way to do that is to consider the views of those in the process. We introduced co-design principles and held a first workshop where members could directly improve the process and have more ownership of their place within the council."
        },
        {
            "heading": 3,
            "text": "7. Source and share best practice "
        },
        {
            "text": "The last lesson is one of humility, you never entirely get governance right or only until it is not right anymore. As a consequence, we keep an open feedback loop not only with our members but also with other governance groups across CDDO and government. That way we keep sharing and learning from each other."
        }
    ]
}