{
    "url": "https://defrafarming.blog.gov.uk/2024/01/11/actions-for-upland-farmers-in-2024/",
    "title": "New and improved actions for upland farmers",
    "authors": [
        "The Team"
    ],
    "categories": [
        "Sustainable Farming Incentive"
    ],
    "pub_date": "2024-01-11T13:38:03+00:00",
    "content": [
        {
            "text": "Last week, we published a post about the Agricultural Transition Plan update. The update includes the full range of Sustainable Farming Incentive (SFI) actions — new and updated — with their payment rates. "
        },
        {
            "text": "In this post, we will focus on the new actions relevant to those who farm in the uplands: both moorland and non-moorland grassland.  "
        },
        {
            "text": "We recognise the unique challenges that upland farmers face. We have taken and will continue to take action that ensures upland farmers have access to funding that supports delivery of our environmental objectives in their areas in England, alongside the sustainable production of food."
        },
        {
            "text": "For example, following feedback from farmers and stakeholders, we acted last year to change 5 actions where the prices were different for lowland and upland farmers. Farmers can now benefit from payment rates which are the same for upland and lowland farmers. "
        },
        {
            "text": "Where upland and lowland payment rates have been made equal, we are combining the actions to make the scheme simpler, for example on woodland pasture.  "
        },
        {
            "heading": 2,
            "text": "Moorland offer: the new and the improved"
        },
        {
            "text": "We are significantly expanding and enhancing the offer for moorlands.  "
        },
        {
            "text": "We have developed 5 new actions, which will more comprehensively and fairly reward the actions taken in moorland settings.  "
        },
        {
            "text": "For example, one new action, low grazing on moorland, pays farmers to maintain low livestock density on moorland which aims to support and enhance moorland habitat alongside farming.  "
        },
        {
            "text": "This action gives farmers the choice to select from 3 ranges of livestock density, as best fits their moorland and their business. This action will have a premium payment applied for those with either low or limited grazing on moorland, recognising the more ambitious nature of those actions.  "
        },
        {
            "text": "We are also introducing a new action for managing non-peat moorland soils for flood and drought resilience. This action will help retain water in the uplands, by slowing the flow of surface run off.  "
        },
        {
            "text": "The full list of actions relating to moorland and upland peat are as follows. "
        },
        {
            "text": "We are also improving the existing offer that farmers can apply. We are: "
        },
        {
            "text": "Existing capital items will continue to be available, for example to support the restoration and management of upland peat and natural flood management."
        },
        {
            "text": " In addition, we are looking to introduce new capital items for wildfire management and for people to map their moorlands identifying sensitive habitats and features thereby allowing people to better plan their grazing and restoration works. "
        },
        {
            "heading": 2,
            "text": "Grassland offer: the new and the improved"
        },
        {
            "text": "As part of our review of payments, we reviewed the balance of prices between ‘creation’ actions and ‘maintenance’ actions in relation to some specific grassland habitat actions, for example species-rich grasslands.  "
        },
        {
            "text": "Historically, we paid much higher prices for actions involving creating or restoring habitats and features and lower prices to maintain them. Farmers and land managers told us that they feel that those who have already undertaken the ‘creation’ or ‘restoration’ activities are disadvantaged. "
        },
        {
            "text": "We’re re-balancing the payments for ‘creation’ and ‘maintenance’ actions, in particular for grassland habitats, so that those who have already made changes are not disadvantaged.  "
        },
        {
            "text": "For example, on 1 January 2024, the price for maintaining species rich grassland will increase from £182 to £646 per hectare. "
        },
        {
            "text": "Moving forward, we will pay for the cost of creating a grassland habitat in full, up front, as a separate capital grant offer. This will enable us to increase regular payments."
        },
        {
            "heading": 2,
            "text": "Learn more "
        },
        {
            "text": "This post is one of a series we'll publish on the 2024 offer for each farm type in the coming weeks. By subscribing to the blog you'll get an email alert whenever a new post is published."
        },
        {
            "text": "We recently set up a series of monthly sector-specific webinars for farmers. We plan to host a specific webinar for upland farmers in the months ahead, so do look out for updates here on the blog once we have a date in the diary.  "
        },
        {
            "text": "You can also take a look at the full list of actions available in the combined Sustainable Farming Incentive (SFI) and Countryside Stewardship (CS) offer in the Technical Annex to the ATP.  "
        },
        {
            "text": "Finally, if you have any questions about our work, do leave a comment below. "
        }
    ]
}