{
    "url": "https://actuaries.blog.gov.uk/2024/01/11/adopting-tcfd-recommendations-in-the-public-sector-part-2/",
    "title": "Adopting TCFD recommendations in the public sector (part 2)",
    "authors": [
        "Will Stobbs - Senior Trainee Actuary"
    ],
    "categories": [
        "Climate change",
        "Finance"
    ],
    "pub_date": "2024-01-11T14:36:30+00:00",
    "content": [
        {
            "text": "Part 1 of this blog series covered some best practice to aim for when implementing the Taskforce on Climate-related Financial Disclosures (TCFD) recommendations."
        },
        {
            "text": "In this second part I discuss some of the challenges public sector organisations may face and the support we, as actuaries at the Government Actuary’s Department (GAD), can offer."
        },
        {
            "heading": 2,
            "text": "From qualitative to quantitative disclosures"
        },
        {
            "text": "Many organisations find moving from qualitative (descriptive) disclosures to quantitative (numerical) assessments a particularly difficult step. More help may be needed either from within the organisation or from external expertise. In particular, the use of scenario analysis can present a novel challenge."
        },
        {
            "text": "Under the TCFD recommendations, organisations must consider the resilience of their strategy under at least 2 scenarios. This includes 1 in line with the 2015 Paris Agreement which committed countries to ensure global average temperature rise was kept ‘well below 2°C above pre-industrial levels.’"
        },
        {
            "text": "In addition to the best practice shared in the first blog, the Financial Reporting Council (FRC) published a report which outlines some of the best practices in scenario analysis. It includes the need to consider business-level impacts. This can be particularly challenging when working with publicly available global scenarios."
        },
        {
            "text": "The Institute and Faculty of Actuaries released a paper with the University of Exeter last year critiquing current practice in climate change scenario analysis. It stated that many of the models used by financial service providers underestimate climate risk."
        },
        {
            "text": "The report warns the reader of the importance of understanding the assumptions and limitations of any model used. GAD has taken such research into account when conducting scenario analysis for clients."
        },
        {
            "text": "I worked with colleagues to deliver climate change scenario analysis as part of the 2020 public service pension scheme valuations. The scenarios enable schemes to consider the risks and opportunities of climate change and can feed into wider department disclosures."
        },
        {
            "heading": 2,
            "text": "Challenges for the public sector"
        },
        {
            "text": "Despite the recommendations of the TCFD being designed to be flexible across different sectors there are a number of specific challenges when implementing in the public sector. These include:"
        },
        {
            "heading": 2,
            "text": "Links to other standards"
        },
        {
            "text": "Climate and sustainability related financial reporting is an ever-evolving area and hence it is important to stay up to date on the latest developments."
        },
        {
            "text": "Earlier this year the International Sustainability Standards Board (ISSB) published its inaugural standards, IFRS S1 and S2."
        },
        {
            "text": "These were based on the TCFD recommendations, with S2 using the same 4 pillars: however, requiring some additional disclosures. The scope of the ISSB is also broader than TCFD, covering sustainability as well as climate change."
        },
        {
            "text": "From 2024 the ISSB have taken over the responsibility from TCFD for encouraging and monitoring the disclosure of climate-related financial information. Like the TCFD, the ISSB proposes to publish annual status reports."
        },
        {
            "text": "In the public sector, the greening government commitments (GGCs) set out high level environmental sustainability targets for departments and public bodies. They must report against these annually."
        },
        {
            "text": "The GGCs’ requirements for quantitative disclosures of emissions, waste and resource use constitute part of the metrics and targets pillar under the TCFD recommendations. To ensure efforts are not duplicated, it’s important that departments consider the sustainability reporting they already do."
        },
        {
            "heading": 2,
            "text": "How can GAD help?"
        },
        {
            "text": "Not only are actuaries at GAD used to dealing with risk identification, analysis, quantification and management but have also developed specific skills in relation to climate change risks. The updated Technical Actuarial Standard 100, published by the FRC in July 2023 requires actuaries to consider all relevant, material risks including (specifically) climate change."
        },
        {
            "text": "We have been engaging with HM Treasury to:"
        },
        {
            "text": "Our experience has highlighted the importance of dissecting the recommendations, conducting a thorough gap analysis, and identifying areas to focus on over each reporting period."
        },
        {
            "text": "The expertise we have at GAD particularly suits the quantification of material climate-related risks, including data requirements, setting assumptions and conducting TCFD-compliant scenario analysis and modelling."
        },
        {
            "text": "To discuss how GAD could support you implement the recommendations of the TCFD in your organisation, please contact TCFD.support@gad.gov.uk."
        },
        {
            "text": "Disclaimer"
        },
        {
            "text": "The opinions in this blog post are not intended to provide specific advice. For our full disclaimer, please see the About this blog page."
        }
    ]
}