{
    "url": "https://dragonsden.blog.gov.uk/2024/01/11/dragons-den-ip-blog-series-21-episode-2/",
    "title": "Dragons' Den IP Blog - Series 21 Episode 2",
    "authors": [
        "christinawatts"
    ],
    "categories": [
        "Business",
        "Confidentiality",
        "International",
        "IP",
        "Licensing",
        "Patents",
        "Trade marks",
        "Trade secrets"
    ],
    "pub_date": "2024-01-11T21:00:23+00:00",
    "content": [
        {
            "text": "It’s Episode 2 of Dragons’ Den, and this week’s entrepreneurs sent us on an adventure exploring the beauty of the natural world. From luxury glamping to inflatables that let you take your rucksack for a river swim and organic products that balance your skin. Whichever investment the Dragons were going to make this week, it was going to have a link with nature.   "
        },
        {
            "heading": 3,
            "text": "The glow of success"
        },
        {
            "text": "First into the Den this week were sister and brother duo, Nicole Stanton and Alex Nicolaou. They were presenting NINI Organics, their award-winning eco-luxury brand of skincare products. "
        },
        {
            "text": "Asking for £50,000 in exchange for 10% equity in their business, they told the Dragons about the inspiration for their enterprise.  "
        },
        {
            "text": "Alex described how he’d suffered from acute, confidence-knocking acne when he was young. Nicole story really moved me. She had worked as a special effects makeup artist and props designer but 5 years in, after developing a severe reaction to one of the most used chemicals in the field, she had to walk away from her career. Nicole described how this negative experience had a positive outcome - it led her to start her business with Alex, who is trained in formulating natural beauty products after working in the skincare industry.  "
        },
        {
            "text": "Peter found Nicole’s experience as powerful as I did: "
        },
        {
            "text": "Between them, Alex and Nicole have grown NINI Organics to a stage where they need a Dragon on board to help open doors for them to build their brand further.  "
        },
        {
            "heading": 3,
            "text": "Trade marks and trade secrets"
        },
        {
            "text": "We can see that Alex and Nicole have made the move to register their NINI Organics trade marks. As well as their brand, their intellectual property (IP) will lie in the special recipes they’ve formulated for their organic skin products. These are their trade secrets.  "
        },
        {
            "text": "To ensure that trade secrets are protected, the information needs to be kept confidential. It’s important that businesses like NINI Organics asks anyone involved – suppliers, manufacturers, employees – to sign a non-disclosure agreement (NDA). Take a look at our guidance page on NDAs. "
        },
        {
            "text": "Nicole told us how they protect their IP:  "
        },
        {
            "text": "In the Den, Sara and Deborah complimented the entrepreneurs but declined to invest, leaving Touker, Steven and Peter to make offers.  "
        },
        {
            "text": "After a ‘talk to the wall’ the siblings opted for Peter and Steven’s offer, asking them to go halves on all of the money for 10% each of the business. "
        },
        {
            "heading": 3,
            "text": "Patents that float "
        },
        {
            "text": "‘Above Below’ is the brainchild of businessman and inventor, Will Watt. Although he is clearly an innovator with a wealth of ideas the Dragons found his pitch a little confusing.  "
        },
        {
            "text": "Will described his inflatable rucksack carrier that he has designed and patented worldwide. The RuckRaft can carry kit and clothing during a new hybrid outdoor activity Will has created: hiking (the ‘above’ part of his business name) combined with swimming (below). He calls this cross-country swimming.      "
        },
        {
            "text": "After asking the Dragons for £100,000 for 5% of his business, Will was left feeling somewhat deflated when they all opted out one by one. He didn’t leave the Den empty handed, however – he received some valuable advice from Dragon Peter Jones on delivering a perfect pitch and knowing how to use patents and IP to secure investors. "
        },
        {
            "heading": 3,
            "text": "Playing in the trees "
        },
        {
            "text": "Last up was father Derry Green, founder of The Secret Garden Glamping. Like many of us, Derry had found himself looking for new and exciting ways to keep his children amused during the pandemic. Derry told the Dragons:  "
        },
        {
            "text": "Derry’s glamping paradise was a hit on social media. He kept his followers updated daily on his progress and soon had people contacting him to book the unit for a holiday. He listed it online and within 3 days it was fully booked for the next 2 years. Derry quickly realised there was a gap in the market and now has 9 bespoke woodland glamping spots with more in the pipeline.  "
        },
        {
            "text": "The entrepreneur offered the Dragons 5% equity in his business in return for £100,000.  "
        },
        {
            "heading": 3,
            "text": "Licensing the luxury outdoor experience "
        },
        {
            "text": "Derry wisely understands the benefits of protecting the IP in a business. He has used The Secret Garden Glamping trade mark to franchise his business. "
        },
        {
            "text": "There are many benefits for a business franchising its IP including increased revenue and market share through others operating your concept in other territories. Our IP Basics YouTube video (link) gives a quick introduction to licensing and franchising your IP. "
        },
        {
            "text": "Back in the Den, we saw four out of five Dragons wanting a slice of the outdoor glamping lifestyle, all offering the exact terms Derry asked for. Steven Bartlett declined, recognising that holiday expert Deborah Meaden would be the perfect fit. "
        },
        {
            "text": "Agreeing with Steven, Derry accepted Deborah’s offer, deciding that, with her wealth of knowledge, she is the ideal Dragon to help him grow his outdoor experience business. "
        },
        {
            "text": "If you have enjoyed this adventure into the IP in the outdoors as much as we have, keep an eye out for next week's edition of The Dragons' Den IP Blog!"
        },
        {
            "text": " "
        },
        {
            "text": "Disclaimer:\nThe Intellectual Property Office (IPO) has an arrangement in place with the BBC to publish the Dragons’ Den IP Blog after each BBC Dragons’ Den episode. The purpose of the blog is to help identify the IP in entrepreneurs’ pitches and highlight how IP works, or could work, in the real-life examples featured. IPO’s authorship of this blog does not constitute its endorsement or sponsorship of any products, individuals or businesses referenced within it."
        }
    ]
}