{
    "url": "https://naturalengland.blog.gov.uk/2024/01/11/guiding-principles-for-designing-for-biodiversity-net-gain-experts-share-their-insights/",
    "title": "Guiding principles for designing for Biodiversity Net Gain - experts share their insights",
    "authors": [
        "Natural England"
    ],
    "categories": [
        "Biodiversity",
        "Biodiversity Net Gain",
        "Biodiversity Net Gain – Hints and Tips",
        "Environment Act",
        "Natural England",
        "Nature-based solutions"
    ],
    "pub_date": "2024-01-11T09:20:11+00:00",
    "content": [
        {
            "text": "\nWelcome to our first Natural England instructional Biodiversity Net Gain (BNG) guest blog. Three distinguished experts share their top tips and impart their insights on designing for BNG. They are Julia Baker, Technical Director at Mott MacDonald, David Mooney, CEO at London Wildlife Trust and Dr Gemma Jerome, Director at Building for Nature."
        },
        {
            "text": "Julia Baker, Technical Director at Mott MacDonald"
        },
        {
            "text": "Discussions about Biodiversity Net Gain (BNG) often focus on the biodiversity metric. That’s been necessary, especially to explore habitats as a proxy indicator for biodiversity and the data required for metric calculations."
        },
        {
            "text": "With mandatory BNG fast approaching, let’s talk about what truly successful BNG is. It follows the mitigation hierarchy, creates and enhances wildlife-rich habitats, and this needs a habitat design based on sound ecological principles."
        },
        {
            "text": "There are many considerations when designing habitats to achieve BNG, my top starters are:"
        },
        {
            "text": "1/ Set design objectives."
        },
        {
            "text": "A BNG design should have clear objectives for habitats being retained, created or enhanced. These should link with all requirements for the habitats, such as screening, amenity use, and species mitigation. That way, the viability of a BNG design can be assessed early as well as the potential for additional benefits, such as sustainable drainage."
        },
        {
            "text": "2/ Collect baseline data to design BNG."
        },
        {
            "text": "Successful habitat creation depends on many factors, including soil (especially when creating or enhancing grasslands), drainage, topography as well as past management practices. Other factors include constraints to habitat creation such as utilities, and the landscape context of the site including connectivity with surrounding habitats."
        },
        {
            "text": "So, although many think about UKhab surveys and habitat condition assessments for metric calculations, it’s vital to gather all data for designing BNG, and as early as possible. It not only makes the most of time on-site for metric surveys, it also (and most importantly) enables a design-led conversation for achieving BNG."
        },
        {
            "text": "3/ Adopt a collaborative design approach."
        },
        {
            "text": "Collaboration between landscape architects and ecologists is fundamental to designing BNG. Establishing this early makes for a much better design process. Collaborating to prioritise feasible habitat creation and enhancement, ensuring viability over 30 years. Working together to focus on the requirements for metric calculations and necessary design outputs such as planting schedules and soil specifications."
        },
        {
            "text": "In summary, the biodiversity metric is only one element of BNG. For BNG to be truly successful, let’s focus on designing wildlife-rich habitats."
        },
        {
            "text": "David Mooney, CEO at London Wildlife Trust"
        },
        {
            "text": "1/ Consider how habitats will work."
        },
        {
            "text": "Designing for BNG must not only take account of how the habitats will work for wildlife but how people will use them. There’s no getting away from the fact that habitat enhancement or habitat creation, should be mindful of the fact that most green spaces will also have recreational purposes often for large numbers of people. Therefore, design for what will work within these limitations."
        },
        {
            "text": "2/ Understand solutions in an urban context."
        },
        {
            "text": "Many habitats in an urban context will need to be highly constructed and engineered habitats. They are habitats that will be designed by collaboration between landscape architects, ecologists and civil engineers. Often soils and substrates will need to be imported. There will need to be solutions to take account of urban paraphernalia such as pipes, cables and other subsurface constraints as well as the more obvious parts of the urban environment such as buildings, roads and railway lines. Shading and lack of natural irrigation may also be factors to consider. Understand the geometry of the space before designing new habitats."
        },
        {
            "text": "3/ Be patient with supply chains."
        },
        {
            "text": "Think about supply chains for the development and for maintenance and management. There will be a significant increase in demand for products and planting material, especially for special urban habitats such as biodiverse green roofs, bioswales and raingardens. There will also be a need for more specialist and skilled management of these new habitats. It will take some time for the industry to gear up to supply the materials and labour we will need. This is especially true outside cities like London and Manchester where biodiverse urban greening has been promoted through Urban Greening policies for several years. Be bold but be patient too."
        },
        {
            "text": "Dr Gemma Jerome, Director at Building for Nature"
        },
        {
            "text": "There has never been a more important time to address the need for strong, and practical solutions to secure high-quality placemaking that puts outcomes for people and wildlife at the heart of the design process. For this reason, the role of long-term management, maintenance, aftercare and stewardship requirements needs to be built into the design from day one."
        },
        {
            "text": "BNG legislation demands a 30-year monitoring period, prompting local planning authorities to adapt for these long-term responsibilities. As such local planning authorities and planning application processes are gearing up to support BNG assessments and audit needs to factor in long-term liabilities. This includes responsible bodies, liabilities for landowners, skills and knowledge gaps in the sector for management companies and contractors meeting these long-term liabilities."
        },
        {
            "text": "Three top tips to take away include:"
        },
        {
            "text": "1/ Integrated Approach for Green Infrastructure."
        },
        {
            "text": "Advocate for an integrated approach to managing green infrastructure by amalgamating various legislative requirements, emergent sustainability standards, and investor demands into the design process. This integration helps deliver consistent environmental, social, and economic benefits while meeting diverse regulatory and reporting standards."
        },
        {
            "text": "2/ Prioritise Long-Term Planning in Design."
        },
        {
            "text": "Emphasise the significance of incorporating long-term management, maintenance, monitoring, and stewardship requirements right from the initial stages of design. Addressing these aspects at the outset ensures compliance with BNG legislative requirements. This includes the essential 30-year monitoring period, local planning authority support, and accounting for long-term liabilities."
        },
        {
            "text": "3/ Collaboration and Training Initiatives."
        },
        {
            "text": "Encourage collaboration among government agencies, professional membership bodies, and organisations providing industry standards. Their joint efforts can bridge knowledge gaps, offer interdisciplinary training, and develop standards ensuring effective long-term stewardship of green infrastructure projects. This collaboration helps maximise the potential for climate-resilient biodiversity gains. This approach ensures successful project lifecycles, which together optimise the potential to secure long-term outcomes for people and wildlife."
        }
    ]
}