{
    "url": "https://ruralpayments.blog.gov.uk/2024/01/11/introducing-rural-land-changes-the-new-online-rle1-service/",
    "title": "Introducing Rural Land Changes: the new online RLE1 service",
    "authors": [
        "RPA Editor"
    ],
    "categories": [
        "Mapping"
    ],
    "pub_date": "2024-01-11T11:02:09+00:00",
    "content": [
        {
            "text": "RPA has launched a new digital service for customers to notify us of mapping changes called Rural Land Changes. This online method will replace the eRLE1 form and significantly reduce the length of time it takes us to action submissions from customers. We are introducing these changes following feedback from farmers and land managers about how they complete mapping changes."
        },
        {
            "text": "Rural Land Changes is now available in the Rural Payments service, and can be used to:"
        },
        {
            "heading": 2,
            "text": "Why is the service being launched? "
        },
        {
            "text": "This is the first in a series of changes that will digitally transform our mapping and land processes and has been designed with RPA’s farmer panel and industry partners."
        },
        {
            "text": "Requests will take minutes to complete and will be sent straight to RPA’s mapping team to process. By using the new online service, mapping requests will be actioned considerably quicker."
        },
        {
            "text": "The Countryside Stewardship (Mid Tier) and Sustainable Farming Incentive (SFI) schemes require mapping to be correct before a customer can complete an application. Using the online service will mean we can update the land quicker, and farmers and land agents can begin their applications sooner."
        },
        {
            "heading": 2,
            "text": "What is happening to the current RLE1 form?"
        },
        {
            "text": "We will monitor the introduction of the online Rural Land Changes service by asking for feedback and insight from farmers, land agents and stakeholders. We will then remove the eRLE1."
        },
        {
            "text": "If you’re unable to use the Rural Payments service, the paper RLE1 form is still available."
        },
        {
            "text": "You can find the guidance for the new online service and the link to the RLE1 form on the Make changes to your rural land maps online or get an RLE1 form page."
        },
        {
            "text": "Over the next few months, we will look at what changes can be made to the paper RLE1 form to make it easier to complete."
        },
        {
            "heading": 2,
            "text": "What do I need to do now?"
        },
        {
            "text": "Make sure everyone connected to your business has the right permissions in the Rural Payments service. To use Rural Land Changes, you will need to have at least one of the following permissions:"
        },
        {
            "text": "For an introduction to the service, watch our video: Introducing Rural Land Changes"
        },
        {
            "heading": 2,
            "text": "What else is planned? "
        },
        {
            "text": "As this new service forms a small part of a wider transformational piece on mapping, RPA is working on other changes."
        },
        {
            "text": "Testing on the GeoPhoto app will start soon, before being rolled out later this year, to support monitoring and processing activities across the schemes and grants administered by RPA. We will share more about this over the next few months."
        },
        {
            "text": "We are also looking at other ways to improve the mapping experience and the service we offer. We are only at the initial stages of this, but plan to make some significant improvements over the next year."
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        }
    ]
}