{
    "url": "https://openpolicy.blog.gov.uk/2024/01/11/launching-nsparc-our-new-national-security-policy-and-research-colab/",
    "title": "Launching NSPARC - our new National Security Policy and Research CoLab",
    "authors": [
        "nsparc"
    ],
    "categories": [
        "Policy Lab"
    ],
    "pub_date": "2024-01-11T11:58:00+01:00",
    "content": [
        {
            "text": "We are delighted to be launching the new National Security Policy and Research CoLab (NSPARC or N*), sponsored by the Office of the Chief Scientific Advisor for National Security and hosted by the Policy Lab.  "
        },
        {
            "heading": 3,
            "text": "Who we are "
        },
        {
            "text": "N* was born out of a partnership between Policy Lab and the National Security Secretariat (NSS) to increase diverse thinking and innovation in policy making. That partnership has, amongst other things, already led to the founding of the Collective Intelligence Lab, which uses digital tools to crowdsource insight and ideas.  "
        },
        {
            "heading": 3,
            "text": "Creative Solutions to Real World Problems  "
        },
        {
            "text": "N* takes the National Security Secretariat partnership to a whole new level. As a vehicle for next practice, N* will apply novel and creative methods to real-life policy problems. It will partner with and support colleagues working in National Security through a project-based model. The N* approach will include established and more experimental, aspirational future methods.  "
        },
        {
            "text": "N* will also seek to provide National Security policymakers with the tools and knowledge needed to experiment with these approaches themselves. It will seek to drive better informed policy, take advantage of policymaking opportunities emerging from new technologies to help ensure the UK remains competitive, and secure optimum citizen outcomes and champion liberal democracy, in line with the Integrated Review Refresh. "
        },
        {
            "text": "Paul Killworth, the Deputy Chief Scientific Advisor for National Security and the National Security Innovation Champion, defines innovation as “the discovery, development and deployment of novel solutions that add value to the mission and business of the organisations that make up the UK’s National Security system.” Paul said: “N* is a crucial part in our national security innovation strategy. When we think about innovation, we often think about new technology or equipment. But N* is about making the end-user central to our decision-making process, achieving results more quickly and efficiently, and securing better policy outcomes for our citizens.” "
        },
        {
            "heading": 3,
            "text": "Get involved!  "
        },
        {
            "text": "Sign up to the N* mailing list or contact N* to find out more.  "
        },
        {
            "text": " "
        },
        {
            "text": "NSPARC Privacy Notice "
        },
        {
            "text": "NSPARC Mailing List Information Sheet"
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        }
    ]
}