{
    "url": "https://competitionandmarkets.blog.gov.uk/2024/01/11/the-digital-markets-unit-is-hiring-find-out-how-you-can-impact-the-way-digital-markets-work/",
    "title": "The Digital Markets Unit is hiring – find out how you can impact the way digital markets work",
    "authors": [
        "Matthew Braovac"
    ],
    "categories": [
        "CMA Digital",
        "Life at the CMA"
    ],
    "pub_date": "2024-01-11T15:01:12+00:00",
    "content": [
        {
            "text": "In the last 18 months the Digital Markets Unit (DMU) has been recruiting steadily as we ramp up to get ready for the Digital Markets Competition and Consumers Bill to become law. Over that time, we have grown from about 25 people to over 60 in our core team."
        },
        {
            "text": "But the end of this ‘shadow’ phase is rapidly coming into view, as we approach ‘day one’, the date we take on our new powers.  We recently published the overview of our provisional approach to implementing the new Digital Markets competition regime which sets out how we will meet our strategic objectives of protecting consumers and businesses, ensuring fair competition, and enabling investment and innovation in digital markets. This is very exciting for all of us who have been working on setting up the DMU. Even more exciting, in 2024 we expect to start exercising these powers and improving outcomes for UK consumers and businesses."
        },
        {
            "heading": 2,
            "text": "Why join the DMU? "
        },
        {
            "text": "For anyone who has perhaps been watching the developments in digital markets here in the United Kingdom or throughout the world, in places from the European Union and United States of America to Japan, Germany and Australia I would say now is the time to really seriously consider the Competition and Markets Authority's (CMA) DMU as a place to develop your career."
        },
        {
            "text": "Within the DMU you will have the opportunity  to work on some of the most complex policy challenges facing governments today."
        },
        {
            "text": "You can see, for instance, the CMA’s ongoing work on:"
        },
        {
            "text": "These are all examples where members of the DMU have been working with colleagues from across the CMA on these important cases. If you join the DMU you will get the opportunity to work with extremely knowledgeable and supportive colleagues, with international agencies and world-renowned academics such as our digital experts. We are a collaborative team with regular social events, paid time for volunteering and opportunities to travel between our offices and overseas. The work we do has a meaningful impact on the way that digital markets work for millions of people and businesses up and down the country and around the world."
        },
        {
            "text": "Our recruitment rounds are very competitive, we attract a large number of applicants, in part, as this is such an interesting and fast-moving area in which to work. These roles may be of particular interest to those with experience working in regulatory environments or competition and consumer policy areas or with experience in digital technologies. But we are very interested in bringing in applicants with transferable skills and from diverse backgrounds. We have an active Equality, Diversity and Inclusion action groups both in the DMU and across the wider CMA. This is definitely a place where, whatever your background, you can learn and develop your skills. We place a big emphasis on training, knowledge sharing and personal development. So, if you have a passion for digital markets and want to hear more, we are interested in hearing from you."
        },
        {
            "text": "We are currently recruiting for a range of roles to support our work:"
        },
        {
            "text": "If you’re interested in hearing more about these roles and the work of the DMU, please register for our online ‘open house’ event on Monday 15 January 2024."
        }
    ]
}