{
    "url": "https://educationhub.blog.gov.uk/2024/01/what-you-need-to-know-about-changing-schools-during-the-year/",
    "title": "What you need to know about changing schools during the year",
    "authors": [
        "mediaofficer"
    ],
    "categories": [
        "Admissions",
        "school admissions"
    ],
    "pub_date": "2024-01-11T12:01:04+00:00",
    "content": [
        {
            "text": "Sometimes it is necessary for children to change school during the school year or at a time outside the usual transfer point, for example between academic years 8 to 9 rather than year 6 to year 7."
        },
        {
            "text": "This can be for various reasons, such as moving house into a new area. This is known as an “in-year” move."
        },
        {
            "text": "Although for most families this isn’t the ideal situation, fortunately the process itself is straightforward. Here we tell you all you need to know about how to change schools in-year."
        },
        {
            "heading": 3,
            "text": "How to change schools in-year"
        },
        {
            "text": "To change your child’s school in-year, you will need to apply to either the school you wish your child to go to, or to the local authority. This is known as an ‘in-year application’."
        },
        {
            "text": "The process for applying for a school place in-year can differ from area to area."
        },
        {
            "text": "You can apply directly to the school of your choice where the school has its own admission authority, including for academy schools, foundation schools and voluntary aided schools."
        },
        {
            "text": "For community or voluntary controlled schools you should apply to the local council."
        },
        {
            "text": "In some areas you can submit in-year applications for all schools to the local council, as the local council has agreed with other local schools to coordinate their in-year applications for them"
        },
        {
            "text": "Your local council website will tell you whether to apply direct to the school or to the council."
        },
        {
            "text": "Local councils are required to provide advice to parents on vacant places in their area where this is requested."
        },
        {
            "text": "Once you have found your new local council’s website, their ‘schools/education’ page will have information about transferring your child to a school in their area."
        },
        {
            "text": "Most councils recommend that you do this online but some have online forms you can download, print and post to them once completed."
        },
        {
            "heading": 3,
            "text": "When will I hear the outcome of my application?"
        },
        {
            "text": "Where you have submitted an application, the admission authority or council must notify you of the outcome in writing within 15 school days."
        },
        {
            "text": "If a place is refused, they must inform you of your right of appeal."
        },
        {
            "text": "If you are offered a place, and you accept the offer, arrangements should be made for your child to start school as soon as possible, particularly where your child is out of school."
        },
        {
            "heading": 3,
            "text": "Can my current local council help me transfer schools?"
        },
        {
            "text": "Local councils may have different advice available."
        },
        {
            "text": "For example, local councils in large cities like London have contact information for neighbouring boroughs."
        },
        {
            "text": "It is best to seek the information of in-year admissions from the local council you wish your child’s new school to be in."
        }
    ]
}