{
    "url": "https://governmentscienceandengineering.blog.gov.uk/2024/01/11/why-the-gse-skills-assessment-tool-is-a-must-have-for-your-development/",
    "title": "Why the GSE Skills Assessment Tool is a must-have for your development",
    "authors": [
        "gseprofession"
    ],
    "categories": [
        "Blog Series",
        "GSE Offer",
        "Learning & Development"
    ],
    "pub_date": "2024-01-11T14:49:56+00:00",
    "content": [
        {
            "heading": 4,
            "text": "What is the GSE Skills Assessment Tool? "
        },
        {
            "text": "The GSE Skills Assessment Tool is a professional development web-based tool which allows you to track the skills required for your GSE career, and access tailored learning opportunities."
        },
        {
            "heading": 4,
            "text": "GSE Skills Assessment Tool in action "
        },
        {
            "text": "GSE Profession Team member Phoebe, talks us through how she uses the tool: "
        },
        {
            "text": "I started using the GSE Skills Assessment Tool in November 2023. The tool is supporting me in tracking my professional development and building my competency portfolio for achieving Registered Scientist status through the GSE Professional Recognition Offer.  "
        },
        {
            "text": "The Skills Assessment Tool provided a clear guide to self-evaluate my own skills and ability. It has helped me to compare the knowledge level I have now to the knowledge level I want to reach. \nAs you can optionally add line managers to review your self-assessment, this helped to set my learning and development goals as part of my end-of-year development discussion. Conveniently, you can also review progress at any time. I particularly like the recommended learning options, through which you can access resources to support you in reaching your desired development targets. "
        },
        {
            "heading": 4,
            "text": "Next steps  "
        }
    ]
}