{
    "url": "https://naturalengland.blog.gov.uk/2025/09/11/accelerating-development-and-nature-recovery-a-natural-england-perspective-on-the-nature-restoration-fund/",
    "title": "Accelerating Development and Nature Recovery: A Natural England Perspective on the Nature Restoration Fund ",
    "authors": [
        "Natural England"
    ],
    "categories": [
        "Development",
        "Growth",
        "Licensing",
        "Natural England"
    ],
    "pub_date": "2025-09-11T08:45:00+01:00",
    "content": [
        {
            "text": "Natural England welcomes the Government’s commitment to reform the planning system in such a way that it delivers sustainable development while unlocking new and more joined-up opportunities for nature’s recovery.  "
        },
        {
            "text": "Bradley Tooze, Strategy Director at Natural England, outlines Natural England’s views on the Government’s plans to reform the planning system and why there is a strong case for changes which can be a win-win for nature and development."
        },
        {
            "heading": 4,
            "text": "Q: Why does the planning system need reform? "
        },
        {
            "text": "The current planning system has not been successful in halting the overall decline of nature despite the use of regulations designed to protect habitats and species at site level. The ecosystems that are vital for our clean air, our water supplies, for storing carbon, and our country’s biodiversity are becoming ever more fragmented and degraded.  "
        },
        {
            "text": "We also recognise that the country needs more homes and better infrastructure, and reform is needed to enable this to happen. "
        },
        {
            "text": "To reverse this trend, the planning system must evolve. It can no longer focus solely on individual sites— it must actively support the restoration, improvement, and resilience of the natural environment at scale. Reform will also significantly streamline the planning system, giving developers a clear and simple way to build homes and developments whilst also delivering for nature."
        },
        {
            "text": "We welcome reforms which deliver faster, more strategic, and more focused outcomes for nature. Sustainable growth is not a trade-off. It is a strategic opportunity—one that can help to recover the health of our natural environment and deliver economic resilience and social prosperity in unison."
        },
        {
            "heading": 4,
            "text": "Q: What is the Nature Restoration Fund and how will it work in practice?  "
        },
        {
            "text": "In March this year the government introduced the Planning and Infrastructure Bill to Parliament as part of a wider programme of reform. A key element of this legislation is the Nature Restoration Fund (NRF), which Natural England sees as a major opportunity to both accelerate sustainable development and enhance our environment.  "
        },
        {
            "text": "The NRF will provide a flexible, scalable approach to delivering environmental improvements where developments have impacts on internationally important protected sites or on protected species. This will be achieved through the creation and delivery of Environmental Delivery Plans (EDPs), which will identify strategic interventions at a landscape scale, known as conservation measures, to ensure better outcomes for nature. EDPs will: "
        },
        {
            "text": "The EDP will be the means to establish a NRF and allow Natural England to set the levy a developer must pay to make use of the Fund. Developers can choose to contribute to the fund rather than follow the current arrangements, which can be uncertain and complex, and require the developer to identify impact and secure traditional, site-specific mitigation themselves.  The funding will be used to implement the EDP that Natural England delivers in partnership with a range of local organisations and bodies, including Local Record Centres, Local Planning Authorities, environmental organisations, farmers and land managers. "
        },
        {
            "heading": 4,
            "text": "Q. What are the benefits of this new approach? "
        },
        {
            "text": "The reforms set the foundation for mainstreaming the kinds of successful strategic compensation projects that have already shown benefits for nature through development.  "
        },
        {
            "text": "For example, in the Thames Basin we developed a strategic plan to prevent disturbance to protected birds caused by new housing. This allowed over 50,000 homes to be built in 10 years—more than expected—while protecting the Special Protection Area (SPA). Over 80 alternative green spaces were created and wardens helped educate visitors, leading to record bird numbers. Despite a 12% rise in housing nearby, visits to the SPA didn’t increase, showing the approach works and is now being used in places like the New Forest and Epping Forest. "
        },
        {
            "text": "This approach also provides certainty and a streamlined process for enabling the development the country needs. "
        },
        {
            "text": "The reforms will: "
        },
        {
            "text": "The NRF will redirect investment from project specific mitigations into more strategic conservation measures. This will be especially important in addressing indirect and cumulative problems like water pollution and habitat fragmentation. It will only be used where they will deliver better outcomes for nature over the course of the Environmental Delivery Plan, including that steps will continue to be taken to avoid harm in the first place. If not, the current arrangements will continue to apply.   "
        },
        {
            "text": "This approach provides the step change developers need away from legal agreements, complex technical assessments and protracted consultations. EDPs will also provide certainty of cost through a clear charging schedule in the form of levy set by Natural England. The government’s intention is that the combined cost of conservation measures to developers under an EDP is no greater than the status quo."
        },
        {
            "heading": 4,
            "text": "Q. How will the risks be managed? "
        },
        {
            "text": "Existing protections for sites and species will remain and only when an EDP is put in place will developers be able to discharge their obligations via the NRF. That will only happen when Natural England proposes and the Defra Secretary of State agrees that there is sufficient evidence that it will deliver better outcomes for nature, with clear delivery paths and monitoring tools included in the EDP. "
        },
        {
            "text": "The Secretary of State will need to have regard to the statutory Environmental Principles Policy Statement and Natural England will have regard to the Environmental Principles when preparing and implementing EDPs.  This will ensure that important principles like the precautionary principle, polluter pays and the rectification at source principle are maintained."
        },
        {
            "heading": 4,
            "text": "Q: Are there examples where a similar approach has already worked? "
        },
        {
            "text": "Yes, Natural England is involved in a range of successful projects which demonstrate the potential associated with this approach:"
        },
        {
            "text": "District Level Licensing (DLL) offers an alternative to the traditional site-by-site survey and mitigation process for developments likely to affect great crested newts. DLL takes a more strategic approach, based on a national survey and monitoring."
        },
        {
            "text": "Before DLL was introduced, Natural England estimated that only a small portion of the cost associated with regulating great crested newts led to meaningful conservation outcomes, with the majority focused on assessments and mitigation that had limited long-term benefits."
        },
        {
            "text": "DLL has changed that picture. By shifting the focus of investment, the scheme now directs over 80% of funding received through DLL creates and restore ponds, monitor and maintain them for 25 years. To date, DLL has enabled 35,000 housing units to be built and created or restored 4,000 ponds, with newt populations growing. "
        },
        {
            "text": "An example of this scheme in action is the Barratt Redrow Crown Hill View housing development in Ashford in Kent, where developers, planners and Natural England have worked together to create new habitats for newts while enabling development on the site."
        },
        {
            "heading": 4,
            "text": "Q. What will Natural England be doing to get ready for NRF? "
        },
        {
            "text": "The NRF will be a strategic change for NE, building on insight gained from strategic schemes such as Biodiversity Net Gain. We are committed to: "
        },
        {
            "text": "By embedding nature recovery into the heart of development, we can build a future where sustainable development and environmental stewardship go hand in hand. "
        }
    ]
}