{
    "url": "https://defrafarming.blog.gov.uk/2025/09/11/an-update-on-fetf-grant-funding-agreements/",
    "title": "An update on FETF grant funding agreements ",
    "authors": [
        "The Team"
    ],
    "categories": [
        "Payments for equipment, technology and infrastructure"
    ],
    "pub_date": "2025-09-11T12:44:41+01:00",
    "content": [
        {
            "text": "The most recent round of the Farming Equipment and Technology Fund (FETF) was designed to help farmers invest in equipment and technology to improve productivity ,better manage slurry and support animal health and welfare. "
        },
        {
            "text": "We’re pleased with the high level of interest. Since it opened in May, we received approximately 9,500 applications across those 3 themes. "
        },
        {
            "text": "This is the highest number recorded in any FETF round. We want to thank everyone who applied.  "
        },
        {
            "text": "We’re now starting to issue grant funding agreements (GFAs) to successful applicants under the productivity and slurry themes. If your application is successful, you will soon receive an email with your GFA. "
        },
        {
            "text": "Responses to applications under the animal health and welfare theme will follow later, as the high volume of applications means assessment will take longer."
        },
        {
            "text": "Please remember that the grants offered through FETF are competitive. This means that not all applications will be successful. If your application is unsuccessful, we will contact you to explain the reasons why. "
        },
        {
            "heading": 2,
            "text": "Next steps "
        },
        {
            "text": "If you receive an agreement: "
        },
        {
            "text": "Thank you again for your interest in FETF 2025, and we look forward to seeing the impact these projects will have on farming and farming businesses in England. "
        },
        {
            "text": "Subscribe to the Farming blog for updates from the Farming and Countryside Programme. By subscribing, you’ll receive an email whenever we publish a new post. "
        }
    ]
}