{
    "url": "https://nda.blog.gov.uk/nuclear-apprentices-reflect-on-parliamentary-20th-anniversary-event/",
    "title": "Nuclear apprentices reflect on Parliamentary 20th anniversary event",
    "authors": [
        "Ben Hughes",
        "Anna Palmer",
        "Lewis Mackay"
    ],
    "categories": [
        "Early careers",
        "Mission delivery",
        "Skills"
    ],
    "pub_date": "2025-09-11T15:13:15+01:00",
    "content": [
        {
            "text": "Three apprentices from Nuclear Restoration Services (NRS) had the privilege of attending a prestigious Parliamentary event marking 20 years of the Nuclear Decommissioning Authority (NDA) group; two decades of innovation, collaboration, and progress in nuclear decommissioning."
        },
        {
            "text": "Hosted by Sir Lindsay Hoyle, Speaker of the House of Commons, the event brought together MPs, Lords, senior civil servants, and leaders from across the nuclear sector."
        },
        {
            "text": "It was a chance to hear first-hand from senior figures in the Government and their industry about how their work directly contributes to a nationally-significant mission."
        },
        {
            "text": "A highlight was  presenting The Speaker with a pair of custom-made bookends, crafted from decommissioned tools from the Wylfa site in Anglesey, North Wales, and coasters, designed and produced by talented colleagues based at Wylfa and Dounreay in Northern Scotland."
        },
        {
            "text": "Each of the apprentices share their experiences below."
        },
        {
            "heading": 2,
            "text": "Anna Palmer – Project Management Apprentice, Dungeness A"
        },
        {
            "text": "“Being part of the 20-year celebration was a truly proud moment. As someone working on waste-related projects at Dungeness A, I found it especially inspiring to hear Michael Shanks MP, Minister of State at DESNZ, recognise the complexity and significance of the work we do across the NDA group."
        },
        {
            "text": "“His words were a powerful reminder that our efforts — even as apprentices — play a vital role in the bigger picture. The event also reinforced the NDA group’s contribution to national energy security, the safe management of hazardous waste, and preparing sites for future generations. It made me feel even more connected to the legacy we’re helping to build."
        },
        {
            "text": "“A standout moment for me was when the three of us were invited to present gifts to The Speaker. It may have been a small gesture, but it carried great meaning — a symbol of our appreciation and respect for those who have helped shape the journey we’re now part of.”"
        },
        {
            "heading": 2,
            "text": "Lewis Mackay – Electrical Apprentice, Dounreay"
        },
        {
            "text": "“The venue, the people, and the atmosphere all came together to create an unforgettable experience. What resonated most with me was the strong focus on collaboration and innovation throughout the day."
        },
        {
            "text": "“Hearing David Peattie, CEO of the NDA group, speak about our role in national security and the UK’s energy transition really brought home the importance of the work we do — not just within the nuclear sector, but for the country’s future."
        },
        {
            "text": "“Being part of the gift presentation was a moment of real pride. It reinforced that apprentices aren’t just watching from the sidelines; we’re actively contributing to the NDA group’s journey. That recognition meant a great deal to me."
        },
        {
            "heading": 2,
            "text": "Ben Hughes – Health Physics Apprentice, Wylfa"
        },
        {
            "text": "“This was my first major NDA event, and I wasn’t sure what to expect — but it exceeded everything. The atmosphere was welcoming, and the sense of community was strong. I loved seeing the diversity of roles and projects across the group, from engineering to environmental management."
        },
        {
            "text": "“Presenting the gift to The Speaker alongside my fellow apprentices was a highlight. It was a great way to represent the future of the NDA group and show our appreciation for the leadership and vision that brought us all together.”"
        },
        {
            "text": "The NDA group invests more than £45 million each year in its early careers programme, with more than 1,000 apprentices and graduates currently building experience delivering our mission. The group also makes significant amounts available each year to develop talent and support future pioneers with PhD bursaries."
        },
        {
            "text": "The NDA group graduate programme is now open, find out more at ndagroup.careers/early-careers."
        }
    ]
}