{
    "url": "https://educationinspection.blog.gov.uk/2025/09/11/registering-and-inspecting-school-based-early-years-provision-what-the-updated-guidance-means-for-you/",
    "title": "Registering and inspecting school-based early years provision: what the updated guidance means for you  ",
    "authors": [
        "Lee Owston, National Director, Education",
        "Yvette Stanley, National Director, Social Care and Regulation"
    ],
    "categories": [
        "early years",
        "inspection",
        "schools"
    ],
    "pub_date": "2025-09-11T14:59:03+01:00",
    "content": [
        {
            "text": "In this blog, we take you through the changes we’ve made to our guidance on registering and inspecting school-based provision to reflect how we are seeing early years or childcare provision being delivered.  "
        },
        {
            "text": "Our updated guidance offers clearer definitions and examples to help you understand whether your school’s early years or childcare provision is exempt from registering with Ofsted. In some cases, this might mean that schools previously considered exempt from registration will now need to register on the Early Years and/or Childcare Register(s). "
        },
        {
            "text": "Our updated guidance is for maintained schools, academies, multi-academy trusts, non-maintained special schools and independent schools that provide early years and childcare. It is also for those considering applying to be part of the government’s £370 million school-based nurseries expansion programme. "
        },
        {
            "text": "Our updates:  "
        },
        {
            "heading": 2,
            "text": "What does the law say? "
        },
        {
            "text": "The Childcare Act 2006 sets out when schools do not need to register their early years and childcare provision with Ofsted separately.  "
        },
        {
            "text": "It says that you don’t need to register provision for children aged 2 and over if all the following apply: "
        },
        {
            "text": "If your school’s provision does not meet all these criteria, then you must apply to register it on the Early Years and/or Childcare Register(s) unless a different exemption applies. Provision for under 2s must always be registered.   "
        },
        {
            "heading": 2,
            "text": "What does ‘made at the school’ mean? "
        },
        {
            "text": "The term ‘made at the school’, used in the Childcare Act 2006, has previously caused confusion, so we want to clarify it.  "
        },
        {
            "text": "We consider childcare as being ‘made at the school’ if it takes place in buildings or premises that legally count as part of your school site, using the definitions from the Education Act 1996. "
        },
        {
            "text": "If the location isn’t officially part of your school buildings or premises, then we do not consider the childcare to be happening ‘at the school’. In this case, you may need to register with Ofsted. You can find out how to register with us at the end of this blog.  "
        },
        {
            "heading": 2,
            "text": "What else have we added? "
        },
        {
            "text": "The school landscape has changed significantly since we published this guidance. We have added more information to better reflect the range of provision offered across various types of schools and clarified expectations.  "
        },
        {
            "text": "In all cases, if your school operates provision for children aged 2 and over and this provision meets all 3 exemption criteria, you do not need to register it with us. "
        },
        {
            "text": "Some additional points for: "
        },
        {
            "heading": 2,
            "text": "What does the update mean for inspection?  "
        },
        {
            "text": "How we inspect school-based early years and childcare provisions depends on: "
        },
        {
            "text": "We appreciate that this is complicated. To help, we recommend reading the annex of our guidance, where we’ve provided examples of various scenarios. If it’s still unclear how we would inspect your provision, please do get in touch.  "
        },
        {
            "heading": 2,
            "text": "What to do next "
        },
        {
            "text": "We recommend reading the updated guidance for detailed examples, registration requirements and how we will inspect. "
        },
        {
            "text": "If you do need to register, please read our blog post about what you need to know when applying to register with us. It will help you choose the correct register based on the provision you offer and will guide you through the application process.  "
        },
        {
            "text": "If you’re exempt from registering with us, you may still need to follow the legal requirements. This means following the relevant requirements of the early years foundation stage statutory framework and Childcare Register.   "
        },
        {
            "text": "We are here to help. If you have questions, email enquiries@ofsted.gov.uk. Please include ‘RISBP’ in the subject of your email so we can put you in touch with the right team more quickly. You can also speak to your local authority about any next steps for your provision.  "
        },
        {
            "text": "Finally, thank you again for all the work you do to improve the lives of children, day in, day out.  "
        }
    ]
}