{
    "url": "https://educationhub.blog.gov.uk/2024/05/13/before-and-after-school-childcare-what-is-wraparound-childcare/",
    "title": "Before and after school childcare: Everything you need to know about wraparound care",
    "authors": [
        "mediaofficer"
    ],
    "categories": [
        "Childcare",
        "Schools"
    ],
    "pub_date": "2024-05-13T16:10:44+01:00",
    "content": [
        {
            "text": "We’re supporting working families through the UK government’s biggest ever investment in childcare, to make it more affordable, available and flexible."
        },
        {
            "text": "As part of this announcement, we’re expanding wraparound care for primary school children across England by increasing the number of places available, to support working families."
        },
        {
            "text": "But what exactly is wraparound care? We explain everything you need to know, from what it is to how you can access it."
        },
        {
            "heading": 3,
            "text": "What is wraparound care?"
        },
        {
            "text": "Wraparound childcare is before and after school care for primary school aged children in England during term time, such as  and regular afterschool provision that runs until 6pm or later."
        },
        {
            "text": "The childcare should be available every school day outside of regular school hours and is aimed at helping parents access more childcare and work the hours they want to."
        },
        {
            "text": "This is different from out-of-school activities, or school clubs, which are less frequent and can be a one-off activity."
        },
        {
            "text": "Around 60 percent of primary schools across England offer wraparound childcare, both before and after school."
        },
        {
            "text": "Private, voluntary, and independent providers, including childminders and early years settings, are also able to offer wraparound childcare. Often, it’s run on a school site or another setting in the local area."
        },
        {
            "heading": 3,
            "text": "How do I find wraparound childcare near me?"
        },
        {
            "text": "Parents looking for childcare options for their primary school child should speak to their child’s school or the Family Information Service run by their local authority to find out what wraparound childcare is currently available in the area."
        },
        {
            "text": "From September 2024, parents can expect to see an increase in the number of wraparound childcare places available across the country."
        },
        {
            "text": "We expect all parents who need it to have access to wraparound childcare, either from their school or from another provider in their local area, by September 2026."
        },
        {
            "text": "We encourage parents to talk to their child’s school or the Family Information Service in their local authority about their need for wraparound childcare, even if it’s not currently available."
        },
        {
            "heading": 3,
            "text": "Who will be eligible for wraparound care?"
        },
        {
            "text": "Our ambition is that all parents in England with primary school aged children will be able to access wraparound care in their local area by September 2026."
        },
        {
            "heading": 3,
            "text": "How much will it cost and is financial support available?"
        },
        {
            "text": "Providers will set their own fees for wraparound places, so prices will vary."
        },
        {
            "text": "Parents will pay their wraparound childcare provider directly for their child’s place."
        },
        {
            "text": "Parents eligible for Tax-Free Childcare or Universal Credit Childcare will be able to use the support to help pay for wraparound care."
        },
        {
            "text": "Tax-Free Childcare could save eligible parents up to £2,000 per year for children aged up to 11, or £4,000 per year for children aged up to 17 with disabilities."
        },
        {
            "text": "Universal Credit Childcare could save eligible parents up to 85% of their childcare costs for children aged up to 16."
        },
        {
            "text": "To check if you are eligible for Tax-Free Childcare or Universal Credit Childcare, visit the Childcare Choices website."
        },
        {
            "heading": 3,
            "text": "What if wraparound childcare is not available in my area?"
        },
        {
            "text": "If you live in England you can request that your child’s school consider setting up wraparound childcare for your child if they don’t already provide it."
        },
        {
            "text": "You should write to your child’s school by letter or e-mail and include when you most need wraparound childcare, detailing the days and times you need it. The school will get back to you with a decision within a school-term."
        },
        {
            "heading": 3,
            "text": "How are we supporting local authorities to deliver the wraparound care expansion?"
        },
        {
            "text": "To make more available wraparound care possible, local authorities will receive a share of £289 million to help map out and accommodate the needs of parents in their area."
        },
        {
            "text": "They will also be able to use the funds to test different ways to increase their wraparound options, including working with local private providers or partnering with schools."
        },
        {
            "text": "We’re also giving local authorities a share of a further £100 million to ensure childcare settings in the area – including both early years and wraparound settings – have enough physical space to roll out the programme from next year."
        },
        {
            "heading": 3,
            "text": "What else are we doing to improve access to childcare for under 5s for working parents?"
        },
        {
            "text": "We’re doubling the amount we are investing in childcare over the next few years from around £4 billion to around £8 billion each year."
        },
        {
            "text": "As part of this investment, by September 2025, working parents will be able to claim 30 hours childcare a week, over 38 weeks of the year, all the way through from nine months up to their child starting school."
        },
        {
            "text": "Nurseries are also set to receive a £204 million cash boost which they can use to ease cost pressures such as staffing costs, training and bills."
        },
        {
            "text": "You can read more about how we’re investing in childcare in England on the Education Hub."
        }
    ]
}