{
    "url": "https://dataingovernment.blog.gov.uk/2024/05/13/improving-data-in-the-criminal-justice-system/",
    "title": "Improving Data in the Criminal Justice System ",
    "authors": [
        "Sarah Blake – Deputy Director, Ministry of Justice"
    ],
    "categories": [
        "Data Strategy"
    ],
    "pub_date": "2024-05-13T12:22:35+01:00",
    "content": [
        {
            "text": "Data plays a pivotal role in the Criminal Justice System (CJS), serving as a valuable resource that informs and enhances decision-making processes for organisations within the system."
        },
        {
            "text": "However, there are opportunities for improvement. The Criminal Justice System data is owned and managed by each individual CJS organisation which presents several challenges. Siloed systems, inefficient processes and the absence of a unified approach to CJS data mean that the flow of data across the CJS slow and difficult. This often results in strategic — policy and operational — decisions being made without access to the latest cross-system data."
        },
        {
            "text": "The CJS Data Improvement Programme, which is co-led by the MoJ and Home Office, is aiming to address these challenges by improving how cross-CJS data is shared, used, and managed. Our mission is to enable data-driven decision-making that harnesses the full breadth of data across the system.  The programme's work will act as the basis for driving better evidenced policies, improved insight of operational performance, and an enhanced understanding of the end-to-end CJS."
        },
        {
            "text": "Our Focus "
        },
        {
            "text": "Given the wide-ranging challenges facing data in the Criminal Justice System, there are several areas of concentration for the CJS Data Improvement Programme to address over the next 12 months:"
        },
        {
            "text": "Data linking to better understand the CJS"
        },
        {
            "text": "There has been excellent progress made in the data linking space already which we will continue to build on. For example, the award-winning Splink data linking methodology developed by MoJ has been used by the Data First programme to support researchers with access to linked data from across the justice system, and by the Better Outcomes through Linked Data (BOLD) programme to demonstrate the value of linked data through targeted cross-government pilots. The National Crime and Justice Lab in the Home Office has also started delivering insights by linking different police and Home Office data sets."
        },
        {
            "text": "The CJS Data Improvement Programme will leverage the insights and learning gained from both programmes to develop a shared CJS linked dataset. Using Splink, the dataset will bring together Police, CPS and MoJ data to provide new insights into policy, performance, and efficiency of the whole end-to-end system to enable better data-driven decision-making."
        },
        {
            "text": "This work not only signifies a crucial step forward in comprehending important policy and operational topics such as victim attrition and case timeliness, but also establishes a solid framework for ongoing collaboration within the CJS. The lessons learned and successes achieved in this initiative serve as a catalyst for a more robust, data-driven approach to improving the efficiency and effectiveness of our criminal justice processes."
        },
        {
            "text": "CJS Operational Dashboards "
        },
        {
            "text": "The public-facing CJS Delivery Data Dashboard provides local users with access to a range of data from different parts of the system, at both national and regional levels. Through user research, we have identified an opportunity to build on this work through developing dashboards tailored specifically for Local Criminal Justice Boards (LCJBs). These new dashboards will provide LCJBs access to previously unseen linked CJS data, that allows them to better analyse the effects of policies, measure operational performance, and model fluctuations in demand."
        },
        {
            "text": "The Programme will test a pilot CJS Operational Dashboard using local data in at least three LCJBs. The pilot will allow us to analyse how the tool can be applied in practice and whether it fulfils the requirements of LCJBs."
        },
        {
            "text": "Data fundamentals"
        },
        {
            "text": "Alongside some of the products we are developing that can directly improve how data is used across the CJS, it is equally important to spend time and effort getting the data fundamentals right to improve the data system itself. Whilst responsibility and ownership for CJS data lies within each CJS organisation, there are things we can do to improve such data fundamentals when developing and implementing the CJS dataset and CJS Operational Dashboards, such as:"
        },
        {
            "text": "Our long-term strategy and what is next? "
        },
        {
            "text": "We know there is so much potential in the data that is held across the CJS, and whilst our CJS Data Improvement Programme is making good progress in harnessing that potential, it is just the beginning."
        },
        {
            "text": "In the background, we are working with all parts of the CJS to design how our programme evolves to scale-up our work over a longer period to maximise the benefits it delivers to the whole CJS."
        },
        {
            "text": "To support the delivery of this work, we welcome and value collaboration from data specialists across government. Are you a dynamic data professional looking to make a difference? To deliver our programme’s work, we’ll need passionate data professionals to join our growing team. If you’re interested in working with us, keep an eye on Civil Service Jobs."
        },
        {
            "text": "We would love to know what you think. You can comment below or email us at cjs.dataimprovementprogramme@justice.gov.uk "
        }
    ]
}