{
    "url": "https://earlyyears.blog.gov.uk/2024/05/13/maintaining-quality-early-years-provision-in-the-face-of-workforce-challenges/",
    "title": "Maintaining quality early years provision in the face of workforce challenges",
    "authors": [
        "Lee Owston, National Director Education",
        "Alex Jones, Director, Insights and Research"
    ],
    "categories": [
        "Early years"
    ],
    "pub_date": "2024-05-13T10:59:45+01:00",
    "content": [
        {
            "text": "We know that many of you in the early years sector continue to face significant challenges, especially around recruiting and keeping well-qualified staff."
        },
        {
            "text": "In this blog, we will highlight:"
        },
        {
            "text": "Workforce challenges and issues "
        },
        {
            "text": "Some of the main workforce issues include low pay, challenging working conditions, lack of professional development, staff not having the right qualifications, poor leadership and low levels of staff well-being. Some of these are big systemic challenges that you have little or no control over, for example the quality of qualifications that your staff receive. But there are some challenges that you can influence and remedy to some extent, for example the quality of leadership and how much attention you pay to staff well-being."
        },
        {
            "text": "Safeguarding"
        },
        {
            "text": "The biggest and most immediate risks are to safeguarding. We have seen evidence of this on our inspections when providers:"
        },
        {
            "text": "Incomplete inductions are a particular concern. They can result in significant risks for children. For example, staff may miss important information about allergens or a child’s specific needs."
        },
        {
            "text": "High staff turnover negatively affecting children"
        },
        {
            "text": "High staff turnover can reduce the opportunities for your staff to get to know your children. This means they may not easily be able to identify what your children know and can do or what they need to know and be able to do next. If your staff do not know the children well, this can also affect the quality of their interactions with them."
        },
        {
            "text": "High staff turnover can also result in inconsistency in the key person relationship. Without a consistent key person, it is harder to recognise and meet a child’s individual needs. The key person relationship is especially important during periods of transition, for example if one of your children is moving into the next room for their age or is preparing to transition to school or another childcare setting. It is vital that, during these periods, your staff know the children well. And they need to be able to communicate children’s learning and development to parents, carers and other practitioners for the next stage."
        },
        {
            "text": "When staff turnover is not managed well, there is less attention paid to children’s learning and development. This is most likely to negatively affect children who need early education the most, for example children who are vulnerable, including those with special educational needs and disabilities (SEND) and those with gaps resulting from the pandemic."
        },
        {
            "text": "Shortages negatively affecting staff"
        },
        {
            "text": "We are seeing staff shortages leading to managers and leaders stepping in to fulfil staff ratios themselves. While this means that rooms can remain open for children, leaders then have less time for vital tasks such as:"
        },
        {
            "text": "Workforce challenges can also affect the emotional well-being of your staff. For example, if you are regularly hiring temporary staff without fully inducting them, then the additional burden falls on existing staff. And if you are unable to release staff for training, this can hinder their career progression and leave them feeling demoralised."
        },
        {
            "text": "Measures that providers are putting in place"
        },
        {
            "text": "To lessen the impact of workforce challenges, we have seen some of the strongest leaders put specific measures in place. These measures may not be effective in every setting or may need to be adapted for your context, but we hope they are useful to you."
        },
        {
            "text": "Information-sharing is key to mitigating risks"
        },
        {
            "text": "Good leaders know that information-sharing can reduce the risks that result from workforce challenges. They do this by:"
        },
        {
            "text": "Supporting staff"
        },
        {
            "text": "Strong leaders recognise the importance of staff well-being. We have seen many good examples of leaders putting measures in place to support their staff. Some examples include:"
        },
        {
            "text": "What we are doing"
        },
        {
            "text": "We want to reassure you that our inspectors understand the challenges many of you are facing, and the impact they can have on your staff and children."
        },
        {
            "text": "We will look carefully and sensitively at the measures you are taking to reduce these negative effects and how they are helping your staff and children."
        },
        {
            "text": "And we are engaging with external organisations and the government to share our concerns about workforce issues. We hope that the Department for Education’s campaign to help recruit more early years staff is successful."
        },
        {
            "text": "Conclusion "
        },
        {
            "text": "We know that you are working hard to manage workforce challenges in your settings, even though some of the factors are outside of your control. We know that you are also doing this at a time when ongoing childcare reforms are increasing the demand for childcare."
        },
        {
            "text": "Putting into place robust information-sharing strategies to avoid losing knowledge among your staff will help you reduce some of the negative impact on your children’s care and education. And maintaining good management oversight will help with your staff’s well-being."
        },
        {
            "text": "For our part, we will continue to regulate and inspect responsibly and proportionately, in the best interests of children."
        }
    ]
}