{
    "url": "https://dluhcmedia.blog.gov.uk/2024/05/13/secretary-of-state-interview-on-long-term-plan-for-housing/",
    "title": "Secretary of State interview on Long Term Plan for Housing",
    "authors": [
        "dluhcpress"
    ],
    "categories": [
        "Housing"
    ],
    "pub_date": "2024-05-13T15:59:19+01:00",
    "content": [
        {
            "text": "Housing Secretary Michael Gove was interviewed by Martha Kearney as part of a BBC Radio 4 Today Programme series on housing which aired on Saturday, 11 May, where he set out how the Long Term Plan for Housing will deliver the homes we need."
        },
        {
            "text": "The Secretary of State said we are on track to meet the target of building one million homes this Parliament and the Section 21 evictions ban for new tenancies will be effective in a matter of months after the Renters (Reform) Bill gains Royal Assent in the summer. Shortly after that we will be in a position to end section 21 for existing tenancies."
        },
        {
            "text": "On the issue of children in temporary accommodation, the Housing Secretary said the rise had been, in part, due to the increasing pressure on housing supply. Temporary accommodation exists to make sure families are not left without a roof over their heads. We are giving councils £1.2 billion so that they can give financial support to those who need it, helping them to find a new home and move out of temporary accommodation."
        },
        {
            "text": "More broadly, we are delivering on our long-term plan for housing and building more of the homes this country needs. We’re making good progress and are on track to deliver one million homes over this Parliament, backed by £10 billion investment in housing supply since the start of this Parliament. We are also investing £11.5 billion through the latest Affordable Housing Programme which will provide tens of thousands of new homes across the country.  Last year we delivered over 234,000 new homes – and the four highest rates of net additional housing supply in 30 years have all come since 2018."
        },
        {
            "text": "Meanwhile, the Renters (Reform) Bill will deliver our manifesto commitment to abolish Section 21 no-fault evictions and ensure a fairer private rented sector for both tenants and landlords. These are the biggest changes in 30 years – and we continue to work with the sector to ensure the Bill passes into law as soon as possible."
        }
    ]
}