{
    "url": "https://ukhsa.blog.gov.uk/2024/05/13/should-we-be-worried-about-the-new-covid-19-variant-2/",
    "title": "Should we be worried about the new COVID-19 variant?",
    "authors": [
        "Blog Editor"
    ],
    "categories": [
        "Coronavirus (COVID-19)"
    ],
    "pub_date": "2024-05-13T17:45:56+01:00",
    "content": [
        {
            "text": "With the recent emergence of a new group of COVID-19 variants, known collectively as FLiRT, some people are asking about how these new strains compare to other variants. The unofficial nickname was inspired by the names of the mutations in the genetic code of the variants. They descend from JN.1, which had variant BA.2.86 as a parent."
        },
        {
            "heading": 2,
            "text": "What have we seen so far?"
        },
        {
            "text": "One of the FLiRT variants, KP.2, caused around 25% of new sequenced cases in the US over the last 2 weeks of April, according to the Centers for Disease Control and Prevention (CDC)."
        },
        {
            "text": "As of April 2024, in the UK, the circulating variants are a mix of JN.1 sublinages, several of which appear to be increasing in prevalence. KP.2 is one of the variants identified in the UK. We will continue to monitor these variants as the situation evolves."
        },
        {
            "text": "UKHSA is continuing to monitor data relating to new variants both in the UK and internationally, assessing their severity and the ongoing effectiveness of vaccines. There is no change to the wider public health advice at this time."
        },
        {
            "text": "It is important to note that we will need more data to draw any conclusions about the effect of these mutations on transmissibility and severity of the variant. In this blog post we’ll outline what we know so far and what action we are taking."
        },
        {
            "text": "It’s normal for viruses to mutate and change, and more widely we’re still getting to grips with how the healthcare system responds to the ebb and flow of seasonal cases. As more data becomes available on this variant, we’ll have a better understanding of how it interacts with our immune systems and how to optimise our protection and as well as actions we can take to keep the most vulnerable safe and live our lives as normally as possible."
        },
        {
            "heading": 2,
            "text": "If people become unwell, and are unsure if they have COVID-19, what should they do?"
        },
        {
            "text": "If you have symptoms of a respiratory infection, such as COVID-19, and you have a high temperature or do not feel well enough to go to work or carry out normal activities, you should avoid contact with vulnerable people and stay at home if possible."
        },
        {
            "text": "For those of us who absolutely can’t stay at home, our Living with COVID guidance is unchanged, and outlines how to prevent transmission to others."
        },
        {
            "heading": 2,
            "text": "Why should people come forward for their vaccine?"
        },
        {
            "text": "Vaccines remain our best defence against severe disease and hospitalisation from flu and COVID-19. That’s why we’re asking over-75s, those who have a weakened immune system, and anyone living in a care home for older adults, to come forward for their spring vaccination."
        },
        {
            "heading": 2,
            "text": "What surveillance systems are in place?"
        },
        {
            "text": "We publish the latest surveillance data for COVID-19 and other respiratory illnesses weekly, to the UKHSA data dashboard. We’re also getting vital data from those who are admitted to hospital with symptoms, and we are utilising genome sequencing to understand which variants people are most vulnerable to."
        },
        {
            "text": "There are also specific surveillance programmes in place, where small sample groups are tested regularly. These allow us to monitor trends in the wider community."
        },
        {
            "text": "Hospital is where we will see the more severe cases, and we will be monitoring the numbers of people attending with COVID-19 symptoms very carefully. This will help us understand the growth rate and transmission potential of the new variant."
        },
        {
            "text": "We continue to collaborate globally with health organisations in other countries, the World Health Organisation and initiatives such as the Global Influenza Surveillance & Response System (GISAID) to ensure that we have the most current data."
        },
        {
            "heading": 2,
            "text": "What is the UKHSA doing to tackle the new variant?"
        },
        {
            "text": "When a new variant appears on our radar, at the initial stages it is often quite difficult to know whether the mutations provide any advantages to the virus. Genetic mutations happen all the time, and in some cases have been known to make a virus less transmissible or cause a milder reaction in people."
        },
        {
            "text": "At these early stages our scientists at the Vaccine Development and Evaluation Centre (VDEC) are busy growing a stock of the JN.1 variant in our high containment facilities, so that we can begin testing."
        },
        {
            "text": "At the same time, scientists in our COVID-19 Vaccine Unit work hand in glove with vaccine developers to get samples of new, as yet unlicensed, vaccines to assess whether they will give better protection against the virus."
        },
        {
            "text": "Vaccinations for flu and COVID-19 help to keep vulnerable people out of hospital and carrying on with their day-to-day lives, as well as reducing pressure on our NHS. If you’re eligible for the jabs, please don’t hesitate, book your vaccine today."
        }
    ]
}