{
    "url": "https://educationhub.blog.gov.uk/2023/11/flexible-and-part-time-jobs-why-teaching-in-further-education-could-be-a-great-next-step/",
    "title": "Flexible and part time jobs: why teaching in further education could be a great next step",
    "authors": [
        "mediaofficer"
    ],
    "categories": [
        "Further education",
        "Teacher recruitment"
    ],
    "pub_date": "2023-11-01T15:14:02+00:00",
    "content": [
        {
            "text": "Many working parents who juggle childcare and a career might be looking for better flexibility in their working lives, and teaching in further education is one option to explore."
        },
        {
            "text": "It’s a route that allows you to continue working in your current industry, while also enjoying a better work-life balance."
        },
        {
            "text": "Here’s everything you need to know about teaching in further education (FE) and why it could be a great next step for your career."
        },
        {
            "heading": 3,
            "text": "What do further education teachers do?"
        },
        {
            "text": "FE teachers teach academic and vocational courses to young people and adults."
        },
        {
            "text": "FE refers to all education options for those aged 16 and over who are not studying for an undergraduate degree, so it’s a perfect choice if you’re interested in teaching young people and adults, and you’re keen to share your industry knowledge and skills."
        },
        {
            "text": "FE courses range from construction and engineering to law and healthcare, meaning that teachers can stay closely connected to their own industry, as they help prepare the next generation of talent for an exciting career."
        },
        {
            "text": "Teaching in FE is varied and isn’t just restricted to the classroom. Lessons can take place in workshops, on-site, or anywhere that allows learners to get hands-on experience in their field."
        },
        {
            "heading": 3,
            "text": "How do I become a further education teacher?"
        },
        {
            "text": "If you have real world industry experience, your skills could make you a great FE teacher, and you don’t always need a prior teaching qualifications or an academic degree to get started."
        },
        {
            "text": "Industry experience is invaluable in FE, helping to inspire and motivate the next generation of workers."
        },
        {
            "text": "A genuine passion for your field will help you to pass on valuable knowledge and transferable skills to create a supportive learning environment for your students."
        },
        {
            "heading": 3,
            "text": "Why might teaching in further education be a good fit for working parents?"
        },
        {
            "text": "According to a recent study, over three quarters (77 percent) of working parents remain passionate about their industry, and nearly 9 in 10 (88 percent) would be interested in more part time or flexible opportunities to improve their work-life balance."
        },
        {
            "text": "Many FE teachers work flexibly – in fact, as many as 40 percent of FE college teachers are on part-time contracts."
        },
        {
            "text": "This makes FE teaching a good option for working parents who are looking for new, adaptable opportunities which make use of their existing industry skills."
        },
        {
            "heading": 3,
            "text": "Where can I find jobs in further education?"
        },
        {
            "text": "AoC jobs and FE jobs are a good place to begin your search for a role in FE teaching."
        },
        {
            "text": "Alternatively, reach out to your local college to see what opportunities are available."
        },
        {
            "text": "To find out more about how you can share your skills by teaching in FE visit this page."
        },
        {
            "text": "A dedicated support service is also on hand to provide more information or advice on finding the perfect further education job for you:"
        },
        {
            "text": "To get in touch, email teach.FE@education.gov.uk or call 0800 389 2502."
        }
    ]
}