{
    "url": "https://deframedia.blog.gov.uk/2023/11/01/inaccurate-coverage-on-monitoring-water-quality-in-england/",
    "title": "Inaccurate coverage on monitoring water quality in England",
    "authors": [
        "defrablogs"
    ],
    "categories": [
        "Uncategorized"
    ],
    "pub_date": "2023-11-01T19:24:04+00:00",
    "content": [
        {
            "text": "There has been inaccurate media coverage on water quality monitoring in England, including claims that the UK government is to diverge from the European Union’s standards and that it’s using its own undisclosed methodology to assess river health."
        },
        {
            "text": "No decision has been made to diverge from EU standards on water quality monitoring – as set out in the Water Framework Directive (WFD) – and any new approach would be subject to consultation in the normal way. The Water Environment (Water Framework Directive) (England and Wales) Regulations 2017 were rolled over wholesale into our domestic law when the UK left the EU. "
        },
        {
            "text": "There has never been requirement in the WFD, or in UK WFD regulations, to do an annual survey (national classification) of water bodies. The Environment Agency is legally obliged to include data for every water body in England in the river basin management plans, which are reviewed, updated and published every six years. The most recent full set of data was published in 2019, ahead of the 2021 river basin management plans, and the next full data set will be published in 2025."
        },
        {
            "text": "Furthermore, the EA has introduced a new long-term ‘river surveillance network’ monitoring programme for rivers to give a national overview of the state of England’s rivers – however it does not replace the Water Framework Directive monitoring, which will still continue. This network is a key part of the National Capital and Ecosystems Assessment (NCEA), which will provide a statistically robust assessment of the health of the water environment and how this changes over time at a national scale and over the long term."
        },
        {
            "text": "The government aims to make sure a clear and robust framework underpins our whole management of the water system, as laid out in the Plan for Water. This will include a review of the implementation of the Water Environment Regulations 2017, whilst retaining our objective to restore 75% of water bodies to good ecological status. "
        },
        {
            "text": "A Defra spokesperson said:"
        },
        {
            "text": "“As set out in the Plan for Water, we want to make sure a clear and robust framework underpins our whole management of the water system."
        },
        {
            "text": "“This will include a review of the implementation of the Water Environment Regulations 2017 whilst retaining our objective to restore 75% of water bodies to good ecological status. Any changes would be fully consulted on in the usual way.”"
        },
        {
            "text": "An Environment Agency spokesperson said: "
        },
        {
            "text": "“Improving water quality is one of our highest priorities. We work through plans established under the Water Environment Regulations to guide our permitting and enforcement. This work must be driven by a clear evidence base and we are working with partners to provide better information to enable this, including more real-time data.  "
        },
        {
            "text": "“The next comprehensive update of classifications in all water bodies will be 2025. No significant changes to the classification methodology are planned – including changes to one-out all-out. Every single water body will receive a classification.”"
        }
    ]
}