{
    "url": "https://governmentscienceandengineering.blog.gov.uk/2023/11/01/national-engineering-day-2023/",
    "title": "National Engineering Day 2023",
    "authors": [
        "Piera Carugno"
    ],
    "categories": [
        "Blog Series",
        "Guest Blog",
        "Our People & Deep Dives"
    ],
    "pub_date": "2023-11-01T09:53:57+00:00",
    "content": [
        {
            "heading": 3,
            "text": "Meet Piera Carugno, a chartered engineer and GSE member"
        },
        {
            "text": "Today is National Engineering Day and this year the focus is on celebrating engineers across the country who are working on projects and products which improve lives. "
        },
        {
            "text": "One such Engineer is Piera Carugno, Head of Cross-Government R&D Strategy and Spend at the Government Office for Science (GO-Science) and a GSE member. Piera is a chartered engineer and a member of the Royal Aeronautical Society, and she holds a BSc in Aerospace Engineering and an MSc in Aeronautical Engineering from Sapienza – Universita’ di Roma. However, Piera didn’t always work for the Civil Service. Her professional career has included roles at Rolls-Royce plc and McLaren Automotive, and we caught up with Piera to chat about her role to discover more about her career journey in engineering. "
        },
        {
            "text": "Hi Piera, can you tell me about your current role, what do you do? "
        },
        {
            "text": "I currently lead a small team in GO-Science advising the Government Chief Scientific Adviser on making better use of our publicly funded national laboratories and ensuring our public science expenditure is impactful. I also ensure we have the venturing capability needed in departments to partner with innovative firms to support the development of new technologies that meet the Government’s science and technology needs. "
        },
        {
            "text": "That sounds interesting! You have worked in some really fascinating industries in your career. What did you do at Rolls-Royce and McLaren? "
        },
        {
            "text": "Indeed, it was great fun to work in aerospace and then in the automotive industry! At both Rolls-Royce and McLaren, I felt that I was at the cutting edge of really cool technologies, and that made the job much more fun! At Rolls-Royce, I was a Principal Aeroacoustics Engineer, collaborating with US and European partners and looking after one strand of Rolls-Royce's technology roadmap to reduce noise emissions. At McLaren, I was a Senior Aerodynamics Engineer, and I was responsible for the aerodynamic performances of a couple of our future supercars, working very closely with McLaren’s design studio and using system engineering to optimise the overall aerodynamic design of the car."
        },
        {
            "text": "They sound like cool jobs. What made you move into Government from industry? "
        },
        {
            "text": "That’s a really good question! When I changed jobs from Rolls-Royce to McLaren, I wanted to experience the engineering challenge of going from a long product lifecycle of about 20 years to a shorter product lifecycle of about 2 years. I wanted a similar type of challenge coming into Government, and for me, this has meant embracing the challenge of broadening my thinking beyond engineering and taking a bird’s eye view of science and tech for the huge machine that is Government – so far, I think that this challenge has been very rewarding! "
        },
        {
            "text": "Do you think being an engineer helps you in your current role? "
        },
        {
            "text": "Definitely! The complicated engineering products and challenges I worked on, be it how to design a quieter jet engine or how to aerodynamically optimise the front end of a sports car, have shaped the way I think, structure and approach problems in my current role. More importantly, in my engineering career, I was very lucky to meet and work with highly specialised and brilliant scientists and engineers who taught me early on the importance of passion for innovation and technology, and how to channel it into everything I do. "
        },
        {
            "text": "What is the best thing about your current role?  "
        },
        {
            "text": "The best thing about my current role is knowing that I am helping colleagues across Government in embracing science and technology so that we can collectively provide better outcomes for citizens and for society. I feel that my role truly allows me to be a strong advocate for the use of science and technology in Government for the greater good. With my colleagues in the GSE Profession we are all using science and tech in Government to respond effectively to the challenges the UK will face in the future, and I am proud to be a part of this. "
        },
        {
            "text": "Thank you for speaking to us, Piera. What an exciting engineering career journey!  "
        },
        {
            "text": "To find out more about National Engineering Day, please visit the website of the Royal Academy of Engineering. They are running an Everyday Engineering competition, and the public vote is open. For more information on this competition, please read our earlier blog on how to get involved.  "
        }
    ]
}