{
    "url": "https://teaching.blog.gov.uk/2023/11/01/our-pupils-find-joy-learning-in-smaller-groups/",
    "title": "Our pupils find joy learning in smaller groups",
    "authors": [
        "Kemisola Okhani"
    ],
    "categories": [
        "Primary schools",
        "Pupil premium & PE premium",
        "Pupil wellbeing and behaviour",
        "Teacher wellbeing"
    ],
    "pub_date": "2023-11-01T09:57:46+00:00",
    "content": [
        {
            "text": "Morden Mount Primary School is a mixed community school with pupils aged 3 to 11 in Greenwich, London. Kemisola Okhani, deputy headteacher shares her experience using tutoring to further support pupils in their learning."
        },
        {
            "text": "How is your school using the National Tutoring Programme (NTP)?"
        },
        {
            "text": "Based on the existing knowledge, experience and expertise of our teachers and staff, we chose the school-led approach to deliver tutoring to our pupils. As our teaching assistants, especially in KS2, are graduates and have subject specialism which supports the learning of our pupils, we believed this approach would be most beneficial. Each of our school-led tutors undertook the NTP training and are quite experienced, as most have been in the school for at least 5 years and developed an understanding of our approach to teaching and learning."
        },
        {
            "text": "Who are the targeted pupils? "
        },
        {
            "text": "The initial focus for tutoring was KS2 – years 3 to 6. The pupils were then identified based on the data from their baseline assessments in September. We were clear that pupils must attend 3 sessions per week and that there would be no more than 3 pupils in each group. This meant the criteria for selection was very tight - we focused on pupils who were working just below the expected standard and struggling with specific area of learning in maths or English."
        },
        {
            "text": "How have the pupils found tutoring?"
        },
        {
            "text": "Our pupils have fed back their joy of learning in smaller groups, as it provides a safe space, without other pupils’ laughter or comments if they give wrong answers. Pupils also shared the importance of having dedicated time for the tutor to focus on them as individuals, and how it is easier to understand certain elements when in smaller groups. The attendance of our sessions has been great so far, contrary to when we used online tutoring. In fact, we now have pupils who keep asking if they can be on a waiting list for tutoring!"
        },
        {
            "text": "What has the impact of NTP been on your school?"
        },
        {
            "text": "Pupils who are receiving tutoring have made exceptional progress, especially with their core mathematical and reading skills. It was the success of our tutoring at KS2 that allowed us to trial a phonics & bagel breakfast club. Our pupils receive a healthy breakfast, before being collected by their tutor for a 45-minute phonics and reading session. Following positive feedback from pupils, year 1 teachers, who were previously reluctant to the idea of early morning tuition for young pupils, have now set up their own breakfast sessions. All of our teaching assistants have been fully trained in the school’s approach to phonics and reading."
        },
        {
            "text": "How will your school continue to deliver tutoring?"
        },
        {
            "text": "As the concentration and quality of our tutoring means that we can only have a few pupils in each group, we are looking at other ways to expand or extend these sessions, so that other pupils can also benefit."
        },
        {
            "text": "NTP allows us to deliver tutoring flexibly. To continue improving our tuition, we are exploring different timetabling options including using the 3pm to 4pm slot on weekdays and Saturdays."
        },
        {
            "text": "Would you recommend NTP to other schools? "
        },
        {
            "text": "Definitely. I have found that the children we sometimes refer to as low achievers or pupils with low cognitive abilities, just need a different or more focused way to learn. As a result of tutoring, we have converted some of our low-key stage 1 attainers to greater depth in KS2. The focused approach means although we support less pupils, we can remove the learning barriers for those pupils."
        },
        {
            "text": "To find out more read the Guide to Tutoring toolkit or view the NTP guidance for schools"
        }
    ]
}