{
    "url": "https://moderncivilservice.blog.gov.uk/2023/11/01/skilled-meet-the-ons-data-science-campus-data-science-for-the-public-good/",
    "title": "Skilled: Meet the ONS Data Science Campus - data science for the public good",
    "authors": [
        "A Modern Civil Service"
    ],
    "categories": [
        "A Modern Civil Service",
        "Data science",
        "Modernisation and Reform",
        "One Big Thing",
        "Skilled Civil Service"
    ],
    "pub_date": "2023-11-01T11:17:06+00:00",
    "content": [
        {
            "text": "The Office for National Statistics (ONS) is the UK's largest independent producer of official statistics and the recognised national statistical institute of the UK. The ONS Data Science Campus was set up in 2017 with a mission to enhance understanding and improve decision-making at all levels."
        },
        {
            "text": "This mission - “data science for the public good” - also underpins the UK Statistics Authority’s aim to provide high quality data and analysis to inform the UK, improve lives and build the future."
        },
        {
            "text": "The ONS has been a pioneer in driving forward the use of data science and AI capability development across government. The Campus and its programmes are in demand across the Civil Service, academia and external data experts as the public sector expands its data capability, in line with the digital and data mission set out in the Declaration of Government Reform."
        },
        {
            "text": "This will play an important role in the capability, digital and data missions - part of the government’s reform focus in creating A Modern Civil Service, one that is skilled, innovative and ambitious."
        },
        {
            "text": "The Campus is always looking for ways to support priorities that will deliver tangible results, whether that’s by enhancing existing processes, developing new statistics or embedding skills so organisations can effectively deliver their departmental and policy objectives."
        },
        {
            "heading": 3,
            "text": "What is data science and how does it affect people?"
        },
        {
            "text": "The government has access to vast amounts of data being collected, analysed and interpreted by analysts across the public sector. What’s different about data science?"
        },
        {
            "text": "New sources of data are emerging all the time, for example debit and credit card spending, footfall and energy usage data. The size and complexity of these data sources demand specialist skills to clean, process and draw out new insights and patterns that would otherwise remain hidden."
        },
        {
            "text": "Making use of data science skills ensures that the public sector is positioned to harness every opportunity that these new data sources provide. These insights help support more accurate, data-driven forecasting."
        },
        {
            "text": "Some of the Data Science Campus’ work that is having a tangible impact on decision-making and the lives of citizens includes:"
        },
        {
            "heading": 3,
            "text": "Learning and development opportunities from the Data Science Campus"
        },
        {
            "text": "None of this work can happen without the public sector having the skills and capacity for long-term development and improvement. That’s why the Campus’ work to build data and data science capability is so important."
        },
        {
            "text": "In the Cabinet Secretary’s annual lecture at University of Bristol in January 2023, Simon Case said: “the reality is that every civil servant needs to be better equipped to use data in how they solve problems and design and deliver public services.”​"
        },
        {
            "text": "The Data Science Campus Capability team’s remit is to build data science skills across the public sector to enable organisations to deliver its data strategies. They develop and deliver a range of programmes at awareness, developing and practitioner (expert) levels."
        },
        {
            "text": "All of its data science programmes are underpinned and aligned to the Data Science Competency and Career frameworks published in the Digital, Data and Technology (DDaT) and Analysis Function professions. They are designed to improve data science skills for new and existing civil servants."
        },
        {
            "text": "At an awareness level, the aim is to increase data literacy for non-analysts, establishing a foundation for good use of data and data science. Next, the programmes focus on developing data science skills across the public sector, supporting talented civil servants to become confident working with data."
        },
        {
            "text": "Reaching practitioner level, data scientists and analysts continue to develop skills and learn from fellow public sector colleagues, so they can take advantage of new opportunities. A few of our dedicated programmes and opportunities available to support civil servants include:"
        },
        {
            "text": "The Campus also runs a cross-government and public sector data science community, bringing together over 2,000 passionate people who share their experiences, passion and expertise through events, showcases, communication channels and bespoke sub-communities."
        },
        {
            "text": "Working with the Cabinet Office to create the practitioner level of One Big Thing, the Data Science Campus is playing an instrumental role in helping to deliver the biggest data training initiative the Civil Service has ever seen. This plays an important role in the capability, digital and data missions of reform, helping to build A Modern Civil Service that’s skilled, innovative and ambitious in how it serves the public."
        },
        {
            "text": "More information on the learning available can be found on the Data Science Campus website."
        },
        {
            "heading": 3,
            "text": "What’s next for the Data Science Campus?"
        },
        {
            "text": "The Campus has an innovative approach that not only addresses important government issues, but also aligns with its commitment to the \"public good\", all with the aim of improving citizens’ lives."
        },
        {
            "text": "Its’ application of data science is improving the data used to make decisions on some of the most pressing issues in our nation. They are pushing the boundaries of what’s possible, looking at what we need to know that traditional data sources can’t tell us, and finding a way to bring those insights."
        },
        {
            "text": "Having the right infrastructure and ability to find these new techniques is also critical for supporting innovation. This, in turn, will improve efficiency and sustainability for those who want to take advantage of these exciting developments."
        },
        {
            "text": "But how do we make this happen? Well, we go back to “skills”. The Campus’ commitment to skills-building initiatives guarantees a continued influx of fresh and passionate emerging talent, dedicated to making a positive impact in our public sector."
        }
    ]
}