{
    "url": "https://cyberandspecialistoperationscommand.blog.gov.uk/2023/11/01/we-are-strategic-command-with-wo-sara-catterall/",
    "title": "We Are Strategic Command with WO Sara Catterall",
    "authors": [
        "bobsendall"
    ],
    "categories": [
        "Personnel"
    ],
    "pub_date": "2023-11-01T10:00:08+00:00",
    "content": [
        {
            "heading": 4,
            "text": "Join us for the first episode of We Are Strategic Command, where Sara touches on her role, life at Strategic Command, and shares some invaluable career advice."
        },
        {
            "text": "In the heart of the military command structure, the role of a Command Sergeant Major is pivotal. This interview takes you behind the scenes with WO Sara Catterall - Command Sergeant Major at Strategic Command, offering valuable insights into Sara’s multifaceted responsibilities."
        },
        {
            "text": "Interviewer: So, what's the role of a Command Sergeant Major all about?"
        },
        {
            "text": "Sara Catterall: Well, my role as Command Sergeant Major is all about people. I can break it down into three key parts. First, I serve as a courier, taking information from the Command Group and distilling it down through our organisation. Secondly, I act as a thermometer, gauging morale and culture while fostering a sense of belonging. And finally, I serve as a translator, helping to simplify the sometimes-complicated language used in the Defence sector."
        },
        {
            "text": " "
        },
        {
            "text": "Interviewer: That sounds like a multifaceted role! Now, can you tell us what led you to your current position at Strategic Command?"
        },
        {
            "text": "Sara Catterall: It might have been a stroke of luck more than anything else, to be honest. I've been in the military for 28 years, starting as an intelligence analyst and often deployed or working with NATO. When the opportunity at Strategic Command came up, it just felt like the perfect fit for me. I'm drawn to the idea of breaking through processes, cutting down bureaucracy, and pushing Defence to be better. Everything we do here feels new, and I love the fresh mindset our people bring to the organisation."
        },
        {
            "text": " "
        },
        {
            "text": "Interviewer: It's great to hear about your journey. Lastly, can you share the best piece of advice you've ever received?"
        },
        {
            "text": "Sara Catterall: The best piece of advice I've ever received is simple but powerful: just be yourself and celebrate who you are. We often get the message that we need to be 'more' – train more, read more, and so on. But it's equally important to recognise and embrace the great qualities we already possess. When we bring our true selves to work, we can make the workplace a better and more genuine place."
        },
        {
            "text": " "
        },
        {
            "text": "WO Sara Catterall – Command Sergeant Major at Strategic Command"
        },
        {
            "text": " "
        }
    ]
}