{
    "url": "https://dfedigital.blog.gov.uk/2023/11/01/working-across-teams-to-streamline-services-for-learners/",
    "title": "Working across teams to streamline services for learners",
    "authors": [
        "Future Systems Unit, Skills Journey Directorate"
    ],
    "categories": [
        "design",
        "multidisciplinary teams",
        "policy",
        "software development",
        "strategy"
    ],
    "pub_date": "2023-11-01T10:00:47+00:00",
    "content": [
        {
            "text": "The government has an ambitious skills agenda. Within this DfE’s ministers have an ambition for a single, unified careers system. It should support individuals to move seamlessly through their skills, training and career journey. Earlier this year the Department set up a new team with this mission at its core. Our unit has been thinking about how we can design, deliver and communicate our policy and services to achieve it."
        },
        {
            "text": "This is a longer-term project building on existing good work. As part of it, this week we have launched a new website called Skills for Careers. The website is the culmination of great multi-disciplinary working. Together we're paving the way for future collaboration and innovation. The website gives a simple, clear overview of government’s skills and careers offer to adults and young people."
        },
        {
            "text": "Please take a look and leave your feedback using the link at the top of the page to help us improve and grow the site."
        },
        {
            "heading": 2,
            "text": "The policy and digital challenge"
        },
        {
            "text": "The 2021 Skills for Jobs White Paper made a commitment to making sure people had clear information about their career and skills options. Since then, teams have been making it easier for learners and employers to find the information they need and the right training options for them."
        },
        {
            "text": "We have done this in many ways. One great example is our new Skills for Life campaign, which is due to launch in January 2024. For the first time, we've united our audiences (adults, young people, employers) into one single, unified umbrella campaign. The new strategy will motivate and inspire all three audience groups. It will make adverts featuring skills products more recognisable and impactful. It will simplify the customer journey with a single call to action and digital destination."
        },
        {
            "text": "The Department also launched a new ‘front door’ website for employers in January 2022 as a first step for business users. The website allows them to compare between the different training and employment schemes on offer. Initial user research from the Customer Experience & Design team highlighted that there was still more to do. We will continue to join up our digital domain to better meet the needs of young people and adults seeking information online."
        },
        {
            "heading": 2,
            "text": "Working together to understand the problem and find a solution"
        },
        {
            "text": "The Customer Experience & Design team ran an ideation session in February. This brought together digital, policy and delivery experts to understand the big picture based on the extensive user research carried out by the team. Further work helped the team to identify 8 top-level user needs relevant to the whole digital skills portfolio."
        },
        {
            "text": "This allowed the collaborative magic to truly begin. Digital experts from different areas of the department came together with careers advisers, communications specialists and policy leads to find creative, innovative solutions that could help meet the 8 user needs. One example is the recently launched design system for the National Careers Service. This has started to bring better visual join up to the system, particularly through its recognisable bold pink colour."
        },
        {
            "heading": 2,
            "text": "Building the “starting point” collaboratively"
        },
        {
            "text": "The Future Systems Unit was lucky to inherit this collaborative tradition when it was set up in April 2023. We joined a BETA team set up to take forward another one of the identified solutions – the new Skills for Careers website that launches today. This work brings digital leads from a range of different teams together to build a great product at pace."
        },
        {
            "text": "Sometimes, you hear stories of digital and policy teams not finding common ground. Not here! The new model in DfE is beginning to show how we can all work together to make decisions that work for everyone. Now, we are energised and motivated to work in multidisciplinary teams, putting the user at the heart of what we do. Together we can achieve much more than we could in individual, siloed teams."
        },
        {
            "text": "There’s lots more to do to keep moving the bigger project forward. We want to find more formal ways to bring this collaborative working together, to keep us focused on user needs and user-centred design. Today though we are taking a step back to appreciate the great things that have already been achieved!"
        }
    ]
}