{
    "url": "https://educationhub.blog.gov.uk/2025/12/the-kings-new-year-honours-list-2026-honours-for-contributions-to-education-skills-and-childrens-social-care/",
    "title": "The King’s New Year Honours list 2026: honours for contributions to education, skills and children’s social care",
    "authors": [
        "mediaofficer"
    ],
    "categories": [
        "Honours"
    ],
    "pub_date": "2025-12-29T22:43:32+00:00",
    "content": [
        {
            "text": "More than 100 people across the UK have been named in the King’s New Year Honours List 2026 for outstanding contributions to education, skills, children’s services and social care."
        },
        {
            "text": "This year’s honours highlight individuals who have improved the lives of children, young people and families through teaching, early years support, further education, skills programmes and special educational needs services. Many recipients have worked to improve opportunities for disadvantaged communities and raise educational standards nationally."
        },
        {
            "heading": 3,
            "text": "Who is named in the honours list for education?"
        },
        {
            "text": "Those recognised include leaders, teachers, youth workers, social care professionals and community advocates who have made a long-lasting impact in schools and local areas. Alongside senior sector leaders are dozens of unsung heroes, awarded CBEs, OBEs, MBEs and BEMs for their dedication to education and support for children and families."
        },
        {
            "text": "Below are some of the inspiring individuals honoured this year."
        },
        {
            "text": "Beth Gibson"
        },
        {
            "text": "Head of Attendance and Inclusive Pathways, Birmingham City Council – for services to Education"
        },
        {
            "text": "Beth has led pioneering work to improve school attendance, developing an innovative approach using banded attendance data that dramatically improved attendance rates at The Queen Elizabeth Academy and has since influenced national practice."
        },
        {
            "text": "Her work introduced a fortnightly attendance curriculum focused on mental health, resilience and future goals, alongside daily free breakfast clubs and more than 40 extracurricular activities. Beth also helped transform the school environment, creating welcoming social spaces with table tennis and basketball, and expanded staffing to include a Family Liaison Officer, increasing home visits ten-fold."
        },
        {
            "text": "In Spring 2025, Beth shared her approach at nine Department for Education regional conferences, reaching more than 2,000 school leaders and practitioners."
        },
        {
            "text": "Beth said:"
        },
        {
            "text": "“It is a total privilege to receive this honour on behalf of everyone who works so hard in schools to support children and families to access education and maximise life chances. It is the wonderful staff in every role who work together to create belonging for children."
        },
        {
            "text": "“I was lucky enough to have a father whose own experience of school drove him to want more for us, and to believe that education could open doors he never had. That belief is where this work began – helping others feel that same sense of belonging and motivation to engage in learning."
        },
        {
            "text": "“Being part of the journey to provide accessible attendance data to schools across the country, reducing workload and allowing greater focus on support, has been incredibly powerful. I am extremely proud to be part of this change in education and of a growing community of professionals sharing great practice and supporting one another.”"
        },
        {
            "text": "Jane Wheeler, MBE"
        },
        {
            "text": "Early Help Service Assistant Director, Prevention and Youth Justice, Sunderland City Council – for services to Children and Families"
        },
        {
            "text": "Jane has dedicated her career to strengthening early help services and improving outcomes for children and families. She has provided long-term personal support to a vulnerable care leaver with complex needs and, in her role as Early Help Service Manager in Sunderland, played a key role in building a Family Help service."
        },
        {
            "text": "The service was recognised by Ofsted in its 2022 inspection report as a highly successful initiative, supporting families earlier and preventing escalation into crisis."
        },
        {
            "text": "Jane said:"
        },
        {
            "text": "“I am deeply honoured to receive an MBE for services to children and families. Throughout my career, my focus has always been on strengthening early help, improving outcomes and ensuring that every child, young person and family can access the right support at the right time."
        },
        {
            "text": "“This recognition reflects the hard work, passion and commitment of the teams I have been privileged to work alongside, who give so much every day. Above all, this honour belongs to the children, young people and families whose strength and resilience continue to inspire me."
        },
        {
            "text": "“Receiving an MBE is both humbling and motivating. It reinforces my commitment to continue driving change, supporting families and building services that genuinely improve lives.”"
        },
        {
            "text": "Sir Steve Taylor"
        },
        {
            "text": "Chief Executive Officer, Cabot Learning Federation – for services to Education"
        },
        {
            "text": "Sir Steve has been recognised for his work to tackle educational inequality across the South West. As Chief Executive Officer of the Cabot Learning Federation, he has led the Bristol-founded trust for more than a decade, overseeing its growth to 36 schools across Gloucestershire and Somerset, serving more than 18,000 pupils."
        },
        {
            "text": "Under his leadership, CLF has built a strong reputation for improving underperforming schools through a values-led approach focused on equity, alongside wider sector collaboration at local, regional and national level."
        },
        {
            "text": "Sir Steve said:"
        },
        {
            "text": "“Since learning of this award, I have thought about all those colleagues in the Cabot Learning Federation and in the wider sector whose work and successes have inspired me over the years to strive to do my best for the children we serve."
        },
        {
            "text": "“Anything I would count as an achievement has come about as a result of working in collaboration with great people, in the CLF and beyond.”"
        },
        {
            "heading": 3,
            "text": "Who else received honours for education?"
        },
        {
            "text": "The King’s New Year Honours also recognise many others whose work has strengthened education, skills and support for children and families across the country. This includes leaders in further education, special educational needs, skills development and community education."
        },
        {
            "text": "Among those honoured are:"
        },
        {
            "text": "Kath Geraghty, MBE, Head of Technical Qualifications at the National Theatre, who has championed apprenticeships and skills development across the creative industries, helping to open up technical theatre careers to a more diverse workforce."
        },
        {
            "text": "Ranu Mehta Radia, MBE, founder of Sai School of Harrow, recognised for her services to the community, supporting children and young people from low-income families through education, enrichment activities and inclusive learning opportunities."
        },
        {
            "text": "Judith Charlesworth, MBE, lately Chair of Barnet Special Education Trust, who has dedicated over five decades to improving education for children with special educational needs and disabilities, both in schools and through governance and leadership."
        },
        {
            "text": "Heather Sandy, CBE, Executive Director of Children’s Services at Lincolnshire County Council, honoured for her services to education, providing national and regional leadership to improve outcomes for children and young people."
        },
        {
            "text": "Nikolaos ‘Nikos’ Savvas, OBE, Principal of West Suffolk College, recognised for his services to further education, transforming the college into a regional leader for inclusive, high-quality skills and post-16 provision."
        },
        {
            "heading": 3,
            "text": "Who else is named in the King’s New Year’s Honours 2026?"
        },
        {
            "text": "The King’s New Year Honours List 2026 recognises 1,157 recipients, including well-known figures from entertainment, sport, music, literature and charity. Among the most high-profile names is Idris Elba, who will receive a Knighthood for services to young people. Christopher Dean and Jayne Christensen (Torvill) are also being honoured, with a Knighthood and Damehood respectively, for their services to ice skating and voluntary work. Cynthia Erivo receives an MBE for her contribution to music and drama."
        },
        {
            "text": "In sport, several Lionesses and Red Roses have also been recognised. Sarina Wiegman is set to receive an honorary Damehood, while Leah Williamson will be awarded a CBE for her services to Association Football. Alex Greenwood, Keira Walsh, Georgia Stanway and Ella Toone are each receiving MBEs for their achievements in football. In rugby, John Mitchell, Zoe Aldcroft and Marlie Packer will receive OBEs, with Ellie Kildunne, Megan Jones and Sadia Kabeya among those being awarded MBEs for their services to Rugby Union."
        },
        {
            "text": "Other notable honours include Meera Syal, who is to become a Dame for her contributions to literature, drama and charity, and composer Max Richter, who receives a CBE for services to music. Warwick Davis is awarded an OBE for services to drama and charity, while Gaby Logan is recognised for her work in sports broadcasting and her charity efforts. Author and presenter Richard Osman will receive an OBE for services to literature and broadcasting, and Ellie Goulding is awarded an MBE for her work on biodiversity and climate."
        }
    ]
}