{
    "url": "https://aphascience.blog.gov.uk/2025/12/29/the-science-blogs-that-shaped-2025/",
    "title": "Inside APHA: The science blogs that shaped 2025",
    "authors": [
        "Heather O'Sullivan"
    ],
    "categories": [
        "APHA news"
    ],
    "pub_date": "2025-12-29T09:00:00+00:00",
    "content": [
        {
            "text": "As 2025 draws to a close, we reflect on a year of ground-breaking research, inspiring stories, and global impact from the Animal and Plant Health Agency (APHA). Our mission to protect animal and plant health has never been more vital, and this year’s blogs give a glimpse into the breadth and depth of our work. From wildlife disease surveillance to championing diversity in science, here is a look back at the stories that defined 2025."
        },
        {
            "heading": 2,
            "text": "Protecting online plant buyers"
        },
        {
            "text": "We kicked off the year with a practical post: “How APHA is protecting online plant buyers” (January 2025). As online plant sales continue to grow, so do the risks of introducing pests and diseases. This blog explains how APHA works to protect consumers and the environment by enforcing plant health regulations and raising awareness about safe buying practices."
        },
        {
            "text": "It is a perfect example of APHA’s proactive approach, combining science, policy, and public engagement to keep our ecosystems safe."
        },
        {
            "heading": 2,
            "text": "Protecting wildlife: uncovering a hidden threat to hedgehogs"
        },
        {
            "text": "One of the most-read posts this year was “Is a newly discovered virus contributing to the decline of our wild hedgehogs?” (May 2025). This fascinating article revealed APHA’s discovery of a novel arterivirus in hedgehogs, using cutting-edge sequencing technologies. Hedgehogs are a beloved species in the UK, yet their numbers have been declining. Could this arterivirus be contributing to their decline?"
        },
        {
            "text": "The blog highlights APHA’s role in wildlife disease surveillance and research, demonstrating how our scientists work tirelessly to understand emerging threats. This discovery not only advances scientific knowledge but also informs conservation strategies to protect biodiversity."
        },
        {
            "heading": 2,
            "text": "Championing women in science: a personal journey"
        },
        {
            "text": "February brought an inspiring story for International Day of Women and Girls in Science. In My Journey in Science, Dr Jess Parry shares her career path from early curiosity to becoming an epidemiologist at APHA. Her reflections underscore the importance of diversity and inclusion in science, and how APHA supports women in building impactful careers."
        },
        {
            "text": "This blog resonated with readers worldwide, reminding us that science thrives when everyone has a seat at the table. Jess’s story is a testament to perseverance, passion, and the power of mentorship."
        },
        {
            "heading": 2,
            "text": "Safeguarding crops: battling the Colorado beetle"
        },
        {
            "text": "In May, we spotlighted plant heath with “Protecting the UK’s potatoes from the Colorado beetle”. This blog explains how APHA monitors and responds to the threat posed by this invasive pest, which can devastate potato crops if left unchecked."
        },
        {
            "text": "The post highlights APHA’s proactive approach to biosecurity, combining surveillance, rapid response, and public awareness to protect one of the UK’s most important staple crops. This blog shows how science and vigilance work hand in hand to safeguard food security."
        },
        {
            "heading": 2,
            "text": "APHA's role in the global fight against rabies"
        },
        {
            "text": "Back in September, we explored APHA’s pivotal role in the global fight against rabies. The blog marked World Rabies Day, spotlighting international partnerships, advanced diagnostics, and awareness campaigns to prevent 59,000 annual deaths. It reinforced APHA’s commitment to safe pet travel, what we can do to improve surveillance of bat rabies in the UK and rapid response to suspected cases worldwide."
        },
        {
            "heading": 2,
            "text": "BSE: From crisis to confidence - APHA's role in achieving negligible risk status "
        },
        {
            "text": "In October, we revisited APHA’s four-decade journey in tackling BSE. The blog, by Dr Timm Konold, celebrated WOAH recognition of the UK’s negligible risk status for classical BSE in June 2025. It highlighted our scientific leadership, rigorous surveillance, global trade benefits, and ongoing vigilance against both classical and atypical BSE."
        },
        {
            "heading": 2,
            "text": "Protecting the future: APHA's fight against antimicrobial resistance"
        },
        {
            "text": "We reflected on APHA’s frontline leadership in tackling antimicrobial resistance (AMR) in November. The blog marked the UK’s National Action Plan 2024–2029, showcasing APHA’s efforts in surveillance, diagnostics, farm-level biosecurity, Salmonella control, and cutting-edge research and rapid detection tools. It celebrated APHA’s global credentials as the only WOAH‑accredited AMR lab, its role within FAO’s International Reference Centre, and its support for One Health in low‑ and middle‑income countries through international partnerships."
        },
        {
            "heading": 2,
            "text": "Beyond the blog: APHA's broader achievements"
        },
        {
            "text": "2025 was also a year of significant milestones beyond the blog. APHA hosted international conferences, expanded its research collaborations, and launched new initiatives to tackle emerging threats like antimicrobial resistance and climate-related disease risks. These efforts reinforce our role as a trusted authority in animal and plant health."
        },
        {
            "heading": 2,
            "text": "Looking ahead to 2026"
        },
        {
            "text": "As we move into 2026, APHA remains committed to innovation, collaboration, and transparency. Our blog will continue to share the stories behind the science."
        },
        {
            "text": "Thank you to all our readers for joining us on this journey. Here is to another year of discovery, progress, and impact."
        }
    ]
}