{
    "url": "https://defraenvironment.blog.gov.uk/2025/12/29/walking-the-mersey-valley-way-the-first-step-towards-nine-new-national-river-walks/",
    "title": "Walking the Mersey Valley Way: the first step towards nine new National River Walks ",
    "authors": [
        "Anna Glayzer"
    ],
    "categories": [
        "Access and engagement",
        "National River Walks",
        "Water"
    ],
    "pub_date": "2025-12-29T09:28:09+00:00",
    "content": [
        {
            "text": "It’s not often, as a policy advisor in Defra, that I get to see the tangible results of the work that I do. It’s less often that I get to do so on my doorstep. So I was delighted when I was told that I would be working on delivering the Mersey Valley Way here in Manchester. "
        },
        {
            "text": "The Mersey Valley Way will be the first of nine new National River Walks, delivered to meet the Government manifesto commitment. Work began in September 2025 to transform a 21.5km stretch of riverside path from Stockport into Manchester.  "
        },
        {
            "text": "The project includes upgrading and improving 4km of existing river path to meet accessibility standards suitable for wheelchairs, mobility scooters, prams, cyclists and horse-riders, and installing signage, waymarking and branding across the full route. "
        },
        {
            "text": "In this post, I’ll share more about what we hope to achieve with improving this walking spot. "
        },
        {
            "text": "Accessing nature in the heart of Stockport "
        },
        {
            "text": "My first sight of the route was in August this year. We met our delivery partner, Mersey Rivers Trust,  and walked up to the side of the M60, where the Mersey officially, and unceremoniously starts, at the confluence of the River Tame and River Goyt.  "
        },
        {
            "text": "We followed its path back through the centre of Stockport, where it disappears from view and flows underground for a bit, before joining a riverside bridleway that will become the start of the Mersey Valley Way. We followed its path back through the centre of Stockport, where it disappears from view and flows underground for a bit, before joining a riverside bridleway that will become the start of the Mersey Valley Way. Along the route, we spotted a kingfisher, which rather nicely offset the litter. "
        },
        {
            "text": "Work on the Mersey Valley Way will improve access to nature in an area where it’s very much needed. Stockport has areas of severe deprivation, it’s estimated over 36,000 people are living in poverty.  "
        },
        {
            "text": "Evidence shows that people from lower income groups are less likely to access the benefits of spending time in nature. We also know that people are more likely to visit green and blue spaces close to where they live. By improving paths and adding features like lighting and signage, we’re making it easier for everyone to enjoy the outdoors. "
        },
        {
            "text": "One of the other reasons this part of the River Mersey was chosen is that Stockport is midway through a £1billion investment programme. The town centre has already been transformed by regeneration including a flagship new bus interchange with beautifully landscaped green areas. Work on the new national river walk will both complement and be amplified by what's happening across the borough.  "
        },
        {
            "text": "Community engagement and nature recovery "
        },
        {
            "text": "In early December, I got another opportunity to experience the project first hand when I joined a volunteer party run by City of Trees, on a rainy day in some woodland in the Trafford section of the path. We were clearing the way for some new native trees to be planted to improve the biodiversity and make habitat for willow tits.  "
        },
        {
            "text": "Community engagement is a major aspect of this project. Volunteers are contributing much of the work underway to improve access, restore nature and improve water quality. Highlights include habitat restoration and enhancement, pond restoration and invasive species removal, tree planting and bulb planting.  4,000 bulbs have already been planted in Stockport town centre, and work has begun to install bird, bat and insect boxes, a sand martin wall and a swift tower.  "
        },
        {
            "text": "Mersey Rivers Trust are working with local community representatives to offer pilot guided walks, and a logo design competition has been launched for over 50 local schools and youth groups, who are also being invited to engage with the path. "
        },
        {
            "text": "Increasing access to the Mersey Valley Way  "
        },
        {
            "text": "One of the most exciting things about the Mersey Valley Way is how many different people will use it.  "
        },
        {
            "text": "For some, it will be a commuting route, offering a greener way to travel between Stockport and Manchester.  "
        },
        {
            "text": "Others will come for leisure walks, fitness runs, or simply to enjoy the wellbeing benefits of being outdoors. Families with buggies, people using wheelchairs, and those who love cycling will all find the path safe and accessible where previously, in places, it wasn’t. "
        },
        {
            "text": "Looking ahead "
        },
        {
            "text": "Work on the Mersey Valley Way will complete in the Spring. "
        },
        {
            "text": "Next year, we’re also aiming to launch a competition to choose the locations for the next tranche of national river walks. Improving access to nature, community engagement and nature recovery will be at the heart of each. "
        },
        {
            "text": "I am looking forward to enjoying walking the Mersey Valley Way with my family and already planning my next volunteer day in January, a litter pick in Stockport. "
        }
    ]
}