{
    "url": "https://defrafarming.blog.gov.uk/2023/12/13/introducing-the-smaller-abattoir-fund/",
    "title": "Introducing the Smaller Abattoir Fund",
    "authors": [
        "The Team"
    ],
    "categories": [
        "Farmers"
    ],
    "pub_date": "2023-12-13T12:25:43+00:00",
    "content": [
        {
            "text": "For the first time, smaller abattoirs in England will be able to apply for capital grants through a new £4 million fund designed to boost the sector. "
        },
        {
            "text": "Smaller abattoirs are really important. They’re vital to farmers getting their products to market. Smaller abattoirs are an important part of rural economies. They offer a higher value route to market for native and rare breeds, particularly horned animals which many large abattoirs are generally unable or unwilling to process. "
        },
        {
            "text": "They also support higher standards of animal welfare by helping to maintain reduced journey times to slaughter, ensuring that animals do not need to be transported over longer distances, which can create welfare issues, as well as taking up farmers’ limited time. "
        },
        {
            "text": "Unfortunately, as a result of rising operating costs including the cost of disposal of animal by-products (amongst other reasons), there has been a large decline in the number of operational smaller abattoirs in recent years. Over the last four years (2018-22) smaller red meat abattoirs have declined by around 25% and smaller poultry abattoirs have declined by around 40%. "
        },
        {
            "text": "The UK has a world-leading record on animal welfare as demonstrated by being the highest ranked G7 nation in the World Animal Protection’s Index. Government is committed to maintaining our high animal welfare standards, as to ensure that our livestock are healthy and that we avoid any unnecessary suffering to an animal.  "
        },
        {
            "text": "Smaller abattoirs help support the principle that, when animals are transported, the length of the journey should be minimised wherever possible. "
        },
        {
            "text": "Smaller abattoirs also play an important role in providing private kill services to farmers wishing to retail and market their own produce and provide local products to local butchers and farm shops. This service is not routinely provided by larger abattoirs as it is usually not cost-effective or practical if distances to the point of slaughter are too great.   "
        },
        {
            "heading": 2,
            "text": "Supporting smaller abattoirs in England  "
        },
        {
            "text": "Smaller abattoirs find it very difficult to identify investment opportunities as they often operate with very small profit margins. This makes securing loans or finding funds for inward investment difficult. "
        },
        {
            "text": "Rising costs amongst other issues, have led to a continued decline in smaller poultry and red meat abattoirs too, so by offering financial support in the form of capital investment grants, smaller abattoirs will be better able to expand and enhance their operational capacity, in turn opening new markets."
        },
        {
            "heading": 2,
            "text": "The Smaller Abattoir Fund offer "
        },
        {
            "text": "Through the Smaller Abattoir Fund, grants of between £2,000 and £60,000 are available at an 40% intervention rate. The items the grant supports have been selected to: "
        },
        {
            "text": "The 40% intervention rate means an abattoir applying for an eligible item costing £10,000 would receive £4,000 in capital grant funding and would therefore need to make up the other £6,000. "
        },
        {
            "text": "We are aware eligible abattoirs may have hard-to-predict cash flows so applicants will be able to make up to 3 applications to a total of £60,000 to make the most out of the fund. "
        },
        {
            "text": "We know that each abattoir has different specialisms, requirements and challenges and so we will consider additional investments that aren’t on the list of items. Applicants will be asked to provide evidence that the investment aligns with at least one of the fund’s aims, objectives, and eligibility criteria. "
        },
        {
            "text": "Colleagues at the Rural Payments Agency (RPA) will contact eligible applicants in the coming days with the official guidance and application forms. They’ll also share details of webinars to learn more directly in the new year.  "
        },
        {
            "text": "The deadline to apply is 30 September 2024.  "
        },
        {
            "text": "If you have any questions about applications or the Smaller Abattoir Fund, email FTF@rpa.gov.uk or call 03000 200 301 and select the ‘Smaller Abattoir Fund’ option. "
        }
    ]
}