{
    "url": "https://moderncivilservice.blog.gov.uk/2023/12/13/meet-the-modern-civil-service-ravi-chand/",
    "title": "Meet the Modern Civil Service: Ravi Chand",
    "authors": [
        "Government Reform"
    ],
    "categories": [
        "A Modern Civil Service",
        "Government Reform",
        "Innovation",
        "Interview",
        "Proud Civil Servant",
        "Skilled Civil Service"
    ],
    "pub_date": "2023-12-13T15:09:27+00:00",
    "content": [
        {
            "text": "Hello! Welcome to the second interview in the Meet the Modern Civil Service series. The aim of this series is to showcase the people in the civil service who are innovating change, whether that be through being a learning champion, embracing digital and data into their daily working or helping develop new hubs across the UK."
        },
        {
            "text": "Deepa Thomas-Sutcliffe from the Modernisation and Reform Unit spoke with Ravi Chand, Director of Places for Growth, about what A Modern Civil Service means to him, as well as his examples of reform in action and how all civil servants will benefit from these positive changes."
        },
        {
            "heading": 3,
            "text": "What does A Modern Civil Service mean to you?"
        },
        {
            "text": "A Modern Civil Service is an organisation that employs the full diversity of types of roles needed to administer and deliver great public services. Ravi believes it is one that draws skills from all sections of society, has a presence in every corner of the United Kingdom and is recognised by the public locally for its work. Whether it be a particular department or as a Civil Service as a whole, A Modern Civil Service is one that delivers great services and understands local needs."
        },
        {
            "heading": 3,
            "text": "Places for Growth: an introduction"
        },
        {
            "text": "The Places for Growth Portfolio is an overarching programme in the Cabinet Office, working with all Government departments and arm's length bodies to enable them to relocate roles around the UK, to suit the needs of the business on a more local scale. People who may wish to relocate to different parts of the UK, particularly at a senior level, will be able to do so, helping to grow a strong civil service presence in these places."
        },
        {
            "text": "The current aim is to relocate 22,000 roles and 50% of all UK based Senior Civil Service (SCS) outside of London and Ravi is at the heart of that mission. Places for Growth wants to identify and relocate the right type of quality roles and attract a high calibre of individuals, both externally and throughout the existing Civil Service. Ravi also believes this will be particularly effective in policy roles and operational delivery roles — location shouldn’t be a barrier at any grade."
        },
        {
            "text": "Working with communities to help create a skilled and modern civil service is also a key part of the Places for Growth strategy, as it can be difficult to attract the right talent in some areas. Ravi adds: “We have a strong and vibrant Civil Service presence, one that has within its makeup clear plans of how they engage academia, further education, local communities, local authorities and other delivery partners, and work with them collectively to really feel like we are contributing to place in these areas and as a part of a wider set of partners that operate in these areas.”"
        },
        {
            "text": "So there you have it! Check out the Places for Growth page for more information."
        },
        {
            "heading": 3,
            "text": "Vibrant teams in new locations"
        },
        {
            "text": "If you go to Manchester, Birmingham or to Cardiff, you’ll find strong, vibrant teams of all grades present in these places, co-located in modern buildings. Working with the Government Property Agency, who are supporting and enabling the government hubs that have been developed in these areas, we're able to see departments operate from the same buildings and work collaboratively in a way that we haven’t been able to do before. "
        },
        {
            "text": "“I think all the big cities where we've got a presence, whether it be Cardiff, Glasgow, Birmingham, Manchester, we've seen a really good coming together of a stronger leadership team.” Ravi says when speaking about the recent increase in distributed senior leadership. "
        },
        {
            "text": "One example is Darlington, where the Treasury has relocated along with other departments. Historically, the Treasury has predominantly had a London presence with a small presence in Norwich for a payroll function."
        },
        {
            "text": "After moving to Darlington, they attracted economic policy skills from across the Government. This led to other departments, who have economic policy skills and professionals, relocating there. The change was supported and driven by senior colleagues, some of them who physically relocated there, to demonstrate the effectiveness of moving senior and non-senior roles out of London to a new hub area. If it can be done with the Treasury, it can be done by any department!"
        },
        {
            "heading": 3,
            "text": "An opportunity to upskill and reskill in roles around the country"
        },
        {
            "text": "One of the main focuses at Places for Growth is creating a stronger civil service presence in hubs and offices around the country, with good career pathways from entry level roles  all the way up to senior civil service. "
        },
        {
            "text": "The focus has been to tackle the issue that people felt they would have to move to London in order for them to progress their career to more senior levels, otherwise they would lose access to a range of jobs that would allow them to progress upward or laterally to a similar role in a different department. "
        },
        {
            "text": "What we're now seeing is that by putting jobs that currently sit in London — senior roles in areas such as policy making or roles in professions that have a higher volume of senior decision makers — into these new hubs, individuals can access career opportunities around the UK in a way they hadn't been able to before."
        },
        {
            "text": "Ravi has travelled extensively throughout the country, visiting new hubs and office collaborations alongside his Civil Service Live engagements. During his travels he often heard from colleagues about how this wider spread of opportunities has unlocked career opportunities for them, allowing them to further develop their skills, or that by seeking out new opportunities outside of London. They felt it was worthwhile developing their skill set for senior grades because those opportunities now exist in a way they didn't before."
        },
        {
            "text": "There’s a real sense of opportunity for growth from Ravi, as he and his team working with departments present an opportunity for progression, an opportunity to upskill, and reskill in roles in a way that they probably wouldn't have been thought about before."
        },
        {
            "heading": 3,
            "text": "Creating a strong Civil Service presence in communities"
        },
        {
            "text": "Modernisation and reform — specifically around places for growth and expansion of hubs and offices around the UK — allows colleagues to show pride in being a part of the Civil Service connected to their communities. Some colleagues engage in community outreach or run events in communities that support a cross section of society. It’s about showing that a modern civil servant does things with the community, not to the community, which is important for attracting new talent and earning the trust of citizens. "
        },
        {
            "text": "Informing the public about what the Civil Service does — from operational delivery roles in job centres to senior roles in hubs across the UK — is essential when trying to recruit the right talent. It’s not always obvious what kinds of skills and experience the Civil Service is looking for, however many aren’t aware of the graduate or apprenticeship schemes on offer to recruit new civil servants. "
        },
        {
            "text": "On the subject, Ravi said: “The first thing is, the public don't always know about the range of jobs we offer.” When speaking about the range and breadth of roles available in the civil service, he highlights everything from cyber security and IT roles to government and economic policy, HR, finance and more: “We've got all sorts of jobs in the Civil Service service.” Attending university and school job fairs is only some of the community outreach civil servants take part in."
        },
        {
            "heading": 3,
            "text": "Thematic hubs and campuses"
        },
        {
            "text": "There are various government hubs scattered across the UK, with many being dubbed Thematic Campuses. This includes the Darlington Economics Campus, which has been a huge success for the Treasury, and the Policy Campus in Sheffield, which we featured on A Modern Civil Service blog. As a Policy Campus, cross-department policy professionals can collaborate together to share innovative ideas and discover new career opportunities. Joining a professions network is a digital means to discover new skills and roles relevant to your current skill set, allowing colleagues to further their careers."
        },
        {
            "text": "There’s also a hub in Leeds which has a strong affiliation with NHS England and UK Health Security Agency, as well as a Department of Health and Social Care presence. Manchester, Preston, and Samlesbury remain very cyber, security, digital and data focused, with a  strong presence in science, technology engineering and maths. Many people join the graduate scheme from the local universities in Manchester, while Belfast and Cardiff have a strong cyber security focus  and are fast becoming popular hubs. Glasgow has a more international theme, focusing on the Foreign Commonwealth and Development Office and  the new Cabinet Office Hub, shared with HMRC staff. "
        },
        {
            "text": "When speaking about hubs, Ravi stated that he thinks they will become professional specialism locations over time. There will still be a wide range of jobs on offer outside of senior specialist roles: “when we're thinking about when we have functions and professions or particular specialist bits of government, where would you put them?”"
        },
        {
            "heading": 3,
            "text": "Looking forward to 2024"
        },
        {
            "text": "Ravi and his team at Places for Growth will be focusing on the relocations they’ve committed to and increasing the number of senior roles in hubs and offices outside of London. There will also be a strong focus on thematic hub and campus development, so that individuals with particular skill sets can see where in the UK their talents would be most useful. The core concept is working towards building sustainable future careers for civil servants, whether that’s for potential recruits or existing staff. "
        },
        {
            "text": "He acknowledges the challenges ahead: “What I've learned from this experience is it takes a lot to build confidence in your senior colleagues in Whitehall and your ministers to genuinely believe a role can be done at the most senior levels in a different part of the UK with occasional travel into London, because the bulk of that can be done like this on a video call.” While the Civil Service is returning to a blended working approach of home and office working, new campaigns like the Future Leaders Scheme have the potential to attract a more diverse workforce that might not have otherwise considered a senior civil service role."
        }
    ]
}