{
    "url": "https://defrafarming.blog.gov.uk/2023/12/13/next-round-of-large-rd-partnerships-competition-on-the-way/",
    "title": "Next round of Large R&D Partnerships competition on the way",
    "authors": [
        "Joss Wallace"
    ],
    "categories": [
        "Things we're doing"
    ],
    "pub_date": "2023-12-13T10:41:30+00:00",
    "content": [
        {
            "text": "On 15 January, we’ll open another round of the Large R&D Partnerships competition. "
        },
        {
            "text": "Part of the Farming Innovation Programme, this competition offers a share of £7.8 million to farmers, growers and foresters in England to take forward ideas that improve productivity, sustainability, resilience and move the sector towards net zero. "
        },
        {
            "text": "Together with our delivery partners Innovate UK, part of UK Research and Innovation (UKRI), we published the competition guidance today. "
        },
        {
            "text": "In this post, I’ll give you a summary of the competition, explain how you can find out more and share examples of successful projects in the previous rounds. "
        },
        {
            "heading": 2,
            "text": "An overview of competition "
        },
        {
            "text": "The Large R&D Partnerships competition funds industrial research and experimental development projects: from those that will accelerate the development and demonstration of new agricultural solutions, to those that can be integrated into existing agricultural practices.  "
        },
        {
            "text": "These should help address major challenges and opportunities on-farm, or those immediately post farmgate.  "
        },
        {
            "text": "Your project should address a significant industry challenge or opportunity in at least one of the industry subsectors below:     "
        },
        {
            "text": "Your solutions or project outputs should also significantly improve: "
        },
        {
            "text": "We encourage businesses to come together as a partnership to solve these major challenges or opportunities. "
        },
        {
            "text": "Projects will last up to 4 years and be valued between £3 million and £5 million. Businesses will be expected to contribute funding to the projects.  "
        },
        {
            "text": "We want to fund a wide portfolio of projects, across a variety of technologies, industry sectors, and business sizes. "
        },
        {
            "text": "Projects should have a significant focus on demonstration and enable the commercialisation and adoption of new solutions by sharing knowledge and ideas. "
        },
        {
            "text": "Successful projects from previous rounds include innovations in low tillage methods to protect soil health and minimise emissions in the cultivation of potatoes to fruit tree management in orchards using precision tools and methodology. "
        },
        {
            "text": "The competition guidance provides full information on how to apply, scope and eligibility. "
        },
        {
            "heading": 2,
            "text": "Dates to note  "
        },
        {
            "text": "You’ll see that, as with previous competitions, Innovate UK KTN will run a webinar briefing and consortia building event. We hope to see you there.  "
        },
        {
            "text": "For any queries on how to apply, email Innovate UK at support@iuk.ukri.org    "
        },
        {
            "text": "Subscribe to the Farming blog for updates from the team and details of funding opportunities ahead.  "
        },
        {
            "heading": 2,
            "text": "Watch"
        },
        {
            "text": "Last month the Secretary of State, Steve Barclay, visited Muddy Machines who were successful applicants in the Farming Innovation Pathways competition as well as the Farming Innovation Programme."
        },
        {
            "text": "Watch the video below to learn how Defra investment has supported Muddy Machines to create new technology that will help take the industry towards net zero."
        }
    ]
}