{
    "url": "https://ukhodigital.blog.gov.uk/2023/12/13/safe-efficient-and-trusted-digital-navigation-for-mariners/",
    "title": "Safe, efficient, and trusted digital navigation for mariners",
    "authors": [
        "Steve Bastable"
    ],
    "categories": [
        "Navigation"
    ],
    "pub_date": "2023-12-13T13:09:32+00:00",
    "content": [
        {
            "text": "The UK Hydrographic Office (UKHO) has recently begun working with international partners on a compliant digital solution for mariners requiring non-ECDIS (Electronic Chart Display and information System) navigation. These mariners, who rely on electronic and paper charts for navigation, represent a diverse range of vessel types, users and navigation requirements, in the UK and around the globe."
        },
        {
            "text": "The UKHO’s public task is to ensure safety of life at sea through the provision of trusted, official ADMIRALTY navigation solutions that support the safety of mariners worldwide. To maximise the safety of navigation in national and international waters, we along with other organisations in the hydrographic community, believe that official hydrographic data should be widely available on digital displays."
        },
        {
            "heading": 2,
            "text": "Working together to provide a compliant digital solution"
        },
        {
            "text": "In May, along with our international partners and fellow hydrographic offices, we participated in the International Hydrographic Organization (IHO) Assembly event in Monaco. Here we discussed the international challenge of the absence of a suitable compliant Electronic Chart System (ECS) solution to be used by mariners in place of or alongside paper chart navigation."
        },
        {
            "text": "Digital solutions offer significant positional, safety and operational advantages to mariners, including the potential for near real-time updates, which greatly improve the accuracy of navigation and ease of use. These benefits will be further enhanced through the next generation of navigation solutions, underpinned by the new S-100 data standards."
        },
        {
            "text": "We are delighted, that since the discussions at the IHO Assembly, the UKHO has become the chair of the IHO Electronic Chart System (ECS) Project Team.  The ECS Project Team has been established under the IHO ENC Standards Maintenance Working Group to research and make recommendations on standards for the use of official data for vessels relying on paper or ECS for navigation (vessels not using ECDIS)."
        },
        {
            "text": "The UKHO is proud to be contributing to this initiative. We understand that there is a diverse and varied community of users who rely on our electronic and paper charts, from those in voyage planning and shore-based operations, to those who sail a variety of vessels on many routes. The final stage in the delivery of such a solution would fall to equipment manufacturers, before this can happen, it is necessary to set out the technical and regulatory standards that would underpin such a solution."
        },
        {
            "heading": 2,
            "text": "Electronic Chart System (ECS)"
        },
        {
            "text": "As we have already explored with our working group partners, the diverse range of potential ECS users represents a higher number of mariners than those who use ECDIS solutions. This shows how important it is for the hydrographic community to develop the right solution, ensuring safe, efficient, and trusted navigation for all mariners around the world."
        },
        {
            "text": "‘ECS’ are three letters you will hear more often from us in the months and years ahead, and we are looking forward to playing our part in this international effort to support this alternative digital solution for non-ECDIS vessels. As a next step, the ECS Project Team will develop a set of recommendations that can then be taken out to the wider IHO membership and external organisations."
        },
        {
            "text": "Learn more about the work we are doing as part of the ECS Project Team, and the latest update on our plans for the continuation of providing paper charts, on our ADMIRALTY website."
        }
    ]
}