{
    "url": "https://stratcommand.blog.gov.uk/2023/12/13/we-are-strategic-command-with-brigadier-richard-carter/",
    "title": "We Are Strategic Command with Brigadier Richard Carter",
    "authors": [
        "bobsendall"
    ],
    "categories": [
        "Uncategorized"
    ],
    "pub_date": "2023-12-13T10:00:05+00:00",
    "content": [
        {
            "text": "Brigadier Richard Carter talks about the indispensable role of Defence Digital in enabling communication and operations across Defence."
        },
        {
            "text": "Interviewer: How does Defence Digital support operations across Defence?"
        },
        {
            "text": "Brigadier Carter: Without Defence Digital, communication across Defence, including emails and command and control operations involving 230,000 users, would be severely impacted. Defence Digital is the backbone that enables us to communicate effectively."
        },
        {
            "text": "Interviewer: What is your role within Defence Digital?"
        },
        {
            "text": "Brigadier Carter: I'm Brigadier Rich Carter, serving as Assistant Chief of Staff J3 in Defence Digital Operations and also holding the position of Cyber Security Officer. My responsibilities involve assessing cyber and information risks across the organisation, as well as overseeing procurement, management, defence, and policy provision for the digital enterprise in Defence."
        },
        {
            "text": "Interviewer: How would you describe Strategic Command?"
        },
        {
            "text": "Brigadier Carter: Strategic Command serves as the unifying force, bringing together the diverse efforts from across Defence Digital. Having worked in Strategic Command, and previously what was known as Joint Force Command, I can say that the focus extends across domains, offering a broader perspective than you might find in working within one of the forces. It also offers the opportunity to collaborate with individuals from a variety of different roles and diverse backgrounds."
        },
        {
            "text": "Interviewer:  In your opinion what’s the biggest reward of working at Strategic Command?"
        },
        {
            "text": "Brigadier Carter: The operational focus at Strategic Command is a constant and provides a sense of being on operations 24/7. The emphasis on current operations and planning for future campaigns offers a professional reward that is unparalleled. It creates a real proactive environment and contributes to a continuous sense of readiness."
        }
    ]
}