{
    "url": "https://environmentagency.blog.gov.uk/2023/12/13/working-with-hmrc-to-shut-down-illegal-waste-exports/",
    "title": "Working with HMRC to shut down illegal waste exports",
    "authors": [
        "Environment Agency"
    ],
    "categories": [
        "Environment Agency",
        "Waste"
    ],
    "pub_date": "2023-12-13T10:02:23+00:00",
    "content": [
        {
            "text": "There are many types of waste crimes committed by those who think there is a quick buck to be made from illegally handling waste. One of those crime types is the illegal export of waste from our shores to places not accepting those waste types or not able to safely deal with them."
        },
        {
            "text": "Stopping the waste leaving in the first place is the best solution, which means knowing which shipping containers to stop and inspect. We analyse shipping industry data to help us better target and shut down criminals who are sending waste abroad illegally. We work in this upstream way to prevent crime and the harm it causes before it happens, rather than after it has occurred."
        },
        {
            "text": "We are always looking for ways to improve and enhance our ability to shut waste criminals out of the waste management industry, working with partner organisations to see how closer collaboration can benefit both sides in the fight against criminals."
        },
        {
            "text": "A recent addition to our toolbox is customs export data shared regularly with us from our partner HMRC to help identify illegal waste exports. This data helps to give us a much better picture of what is being exported where and by who to increase our intelligence picture and help identify and target criminality."
        },
        {
            "text": "Our intelligence-led approach means we have more information to focus on the worst criminals and the biggest environmental harms and threats across the country. This new sharing agreement with HMRC will enable efficient deployment of our resources through increased understanding of export routes and patterns so we can send our field officers out to intercept illegal shipments before they leave the country."
        },
        {
            "text": "Criminals have been caught trying to misdescribe waste material as non-waste material to avoid the regulations that protect the environment. Accessing HMRC’s customs export data means that exports made by waste operators without the required controls are easier for us to identify and stop."
        },
        {
            "text": "HMRC require customs declarations to be made when materials cross borders. This information complements the data we already use to prevent over 18,000 tonnes of waste being illegally exported every year."
        },
        {
            "text": "Illegally exported waste can result in significant environmental damage and harm to human health in the destination countries and leads to lost income for legitimate waste operators. Waste crime costs the economy over £1billion every year."
        },
        {
            "text": "If you have any information on illegal waste exports, you can call Crimestoppers 100% anonymous Always. 0800 555 111."
        }
    ]
}