{
    "url": "https://mhclgdigital.blog.gov.uk/2025/04/09/digital-planning-learning-about-resilience-cohesion-and-trust-at-the-25th-belgo-british-conference/",
    "title": "Digital Planning: Learning about resilience, cohesion and trust at the 25th Belgo-British Conference ",
    "authors": [
        "Lou Welham, Joint Head of PropTech, Digital Planning"
    ],
    "categories": [
        "Digital Planning",
        "PropTech"
    ],
    "pub_date": "2025-04-09T09:20:33+01:00",
    "content": [
        {
            "text": "Recently I had the privilege of attending the 25th annual Belgo-British Conference, in Brussels, alongside Milan Bogunovic, our Digital Planning Programme Director.  "
        },
        {
            "text": "This year’s theme, ‘Belgium and the United Kingdom: Resilient partners in a changing world’, covered key sectors of both of our societies.  "
        },
        {
            "text": "We were invited by the Foreign, Commonwealth and Development Office to join a panel discussion on ‘Bridging Generational and Societal Divides’. This was an opportunity for us to share our learnings on building citizen trust, community cohesion and bridging intergenerational divides, which we have been testing and pushing the boundaries on for over 3 years, through the innovative pilots in our PropTech Innovation Fund. Milan sat on the panel chaired by Michelle Haas, from the Egmont Institute, alongside the following esteemed panellists: "
        },
        {
            "heading": 2,
            "text": "The important role of trust and resilience "
        },
        {
            "text": "This long-standing event is a key fixture in the calendar for those involved in and interested in the relationship between Belgium and the UK. The conference and our panel discussion had a clear central theme that directly resonates with our work in PropTech (property technology) and the Digital Planning programme: the crucial role citizen engagement and trust plays, and the importance of building technological capability for a resilient future. "
        },
        {
            "heading": 2,
            "text": "Cross-border insights "
        },
        {
            "text": "The conference brought together national experts, policymakers, researchers and thought leaders from both nations to discuss the pressing challenges and opportunities facing both our societies. Discussions ranged from the intricacies of post-Brexit trade implications to the ever-evolving landscape of digital security, and the need to build resilient communities in the face of global uncertainty.  "
        },
        {
            "text": "However, what quickly became clear is that although these topics reach far beyond the world of Digital Planning, the solutions to these challenges are closely linked to our work using innovation as a catalyst to build strong, resilient and inclusive systems and communities. "
        },
        {
            "heading": 2,
            "text": "Key takeaways and highlights "
        },
        {
            "text": "Our time at the Belgo-British Conference revealed several impactful insights which will inform our approach to PropTech and Digital Planning."
        },
        {
            "heading": 3,
            "text": "The importance of inclusive policy-making "
        },
        {
            "text": "A powerful message which resonated with us was around the risks associated with developing policies in isolation. We were reminded of the potential consequences of neglecting to engage with the communities or markets who are likely to be most impacted by our decisions. This emphasised the critical need for early public involvement and for our work across government to be genuinely responsive to the diverse needs of our users. "
        },
        {
            "text": "This might mean we have to shift towards greater transparency and bravery in putting our work out into the wild. Where possible, we should be presenting our work for open discussion at the earliest stages, prioritising engagement from the outset to foster a sense of shared ownership. "
        },
        {
            "heading": 3,
            "text": "The power of university partnerships"
        },
        {
            "text": "The conference reminded us of the immense value of universities as a unique resource for research excellence and technological innovation capability. Building strong partnerships with these institutions is crucial for driving forward the transformative system changes we are looking for. We’ve seen this reap huge benefits through the PropTech Innovation Fund, where various universities have partnered with Local Planning Authorities to pilot and deliver solutions.  "
        },
        {
            "heading": 3,
            "text": "Shifting the risk mindset "
        },
        {
            "text": "A key discussion point was the need to move away from a risk-averse approach to innovation, where the main arguments ‘not’ to do something are built around the risks of doing it. Instead, we should focus on the cost of inaction, and what the risks are of ‘not’ doing that thing! "
        },
        {
            "text": "This is particularly relevant in emerging areas like artificial intelligence (AI), where we should be aiming to develop a language to articulate these opportunity costs of underinvestment or inaction in these areas, and for us where the adoption of such technology could fundamentally improve planning processes. "
        },
        {
            "heading": 3,
            "text": "Engagement as a form of debate"
        },
        {
            "text": "One of the most thought-provoking comments which one of the panellists made, focused on how true citizen engagement goes beyond merely informing or educating people. Genuine engagement requires empowering individuals, especially younger generations, with the necessary skills, information and trust necessary for them to participate meaningfully in any critical debate and decision-making. This perspective is particularly important in areas like planning where the temptation for those engaging is to simply try and ‘win people over’ as quickly as possible rather than have a proper dialogue and work on a solution together. "
        },
        {
            "heading": 2,
            "text": "Our final reflections "
        },
        {
            "text": "Participating in the Belgo-British Conference made us realise that the challenges our societies are facing are not just political, technical or economic, but also fundamentally human. Building trust, fostering inclusivity, and empowering citizens are essential components of any successful local, regional or national strategy for resilience.  "
        },
        {
            "text": "The 25th Belgo-British Conference provided a valuable platform for dialogue and reflection. We look forward to seeing how these discussions translate into collaboration and action in the coming months and hope to see the conference continue in full force for 2026. "
        },
        {
            "text": "  "
        }
    ]
}