{
    "url": "https://nationalscreening.blog.gov.uk/2025/04/09/experts-agree-how-to-manage-incidental-findings-in-lung-cancer-screening/",
    "title": "Experts agree how to manage incidental findings in lung cancer screening",
    "authors": [
        "David Baldwin"
    ],
    "categories": [
        "Lung cancer screening"
    ],
    "pub_date": "2025-04-09T09:10:26+01:00",
    "content": [
        {
            "heading": 4,
            "text": "By Prof David Baldwin, Chair of the UK Clinical Expert Group for Lung Cancer and Mesothelioma, NHS England lead clinician for lung cancer and adviser to the UKNSC"
        },
        {
            "text": "Nearly all screening programmes and tests have the potential to detect incidental findings (IFs)."
        },
        {
            "text": "These are findings other than the primary condition being screened for and can range from potentially very serious to clinically insignificant."
        },
        {
            "text": "All screening can do harm as well as good. Potential harms, including false positive results, false negative results, overdiagnosis and overtreatment, also apply to IFs detected by screening. The detection of some IFs might lead to needless or harmful treatment. Others might be benign, clinically insignificant or not have associated interventions that can help, so their disclosure might cause unnecessary anxiety."
        },
        {
            "text": "It is therefore essential that national screening programmes have clear and consistent guidance on how IFs are managed, reported and communicated. This helps prevent referrals of clinically insignificant findings and optimise the follow-up of findings when interventions could be hugely beneficial. Screening programmes are also very expensive, so management of IFs should be cost-effective, where possible."
        },
        {
            "text": "The national NHS Lung Cancer Screening Programme is being rolled out following the recommendation from the UK National Screening Committee (UK NSC) and the Westminster government announcement in June 2023."
        },
        {
            "text": "The main purpose of lung cancer screening is to find lung cancer, not other conditions. However, the low dose thoracic computed tomography (CT) scan used in lung cancer screening can detect a large number and variety of IFs. Identifying many of these, for example findings linked to smoking-related conditions, can greatly improve a person’s health. But some IFs can do more harm than good if we communicate them to patients."
        },
        {
            "text": "Given how common IFs are in lung cancer screening, it is therefore important we provide health professionals with clear consistent guidance about which findings to communicate to patients and what follow-up actions to take."
        },
        {
            "heading": 2,
            "text": "National protocol published"
        },
        {
            "text": "We have developed new national incidental findings protocol that take a very detailed approach to managing IFs."
        },
        {
            "text": "The new protocol has been developed by the clinical advisory group that advises the national screening programme. It explains the potential significance of each finding, how and when it should be reported and what action the screening programme should take in each case. This can range from no action at all – for example, in the case of a finding of bronchial wall thickening – to an urgent referral for surgery if a large abdominal aortic aneurysm is detected."
        },
        {
            "text": "The protocol has been published as an annex to the programme’s new quality assurance standards. It aims to strike the right balance between identifying potentially important health issues and avoiding unnecessary anxiety or medical interventions for IFs that are unlikely to be clinically significant."
        },
        {
            "heading": 2,
            "text": "Important principles"
        },
        {
            "text": "The protocol is underpinned by a systematic review of the evidence and a careful evaluation of the potential benefits and harms."
        },
        {
            "text": "It states that only clinically significant findings should be reported to GPs or participants and that people should receive clear information about IFs when they are invited for lung cancer screening. This information should help people make an informed decision about whether to participate and should clearly explain:"
        },
        {
            "text": "The protocol divides IFs into 4 categories:"
        },
        {
            "text": "The protocol includes standardised pathways for specific IFs. Most actionable findings should be managed within secondary care via a screening review multidisciplinary team, while there is an alternative option for primary care to take the lead on some findings."
        },
        {
            "text": "The pathways include advice about how to communicate IFs and who is responsible for actioning that communication. The most serious and urgent should be communicated directly to secondary care, while many common findings can be communicated simply by a standard letter to the GP."
        },
        {
            "text": "We encourage all local screening providers to develop these agreed pathways by working closely with primary and secondary care."
        },
        {
            "heading": 2,
            "text": "Keep up to date"
        },
        {
            "text": "The UK NSC blog provides up to date news from the UK National Screening Committee. You can register to receive updates direct to your inbox, so there’s no need to keep checking for new articles. If you have any questions about this blog article, or about the work of the UK NSC, email uknsc@dhsc.gov.uk."
        }
    ]
}