{
    "url": "https://cspl.blog.gov.uk/2025/04/09/ipsa-and-the-nolan-principles/",
    "title": "IPSA and the Nolan Principles",
    "authors": [
        "Richard Lloyd OBE"
    ],
    "categories": [
        "30th Anniversary",
        "Ethical standards",
        "MPs",
        "Nolan Principles"
    ],
    "pub_date": "2025-04-09T15:48:41+01:00",
    "content": [
        {
            "text": "To mark the 30th anniversary of the Nolan Principles, the Committee will be publishing a new series of blogs about the work of a range of standards bodies in England. Our fourth blog is from Richard Lloyd OBE, Chair of the Independent Parliamentary Standards Authority (IPSA)."
        },
        {
            "text": "Since 1911, MPs’ parliamentary work has been supported by public funding. This has long been considered an important part of our representative democracy because it enables ordinary people without private wealth to become an MP. "
        },
        {
            "text": "The Independent Parliamentary Standards Authority (known as ‘IPSA’) was created in 2009 to set and enforce the rules for how this public money is used. The first sentence of the first IPSA scheme of rules, published 15 years ago this month, was very clear: they began by adopting the Nolan principles. "
        },
        {
            "text": "The principles have been at the heart of IPSA’s work ever since. In our latest, eighteenth, edition of the scheme the principles are described as ‘fundamental’ to our requirements for MPs. "
        },
        {
            "text": "And, in our experience, they have worked: since I became its Chair, IPSA has reported the highest levels of compliance by MPs and their staff with our requirements. Very few indeed have tried to knowingly break the rules."
        },
        {
            "text": "Despite this evidence of strong compliance, both from IPSA and my close colleague the Parliamentary Commissioner for Standards, it is a deeply worrying fact that the public remain sceptical about the probity of politicians. "
        },
        {
            "text": "And in the present-day context of news from around the world suggesting democracy itself is coming under attack, it is critical that everyone in our parliament demonstrates their commitment to the highest of standards."
        },
        {
            "text": "We need MPs and their staff to do the right thing not solely because we prescribe in detail what is allowed; we need them to do so because it is simply the cultural norm in every part of public life. "
        },
        {
            "text": "The consistently high levels of compliance with our rules are one of the reasons why IPSA is planning, over the course of this parliament, to move towards a more flexible, principles-based approach in overseeing the use of our funding."
        },
        {
            "text": "The Nolan principles will remain as the frame for the more specific codes of behaviour that are expected by IPSA. Within the overarching principles of integrity and accountability MPs must be able to show they are using public funds exclusively for parliamentary purposes, that there are creating no real or perceived conflicts of interest and that they are getting value for money."
        },
        {
            "text": "Within those guardrails our aim is to enable MPs to make more of their own judgements about how to run their finances in support of their parliamentary work. We want to move away from a one-size-fits-all, box-ticking approach to regulation and instead to focus on the outcomes we seek."
        },
        {
            "text": "That does not mean that IPSA will stop its day-to-day job of carefully and transparently scrutinising MPs’ spending. But it will mean that we focus our attention proportionately on areas of higher risk or of public concern, increasing our assistance for MPs where it is needed, and in doing so reduce the administrative burden for those that have well-run and compliant offices."
        },
        {
            "text": "Our purpose is to ensure that MPs spend as much time as possible doing what really matters, whether as legislators in the House of Commons, holding the government to account, or directly helping constituents through casework. That is the best way to rebuild trust in our precious democracy."
        },
        {
            "text": "The first Committee on Standards in Public Life is to be congratulated on drafting such long-lasting principles that remain live and relevant today. IPSA looks forward to working closely with today’s Committee as we modernise and step up our efforts to support a healthy and ethical parliament. "
        }
    ]
}