{
    "url": "https://marinedevelopments.blog.gov.uk/2025/04/09/launch-of-issues-with-supporting-evidence-final-report/",
    "title": "Launch of ‘Issues with Supporting Evidence’ Final Report",
    "authors": [
        "Lucy Jackson, Marine Planner"
    ],
    "categories": [
        "marine planning"
    ],
    "pub_date": "2025-04-09T10:49:20+01:00",
    "content": [
        {
            "text": "The Marine Planning Team have published the ‘Issues with Supporting Evidence’ final report, concluding the next step in the preparation of England’s East Marine Plans."
        },
        {
            "text": "What does the report say?"
        },
        {
            "text": "The report details stakeholder insights on the opportunities, challenges and needs for the east marine plan areas over the next 20 years. 2,220 issues and 1,596 evidence items were presented over the course of the ‘Issues with Supporting Evidence’ engagement period. The report synthesises this data into key themes, priority issues, and key evidence gaps, and explains how the information provided by stakeholders will feed into the next stages of plan development."
        },
        {
            "text": "Stakeholders were given the opportunity to have their say on issues in the east marine plan areas through three in-person events in Norwich, Peterborough and Hull and three online events. The events took place in the period from 6th of November until 5th of December 2024. Stakeholders were also given the opportunity to provide their perspective via the online platform ‘Citizen Space’."
        },
        {
            "text": "Why are England’s East Marine Plans being replaced?"
        },
        {
            "text": "England’s East Marine Plans are being replaced because after the Plans’ second three-year report (2020) it was decided that the policies are no longer fit for purpose due to wider legislative and policy changes since the adoption of the plans in 2014."
        },
        {
            "text": "The process of preparing the East Marine Plan began with the Statement of Public Participation (SPP) which was published in April 2024. "
        },
        {
            "text": "Following the publication of the SPP, the MMO initiated the Issues with Supporting Evidence stage of the process. The issues identified as part of this process will feed into the preparation of the Vision and Objectives stage for the new East Marine Plan."
        },
        {
            "text": "Stakeholder engagement is essential in helping the team to develop relevant and useful East Marine Plans. The new policies in these plans will affect all stakeholders operating in the east marine plan areas."
        },
        {
            "text": "Marine Planning"
        },
        {
            "text": "If you would like to receive regular updates from the Marine Planning Team, please sign up to our newsletter. If you have any questions, please do not hesitate to contact the Planning Team at planning@marinemanagement.org.uk"
        }
    ]
}