{
    "url": "https://marinedevelopments.blog.gov.uk/2025/04/09/the-east-marine-plan-pioneering-a-new-approach-and-publication-of-the-sustainability-appraisal-scoping-report/",
    "title": "The East Marine Plan: Pioneering a new approach and publication of the Sustainability Appraisal Scoping report",
    "authors": [
        "Emma Cooper, Marine Planner"
    ],
    "categories": [
        "marine planning"
    ],
    "pub_date": "2025-04-09T10:18:26+01:00",
    "content": [
        {
            "text": "In 2022, the Marine Management Organisation (MMO) recommended that the East Marine Plan should be replaced, based upon the findings of the third Three-Year report. The Secretary of State for Environment, Food and Rural Affairs subsequently agreed with this recommendation and work began on developing the first second-generation English marine plan, marking a significant milestone for the Marine Planning team."
        },
        {
            "text": "Introducing the Sustainability Appraisal (SA)"
        },
        {
            "text": "To ensure the East Marine Plan is economically, socially, and environmentally sustainable, the MMO has been working alongside SLR Consulting, and in collaboration with stakeholders, on the development of the SA. This independent assessment is crucial for guiding the plan's development and ensuring it meets sustainability goals."
        },
        {
            "text": "Pioneering the Natural Capital Approach"
        },
        {
            "text": "The MMO has taken the exciting decision to incorporate a natural capital approach into the SA. This innovative method was developed in collaboration with Natural England and ensures that natural capital assets and ecosystem services are thoroughly considered when assessing sustainability. This marks a first for such an approach to be taken for a SA of an English marine plan and the SA Scoping Report sets out the proposed methodology for undertaking it."
        },
        {
            "text": "Formation of the Sustainability Appraisal Advisory Group (SAAG)"
        },
        {
            "text": "Late in 2023, we formed the Sustainability Appraisal Advisory Group (SAAG), comprising of stakeholders, subject matter experts and specialist advisors from across government and industry. This group brings together valuable insights and expertise to support the natural capital approach and address the diverse aspects of sustainability within the SA."
        },
        {
            "text": "The SA Scoping Report"
        },
        {
            "text": "We’re pleased to announce that the MMO, in collaboration with the SAAG, has now prepared the SA Scoping Report, which is the first formal output of the SA process. This report provides essential baseline information on the environmental, social, and economic characteristics of the east inshore and offshore marine plan areas. It also explores the likely evolution of these baselines without the new plan."
        },
        {
            "text": "Additional Resources"
        },
        {
            "text": "To accompany the SA Scoping Report the MMO and SLR Consulting has prepared:"
        },
        {
            "text": "We’re excited to keep you updated as we continue to progress so look out for our updates on the next stages of the SA process! If you’re interested in hearing more about the SA progress and marine planning you can keep up to date with the latest marine planning developments by signing up for our newsletter."
        }
    ]
}