{
    "url": "https://naturalengland.blog.gov.uk/2025/04/09/wild-in-the-city-the-cambridge-nature-network/",
    "title": "Wild in the City - the Cambridge Nature Network",
    "authors": [
        "Justin Tilley"
    ],
    "categories": [
        "Connecting People with Nature",
        "Development",
        "Green Infrastructure",
        "Growth",
        "Natural England",
        "Nature",
        "Nature Recovery Network",
        "Parks, trails and nature reserves",
        "Tree Planting",
        "Wildlife"
    ],
    "pub_date": "2025-04-09T11:13:03+01:00",
    "content": [
        {
            "text": "By Justin Tilley, Principal Manager, West Anglia team"
        },
        {
            "text": "We often talk of ‘being in nature’ as if it’s a special place, away from our everyday world. In Cambridge, Natural England is supporting a major initiative that’s helping wildlife prosper in the built environment, and blurring the line between urban and rural. "
        },
        {
            "text": "Stroll around the centre of Cambridge, and you could well hear the cry of peregrine falcons from the spires of Kings College Chapel. You may be lucky enough to spot water voles on the bank of the river Cam. Glimpses like this show that nature has a toehold, if not yet a stronghold in this fast growing city."
        },
        {
            "text": "Here the tech economy is booming, attracting skilled workers. And it’s now a focus of government ambitions for further innovation-driven growth. Greater Cambridge has one of the highest rates of house building in the country, and plans for plenty more, but also one of the lowest levels of natural green space. Where does nature fit in?"
        },
        {
            "text": "Cambridge Nature Network has a big idea. Take a host of varied nature habitats in and around the city, and then join them up. This ambitious project has already restored 24 nature sites, linking them together with nature-friendly farming and wildlife-rich corridors, to form a landscape of 9200 hectares. It’s a partnership project formed of wildlife charities, community groups, local authorities and landowners led by Cambridge Past Present and Future and the Wildlife Trust for Beds Cambs and Northants."
        },
        {
            "text": "After three years of driving the project forward, James Littlewood, CEO of Cambridge Past Present and Future is beginning to see the fruits of that big idea: "
        },
        {
            "text": "“Our vision is for connected areas of downland, fens, meadows and woodlands, where nature can recover and thrive and where people can experience a wilder countryside and nature on their doorstep. This can only happen with collaborative action over the long-term and we are encouraging councils, business, community groups and individuals to think about how they can also play their part.”"
        },
        {
            "text": "Cambridge Nature Network was among the first five Nature Recovery Projects supported by Natural England in May 2022 to help meet the long-term ambition of a national ‘Nature Recovery Network’. "
        },
        {
            "text": "Protected nature sites are often small and isolated. But when we connect habitats, nature’s systems can properly function. If we are to meet the UK government’s target of 30% of land and sea conserved for biodiversity by 2030 we need to make space for nature in the human domains of field, town, suburbia and inner city."
        },
        {
            "text": "Sustainable growth is vital - so is nature recovery, because you cannot have one without the other. What’s good for nature is good for people too. Restoring nature offers a cost-effective solution to some increasingly urgent problems like flooding, drought, water shortages, food security and climate resilience."
        },
        {
            "text": "And as Cambridge Nature Network improves local green space, so this expanding city becomes a better place to live, with all the benefits that time spent in nature brings to people’s mental and physical health."
        },
        {
            "text": "So what has been achieved? "
        },
        {
            "text": "All but one of the 24 individual habitat creation projects around the city has been completed so far, creating 18 hectares of brand new habitat including woodlands, wildflower-rich chalk grasslands and wetlands"
        },
        {
            "text": "To the east of the city, 7.3 hectares of new grassland have been created next to Wilbraham Fen SSSI, providing a wildlife rich buffer zone supporting the site’s ecological function."
        },
        {
            "text": "Near the city centre, Logan’s Meadow is a nature reserve by the River Cam, with an active group of local community supporters. They’ve planted trees, managed veteran trees and developed plans for the site’s future in partnership with Cambridge City Council, which will double the size of the reserve. "
        },
        {
            "text": "In the chalk stream tributary of Coldham's Brook there are new wet areas to help improve water quality and create a more enticing habitat for water voles."
        },
        {
            "text": "On the community front, five local schools have created wildflower meadows. And at Orchard Park a fruit bush planting project has is encouraging local people to become more involved in nurturing urban biodiversity."
        },
        {
            "text": "In the surrounding countryside, the project’s land adviser has been supporting a group of farmers to create more space for nature, with advice and small capital grants."
        },
        {
            "text": "These highlights are just a fraction of the achievements that Cambridge Nature Network has completed so far. There’s more in the pipeline, including plans to tackle the issues affecting chalk streams, a rare habitat that’s particularly threatened by water abstraction for homes and agriculture. "
        },
        {
            "text": "But we’re beginning to see how through this joined up approach, Cambridge is rewiring its green connections so that nature can secure a place in the city’s future."
        }
    ]
}