{
    "url": "https://space.blog.gov.uk/2025/11/20/%f0%9f%93%a2-uk-space-agency-christmas-card-design-competition-%f0%9f%8e%85/",
    "title": "📢 UK Space Agency Christmas card design competition! 🎅 ",
    "authors": [
        "UK Space Agency"
    ],
    "categories": [
        "Championing Space"
    ],
    "pub_date": "2025-11-20T16:01:35+00:00",
    "content": [
        {
            "text": "Calling all artists – Santa’s deliveries are at risk from space debris! "
        },
        {
            "text": "We are looking for your Christmas card designs on the need to #KeepSpaceTidy, so that Santa and the satellites we all rely on every day stay safe. 🛰️🎅🛷"
        },
        {
            "text": "If your design is chosen, you could win some great UK Space Agency prizes, including a notebook, pen, pencil, stickers, mug, bag and even your very own UK Space Agency mission patch! "
        },
        {
            "text": "See below for details on how to enter, and entry link at the bottom of this blog!"
        },
        {
            "text": "The competition closes at 5pm on Monday 15 December 2025.  "
        },
        {
            "heading": 2,
            "text": "Did you know?"
        },
        {
            "text": "The UK Space Agency works to keep space safe and sustainable, both within the UK and through the European Space Agency.  For more information visit our website or watch the video below."
        },
        {
            "text": "We're looking for designs for a Christmas card to help us communicate the scale and urgency of this problem and what we are doing about it. The design should help encourage people to behave responsibly, work together to protect our space environment and #KeepSpaceTidy, helping ensure our use of space is sustainable for future generations.   "
        },
        {
            "heading": 2,
            "text": "How to enter"
        },
        {
            "heading": 2,
            "text": "Terms and conditions"
        },
        {
            "text": "Designs must be your own work, and AI-generated images are NOT permitted.  We reserve the right to disqualify any images we have reason to believe are plagiarised or AI-generated. "
        },
        {
            "text": "Please also share your designs on social media, tagging in the UK Space Agency and using the hashtag #KeepSpaceTidy. "
        },
        {
            "text": "By submitting your design via our form, you give permission for the image to be used by the UK Space Agency and chosen partners in promotional material and publications, now and in the future – including online and in print – and waive any rights of compensation or ownership."
        },
        {
            "text": "Entries will be judged by the UK Space Agency’s Space Sustainability team.  The judges’ decision is final."
        },
        {
            "text": "The name and age category for each winning designer may be published on social media, sent online to our stakeholders with our digital Christmas cards, and may be published elsewhere alongside the winning designs."
        },
        {
            "text": "Your personal information will be processed in accordance with the Agency’s public task and legitimate interests, and your right to object to the processing of your personal data is not affected. The UK Space Agency is committed to processing personal information in accordance with all applicable data protection laws and will ensure that the rights and interests of data subjects are weighted appropriately. "
        },
        {
            "text": "Any personal data (information about yourself) that you provide to us for the purpose of entering this competition will be stored and processed securely within UK-based systems. It will only be used by UK Space Agency employees who are involved in facilitating this competition, it will not be shared with any third parties, and it will be destroyed within one month of the winners being announced."
        },
        {
            "text": "Further information and contact details can be found within the UK Space Agency Privacy Notice: https://www.gov.uk/government/publications/uk-space-agency-gdpr-privacy-notice. Your rights under the UK General Data Protection Regulation (UK GDPR) and the Data Protection Act 2018 are not affected. "
        }
    ]
}