{
    "url": "https://ipo.blog.gov.uk/2025/11/20/a-wickedly-good-ip-strategy/",
    "title": "A wickedly good IP strategy ",
    "authors": [
        "Christina Watts"
    ],
    "categories": [
        "Copyright",
        "Innovation"
    ],
    "pub_date": "2025-11-20T15:00:00+00:00",
    "content": [
        {
            "text": "Cinema tickets are purchased, the perfect Glinda-inspired outfit is planned, and I am truly ready for the release of Wicked: For Good – John M. Chu’s sequel to his 2024 fantasy film Wicked, based loosely on the Wizard of Oz story. "
        },
        {
            "text": "But while I'm daydreaming about pink-clad Glinda the good witch and green-skinned Elphaba, who is based on the Wicked Witch of the West, I started thinking about the intellectual property (IP) behind all the different versions of the wonderful world of Oz. "
        },
        {
            "heading": 3,
            "text": "Follow the road to Wicked "
        },
        {
            "text": "Let's start at the very beginning. In 1900, L. Frank Baum wrote The Wonderful Wizard of Oz. When Baum began publishing the Oz books, the copyright law in effect in the United States (US) was the Copyright Act of 1831, which provided a 28-year term with a possible fourteen more years upon renewal. "
        },
        {
            "text": "However, the Copyright Act of 1909 retroactively affected Baum's books, allowing a 28-year renewal for 56 total years of copyright protection. The L. Frank Baum Trust renewed the copyright on all of Baum's Oz novels, and The Wonderful Wizard of Oz entered the public domain in 1956 when the copyright expired in the US. "
        },
        {
            "text": "Although the beloved children’s novel was written in the US, its copyright would have been protected in the UK through international agreements such as the Berne Convention. Dating back to 1886, the Berne Convention is an international copyright treaty that enables creators—including authors, poets, painters and musicians—to control the use of their work across more than 180 signatory nations. "
        },
        {
            "text": "In the UK, copyright in 1900 was covered by the Copyright Act of 1842, which provided protection for life of the author plus 7 years, or 42 years from publication. The Copyright Act of 1911 extended this to life of the author plus 50 years. This would have protected The Wonderful Wizard of Oz until 1969, but because the US had a shorter term, copyright would also have expired in the UK in 1956. This means anyone can lawfully use Baum's original story, characters and ideas without asking permission or paying fees. "
        },
        {
            "text": "Fast forward to 1995. Gregory Maguire wrote Wicked: The Life and Times of the Wicked Witch of the West, reimagining the story from Elphaba's perspective. This was later adapted into a Broadway musical by Stephen Schwartz and Winnie Holzman that's still running today. In 2024, the first act of the musical was released as the movie Wicked. And now? We're getting a sequel, with Wicked: For Good telling the story of act two. "
        },
        {
            "text": "Each version generated new copyright protection: Maguire owns the copyright to his novel's unique story elements while Schwartz and Holzman own the copyright to the musical's songs and script. The creation of the films led to even more new copyrighted material. "
        },
        {
            "text": "But here's where it gets tricky. Warner Bros owns the copyright to the iconic 1939 MGM film The Wizard of Oz. In the UK, copyright protection usually lasts for 70 years after the creator's death. The last of the relevant authors of the film died in 1987 (producer Mervyn LeRoy), meaning that the 1939 film's copyright is still very much active until 2057. "
        },
        {
            "heading": 3,
            "text": "Ruby slippers"
        },
        {
            "text": "We all know Dorothy's ruby red slippers from the 1939 film. In fact, I grew up thinking that they had always been red."
        },
        {
            "text": "In Baum's original 1900 book, Dorothy's slippers were silver. MGM changed them to ruby red to show off their fancy new Technicolour technology - and because they created that change, Warner Bros restricts reproductions of the ruby red slippers. "
        },
        {
            "text": "So, what did Gregory Maguire do for his 1995 novel? He went back to silver. The 2024 Wicked  film and the upcoming Wicked: For Good  also use silver slippers. "
        },
        {
            "text": "This might seem like a small detail, but it's actually a clever piece of rights navigation. By returning to Baum's public domain description, they avoided needing a licence for the ruby slippers. "
        },
        {
            "heading": 3,
            "text": "Witches are always green "
        },
        {
            "text": "\"And Yes, I Have Always Been Green\" - or have I? "
        },
        {
            "text": "In Baum's 1900 novel, the Wicked Witch of the West isn't described as green. That distinctive green skin was another of MGM's creative inventions for the 1939 film. So technically, that green colouring is part of Warner Bros' copyrighted material. But the extent to which characters (rather than the whole film) are protected by copyright is still debated in court cases. "
        },
        {
            "text": "Maguire kept his witch green in his 1995 novel, as did the stage musical and films. How did they manage that without copyright issues – or at least needing a licence? "
        },
        {
            "text": "The answer is in how they transformed the character. The 1939 Wicked Witch was purely evil - cackling, threatening, forever trying to kill Dorothy. Elphaba is completely different. She's intelligent, compassionate, misunderstood, and challenges unjust systems. As she sings, she's someone who's \"unapologetically me.\" "
        },
        {
            "text": "The 2024 film went even further with visual distinction. Elphaba's makeup is softer and more naturalistic than the harsh green of the 1939 witch. Her costumes are beautifully detailed designer pieces, not basic black robes. These creative choices help establish her as a different character who just happens to share the green skin tone. "
        },
        {
            "heading": 3,
            "text": "The Wonderful Copyright of Oz "
        },
        {
            "text": "The journey from Baum's 1900 novel to the 2024 Wicked film shows how IP works in practice. It's the framework that lets creative works evolve while protecting the people who create them. "
        },
        {
            "text": "Silver slippers instead of ruby; a misunderstood hero instead of a cackling villain; these weren't just creative choices, they were likely to be strategic IP decisions that allowed new stories to exist alongside earlier copyright works. "
        },
        {
            "text": "The constraints shaped the storytelling. Unable to copy the 1939 film, creators had to build something different, giving us an Elphaba who has a more complex, rounded character. "
        },
        {
            "text": "So, as the lights dim and the film begins, I'll be thinking about more than just the story on screen. I'll be noticing the decades of copyright navigation and creative decisions that made this gravity defying moment possible. "
        }
    ]
}