{
    "url": "https://childrenssocialcare.blog.gov.uk/2025/11/20/care-leaver-support-staying-close/",
    "title": "Finding Support as a Care Leaver",
    "authors": [
        "Emily"
    ],
    "categories": [
        "Care leavers"
    ],
    "pub_date": "2025-11-20T09:36:05+00:00",
    "content": [
        {
            "text": "This month is National Care Leavers Month, which celebrates the resilience and achievements of young people leaving care. Emily's story is a powerful example of what dedicated support can achieve. Her life was transformed by Staying Close, a Department for Education-funded programme supporting care leavers. The Children’s Wellbeing and Schools Bill, which is currently going through parliament, will strengthen duties on councils to provide support like Staying Close."
        },
        {
            "heading": 2,
            "text": "How Staying Close changed my life"
        },
        {
            "text": "My name is Emily. I'm a 19-year-old mum to my 3-month-old son who is my world. I came into care when I was 2 and lived in a mixture of foster care, with family, and in residential homes. When I was 17, my social worker told me about Staying Close. To be honest, I didn't want the service, but I agreed to meet my Personal Staying Close Adviser, Cath. I'm so glad I did."
        },
        {
            "heading": 2,
            "text": "Staying anywhere but home"
        },
        {
            "text": "I was going missing a lot and getting involved with the police. I'd stay at different friends' houses, sometimes out of the area. Sometimes I felt safe, other times not. One house I stayed at regularly had chaos, random people coming and going with substance misuse. I was either coming back at all hours or staying out, and I was close to being asked to leave my residential home."
        },
        {
            "text": "I was with partners who weren't good for me, sometimes toxic. I wasn't in a happy place and didn't like where I was living or what I was doing. I felt like I had no one else in my life."
        },
        {
            "heading": 2,
            "text": "The team who showed up"
        },
        {
            "text": "Meeting Cath was a turning point. When I got to know her, I knew we'd get on and that she was a good person. She helped me with shopping, got me involved with a food pantry, and helped me with budgeting. We'd have a laugh. I felt I could talk openly to Cath about anything – she'd listen and give good advice."
        },
        {
            "text": "Debbie, my education worker, helped me get volunteering opportunities and supported me onto a course with NACRO, a social justice charity. When I became pregnant, I wanted to focus on becoming a mum, and she understood."
        },
        {
            "text": "Holly, my housing worker, helped me look for my own tenancy. When I was pregnant and had to move to a temporary homeless hotel, I was scared. The Staying Close Manager, Michelle, took me there to settle me in and gave me goodies and pamper stuff to destress. I was so grateful."
        },
        {
            "heading": 2,
            "text": "Building a home and a family"
        },
        {
            "text": "I got my own tenancy with Holly's support. Cath helped me move in on a Friday when I had no electric or gas. She came back on her day off on Saturday to get everything sorted. Cath and Debbie helped me get a bed, TV and bedding – Cath even took the sheets home to wash them so they were fresh."
        },
        {
            "text": "Cath and Debbie came to my scans, which was amazing. The team did a baby shower for me, and everyone has been out to see me and the baby since he was born."
        },
        {
            "heading": 2,
            "text": "To anyone who thinks they’re alone"
        },
        {
            "text": "Just having the Staying Close team there for me, with no judgement, and them sticking to their word has meant so much. I'd tell other young people: take all the advice and support because it's genuine. Everyone on Staying Close really cares. When they tell you something, they mean it. You can trust them.Everyone on the team tells me how it is in a nice way, and I really respect this. They don't just help me, they help my baby and my baby's dad too. They look after us like their own family. There aren't enough words in the world to say thank you."
        },
        {
            "heading": 2,
            "text": "Further links"
        }
    ]
}