{
    "url": "https://defrafmp.blog.gov.uk/2025/11/20/consultation-launched-on-11-scotland-led-demersal-fmps/",
    "title": "Consultation launched on 11 Scotland led demersal FMPs",
    "authors": [
        "FMP team, Scottish Government's Marine Directorate"
    ],
    "categories": [
        "- Scotland led FMPs",
        "Public consultation"
    ],
    "pub_date": "2025-11-20T12:51:59+00:00",
    "content": [
        {
            "text": "Today we, the Scottish Government, are publishing a consultation on 11 proposed joint UK fisheries management plans (FMPs) for demersal fish stocks."
        },
        {
            "text": "The FMPs were developed by the four UK fisheries administrations with the Scottish Government as the coordinating authority. "
        },
        {
            "text": "The FMPs gather evidence of what we know about the state of these demersal stocks, the management approach, and set out policies and actions to restore or maintain the stocks at sustainable levels."
        },
        {
            "heading": 2,
            "text": "Share your views"
        },
        {
            "text": "Read the consultation documents and share your views here: https://consult.gov.scot/marine-scotland/fisheries-management-plans-demersal-fish-stocks/"
        },
        {
            "text": "You can submit your consultation response through an online questionnaire, or by email or post until 11:59pm on Wednesday 11 March 2026."
        },
        {
            "heading": 2,
            "text": "Consultation events"
        },
        {
            "text": "We will be running online sessions to discuss these plans in more detail. "
        },
        {
            "text": "The first events will primarily be information giving sessions and will be held on:"
        },
        {
            "text": "More events are being planned for early 2026 where you can share your views to be fed into the consultations. Details will be shared on the events page of this blog when they’re available."
        }
    ]
}