{
    "url": "https://naturalengland.blog.gov.uk/2025/11/20/from-local-to-national-and-back-again-place-based-support-for-citizen-science/",
    "title": "From local to national and back again: place-based support for citizen science",
    "authors": [
        "Andy Jefferies"
    ],
    "categories": [
        "Connecting People with Nature",
        "Evidence",
        "Monitoring",
        "Natural England",
        "Nature",
        "Science and evidence"
    ],
    "pub_date": "2025-11-20T16:38:49+00:00",
    "content": [
        {
            "text": "By Andy Jefferies, Senior Officer for Citizen Science"
        },
        {
            "text": "One challenge for the citizen science sector is how to bridge the gap between evidence and experiences which are meaningful at a local scale, and those which are meaningful at a national one. Local schemes are often brilliant at inspiring participation and in keeping people engaged year after year, but they may lack scientific rigor or pathways to wider impact. "
        },
        {
            "text": "Conversely, national schemes with specialist data scientists on board often find it easier to produce robust outputs leading to national-scale insight about nature, but they can struggle to recruit and retain volunteers given that so much of their work is necessarily centralised. "
        },
        {
            "heading": 4,
            "text": "Improving our knowledge about the environment"
        },
        {
            "text": "To explore how we might narrow the gap between these perspectives, over the last two years Natural England, working within the Defra-led Natural Capital and Ecosystem Assessment (NCEA) programme, has trialled a small number of local citizen science partnerships."
        },
        {
            "text": "These pilot projects bring together organisations and individuals who, although they may have very different priorities and interests in many areas, all have a shared interest in improving our knowledge about the environment and want to coordinate better together towards that larger goal. They’ve taken very different approaches, but all of them have led to improved collaboration and insight both for the partners involved, and for us at Natural England."
        },
        {
            "heading": 4,
            "text": "Wessex: convening local organisations and sharing resources"
        },
        {
            "text": "In Wessex, Natural England partnered with the Bristol Natural History Consortium to increase local capacity for citizen science. Over 18 months, they engaged 78 organisations through a regional conference and a week-long citizen science showcase – events which helped set shared priorities and created new opportunities for engagement. Alongside this, the NHC ran online workshops and produced written guidance to address key areas like communications, fundraising, academic collaboration, and organisational networking. "
        },
        {
            "text": "Participant feedback highlighted some of the immediate benefits of the workshops and events: "
        },
        {
            "heading": 4,
            "text": "West Midlands/Severn catchment: community water quality monitoring"
        },
        {
            "text": "In the Stour River catchment (a sub-catchment of the Severn), a second local pilot led by the Severn Rivers Trust brought together representatives from a wide range of groups – including industry, local government and agencies, NGOs and communities – and set them on the joint quest of aligning local and national needs for water quality monitoring. "
        },
        {
            "text": "Once data priorities had been identified, these were matched with approaches already developed by the CaSTCo initiative (Catchment Systems Thinking Cooperative – a national citizen science initiative for river monitoring). In cases where existing methods were designed for national rather than local data needs, they were adapted to make them relevant at a local scale. Volunteers recruited through local networks were then trained in these methods, and were able to start carrying out surveys of water quality to Environment Agency accepted standards. Meanwhile, wider Rivers Trust facilities made it possible for local data to be immediately available to the volunteers and the project, and grouped it together with similar data produced by other initiatives. "
        },
        {
            "text": "The pilot demonstrated how local needs and motivations can align with national data needs. This parallels other work, notably the Tracking the Impact project supported by JNCC, which is testing the local use and application of protocols used in national-scale species monitoring schemes.  "
        },
        {
            "text": "Northumbria: large-scale online participation"
        },
        {
            "text": "Our final pilot aimed to build engagement through large-scale online volunteering using a bespoke platform. "
        },
        {
            "text": "Deep Time was developed and run by partners DigVentures, responding to the needs of local conservation land-managing organisations including the National Trust, the Wildlife Trusts, and landscape bodies. Through the platform, volunteers were engaged, recruited, trained, and deployed on a mission: to create accurate habitat maps at a landscape scale. "
        },
        {
            "text": "To achieve this, the platform delivered a range of base-mapping including aerial and satellite imagery, from which volunteers learned to identify habitats to 16 broad categories. The quality of mapping was checked through double sampling and (where available) professional ground survey data, and through five experimental ‘missions’, each focused on a different area in Northumberland,  volunteers donated over 9,000 hours (5 years) of time to create over 46,000 polygon features, collectively mapping 4,800 square kilometres of habitat. "
        },
        {
            "text": "The beneficial outcomes of the project went well beyond maps. Of almost 500 participants from 32 countries (including Kazakhstan!), ranging in age from 17 to 89,  "
        },
        {
            "text": "While this project was an experiment designed to test whether mass online participation can complement professional survey and AI analysis of satellite data (yes it can!), the platform and approach could be easily transferred to other landscape features or species. One possibility under consideration is whether volunteers could map invasive species distribution from high-resolution drone images – though the list of potential projects is endless. "
        },
        {
            "heading": 4,
            "text": "What next?"
        },
        {
            "text": "While this project was an experiment designed to test whether mass online participation can complement professional survey and AI analysis of satellite data (yes it can!), the platform and approach could be easily transferred to other landscape features or species. One possibility under consideration is whether volunteers could map invasive species distribution from high-resolution drone images – though the list of potential projects is endless."
        },
        {
            "text": "Note: This is the third in a series of blogposts on Natural England’s work for and with citizen scientists – volunteers who collect environmental data to help us better understand nature. You can also read an overview of this work, or find out more about our pond and freshwater monitoring work. "
        }
    ]
}