{
    "url": "https://space.blog.gov.uk/2025/11/20/uk-space-agency-teams-up-with-imeo-and-ghgsat-to-tackle-methane-emissions/",
    "title": "UK Space Agency teams up with IMEO and GHGSat to tackle methane emissions",
    "authors": [
        "UK Space Agency"
    ],
    "categories": [
        "Earth from space",
        "Earth observation"
    ],
    "pub_date": "2025-11-20T09:43:47+00:00",
    "content": [
        {
            "text": "A new partnership uses high-resolution satellite data to support progress towards global methane targets."
        },
        {
            "text": "The UK Space Agency has announced a significant collaboration with the United Nations Environment Programme’s International Methane Emissions Observatory (IMEO), reinforcing the UK’s leadership in tackling one of the most urgent climate challenges: methane emissions. "
        },
        {
            "text": "Through this initiative, the UK Space Agency provides IMEO and UK Government users with high-resolution methane data, utilising commercial satellite company GHGSat’s advanced satellite monitoring capabilities and data analytics. "
        },
        {
            "text": "These satellites provide improved accuracy and granularity compared to traditional datasets."
        },
        {
            "text": "By integrating this data into IMEO’s global monitoring systems, the partnership strengthens international capacity to detect, validate, and respond to emissions across different sectors and regions. "
        },
        {
            "text": "Beth Greenaway, Head of Earth Observation at the UK Space Agency, said: "
        },
        {
            "text": "Methane is a potent greenhouse gas, responsible for around 30% of global warming since pre-industrial times. "
        },
        {
            "text": "Reducing methane emissions is widely recognised as one of the fastest and most cost-effective ways to slow climate change. "
        },
        {
            "text": "This new partnership supports global efforts to meet commitments under the Global Methane Pledge, which aims to cut methane emissions by 30% by 2030, a key milestone as nations prepare to report progress at COP30. "
        },
        {
            "text": "The announcement coincides with COP30, where the United Nations has released its latest Global Methane Assessment which suggests more needs to be done to meet the aims of the pledge."
        },
        {
            "text": "This alignment underscores the urgency of coordinated international action and the UK’s commitment to delivering measurable progress on methane reduction as set out in the updated UK methane action plan."
        },
        {
            "text": "Meghan Demeter, Programme Management Officer, United Nations Environment Programme’s International Methane Emissions Observatory said:"
        },
        {
            "text": "The collaboration is already delivering tangible benefits. Data is being used to validate emission mitigation activities catalysed by IMEO and track long-term trends in methane emissions in several countries.  "
        },
        {
            "text": "GHGSat’s UK Managing Director Dan Wicks said: "
        },
        {
            "text": "Methane reduction is one of the most impactful steps we can take to slow global warming in the near term. Many existing inventories rely on estimates rather than direct measurements, creating uncertainty that hampers effective action."
        },
        {
            "text": "GHGSat’s high-resolution imagery provides a more complete and transparent picture, supporting evidence-based policy and international cooperation. "
        },
        {
            "text": "By championing innovation in methane monitoring, the UK is demonstrating global leadership in climate action and setting a new standard for transparency and accountability. "
        }
    ]
}