{
    "url": "https://naturalengland.blog.gov.uk/2023/01/19/a-resolution-to-restore-our-natural-world-in-2023/",
    "title": "A resolution to restore our natural world in 2023",
    "authors": [
        "Tony Juniper"
    ],
    "categories": [
        "Biodiversity",
        "Climate change",
        "Natural England"
    ],
    "pub_date": "2023-01-19T12:57:43+00:00",
    "content": [
        {
            "text": "Blog by Tony Juniper CBE, Chair of Natural England"
        },
        {
            "text": "January is a time for new beginnings and new resolutions to drive self-improvement, and that applies to nations just as much as individuals. In Canada last month almost 200 countries at COP 15 agreed a set of landmark pledges that will resonate not just through 2023, but to the end of the decade and beyond to the middle of the 21st century."
        },
        {
            "text": "The Kunming-Montreal Global Biodiversity Framework (GBF) means that virtually all the world’s governments now share our commitments to halt and reverse biodiversity loss and to protect 30% of land and oceans, all by 2030. Less heralded but no less important was the commitment to reduce all pollution to levels not harmful to wildlife and ecosystems, taking in significant cuts to nutrients, pesticides and plastic waste."
        },
        {
            "text": "The UK government was a leading light in achieving this breakthrough, becoming an early adopter of some targets and then using its influence and leadership in Montreal to bridge divides and get a historic agreement over the line as the clock ran down."
        },
        {
            "text": "As with all resolutions, it is now about implementation. If we can turn the Montreal pledges into reality it would be as significant an achievement for the planet as fulfilling the main goal from the COP 21 climate change in Paris in 2015 to seek to limit the global average temperature rise to 1.5 degrees."
        },
        {
            "text": "The Montreal meeting was delayed two years by COVID 19 and, with the end of this decade looming fast, we must act now with pace, determination and coordination if we are to have any chance at all of meeting its demanding ambition. After the UK’s influential role at COP 15 we have to lead by example, starting 2023 by putting Nature recovery at the heart of all our major plans and partnerships so that we can demonstrate tangible progress to the other GBF signatories."
        },
        {
            "text": "The government’s legally-binding environmental targets published in December while the Montreal summit was underway helped give us a good idea of where we need to get to. Some, such as halting species decline this decade and creating 500,000 hectares of wildlife-rich habitat beyond protected sites as part of the plan to have 30 per cent of the country managed for Nature by 2030, align with the Montreal agreement, but other aspects of the new global accord will require additional bold new plans, including to meet the requirements to reduce agricultural pollution from fertilisers and pesticides."
        },
        {
            "text": "The need to reduce the nutrient impact from wastewater and agriculture highlights the growing importance of water quality and its effect on our protected Nature sites, not to mention the solutions to “nutrient neutrality” on which Natural England has embarked with local authorities and developers recently in order to ensure new housing does not undermine efforts to clean our rivers. To meet these complex requirements we will of course need a roadmap to guide us unwaveringly toward meeting the goals we signed up to, which is where the Government’s Environmental Improvement Plan (EIP), due to be published later this month, comes in."
        },
        {
            "text": "Natural England has been working closely with Defra to advise on the steps needed to drive us towards our ambitious targets for Nature recovery and our work on the ground and at sea will be central to taking the steps and building the partnerships required. It is important that the EIP utilises all the levers possible, in a strategic, coordinated way, to deliver the biggest strides towards restoring Nature. Those levers are fortunately now many and varied ranging from Biodiversity Net Gain to land-based investments in achieving net zero carbon goals and from Local Nature Recovery Strategies to the strategic development of the protected landscapes network, including the National Parks and Areas of Outstanding Natural Beauty."
        },
        {
            "text": "Funding will of course be an important element of this, matching our ambitions and the amount of work needed to turn round decades of wildlife declines. This won’t just be new money but intelligent use of existing Nature budgets as well as unleashing the vast but still largely unrealised potential of private sector investment. It is also about integrating Nature recovery into the substantial budgets that work in landscapes for parallel purposes."
        },
        {
            "text": "For example, there is much to be gained from looking at how spending on three major areas – farming, forestry and flooding – can be integrated in a strategic way that boosts progress on Nature recovery. In relation to farming, providing incentives so that land managers can restore Nature alongside producing food is imperative – only with security of Nature can we have long-term security of domestic food supply. Under ELMs the relationships between ambitious groups of farmers and Natural England’s advisers will be pivotal in deriving major benefits for Nature from land with the highest potential."
        },
        {
            "text": "With forestry, improving domestic timber security is increasingly being seen as an important driver alongside the need to use woodland and tree cover to tackle the climate and Nature emergency. By promoting a range of woodlands in the right places we can achieve both goals: more native woodlands are essential to boost Nature recovery; new conifer plantations can serve long-term domestic timber and wood fibre needs; and more mixed, multi-functional woodlands can help meet both requirements. All play a role in absorbing carbon."
        },
        {
            "text": "On flooding, Nature recovery can go a long way to helping to reduce the risk to homes and businesses by keeping more water in the environment and out of properties. Better soil quality, healthier rivers and more ponds all help while also making the landscape more resilient to climate change and more attractive to people looking for recreation opportunities, improving their health and wellbeing. At a time when money is tight for households and the country, every pound spent must deliver multiple benefits, rather than those sought from what can sometimes be rather siloed policy goals."
        },
        {
            "text": "Being a 5-year plan, the EIP will necessarily focus minds on delivery, which is what we need at this stage of the journey towards 2030. This year at Natural England we look forward to passing important milestones, with our partners, towards establishing a Nature Recovery Network (NRN) across the country."
        },
        {
            "text": "Building on last year’s launch of 5 landscape-scale Nature Recovery Projects, we are due to unveil a further 6 in the Spring, covering an area greater than all of England’s 221 National Nature Reserves. This is in addition to the pipeline of new or extended NNRs and Sites of Special Scientific Interest due to come on stream in 2023. Making sure more people have access to good quality Nature where they live, especially in urban areas, is a huge motivation for us and we will shortly be launching our Green Infrastructure Standards to help local authorities do just that. We will be working hard with local authorities to ensure Nature recovery takes place in a way that communities want – supported by expected provisions in the Levelling Up and Regeneration Bill - so that the environmental targets lead to improvements that benefit them. After all, the targets are as much about people as they are about wildlife."
        },
        {
            "text": "This year promises to be one of major advances for Nature in this country, which I hope will provide encouragement to others around the world as we all seek to make good on the resolutions secured in Montreal."
        },
        {
            "text": "NB. A version of this blog appeared earlier in Business Green magazine."
        },
        {
            "text": "-ends-"
        }
    ]
}