{
    "url": "https://dragonsden.blog.gov.uk/2023/01/19/dragons-den-episode-3-series-20/",
    "title": "Dragons’ Den, Episode 3, Series 20",
    "authors": [
        "Paula Davy"
    ],
    "categories": [
        "Business",
        "Confidentiality",
        "IP",
        "Licensing",
        "Trade marks",
        "Trade secrets"
    ],
    "pub_date": "2023-01-19T21:05:37+00:00",
    "content": [
        {
            "text": "It’s been a while since I’ve written a Dragons’ Den blog but the episode did not disappoint! To be honest, even when I’m not writing the blog and watching purely for my own entertainment, I can’t help but focus on the intellectual property (IP) in each episode. You can take the girl out of the IPO but not the IP out of the girl! "
        },
        {
            "text": "As always, there were a variety of innovations in the Den; from Middle Eastern-inspired fragrances to a rowing machine crossed with a bicycle. However, there were two concepts which caught my attention. "
        },
        {
            "heading": 2,
            "text": "A taste of India "
        },
        {
            "text": "The first of these was mother and son duo Kunal and Nana Nanavati. They were pitching for a 20% share in their business, Nana’s Chutneys, a range of vegan and gluten-free Indian chutneys, home-made in Nana’s kitchen. "
        },
        {
            "text": "Hot under the collar after sampling some of Nana’s delicious delights, the Dragons’ were eager to find out more about the business. Peter Jones asked, ‘How secret is the recipe?’ "
        },
        {
            "text": "In the field of IP, Nana’s closely guarded recipe would be classed as a trade secret. Trade secrets are another form of intellectual property and are used by many well-known companies such as Coca-Cola, KFC and closer to home, Levi Roots and his Reggae Reggae Sauce. Levi featured on Dragons’ Den in 2006. With their blend of secret ingredients and unique taste, businesses can use their trade secrets to set their products apart from competitors.  "
        },
        {
            "text": "The good thing about trade secrets is that:  "
        },
        {
            "text": "As for Nana’s chutneys, the recipe is so secret that Nana even refuses to share it with her son! However, if the business was to expand, they may need to share the recipe and/or method of production with others. If this were the case, Kunal and Nana may want to ask all parties to sign a non-disclosure agreement, to legally protect the confidential information from being shared elsewhere."
        },
        {
            "text": "Unfortunately for Kunal and Nana, whilst the Dragons enjoyed their chutneys, they weren’t hungry enough for a second helping of the family run business and opted out of any deal. "
        },
        {
            "heading": 2,
            "text": "From plant to plate "
        },
        {
            "text": "Last into the Den was Dan Robson with his easy-to-use seed kits, for planting and growing herbs, fruit and vegetables. Dan was hoping to secure an £80k investment in return for 10% of the Grow Sow Simple business, which he believes has the only fully bio-degradable pod in the world."
        },
        {
            "text": "As soon as Dan made this claim, I could see the Dragons' eyes light up. Peter was quick to ask, ‘Have you protected it?’ and shrewdly, Dan confirmed that a patent for the ‘Seed Cell’ has been granted in the UK and Europe. "
        },
        {
            "text": "It can be a complicated and costly process to get a patent granted, sometimes taking years, so Dan has done well. To give you an idea of the different stages of the patent process, we have produced a handy timeline on our website. "
        },
        {
            "text": "If you are confident that your invention meets the strict criteria for a patent and that a patent is the best route for your business, we would advise you to contact a patent attorney to help with your application. The Chartered Institute for Patent Agents can help you find an attorney in your area.   "
        },
        {
            "text": "Having already invested in a similar business, Sara Davies was keen to find out where the business could grow from here. As Dan introduced the Dragons’ to his range of products, he mentioned that he had obtained a licence from children’s toy maker Hasbro, to use the Peppa Pig character in his children’s line. "
        },
        {
            "text": "A licence is a legal agreement between the IP rights holder and another party. It grants them permission to use your IP in an agreed way that would otherwise be an infringement. "
        },
        {
            "text": "In contrast to a trade secret where the IP is kept close, a licence is a more collaborative way of managing your IP. It can be licensed in or licensed out, often for a fee, and there are many benefits for all parties. Watch our video below to find out more. "
        },
        {
            "text": "After an excellent start, a tough conversation about figures saw all but one of the Dragons pulling out of a deal. Although Sara thought Dan’s business could still do with a little cultivation, she offered him all the money but for a 20% share, which he accepted.  "
        }
    ]
}