{
    "url": "https://civilservice.blog.gov.uk/2023/01/19/national-crime-agency-help-tackle-child-abuse/",
    "title": "National Crime Agency help tackle child abuse",
    "authors": [
        "Civil Service Blog Team"
    ],
    "categories": [
        "A Modern Civil Service",
        "A Skilled Civil Service",
        "An Ambitious Civil Service",
        "An Innovative Civil Service"
    ],
    "pub_date": "2023-01-19T09:02:07+00:00",
    "content": [
        {
            "heading": 3,
            "text": "NCA top Civil Service Awards Productive Partnerships category in for their valuable tooling to help identify, locate and protect vulnerable victims of sexual abuse."
        },
        {
            "text": "National Crime Agency (NCA) officers’ close collaboration with BAE Systems is protecting children around the world from child sexual exploitation, making them worthy winners at this year’s Civil Service Awards."
        },
        {
            "text": "The NCA’s child enforcement and online protection (CEOP) team took home the Productive Partnerships Award for their ground-breaking work alongside BAE’s data analysts and data architects."
        },
        {
            "text": "Their combined efforts resulted in the development of innovative tooling which assists in the global identification of child sexual abuse offenders."
        },
        {
            "text": "“The joint goal for us is safeguarding children - that has always been at the forefront of everything that we do,” explained Lauren Wilson of the NCA at December’s Lancaster House awards ceremony."
        },
        {
            "text": "“The work we’ve done has allowed us to do that on such a great scale – it’s really been unfeasible to do that before, previously there has been a lot of granular work.”"
        },
        {
            "text": "It’s the knowledge that this partnering is resulting in the safeguarding of hundreds of children that makes winning at the Civil Service Awards so satisfying, Lauren added."
        },
        {
            "text": "“We worked very hard in close partnership for a long time,” she said on behalf of her colleagues. “It’s the highlight of our careers.  It’s great this award shows how well we can work with partners and achieve a joint goal to such great effect.”"
        },
        {
            "text": "The team’s efforts have shone new light on the ways in which the internet is used to spread images of child sexual abuse and exploitation. These insights have been shared with industry partners to help reduce offending around the world."
        },
        {
            "text": "Paul Dines of BAE Systems said he would remain proud of the way he had been able to use his skill set to contribute for the rest of his life."
        },
        {
            "text": "”It’s been the most rewarding work I’ve ever done as a software engineer,” he said. “To use my skills to contribute to such a worthwhile cause is something I’ll remember for the rest of my career.”"
        },
        {
            "text": "Congratulations to Lauren, Paul and the team for winning the Productive Partnerships Award, which aims to recognise those who successfully build, maintain and make the most of strong relationships between organisations across different sectors."
        },
        {
            "text": "Their great team ethic was certainly on display at December’s Lancaster House awards ceremony, as was their pride at having achieved so much."
        },
        {
            "text": "As Lauren puts it: “The feeling you get from knowing the work you’ve done has saved children is honestly the best feeling you could ever find ever.”"
        },
        {
            "text": "Find out more about the awards and the nominations at www.civilserviceawards.com."
        }
    ]
}