{
    "url": "https://civilservice.blog.gov.uk/2023/01/19/slamming-the-gates-on-reoffending/",
    "title": "Slamming the gates on reoffending",
    "authors": [
        "Civil Service Blog Team"
    ],
    "categories": [
        "A Modern Civil Service",
        "A Skilled Civil Service",
        "An Ambitious Civil Service"
    ],
    "pub_date": "2023-01-19T09:25:09+00:00",
    "content": [
        {
            "heading": 3,
            "text": "How a new recruit Tassie Ghilani took an evidence based approach to improve the life chances of prison leavers"
        },
        {
            "text": "Tassir Ghilani joined the Ministry of Justice (MoJ) in June 2021 via the Going Forward in Employment scheme.  It improves life chances for those leaving prison and demonstrated exceptional policy aptitude and leadership in her work to improve outcomes for prison leavers. Tassie’s  tremendous potential has been recognised by her securing a permanent appointment on promotion, and she now leads work to improve experiences and outcomes for prison leavers across MoJ."
        },
        {
            "text": "Perhaps even better, Tassie  is also now the worthy winner of the Rising Star Award between a shortlist of five amazing nominees as part of the Civil Service Awards 2022."
        },
        {
            "text": "“I feel quite surreal actually. I’ve come a long way in a short space of time. Really it’s just a proud day for all of us [in the prison service],”said Tassie."
        },
        {
            "text": "The category champions who judged the nomination were Antonia Romeo, Permanent Secretary at the Ministry of Justice, and Sue Gray, Second Permanent Secretary to the Department for Levelling Up, Housing and Communities. "
        },
        {
            "text": "Rising star"
        },
        {
            "text": "“Tassie is exactly the rising star we are keen to have.” praised Sue, “I think to actually show that passion and pride in her work is absolutely fantastic. Civil servants are doing great work across the whole of the country and this was a highly fought category and she [Tassie] has done brilliantly.”"
        },
        {
            "text": "Tassie is dedicated to addressing issues of addiction, homelessness, unemployment, and mental health which can contribute to high re-offending rates. She developed and piloted innovative interventions to improve outcomes via the £20m Prison Leavers Project, using research directly with prisoners to develop policy. Her proposals have been adopted and she went on to create a bespoke learning and development offer for prison leavers, building a better induction pathway and Lived Experience strategy."
        },
        {
            "text": "But Tassie’s hard work doesn’t stop there! She delivers speeches, presentations and training for organisations to improve their understanding of issues faced by care leavers, which has been hailed as the best training participants have ever received. She provides 1:1 support to GFIE candidates and also set up the first ever Lived Experience lead event in 2022 and won an award for contributing to over 10 policy pieces of work."
        },
        {
            "text": "At the Civil Service Awards 2022 ceremony, she reflected on her win and the importance of having positive influences. “It makes the impossible possible. For people like me, we don’t have role models we can look to and think that is something achievable… What I hope to show people today is that anything is achievable. It really is just a case of hard work and pushing something that you’re really passionate about in the hope of making change and its possible for… anyone of any background, however you grew up, and your personal circumstances.” "
        },
        {
            "text": "Julie Leonard, partner at Newton Europe who were one of the headline sponsors of the 2022 awards programme and category sponsor for the Rising Star Award, looked back on Tassie’s  journey. “Tassie is so inspirational. We had so many candidates and it was a difficult judging process. What Tassie has done and the humility she has; she says this is a team effort - is something to be commended.”"
        },
        {
            "text": "Tassie shared some wise words with fellow civil servants, including what the award personally means to her. "
        },
        {
            "text": "“The message that needs to go out to everybody is anything is achievable and if you work towards a common goal as we do every single day in government, it really is about pushing change for every single person. We need equality for everybody across the board for every person no matter where you’ve come from or what you’re facing right now in your life. It's something everyone should aspire towards; being part of a system that pushes and creates change for everyone and unless we have tangible role models that really speak to what change looks like, it's not believable. Hopefully today [at the awards ceremony], winning this award shows everybody that anything really is possible if you put your mind to it.”"
        },
        {
            "text": "Could you be a role model in your environment? Find out more about the awards and the nominations at www.civilserviceawards.com."
        }
    ]
}