{
    "url": "https://mojdigital.blog.gov.uk/2023/01/19/switching-to-a-design-career-in-my-forties/",
    "title": "Switching to a design career in my forties",
    "authors": [
        "Sumiti Hamilton"
    ],
    "categories": [
        "a great place to work",
        "Interaction Designer",
        "Our People",
        "Women in Tech"
    ],
    "pub_date": "2023-01-19T16:15:02+01:00",
    "content": [
        {
            "text": "I have always loved art and design, but following this passion as a career didn’t seem possible until I joined the Ministry of Justice."
        },
        {
            "text": "Since 2021, I have been re-training as a designer, having previously worked as a Business Support Manager, and history of working in courts as a court clerk. Changing career in my forties, while being a working mum, is one of my greatest achievements!"
        },
        {
            "text": "Below are a few reflections to help anyone thinking of making a career change."
        },
        {
            "text": "1. Don’t give up on your dreams"
        },
        {
            "text": "As I grew up in India, I wanted to be an artist. I studied a degree in applied arts. It wasn't overly technical, all by hand. I loved sketching and painting with watercolours."
        },
        {
            "text": "I never had the chance to follow my childhood dream. After I finished my education, I got my first job as a fines officer. Although it helped pay the bills, it wasn’t the creative role I longed for."
        },
        {
            "text": "When I joined Justice Digital as a business support manager, I was amazed by the agile way of working and user-centred approach. During one project, I had to work with a designer on a new logo for a podcast series. When I saw the designer at work, my eyes lit up."
        },
        {
            "text": "The seed had been sown in my head - I wanted to design. I knew I couldn’t afford to pursue a move financially, but I was determined to follow my dreams if an opportunity arose."
        },
        {
            "text": "2. Get help from design friends"
        },
        {
            "text": "When I first began working, I had no digital art experience. I couldn’t afford to pay for courses. Fortunately, whilst at the Ministry of Justice, I could use my learning and development allowance for design training."
        },
        {
            "text": "I didn’t have a plan and didn’t know where to start. I decided to speak with Jeffrey Allen, the Lead Designer in Central Digital at the time. Jeff identified an opportunity to join Central Digital as an Associate Interaction Designer on the Justice on the Web team (JOTW) where I would shadow Genalda Silva, the Interaction Designer on that team. I was introduced to Jen Thomson who would be my coach and mentor and to four designers who would become my buddy group to provide peer support and help me develop."
        },
        {
            "text": "Jen created a plan of learning activities to cover the different skills I would need to learn as an Interaction Designer."
        },
        {
            "text": "3. Learning on the job"
        },
        {
            "text": "I had started my dream of becoming an Interaction Designer"
        },
        {
            "text": "Working in the Justice on the Web team, I got to understand the day to day role of an interaction designer. I also got to work with the different professions within a cross functional team."
        },
        {
            "text": "I spent my learning and development time going through the resources Jen had put together for me. These were a mix of online training courses, books, videos and articles on different topics to do with User Centred Design."
        },
        {
            "text": "Using my learning and development budget, I joined Interaction Design Foundation, an online training website where I learnt about User experience, design thinking, basics of Accessibility, journey mapping."
        },
        {
            "text": "I also ordered some books, my favourite ones are-"
        },
        {
            "text": "Simple and usable by Giles Colborne\nDon’t Make Me Think by Steve Krug\nContent Design by Sarah Richards"
        },
        {
            "text": "When I came across accessibility, I had a special interest. Finding out about the barriers a person with a disability goes through seemed really unfair. I started to see things differently in my daily life. I am dyslexic and coming across accessibility also made me understand myself much more than I ever did. I started to believe in myself."
        },
        {
            "text": "4. Change can lead to opportunity"
        },
        {
            "text": "Change can be hard, but it is worth it if you follow your heart. It’s the same story for changing careers."
        },
        {
            "text": "I’ve been lucky to have the support of an understanding and supportive employer. Justice Digital has helped me move into a design career, providing training, space to grow and the support of mentors."
        },
        {
            "text": "Justice Digital has helped make my dream career become a reality."
        }
    ]
}