{
    "url": "https://defradigital.blog.gov.uk/2021/10/16/maintaining-quality-of-food-imports-on-this-world-food-day/",
    "title": "Maintaining quality of food imports on this World Food Day",
    "authors": [
        "Tony Hunt"
    ],
    "categories": [
        "Defra digital",
        "Defra Science and Innovation",
        "Defra services",
        "Digital transformation"
    ],
    "pub_date": "2021-10-16T02:00:15+01:00",
    "content": [
        {
            "text": "World Food Day is observed every year on October 16 to promote, raise awareness and tackle the issues of food quality and worldwide hunger, working towards their goal of eradicating hunger issues by 2030."
        },
        {
            "text": "A key element of this is ensuring food gets safely from farm to fork throughout the trade processes. As part of the UK's departure from the European Union (EU), the Digital Data and Technology Services (DDTS) Major Projects imports team have been working over the past few years to set up the Imports of Products, Animals, Food and Feed System (IPAFFS) which was launched in time for the end of the transition period in January 2021."
        },
        {
            "text": "To ensure importers were able to manage the new regulations, the UK agreed with the EU three stages of controls for moving goods from the EU to Great Britain. With the stages being introduced at the beginning of 2022, the number of import notifications is set to increase, meaning an increasing workload for everyone throughout the end-to-end journey including border inspectors, importers, and hauliers. We have been looking at how we can improve our services to alleviate pressures of increased notifications as the stages start coming into play."
        },
        {
            "heading": 2,
            "text": "Removing the need for paperwork\n"
        },
        {
            "text": "From an IT system perspective, we are building the capability to exchange data directly, securely and accurately with trade partners. This will mean that all data around an import will be entered into a digital system and stored along the journey, so will be in one place. This will result in notifications being produced electronically reducing the need for paperwork."
        },
        {
            "heading": 2,
            "text": "Ensuring quality and reducing food fraud\n"
        },
        {
            "text": "With World Food Day, there is an emphasis on maintaining the quality of food, and this e-notification system will ensure just that. By speeding up the trade flow with an e-notification system, produce is less likely to deteriorate due to being held up at ports. It will also reduce the cost for importers as they won’t need to increase workforces to manage the process."
        },
        {
            "text": "In the long term, e-notification gives us the opportunity to reduce food fraud, a key issue in maintaining the quality of food. With all documentation in one electronic system, imports can be monitored more closely. In the future, we would aim to have electronic pairing which means it would be possible to complete automated document checks to maintain quality of imports."
        },
        {
            "heading": 2,
            "text": "Becoming a world leading e-trader"
        },
        {
            "text": "With the number of people that will be affected by the changes coming to imports, it is crucial that we harness technology and apply what we have learned over the course of developing new systems following the UK's departure from the EU. As we are developing these systems, we are setting the UK up for an exciting time of becoming a world leading e-trader – watch this space!"
        },
        {
            "text": "Find out more about World Food Day and the ways you can get involved."
        },
        {
            "text": " "
        }
    ]
}