{
    "url": "https://despatch.blog.gov.uk/2021/10/06/adi-standards-checks-your-data-and-parameter-questions-answered/",
    "title": "ADI standards checks: your data and parameter questions answered",
    "authors": [
        "Laura Great Rex"
    ],
    "categories": [
        "Driving instructors",
        "Driving test",
        "Feature"
    ],
    "pub_date": "2021-10-06T11:17:52+01:00",
    "content": [
        {
            "text": "Hi, I’m Laura Great-Rex, I work for the enforcement directorate at DVSA. For those of you that don’t know me, I started my career as a driving instructor before joining DVSA to specialise in the Agency’s ADI-related work. Like you I am passionate about improving road safety."
        },
        {
            "text": "Leading the ADI team during the pandemic gave me an opportunity to look at how we could innovate and improve the service we deliver and support consumers through a lifetime of safe driving. I’ve used my experience to help create a new service that has been designed to support driving instructors and help them to develop and improve."
        },
        {
            "text": "In my blog post I want to explain more about the parameters and the data we are now using to help us to prioritise standards checks, what this means for you and how you can benefit from this."
        },
        {
            "heading": 2,
            "text": "But first… thank you"
        },
        {
            "text": "I know that the pandemic has been a difficult, uncertain time for you and your businesses. I know how hard you are working to meet the demand for lessons and prepare your pupils for their tests."
        },
        {
            "text": "Everyone at DVSA appreciates the role you are playing in helping the driver training industry and indeed our nation, to build back better."
        },
        {
            "heading": 2,
            "text": "Now for the data bit  "
        },
        {
            "text": "I know some ADIs are concerned that candidate test results are a rather blunt tool to use to decide who needs a standards check."
        },
        {
            "text": "Having been an ADI myself I know that every pupil is different but I also know that ADIs specialise in adapting their training to suit each customer. So, when an ADI presents a candidate for a driving test, whatever the journey they have been on to reach the point of being test ready, they are, in an ADI’s professional opinion, ready and safe to drive independently. Whilst we don't expect an ADI to have 100% pass rate (we all know nerves can play a part on the day) there is a pattern to the standards presented by higher performing ADIs and those that regularly present a lower standard."
        },
        {
            "text": "I want to reassure you that the data we are using to prioritise goes beyond a simple pass or fail result. During lockdown when standards checks had to be suspended, my team analysed thousands of pieces of data to create 4 parameters."
        },
        {
            "text": "We’re using the analysis of this data to prioritise standards checks. It is true that, to create a level playing field, we need you all to display your certificates to help us prioritise those ADIs that need some extra support. I believe if everyone supports this approach we can help pinpoint major concerns and recurring patterns fairly and reliably and let the majority of excellent ADIs get on with the business of instructing."
        },
        {
            "text": "To help give you confidence in the process and our intentions you can watch a video for more information on how we made some of the above decisions."
        },
        {
            "heading": 2,
            "text": "Your report, your development"
        },
        {
            "text": "You can apply for your ‘ADI driver test analysis report’ to see your current record by emailing adi.enforcement.analysis.request@dvsa.gov.uk. Please provide your name, PRN and the email address and phone number on your registered account."
        },
        {
            "text": "You can also request a standards check if you email PADI@dvsa.gov.uk detailing the reasons why."
        },
        {
            "heading": 2,
            "text": "My reassurance"
        },
        {
            "text": "There are 4 other important things I want to explain to help put your mind at ease."
        },
        {
            "heading": 2,
            "text": "Find out more"
        },
        {
            "text": "We have published additional guidance about your standards check and what it means. We have also emailed a letter from our ADI registrar to all ADIs on the register on 6 October 2021."
        },
        {
            "text": "If you have further questions, please speak to a local ADI examiner. Alternatively the ADI Enforcement Manager for the area will have their name and telephone number available in your local driving test centre."
        },
        {
            "heading": 2,
            "text": "Other useful information"
        },
        {
            "text": "We’ve developed information and resources I hope will support your development and help you help your pupils make their test count."
        },
        {
            "heading": 2,
            "text": "The top 10 reasons people fail the driving test"
        },
        {
            "text": "We’ve published the top 10 reasons for failing the driving test which you can use to help your pupils understand the common faults and knowledge and skills they need to work on to pass first time and how our examiners assess how safely they are driving."
        },
        {
            "text": "You can read more on the common reasons people fail their test."
        },
        {
            "heading": 2,
            "text": "Keep a record of your pupil’s driving lessons"
        },
        {
            "text": "You can use our form (sometimes called the driver’s record) to track your pupils' progress as they learn to drive."
        },
        {
            "text": "The records allow you to:"
        },
        {
            "text": "You can download it from GOV.UK."
        },
        {
            "text": "Your pupils can also record any extra practice they do so using a free form at GOV.UK. They can then talk to you about their experience in their next lesson."
        },
        {
            "heading": 2,
            "text": "Helping your pupils who fail"
        },
        {
            "text": "We know failing a driving test is extremely disappointing and your pupils will feel frustrated if they fail and have to wait longer for another test."
        },
        {
            "text": "To help pupils who fail their test, we have published guidance which explains the driving test report."
        },
        {
            "text": "You can use this with your pupils to better understand the results of their test, and get the information you need to help them better prepare for their next test."
        }
    ]
}