{
    "url": "https://dcmslibraries.blog.gov.uk/2021/10/06/booktrust-storytime-how-libraries-are-supporting-families-to-discover-reading/",
    "title": "BookTrust Storytime – how libraries are supporting families to discover reading.",
    "authors": [
        "Annie Crombie, Director of Programmes and Partnerships , BookTrust"
    ],
    "categories": [
        "Case study",
        "Outcome: communities"
    ],
    "pub_date": "2021-10-06T13:00:45+01:00",
    "content": [
        {
            "text": "Guest author Annie Crombie is Director of Programmes and Partnerships at BookTrust, the UK’s largest children’s reading charity."
        },
        {
            "heading": 2,
            "text": "What are we doing?"
        },
        {
            "text": "This Autumn we’re excited to be delivering a new national pilot, BookTrust Storytime. This aims to test new ways to support disadvantaged families with children aged 0-5 to enjoy books and stories together.  "
        },
        {
            "text": "Funded by Arts Council England, the pilot is a true collaboration, with partners across libraries, local authorities, the wider library sector including ASCEL, CILIP and Libraries Connected, and families involved at all stages: developing innovative ideas; testing concepts and their viability in library settings; and reviewing the design of resources and the overall family experience. "
        },
        {
            "text": "Every library in England has been invited to take part and can receive a pack of shortlisted books that have been chosen by an expert panel, for reading aloud. Alongside this there will be access to digital support and resources. 300 libraries across England will receive multiple copies of the shortlisted books and digital and physical resources for families to engage with in the library, including support in running live Storytime sessions as a fun way to engage families and demonstrate how to read aloud to children.  "
        },
        {
            "text": "A further ten libraries will work with us more intensively to trial innovative materials and activities such as collectable models, activity books, stickers and scavenger hunts in the library, all designed to demonstrate how reading and sharing stories can be fun and to inspire and engage new families.  All libraries can decide how best to use their books and resources, and many are developing new outreach programmes to try to reach new parts of their community. "
        },
        {
            "heading": 2,
            "text": "Why are we doing it?"
        },
        {
            "text": "The past year has been tough for libraries and the many families who rely on them so it’s timely that this Libraries Week we celebrate their amazing contribution and the lifeline they offered to so many children and families, providing community connections, as well as access to books during lockdowns.  "
        },
        {
            "text": "However there are too many families with young children for whom the books, support and services available in their local library do not play the part they could. We want to know how  we can inspire new families to explore what’s available in their local library and show why it is important.  "
        },
        {
            "text": "Research shows that sharing stories is invaluable for children in their early years and creates lifelong positive impact on health, wellbeing, creativity and education. Yet it is children from disadvantaged backgrounds who face the biggest barriers to developing a regular habit of reading. We want to learn more about how we can best support disadvantaged families to make visiting a library a regular and lasting part of family life. Understanding  how we can best support families is crucial and could make an important contribution to levelling up inequalities in society."
        },
        {
            "heading": 2,
            "text": "What happens next?"
        },
        {
            "text": "A core part of this year’s initiative is to learn more about what works so that we can build for future years. We are implementing a robust research plan to help us refine our hypotheses about what will engage new families and keep them reading and we will share this evidence and learning as widely as possible. "
        },
        {
            "text": "So watch this space! Over the coming weeks and months, you’ll start to see activities roll out in libraries, and from early next year we will be able to start sharing with you some of the learning and insight that’s emerging. "
        }
    ]
}