{
    "url": "https://companieshouse.blog.gov.uk/2021/10/06/embedding-the-operational-delivery-profession-odp-at-companies-house/",
    "title": "Embedding the Operational Delivery Profession (ODP) at Companies House",
    "authors": [
        "Lynn Cooper - Registrar of Companies for Northern Ireland"
    ],
    "categories": [
        "Companies House transformation",
        "Working at Companies House"
    ],
    "pub_date": "2021-10-06T14:50:05+01:00",
    "content": [
        {
            "text": "I joined Companies House as the new Registrar of Companies for Northern Ireland in March of this year. In addition to my core role, I have also taken on responsibility for leading the build and implementation of the Operational Delivery Profession (ODP) across our Customer Delivery Directorate."
        },
        {
            "text": "ODP, whose members either work directly with the public or support colleagues who do, is the largest profession in the Civil Service and Companies House, by a significant margin. The Customer Delivery Directorate in Companies House, as the name suggests, focuses on customer services. Although we’re at an early stage in our ODP journey, there’s recognition across all teams of the benefits this profession will bring, both for our staff and the interactions we have with customers."
        },
        {
            "text": "We have achieved a lot already. We have a diverse and passionate group of volunteer champions, and we work closely with both our learning and development and HR teams to maximise stakeholder engagement and build a sense of collective ownership."
        },
        {
            "text": "One of our first challenges was to streamline over 200 job titles we used to have into consistent themes, and develop corresponding role profiles. We spent a lot of time with colleagues around the directorate gathering information on each of the job roles and their responsibilities and duties, before analysing the data and making comparisons at each grade level."
        },
        {
            "text": "Both the ODP Career Framework and Success Profiles Framework were used extensively to aid a consistent approach when building each role profile. This is so the terms would be familiar and recognisable to both current staff and any new starters joining our organisation from other government departments. We thought it was complete but feedback from staff in our regional offices helped us to see they did not quite reflect the multi-skilled operational staff in these smaller teams, so we're running some dedicated workshops to make sure they're more inclusive. One lesson learned amongst many!"
        },
        {
            "heading": 2,
            "text": "ODP Fest"
        },
        {
            "text": "It’s equally important to celebrate our successes. Recently, all operational departments across the Civil Service were invited to participate in ODP Fest, a month-long programme of unique sessions and virtual exhibition stalls. Not only did Companies House have a stall but we were one of only 2 departments to also produce a video! Several of our champions recorded themselves with honest reflections of what ODP means to them. If any of you have ever made a video of yourself talking about a subject, you’ll know this is not an easy task, unless you happen to be a Hollywood actor of course! But the champions showed real determination and commitment to support the festival and went above and beyond, using personal time at the weekend to record themselves. The following Monday back at work, a few people admitted to needing several takes!"
        },
        {
            "text": "Another opportunity to support ODP Fest came when I was invited to facilitate a roundtable on ‘Things I Wish I Knew’, where senior leaders from across government shared their experiences and what they wish they had known earlier in their careers. I consider myself to be quite comfortable public speaking, even in a digital environment, but facilitating the session was definitely out of my comfort zone. And I had nerves beforehand! But the panel were amazing, displaying honesty and humility as they shared personal experiences from their careers. If you were not able to attend the session, I encourage you to listen to the recording. You can find it in the sessions tab of the ODP Fest homepage, under the date of 29 September 2021."
        },
        {
            "heading": 2,
            "text": "The future of ODP at Companies House"
        },
        {
            "text": "On the horizon, we’re getting ready to launch the first cohort of staff to undertake ODP qualifications, professionally underwritten by either City and Guilds or the Chartered Management Institute (depending on the level). Anticipation is already high as we have been raising brand awareness of ODP and promoting the qualifications at numerous internal meetings. The buzz is growing! I did a Level 6 certificate a few years ago in a previous department and I thoroughly recommend the qualifications as a great path for professional development. By studying for an ODP qualification, you will be building on the skills you require for your role and gaining new and transferable skills. Two of our HR colleagues are undertaking a significant piece of work to develop a comprehensive career framework and specific career pathways for each role."
        },
        {
            "text": "All this will help Companies House raise our professional standards, showcase the unique experiences and development opportunities ODP offers and empower all our staff to discover more options for each individual Civil Service career journey."
        }
    ]
}