{
    "url": "https://civilservice.blog.gov.uk/2021/10/06/how-grief-can-affect-our-mental-health/",
    "title": "How grief can affect our mental health",
    "authors": [
        "Adam Land, Senior Director at the Competition and Markets Authority"
    ],
    "categories": [
        "Uncategorized"
    ],
    "pub_date": "2021-10-06T10:08:36+00:00",
    "content": [
        {
            "heading": 3,
            "text": "Losing a loved one is devastating, but what is the impact on our mental health? To mark World Mental Health Day, Chris Murray shares his experience. This blog is part five in our Bereavement and Loss series by Adam Land. "
        },
        {
            "text": "Birmingham, July 2018. I was on Mental Health First Aid Instructor training when my Dad rang. I knew something wasn’t right because it’s unusual for my family to ring during work hours unless it’s urgent. I took the call. My Dad said it was my Grandma."
        },
        {
            "text": "Grandma had been in hospital for a few weeks and I’d travelled home to see her in June. She was in good spirits and nurses said she was improving; I was hopeful she’d soon be back home."
        },
        {
            "text": "Life support"
        },
        {
            "text": "What Dad told me wasn’t good news. Grandma had taken a turn for the worse and been placed on life support. He said I needed to rush home to say my goodbyes. Naturally, I felt distraught."
        },
        {
            "text": "Somehow, I steeled myself, gathered my belongings and travelled back to Middlesbrough. It felt like the longest journey of my life – and I’ve travelled around the world."
        },
        {
            "text": "That evening, as I was driven to hospital, I started to feel sick. I will always remember two sets of double doors before the private room where my grandma had been moved. My heart raced; I felt unsteady, as if I might faint. "
        },
        {
            "text": "As I approached the ward, I had a panic attack. The overwhelming fear and pain was unbearable, knowing that once I went through those doors, it would be the last time I got to spend time with my Grandma. "
        },
        {
            "text": "My sister comforted me and helped me focus. I sat at Grandma’s bedside for a couple of hours, held her hand and talked to her. That took a lot of composure and I tried to reign in my emotions, desperate not to trigger everyone. "
        },
        {
            "text": "Struggled"
        },
        {
            "text": "The next morning, I was woken by my dad telling me Grandma had passed away. I expected the news, but it didn’t make the blow any easier. The loss of my Grandma, who I was very close to, was difficult to deal with and I struggled to find a purpose or reason to motivate myself. "
        },
        {
            "text": "The next day was my birthday, but it no longer held any importance. My sister arrived with my young nieces and nephew, bringing birthday cards and presents. There was a pile of cards to open – but I couldn’t summon up any interest. I had to get out of bed for my nephew and nieces as they didn’t understand, and were desperate for me to open the presents. Trying to smile for them and not get upset was extremely difficult. My mum handed me one of the birthday cards. It was from my Grandma. "
        },
        {
            "text": "Mental health"
        },
        {
            "text": "After losing my grandma, I started to struggle with my mental health. The loss made me reflect on the point of life, and how to deal with pain when you lose someone you cherish. "
        },
        {
            "text": "I felt pressure from all directions as I struggled to come to terms with my loss. I constantly experienced futile thoughts that I could and should have done more. It exacerbated my clinical depression, anxiety and OCD conditions, and I felt little value in anything I did for some time. "
        },
        {
            "text": "Help and support from medical professionals and spending time with family and friends helped me through a very tough period, and I started to focus on my wellbeing. "
        },
        {
            "text": "One thing that helped me was the fact that I had previously qualified as a Mental Health First Aider (MHFA) as I’d experienced first-hand the benefits of having someone willing to listen. Having trained as an MHFA at a two-day internationally recognised course hosted by Mental Health First Aid England, I learned to recognise the symptoms of mental health issues, provide initial help, and offer information to guide someone towards seeking professional help. Looking out for others helped me look out for myself."
        },
        {
            "text": "The skills I had learned helped me find the strength to keep it together when I was struggling, and to understand how I was feeling and why."
        },
        {
            "text": "There are over 2500 MHFAs across the Civil Service, and any civil servant can become one. An MHFA’s role is to regularly talk to colleagues who approach us for advice, and look out for people. It’s very rewarding, makes a significant difference to real people, and expands the vital support network available to all civil servants."
        },
        {
            "text": "I find working as a Mental Health First Aid Instructor rewarding, and supporting others to become trained MHFAs makes a real difference, expanding the vital support network available to all civil servants."
        },
        {
            "text": "Adam Land: I want to thank Chris for sharing his story. Chris said,  “Sharing my story with others helped me feel like I had a purpose and what I was doing was important and by helping others, I was helping myself.”"
        },
        {
            "text": "CSHR has produced a series of resources, including a Guide for Managers to help support staff through Bereavement and Loss. "
        },
        {
            "text": "These are hosted on the Learning Platform for Government. "
        },
        {
            "text": "Mental Health First Aiders"
        },
        {
            "text": "We have Mental Health First Aiders in most departments in the Civil Service.  If you can’t find one in your unit, please don’t hesitate to contact one in a nearby unit."
        },
        {
            "text": "◼︎ Look out for the departmental First Aid notices "
        },
        {
            "text": "◼︎ The Mental Health First Aider tables on your departmental intranet will list all Mental Health First Aiders."
        }
    ]
}