{
    "url": "https://buyingforschools.blog.gov.uk/2021/10/06/schools-commercial-team-autumn-expo-2021/",
    "title": "Schools Commercial Team Autumn Expo 2021",
    "authors": [
        "Megan Thomas, Stakeholder and Engagement Manager, Schools Commercial Team"
    ],
    "categories": [
        "Services"
    ],
    "pub_date": "2021-10-06T14:17:27+01:00",
    "content": [
        {
            "text": "Megan Thomas, Stakeholder and Engagement Manager in the Schools Commercial Team explains what schools can look forward to at the upcoming Autumn Expo"
        },
        {
            "text": "Next week is an exciting week for the Schools Commercial Team, as we hold our Autumn Expo on Wednesday 13th and Thursday 14th October. The Autumn Expo will see twelve individual webinars over the course of the two days, discussing a range of the DfE approved Frameworks aimed at helping schools with a broad range of buying needs."
        },
        {
            "text": "Following on from the success of our Summer Expo in May 2021, the team felt it was vital to hold another Expo to help support schools at such a critical planning and buying time."
        },
        {
            "text": "The Schools Commercial Team support the DfE’s Schools Buying Strategy, working directly within schools and Schools Business Professionals, supporting them with their buying needs."
        },
        {
            "text": "One of the resources used widely is the ‘Find a Framework’ tool in which hosts 54 DfE approved Frameworks. Using these frameworks can benefit schools with not only monetary savings, but by saving time and increasing quality and compliance."
        },
        {
            "text": "The Engagement and Outreach Team host a series of webinars every academic year for School Business Professionals to join and ask questions directly of the framework supplier. These webinars are popular within the school sector, with over 1900 attendees joining the series of webinars hosted by the team last academic year."
        },
        {
            "text": "Dawn Price, School Business Manager at Blackwood School said how information received at the Summer Expo in May helped her identify savings against Staff Absence cover. Dawn told us: “I was aware of frameworks but not sure how to use them. I was concerned that if I started down that road, I would be committed to use it, however, I did not realise I could use them as a benchmark to compare”. Following the Summer Expo, Dawn approached CPC regarding the DfE approved Staff Absence framework and was able to achieve a saving of £600 compared to the standard price as a continuing customer."
        },
        {
            "text": "The Expos are an extension of the webinar series. The Autumn Expo will start on Wednesday with a session led by myself where we will discuss the Schools Buying Strategy, how the team can support schools with their buying needs and common themes running throughout the next term."
        },
        {
            "text": "Organising the Expo has been something which I have been heavily involved within since joining the team in the Summer and I am super excited to be launching the event on Wednesday with our Schools Buying Strategy session. Such webinars have really helped me understand and breakdown each Framework, so I know first-hand how useful they are. If any School Business Professionals, finance managers or Headteachers are curious about a Framework, I cannot recommend these sessions enough."
        },
        {
            "text": "The Autumn Expo is an especially exciting event for the team, as we see new suppliers join the line-up of sessions including NEPO Bloom, ESPO and Print Marketplace. These suppliers have recently joined the extensive list of DfE approved Frameworks and are looking forward to showcasing their frameworks to School Business Professionals at the event. They will also be joining a range of well-known suppliers – staff absence with Education Mutual, Everything ICT, and Heating systems and renewable technology with Fusion21, who are equally thrilled to be part of the Expo."
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": "If you do have any questions beforehand, please contact the team on: schoolscommerical@education.gov.uk"
        },
        {
            "text": "Don’t forget to follow us on LinkedIn for all the latest updates and information about future webinars: @BuyingforSchools"
        }
    ]
}