{
    "url": "https://gott.blog.gov.uk/2021/10/06/ukaeas-ten-new-programme/",
    "title": "UKAEA’s ‘Ten New’ programme",
    "authors": [
        "Knowledge Assets Team"
    ],
    "categories": [
        "Department for Business Energy and Industrial Strategy"
    ],
    "pub_date": "2021-10-06T09:42:53+01:00",
    "content": [
        {
            "text": "Fusion energy has real promise as a safe and sustainable source of low-carbon energy, and could be an important part of global energy in the future, alongside renewables such as solar and wind. The UK has real leadership in this area, primarily arising from the programmes at UK Atomic Energy Authority (UKAEA), including hosting the major EU Joint European Torus (JET) facility - the world’s most successful fusion experiment. In the course of leading this ground-breaking science, the UKAEA develops knowledge that has significant uses in fields outside fusion energy in areas, ranging from materials science to robotics. Recently, a team within UKAEA led by Tim Bestwick, Heather Lewtas and Abeer Abdalla completed a one-year structured programme to identify ten such innovations across their business - ‘Ten New’."
        },
        {
            "text": "What is fusion energy and why is it important?"
        },
        {
            "text": "Fusion Energy has the potential to produce a significant amount of energy from very small amounts of fuel. It involves heating a combination of hydrogen gases – deuterium and tritium – to very high temperatures (over 100 million degrees Celsius). The gas forms a plasma and a tiny fraction of the mass is converted into ‘fusion’ energy. So, a plasma with millions of these reactions every second could provide a huge amount of energy."
        },
        {
            "text": " Differences between Fission and Fusion energy "
        },
        {
            "text": " "
        },
        {
            "text": " Knowledge Assets team's recent visit to UKAEA:"
        },
        {
            "text": "The Knowledge Assets team were invited to join a demo day event in September. The ‘Ten New’ programme received 45 ideas from across the organisation, of which 22 were shortlisted on the basis of technical and market criteria and a final 10 were selected for showcasing at the demo event. The criteria for ‘Ten New’ projects were that they should (a) be new ideas, (b) have clear application outside fusion, with market potential and (c) be novel, and thus involve an inventive step."
        },
        {
            "text": "The Joint European Torus fusion device, operated at Culham by UKAEA. "
        },
        {
            "text": "Credit: EUROfusion"
        },
        {
            "text": "‘Ten New’ – UKAEA’s success so far: "
        },
        {
            "text": "UKAEA had filed 4 new patents on the back of this programme, with further patents pending. Examples of innovations identified included quicker ways of building a bioshield around a reactor, vine robotic technologies (low cost robots that stretch like a vine to reach inaccessible places), and techniques for extracting helium for supercooling (applications in cryogenics and quantum computing). It was really good to see the enthusiasm of the teams presenting, and in the audience, which included senior UKAEA colleagues, venture capital representatives, academics, as well as BEIS colleagues."
        },
        {
            "text": "‘Ten New’ - Two main barriers found:"
        },
        {
            "text": "The UKAEA team discussed two main barriers that they came across. The first was developing good understanding of the markets in which their ideas could have uses. Such markets could be quite niche, needing specialist insight - which is not easy to come by. Using consultancy companies had not proved effective - they typically lacked the specialist insight needed. However, engaging people with first-hand experience of specific industry applications had been found to be far more effective. A second barrier the UKAEA team highlighted was team members creating the time to do this kind of opportunity exploration work, when they had very demanding technical milestones to tackle in their ‘day job’."
        },
        {
            "text": "UKAEA’s spinouts:"
        },
        {
            "text": "The UKAEA already has a track record in creating diverse uses for its Intellectual Property - and it has had a small number of successful spin outs, including Tokomak Energy and Luffy AI. The former is a private sector fusion energy company, and the latter specialises in artificial intelligence for robots. These fields are seeing significant new private sector investment, alongside cornerstone knowledge and investment from the public sector. They are great examples of the UK as a scientific superpower."
        },
        {
            "text": " "
        }
    ]
}