{
    "url": "https://governmentscienceandengineering.blog.gov.uk/2023/11/13/a-week-in-the-life-of-a-private-secretary-to-the-gcsa/",
    "title": "A week in the life of a Private Secretary to the GCSA",
    "authors": [
        "Rebecca Budden"
    ],
    "categories": [
        "Blog Series",
        "Guest Blog",
        "Latest Stories"
    ],
    "pub_date": "2023-11-13T11:39:01+00:00",
    "content": [
        {
            "heading": 3,
            "text": "Japan and South Korea Edition"
        },
        {
            "heading": 4,
            "text": "Embarking on a Civil Service journey "
        },
        {
            "text": "When I first decided to pursue a science career in Government, I never imagined that my first job in the Civil Service would be as one of the Government Chief Scientific Adviser’s five private secretaries. And I certainly did not expect that 3 months into the job I would be accompanying the GCSA to Japan and the Republic of Korea!  "
        },
        {
            "text": "You could assume (as I did) that being a Private Secretary is an entirely administrative role, and that the opportunity to engage in ‘real science’ is limited, but that is not true for the GCSA’s private office. This role allows me to be part of some fascinating conversations, ranging from the Council for Science and Technology to the regular updates with the other 20 Chief Scientific Advisers in government departments.  "
        },
        {
            "heading": 4,
            "text": "Responsibilities of a Private Secretary"
        },
        {
            "text": "On our recent trip to Japan and the Republic of Korea, my role was to help create the GCSA’s agenda in cooperation with the Science Innovation Network from the FCDO and our own international team at the Government Office for Science. This included drafting the original programme, commissioning policy colleagues for detailed briefings, and a last-minute run to Fortnum & Mason for diplomatic gifts!"
        },
        {
            "text": "Once the trip has begun, my job transitions into ensuring the whole thing runs smoothly. I would have a detailed itinerary of exactly where to be at what time, and keeping to this usually involves a few angry background calls to taxis and a subtle cough to colleagues that are talking for too long…. Another critical role is ensuring that the GCSA and all her belongings, including her work laptop, folders and briefs make it from point A to point B."
        },
        {
            "heading": 4,
            "text": "The most rewarding aspects of the role"
        },
        {
            "text": "For me, the best part of this job will always be the amazing science I come across, such as on our visit to the Fugaku Supercomputer, the world’s second-fastest computer. We met with many Japanese and Korean ministry representatives, chatted to well-known scientists, such as Sir Paul Nurse, at receptions, had dinner with Korean AI experts and attended a conference where scientific advisers from across the globe were gathered. We discussed everything from AI to semiconductors, engineering biology to increasing the number of women in STEM."
        },
        {
            "heading": 4,
            "text": "Memorable moments "
        },
        {
            "text": "Despite having little experience in these areas, I am expected to write the notes in these meetings, on which my colleagues back in the UK depend on. Understanding these technical conversations can be a challenge but always an excellent learning opportunity! The whirlwind 10-day diplomatic trip ended in a truly British fashion, having a pint with the GCSA and Ambassador, one of the many fun memories I took home with me.  "
        },
        {
            "text": "If you ever get the opportunity to join a Private Office (particularly those for science-focused roles), I would absolutely recommend it."
        }
    ]
}