{
    "url": "https://educationhub.blog.gov.uk/2023/11/13/anti-bullying-week-2023-5-ways-we-support-schools-to-deal-with-bullying/",
    "title": "Anti-bullying week 2023: 5 ways we support schools to deal with bullying",
    "authors": [
        "mediaofficer"
    ],
    "categories": [
        "bullying",
        "Schools"
    ],
    "pub_date": "2023-11-13T17:02:09+00:00",
    "content": [
        {
            "text": "Bullying in school or college can have a devastating effect on children, young people and their families. We’re committed to helping schools tackle bullying, supporting them to create a calm environment where everyone feels safe."
        },
        {
            "text": "Here are 5 ways we’re helping schools to prevent bullying."
        },
        {
            "heading": 3,
            "text": "1. Relationships, sex and health education (RSHE)"
        },
        {
            "text": "Our relationships, sex and health education (RSHE) guidance supports schools to build a curriculum that reflects diversity of views and backgrounds. It encourages respect for others and teaches young people about healthy relationships."
        },
        {
            "text": "RSHE includes teaching about bullying, positive friendships, and equality."
        },
        {
            "text": "For example, young people might learn about different types of bullying, the impact of bullying, the responsibilities of bystanders to report bullying and how and where to get help."
        },
        {
            "heading": 3,
            "text": "2. Teaching about online safety"
        },
        {
            "text": "Schools should also teach young people about online safety, including what online bullying can look like and where to get help and support."
        },
        {
            "text": "Our Teaching Online Safety in Schools guidance aims to support schools to teach pupils how to stay safe online through a range of school subjects, including RSHE, Citizenship and Computing."
        },
        {
            "heading": 3,
            "text": "3. Guidance on bullying"
        },
        {
            "text": "Our Preventing and Tackling Bullying guidance provides further advice for schools on preventing and responding to bullying, including advice for head teachers and school staff on online bullying."
        },
        {
            "text": "As part of this, schools should have policies in place to help head teachers confidently deal with any behaviour that could disrupt a calm and welcoming learning environment."
        },
        {
            "heading": 3,
            "text": "4. Mental Health Support Teams (MHSTs)"
        },
        {
            "text": "Bullying can impact children’s mental health."
        },
        {
            "text": "We’re helping schools and colleges to support the mental health and wellbeing of young people by increasing the number of Mental Health Support Teams (MHSTs). These teams support schools and colleges to develop their approach to mental health and wellbeing, and to work with specialist services in the community."
        },
        {
            "text": "We’ve also introduced grants for schools and colleges to train a senior mental health lead. This training helps schools to provide support for children who are struggling with their mental wellbeing."
        },
        {
            "heading": 3,
            "text": "5. Behaviour Hubs"
        },
        {
            "text": "Improving behaviour can help create a calm learning environment that is free from bullying. We’ve recently updated our guidance on Behaviour in Schools, which provides advice on creating a positive, safe school culture."
        },
        {
            "text": "To build on this, we’re investing £10 million in Behaviour Hubs. These help schools that have exemplary positive behaviour cultures to work closely with other schools that want to turn around their behaviour, alongside access to central support and a taskforce of advisers."
        }
    ]
}