{
    "url": "https://food.blog.gov.uk/2023/11/13/chairs-stakeholder-message-highlighting-food-safety-and-standards-resource-challenges/",
    "title": "Chair's stakeholder message - Highlighting food safety and standards resource challenges",
    "authors": [
        "Professor Susan Jebb, FSA Chair"
    ],
    "categories": [
        "Our mission",
        "Partners"
    ],
    "pub_date": "2023-11-13T13:54:36+00:00",
    "content": [
        {
            "text": "Cymraeg"
        },
        {
            "text": "The Food Standards Agency and Food Standards Scotland have published their latest annual review of food standards in the UK."
        },
        {
            "text": "The report has found that food standards in the UK remained broadly stable last year despite significant pressures in the food system, including turbulence in global supply chains and cost of living pressures. There are many people in the food system working very hard to ensure food we can trust, but the report highlights vulnerabilities in workforce capacity which need to be addressed."
        },
        {
            "text": "There continues to be shortages of official vets and food inspectors, whose work is essential to protect animal health and welfare, and to keep food safe. We need skilled and motivated people to ensure that the right checks are carried out on our food. It takes time to develop this workforce and without action to recruit and retain more official veterinarians and local authority inspectors, it will not be possible to maintain our high food standards and support businesses to export their products."
        },
        {
            "text": "We’re asking governments across the UK, local authorities, professional bodies and industry, to work with us to address these challenges in the coming year so that we can maintain confidence in UK food both at home and abroad."
        },
        {
            "text": "If you have any thoughts or questions on the findings from our new report, please do let us know in the comments section below."
        },
        {
            "heading": 1,
            "text": "Tynnu sylw at heriau o ran adnoddau diogelwch a safonau bwyd"
        },
        {
            "text": "Mae’r Asiantaeth Safonau Bwyd (ASB) a Safonau Bwyd yr Alban wedi cyhoeddi eu hadolygiad blynyddol diweddaraf o safonau bwyd yn y DU."
        },
        {
            "text": "Canfu’r adroddiad fod safonau bwyd yn y DU wedi aros yn weddol sefydlog y llynedd er gwaetha’r pwysau sylweddol yn y system fwyd, gan gynnwys tarfu ar gadwyni cyflenwi byd-eang a phwysau costau byw. Mae llawer o bobl yn gweithio’n galed iawn yn y system fwyd i sicrhau bwyd y gallwn ymddiried ynddo, ond mae’r adroddiad yn tynnu sylw at wendidau y mae angen mynd i’r afael â nhw o ran capasiti’r gweithlu."
        },
        {
            "text": "Mae prinder milfeddygon swyddogol ac arolygwyr bwyd o hyd. Mae gwaith y swyddogion hyn yn hanfodol i ddiogelu iechyd a lles anifeiliaid ac i gadw bwyd yn ddiogel. Mae angen pobl fedrus a brwdfrydig arnom i sicrhau bod y gwiriadau cywir yn cael eu cynnal mewn perthynas â’n bwyd. Mae’n cymryd amser i ddatblygu’r gweithlu hwn a heb gamau i recriwtio a chadw mwy o filfeddygon swyddogol ac arolygwyr awdurdodau lleol, ni fydd yn bosib cynnal ein safonau bwyd uchel na chefnogi busnesau i allforio eu cynhyrchion."
        },
        {
            "text": "Rydym yn gofyn i lywodraethau ledled y DU, awdurdodau lleol, cyrff proffesiynol a’r diwydiant weithio gyda ni i fynd i’r afael â’r heriau hyn yn y flwyddyn sydd i ddod, fel y gallwn gynnal hyder ym mwyd y DU, gartref a thramor."
        },
        {
            "text": "Os oes gennych unrhyw sylwadau neu gwestiynau am ganfyddiadau ein hadroddiad newydd, rhowch wybod i ni yn yr adran sylwadau isod."
        }
    ]
}