{
    "url": "https://defrafarming.blog.gov.uk/2023/11/13/landscape-recovery-we-want-to-prove-that-this-works-and-it-can-work-across-the-country/",
    "title": "Landscape Recovery: ‘We want to prove that this works and it can work across the country’",
    "authors": [
        "The Evenlode Landscape Recovery Project Team"
    ],
    "categories": [
        "Payments to restore landscapes and ecosystems"
    ],
    "pub_date": "2023-11-13T12:49:37+00:00",
    "content": [
        {
            "text": "When you think of the Cotswolds Area of Outstanding Natural Beauty, rolling green hills and chocolate box villages immediately come to mind.  "
        },
        {
            "text": "However, for those of us who live and work here, the reality of flooding, soil erosion and poor water quality has become a problem that we can’t ignore. "
        },
        {
            "text": "We know because we’re the farmers working here.  "
        },
        {
            "text": "For a while we’d been thinking that there must be a way to improve things. It turns out that we were all having the same thoughts, but we didn’t know what we could do on our own given how busy we are on our farms. "
        },
        {
            "text": "Cue lockdown.  "
        },
        {
            "text": "Lockdown gave us the time and space to talk to each other. During that time, a couple of farmers in the area decided to improve the stream that ran through their land, a tributary to the River Evenlode. "
        },
        {
            "text": "Informal discussions about this work grew to include more farmers. Realising we could do more with a bigger network, we reached out to the wider farming community to start developing a way of land management that allows both farming and nature to thrive, all while mitigating the effects of climate change as much as possible. "
        },
        {
            "text": "Today, that cluster of like​-​minded farmers numbers 150 across the north-east Cotswolds. It’s one of the largest farming clusters of its kind in the UK. "
        },
        {
            "text": "In total, the North East Cotswolds Farmer Cluster (NECFC) covers more than 43,000 hectares of the River Evenlode catchment area, encompassing many small farms as well as larger land holdings. "
        },
        {
            "text": "It’s not just our numbers, our aims have grown too. We’ve tried to keep our end goal as simple as possible: to work and learn together to enhance the natural capital on our land, tackle the climate emergency and build more resilient food and farming businesses. "
        },
        {
            "heading": 2,
            "text": "Restoring streams and creating revenue streams"
        },
        {
            "text": "About a year ago, we were awarded £500,000 of Landscape Recovery project development funding from Defra. "
        },
        {
            "text": "Our project, Evenlode Landscape Recovery, will restore streams and rivers, protect threatened native species, improve natural habitats and adapt to climate change while continuing to productively farm and create new revenue streams for farmers. "
        },
        {
            "text": "Working together, the plan is to create and restore over 3,500 hectares of interconnected habitat throughout the river valleys. "
        },
        {
            "text": "The ambitious plan will include the restoration of over 1,000 hectares of floodplain meadows, the creation and restoration of 150 hectares of lakes, ponds and wetland habitats as well as 800 hectares of woodland habitat management, planting and natural regeneration. "
        },
        {
            "text": "The funding enabled us to set up a smaller project steering group of 4 people to lead the day-to-day work, but crucially, we haven’t created a boardroom full of managers and middlemen.  "
        },
        {
            "text": "We want this project to be farmer-led. We want to prove that this can work, and it can work across the country.  "
        },
        {
            "text": "We are here to prove productive farming in lowland England can go hand in hand with nature recovery, flood mitigation and carbon capture. "
        },
        {
            "text": "In just over a year, we want to be a blueprint of exactly how this would work in reality.    "
        },
        {
            "text": "And, if we can do it here, on an intensively farmed yet protected landscape with hundreds of different landlords and tenants which happens to also be in the UK’s largest Area of Outstanding Natural Beauty and all the restrictions which come with it – it can be done anywhere. "
        },
        {
            "text": "Following 2 years of project development, the implementation period will run for a minimum of 20 years. The scheme is one of the largest among 22 currently supported by government funding across England, and certainly involves the most farmers! "
        },
        {
            "text": "As well as scoping out new ways to farm and manage the land to help nature thrive and recover, the project has another vital element: money.  "
        },
        {
            "text": "To enable the adoption of our eventual recommendations we recognise that there needs to be a financial incentive. We believe that farmers should be able to make money by using their land in new ways – whether that’s natural flood management, carbon sequestration, restoring water quality or boosting biodiversity.  "
        },
        {
            "text": "Each of these important practices needs to start being considered financially valuable and economically necessary if we are to find a realistic solution to climate change, and not just things which are \"nice to have”.  "
        },
        {
            "heading": 2,
            "text": "Pilots within a pilot "
        },
        {
            "text": "Although much of the first 2 years is focused on planning and development, there have been plenty of spades in the ground already. "
        },
        {
            "text": "We have 2 specific mini-pilot projects already up and running designed to test new types of land management.  "
        },
        {
            "text": "One of these is at the top of the catchment where we have an area which is steep-sided and often sees extreme weather events hitting the ground, draining rapidly out through ditches people have built over the years and flooding the village of Moreton-in-Marsh downstream.   "
        },
        {
            "text": "The land has been farmed very sensitively but that hasn’t stopped Mor​e​ton from flooding. When you actually look at the land in that area there, you'll see something very interesting: the original channel which water used to run through before it was ditched was much wigglier and windier. "
        },
        {
            "text": "We are trying to reconnect some of the ditches to their original flood plains and hold the water back by re-wiggling the river down these channels.  "
        },
        {
            "text": "We are doing this in a way which is not limiting the amount of land we take out of production, and will create more wildlife in the meadows, as well as preventing water from flushing through so quickly that it creates floods.  "
        },
        {
            "text": "It’s an interesting example of what we are up to not just because of what is happening on the ground. This specific project also crosses different landowner and tenancy structures which are tricky to navigate at the best of times, so part of the work is to figure out how this aspect of change will run smoothly. "
        },
        {
            "text": "At the other end of the catchment, we have the One Field pilot which, as the name might suggest, focuses on just one field. The crops in this field are underwater 2 in every 3 years, but until now there has been no justification for taking it out of arable use with current prices and lack of appropriate stewardship scheme options. "
        },
        {
            "text": "We are testing what can be done if the field is considered valuable for other reasons and how a farmer might make money from it.  "
        },
        {
            "heading": 2,
            "text": "Conclusion "
        },
        {
            "text": "Although this is a project run for and by farmers, additional sources of funding will be crucial to its long-term success. We are actively discussing the project with a whole host of finance partners: from those seeking to buy ecosystem services, to those wanting to fund nature recovery at scale. They recognise that nature is the most valuable asset class of all. "
        },
        {
            "text": "We can’t stop farming for many, many different reasons. We don’t want to give up providing healthy nutritious food. But there won’t be a solution to climate change or nature collapse without landscape-scale recovery. This cannot and will not happen without farmers fighting for nature and working together.  "
        },
        {
            "text": "If you’d like to learn more about our project and follow our work, we’ll add links in the box below. Feel free to get in touch, either in the comments on this post or through our website. "
        }
    ]
}