{
    "url": "https://cddo.blog.gov.uk/2023/11/13/unlocking-excellence-the-digital-assessment-framework-unveiled/",
    "title": "Unlocking excellence: the Digital Assessment Framework unveiled",
    "authors": [
        "Angus Montgomery, Head of Strategic Projects, CDDO"
    ],
    "categories": [
        "CDDO",
        "Cross-government strategy",
        "Digital strategy"
    ],
    "pub_date": "2023-11-13T14:24:59+00:00",
    "content": [
        {
            "text": "The world of digital is ever evolving, with new opportunities and challenges presenting themselves around every corner. Therefore, it is crucial that government organisations have a digital function set up to meet the current and future digital world. "
        },
        {
            "text": "As the head of the Government Digital and Data function, the Central Digital and Data Office (CDDO) has a responsibility to define and shape what a successful digital organisation looks like, and how it operates. This is outlined in the Digital Functional Standard we published earlier this year. "
        },
        {
            "text": "CDDO is now publishing an accompanying Digital Assessment Framework, which will enable departments to benchmark their performance and progress against the standard."
        },
        {
            "heading": 3,
            "text": "About the Digital Assessment Framework"
        },
        {
            "text": "The Digital Assessment Framework is an ambitious, clear and simple framework for digital teams across government, helping them to gauge the maturity of their digital function, and pinpoint areas of development to deliver digital transformation."
        },
        {
            "text": "It has been developed in conjunction with departments, the central functions team, who help collaboration within organisations and across organisational boundaries to support effective delivery of policy, outcomes and services, and subject matter experts from across CDDO and beyond. "
        },
        {
            "text": "The framework encompasses a variety of practice areas, including:"
        },
        {
            "text": "It presents a three-tiered approach to assessing an organisation’s digital maturity: ‘Good’, ‘Better’, and ‘Best’. As a minimum, an organisation should be able to meet the framework’s ‘Good’ criteria. For example, in reference to technology management as a practice, a minimum (‘Good’) standard for organisations is to ensure that technology is available to be reused and shared across government organisations and functions. However, the highest performing organisations will also ensure that they are contributors to open source repositories and publish the majority of their code openly and publicly where possible."
        },
        {
            "text": "Ahead of publishing, the assessment framework has gone through a rigorous pilot process with a number of different organisations, including Met Office, Department of Health and Social Care, Department for Education, Office for National Statistics, Department for Business, Energy and Industrial Strategy, Cabinet Office, Department for Work and Pensions, Ministry of Defence and Department for Environment, Food and Rural Affairs, who have supported greatly with their feedback and thoughts. "
        },
        {
            "text": "During the pilot, we learned a lot about the diverse setups and evolving maturity of digital functions in different organisations across government. Feedback in the pilot helped us develop clear and comprehensive criteria, ensuring organisations can accurately assess and enhance their digital capabilities."
        },
        {
            "heading": 3,
            "text": "Using the assessment framework"
        },
        {
            "text": "While primarily intended as a self-assessment tool for organisations, there are critical elements within the framework that we'll be monitoring centrally at CDDO. This will help government meet Mission six of the government's digital roadmap where we commit that all departments will, as a minimum, meet the definition of “good” for product-centric organisational structures and agile ways of working when self-assessed against the new Digital Functional Standard."
        },
        {
            "text": "We’ll be monitoring progress through the Digital Dashboard - which is a joint dashboard between CDDO and departments that tracks against the strategy. Organisations who currently return the data commission will be also asked to update on product-centric and agile aspects of the Assessment Framework."
        },
        {
            "text": "By leveraging the Digital Dashboard, we’re not only measuring progress; we’re celebrating every achievement, big or small as we drive towards a more sustainable and digital government. Shining a light on best practices will amplify success and inspire all departments to greater heights."
        },
        {
            "heading": 3,
            "text": "Moving to an agile and efficient future "
        },
        {
            "text": "Publishing the Digital Assessment Framework marks a pivotal step in empowering each government department to elevate its digital capabilities. Through diligent self-assessment and the structured guidance offered by this framework, we aim to collectively steer organisations toward a future where agility and efficiency in the digital sphere become the norm. "
        },
        {
            "text": "Publishing the Digital Assessment Framework is just one step towards our vision for system reform, embarking on a journey towards a more efficient, empowered digital government that delivers better outcomes for all. Read more about how we plan to address the systemic obstacles to digital transformation, in Mission six of our Transforming for a Digital Future strategy."
        },
        {
            "text": "To get in touch with the System Reform team, contact: cddo-system-reform@digital.cabinet-office.gov.uk"
        },
        {
            "text": " "
        }
    ]
}