{
    "url": "https://icsdigital.blog.gov.uk/2025/05/06/a-philosophical-approach-to-learning-at-work/",
    "title": "A philosophical approach to learning at work",
    "authors": [
        "Mark Merifield"
    ],
    "categories": [
        "Skills and development"
    ],
    "pub_date": "2025-05-06T11:13:48+01:00",
    "content": [
        {
            "text": "It’s nearly Learning at Work Week, 12 to 16 May 2025. Last year I blogged about how I use LEGO and scenarios in our training. I’m running the sessions again this year. As I prepare for them, I’m struck by how much they have changed.   "
        },
        {
            "text": "The learning outcomes remain the same, and I’m still using the LEGO and the scenarios, but there are new references to new government strategies and new offers from ICS Digital (more on that soon). New ways of telling the older stories.  "
        },
        {
            "text": "I’m particularly pleased to have reduced two disciplines down to a single quote apiece; user centred design (“Wherever there is another human, there is an opportunity for kindness” – Seneca) and content design (“Say only what is necessary” – Epictetus).  "
        },
        {
            "text": "You may now be thinking, ‘hey, aren’t both quotes by Stoic philosophers?’. You are correct. "
        },
        {
            "text": "Learning was incredibly important to the Stoics, and I draw inspiration from them both in how I manage the courses I run, and in my own attitude and approach to learning.   "
        },
        {
            "text": "“Show that through (learning) you have learned to think better.” (Epictetus) "
        },
        {
            "text": "One of the outcomes I want to achieve through my sessions is to make the audience think about things differently: to give them a greater awareness to draw from. Something they can use, not just once they start working with us on digital services, but every day. I don’t do ‘everything agile in 30 minutes’, what I hope I do is sow seeds of further exploration and interest.  "
        },
        {
            "text": "That inquisitive nature I equally apply to the course development. Every conversation I have with a Digital colleague means I better understand how things work, and that gets fed back into the courses. "
        },
        {
            "text": "The more I know, the more everyone will know. The theme of this year is Get Connected; reach out, learn from everyone around you."
        },
        {
            "text": "“Act for the common good.” (Marcus Aurelius) "
        },
        {
            "text": "The other side of the people factor is feedback. There’s nothing like it to humble the soul, both when you’ve done well and not.  "
        },
        {
            "text": "It’s wonderful to know people enjoy my sessions, but the constructive feedback is what builds change. My ego has learned to suck it up, I don’t run these courses for my benefit. "
        },
        {
            "text": "“I am now on my way... to learn what I do not yet know.” (Marcus Aurelius) "
        },
        {
            "text": "I remember arguing with a colleague who was not attending a course in their field. They knew enough. They were already the professional. "
        },
        {
            "text": "Throughout his life, Marcus Aurelius, leader of one of the greatest Empires of the ancient world, continued to study under the philosophers of the day. Perhaps my colleague may have learned nothing, I hope not, but their knowledge could have brought more colour to the conversations we had that day. "
        },
        {
            "text": "As we approach Learning at Work Week it is a perfect opportunity to build our knowledge, to grow ourselves.   "
        },
        {
            "text": "“Decide to be extraordinary and do what you need to do now!” (Epictetus) "
        },
        {
            "text": "I do not think of myself as being guilty of being someone who ‘cannot know what they think they know’ (though I probably am). I am as guilty as anyone for putting training to the back when there seem to be so many greater work priorities. "
        },
        {
            "text": "Even when I imagine that if I knew more about a subject, I could handle it better, I might argue to myself that I can watch the video later or catch the course next time round. "
        },
        {
            "text": "But from writing this blog, I know that learning is immediate, is necessary, and is vital not just to me but to the impact I make on others who have taken the time to come to learn from me. "
        },
        {
            "text": "Those words from an almost 2000-year-old slave turned philosopher have become my internal axe against my inherent tendency toward procrastination. For this Learning at Work Week, I hope they have helped you too. "
        }
    ]
}