{
    "url": "https://nationalscreening.blog.gov.uk/2025/05/06/bursaries-available-for-2025-health-screening-module/",
    "title": "Bursaries available for 2025 health screening module ",
    "authors": [
        "Jo Harcombe"
    ],
    "categories": [
        "UK National Screening Committee"
    ],
    "pub_date": "2025-05-06T07:59:21+01:00",
    "content": [
        {
            "text": "The UK National Screening Committee (UK NSC), whose secretariat is housed within the Department of Health and Social Care (DHSC), is committed to making specialist screening education and training accessible for its stakeholders. "
        },
        {
            "text": "We are pleased to announce that we are once again able to offer a small number of bursaries to study the popular health screening module run at the University of Warwick. "
        },
        {
            "text": "Applications for this year’s module, to run from Monday 17 November to Friday 21 November 2025, will be scored against criteria including the applicant’s role and their involvement in screening. "
        },
        {
            "text": "Candidates for a bursary will also need to apply directly to the University of Warwick for a place on the course via its Health Screening Module page. "
        },
        {
            "text": "Options for accommodation are available from the Warwick team. "
        },
        {
            "heading": 2,
            "text": "More about the module"
        },
        {
            "text": "The health screening module is ideal for enhancing professional development and/or specialist learning in health screening. The course can be studied either as part of an MSc programme or a stand-alone specialist module. It is run by the University of Warwick Medical School and taught at master’s level (20 CAT points). "
        },
        {
            "text": "The course covers the underlying epidemiological principles of screening, as well as ethics and policy issues. It is ideal for anyone who makes screening policy, commissions, runs or evaluates screening programmes, locally and nationally. It would also enhance the learning of UK NSC stakeholders working in other areas of screening policy and practice. "
        },
        {
            "text": "The module provides an understanding of screening from a population perspective. It looks at how you determine when screening is an appropriate intervention, through the analysis of evidence, ethical, performance and economic issues, and how screening programmes can be effectively monitored and improved. "
        },
        {
            "text": "The module is taught as a face-to-face 5-day intensive study block that includes lectures, group work and supervision. The teaching and learning style is interactive, drawing on expert teachers from Warwick Medical School and the UK NSC. "
        },
        {
            "text": "We ask successful bursary students to become part of a highly valued expert cohort of screening professionals which the UK NSC and DHSC screening team can call on for advice and input on workstreams when needed. To support this, we are looking for a broad range of stakeholders to undertake this screening specific learning. "
        },
        {
            "text": "See Education and training for screening-related professionals for more information on education and training resources for people working in and with UK NSC-recommended NHS screening programmes. "
        },
        {
            "heading": 2,
            "text": "Keep up to date"
        },
        {
            "text": "The UK NSC blog provides up to date news from the UK NSC. You can register to receive updates direct to your inbox, so there is no need to keep checking for new articles. If you have any questions about this blog article, or about the work of the UK NSC, please email uknsc@dhsc.gov.uk. "
        }
    ]
}