{
    "url": "https://nationalscreening.blog.gov.uk/2025/05/06/consultation-opens-on-newborn-screening-for-metachromatic-leukodystrophy-mld/",
    "title": "Consultation opens on newborn screening for metachromatic leukodystrophy (MLD)",
    "authors": [
        "TJ Day"
    ],
    "categories": [
        "General"
    ],
    "pub_date": "2025-05-06T17:26:34+01:00",
    "content": [
        {
            "text": "The UK National Screening Committee (UK NSC) has today opened a consultation on evidence relating to newborn screening for metachromatic leukodystrophy (MLD)."
        },
        {
            "text": "The committee, which had not previously considered screening for this condition, commissioned an evidence map in 2023, to evaluate the volume and type of existing evidence relating to newborn screening for MLD. The evidence map concluded that MLD should be added to the list of conditions the UK NSC regularly reviews, and that the topic should be looked at in more detail via an evidence summary."
        },
        {
            "text": "The more detailed evidence summary, completed by Kleijnen Systematic Reviews Ltd this year, looked at evidence on the accuracy of tests that could be used to screen for MLD and the effectiveness of treatments for babies identified by screening. It also considered evidence on the cost effectiveness of screening for MLD."
        },
        {
            "text": "We are now asking stakeholders to provide feedback on the evidence summary and its conclusions."
        },
        {
            "heading": 2,
            "text": "Take part in the consultation"
        },
        {
            "text": "Please note: To respond to the consultation, either download the consultation response form on the MLD recommendation page (by clicking the ‘View documents’ button) and send it to uknsc@dhsc.gov.uk, or simply email your feedback directly to uknsc@dhsc.gov.uk."
        },
        {
            "text": "Do not use the ‘Submit comments’ button on the MLD recommendation page because the online comments form is currently not operational and your comments will not be received via this route."
        },
        {
            "heading": 2,
            "text": "About MLD"
        },
        {
            "text": "Metachromatic leukodystrophy (MLD) is a rare inherited condition, causing progressive nerve damage leading to muscle weakness, loss of coordination and mobility, and mental processes. The condition worsens over time."
        },
        {
            "text": "There are 3 types of MLD based on the age that symptoms start: late infantile (typically before 30 months of age), juvenile (typically between 3 and 16 years of age) and adult (typically after the age of 16). The late infantile form is the most severe and most common form of MLD, comprising 50 to 60% of cases. It is estimated that around 1 in every 40,000 babies born in the UK will have MLD."
        },
        {
            "text": "The National Institute for Health and Care Excellence (NICE) recommends a gene therapy (Libmeldy®) for the treatment of pre-symptomatic children with late infantile or early juvenile MLD. It is also approved for children with early MLD who have early signs or symptoms of the condition but who can still walk independently and have no decline in mental processes."
        },
        {
            "heading": 2,
            "text": "The evidence"
        },
        {
            "text": "The 2025 evidence summary looked at research published since 2012, and found limited evidence in relation to the criteria considered."
        },
        {
            "text": "The summary concluded that key areas of uncertainty remain regarding the best way to identify babies with MLD, and whether identification of babies with MLD through newborn screening results in more effective treatment with better long-term outcomes. Further work is needed on the evaluation of algorithms for MLD screening, and the establishment of cut-off values for use in the UK population. (A cut-off value is the point at which the test gives a positive or negative result for the condition.) The review noted that evidence generation is still at a relatively early stage and ongoing pilot studies and/or data collection from the first implemented screening programme (in Norway) are likely to inform future evidence reviews."
        },
        {
            "heading": 2,
            "text": "Keep up to date "
        },
        {
            "text": "The UK NSC blog provides up to date news from the UK NSC. You can register to receive updates direct to your inbox, so there is no need to keep checking for new articles. If you have any questions about this blog article, or about the work of the UK NSC, please email uknsc@dhsc.gov.uk. "
        }
    ]
}