{
    "url": "https://socialcare.blog.gov.uk/2025/05/06/creating-the-adult-social-care-workforce-we-need/",
    "title": "Creating the adult social care workforce we need ",
    "authors": [
        "Deborah Sturdy"
    ],
    "categories": [
        "Care and support",
        "Carers",
        "Digital skills and technologies",
        "Technology and data",
        "Workforce"
    ],
    "pub_date": "2025-05-06T09:14:38+00:00",
    "content": [
        {
            "heading": 2,
            "text": "More opportunities for career progression in adult social care"
        },
        {
            "text": "Developing the social care workforce is paramount to success and delivering the ambition for change we want and need to see in adult social care. On 9 April, Secretary of State, Wes Streeting gave a speech to Unison's annual health conference."
        },
        {
            "text": "There, he announced the first universal career structure for adult social care, setting out a further four job role categories to give care workers opportunities to progress in their career."
        },
        {
            "text": "These developments offer a great opportunity to enhance the essential skills of the care workforce, allowing them to build a portfolio of skills, knowledge and abilities that improve the support they provide to those they care for."
        },
        {
            "text": "The development of the Care Workforce Pathway is a milestone for the sector. The first universal career structure for adult social care, it has been co-developed with representatives from the workforce and people who access care."
        },
        {
            "text": "It sets out the knowledge, skills, values and behaviours needed at different levels, with recommended learning and development"
        },
        {
            "text": "Utilising the capability of professional carers brings together the potential to grow into careers previously not thought possible. Professions include Nurse Associate, Registered Nurse, Therapy Assistant, Occupational Therapist, Physiotherapist or Social Worker."
        },
        {
            "text": "Building skills is also about building confidence and in doing so, creating opportunities for careers."
        },
        {
            "text": "The announcement and funding to underpin the development of new skills is welcome for several reasons."
        },
        {
            "text": "Firstly, it recognises the value placed on this critical system workforce. Thus, creating new pathways and attracting more people to consider a fulfilling and interesting career across social care."
        },
        {
            "text": "Secondly, it reaffirms the vital role of adult social care in society and highlights the difference made by a diverse set of roles and settings. For example"
        },
        {
            "text": "Thirdly, the announcement was a reminder – if one was needed – that, as more of us live longer, often with one or more health conditions, the level and complexity of social care roles is increasing. 20 or 30 years ago, a qualification may have been seen as secondary to “softer” skills, such as building trust and working alongside people."
        },
        {
            "text": "Nowadays, recognised qualifications are becoming more important to equip staff with the right skills and knowledge to provide condition-specific support and increasingly, working alongside healthcare professionals to deliver delegated healthcare."
        },
        {
            "text": "Image by freepik"
        },
        {
            "heading": 2,
            "text": "Refreshed Care Certificate Standards and the use of technology"
        },
        {
            "text": "Starting a career in care needs essential underpinning knowledge."
        },
        {
            "text": "For the first time since its creation in 2015, the Care Certificate Standards, provides a baseline standard for care and the training, supervision and assessment new care workers should receive during their induction to care."
        },
        {
            "text": "It also provides assurance across the sector, reducing the need for care workers to repeat training when they change employers. This will be the introduction and entry for all and the baseline from which careers can be built."
        },
        {
            "text": "Utilising technology will continue to be the bedrock of service developments in the future. These will help deliver better quality care which is more efficient for the person, the care worker and the wider health and care system."
        },
        {
            "text": "The impact of the use of acoustic monitoring at Care UK has transformed the way in which it supports people during the vulnerable first few months during their transition to care and risk of falls."
        },
        {
            "text": "The new level 5 digital skills qualification is part of the £12 million LDSS to support adult social care employers to provide their staff with quality assured, up to date training, enabling them to develop new skills and qualifications and take advantage of digital innovation and new technology."
        },
        {
            "heading": 2,
            "text": "Access tools and resources now"
        },
        {
            "text": "Finally, delivering these reforms represents many months of work by colleagues in the Department of Health and Social Care, Skills for Care, and our sector partners, including 30 Early Adopters who have helped test and refine the Workforce Pathway."
        },
        {
            "text": "Findings from this programme have helped produce a suite of tools and resources, in partnership with Skills for Care and PA Consulting, designed to support adult social care employers to adopt the Pathway."
        },
        {
            "text": "Although aimed primarily at leaders and managers, there are also resources for team leaders and people wanting to plan their own development. We would encourage you to visit SfC care workforce pathway page  to see what benefits the Pathway could have for your organisation, your career and on the quality of care and support you provide."
        }
    ]
}