{
    "url": "https://traderemedies.blog.gov.uk/2025/05/06/listening-to-our-stakeholders-how-feedback-is-shaping-the-work-of-the-trade-remedies-authority/",
    "title": "Listening to our stakeholders: how feedback is shaping the work of the Trade Remedies Authority  ",
    "authors": [
        "TRA Communications"
    ],
    "categories": [
        "Engagement",
        "Pre-application office"
    ],
    "pub_date": "2025-05-06T16:12:42+01:00",
    "content": [
        {
            "text": "Every year the Trade Remedies Authority (TRA) undertakes independent research to understand how people and organisations we work with most closely rate us. "
        },
        {
            "text": "We listen to ways they tell us we can improve, and what our stakeholders expect from us."
        },
        {
            "text": "This is all part of our wider commitment to being proportional, impartial and transparent, and focused on improving our effectiveness and efficiency of our investigations. "
        },
        {
            "text": "Who we spoke to "
        },
        {
            "text": "Interviews were held with a range of key stakeholders from across the UK and internationally such as UK producers, importers, and businesses "
        },
        {
            "text": "We captured views from those with direct experience of our investigations as well as those who interact with our work more broadly. "
        },
        {
            "text": "What we heard "
        },
        {
            "text": "Stakeholders spoke positively about the TRA’s role, values and approach. "
        },
        {
            "text": "“The TRA is fair, responsive and quick to learn.” "
        },
        {
            "text": "We were described as impartial, independent and increasingly effective. Our tone, openness and willingness to engage were highlighted as strengths. The Pre-Application Office was praised for being accessible and helpful. "
        },
        {
            "text": "At the same time, stakeholders challenged us to go further. "
        },
        {
            "text": "“Our independence is our strength, but our visibility is our challenge.” "
        },
        {
            "text": "“The TRA is approachable and open, but the process still feels heavy for SMEs.” "
        },
        {
            "text": "Investigations were often seen as complex and time-consuming. Some sectors feel less clear about who we are and how we work. Many want clearer guidance, stronger communication, and a simpler path to participation. "
        },
        {
            "text": "What we’re doing next "
        },
        {
            "text": "We’re taking this feedback seriously and have already started to act. Some of the changes we are making are: "
        },
        {
            "text": "Supporting government priorities "
        },
        {
            "text": "This feedback supports wider government priorities. Following recent announcements from the Chancellor, the TRA is preparing to play a bigger role in helping protect British businesses against unfair trading practices. "
        },
        {
            "text": "We’re increasing our capacity and pace to match this ambition, accelerating our work on case streamlining, external partnerships, and advanced data monitoring to better identify and respond to potential import surges. You can read the Chancellor’s announcement regarding plans to maintain level playing field for British business here. "
        },
        {
            "text": "Get in touch "
        },
        {
            "text": "This research isn’t a one-off. Listening to our stakeholders is a core part of how we work, and how we get better. We welcome your feedback at any time by emailing us at contact@traderemedies.gov.uk.  "
        },
        {
            "text": "We’re grateful to those who took the time to share their views. Your feedback is shaping how we communicate, improve, and deliver on our responsibilities.  "
        }
    ]
}