{
    "url": "https://vets.blog.gov.uk/2025/05/06/world-veterinary-day-2025-moulding-your-professional-identity/",
    "title": "World Veterinary Day 2025: moulding your professional identity",
    "authors": [
        "Government Vets Blog Team"
    ],
    "categories": [
        "Government Veterinary Services"
    ],
    "pub_date": "2025-05-06T09:55:10+01:00",
    "content": [
        {
            "text": "By Sion Rowlands"
        },
        {
            "text": "This July, 28 years will have passed since I saw my name at the bottom of a lengthy list of successful veterinary graduates at Liverpool University. I was far from sure what that meant then, and to this day, I continue to question if I, and others who saw fit to pass me, made the right decision? Or did I take the spot of another, one far more worthy?"
        },
        {
            "text": "Similar questions and a pernicious stream of self-doubt are all too familiar to us vets as we toil through our working lives nurturing and occasionally battling with our professional identify. Somewhat myopically maybe, but I am going to propose that the veterinary profession has seen more changes concentrated into the last two decades or so than many other professions combined. Changes and influences, both within and outside the profession, which have challenged the most steadfast. I am proud to be part of a family that has so much resilience."
        },
        {
            "heading": 3,
            "text": "Reflecting on career identity and decisions"
        },
        {
            "text": "I had never consciously reflected on what my professional identify was until recently. Sometimes defined as “the attitudes, values, knowledge, beliefs and skills shared with others within a professional group” (Adams et al 2019), or perhaps more easily summarised as what your peers would say about you after leaving a room. And what do I think my peers would say about me, or, at least, what would I like them to say? I would hope integrity, honesty and fairness would be some of the values listed, somewhat ambitious you might think, but these are often the yardstick values by which I measure others."
        },
        {
            "text": "I now reflect on the larger decisions and options that I have made, that have shaped my professional identity. From my early days working in mixed practice, periods working abroad, my days as an employer, and in the numbered roles as a Government Vet in the Animal Plant Health Agency (APHA), I have always called on my core values and lent into my default attributes. More recently, as a burgeoning veterinary educator, it has been invaluable to reflect on how my behaviours can incrementally influence others."
        },
        {
            "heading": 3,
            "text": "Working at APHA"
        },
        {
            "text": "My career in APHA has been immeasurably rewarding. I have found some roles and other roles seemed to have found me; ones that have permitted my professional identify to flourish. I mentioned earlier the changes in our profession: veterinary public health is a robust vehicle for so many of these changes that have global impact. As you read this, hundreds of my colleagues across APHA and wider government (veterinary, technical, scientific, enabling and support staff), many with similar values to my own, face daily challenges with diseases that have proven to have profound impacts. So many of these diligent and committed individuals, and teams, are not in the mainstream lens, but their actions are worthy of recognition."
        },
        {
            "heading": 3,
            "text": "Future professional goals"
        },
        {
            "text": "And what of the future? How will I choose to steer my ship in my remaining professional years? Two years ago, I stumbled across an invite issued by a charity to protect some white rhinos. Today I am a trustee for the said UK based charity that encourages and drives mutual interest to parts of the world under the umbrella of conservation, including the plight of the vulnerable, if unwilling, rhinoceros. In June I will be leading a team of volunteers, including my 16-year-old son, to a remote part of South Africa to reunite with a small family team who have decided to sacrifice everything in the name of protecting their cohort of white rhinos."
        },
        {
            "text": "I will leave it to others to judge if my actions and the identity I have developed during my career to date have had any impact. I know this: I have enjoyed the journey so far!"
        },
        {
            "text": "You can find out more about our current veterinary vacancies within APHA at https://aphavets.co.uk/vacancies/"
        },
        {
            "text": "References:"
        },
        {
            "text": "Adams, K., Hearn, S., Sturgis, P. (2019) ‘Investigating the factors influencing professional identity of first-year health and social care students’, Learning in Health and Social Care, 5 (2), 55-68."
        }
    ]
}