{
    "url": "https://homeofficemedia.blog.gov.uk/2025/06/25/fact-sheet-desistance-and-disengagement-programme/",
    "title": "Factsheet: Desistance and Disengagement Programme",
    "authors": [
        "Home Office news team"
    ],
    "categories": [
        "Fact sheet"
    ],
    "pub_date": "2025-06-25T16:31:45+01:00",
    "content": [
        {
            "text": "This factsheet was updated in June 2025."
        },
        {
            "text": "The purpose of the Desistance and Disengagement Programme (DDP) is to help manage the risk of individuals who have been involved in terrorism or terrorism related activity.  The programme works to reduce the risk they pose to the UK by providing one-to-one rehabilitative support using specialist intervention providers."
        },
        {
            "text": "What is the DDP?"
        },
        {
            "text": "What does the DDP do?"
        },
        {
            "text": "How does it work?"
        },
        {
            "text": "How are individuals on the programme overseen?"
        },
        {
            "text": "Do individuals have to take part in DDP?"
        },
        {
            "text": "How many participants has DDP engaged?"
        },
        {
            "text": "Figures correct as at 25/06/2025."
        },
        {
            "text": "The data in the above table includes all active DDP participants who had received at least one intervention session on the programme during the year."
        },
        {
            "text": "Please note, previous DDP participant data may differ from the above due to the way the information was collated for that period, how duplicate cases were treated and how an ‘active’ participant was defined."
        },
        {
            "text": "Prevent"
        },
        {
            "text": "This factsheet was updated in December 2024."
        },
        {
            "heading": 5,
            "text": "Footnotes"
        },
        {
            "heading": 5,
            "text": "[1] TPIMs are special civil measures imposed on individuals to limit the capability, and improve the monitoring of, individuals whose terrorist risk cannot be effectively managed by criminal prosecution."
        },
        {
            "heading": 5,
            "text": "TEOs are imposed on individuals who are reasonably suspected to have been involved in terrorism-related activity abroad."
        },
        {
            "heading": 5,
            "text": "[2] Some offences not included in the Terrorism Acts can also be classed as having a ‘terrorist connection’ to ensure the criminal charges properly reflect the conduct concerned. These include charges such as murder or causing an explosion."
        },
        {
            "heading": 5,
            "text": "[3] The Criminal Justice Act 2003 (“CJA 2003”) provides for the establishment of Multi-Agency Public Protection Arrangements (“MAPPA”) in each of the 42 criminal justice areas in England and Wales. These are designed to protect the public, including previous victims of crime, from serious harm by sexual and violent offenders. They require the local criminal justice agencies and other bodies dealing with offenders to work together in partnership in dealing with these offenders."
        }
    ]
}