{
    "url": "https://technology.blog.gov.uk/2025/06/25/from-westminster-to-york-reflections-on-building-a-modern-digital-government/",
    "title": "From Westminster to York: Reflections on Building a Modern Digital Government",
    "authors": [
        "Daniel Benton, Lead Technologist, GDS"
    ],
    "categories": [
        "Data",
        "Event",
        "Open Standards",
        "Transformation"
    ],
    "pub_date": "2025-06-25T11:15:57+01:00",
    "content": [
        {
            "text": "As the Lead Technologist in the Technology Management Team within the Office of the Chief Technology Officer (OCTO) at GDS, I have over 20 years of experience in delivering digital transformation across the public sector, non-profit, finance, and consulting sectors. Last year, I was a core team member of the State of Digital Government review that was laid before Parliament in January 2025."
        },
        {
            "text": "I had the opportunity last week to step away from my usual routine, get out of London, and connect with colleagues on the frontline of digital transformation in government. As well as serving as a reminder of why the work we’re all doing to build a better digital government is so vital, this busy day full of meetings and travel made me realise how important it is to interact in person with those involved with creating the future of digital services."
        },
        {
            "heading": 3,
            "text": "Defra"
        },
        {
            "text": "My day started with a visit to the Department for Environment, Food and Rural Affairs (Defra) in York, where I joined their architect community to share insights from the State of Digital Government review. This community is dedicated to uniting architects across Defra and its arm's length bodies to promote collaboration, encourage shared thinking, and address challenges related to cloud diversity and alignment with established government standards."
        },
        {
            "text": "I worked on the State of Digital Government review, and preparing for my talk at Defra initially felt a bit like revisiting last year’s work. But as the day unfolded, I was reminded that the report’s findings aren’t just theoretical - they reflect real, systemic challenges that public servants are working hard to address every day."
        },
        {
            "text": "What stood out was how seriously Defra’s architects are engaging with these issues. I heard how they approached selecting a new platform for their content community with a clear focus on user needs, which is an encouraging sign of thoughtful, user-centred design. Their commitment to building robust, user-focused systems extends even to internal tools, which can often be where the real culture of digital maturity shows."
        },
        {
            "text": "I was particularly interested to learn how they’re using their Core Delivery Platform, and not just to build services more efficiently, but to give assurance teams vital insight into how services are performing against standards. This kind of visibility helps them identify where targeted support can have the greatest impact."
        },
        {
            "heading": 3,
            "text": "Active Travel England"
        },
        {
            "text": "In the afternoon, I visited Active Travel England, who are an executive agency which was set up in 2022 to encourage healthy, physical alternatives to local travel. "
        },
        {
            "text": "Here I was able to engage with their talented and driven digital team who, despite their clear commitment to modern digital standards and a strong appetite for sharing and reuse, grapple with many of the systemic blockers highlighted in the State of Digital Government review. "
        },
        {
            "text": "We also discussed ways to help newly-onboarded government agencies, such as creating robust digital infrastructures to help forward-thinking digital teams concentrate on delivering services. This was a really positive talk that highlighted the importance of supporting our agencies in overcoming barriers."
        },
        {
            "heading": 3,
            "text": "Reflections on the future"
        },
        {
            "text": "The challenges those I spoke to brought up reflect the issues that the Blueprint for a Modern Digital Government aims to tackle. It was encouraging to discover that the State of Digital Government review covered the areas needing improvement, and that the Blueprint was, many felt, the way forward."
        },
        {
            "text": "I was reminded about how the Blueprint isn’t just about adopting new technologies, it’s about reshaping how the public sector works at its core. Its emphasis on joining up services so that people don’t have to repeat the same information time and again, and its focus on investing in the right skills and leadership are essential foundations to a modern government. It’s about creating the conditions in which the kind of talent and commitment I saw at Defra and Active Travel England can thrive."
        },
        {
            "text": "My day in York was a powerful reminder that while reports and strategies are important, they’re only part of the picture. Real progress is driven by the dedication of people across the public sector. This day also reinforced to me the value of getting out there, listening to those who deliver services, and understanding their realities. It’s these direct conversations that bring the challenges, and opportunities, into sharp focus, and can be fuel for our collective ambition to build a digital government that truly serves the public."
        },
        {
            "heading": 3,
            "text": "Want to bring the conversation to your team?"
        },
        {
            "text": "If you're working on digital transformation in the public sector and would find it valuable to share insights, discuss challenges, or explore how the State of Digital Government review and Blueprint for a Modern Digital Government applies to your work, we'd love to hear from you at: technology.management@digital.cabinet-office.gov.uk."
        },
        {
            "text": "Get in touch to arrange a visit. Let’s keep connecting the dots between strategy and delivery, and help build a modern digital government that works for everyone."
        }
    ]
}