{
    "url": "https://kingsawards.blog.gov.uk/2025/06/25/phmg-the-kings-award-for-enterprise-in-international-trade/",
    "title": "PHMG – The King’s Award for Enterprise in International Trade",
    "authors": [
        "The Queen's Awards for Enterprise"
    ],
    "categories": [
        "Uncategorized"
    ],
    "pub_date": "2025-06-25T14:54:03+01:00",
    "content": [
        {
            "text": "For over 25 years, PHMG has helped businesses around the world sound as good as they look. Founded in 1998 in a Chester portacabin, we’ve grown into the world’s leading audio branding agency — creating bespoke sound identities that help over 37,000 companies connect more meaningfully with their customers."
        },
        {
            "text": "From small businesses to global giants like Manchester United, Adidas and TAG Heuer, our work brings brand voices to life through telephone systems, social media, advertising and more. Headquartered in Manchester with a major office in Chicago, PHMG now exports over 80% of its services internationally, with a strong focus on North America."
        },
        {
            "text": "This year, we’re proud to have been recognised with one of the most prestigious business honours in the UK."
        },
        {
            "heading": 2,
            "text": "Which award did you win?"
        },
        {
            "text": "We received The King’s Award for Enterprise in International Trade. This award recognises our outstanding success in overseas markets, where we’ve demonstrated sustained, year-on-year growth over several years"
        },
        {
            "heading": 2,
            "text": "What does your business do?"
        },
        {
            "text": "PHMG empowers businesses to connect with their customers through the power of sound. We craft bespoke audio identities, including exclusive music, professional voiceovers, and tailored messaging, that resonate across every customer touchpoint. From telephone systems to digital platforms, our fully managed services ensure brands communicate clearly, consistently and creatively."
        },
        {
            "text": "As the world of customer engagement evolves, so do we. Our commitment is to stay ahead, continually refining our offerings to meet the dynamic needs of businesses aiming to make meaningful connections in an ever-changing landscape."
        },
        {
            "heading": 2,
            "text": "Why did you apply for the award?"
        },
        {
            "text": "Our application was driven by a desire to celebrate our significant international growth — and the people behind it. Our international expansion has gathered real momentum, with year-on-year growth driving us into more than 50 global markets."
        },
        {
            "text": "We didn’t just meet the benchmarks for The King’s Award — we surpassed them, with overseas earnings and growth levels that outpaced expectations for businesses of our size and sector."
        },
        {
            "heading": 2,
            "text": "What does it mean to win a King’s Award for Enterprise?"
        },
        {
            "text": "This recognition is a proud milestone for our company and a celebration of the creativity, ambition and commitment that drives our team forward."
        },
        {
            "text": "The day we received The King’s Award was a double celebration, it also marked our transition to an Employee Ownership Trust (EOT), putting the future of PHMG firmly in the hands of our people. Both milestones reflect who we are at our core: independent, creative, and committed to building long-term success that includes everyone."
        },
        {
            "text": "Apply for The King's Awards for Enterprise 2026 round here: The King's Awards for Enterprise: About the awards - GOV.UK"
        }
    ]
}