{
    "url": "https://insidedio.blog.gov.uk/2025/06/25/reserves-day-a-life-less-ordinary/",
    "title": "Reserves Day: A life less ordinary ",
    "authors": [
        "Charles Bentley"
    ],
    "categories": [
        "Working at DIO"
    ],
    "pub_date": "2025-06-25T11:13:46+00:00",
    "content": [
        {
            "text": "When people see me at my desk as the Logistic Support Officer for the Wales and West Defence Training Estate, they might not realise that I also serve as Battery Commander of 211 Battery in 104 Regiment Royal Artillery. For me, Reserves Day during Armed Forces Week is a chance to reflect on how these two roles complement each other and the value that reservists bring to defence. "
        },
        {
            "heading": 2,
            "text": "Leaving the Regular Army and joining the Army Reserve"
        },
        {
            "text": "After 30 years in the Regular Army, culminating as a Staff Officer at Allied Rapid Reaction Corps (ARRC), I wasn't quite ready to hang up my uniform completely. The Reserve Army offered me the perfect opportunity to continue what I describe as \"a life less ordinary\" – albeit on a part-time basis. "
        },
        {
            "text": "Two years into my reservist journey, I've found that maintaining this connection to military life brings benefits that flow in both directions. As an MOD Civil Servant, it's vital that I maintain a broad understanding of Defence. My Reserve service allows me to do this from the perspective of the very people my Civil Service role supports daily. "
        },
        {
            "text": "The value reservists bring to wider Defence cannot be overstated. At the most basic level, the Reserve Army adds mass to the Regular Army – turning what I like to call a \"triathlete\" into a \"power lifter that can run.\" But perhaps more importantly, reservists bring unique knowledge, skills and experience from their civilian careers that add tremendous value to Defence capabilities. In my own Battery, I command soldiers who work in the civilian drone industry, bringing expertise that has clear utility for military operations. "
        },
        {
            "text": "This cross-pollination of skills works both ways. The leadership, planning and problem-solving abilities honed through military service enhance our civilian careers and personal lives. For me, it's about maintaining connections with a community and way of life that shaped three decades of my life. "
        },
        {
            "text": "To anyone considering becoming a reservist, I would say this: Reserve Army service adds richness to your life on both personal and professional levels. You'll develop skills, forge friendships, and contribute to something bigger than yourself – all while maintaining your civilian career. "
        },
        {
            "text": "As we mark Reserves Day, I'm proud to serve in both my roles and to be part of the community that bridges military and civilian life, strengthening Defence through diversity of experience and thought. "
        }
    ]
}