{
    "url": "https://space.blog.gov.uk/2025/06/25/whispering-to-the-wild-building-satellites-that-listen-to-the-planet/",
    "title": "Whispers from the Wild: Building Satellites that Listen to the Planet",
    "authors": [
        "Lacuna Space"
    ],
    "categories": [
        "Applications",
        "Catalysing Investment"
    ],
    "pub_date": "2025-06-25T11:11:29+01:00",
    "content": [
        {
            "text": "Lacuna Space isn’t a billion-dollar rocket company trying to explore the universe. "
        },
        {
            "text": "From our facilities on the Harwell science campus in Oxfordshire, and Utrecht in the Netherlands, we are doing something quieter, but we’d argue, more vital."
        },
        {
            "text": "At Lacuna Space, we’re solving a problem that’s almost invisible if you live in a city, but painfully obvious if you’re a farmer, a marine scientist, or a utility operator: how do you connect the parts of the world that mobile signals forget?"
        },
        {
            "text": "Not just rainforests in Latin America, although we’re working there too, but also the edges of rivers in Wales, the hills of Northumberland, or the croplands of Norfolk. "
        },
        {
            "text": "While 99% of the UK population has mobile coverage, huge parts of the land are still out of reach. In those gaps, data that could help protect the environment, optimise farming, or monitor water quality simply vanishes."
        },
        {
            "text": "That’s what drove us to build a satellite network that listens, not for video calls or entertainment but for small, vital signals from the natural world."
        },
        {
            "text": "We designed something small and powerful: a battery-powered sensor node, about the size of a beermat, that can send data straight to a satellite — no mobile tower needed, no power socket in sight."
        },
        {
            "text": "The idea sounded far-fetched in 2016, when we started. But we proved it. Our devices now run for years on a single battery charge and connect directly with a growing constellation of low-Earth orbit satellites that we help build."
        },
        {
            "text": "At the heart of it is a highly sensitive radio receiver, orbiting 500 km above the Earth, tuned to detect faint whispers of data from sensors by rivers, fields, and coasts, that would otherwise go unheard."
        },
        {
            "text": "And none of this would have been possible without the early support and vision of the UK Space Agency, whose funding through the ARTES programme helped us go from sketchpad ideas to a working system in orbit. "
        },
        {
            "text": "We’re incredibly grateful for that backing as it gave us the runway to prove our concept and begin scaling it globally."
        },
        {
            "text": "People often ask if we’re part of the big space race. Not really. We’re more focused on what’s happening here on Earth. "
        },
        {
            "text": "The space industry has changed. Since the launch of Sputnik in 1957, there have been over 13,000 satellites but half of those have launched just in the past five years. "
        },
        {
            "text": "And they’re not all for glamour. A wave of smaller, smarter satellites is powering climate science, agriculture, and emergency response. That’s the wave we’re riding.We build our payloads here in the UK, and partner with UK spacecraft operators like Spire Global, who launch them. "
        },
        {
            "text": "Every satellite we use is designed to de-orbit cleanly after five years, leaving no junk behind. We don’t just monitor sustainability — we practice it, rightdown to our hardware."
        },
        {
            "text": "Our technology now supports some of the world’s most challenging environments. We focus on four key sectors: environmental monitoring, smart metering, smart agriculture, and the blue economy."
        },
        {
            "text": "For example, in Wales, our sensors monitor water quality in river catchments that support protected ecosystems. That data helps balance environmental protection with the demand for housing and development."
        },
        {
            "text": "In Cornwall, we support marine monitoring by sending ocean data from crab pots and buoys straight to our satellites, helping communities understand and manage their local waters."
        },
        {
            "text": "In Norfolk, farmers use our technology to track soil conditions and optimise irrigation — making agriculture more precise and resilient, even when off-grid."
        },
        {
            "text": "And in the Middle East, we’re helping DEWA, one of the region’s largest utilities, monitor remote water infrastructure, which is critical in a region where every drop counts."
        },
        {
            "text": "We started our journey as part of the ESA Business Incubation Centre at Harwell, in Oxfordshire with a very small grant to test the concept. Our first messages to orbit were so faint they barely showed up. But they worked."
        },
        {
            "text": "Fast forward several years, and we have just launched satellites number ten and eleven under the mission name ‘Call of the Wild’, which is a nod to both the untamed places we serve and the quiet signals we follow. "
        },
        {
            "text": "And we’re not stopping."
        },
        {
            "text": "In October, we will launch four more satellites under Wisdom of the Trail. These next-generation satellites will deliver more message capacity than all twelve of our previous satellites combined."
        },
        {
            "text": "We’re scaling, not just the technology, but our ability to get real-time, decision-making data into the hands of people who protect rivers, farm land, manage water, and care for the planet."
        },
        {
            "text": "We often say that in a world of big data and loud headlines, we’re trying to make room for the small signals. The ones that tell you when a river’s running high. When soil needs watering. When something precious is changing and we have a chance to act."
        },
        {
            "text": "And that, perhaps, is Lacuna Space’s real innovation: not rockets or routers, but a network that listens when the world speaks softly."
        }
    ]
}