{
    "url": "https://food.blog.gov.uk/2021/12/13/a-christmas-message-from-fsa-chair-susan-jebb-and-ceo-emily-miles/",
    "title": "A Christmas message from FSA Chair Susan Jebb and CEO Emily Miles",
    "authors": [
        "Professor Susan Jebb, FSA Chair",
        "Emily Miles, Chief Executive"
    ],
    "categories": [
        "People"
    ],
    "pub_date": "2021-12-13T13:58:30+00:00",
    "content": [
        {
            "text": "Cymraeg"
        },
        {
            "text": "Warm greetings to you from us, the FSA Board, and all our colleagues at the FSA."
        },
        {
            "text": " "
        },
        {
            "text": "It has been another challenging year for everyone working in the food system. We’ve continued to deal with the impact of COVID-19 while adapting to life outside the EU. At the FSA we are grateful for your cooperation and interest in our work to uphold food standards."
        },
        {
            "text": "Next year the Food Standards Agency, with Food Standards Scotland, will publish our first annual report on food standards assessing the state of the nation’s plate."
        },
        {
            "text": "We will also launch an updated strategy for the FSA. Our priority will continue to be to keep food safe and maintain trust in our food system. But we will also consider how the FSA can contribute its insights and skills as government looks to step up its action to achieve a healthier and more sustainable food system"
        },
        {
            "text": "We look forward to working with you in 2022 towards our goal of food we can trust."
        },
        {
            "text": "We wish you and your loved ones a happy Christmas and an enjoyable festive season."
        },
        {
            "heading": 2,
            "text": "Neges y Nadolig gan Gadeirydd yr Asiantaeth Safonau Bwyd, Susan Jebb, a'r Prif Swyddog Gweithredol, Emily Miles"
        },
        {
            "text": "Cyfarchion cynnes i chi oll oddi wrthyn ni, Bwrdd yr Asiantaeth Safonau Bwyd (ASB), a’n holl gydweithwyr yn yr ASB."
        },
        {
            "text": " "
        },
        {
            "text": "Mae wedi bod yn flwyddyn heriol arall i bawb sy'n gweithio yn y system fwyd. Rydym wedi parhau i ddelio ag effaith COVID-19 wrth addasu i fywyd y tu allan i'r Undeb Ewropeaidd. Yn yr ASB, rydym yn ddiolchgar am eich cydweithrediad a'ch diddordeb yn ein gwaith i gynnal safonau bwyd."
        },
        {
            "text": "Y flwyddyn nesaf bydd yr ASB, ynghyd â Safonau Bwyd yr Alban, yn cyhoeddi ein hadroddiad blynyddol cyntaf ar safonau bwyd sy'n asesu cyflwr y bwyd ar blât y genedl."
        },
        {
            "text": "Byddwn hefyd yn lansio strategaeth ddiweddaredig ar gyfer yr ASB. Ein blaenoriaeth fydd parhau i gadw bwyd yn ddiogel a chynnal ymddiriedaeth yn ein system fwyd. Ond byddwn ni hefyd yn ystyried sut y gall yr ASB gyfrannu ei chanfyddiadau a'i sgiliau wrth i'r llywodraeth geisio dwysáu ei gweithredu i sicrhau system fwyd iachach a mwy cynaliadwy."
        },
        {
            "text": "Rydym yn edrych ymlaen at weithio gyda chi yn 2022 tuag at ein nod o sicrhau bwyd y gallwn ymddiried ynddo."
        },
        {
            "text": "Dyma ddymuno Nadolig Llawen iawn i chi a’ch teulu, gan obeithio y byddwch yn mwynhau tymor yr ŵyl."
        }
    ]
}