{
    "url": "https://actuaries.blog.gov.uk/2021/12/13/how-a-passion-for-sustainability-put-me-on-the-world-stage/",
    "title": "How a passion for sustainability put me on the world stage",
    "authors": [
        "Sara Ronayne - Actuary"
    ],
    "categories": [
        "Actuary",
        "Climate change",
        "Finance"
    ],
    "pub_date": "2021-12-13T12:43:18+00:00",
    "content": [
        {
            "text": "Bringing together thousands of delegates from around the world, COP26 was billed as “a pivotal moment in the fight against climate change.” A host of climate pledges were announced by governments, including almost 200 countries agreeing the ‘Glasgow Climate Pact’ to accelerate global climate action."
        },
        {
            "text": "Climate change and sustainability are areas I’m very passionate about. Over the last couple of years, I’ve been very active within GAD’s climate change group and as a sustainability volunteer for the actuarial profession."
        },
        {
            "text": "As a result, I was privileged to spend 3 months in the run up to the summit seconded to HM Treasury’s COP26 Private Finance Hub. This culminated in me attending the COP26 Finance Day in Glasgow on 3 November 2021."
        },
        {
            "heading": 2,
            "text": "The role of private finance"
        },
        {
            "text": "Finance was a key theme throughout the conference. That’s no surprise when the cost of re-engineering our global economies for net zero is estimated to be over $100 trillion dollars over the next 30 years. Read this previous blog for a short explanation of net zero."
        },
        {
            "text": "A significant amount of this finance will need to come from sources outside of the public sector. By that, I mean the private finance system which includes businesses, banks, and financial firms. This will require an unprecedented scaling up of the existing climate related private finance flows and for climate change to be embedded into financial decisions."
        },
        {
            "text": "The Hub’s role was to help ensure that by COP26 our global private finance system would be ready and able to meet this challenge. The team was based within HM Treasury and led by the UK Prime Minister’s Finance Adviser for COP26 - former Bank of England governor Mark Carney."
        },
        {
            "text": "It comprised roughly half Treasury officials, with the other half (like me) secondees from elsewhere in the public sector. The Bank of England, Financial Conduct Authority and the Department for Business, Energy & Industrial Strategy were all represented."
        },
        {
            "heading": 2,
            "text": "Embedding climate in financial decisions"
        },
        {
            "text": "An overarching goal was to create a global financial system where “every professional financial decision takes climate change into account.” A very simple ambition, but of course immensely challenging to put into practice!"
        },
        {
            "text": "Achieving this work centred around 4 goals:"
        },
        {
            "heading": 2,
            "text": "Applying analytical skills"
        },
        {
            "text": "My role was focused on supporting the Hub’s analytical workstreams. I applied my analytical skills, and experience from GAD’s climate work, to support a range of new climate finance analysis challenges."
        },
        {
            "text": "Unsurprisingly, much of this work was high profile. Some analysis was used by Mark Carney and the Chancellor, Rishi Sunak, in speeches before and during COP26. Several were quoted in media coverage."
        },
        {
            "heading": 2,
            "text": "Private finance on the world stage"
        },
        {
            "text": "Each day of COP26 was themed, and ‘Finance Day’ on 3 November was when financial considerations took centre stage in negotiations and presentations. The private finance initiative I worked on featured prominently – showcasing UK and global financial system achievements to date and setting out the challenges ahead."
        },
        {
            "text": "Some of the key announcements included:"
        },
        {
            "heading": 2,
            "text": "Turning pledges into action"
        },
        {
            "text": "For its part, the UK has already highlighted its intention to become the world’s first net zero aligned financial centre. This will include moving towards making publication of net zero transition plans mandatory for asset managers, regulated asset owners and listed companies."
        },
        {
            "text": "Getting to grips with these requirements and turning pledges into action will be a key challenge for the UK financial sector and its advisers in the months and years ahead."
        },
        {
            "text": "As well as the private sector, the public sector also needs to embed climate change in its financial decision making. At GAD we are committed to supporting government departments and other public sector organisations with this goal."
        },
        {
            "text": "To find out more about how COP26 outcomes are relevant for public sector risk and finance workstreams, join us at our free upcoming Making sense of COP26 webinar on Thursday 16 December."
        },
        {
            "heading": 2,
            "text": "Continuing the journey"
        },
        {
            "text": "My time on secondment helped me gain a broader perspective of the global climate landscape and its finance challenges. The highlight was definitely having the opportunity to attend the COP26 Finance Day in person and to witness the keynote speeches live."
        },
        {
            "text": "Although only lasting 3 months, it was – personally and professionally – an incredibly rewarding experience that I will always remember fondly."
        },
        {
            "text": "I’m proud to have represented both GAD and the wider actuarial profession in supporting this landmark initiative. I look forward to applying the skills and experiences gained to support future climate workstreams."
        },
        {
            "text": "Disclaimer"
        },
        {
            "text": "The opinions in this blog post are not intended to provide specific advice. For our full disclaimer, please see the About this blog page."
        }
    ]
}