{
    "url": "https://dataarchitecture.blog.gov.uk/2021/12/13/improving-the-governance-of-taxonomies-for-uk-government-data/",
    "title": "Improving the governance of taxonomies for UK government data",
    "authors": [
        "Rosie Maslin"
    ],
    "categories": [
        "Classifications",
        "Data architecture",
        "Data governance",
        "Office for National Statistics",
        "Transformation"
    ],
    "pub_date": "2021-12-13T15:58:00+00:00",
    "content": [
        {
            "text": "The Office for National Statistics’ Classifications Team in partnership with the Data Standards Authority (DSA) have created a Taxonomy Oversight Group (TOG), which is made up of a community of cross-government and public sector experts to address the lack of a central governance mechanism for taxonomies in the UK. This may sound a little complicated, so hopefully this blog will provide more clarity on what the group is and what it aims to do."
        },
        {
            "text": "So, what are taxonomies? Well, I’m glad you asked because a taxonomy is simply the classification of data into categories, which can be complex and hierarchical. Examples of this are the UK Standard Industrial Classification (SIC) or the Standard Occupational Classification (SOC), which has nine groups of occupations from managers, directors and senior officials to elementary occupations, each with their own sub-groups. Taxonomies can also be flat. In this sense, they may be code lists such as gender."
        },
        {
            "text": "Taxonomies are used extensively across government and are a crucial component of data​. They are fundamental for producing quality data and statistics, yet there is no central governance mechanism for taxonomies in the UK. Following EU exit, this is particularly important as the UK are no longer legally obligated to implement some taxonomies that have been developed and are owned by the EU. It is necessary for there to be a UK mechanism and a clear process for deciding and recommending which taxonomies to adopt nationally. "
        },
        {
            "text": "The lack of central governance and a UK central body to oversee taxonomies has led to a lack of taxonomy coordination and sometimes to the use of outdated taxonomies or departments using ‘tweaked’ taxonomies for their own purposes, which impacts comparability between data sources. During the height of the pandemic, for example, such issues meant that individuals had trouble accessing benefits as a result of organisations using different taxonomies. "
        },
        {
            "text": "Establishing a Taxonomy Oversight Group as a sub-group of the cross-Government Data Architecture Community (GDAC) aims to address these challenges by providing transparency and aiding the governance of taxonomies used across government, particularly the Government Statistical Service (GSS). It will provide the standards, policy and assurance needed to resolve the absence of effective central governance. The group makes recommendations to the DSA, who follow its existing governance mechanisms to endorse taxonomies put forward by the group for cross-government use. "
        },
        {
            "text": "TOG is not solely limited to government professionals; it brings together data management and subject matter experts from across the public sector and third sector as well as government. Some of the departments and organisations who are a part of this community are Cabinet Office, Warwick University, Nesta, Gatsby Foundation and the Scottish and Welsh Governments to name a few. This enables TOG to have greater impact across sectors and break down barriers between the government and other sectors.  "
        },
        {
            "text": "Members of the group will work together to provide guidance and advice which lead to better government data management practices. The group will ensure a unified approach across the four UK nations, enabling clear decisions on ownership and associated responsibilities, which is also a necessary foundation to assist with the need for the UK to maintain strong international influence."
        },
        {
            "text": "TOG is currently in its test phase and is made up of the central Taxonomy Oversight Group and four Task and Finish Groups who are working on different test cases. The test cases are, skills, vulnerability, Classification of Individual Consumption According to Purpose (we are glad it has the acronym: COICOP), and industry. Each test case has its own host of challenges and work is currently underway by members to address them."
        },
        {
            "text": "As part of this work, we’re aiming to make these cross-government taxonomies more accessible and visible, together with management information such as point of contact and ownership, revision processes, and which organisation represents the UK on relevant international groups."
        },
        {
            "text": "Ultimately, TOG will provide a vital contribution to achieving the National Data Strategy vision of maximising the value of data in the UK.  It is reflective of what can be achieved when organisations work together to address challenges and develop solutions for data alignment."
        },
        {
            "text": "This blog is the first in a series of follow up blog pieces so keep an eye out for more detail on how the work progresses as well as insights into what makes a good taxonomy. And finally, if this blog has sparked your interest, please contact data.architecture@ons.gov.uk to find out more information or express your interest in becoming part of the community."
        }
    ]
}