{
    "url": "https://minimumwage.blog.gov.uk/2021/12/13/not-so-equal-is-excluding-au-pairs-from-the-minimum-wage-still-the-right-thing-to-do/",
    "title": "Not so equal: Is excluding au pairs from the minimum wage still the right thing to do?",
    "authors": [
        "Emma Hill"
    ],
    "categories": [
        "Compliance and enforcement",
        "Domestic workers"
    ],
    "pub_date": "2021-12-13T10:41:41+00:00",
    "content": [
        {
            "text": "This year, the Low Pay Commission was asked to investigate the use of the ‘domestic worker exemption’. Our full response to this is included in our  2021 report, published last week."
        },
        {
            "text": "This exemption, which we have now recommended removing, was introduced into the National Minimum Wage (NMW) regulations in 1999 and was intended to apply to au pairs [1][2]. It states that workers do not have to be paid the minimum wage if they live in their employer’s household and are treated as a family member, particularly with regards to the provision of accommodation and food."
        },
        {
            "heading": 2,
            "text": "Impact on au pairs"
        },
        {
            "text": "Traditionally, au pair placements involve a young person coming to the UK, often from Europe, and staying with a host family. They help with a limited amount of childcare and light housework, and in return receive pocket money, a room and meals, and the opportunity to learn English while being treated as a member of the family. The idea of the exemption was to provide an opportunity both for affordable childcare for families, and for young people to take part in cultural exchange [3]."
        },
        {
            "text": "However, in 2008, the designated au pair visa was removed, and with it the effective regulation of the sector. While au pair agencies continued to ensure the fair treatment of the au pairs they placed, there was a boom in au pairs placed outside of agencies [4]. Families have been able to find au pairs directly through websites, and without genuine regulation au pairs have in many cases been treated as cheap live-in nannies and cleaners."
        },
        {
            "text": "We heard from many au pairs whose experiences do not match with the original intention for the scheme. They talked to us about working longer hours than agreed, being seen as constantly available, and feeling unable to say no because their accommodation is tied to their work. One group talked to us about providing au pairs with emergency housing when they fall out with their host family. Some au pairs were given less food than the rest of the family, or were unable to attend English classes. Overall, it seems that the exemption has set an expectation that au pairs should not be paid the minimum wage, even when they are not treated as family members."
        },
        {
            "text": "Since the UK exited the EU, the scale of the au pair sector has fallen markedly, as there is now no route for most au pairs to legally enter the UK. At its peak there were likely to be 60,000 to 90,000 au pairs in the UK [3]. The Nanny Solidarity Network estimates that the total number of au pairs has nearly halved since Brexit, saying that many of those remaining are undocumented workers in unregulated placements."
        },
        {
            "heading": 2,
            "text": "Impact on other workers"
        },
        {
            "text": "While the exemption was intended to apply to au pairs, it has also provided a loophole for exploitation of live-in domestic workers. This is because the legislation does not precisely define the role of an au pair. A domestic worker who is working for a household as a housekeeper or carer may live with their employer and receive accommodation and food. As a result, their employer may argue that the exemption applies."
        },
        {
            "text": "Domestic workers often enter the country on an Overseas Domestic Worker (ODW) visa. This is a group that is already extremely vulnerable to exploitation [5][6]. They are often single mothers supporting families in the Philippines, Indonesia, West Africa or India, often with language barriers and minimal awareness of UK law. The nature of domestic work means that they are hidden in private homes with limited support networks. Their work is linked to their accommodation, their immigration status, and their ability to support their family, which encourages dependency on employers. The fact that the current version of the visa is limited to six months and cannot be extended makes it hard to challenge abuse, as it is difficult to move to another employer."
        },
        {
            "text": "Some of the stories we heard from domestic workers are harrowing. A few talked to us about physical abuse, being prevented from leaving the house or from talking to others. One talked to us about having to sleep in a bed with the family dog. Many of these workers have been found to be victims of modern slavery. But ‘low level’ exploitation of these workers is even more widespread. As with au pairs, they are seen by the families they live with as being constantly available, and so are asked to do long hours of work, often without additional pay. Most report being paid well below the NMW."
        },
        {
            "text": "The exemption is not typically used in contracts or explained to these workers, but employers rely on it when there are claims of underpayment. HMRC are responsible for enforcing payment of the NMW, but have limited capacity to assess if someone is treated as a family member, especially in private homes. These already vulnerable workers therefore need to go to court to prove their entitlement to the minimum wage. The Anti-Trafficking and Labour Exploitation Unit (ATLEU) told us that the exemption is almost always raised by the employer as a defence, even when workers have already been recognised as victims of modern slavery. The exemption places a burden on workers in enforcing their rights."
        },
        {
            "text": "In 2020, the London South Employment Tribunal heard the case of Puthenveettil, a domestic worker [7]. The case was unusual in that it argued that the exemption itself was discriminatory as it is more likely to apply to women. The Tribunal agreed that domestic workers were more likely to be female and therefore that the exemption is unlawful and could not be applied in this instance."
        },
        {
            "text": "The evidence we have gathered supports this judgement. Au pairs are overwhelmingly women: adverts for au pairs typically specify they want a female au pair, and employment data shows that the vast majority of those employed in childminder or au pair roles are female. This is similarly true for migrant domestic workers, and victims of domestic servitude. Kalayaan, an organisation that works with domestic workers, told us that the exemption devalues domestic work, and labelling these workers as ‘family members’ relies on the idea that this work would otherwise be provided for free by women in the family [3]."
        },
        {
            "heading": 2,
            "text": "Our recommendations"
        },
        {
            "text": "Overwhelmingly, the evidence that we heard on the exemption was negative. While it was originally introduced to make it possible for families to host au pairs affordably as part of a cultural exchange programme, it has at the same time provided a loophole for employers to exploit live-in workers and has acted as a barrier for these workers when they seek to protect their rights."
        },
        {
            "text": "The evidence led us to recommend that the exemption should be removed."
        },
        {
            "text": "However, if the Government intends to introduce a visa route for au pairs and does not wish to repeal the exemption, then it must be amended so that it does not provide a loophole for exploitation. It should clearly state what is meant by an au pair and the scope of their duties to ensure that it cannot be applied to domestic workers, to care workers, or to au pairs who are de facto working as cleaners and nannies without adequate pay or genuine cultural exchange."
        },
        {
            "heading": 3,
            "text": "References"
        },
        {
            "text": "[1] National Minimum Wage Regulations 2015, 57(3)."
        },
        {
            "text": "[2] M. Hodge MP, Hansard, 1999. Retrieved from https://publications.parliament.uk/pa/cm199899/cmhansrd/vo990225/debtext/90225-31.htm"
        },
        {
            "text": "[3] Cox, R., and Busch, N., As an Equal?: Au Pairing in the 21st Century, Bloomsbury Publishing, 2018."
        },
        {
            "text": "[4] Cox, R., Au Pairs’ Lives in Global Context, Sisters or Servants? Palgrave Macmillan, 2015."
        },
        {
            "text": "[5] Ewins, J., Independent review of the overseas domestic workers visa Home Office and UK Visas and Immigration, 2015."
        },
        {
            "text": "[6] Low Pay Commission Report 2014."
        },
        {
            "text": "[7] Puthenveettil vs Alexander, George & Secretary of State for Business, Energy and Industrial Strategy, 2020."
        }
    ]
}