{
    "url": "https://civilservice.blog.gov.uk/2021/12/13/our-plan-to-green-up-the-government-estate/",
    "title": "Our plan to green up the government estate",
    "authors": [
        "Dr Miguel Godfrey",
        "Louisa LeRoux"
    ],
    "categories": [
        "Uncategorized"
    ],
    "pub_date": "2021-12-13T10:09:06+00:00",
    "content": [
        {
            "heading": 3,
            "text": "What will your future office look like? Although we can’t promise virtual reality meeting rooms and holographic colleagues just yet, we’re making great strides in our quest for a Net Zero government estate. "
        },
        {
            "text": "Like every major employer, with offices and buildings across the country, the Civil Service is committed to reducing its carbon footprint. If we tackle this issue now, and take action to reduce CO2 emissions, we have a real chance to keep the target of 1.5 per cent alive! And luckily for us, there’s some skilled, innovative and ambitious civil servants in the Government Property Agency (GPA) doing just this."
        },
        {
            "text": "We’re helping to build A Skilled Civil Service by providing great places to work for civil servants. "
        },
        {
            "text": "Thirty eight per cent of all emissions originate from construction, and a number of laws have been passed to help regulate the industry, for example, Energy Performance Certificate targets which concern all owners or stakeholders of property – commercial or residential. With this in mind, we're aiming to lead by example, in retrofitting and installing sustainability aspects to the Government’s general purpose portfolio."
        },
        {
            "heading": 4,
            "text": "Innovation, innovation, innovation"
        },
        {
            "text": "In 2020 we published our first Net Zero and Sustainability Design Guide. This sets out how, by being more innovative in our problem solving, we can address construction and operational carbon emissions, as well as other environmental impacts. "
        },
        {
            "text": "You can also implement a Building Management System to track energy consumption and demand, and to link to occupancy levels to anticipate and manage space heating. Whilst photovoltaic panels, better known as solar panels, capture the sun’s energy and convert it into electricity."
        },
        {
            "text": "From the design of our new Government Hubs to large scale refurbishments, we are building sustainability into our design options to deliver sustainable offices for civil servants, ensuring we have best in class property and workplace solutions befitting A Modern Civil Service."
        },
        {
            "text": "Putting it into practice"
        },
        {
            "text": "It’s early days, but we’re making great progress by replacing old lights with LEDs to produce impressive savings. "
        },
        {
            "text": "By swapping out old lighting tech for new, innovative solutions - like ‘microwave’ proximity sensors - at Cheylesmore House in Coventry, we’ve bagged impressive energy and carbon savings of more than 60 per cent."
        },
        {
            "text": "At the Office for National Statistics in Titchfield, we’ve been even more ambitious, where we’ve replaced the building’s decrepit lighting with a brand new wifi-controlled LED system. "
        },
        {
            "text": "Now I know what you’re thinking… swapping lights over, hardly something to write home about. But it’s not just shiny new buildings and cool cutting-edge technology that’s on show. Our whole approach has been in-keeping with our vision."
        },
        {
            "text": "We created opportunities around the UK by collaborating with a local supply chain for equipment manufacture and supported jobs throughout the pandemic."
        },
        {
            "text": "Avoiding waste"
        },
        {
            "text": "We solved the problem of excess waste by using 100 per cent recycled packaging which we returned to the supplier for further deliveries."
        },
        {
            "text": "We showed excellence in project delivery by delivering directly from the manufacturing line to the site, minimising waste and our carbon footprint in the process and completing the whole project within two months."
        },
        {
            "text": "All this has led to forecasted energy savings of 75 per cent and a significant reduction in maintenance costs - all of which saves the taxpayer money."
        },
        {
            "text": "What next? "
        },
        {
            "text": "Ultimately, we hope that the prognosis means sunshine for the Civil Service! But we’re not resting on our laurels, and before the financial year is out we’ll be starting our ambitious plans for solar installations across our estate. This means government buildings will begin to generate the energy they need, further driving down our carbon footprint and improving the Civil Service’s sustainability too. For more info, click here."
        }
    ]
}