{
    "url": "https://ruralpayments.blog.gov.uk/2021/12/13/the-new-round-of-countryside-stewardship-facilitation-fund-opens-today/",
    "title": "The new round of Countryside Stewardship Facilitation Fund opens today",
    "authors": [
        "RPA Editor"
    ],
    "categories": [
        "Countryside Stewardship"
    ],
    "pub_date": "2021-12-13T13:09:42+00:00",
    "content": [
        {
            "text": "We’re pleased to announce that the latest round of the Countryside Stewardship Facilitation Fund has opened today for applications."
        },
        {
            "text": "The fund helps groups of farmers and landowners in England work together to deliver environmental benefits for their local area. By coordinating action and sharing knowledge, groups can achieve greater environmental benefits than they would working alone."
        },
        {
            "text": "This year’s round of the scheme includes support for new environmental priorities such as:"
        },
        {
            "heading": 2,
            "text": "How the fund works"
        },
        {
            "text": "To apply for the Facilitation Fund, a group of farmers and landowners needs to choose a facilitator who will work with them for the length of the agreement. An agreement lasts 3 years, during which time the facilitator will receive funding for organising group activities and bringing support, advice and training to the group."
        },
        {
            "text": "These activities help the group achieve their goals to improve their local environment. Depending on the character of the area, this might take different forms: for example, restoring habitats for wildlife and improving biodiversity, creating woodland, improving air and water quality, or restoring historic environments."
        },
        {
            "text": "The case studies from previous rounds of the fund show the wide range of activities delivered by different facilitation groups and how they have each tailored their goals to their local area."
        },
        {
            "text": "For a closer view of what being part of a facilitation group can mean at a farm level, you can also read about our farm visit to Challacombe Farm on Dartmoor, part of a local facilitation group which is helping to restore habitats for endangered Marsh Fritillary butterflies and native salmon."
        },
        {
            "heading": 2,
            "text": "Fostering strong and supportive rural communities"
        },
        {
            "text": "On top of the environmental benefits, facilitation groups help foster a strong sense of community with members helping each other out, sharing information and knowledge such as good farming and environmental practices, and developing greater trust."
        },
        {
            "text": "Many also report social benefits from being part of a group, especially feeling less isolated. Here are what some facilitators for the current groups said:"
        },
        {
            "text": "You can read more about the benefits of the scheme in the latest evaluation report published by Natural England."
        },
        {
            "heading": 2,
            "text": "How you can apply"
        },
        {
            "text": "The facilitator for the group needs to coordinate the application on behalf of the group. Go to the Facilitation Fund page on GOV.UK to download the application form and find out how to submit it."
        },
        {
            "text": "Applications for the fund are competitive. All applications are scored, and the highest-scoring ones will be offered funding, with agreements starting on 1 June 2022 and running for 3 years."
        },
        {
            "text": "To make sure that the goals stated in your application align with the Countryside Stewardship priorities for your local area and give you a better chance of a successful application, read the Countryside Stewardship statement of priorities for your area."
        }
    ]
}