{
    "url": "https://food.blog.gov.uk/2025/05/20/building-blocks-for-better-food-regulation/",
    "title": "Building blocks for better food regulation",
    "authors": [
        "Carmel Lynskey, Deputy Director of Achieving Business Compliance",
        "Nathan Barnhouse, Deputy Director of Business Compliance"
    ],
    "categories": [
        "Our mission",
        "Partners"
    ],
    "pub_date": "2025-05-20T13:36:15+01:00",
    "content": [
        {
            "text": "Cymraeg"
        },
        {
            "text": "Today we are hosting leaders and experts from across the food system to listen to their views on how food regulation could evolve so that it works for consumers and businesses in the future. "
        },
        {
            "text": "Views gathered today will build on our understanding and inform future thinking for our Board. "
        },
        {
            "text": "We will hear a range of voices representing businesses, consumer groups and enforcement agencies on some of the system-wide challenges and opportunities in food regulation.  "
        },
        {
            "text": "As a regulator we must evolve and adapt to a changing world, make the most of advances in technology and support growth, all while continuing to focus on our primary responsibility to protect public health and deliver food you can trust. "
        },
        {
            "text": "The event today is part of our ongoing engagement process to understand how regulation could help address some of the systemic challenges in the hospitality, retail and manufacturing sectors. This work complements engagement with the UK meat sector to address future challenges. "
        },
        {
            "text": "We have proposed four ‘building blocks’ that form the framework of actions to address some of these challenges. These actions will focus on enhancing consumer choice and information; enabling more intelligence-led surveillance and enforcement; driving business compliance and economic growth; and ensuring a skilled and capable food safety workforce. "
        },
        {
            "text": "Views gathered at the event will help identify priority areas for the FSA and inform future thinking for our Board. To share your views, you can contact us directly via sharingperspectives@food.gov.uk"
        },
        {
            "heading": 1,
            "text": "Blociau adeiladu ar gyfer rheoleiddio bwyd gwell"
        },
        {
            "text": "Heddiw, rydym yn croesawu arweinwyr ac arbenigwyr o bob cwr o’r system fwyd ac yn gwrando ar eu barn ar sut y gallai’r trefniadau ar gyfer rheoleiddio bwyd esblygu fel eu bod yn gweithio i ddefnyddwyr a busnesau yn y dyfodol."
        },
        {
            "text": "Bydd y safbwyntiau a gesglir heddiw yn adeiladu ar ein dealltwriaeth ac yn llywio syniadaeth ein Bwrdd at y dyfodol."
        },
        {
            "text": "Byddwn yn clywed trafodaethau gan amrywiaeth o leisiau sy’n cynrychioli busnesau, grwpiau defnyddwyr ac asiantaethau gorfodi ynghylch rhai o’r heriau a’r cyfleoedd ar draws y system ym maes rheoleiddio bwyd."
        },
        {
            "text": "Fel rheoleiddiwr, rhaid i ni esblygu ac addasu i fyd sy’n newid, manteisio i’r eithaf ar ddatblygiadau mewn technoleg a chefnogi twf, a hynny i gyd wrth barhau i ganolbwyntio ar ein prif gyfrifoldeb, sef diogelu iechyd y cyhoedd a darparu bwyd y gallwch ymddiried ynddo."
        },
        {
            "text": "Mae’r digwyddiad heddiw yn rhan o’n proses ymgysylltu barhaus i ddeall sut y gallai rheoleiddio helpu i fynd i’r afael â rhai o’r heriau systemig yn y sectorau lletygarwch, manwerthu a gweithgynhyrchu. Mae’r gwaith hwn yn ategu ymgysylltiad â sector cig y DU i fynd i’r afael â heriau’r dyfodol. "
        },
        {
            "text": "Rydym wedi cynnig pedwar ‘bloc adeiladu’ sy’n ffurfio’r fframwaith o gamau gweithredu i fynd i’r afael â rhai o’r heriau hyn. Bydd y camau gweithredu hyn yn canolbwyntio ar wella’r dewis a’r wybodaeth sydd ar gael i ddefnyddwyr; galluogi mwy o waith goruchwylio a gorfodi sy’n seiliedig ar wybodaeth; ysgogi cydymffurfiaeth busnesau a thwf economaidd; a sicrhau gweithlu diogelwch bwyd medrus a galluog. "
        },
        {
            "text": "Bydd y safbwyntiau a gesglir yn y digwyddiad yn helpu i nodi meysydd blaenoriaeth ar gyfer yr ASB ac yn llywio syniadaeth ein Bwrdd aty dyfodol. I rannu eich barn, gallwch gysylltu â ni’n uniongyrchol drwy e-bostio sharingperspectives@food.gov.uk"
        }
    ]
}