{
    "url": "https://mhclgmedia.blog.gov.uk/2025/05/20/coverage-on-new-towns-costs/",
    "title": "Coverage on new towns costs",
    "authors": [
        "mhclgpress"
    ],
    "categories": [
        "Housing"
    ],
    "pub_date": "2025-05-20T15:40:12+01:00",
    "content": [
        {
            "text": "Reports today suggest a dozen new towns in England will cost as much as £48 billion according to a WPI Strategy report, with the average cost of each development likely to be in the range of £3.5 to £4 billion."
        },
        {
            "text": "The WPI’s estimate of costs per new town is extremely speculative. The government does not recognise these figures as locations for new towns have not yet been announced or decided by ministers."
        },
        {
            "text": "Last September, we established an independent New Towns Taskforce and tasked the experts on it with identifying and recommending locations for new towns within 12 months."
        },
        {
            "text": "The Taskforce will make its recommendations on locations for new towns in the national interest and on the basis of defined criteria."
        },
        {
            "text": "A Ministry of Housing, Communities and Local Government spokesperson said:“Any hypothetical cost projections associated with the New Towns programme are at this stage pure speculation. We are awaiting the recommendations from the independent New Towns Taskforce on potential locations for new towns and we will receive this later this year.  "
        },
        {
            "text": "“The Taskforce is working in partnership with local leaders and communities, and its selection of sites will be made in the national interest."
        },
        {
            "text": "“Our next generation of new towns will be well-designed communities of at least 10,000 homes each, with many significantly larger, as part of the biggest housebuilding programme since the Second World War.”"
        }
    ]
}