{
    "url": "https://naturalengland.blog.gov.uk/2025/05/20/growing-more-than-food-the-benefits-of-nature-friendly-farming/",
    "title": "Growing more than food: The benefits of nature-friendly farming",
    "authors": [
        "Natural England"
    ],
    "categories": [
        "Farming",
        "Natural England",
        "wildlife and farming"
    ],
    "pub_date": "2025-05-20T15:09:11+01:00",
    "content": [
        {
            "text": "By Martin Lines, CEO, Nature Friendly Farming Network, andPeter Craven, Head of Agriculture, Natural England"
        },
        {
            "text": "This week is Nature Friendly Farming Week, and with a theme of 'More than growing food' it aims to highlight the wider benefits of nature-friendly farming and celebrates the great work being done by farmers across the country to tackle challenges head-on and build more resilient farms."
        },
        {
            "text": "Challenges farmers and nature are facing"
        },
        {
            "text": "Across the country, farmers are grappling with increasingly unpredictable and volatile weather, which makes it difficult to plan, grow crops or raise livestock. At the same time, many are keenly aware that their land has become less rich in nature than it once was. There are fewer insects in the soil, fewer birds in the air, and fewer natural features that once helped farms prosper."
        },
        {
            "text": "Urgent shift to nature-centred farming methods needed"
        },
        {
            "text": "This shift in farming practices wasn’t a choice, but the result of years of advice that focused solely on maximising yields. For decades, farmers were told to prioritise output and rely on chemicals, while nature was seen as an obstacle. Hedgerows were grubbed out, trees felled and wetlands drained to make way for larger fields and more intensive production and practices. But this approach has come at a steep environmental cost, and continuing down this path puts the future of farming at risk. To protect both the land and the livelihoods of farmers, we urgently need a shift to nature-centered farming methods."
        },
        {
            "text": "This means recognising that conventional, intensive farming systems not only harm the environment, but also jeopardise the long-term viability of farm businesses. Over-reliance on artificial inputs degrades soil and pollutes water and air, weakening the land’s resilience and its ability to store water - exactly what farmers need to protect their crops and livelihoods during both heavy rains and dry spells."
        },
        {
            "text": "Farmers are on the front line of the climate and nature crises. Their decisions shape the health of our soils, rivers, wildlife, and food systems. Nature-friendly farming isn’t just good for nature; it’s a proven, practical way to build stronger, more resilient farm businesses."
        },
        {
            "text": "Tom Edmondson, an NFFN farmer who runs a mixed farm near Milton Keynes, said: "
        },
        {
            "text": "“Our nature-friendly farming approach - using cover crops, careful grazing, minimal soil disturbance, and years of building organic matter - has made a huge difference. While others around us are really struggling with the dry spring and failing crops, ours are still holding up well. You just don’t know what the weather will throw at you year to year. That’s why building resilience into the farming system is absolutely essential.”"
        },
        {
            "text": "Farming benefits from increasing biodiversity"
        },
        {
            "text": "Using land for multiple purposes to create extra income streams"
        },
        {
            "text": "When we recognise that farming every inch of land for crops or livestock isn’t always the best long-term approach, and that nature plays a crucial role on farms, new opportunities arise to do more with farmland. Enterprise stacking - using land for multiple purposes - can boost environmental benefits that support the farm, and create extra income streams."
        },
        {
            "text": "Agroforestry"
        },
        {
            "text": "One powerful approach is agroforestry, where trees help build a resilient landscape that supports livestock through increasingly unpredictable weather, offering shade and shelter, and helping to prevent heat stress as temperatures rise. Trees and shrubs with medicinal properties can also reduce the need for wormers, benefitting both livestock and soil health by supporting dung beetles. An example of this approach is Jack Cockburn's, farm in Ceredigion, West Wales."
        },
        {
            "text": "Upland farming"
        },
        {
            "text": "Upland farms can play a vital role in holding water by helping to protect communities downstream from flooding, while still providing grazing land for pasture-fed animals and supporting species-rich habitats. Techniques like re-meandering streams and installing leaky dams slow the flow of water, reducing the impact of storms and violent deluges that are becoming increasingly common. These natural approaches not only mitigate flood risk but also enhance biodiversity and soil health. Renewable energy, such as solar panels, can significantly reduce farm bills while contributing to wider emissions reduction efforts. "
        },
        {
            "text": "Expanding on regeneration farming"
        },
        {
            "text": "Growing a wider range of crops can open up new markets and build farm resilience. Niche grains, legumes, herbal leys and heritage varieties all offer opportunities to tap into changing consumer tastes. Adding value through on-farm processing or direct sales, and exploring potential premiums for sustainable or local produce, can further strengthen farm income. An example of this approach is Debbie Wilkins’ work at her family farm in Gloucestershire."
        },
        {
            "text": "Making this vision the norm can open up new opportunities for farmers to prosper, both environmentally and economically. By embracing nature-friendly farming practices, farms can not only contribute to a healthier environment but also drive rural prosperity and ensure that high-quality food is available to all."
        },
        {
            "text": "Farms play a broader role than just producing food, they sustain both nature and communities, by:"
        },
        {
            "text": "To get support and help with nature-friendly farming visit the Catchment Sensitive Farming page."
        },
        {
            "text": "You can find a wide range of resources about nature-friendly farming, including practical guides to agroecological practices, case studies and farmer blogs, on the Nature Friendly Farming Network website."
        }
    ]
}