{
    "url": "https://space.blog.gov.uk/2025/05/20/joeysat-two-years-of-uk-led-satellite-innovation/",
    "title": "JoeySat: two years of UK-led satellite innovation",
    "authors": [
        "UK Space Agency"
    ],
    "categories": [
        "Satellites"
    ],
    "pub_date": "2025-05-20T13:57:39+01:00",
    "content": [
        {
            "text": "Two years ago, a small but powerful satellite launched into low Earth orbit—and it’s been making a big impact ever since."
        },
        {
            "text": "JoeySat, developed through a collaboration between the UK Space Agency, the European Space Agency (ESA), and OneWeb (now Eutelsat Group) has redefined what’s possible in satellite communications. Today, we’re celebrating its achievements and the role it continues to play in connecting people across the globe."
        },
        {
            "text": "JoeySat is at the forefront of next-generation satellite innovation. Developed under the Sunrise Partnership between the UK Space Agency, the European Space Agency (ESA), and Eutelsat Group, and built by UK-based Satixfy and MDA it features a fully digital, software-defined payload capable of beam-hopping and regenerative processing. This means it can steer, and switch communication beams up to 1,000 times per second—dynamically adjusting coverage and power to meet real-time demand."
        },
        {
            "text": "This level of flexibility allows JoeySat to deliver high-speed, low-latency internet to users on land, at sea, and in the air. Whether it’s powering 5G mini hubs, enhancing in-flight broadband, or supporting emergency response teams during crises, JoeySat was designed to adapt instantly to where it’s needed most."
        },
        {
            "text": "Henny Sands, Head of Telecommunications at the UK Space Agency, said:"
        },
        {
            "text": "What sets JoeySat apart is its ability to evolve. Thanks to its software-defined architecture, the satellite can be reconfigured while in orbit. It’s also a key demonstrator for integrating satellite communications with terrestrial 5G networks, helping to bridge the digital divide in underserved and remote regions. With its scheduled testing now successfully completed, JoeySat is ready to enhance space environment characterisation—such as radiation monitoring—supporting the operational safety of the Eutelsat OneWeb LEO constellation."
        },
        {
            "text": "Guillaume Scottez, Senior Director for Innovation at Eutelsat Group, said:"
        },
        {
            "text": "Beyond its technical achievements, JoeySat also represents a new model for rapid satellite development. Using a lean engineering approach and commercial off-the-shelf components, the satellite went from contract signing to launch in under 2 years, despite major impacts such as the COVID pandemic—demonstrating the UK’s ability to deliver complex space missions quickly and efficiently. The payload was fully tested and integrated in the UK, showcasing national capabilities in sustainable satellite manufacturing and advanced testing infrastructure."
        },
        {
            "text": "Thanks to the Sunrise Partnership, UK organisations - including Satixfy, MDA, Celestia, CGI, Proelectric, and the University of Surrey – also harnessed Joeysat to develop and test cutting-edge technologies. These included user terminals, multi-beam digital gateways, 5G portable mini hubs, ground network validation tools, and advanced 5G applications. The project delivered tangible improvements in data volume, speed, and latency, helping shape the future of global connectivity."
        },
        {
            "text": "The UK Space Agency invested £52 million in JoeySat and related technologies, helping to grow a sustainable, end-to-end UK space ecosystem. "
        },
        {
            "text": "Khalil Kably, ESA Telecom Satellite Project Manager, said:"
        },
        {
            "text": "As JoeySat embarks on its next chapter we celebrate the technologies it has unlocked for the satellites of the future."
        }
    ]
}