{
    "url": "https://ruralpayments.blog.gov.uk/2025/05/20/the-rural-payments-agency-podcast-episode-12/",
    "title": "The Rural Payments Agency Podcast: Episode 12",
    "authors": [
        "RPA Editor"
    ],
    "categories": [
        "Hedgerows",
        "RPA podcast"
    ],
    "pub_date": "2025-05-20T14:09:02+01:00",
    "content": [
        {
            "text": "Welcome to the twelfth episode of The RPA Podcast. In our latest episode, we speak with RPA Field Officer Peter Clampett about the Management of Hedgerows (England) Regulations 2024."
        },
        {
            "text": "The regulations set out the rules for protecting hedgerows on, or next to, agricultural land. This includes a hedgerow cutting and trimming ban which runs from 1 March to 31 August each year, as well as a 2-metre buffer strip where green cover must be established."
        },
        {
            "text": "We held a public consultation to seek views on how the implementation of the regulations would be approached. Earlier this year we published the formal response and final statutory guidance on the use of civil sanctions."
        },
        {
            "text": "In the Podcast, Peter talks about the regulations and why they were introduced, which hedgerows the rules apply to, the buffer strip rules and exemptions to the regulations."
        },
        {
            "text": "The Podcast is also an opportunity for RPA to engage with farmers and land managers, and we encourage you to contact us with your suggestions for topics you’d like us to cover with our subject experts. You can email us at External.Affairs@rpa.gov.uk"
        },
        {
            "text": "You can listen to episode 12 of The RPA Podcast on Apple and Spotify or through Buzzsprout. You can also listen to earlier episodes of The RPA Podcast on Apple and Spotify, or through Buzzsprout."
        },
        {
            "text": "Follow us on social media for the latest updates and information on the following accounts:"
        },
        {
            "text": "By following and subscribing to our social channels and blog, you’ll be able to see the latest updates about important information."
        }
    ]
}