{
    "url": "https://forestrycommission.blog.gov.uk/2025/05/20/to-plant-or-not-to-plant-that-is-tree-question/",
    "title": "To plant or not to plant, that is tree question",
    "authors": [
        "Paul Brannen"
    ],
    "categories": [
        "Climate change and resilience",
        "Woodland creation"
    ],
    "pub_date": "2025-05-20T09:00:00+01:00",
    "content": [
        {
            "heading": 2,
            "text": "Wood – a renewable resource to drive the bioeconomy"
        },
        {
            "text": "Let’s work backwards. By 2050 the UK economy needs to have been decarbonised. It will no longer be based on fossil fuels, rather it will be a bioeconomy powered by sustainable and renewable energy and material sources. Getting there will present huge challenges, but it will also offer big opportunities especially for new, innovative businesses."
        },
        {
            "text": "One of the key sustainable and renewable materials that the bioeconomy will increasingly require as a feedstock will be wood. Take these three examples:"
        },
        {
            "heading": 3,
            "text": "1. Wood for construction"
        },
        {
            "text": "First, we have construction where demand for timber is already accelerating. In the government’s recently published Timber in construction roadmap, the ministerial foreword notes that timber ‘offers immense potential to reduce emissions, create jobs, and build the homes we need’. "
        },
        {
            "text": "Unknown to most people in the UK, Scotland already builds 92% of its new family homes using timber frames whereas in England it is less than 10%.1 Housebuilders in England are now following Scotland, driven by the desire to build faster and greener – a situation evidenced by all the UK’s main volume housebuilders having, acquiring or building their own timber frame factories. "
        },
        {
            "text": "An increase in demand for more wood to build more timber framed homes can initially be met by increased imports, mainly from Sweden, Latvia and Finland, where ‘super-sawmills’ can efficiently produce spruce timber at a competitive price despite the additional shipping costs."
        },
        {
            "text": "At this point we need to address a commonly held misconception, namely ‘UK grown’ timber is not good enough for most construction roles. The timber industry uses a grading classification where ‘C’ stands for ‘coniferous’ followed by a number which refers to the bending strength in Newton meters. C16 is suitable for most general construction applications, including structural framing or cut sections for roof trusses, whereas C24 is used for roles requiring more strength/load bearing i.e. longer spans. "
        },
        {
            "text": "Generally, UK timber is mainly graded C16 and Scandinavian C24. Most architects and housebuilders opt for the latter as there is no significant price difference. Meanwhile the majority of UK timber is used to make fencing, decking, pallets, chipboard, paper and cardboard. Although, we could use more UK timber in construction."
        },
        {
            "heading": 3,
            "text": "2. Wood for home insulation"
        },
        {
            "text": "Secondly, insulation will be needed in all the government’s planned 1.5 million new homes as well as for 13 million existing homes in need of better loft insulation in the UK.2 Currently, the UK insulation market is dominated by products such as glass, stone, wool and polystyrene which are manufactured using fossil fuels. What would make much more sense for the climate would be insulation made from wood fibre, as it can both store carbon and has a lower level of embodied carbon i.e., uses less fossil fuels."
        },
        {
            "text": "However, change is coming; Poland and Germany both now manufacture wood fibre insulation and as a result, around 8% of their new homes use it (European Panel Federation). Woodknowledge Wales have been working with the Welsh Assembly on a plan to build a wood fibre insulation factory using UK wood – and a lot of it."
        },
        {
            "heading": 3,
            "text": "3. Wood for aviation fuel"
        },
        {
            "text": "Lastly, Sustainable Aviation Fuel (SAF) will be needed to power long-haul flights. Across the globe, laboratories are working on a range of formulae and feedstocks to perfect a SAF. On Teesside, Novapangaea Technologies can make a green aviation fuel from almost anything grown on a farm or in a forest. However, they do have a preferred feedstock – Sitka spruce. "
        },
        {
            "text": "Yes, you read that correctly; the much maligned Sitka spruce is their sustainable and renewable number one feedstock of choice. Just one snag, their potential manufacturing operation could devour the whole of the UK’s current annual Sitka spruce harvest!"
        },
        {
            "heading": 2,
            "text": "Home-grown softwood for an expanding bioeconomy"
        },
        {
            "text": "At this point you have probably spotted the problem – the UK currently does not have enough home-grown softwood to provide the necessary feedstock for an expanding UK bioeconomy. Add in textiles made from wood, mass/engineered timbers, hemicellulose (used for biofuels, food, beverages, packaging and much more), chemicals from wood fibres and more, and we hit the buffers.  "
        },
        {
            "text": "There is the option of importing more softwood, but we are already the second biggest net importer of wood in the world, after China. As it stands, we import 73% of our wood,3 which makes importing 40% of our food look quite modest.4 Until recently, it was believed that the UK could reliably import all the timber we needed. "
        },
        {
            "text": "However, the Covid pandemic, the war in Ukraine and the developing situation with global trade have demonstrated that supply chains are less reliable than previously thought. This is a useful reminder that the Forestry Commission was partly set up to ensure we had a strategic supply of home-grown timber."
        },
        {
            "heading": 2,
            "text": "The outlook for UK hardwood"
        },
        {
            "text": "While the current and future demand for softwood is clear, what about UK hardwoods? Most UK broadleaf woodlands (52% of our total forest cover) are undermanaged in terms of hardwood timber production, and both existing and new woodlands have deer and grey squirrel problems.5 As a result – unsurprisingly – the quality of the timber produced is generally poor, hence we either import ready-made hardwood products or hardwood from the USA, Estonia, France and Italy to make products here."
        },
        {
            "text": "Meanwhile, 85% of our home-grown hardwood harvest is not made into anything and is instead mainly burned to generate heat and power.6 In the longer term two options need to be pursued. We need:"
        },
        {
            "text": "Now is a good time for landowners, farmers, agents and foresters to plant trees. The government target is to increase forest cover by 2% and the demand for softwood is rising exponentially. Meanwhile hardwoods are a sleeping giant waiting for the innovation of the bioeconomy to unlock their latent potential. This is tree-mendous news."
        }
    ]
}