{
    "url": "https://governmentscienceandengineering.blog.gov.uk/2025/05/20/world-bee-day-2025/",
    "title": "World Bee Day 2025",
    "authors": [
        "gseprofession"
    ],
    "categories": [
        "Guest Blog"
    ],
    "pub_date": "2025-05-20T11:12:47+01:00",
    "content": [
        {
            "text": "By the Bees Needs Team, Department for Environment Food and Rural Affairs (DEFRA) "
        },
        {
            "text": "As the Department for Environment Food and Rural Affairs (DEFRA) Bees Needs Team with responsibility for pollinators, we lead on wild pollinator public engagement activities, including our fantastic Bees’ Needs Week. We’ll be sharing some information about that week to support 2025’s World Bee Day celebrations.  "
        },
        {
            "text": "Why are pollinators important? "
        },
        {
            "text": "Pollinators support our wider ecosystem by pollinating trees and flowers, which in turn support insects, birds, and mammals by providing food, shelter, and other resources. Pollinators are also particularly important when it comes to food production. The economic contribution of wild bees (which pollinate between 85%-95% of the UK’s insect pollinated crops), have been assessed to be worth about £1,800 per hectare.  That adds over half a billion pounds a year to the value of UK crops and food production.   "
        },
        {
            "text": "Bees’ Needs Week "
        },
        {
            "text": "Bees’ Needs Week is an annual event coordinated by our team. We work alongside a host of organisations including conservation groups, businesses, and charities. The aim of the week is to raise awareness of the importance of pollinators and share ideas, actions, and activities that highlight the ways everyone can help bees and other pollinators thrive. This year, Bees’ Needs Week is taking place between 14-20 July, and several events are being held across the country with activities such as Flower-Insect Timed Counts (FIT Counts), a live bumble beehive to observe, informative talks, and rare bee surveys.     "
        },
        {
            "text": "Wondering how you can get involved?  "
        },
        {
            "text": "We really encourage everyone get involved, nurture nature, and help our pollinators thrive by taking 5 simple actions:  "
        },
        {
            "text": "Citizen science  "
        },
        {
            "text": "You can also get involved with invaluable citizen science projects by simply spending 10 minutes watching flowers and insects in good weather. Flower Insect Timed (FIT) Counts can be done anywhere, including gardens and parks, in warm, dry weather and at any time from April to September. Every count submitted to the UK Pollinator Monitoring Scheme (PoMS) helps us learn more about where pollinators live and how their numbers are changing. Read the PoMS instructions for FIT Counts to find out more and help us help pollinators!  "
        },
        {
            "text": "Thank you for reading, and Happy World Bee Day!  "
        }
    ]
}