{
    "url": "https://vets.blog.gov.uk/2025/01/31/a-year-on-since-the-xl-bully-ban/",
    "title": "A year on since the XL Bully ban",
    "authors": [
        "Dr Christine Middlemiss BVMS MRCVS"
    ],
    "categories": [
        "Government Veterinary Services"
    ],
    "pub_date": "2025-01-31T14:34:28+00:00",
    "content": [
        {
            "text": "This week marks a year since the ban on XL Bullies came into effect, making it illegal to own an XL Bully in England and Wales unless it has been registered and complies with strict rules, including being neutered and kept muzzled and on a lead in public."
        },
        {
            "text": "The decision was made following a concerning rise in fatal dog attacks, and the involvement of XL Bullies in so many of these tragic attacks. This is why it was so important that urgent steps were taken to implement the measures and protect public safety."
        },
        {
            "text": "In order to safely manage the existing population of these dogs, certain restrictions were brought in to ensure owners of XL Bullies registered their dogs and complied with strict rules. This included, keeping them on a lead and muzzled when in public and having the dogs neutered."
        },
        {
            "text": "Over 57,000 XL Bullies have been registered with the Defra. Registering these dogs when they are in such large numbers and such big physical dogs, is imperative for public safety as it allows us to understand where these dogs are and who is responsible for them, and it is encouraging to see that so many people have complied."
        },
        {
            "text": "It remains that motivating responsible dog ownership across all breeds of dog is crucial. Dog owners must make sure that they choose dogs that fit into their home, their family, and their lifestyle and that they understand the costs involved and can train and socialise their dogs properly. This will help to address dog control issues before they escalate and help ensure communities are protected."
        },
        {
            "text": "The ban continues to enjoy high levels of public support and owners are expected to comply with these requirements. I urge all owners of XL Bullies to continue following the rules which have been put in place for public safety."
        },
        {
            "text": "For the rules you must follow if you own an XL Bully dog in England and Wales click here."
        }
    ]
}