{
    "url": "https://insidedvla.blog.gov.uk/2025/01/31/how-i-became-a-trainee-software-engineer-in-just-4-steps/",
    "title": "How I became a Trainee Software Engineer in just 4 steps!",
    "authors": [
        "Kloe Chaplin"
    ],
    "categories": [
        "Features"
    ],
    "pub_date": "2025-01-31T10:20:52+00:00",
    "content": [
        {
            "text": "Before becoming a Trainee Software Engineer, I had worked in various enjoyable roles within DVLA. However, digital had always been my passion and it was a discipline I really wanted to pursue."
        },
        {
            "text": "So in 2023, with a view to beginning a new career, I joined DVLA’s digital advocacy group, Digital Voices, which promotes digital careers and opportunities within DVLA. This provided the initial spark to help me take the first step to becoming a Trainee Software Engineer."
        },
        {
            "text": "In this blog, I want to share with you the 4 steps that helped me get my dream digital role!"
        },
        {
            "heading": 2,
            "text": "1. Becoming a digital advocate"
        },
        {
            "text": "My first step was to find out how to get involved in all things digital at DVLA. Joining Digital Voices gave me the chance to meet new people and build my confidence speaking to senior colleagues. I really appreciate the inclusivity of the community; the group is open and welcoming to anyone, regardless of their role within the agency."
        },
        {
            "text": "It’s an amazing opportunity to network with colleagues who you might not normally work with. I still try to attend as many activities as possible to learn more about digital careers and skills. Now that I’ve started my digital career, I hope to continue advocating for others who want to follow a similar path."
        },
        {
            "heading": 2,
            "text": "2. Finding a mentor"
        },
        {
            "text": "Through the new connections I made, I learned about DVLA’s mentorship programme. I joined the programme and was paired with an Agile Delivery Manager in the agency’s Information and Technology Services directorate. My mentor gave me advice on digital careers and shared relevant skills like Agile methodologies, project management and service delivery. By observing her work, her squad, and seeking her advice, I gained a deeper understanding of the skills needed to succeed in a digital career."
        },
        {
            "text": "Her mentorship helped to build my confidence and navigate challenges with support and practical advice. For example, my mentor worked with me on improving my interview skills, particularly in tailoring my responses to specific job requirements."
        },
        {
            "text": "I aspire to become a mentor myself and help others navigate their career paths. Mentorship has been crucial to my development, and I’d love to give back in the same way."
        },
        {
            "heading": 2,
            "text": "3. Attending ethical hacking workshops"
        },
        {
            "text": "Last year, I joined an 8-week ethical hacking programme, which taught me how to find weaknesses in IT systems and protect them from threats. The workshops were a fantastic experience. They not only equipped me with new technical skills but also provided me with a deeper understanding of the importance of ethical hacking."
        },
        {
            "text": "Hearing directly from the ethical hacking team was a highlight. Their passion for protecting systems was inspiring, and I left with a greater appreciation for how ethical hacking supports organisational security."
        },
        {
            "text": "My positive experience inspired me to apply for the Software Engineer Apprenticeship, a 2-year programme focusing on Microsoft Dynamics, a suite of cloud-based business applications that we use at DVLA."
        },
        {
            "heading": 2,
            "text": "4. Applying for the Software Engineer Apprenticeship"
        },
        {
            "text": "I took the plunge and applied for the Software Engineer Apprenticeship in October 2024. The programme offers staff with an interest in software engineering a chance to develop the skills they need to become a Software Engineer. It was a proud moment when I was told that my application was successful and I could start my role as Trainee Software Engineer, learning skills on the job."
        },
        {
            "text": "The first few weeks of the programme were a whirlwind! At first, I felt self-doubt as the only woman in my group, but I soon gained confidence. It was exciting to meet so many talented developers. I've already successfully passed the Power Platform Fundamentals exam and I’m now focused on preparing for the next certification. My goal is to apply my knowledge to practical projects which will help improve the user experience of DVLA systems and services."
        },
        {
            "text": "As I reflect on my career journey so far, every experience has helped me grow. The challenges I've faced have made me more resilient, and the successes I've achieved have boosted my confidence. I’m excited to continue my career in digital and encourage others to take the first step towards theirs."
        },
        {
            "heading": 2,
            "text": "Start your digital career!"
        },
        {
            "text": "If you’re thinking about starting a career in digital at DVLA, go for it! There are lots of opportunities for growth and development and you’ll be fully supported in your role."
        },
        {
            "text": "If you’re considering a career in digital, make sure you:"
        },
        {
            "text": "View our current vacancies and our upcoming development programmes at Civil Service Jobs. Good luck!"
        }
    ]
}