{
    "url": "https://defraenvironment.blog.gov.uk/2025/01/31/introducing-the-deposit-return-scheme-for-drinks-containers/",
    "title": "Introducing the deposit return scheme for drinks containers",
    "authors": [
        "Shehab Choudhury"
    ],
    "categories": [
        "Community",
        "Recycling",
        "Resources and waste",
        "Sustainability"
    ],
    "pub_date": "2025-01-31T08:41:07+00:00",
    "content": [
        {
            "text": "Hi there. I’m Shehab, a Team Leader at Defra and I want to tell you about the new deposit return scheme (DRS) for drinks containers, which will be introduced across England, Scotland and Northern Ireland in 2027. "
        },
        {
            "text": "When did you last buy a drink in a single-use container? Maybe it was a bottle of water in the morning, your favourite smoothie with a lunchtime meal deal, or a soft drink in a can – ready to enjoy whilst you unwind in the evening.  "
        },
        {
            "text": "Chances are it wasn’t very long ago – we get through a lot of them. 25 billion, in fact! That’s how many we buy across England, Northern Ireland and Scotland each year. "
        },
        {
            "text": "How many single-use bottles are thrown away?"
        },
        {
            "text": "An estimated 6.5 billion of these single-use drinks bottles and cans per year go to waste rather than being recycled. That's over 17 million each day. This means an unimaginably large amount of plastic, aluminium, or steel is used only once then thrown away. "
        },
        {
            "text": "Far too many of these bottles and cans end up littered on our high streets or strewn across our beaches and countryside, causing harm to our precious wildlife. Research from the Marine Conservation Society shows 97% of surveyed beaches were polluted with drinks-related items in 2023.  "
        },
        {
            "text": "Much of this coastal litter ends up floating in our waters. The  United Nations Environment Programme estimates that 75 to 199 million tonnes of plastic is currently found in oceans worldwide. "
        },
        {
            "text": "The same durability that makes plastic so useful for things like drinks containers also makes it nearly impossible for nature to completely break down. Instead, they break into tiny pieces called ‘microplastics’ which enter our food chains, harming ecosystems and biodiversity. "
        },
        {
            "text": "I cannot understate the scale and impact of this problem. But it doesn’t have to be this way. The new deposit return scheme will help to tackle this challenge whilst giving the public money back for returning drinks containers.  "
        },
        {
            "text": "So what is a deposit return scheme?  With successful examples in countries like Germany, Sweden and the Republic of Ireland, deposit return schemes are a common-sense way to encourage us all to recycle our drinks containers. "
        },
        {
            "text": "Under this scheme, a redeemable deposit is placed on specific drinks containers that can be claimed when the item is returned to a collection point, such as a local supermarket. "
        },
        {
            "text": "There’s no need for a receipt or proof of purchase, so anyone can return their own drinks containers or ones that they find, as long as they’re in good nick. This means we can all chip in to help clean up our communities – and get something for it. "
        },
        {
            "text": "This simple change will reward people for doing the right thing and recycling their empty drinks containers. Together, we will turn the tide on plastic waste."
        },
        {
            "text": "Deposit return schemes have a proven track record "
        },
        {
            "text": "The average return rate for European countries with a scheme is 87%, according to global eNGO Reloop, with Germany showing the best results at 98%. "
        },
        {
            "text": "More bottles and cans returned means more bottles and cans recycled – crucially meaning fewer items being littered and causing damage to ecosystems on land and at sea. "
        },
        {
            "text": "Just two years after a deposit return scheme was launched in Latvia, the number of drinks containers being found on the coastline of the Baltic Sea had reduced by half. During a clean-up of the Gauja river (the country’s largest), volunteers looked for drink containers eligible under the return scheme – they found zero!  Recycling an old idea  "
        },
        {
            "text": "You might have already seen deposit return schemes in action at events like music festivals, where picking up and returning a handful of bottles and cups can earn you some money back. "
        },
        {
            "text": "In fact, many may recall the smaller-scale bottle deposit schemes that some UK companies used to run in the 1960s-70s.   The idea isn’t new, but the scale of the ambition is.  "
        },
        {
            "text": "This deposit return scheme will span three nations: England, Northern Ireland, and Scotland, covering a combined population of 65 million. "
        },
        {
            "text": "If you’re wondering about Wales, they are working on their own DRS which will work alongside the schemes in England, Scotland, and Northern Ireland.  A more circular way of living  "
        },
        {
            "text": "Deposit return schemes ensure that valuable materials are collected, recycled and made back into new drinks containers – a perfectly sustainable loop.  "
        },
        {
            "text": "This is a great example of what is known as the circular economy. This is about maximising the life of our resources and reducing waste. This, in turn, delivers environmental benefits and boosts the economy with new green jobs and investment. "
        },
        {
            "text": "At its heart, the deposit return scheme is an environmental policy that will tackle the scourge of littered drinks containers, preserve our beaches and countryside, protect our wildlife and tidy up our streets. "
        },
        {
            "text": "What happens next "
        },
        {
            "text": "The deposit return scheme for drinks containers will be introduced in October 2027 in England, Northern Ireland, and Scotland. "
        },
        {
            "text": "We have been working closely with our Devolved Government colleagues, as well as industry, for several years to develop the policy and legislation. Now that the regulations are in place, we can appoint the scheme administrator – also known as the Deposit Management Organisation (DMO) – in April 2025."
        },
        {
            "text": "As with most other international schemes, the DMO will be a not-for-profit, industry-led body made up of drinks producers, retailers, and the wider supply chain, and will be responsible for the day-to-day running of the scheme. "
        },
        {
            "text": "Every community should be able to take pride in where they live, and this starts with clean streets and vibrant green spaces free from litter. Simple but ambitious changes like the deposit return scheme will help make this a reality."
        },
        {
            "text": "If you have any questions or would like further information, please contact DRS@defra.gov.uk. "
        }
    ]
}