{
    "url": "https://forestrycommission.blog.gov.uk/2025/01/31/is-your-woodland-a-home-for-hedgehogs/",
    "title": "Is your woodland a home for hedgehogs?",
    "authors": [
        "Alan Reid"
    ],
    "categories": [
        "Nature",
        "Woodland management"
    ],
    "pub_date": "2025-01-31T08:30:00+00:00",
    "content": [
        {
            "text": "I have little doubt that I have been fortunate in life. Surely anyone who gets to spend their life working outside with nature is blessed? I have been privileged to spend time in the company of otters, dormice, adders, fritillaries, goshawks, and so the list goes on."
        },
        {
            "text": "One species, however, is too often overlooked and not often seen in the depths of our woodlands: the humble hedgehog, Mrs. Tiggywinkle (sorry, and thankfully, I am too old for Sonic!)."
        },
        {
            "text": "When I was a kid, hedgehogs were everywhere. I well remember my mum constantly telling me not to pick them up as they were “covered in fleas, and they’ll get in your hair”! A mature adult can have 5,000 or so spines for these critters to hide in."
        },
        {
            "text": "I also remember the first time I came across a hedgehog doing what can only be described as hedgehog zoomies—running round in circles early in the morning for what seemed like just the fun of it."
        },
        {
            "heading": 2,
            "text": "Habitat challenges"
        },
        {
            "text": "Hedgehogs have to be among the most disarming creatures in our countryside. I will accept that a snoozing dormouse probably trumps it, but hedgehogs really are engaging creatures. They require just a diet of ground-dwelling invertebrates, especially earthworms, and somewhere warm to nest and hibernate. They really do ask for very little."
        },
        {
            "text": "However, our modern world creates challenges – bigger fields, fewer hedgerows, busy roads, weedkillers, pesticides and gardens giving way to patios and parking."
        },
        {
            "text": "No one wants a “gappy bottom” in your hedgerow, but the practice of cutting them year on year with a tractor mounted side-arm flail produces just that. That’s no good for a creature that uses these linear features for transport and both winter and summer nests. In summer, the thornier and ‘nettleier’ the better (yes, I know that’s not a word, but you know what I mean). In winter, the denser the bramble patch the better."
        },
        {
            "heading": 2,
            "text": "Red list species"
        },
        {
            "text": "We should all now be well aware that we are in a nature crisis. The humble hedgehog is far from exempt from this. Listed as 'vulnerable to extinction' on the red list for mammals, the hedgehog, along with many other species, requires a call to action. "
        },
        {
            "text": "Most hedgehogs today are recorded in urban settings. Conservation projects like Hedgehog Street have advice on making gardens hedgehog-friendly, including:"
        },
        {
            "heading": 2,
            "text": "Why woodland suits hedgehogs"
        },
        {
            "text": "Natural Shelter: Woodlands provide plenty of natural shelters, such as fallen leaves, logs, and dense undergrowth, where hedgehogs can hide from predators and rest during the day."
        },
        {
            "text": "Abundant Food Supply: These habitats are rich in insects, snails, worms, and other invertebrates, which are key components of a hedgehog's diet."
        },
        {
            "text": "Climate Regulation: Woodlands offer a more stable microclimate, protecting hedgehogs from extreme temperatures and harsh weather conditions."
        },
        {
            "text": "Spacious Habitat: The diverse structure of woodlands, with its layers of canopy, shrub, and ground vegetation, allows hedgehogs to move around easily and find suitable nesting sites."
        },
        {
            "text": "Woodlands managed for timber can still be good for hedgehogs, especially Plantations on Ancient Woodland Sites (PAWS). These are woodlands where the ‘natural’ woodland was cleared and replaced with a plantation of native or exotic species, and which are now being restored."
        },
        {
            "heading": 2,
            "text": "What woodland owners and managers can do"
        },
        {
            "text": "As a Nature Recovery Advisor, I will be doing all I can to ensure a better future for not only our hedgehogs but all the creatures that we are fortunate enough to share this isle with. I hope you will too."
        }
    ]
}