{
    "url": "https://naturalengland.blog.gov.uk/2025/01/31/luf-t-off-for-a-more-strategic-approach-to-growth-and-nature/",
    "title": "'LUF-t off' for a more strategic approach to growth and Nature",
    "authors": [
        "Natural England"
    ],
    "categories": [
        "Biodiversity",
        "Biodiversity Net Gain",
        "Environmental Improvement Plan",
        "Farming",
        "Flood Management",
        "Landscapes",
        "Natural England",
        "Nature Recovery",
        "Nature-based solutions",
        "Protected sites and species",
        "Science and evidence",
        "Site of Special Scientific Interest",
        "Special Protection Area",
        "Species recovery",
        "Tree Planting",
        "Wildlife",
        "wildlife and farming"
    ],
    "pub_date": "2025-01-31T12:53:19+00:00",
    "content": [
        {
            "text": "By Tony Juniper CBE, Chair of Natural England"
        },
        {
            "text": "As the country seeks long-term solutions to our most pressing problems – how to build much-needed homes and infrastructure, safeguard food production and halt and reverse the decline of Nature – we may be about to make significant progress on all these and other fronts."
        },
        {
            "text": "That progress is set to take place against the rather challenging context of us needing to make the best use of a limited resource: land. England’s population of more than 57 million people relies on only about 130,000 square kilometres of territory, to meet all our needs, beyond that which we import from other countries. In securing progress against multiple national aims, it is clear that a more integrated framework would help."
        },
        {
            "text": "That’s why today it is so welcome to see the launch of the Government's much-anticipated Land Use Framework Consultation, kickstarting a 12-week period that will help to shape the way we engage with our natural and built environments in England for decades to come."
        },
        {
            "text": "The LUF consultation presents Government's assessment of the scale of land use change required to meet Environmental Improvement Plan (EIP) and Climate Change Act targets, and how we achieve these alongside the land needed for food, housing and energy. In a country as small as ours, balancing the different priorities competing for finite space will be critical – meeting this challenge will be difficult but a Land Use Framework is a vital step towards success, provided we can collaborate across government, business, communities and charities."
        },
        {
            "text": "As the Government's statutory adviser on the natural environment, this landmark consultation touches everything Natural England does, from protected sites regulation to ambitious Landscape Recovery projects, spatial planning to access to Nature and the many benefits this has for people’s health. The LUF which emerges from it will have the potential to shape our work and our partnerships, drawing on the many tools already at our disposal."
        },
        {
            "text": "The Government has rightly put the natural environment at the heart of the Land Use Framework Consultation. After all, Nature is fundamental to solving so many of the challenges we face, including health, wellbeing, and resilience to climate change. Our economy is embedded within Nature, not separate from it; indeed Natural England’s recent State of Natural Capital Report highlighted the extent to which the growing risk to our ecosystems directly translates into a real threat to society and the economy. The evidence is clear – and piling up – that we cannot achieve sustainable long-term economic growth without flourishing biodiversity and a stable climate."
        },
        {
            "text": "With our limited supply of land, some have argued that our natural environment must make way for more homes, roads and railways. However, Nature is a crucial partner to the growth agenda. As this consultation shows, integrating Nature recovery into the delivery of housebuilding and renewable energy infrastructure at the outset can help us to reach shared, cross-government objectives and increase economic returns. Not only that, it ensures that new developments are more resilient to the effects of heat, drought and flooding, placing less of a strain on water supplies. Indeed, with strategic planning we can take advantage of the many synergies available, accelerating new, greener developments with multiple benefits for people and wildlife, at the same time as directing finance to where it will have the greatest impact for the natural world."
        },
        {
            "text": "Taking this more integrated approach that goes beyond tired old trade-offs, such as homes versus Nature or farming versus wildlife, will help us embrace the joined-up approaches that are absolutely vital in laying the foundations for a secure, healthy and resilient future. The fact is that we can and must pursue multiple objectives all at once, not choose between them. On the intersection between farming and environment I outlined in my recent blog post why a healthy environment is a prerequisite for thriving farm businesses and sustainable food production through the coming decades."
        },
        {
            "text": "What is critical though is to apply this joined-up approach at the right scale. Whilst much integration can be done locally at site level, this has its limits; we must also undertake integrated planning of land uses at scale (likely landscape, catchment and county level), with the flexibility and opportunity to achieve multiple objectives in a place."
        },
        {
            "text": "So much for the broader context, but what about the question of how Government's land use objectives will be achieved? Put simply, a Land Use Framework can align local actions with national ambitions by coordinating the Nature recovery tools at our disposal. This will mean expanding and targeting Environmental Land Management schemes, and supporting farmers to deliver public money for public goods. It will mean shaping the emerging Local Nature Recovery Strategies to achieve local EIP delivery. And it will mean working in partnerships across the country to honour the 30by30 commitment to protect 30% of the UK's land and sea by 2030. This includes increasing join-up in places between bodies such as Natural England and local authorities, as well as integrated action by us and the Environment Agency support local businesses and developers operating within the framework."
        },
        {
            "text": "The Land Use Framework Consultation acknowledges that some areas, such as our Protected Landscapes, have the potential to deliver more for Nature than other areas of the country. We hope this consultation will provide the impetus for bold action – backed by clear policies and incentives – to make our most treasured landscapes wilder, more resilient, and more accessible, all the while protecting their celebrated heritage and culture."
        },
        {
            "text": "We look forward to working with our partners in the public and private sector, and with farmers, land managers and landowners to pursue this vision for land use in England. Through collaboration and shared ownership of our goals we can achieve our ambitious environmental targets while setting the foundations for long-term food and economic security and a healthier, happier society."
        }
    ]
}