{
    "url": "https://aphascience.blog.gov.uk/2025/01/31/protecting-online-plant-buyers/",
    "title": "How APHA is protecting online plant buyers",
    "authors": [
        "Dan Munro"
    ],
    "categories": [
        "Plant health"
    ],
    "pub_date": "2025-01-31T10:16:03+00:00",
    "content": [
        {
            "text": "An increase in online plant sales has brought an increased threat of plant pests and diseases. Dan Munro, Senior Technical Manager for Plant Passporting at the Animal and Plant Health Agency (APHA), explains what APHA, as part of the United Kingdom (UK) Plant Health Service, is doing to reduce these risks."
        },
        {
            "text": "Online plant sales are booming. Plants provide the UK with an estimated annual value of £15.7 billion. But with the increase in plant sales comes an increased threat of plant pests and diseases as many of these plants will be imported."
        },
        {
            "heading": 2,
            "text": "Plant passporting"
        },
        {
            "text": "When the UK left the European Union (EU), the Department for Environment, Food and Rural Affairs (Defra), introduced the UK plant passporting scheme to align with a similar EU scheme. Plant Passporting requires any professional operator in England or Wales moving plants to other professional operators within Great Britain (GB) or the Crown dependencies, or by distance contract, such as online sales, to issue plant passports. To do this, professional operators must first register on APHAs Professional Operator database and then apply for authorisation to issue Plant Passports. Scotland have a similar scheme, and Northern Ireland remains in the EU plant passporting scheme."
        },
        {
            "text": "Once authorised, the professional operator must inspect the plants they grow or trade in, and attach a UK plant passporting label (the plant passport) for each plant or batch of plants, which must travel with the plants. This means that if a plant pest or disease is found, APHA can easily and quickly trace all relevant plants to reduce the risk of an outbreak."
        },
        {
            "heading": 2,
            "text": "The list of authorised distance plant sellers"
        },
        {
            "text": "In 2024, APHA carried out a review of the top 100 online plant sellers by Google search, and found that more than 20% were not authorised to issue UK plant passports."
        },
        {
            "text": "Unregulated distance sales, for example, via the internet or mail order, have been found to include illegal goods containing pests and diseases. Also, the nature of distance sales means that traditional inspection methods (for example, visiting a premises) are less effective."
        },
        {
            "text": "To address this, we have created a voluntary list of businesses that have been authorised to issue plant passports for plants sold by distance contract. This will make it easier for UK plant buyers to tell if a plant seller is authorised and will enable businesses to demonstrate that they are reputable plant sellers."
        },
        {
            "text": "Businesses that are already authorised to issue plant passports can add their details to the list. Details of how to do this, as well as the current list of authorised plant sellers are available on GOV.UK."
        }
    ]
}