{
    "url": "https://nationalscreening.blog.gov.uk/2025/01/31/targeted-lung-health-check-programme-renamed-the-nhs-lung-cancer-screening-programme/",
    "title": "Targeted Lung Health Check Programme renamed the NHS Lung Cancer Screening Programme",
    "authors": [
        "Charlotte Smith"
    ],
    "categories": [
        "General"
    ],
    "pub_date": "2025-01-31T09:02:03+00:00",
    "content": [
        {
            "text": "From 1 February 2025, the NHS Targeted Lung Health Check (TLHC) Programme will become known as the NHS Lung Cancer Screening Programme."
        },
        {
            "text": "In June 2023, the Westminster government announced the rollout of a national targeted lung cancer screening programme following a recommendation from the UK National Screening Committee (UK NSC)."
        },
        {
            "text": "Lung cancer screening aims to detect lung cancer sooner, often before symptoms develop and when treatment is more likely to be successful."
        },
        {
            "text": "The name change is an important milestone in the scaling up and transformation of the TLHC initiative into this new national screening programme. The new name is consistent with the national NHS screening programmes and follows research that showed it would help improve understanding of the programme and its purpose."
        },
        {
            "text": "So far, more than 1 million people have taken up their lung cancer screening invitations and screening has diagnosed more than 5,500 people with lung cancer. Over 75% of these lung cancers were found at an early stage (1 or 2), compared to less than 30% of lung cancers detected outside of screening."
        },
        {
            "text": "More information can be found on the programme website."
        },
        {
            "heading": 2,
            "text": "Keep up to date "
        },
        {
            "text": "The UK NSC blog provides up to date news from the UK NSC. You can register to receive updates direct to your inbox, so there is no need to keep checking for new articles. If you have any questions about this blog article, or about the work of the UK NSC, please email uknsc@dhsc.gov.uk. "
        }
    ]
}