{
    "url": "https://governmentscienceandengineering.blog.gov.uk/2025/03/10/british-science-week-2025/",
    "title": "British Science Week 2025",
    "authors": [
        "gseprofession"
    ],
    "categories": [
        "Guest Blog",
        "Science"
    ],
    "pub_date": "2025-03-10T09:56:34+00:00",
    "content": [
        {
            "heading": 2,
            "text": "Change and adapt: From lab bench to government"
        },
        {
            "text": "To celebrate British Science Week, and this year’s theme of ‘change and adapt’ we hear from Grace, a GSE member and scientist by background, who shares her journey from the lab bench to government.  "
        },
        {
            "text": "Chemistry background "
        },
        {
            "text": "My background is in Inorganic Chemistry, spending three years in the lab making ‘interlocked host systems for anion recognition’ for my PhD – a fancy way of saying, I made 3D molecular structures, which acted like a cage, trapping specific things inside and providing a response, e.g. changing colour to tell you something was trapped inside! "
        },
        {
            "text": "Moving from lab bench to government  "
        },
        {
            "text": "Towards the end of my PhD, I attended a Centre for Science and Policy Conference focusing on the role of research evidence to inform policy making and was really drawn to moving into a career that delivered real-world impact of research. Motivated by this, and wanting to apply my scientific knowledge in a new setting to bring impact to a wider range of people, I joined government in 2020 working on Public Sector Decarbonisation in the Department for Business, Energy and Industrial Strategy. Since then, I’ve also worked in the GSE Profession team in the Government Office for Science, before most recently moving to the Department for Science, Innovation and Technology as Fiscal Strategy Lead, working on the Spending Review.  "
        },
        {
            "text": "Changing and adapting  "
        },
        {
            "text": "The transition from academia to government required a shift in mindset. In academia, the focus is often on pure research, driven by discovery. In government, however, the focus shifts to the impact and benefits of our work. We always think about why we are doing something and what the broader implications are to ensure we are delivering a tangible difference to people’s lives.  "
        },
        {
            "text": "Applying science to policy "
        },
        {
            "text": "Although I have not used my specific scientific knowledge in my civil service roles, I use the skills built up during my PhD, including project management, analytical thinking, communicating complex information in an accessible way, and resilience on a daily basis. Policy/advice development and the scientific method follow very similar processes – just with potentially very different subject matters!  "
        },
        {
            "text": "Final thoughts "
        },
        {
            "text": "I have loved my journey from academia to government – it’s been incredibly rewarding to build a career on the foundation of my passion for science, utilising the skills developed in my academic background, to make a difference in the civil service.   "
        },
        {
            "text": "Thank you for sharing your journey with us Grace. If you would like to find out more about British Science Week, please visit the website. "
        }
    ]
}