{
    "url": "https://moderncivilservice.blog.gov.uk/2025/03/10/innovators-and-changemakers-celebrating-women-in-the-civil-service/",
    "title": "Innovators and changemakers: Celebrating women in the Civil Service",
    "authors": [
        "Government Reform"
    ],
    "categories": [
        "A Modern Civil Service",
        "Ambitious",
        "Innovation",
        "Interview",
        "Modernisation and Reform",
        "Policy",
        "Proud Civil Servant",
        "Skilled"
    ],
    "pub_date": "2025-03-10T11:08:29+00:00",
    "content": [
        {
            "text": "Whilst reflecting on International Women’s Day 2025, we’d like to shout-out to all the amazing women of the Civil Service who we spoke to over recent months as part of our Meet the Modern Civil Service series. If you missed any of the interviews, this is your chance to catch up and get inspired!"
        },
        {
            "heading": 2,
            "text": "Jo Shanmugalingam"
        },
        {
            "text": "Jo Shanmugalingam, Second Permanent Secretary at the Department for Transport, shared her insights on innovation and various inspiring initiatives, including the implementation of AI for detecting fraud in electric vehicle charging point applications. She spoke about her experience with job sharing as an example of innovation in ways of working: \"Job sharing presents an intriguing opportunity for both innovation and resilience. How can we incorporate moments of reflection into our work?\" "
        },
        {
            "text": "Read Jo Shanmugalingam's interview blog article. "
        },
        {
            "heading": 2,
            "text": "Alexandra Whiteley"
        },
        {
            "text": "Alexandra Whiteley, Head of Events and Engagement at the Cabinet Office, discussed her role in organising Civil Service Live. She emphasised the importance of delivering impactful events that drive behavioural change and skills development across the Civil Service, with Civil Service Live 2024 attracting over 20,000 delegates across 685 sessions. \"Before you get started, you need to think about what behaviour change you are trying to achieve by communicating your content via an event.\""
        },
        {
            "text": "Alexandra Whiteley's interview blog article."
        },
        {
            "heading": 2,
            "text": "Carol Bernard"
        },
        {
            "text": "Carol Bernard, Executive Director of Line Management Capability, shared her insights on leadership and the new Line Management Standards in the Civil Service. She discussed her journey from youth work to senior civil service positions, emphasising the importance of authentic leadership and supportive line management. Reflecting on workplace diversity, she shared a powerful insight from a colleague who told her \"your difference is your superpower,\" highlighting the value of bringing one's authentic self to work in the Civil Service."
        },
        {
            "text": "Read Carol Bernard's interview blog article. "
        },
        {
            "heading": 2,
            "text": "Sarah Munby"
        },
        {
            "text": "Sarah Munby, Permanent Secretary at the Department for Science, Innovation and Technology (DSIT), shared her perspectives on modernisation and innovation: \"Nothing good ever works the first time — it takes iteration and learning to make change happen. And failure is part of that.”"
        },
        {
            "text": "Read Sarah Munby's interview blog article."
        },
        {
            "heading": 2,
            "text": "Sue Bateman"
        },
        {
            "text": "Sue Bateman, Chief Data Officer at the Department for Environment, Food and Rural Affairs, discussed the transformation of the Civil Service through digital and data initiatives. She emphasised that data should be seen as an enabler for delivering better public services, highlighting successful cross-department initiatives like the BOLD Programme and Digital Economy Act implementations."
        },
        {
            "text": "Read Sue Bateman's interview blog article here."
        },
        {
            "heading": 2,
            "text": "Jenny Brooker"
        },
        {
            "text": "Jenny Brooker, Chief Data Architect at Central Digital Data Office, discussed how data integration is transforming the Civil Service and used the example of the Warm Home Discount Scheme, highlighting how \"cross-government data sharing between four different departments and 17 energy suppliers enabled 3 million low income rebates to low income households during winter 2022 and 2023.\""
        },
        {
            "text": "Read Jenny Brooker's interview blog article here."
        }
    ]
}