{
    "url": "https://competitionandmarkets.blog.gov.uk/2025/03/10/our-new-consumer-enforcement-regime/",
    "title": "Our new consumer enforcement regime",
    "authors": [
        "Sarah Cardell"
    ],
    "categories": [
        "Consumer protection",
        "Growth and investment"
    ],
    "pub_date": "2025-03-10T12:01:06+00:00",
    "content": [
        {
            "text": "Today I gave a speech at techUK’s tech policy conference where I touched on the CMA’s new consumer enforcement regime ahead of our new powers coming into force on 6 April."
        },
        {
            "text": "The CMA’s new direct enforcement powers mean that the CMA will be able to decide whether key consumer protection laws have been breached without having to take businesses to court, and we will be able to take direct action to tackle these breaches including through fines and redress."
        },
        {
            "text": "At the beginning of April, alongside finalised guidance for the new regime, we will publish an approach document which will include more detail on our enforcement priorities for the first 12 months. "
        },
        {
            "text": "It will also explain more fully how we plan to apply the ‘4Ps’ framework (our focus on pace, predictability, proportionality and process) to the new consumer protection regime. "
        },
        {
            "text": "In the meantime, we are today providing an update ahead of those publications in particular to help guide businesses as they prepare to comply with the new regime."
        },
        {
            "heading": 2,
            "text": "Update on our consultation and next steps"
        },
        {
            "text": "In recent months, we have consulted extensively on guidance for the new regime, receiving helpful and constructive feedback from a range of stakeholders."
        },
        {
            "text": "We have heard loud and clear that businesses – large and small – want to do the right thing for their customers and many are working hard to ensure they comply. But for smaller businesses especially, the compliance burden must be proportionate."
        },
        {
            "text": "Taking that feedback on board, we will:"
        },
        {
            "text": "Before 6 April, we'll publish:"
        },
        {
            "text": "Ahead of these publications, we want to provide further detail on 2 specific areas."
        },
        {
            "heading": 3,
            "text": "Drip pricing"
        },
        {
            "text": "We are taking a phased approach to our guidance on this – which was the issue we received the most substantive feedback on."
        },
        {
            "heading": 3,
            "text": "Fake reviews"
        },
        {
            "text": "Fake reviews are a banned practice under the DMCCA. Although we can tackle fake reviews under our existing powers, we recognise that new provisions may require changes to systems and compliance programmes."
        },
        {
            "text": "We hear that businesses need time to bed these in, and so for the first 3 months of the new regime we will focus on supporting businesses with their compliance efforts rather than enforcement."
        },
        {
            "heading": 2,
            "text": "Enforcement priorities"
        },
        {
            "text": "The remaining law where our new direct enforcement powers can be used hasn’t changed materially. However, we recognise that the risks of getting it wrong are changing substantially."
        },
        {
            "text": "Businesses have told us they are preparing to comply and will be relying on the clarity and certainty provided by our final Guidance, as well as further detail on our early enforcement priorities to be published at commencement in April."
        },
        {
            "text": "Our early enforcement action following commencement is likely to focus on more egregious breaches. "
        },
        {
            "text": "For example:"
        },
        {
            "text": "At the same time, we will support the vast majority of well-intentioned businesses who want to do the right thing but may be unclear on exactly what is needed to ensure compliance, especially in areas where the law has been updated or there is less clear-cut precedent. We will also take into account where businesses have taken proactive steps to correct infringing conduct, in deciding the appropriate level of a penalty."
        },
        {
            "heading": 2,
            "text": "Delivering a robust, effective regime"
        },
        {
            "text": "Taken together, I am confident this approach will deliver robust protections for consumers, focusing on clearly illegal conduct that results in tangible harms."
        },
        {
            "text": "At the same time, it gives the business community the clarity to comply with new laws as quickly as possible - and the confidence that early enforcement action will be proportionate."
        },
        {
            "text": "This is, after all, in the interests of both businesses and consumers; when businesses get it right, consumers benefit."
        }
    ]
}