{
    "url": "https://naturalengland.blog.gov.uk/2025/10/07/nature-returns-4-years-on/",
    "title": "Nature Returns: 4 years on",
    "authors": [
        "Mike Morecroft",
        "Moira Scarff"
    ],
    "categories": [
        "Natural England",
        "Nature",
        "Nature Returns",
        "Nature-based solutions"
    ],
    "pub_date": "2025-10-07T09:00:00+01:00",
    "content": [
        {
            "text": "Nature Returns is a flagship programme led by Natural England, which is delivering practical solutions for nature and climate and building robust scientific evidence to support policy and investment decisions."
        },
        {
            "text": "Nature-based solutions address problems in ways that benefit both people and nature. For example, trees can take carbon out of the atmosphere and support biodiversity at the same time, and wetlands can store flood waters, build resilience to climate change and provide habitats for threatened species.As we look towards a Land Use Framework for England, we need to manage land for multiple benefits if we are to have any chance of meeting all the demands placed upon a small island by a growing population."
        },
        {
            "heading": 4,
            "text": "Background"
        },
        {
            "text": "The Nature Returns Programme has been running since 2021 and a summary report on achievements to date has recently been published."
        },
        {
            "text": "Good working relationships and efforts of a large cross-organisation team have been fundamental to the programme’s success. This includes fantastic partnership working with Royal Botanic Gardens, Kew, Environment Agency, Forestry Commission and six local partnerships around England, involving NGOs, local government and private landowners.  Defra and DESNZ, the sponsoring government departments, have also been closely involved.  The project has been mainly funded by HM Treasury’s Shared Outcomes Fund."
        },
        {
            "heading": 4,
            "text": "Habitat creation and restoration"
        },
        {
            "text": "In conjunction with the six local partnerships, the programme has delivered real land use change on the ground. This includes:"
        },
        {
            "heading": 4,
            "text": "Practicalities of creating new habitats within working landscapes"
        },
        {
            "text": "The practicalities of creating new habitats within working landscapes were explored through this work, with the programme providing the opportunity for local partners to try different approaches. Two key points stand out:"
        },
        {
            "heading": 4,
            "text": "Practical nature recovery complemented by science"
        },
        {
            "text": "A strong science programme at both Natural England and the Royal Botanic Gardens, Kew, has complemented the practical nature recovery work.  This has focused on enhancing our understanding of carbon storage in biodiverse habitats including hedgerows, grasslands, and woodlands. "
        },
        {
            "text": "One highlight includes a newly published scientific paper by the Natural England team comparing the soil carbon and biodiversity of species-rich grasslands of different ages.  This shows how biodiverse grasslands can take up and store carbon, particularly in the early years after their establishment."
        },
        {
            "text": "Colleagues at Kew have carried out detailed studies across the landscape at Wakehurst, Sussex to complement the wider scale work at Natural England.  This included a study of mycorrhizal fungi, which have a symbiotic relationship with plant roots.  The presence of some of these species is a good indicator of high carbon storage."
        },
        {
            "text": "The programme has also enabled the development of new techniques, including ways of monitoring carbon in scrub and hedgerows using non-destructive Lidar techniques – a real step forward in assessing the benefits of these habitats as nature-based solutions. "
        },
        {
            "text": "Environment Agency and Forestry Commission staff have worked with local partners to explore the opportunities and challenges associated with seeking private finance to support nature-based solutions in addition to government support. The Nature Returns team has published a range of reports and run workshops and webinars to help local projects in this area."
        },
        {
            "heading": 4,
            "text": "The future of the project"
        },
        {
            "text": "Nature Returns is continuing this year, with a big focus on climate change adaptation – how we can use natural solutions to reduce the risks associated with climate change.  For example, how trees and hedgerows can provide shade, and how restoring streams and creating wetlands can increase water retention in soils."
        },
        {
            "text": "Going forward a priority is to revisit our newly created habitats to see how they have developed and measure the extent to which carbon storage and biodiversity have been enhanced."
        },
        {
            "heading": 4,
            "text": "More information"
        },
        {
            "text": "You can find all of our publications and further information on the Nature Returns website, or by visiting the Nature Returns Access to Evidence page."
        }
    ]
}