{
    "url": "https://environmentagency.blog.gov.uk/2025/10/07/protecting-the-environment-in-east-anglia-during-prolonged-dry-weather/",
    "title": "Protecting the environment in East Anglia during prolonged dry weather",
    "authors": [
        "Environment Agency"
    ],
    "categories": [
        "Climate change",
        "Drought",
        "Environment Agency",
        "Fisheries and biodiversity",
        "Invasive species",
        "Rivers",
        "Water"
    ],
    "pub_date": "2025-10-07T09:36:54+00:00",
    "content": [
        {
            "text": "East Anglia is one of several areas across England experiencing prolonged dry weather or drought. Nationally, the Environment Agency is coordinating efforts through the National Drought Group to protect water supplies and the environment during this challenging period."
        },
        {
            "text": "Whilst the start of September has seen 40-60mm of welcome rain, it provides limited environmental benefits due to the exceptionally dry soils from the summer. Further rainfall, usually associated with autumn and winter, is required before our rivers, groundwater and ecology can recover."
        },
        {
            "text": "What's happening to the wildlife in our rivers"
        },
        {
            "text": "River levels across East Anglia are currently at some of the lowest levels recorded since summer 1976. Public water supplies are secure, but the combination of below average rainfall and warmer temperatures has created challenging conditions for the wildlife."
        },
        {
            "text": "When water levels drop and temperatures rise, there's less oxygen dissolved in rivers and streams. This creates stressful conditions for fish and other aquatic life, and in severe cases can lead to fish rescues."
        },
        {
            "text": "How we're responding"
        },
        {
            "text": "We've increased our environmental monitoring across East Anglia so we’ve been able to spot problems early and take action. Our teams have been measuring dissolved oxygen levels and river flows at over 100 additional sites throughout the region."
        },
        {
            "text": "Our fisheries teams have been:"
        },
        {
            "text": "Local success stories"
        },
        {
            "text": "Throughout the summer, where low levels of dissolved oxygen have been detected or reported, our staff have quickly intervened. Mechanical and chemical aeration equipment have raised oxygen levels back to a healthy condition saving thousands of fish."
        },
        {
            "text": "In Ipswich, we detected very low oxygen levels in the River Gipping. This was caused by a build-up of an invasive species call Azolla filiculoides (water fern). This non-native plant can quickly spread and block waterways, starving the water of oxygen. In response, our staff cleared substantial amounts of the invasive vegetation from the river. This work was supported by Anglian Water who temporarily reduced abstraction, increasing river flow."
        },
        {
            "text": "Throughout summer 2025, we have rescued fish from several local authority owned fishing ponds where water levels had dropped very low. Fish were carefully moved to enclosed lakes with better water levels. These lakes were not used for fishing so provided a safe home where fish could recover."
        },
        {
            "text": "You can read more about what the EA has been doing nationally to protect aquatic life during drought conditions:  From Fish to Rare Crayfish: England’s Drought Wildlife Rescue Operations  – Creating a better place"
        },
        {
            "text": "What’s our long-term response?"
        },
        {
            "text": "It can take a long time for rainfall to fully replenish groundwaters, reservoirs and rivers. The environment can take even longer to recover. Therefore, we'll continue monitoring the situation and act where necessary to protect the environment and wildlife."
        },
        {
            "text": "The Environment Agency continues to work nationally to monitor and respond to drought conditions. Through the National Drought Group, we’re coordinating efforts with water companies, farmers, environmental organisations and local authorities to safeguard water supplies and protect wildlife. You can read more about the national response here."
        },
        {
            "text": "How can the public help?"
        },
        {
            "text": "Everyone can continue to play a part in managing the impact of dry weather:"
        },
        {
            "text": "Find the latest information here:  weekly dry weather summaries, water situation reports, and the Water hub."
        }
    ]
}