{
    "url": "https://ipo.blog.gov.uk/2025/10/07/whats-changing-patent-examination/",
    "title": "What’s changing – Patent examination",
    "authors": [
        "Simeon Bowen"
    ],
    "categories": [
        "Digital",
        "Innovation",
        "IPO",
        "Patents",
        "Transformation"
    ],
    "pub_date": "2025-10-07T14:59:57+01:00",
    "content": [
        {
            "text": "Our One IPO Patent Service is set to launch in early 2026. This new platform will revolutionise the way you apply for, oversee and track patents, delivering a modern approach to intellectual property management. "
        },
        {
            "text": "We are publishing a weekly blog series to provide you with comprehensive guidance on each aspect of the upcoming changes. Our goal is to ensure you're fully prepared and confident for a seamless move to our new digital service. "
        },
        {
            "text": "Last week we shared details of how applying for a patent will change. Now we’re going to focus on the next stage of the patent application process – patent examination. This is where our patent examiners scrutinise the patent application to make sure it meets the criteria for granting a patent and explain any reasons why it can’t be. "
        },
        {
            "heading": 3,
            "text": "What are the benefits of the new examination process? "
        },
        {
            "text": "There are several benefits to the new process:"
        },
        {
            "heading": 3,
            "text": "How patent searches and exams work "
        },
        {
            "text": "In the One IPO service you will receive an email notification once your patent search or examination has been completed. The email will contain a link that will take you to the relevant patent – you’ll have to be logged in to access it. "
        },
        {
            "text": "Within each patent record there’s an ‘upcoming actions’ heading. When an examination report is ready to be viewed, a link saying ‘respond to examination report’ will appear. This will allow you to respond to what the patent examiner has said and provide any additional information necessary. "
        },
        {
            "heading": 3,
            "text": "What’s different about responding to an exam report? "
        },
        {
            "text": "The ‘respond to an exam report’ page looks very similar to the ‘apply for a patent’ page. You will be able to upload revised documents for descriptions, claims and drawings if necessary. Similarly to the new application service, you will need to attach these separately, rather than as one combined document. "
        },
        {
            "text": "You must also upload a response document. This would essentially be your covering letter where you provide any comments for the patent examiner – for example, agreeing or disagreeing with their observations. "
        },
        {
            "text": "Previously, it’s been common practice for customers to submit ‘replacement pages’. That means only sending the IPO the pages of the document that have been changed. Now we’ll be asking for you to send us the complete document instead. This will make things quicker and more efficient because we won’t have to place the revised pages into the documents you have submitted. "
        },
        {
            "heading": 3,
            "text": "Can I mark-up documents? "
        },
        {
            "text": "When it comes to mark-up on documents (i.e. tracked changes or comments on documents) the rules are unchanged. You should submit documents with mark-up on with your covering letter. If you do not file clean copies of any marked up documents we will request them prior to processing your amendment."
        },
        {
            "text": "To aid our transition to One IPO, it would help us greatly if you could file complete copies of your amended patent specifications when submitting amendments through our legacy systems. For example, if you are submitting amendments to pages 3 and 8 of the description, it would be helpful if you could submit the following:"
        },
        {
            "text": "Complete copies of amended specifications allow us to process amendments more quickly, which is of increasing importance as we transition to our new services."
        },
        {
            "heading": 3,
            "text": "What’s the next step?"
        },
        {
            "text": "Once you have responded to the exam report, the process will repeat until both the applicant and the IPO are satisfied that the patent is ready to be granted or cannot be granted. You will be able to view your previous responses to the examiner and the associated documents in your account. "
        },
        {
            "text": "In some cases, there may be a slight delay in you being able to view your response to the examiner in your account. This is because we must first do a manual check to ensure that documents are suitable for publication (for example, ensuring personal information is redacted). Once this check has been completed, your response will be viewable in your account. "
        }
    ]
}