{
    "url": "https://civilservice.blog.gov.uk/2025/07/21/brushing-up-on-partnerships-civil-servants-secured-23-million-toothbrushes-to-improve-kids-health/",
    "title": "Brushing up on partnerships: Civil servants secured 23 million toothbrushes to improve kids' health",
    "authors": [
        "Dan Sorensen",
        "Flynn Hickey"
    ],
    "categories": [
        "A Modern Civil Service",
        "A Skilled Civil Service",
        "An Innovative Civil Service",
        "Uncategorized"
    ],
    "pub_date": "2025-07-21T09:48:29+00:00",
    "content": [
        {
            "text": "DHSC’s journey to improve children's dental health in the UK's most deprived areas, transformed through a partnership with Colgate-Palmolive. This initiative directly supports our government's mission to break down barriers to opportunity by giving children the best start in life. Flynn Hickey, Sector Insights and Commercial Strategy Lead and Dan Sorensen, Brand Manager share their journey on how this partnership came about, and what it means for future public-private sector collaborations."
        },
        {
            "text": "Flynn Hickey:"
        },
        {
            "text": "I never imagined I'd be transforming children's health with toothbrushes, but with child tooth decay reaching crisis levels in deprived areas, we needed bold solutions. Shockingly, the most common reason for children aged 5 to 9 being admitted to hospital is to have treatment for decayed teeth."
        },
        {
            "text": "When the Dental Policy Team was asked to explore corporate partnerships to improve children’s oral health, I felt excited as this was exactly the type of bold solution the commercial team were delighted to support the policy team to deliver."
        },
        {
            "text": "I led a market engagement inviting companies who shared our vision for reducing children’s oral health inequalities to collaborate with the government. When Colgate expressed interest, I saw real potential for a partnership, but I also recognised the challenges we’d face in getting many different parts of government, and Colgate, aligned to reach a first-of-its-kind agreement."
        },
        {
            "text": "By working innovatively with teams across policy, commercial, branding, legal and oral health professionals, we’ve been able to deliver a collaborative partnership that will reach 600,000 children a year in deprived communities and help instil good habits that last a lifetime."
        },
        {
            "text": "The numbers speak for themselves; Colgate-Palmolive will donate 23 million toothbrushes and toothpastes over five years. That’s millions of smiles protected, and thousands of children spared the pain of tooth decay."
        },
        {
            "text": "What began as a policy directive evolved into something dramatically different: a template for how government and business can collaborate for public good."
        },
        {
            "text": "We’ve delivered a Plan for Change initiative and by thinking differently about how we work with commercial partners, we unlocked significant resources for public health at no cost to the taxpayer. I’m so proud to have been part of it!"
        },
        {
            "text": "Branded partnerships between government and commercial entities have always been a challenge to navigate. Too commercial, and we undermine public trust. Too restrictive, and we lose business interest. The NHS brand, particularly, evokes high levels of trust, and we have a responsibility as government to ensure that trust is not eroded by inappropriate use."
        },
        {
            "text": "Our mission? How do we partner with a commercial organisation to serve public health without compromising the integrity of the NHS brand?"
        },
        {
            "text": "Over several months I worked closely with the policy, commercial, and legal teams to craft a brand strategy that was innovative yet compliant. There was a lot of excitement on all sides as we encountered problems, suggested ideas and found solutions. With Colgate, we eventually settled on a new ‘supporting NHS’ brand, which will feature across educational materials and a joint dual-branded awareness campaign.  "
        },
        {
            "text": "While this collaboration with Colgate is a first-of-its-kind, the ‘supporting NHS’ brand creates a template for future partnerships across various public health priorities. The potential is enormous. Just imagine similar collaborations addressing other preventable health issues, with partners who share our commitment to improving public health."
        },
        {
            "text": "This partnership shows what’s possible when creative government thinking solves pressing public health challenges. I’m so excited to see where it leads us next. "
        },
        {
            "text": "Want to chat about how your team could develop similar partnerships? Drop me an email at identity@dhsc.gov.uk – I’d love to share what we’ve learned on this journey. You can learn more about our supervised toothbrushing programme."
        },
        {
            "text": "This is part 3 of a four-part series marking 1 year of government by showcasing the extraordinary work of civil servants across the country delivering the Missions."
        }
    ]
}