{
    "url": "https://childrenssocialcare.blog.gov.uk/2025/07/21/civil-service-care-leavers-internship-scheme-2025-2/",
    "title": "My Path to the Civil Service: A Care Leaver's Perspective",
    "authors": [
        "Sebastian Moore"
    ],
    "categories": [
        "Care leavers"
    ],
    "pub_date": "2025-07-21T10:02:56+01:00",
    "content": [
        {
            "text": "I’m Sebastian Moore, a proud care leaver whose identity is shaped, but not defined, by my experiences. Fresh from my 2022 Politics & International Relations degree, I was uncertain about my future. The Civil Service Care Leavers Internship Scheme changed that. Starting in HM Treasury’s correspondence team, I found purpose. "
        },
        {
            "text": "Now a permanent IT Business Partner, I’m proof you can join the Civil Service, blend in, and thrive as yourself. This scheme isn’t just a job — it’s a launchpad for anyone ready to shine."
        },
        {
            "heading": 2,
            "text": "My first steps at HM Treasury"
        },
        {
            "text": "Stepping into HM Treasury felt like standing at the edge of possibility. As a care leaver, I was used to navigating life solo, but this scheme made me feel seen. My role? Driving robotic process automation in the correspondence team. Each task, from streamlining communications to solving complex challenges, felt like a chance to prove myself."
        },
        {
            "heading": 2,
            "text": "Career growth: automation projects and recognition in government"
        },
        {
            "text": "What lights me up? The chance to make a mark. Since joining the scheme, I have led automation projects and won the HMT Professional Award at No. 11 Downing Street, which was a real pinch me moment. However, the real joy is knowing my work challenges conventional thinking, as the Civil Service thrives on fresh voices."
        },
        {
            "heading": 2,
            "text": "Building professional networks"
        },
        {
            "text": "Support was my superpower. My first manager, Lisa, saw my potential and helped to build my confidence, while the HR team championed me. These tools empowered me to lead AI and automation events for thousands of civil servants. "
        },
        {
            "text": "My team’s belief in me turned obstacles into opportunities. Whether you’re loud about your care experience or quietly carving your path, this scheme ensures you’re never alone."
        },
        {
            "heading": 2,
            "text": "From intern to Civil Service leader"
        },
        {
            "text": "This internship rewrote my story. I’ve sharpened skills in presenting, automation, and Microsoft tools, but the real win is resilience and clarity. I now lead a cross-government care leaver network, advocating for others. The scheme showed me I belong in the Civil Service, where diverse thought dismantles groupthink and sparks innovation. It gave me stability, a network, and a career I love. "
        },
        {
            "text": "Care experience is part of me, but here, you can be anyone —your background only strengthens the team."
        },
        {
            "heading": 2,
            "text": "Why care leavers should apply"
        },
        {
            "text": "The internship scheme is a game-changer, and I urge every care leaver to apply. My advice? Be you, whether your care experience defines you or not. Share your story boldly or blend in, both are powerful. You’re not just joining a scheme, you’re transforming lives, starting with your own."
        },
        {
            "heading": 2,
            "text": "Find out more"
        },
        {
            "text": "For further information about eligibility requirements, application deadlines, and the selection process, visit the Civil Service Care Leaver Scheme webpage."
        },
        {
            "heading": 3,
            "text": "2025 application timeline"
        },
        {
            "text": "This year’s timeline is as follows:"
        },
        {
            "heading": 3,
            "text": "Eligibility criteria"
        },
        {
            "text": "To apply for the scheme, you must meet the following eligibility criteria:"
        },
        {
            "text": "*You must have been in care for a minimum of 13 weeks. Some of this time must have been after your 16th birthday. If you are unsure whether you meet this criteria, please speak to your personal advisor or local authority."
        }
    ]
}