{
    "url": "https://mhclgdigital.blog.gov.uk/2025/07/21/digital-planning-from-pilots-to-scale-how-proptech-partnerships-are-unlocking-its-potential/",
    "title": "Digital Planning: From pilots to scale – how PropTech partnerships are unlocking its potential   ",
    "authors": [
        "Bridget Wilkins, Head of Adoption, Engagement and Innovation"
    ],
    "categories": [
        "Digital Planning",
        "PropTech"
    ],
    "pub_date": "2025-07-21T11:07:46+01:00",
    "content": [
        {
            "text": "Last week marked a pivotal moment for scaling PropTech (property technology) and shaping how this technology can help deliver the government’s target of 1.5million homes over this Parliament.  "
        },
        {
            "text": "We hosted, with Geovation from Ordnance Survey, the PropTech Innovation Challenge bootcamps. These competitive pitches brought together industry and government judges to select a cohort of scalable solutions which can help us tackle some of the most pressing challenges in planning and housing. "
        },
        {
            "text": "The timing couldn't be more significant. Recent artificial intelligence (AI) announcements are highlighting the transformative potential of digital technologies, while the government’s industrial strategy positions PropTech as a key enabler for economic growth. The question is no longer whether PropTech can make a difference – it's how quickly we can identify and scale solutions across the entire system.  "
        },
        {
            "heading": 2,
            "text": "From green shoots to tangible results "
        },
        {
            "text": "We’ve seen PropTech deliver real results through our PropTech Innovation Fund. This was introduced in 2021 to support the PropTech sector and Local Planning Authorities to accelerate the adoption of digital planning tools and fast track the plan-making process.  "
        },
        {
            "text": "Four rounds later we have supported 77 local planning authorities (LPAs) across 114 pilots – the largest UK Government PropTech programme working with local government and industry at pace and scale.  "
        },
        {
            "text": "Our commissioned research, the Opportunity for PropTech report, published by the UK PropTech Association (UKPA) and PUBLIC earlier this year, shows the sector has the potential to grow by 20% by 2032 and generate revenue of approximately £72bn. It also contained a number of measures designed to deliver growth and drive investment. The case studies we’ve developed with the sector, demonstrate how PropTech solutions can unlock significant benefits across planning and regeneration, with ripple effects supporting broader economic growth."
        },
        {
            "text": "But despite the increased demand from local government and compelling evidence of benefits, scaling remains a persistent challenge.  "
        },
        {
            "text": "Even with an ambitious reform agenda across government, persistent barriers continue to limit adoption. These include market awareness gaps, procurement hurdles, lack of evidence, skills shortages, prohibitive costs, and a lack of digital infrastructure, interoperability and policy guidance. "
        },
        {
            "heading": 2,
            "text": "Evolving our approach  "
        },
        {
            "text": "That's why our approach has evolved over the past 6 months. When planning the next stage of LPA funding, we wanted to ensure the pilots could scale and benefit the wider system. This shaped the core principles of the Continuous Funding round, which for the first time requires funded projects to produce replicable blueprints – tangible guides that enable other LPAs to learn from proven experiences and be able to adopt different PropTech solutions with confidence.  "
        },
        {
            "text": "This is just one of the tactics we have explored to see how we can tackle barriers and enable the PropTech market to thrive.  "
        },
        {
            "text": "Through our work with Policy Lab, cross-government engagement and industry workshops, we’ve also learned that lasting change requires sustainable intervention across the entire PropTech ecosystem. Simply funding more individual pilots isn’t enough – we need to tackle the underlying market conditions that will allow those pilots to embed into standard practice.  "
        },
        {
            "text": "We’ve therefore shaped our ongoing PropTech programme around strategic partnerships that bridge the public and private sectors, with a view to taking PropTech from the margins to the mainstream:  "
        },
        {
            "text": "Each relationship is designed to strengthen networks and tackle adoption barriers collectively.  "
        },
        {
            "heading": 2,
            "text": " What happens next?  "
        },
        {
            "text": "Last week’s PropTech Innovation Challenge bootcamps marked a high point in our strategic evolution. With 85 applicants working alongside 225 partners competing for funding that could unlock over a million homes, we weren’t just selecting projects – we were identifying solutions that can genuinely transform planning and housing systems.  "
        },
        {
            "text": "The competitive pitch style format allowed judges from across government and industry to dive deeper into shortlisted applications. Innovators from across the country brought their university, council or developer partners into the room to demonstrate how their solutions will be tested in real world environments – from housing developments to active planning departments. We aim to announce the successful projects with Geovation in September. "
        },
        {
            "text": "Alongside the bootcamps the UKPA hosted their first industry roundtable, bringing together senior voices from government, local authorities, and the PropTech sector to discuss the PropTech adoption barriers in the planning system and what can be done to overcome them. The discussions have given us much food for thought and also reinforced what we've learned through our Innovation Fund – that systematic barriers require collective solutions. "
        },
        {
            "text": "And so, the work continues!  "
        },
        {
            "text": "Building on these insights the UKPA will be organising further industry roundtables as well as regional roadshow events with different councils on their ambitions for digital planning adoption, we’ll be publishing blueprints from our Continuous Funding projects and supporting the Task Force with the continuing development of the Digital Planning Directory. All of these activities serve the same goal – converting PropTech’s proven potential into systematic change that is driven by, and with, industry stakeholders. "
        },
        {
            "text": "This is how we convert ambitions into action – and finally realise PropTech’s true potential as an enabler for faster plan-making, planning system improvements, housing and infrastructure delivery.  "
        }
    ]
}