{
    "url": "https://teaching.blog.gov.uk/2025/07/21/maximising-pupil-premium-impact-whole-school-approaches-that-work/",
    "title": "Maximising Pupil Premium Impact: Whole-School Approaches That Work",
    "authors": [
        "Lisa Wise"
    ],
    "categories": [
        "Primary schools",
        "Pupil Premium"
    ],
    "pub_date": "2025-07-21T09:53:39+01:00",
    "content": [
        {
            "text": "Wilbury Primary School is a large primary school in Edmonton, North London, in an area of significant deprivation. Children can start from two years of age. As the end of the school year approaches, we know many schools will be evaluating their current pupil premium strategy and starting to plan their pupil premium spend for the upcoming academic year. We asked the Headteacher of Wilbury, Lisa Wise, to tell us about her school’s approach to supporting pupils through their pupil premium strategy."
        },
        {
            "text": "We are a happy and vibrant school, where staff and children thrive and achieve. For us, early intervention is key. We focus on language development, in all its forms, the core subjects and using evidence (internal and external) to constantly refine and improve the quality of our teaching across the curriculum."
        },
        {
            "heading": 2,
            "text": "Evaluating and improving teaching practice"
        },
        {
            "text": "Our leadership team play a significant role in evaluating disadvantaged pupils’ progress through ongoing, and crucially, supportive monitoring and quality assurance."
        },
        {
            "text": "We evaluate last year’s activity and impact to update our pupil premium strategy each year. We triangulate evidence from assessments and pupil data, as well as reports and studies on effective use of pupil premium and the impact of educational disadvantage."
        },
        {
            "text": "A key focus of our pupil premium spending is supporting high-quality teaching. Our leadership team devote time to our staff for collaborative team planning and teaching, and spend time in classrooms to provide on-the-spot coaching, training, and immediate feedback to develop practice. This all happens within an open and enthusiastic culture, where staff at all levels support and challenge each other."
        },
        {
            "text": "There is a collective understanding of the impact of disadvantage on pupils’ learning, and staff at every level speak with one voice about our ambition for all our pupils. "
        },
        {
            "heading": 2,
            "text": "Effective implementation"
        },
        {
            "text": "At Wilbury, the practitioner is the intervention – we strongly reject labels for children. We know our children’s success and progress is dependent on the quality of staff at all levels across the school and every moment matters. The professional development of staff is therefore at the heart of our pupil premium strategy."
        },
        {
            "text": "Effective implementation is key, and we strongly believe ‘the way you do what you do’ is the most important thing."
        },
        {
            "heading": 2,
            "text": "Top tips for tackling educational disadvantage"
        },
        {
            "text": "My advice to school leaders who are looking back at their current pupil premium strategy, and planning for the next academic year, is as follows:"
        },
        {
            "heading": 2,
            "text": "Further resources"
        },
        {
            "text": "Department for Education (DfE) publications"
        },
        {
            "text": "Education Endowment Foundation resources"
        },
        {
            "text": "DfE pupil premium webinars and blogs "
        }
    ]
}