{
    "url": "https://moderncivilservice.blog.gov.uk/2025/07/21/occupational-psychology-making-work-better-for-everyone/",
    "title": "Occupational psychology — making work better for everyone",
    "authors": [
        "Government Reform"
    ],
    "categories": [
        "A Modern Civil Service",
        "Ambitious",
        "Capability",
        "Digital and data",
        "Government Reform",
        "Innovation",
        "Join a profession",
        "Modernisation and Reform",
        "Proud Civil Servant"
    ],
    "pub_date": "2025-07-21T16:13:09+01:00",
    "content": [
        {
            "text": "A guest blog by Dr Antonia Dietmann, Head of the Government Occupational Psychology Profession"
        },
        {
            "text": "Ever wondered why some teams just click? Or how to find the right person for a job? What about creating a workplace that truly supports your well-being? That's where occupational psychology comes in. It's the science of understanding how people, groups, and organisations behave at work. The goal is simple: to make the working experience better for individuals and to make organisations more effective, without one being at the expense of the other."
        },
        {
            "text": "We help answer the big questions that affect us all at work, and we do it using a scientific process. We gather evidence from four key sources — organisational data, stakeholder information, scientific evidence, and practitioner expertise. We use all four because we're an applied science. This means we're doing real-world work to solve real-world problems for workers, teams, and organisations."
        },
        {
            "heading": 3,
            "text": "What kind of questions can we answer?"
        },
        {
            "text": "Our work covers five main areas:"
        },
        {
            "text": "1. Psychological assessment at work"
        },
        {
            "text": "2. Learning, training, and development"
        },
        {
            "text": "3. Leadership, engagement, and motivation"
        },
        {
            "text": "4. Wellbeing at work"
        },
        {
            "text": "5. Work design, organisational change, and development"
        },
        {
            "text": "We all work in the Civil Service, and getting answers to these questions, plus many more, would help make our experiences at work even better."
        },
        {
            "heading": 3,
            "text": "My journey into occupational psychology"
        },
        {
            "text": "Dr Antonia Dietmann, Head of the Government Occupational Psychology Profession"
        },
        {
            "text": "During my undergraduate psychology degree, I completed a module on ‘work psychology’ and it hit me like a ton of bricks that I would be working for the next 40+ years. I had to be part of making that experience better for myself and as many others as possible. That's what started my career in occupational psychology, which has now lasted nearly 25 years, and I've no plans to stop now. Being part of the Government Occupational Psychology profession has given me a wonderful network, opportunities for professional and career development and roles across the Civil Service."
        },
        {
            "heading": 3,
            "text": "Our thriving community"
        },
        {
            "text": "We have around 250 members of the Occupational Psychology profession across the Civil Service. This makes us the largest occupational psychology community in the UK. Our members work in dedicated occupational psychology roles, but also in other professions and teams, all using their occupational psychology skills to solve organisational challenges. "
        },
        {
            "text": "I recently spent two days at our annual member conference, and I'm full of joy and energy seeing the contributions they're making. We heard about how members are:"
        },
        {
            "text": "Our commitment to continuing professional development is one benefit of joining the Government Occupational Psychology Profession. We run an excellent programme of learning events, including our annual conference. Other benefits include:"
        },
        {
            "text": "The Government Occupational Psychology Profession is open to current civil servants (and some Crown servants) who have an undergraduate degree in psychology (or equivalent, including conversion courses) and intend to complete, are currently undertaking, or have completed a postgraduate (MSc) qualification in occupational psychology (or a similar course, e.g. Business Psychology, Organisational Psychology, Work Psychology)."
        },
        {
            "text": "Please check out our Government Occupational Psychology Careers Hub. If you meet our criteria, we'd be delighted to welcome you. You don't need to be a fully qualified Occupational Psychologist to make positive changes in your workplace – even small steps can make a big difference. Joining a Profession and building relationships with others across the Civil Service is a great way to increase collaboration and community amongst us all."
        }
    ]
}