{
    "url": "https://food.blog.gov.uk/2025/07/21/stakeholder-update-glycerol-in-slush-ice-drinks-warning/",
    "title": "Stakeholder update: Glycerol in slush ice drinks warning",
    "authors": [
        "Katie Pettifer, Chief Executive"
    ],
    "categories": [
        "Business guidance"
    ],
    "pub_date": "2025-07-21T09:37:31+01:00",
    "content": [
        {
            "text": "Cymraeg"
        },
        {
            "text": "Following a recent Board decision, we’ve just launched a new campaign to warn parents and caregivers about the potential health risks that slush ice drinks, or 'slushies', can pose to young children when they contain glycerol."
        },
        {
            "text": "Glycerol is a food additive used in some no and low sugar slushies to create their distinctive frozen texture. These drinks are widely consumed without harmful effects, but our recent assessment has shown they can in rare cases, especially when consumed in large quantities over a short time period, pose serious health risks to young children - symptoms include shock, dangerously low blood sugar levels, and loss of consciousness."
        },
        {
            "text": "To coincide with the start of the summer holidays, when slushie sales increase, we’ve launched new guidance and a public awareness campaign about these risks. Our advice is straightforward: children under seven should not consume slush ice drinks (slushies) containing glycerol at all. "
        },
        {
            "text": "For children aged seven to ten, consumption should be limited to one 350ml serving per day - roughly the size of a standard fizzy drink can."
        },
        {
            "text": "Parents and guardians should check with the food business on whether the drink contains glycerol - but don’t buy if in doubt. We're also calling on retailers to play their part by displaying our advice clearly at the point of sale and not offering free refills to children aged ten and under."
        },
        {
            "text": "We are calling on manufacturers to include these warnings on ready to drink slushie pouches and on the syrups and labelling on home slush ice drink kits."
        },
        {
            "text": "Please support this initiative within your networks and amplify our communications through your channels, to help to get the message out to parents. We want to ensure that families can continue to enjoy these popular treats safely, while protecting the health and wellbeing of our youngest consumers."
        },
        {
            "heading": 1,
            "text": "Neges i randdeiliaid: Rhybudd am ddiodydd iâ slwsh sy’n cynnwys glyserol"
        },
        {
            "text": "Yn dilyn penderfyniad diweddar gan y Bwrdd, rydym wedi lansio ymgyrch newydd i rybuddio rhieni a gofalwyr am y risgiau iechyd posib y gall diodydd iâ slwsh, neu ‘slushies’, eu peri i blant ifanc pan fyddant yn cynnwys glyserol."
        },
        {
            "text": "Ychwanegyn bwyd yw glyserol a ddefnyddir mewn rhai diodydd iâ slwsh nad ydynt yn cynnwys llawer o siwgr neu ddim siwgr o gwbl, a hynny er mwyn creu’r gwead rhewedig nodedig. Mae’r diodydd hyn yn cael eu hyfed yn helaeth heb effeithiau niweidiol, ond mae ein hasesiad diweddar wedi dangos y gallant mewn achosion prin, yn enwedig pan gaiff nifer fawr ohonynt eu hyfed dros gyfnod byr, beri risgiau iechyd difrifol i blant ifanc. Mae’r symptomau’n cynnwys sioc, lefelau siwgr gwaed peryglus o isel, a cholli ymwybyddiaeth."
        },
        {
            "text": "I gyd-fynd â dechrau gwyliau’r haf, pan fydd mwy o ddiodydd iâ slwsh yn cael eu gwerthu, rydym wedi lansio canllawiau newydd ac ymgyrch i godi ymwybyddiaeth y cyhoedd am y risgiau hyn. Mae ein cyngor yn syml: ni ddylai plant dan saith oed yfed diodydd iâ slwsh (‘slushies’) sy’n cynnwys glyserol o gwbl."
        },
        {
            "text": "I blant saith i ddeg oed, dim ond un dogn o 350ml y dydd y dylent ei gael – tua maint un can o ddiod pop safonol."
        },
        {
            "text": "Dylai rhieni a gwarcheidwaid ofyn i’r busnes bwyd a yw’r ddiod yn cynnwys glyserol – ond peidiwch â’i brynu os oes unrhyw amheuaeth. Rydym hefyd yn galw ar fanwerthwyr i chwarae eu rhan drwy arddangos ein cyngor yn glir yn y man gwerthu, a pheidio â chynnig ail-lenwadau am ddim i blant deg oed ac iau. Rydym yn galw ar weithgynhyrchwyr i gynnwys y rhybuddion hyn ar godenni diodydd iâ slwsh parod i’w hyfed ac ar y suropau a’r labelu ar gitiau cartref ar gyfer y diodydd iâ slwsh hyn."
        },
        {
            "text": "Gofynnwn yn garedig i chi gefnogi’r fenter hon o fewn eich rhwydweithiau a rhannu ein cyfathrebiadau trwy eich sianeli er mwyn helpu i rannu’r neges â rhieni. Rydym am sicrhau y gall teuluoedd barhau i fwynhau’r danteithion poblogaidd hyn, wrth ddiogelu iechyd a lles ein defnyddwyr ieuengaf ar yr un pryd."
        }
    ]
}