{
    "url": "https://planninginspectorate.blog.gov.uk/2025/07/21/working-together-to-make-delivery-a-reality/",
    "title": "Working together to make delivery a reality ",
    "authors": [
        "Graham Stallwood"
    ],
    "categories": [
        "Appeals",
        "Local plans",
        "nationally significant infrastructure projects"
    ],
    "pub_date": "2025-07-21T13:49:42+01:00",
    "content": [
        {
            "text": "The Planning and Infrastructure Bill has gained pace in Parliament - and planning is at the heart of the Government’s Plan for Change , delivering new homes, speeding up essential infrastructure, and unlocking clean power.  "
        },
        {
            "text": "Each of us in planning holds a critical role in turning this vision into reality, whatever role, organisation or sector we are in. Only by working across perceived boundaries will we achieve it.  "
        },
        {
            "text": "Over the course of this Parliament the government aims to decide at least 150 major economic infrastructure projects.  The Plan for Change recognises that is ambitious and a challenge.  "
        },
        {
            "heading": 2,
            "text": "Our performance "
        },
        {
            "text": "At the Planning Inspectorate, we’re stepping up. We’re meeting statutory deadlines for nationally significant infrastructure (NSIP) applications and finding new ways to accelerate processes without compromising on quality. We’re making time savings at every step of the process.  "
        },
        {
            "text": "And the work is having a tangible impact – the two most recent NSIP applications granted by the Secretary of State following our examination (Mona Offshore Wind Farm and the Oaklands Farm Solar Park) will provide enough clean energy to give power to more than a million homes. (See Notes) "
        },
        {
            "text": "Ten new local plans started examination in June alone, the highest in a month for more than five years, with 61 plans in total currently being examined. You can see where at: "
        },
        {
            "text": "Local Plan: monitoring progress - GOV.UK   "
        },
        {
            "text": "On appeals, momentum is building. Decision times are becoming faster and more predictable. Our latest official statistics show that since the end of January we’ve reduced the number of open cases by 1,466, and our average decision time for cases decided in June was 24 weeks, quicker than the 27-week average of the last 12 months.  "
        },
        {
            "heading": 2,
            "text": "What next? "
        },
        {
            "text": "But we hear you: even faster and more predictable times for appeal decisions still top your list of priorities.  "
        },
        {
            "text": "Encouragingly, more decisions are now being made within the ministerial targets we’re working towards – 20 weeks for written appeals and 26 weeks for hearing and inquiry appeals. But stubborn legacy cases remain, especially for lawful development certificates and written enforcement appeals. Deciding these is a top focus this year.  "
        },
        {
            "text": "There’s been a couple of exciting announcements too. Our new digital appeals service will be rolled out to all local planning authorities by December, making it much more efficient for all, while a simplified appeals process will help keep planning decisions local and reduce unnecessary bureaucracy. "
        },
        {
            "heading": 3,
            "text": "Your support is needed "
        },
        {
            "text": "We can’t transform the system alone so here are a few things everyone can do to help us this year:  "
        },
        {
            "text": "The Plan for Change is an opportunity for planning to demonstrate how good it is at delivery. To be successful we need to be dynamic, demanding and deeply collaborative. It needs all of us to work together. Please share your own thoughts. "
        },
        {
            "text": "Notes: "
        },
        {
            "text": "The figure for the number of homes powered by the latest two consented NSIPS is based on the size of the schemes and the MW of power they will generate. See Ofgem’s factsheet on electricity generation.  "
        }
    ]
}