{
    "url": "https://mojdigital.blog.gov.uk/2023/05/10/part-ii-one-year-on-changing-the-conversation/",
    "title": "Part II: One Year On, Changing the Conversation",
    "authors": [
        "Gina Gill"
    ],
    "categories": [
        "MoJ Digital Strategy 2025",
        "Our People",
        "Our services",
        "our users"
    ],
    "pub_date": "2023-05-10T11:19:23+01:00",
    "content": [
        {
            "text": "Last time I talked about progress against our strategy through the eyes of users. This is obviously very, very important - we exist to serve our users. Today I’m going to talk about a number of things that will seem like they are not necessarily linked, but for me demonstrate progress in a different way. And demonstrate that we are starting to change the conversation about digital in the organisation."
        },
        {
            "text": "The Campaign"
        },
        {
            "text": "In November last year we ran a month-long digital innovation campaign. The purpose of this was to demystify what we do in Justice Digital and to learn from other organisations, but mostly to kick start thinking and conversations about how we might do things differently. We had Estonia tell us to \"get over ourselves\" because all governments experience similar challenges. Google showed us how they innovate. AWS explained why a good sized team should be able to be fed by two pizzas. And, of course, the chance to play with a robot dog, which won some people over and frightened others. "
        },
        {
            "text": "This really helped us to have some quite different conversations. My favourite example is with the prison's leadership team where we had the opportunity to talk about the potential impact of new/emerging technologies from AI to self healing concrete. It was very much the start of a conversation with much more work and talking to do - but the conversation really has changed over the last 12 months."
        },
        {
            "text": "The Incidents"
        },
        {
            "text": "At Justice Digital we are responsible for over 800 services. Like any large complex organisation, we have legacy technology. And like any other organisation, we therefore have outages or incidents relating to these services. But it feels different when we do now. For example, a year ago, if I got a whiff of an incident relating to our enterprise wide services (those that all of our people use like networks or office software), I would break out in a cold sweat. It’s not that I don’t worry today - the ever increasing grey hairs and worry lines are testament to that! But over the last year or so we have built great internal technical teams and capability, and our relationships with our key suppliers feel more collaborative. So I have the confidence we have the right people and ways of working to get to a resolution. And to communicate well to our users and stakeholders. Which means my job and conversations become far easier, and can be focused on strategic conversations."
        },
        {
            "text": "The Way we Work"
        },
        {
            "text": "The way that we work with operational colleagues has changed quite dramatically in some cases. For example, I get frequent positive feedback about the way that we are working with the Criminal Injuries Compensation Authority (CICA). This means the conversation is changing from one of how we better work together to how we can deliver services differently in the future if we take an end to end (policy/strategy to delivery) view."
        },
        {
            "text": "But the way that we work within Justice Digital is also changing as we mature as a team. I see more examples of us practising what we preach in terms of delivery through multidisciplinary teams, which we’ve used successfully in recruitment and resolving pay issues. I see more strategic and thought-provoking conversations such as that led by our Legal Aid Digital team on whether talking about technical debt means we’re not thinking about policy, process or knowledge debt. And I also see self forming groups to tackle common problems or take advantage of opportunities."
        },
        {
            "text": "I could go on and talk about the fact that we have demand in policy teams for service designers, that publications that two years ago were (rightly) berating us for extending big IT contracts are no longer, or that many of our (many) new recruits talk about being inspired by our vision and strategy. But I fear I have gone on too long already!"
        },
        {
            "text": "So, to sum up, while the innovation campaign, incidents and changing ways of working may seem like quite disparate things, they are allowing us to have different conversations with colleagues, stakeholders and leaders across the organisation. And that change of conversation is absolutely necessary to allow us to think and plan beyond 2025. In the next and final blog I will talk about how we are using this change in conversation to imagine what the MoJ of the future might look like."
        }
    ]
}