{
    "url": "https://ofqual.blog.gov.uk/2023/05/10/summer-exams-are-starting/",
    "title": "Summer exams are starting",
    "authors": [
        "Michael Hanton"
    ],
    "categories": [
        "A levels and GCSEs",
        "Exams",
        "Vocational and technical qualifications"
    ],
    "pub_date": "2023-05-10T09:30:09+01:00",
    "content": [
        {
            "text": "As we emerge from the Coronation celebrations and a welcome extra Bank Holiday, all those involved in exams – students, parents, teachers and exams officers, as well as all of us here at Ofqual – are looking ahead to the start of the main 2023 summer exam series next week. "
        },
        {
            "text": "More than a million students will take exams at thousands of schools, colleges and other centres across the country. Over 70,000 examiners will be involved in marking and moderating students’ work so that around 5.7 million GCSE and A level results can be issued in August. Since September over a quarter of a million exams and formal assessments have already been taken by students working towards a range of vocational and technical qualifications. The rollout of the government’s ambitious new T Level continues too, with students working towards a T Level in 7 new subjects for the first time this year.  "
        },
        {
            "heading": 2,
            "text": "Protection for students"
        },
        {
            "text": "This year GCSEs, AS and A levels are returning to pre-pandemic grading arrangements, with protection for students to recognise the disruption they have faced. This means Ofqual expects national results this year to be similar to those in pre-pandemic years. The protection means that a typical student who would have achieved, for example, a B grade in A level geography before the pandemic will be just as likely to get a B in geography in 2023, even if their performance in the assessments is a little weaker than it would have been before the pandemic.  "
        },
        {
            "text": "Students will also get formulae and equation sheets in some GCSE exams and modern foreign language GCSEs no longer have to test unfamiliar vocabulary. Exam papers in the same subject are more spaced out in the GCSE and A level timetable than they were before the pandemic. This gives students more time to revise between papers.  "
        },
        {
            "text": "Vocational and technical qualifications are varied, so awarding organisations will use appropriate grading approaches for their qualifications. For those qualifications similar in structure to GCSEs and A levels, with assessments taken at the end of the course, awarding organisations will consider the grading approach for GCSEs and A levels.  "
        },
        {
            "text": "For T Levels, Ofqual has asked awarding organisations to be generous when grading the Technical Qualification component to reflect the fact that these are new qualifications. This is the first year that Technical Qualifications in T Levels are based fully on exams, whereas some previously included teacher assessed grades. This means that the profile of results may look different in some subjects, so it is important not to compare them with last year’s results. "
        },
        {
            "text": "Students are at the heart of Ofqual’s decisions. Returning to a grading standard that is known and understood by teachers, schools, colleges, higher and further education and employers supports good teaching and learning and helps students make the right choices about their future.  "
        },
        {
            "heading": 2,
            "text": "Getting results on time"
        },
        {
            "text": "Students deserve to get their results when they are due – whatever qualifications they take. This year, we have required awarding organisations to take extra steps so that students taking vocational and technical qualifications for progression to further or higher education receive their results at the same time as students taking A levels. You can find out more detail on this in Ofqual’s VTQ results action plan. "
        },
        {
            "heading": 2,
            "text": "Preparing for exams"
        },
        {
            "text": "We know that students up and down the country are working hard to prepare for their exams and many have told us they want to sit them to show what they know and can do. We know that many others are preparing for summer exams in different ways too – parents and carers, teachers, exams officers, invigilators and examiners all play important roles.  "
        },
        {
            "text": "To make sure exams and assessments run smoothly, here are a few reminders.  "
        },
        {
            "heading": 2,
            "text": "Students"
        },
        {
            "text": "Please remember:  "
        },
        {
            "heading": 2,
            "text": "Exams officers"
        },
        {
            "text": "We know how much students and teachers depend on exams officers to make sure exams and formal assessments run smoothly and, thanks to your hard work, most do.  We know that in such a huge system, there are a few things that catch some people out every year that are worth remembering:  "
        },
        {
            "text": "Ofqual has a range of resources to support exams officers in their role.  "
        },
        {
            "heading": 2,
            "text": "As for us…"
        },
        {
            "text": "Ofqual works all year round to oversee the exams system. During the summer exam series we monitor carefully any issues that arise, taking action where we need to in the interests of students. We’ll look at how exam boards manage those issues and check progress towards results days in August.  "
        },
        {
            "text": "Students’ interests are always at the forefront of our minds, as we make sure that exams and assessments are delivered smoothly and that results are fair, accurate and received on time.  "
        },
        {
            "text": " "
        },
        {
            "text": "Michael Hanton\nDeputy Chief Regulator, Ofqual"
        }
    ]
}