{
    "url": "https://socialworkwithadults.blog.gov.uk/2023/05/10/the-role-of-research-in-adult-social-work/",
    "title": "The role of research in adult social work",
    "authors": [
        "Elaine James",
        "Lyn Romeo"
    ],
    "categories": [
        "Co-production",
        "Communities",
        "Research"
    ],
    "pub_date": "2023-05-10T14:01:27+00:00",
    "content": [
        {
            "heading": 2,
            "text": "Partners in improving research"
        },
        {
            "text": "Over 12 months, we have been supported by the NIHR School for -Social Care Research to test out ways to support practitioners, who remain in practice, to lead the development of research agendas within adult social care."
        },
        {
            "text": "Based in different settings, each with a different area of interest for our Fellowship, we share a strong belief all social workers should be fully engaged in generating, using, disseminating and embedding research in their professional practice and development."
        },
        {
            "text": "Working with the James Lind Alliance, Lyn Romeo, the Chief Social Worker for Adults supported the development of the Adult Social Work Priority Setting Partnership, which worked to find out what research needs to happen in future to make social work with adults in England even better."
        },
        {
            "text": "In 2018, the Partnership published ten priorities for Adult Social Work. This was a global first, as it reflected both the views of people using services and front-line social workers."
        },
        {
            "text": "The priorities covered questions about how to support the wellbeing and safety of people and carers, frameworks for communication between professionals and people in need of support and legal literacy in ensuring equal treatment for people who may lack capacity to consent to their care and treatment."
        },
        {
            "text": "A review of the research priorities published in 2022 found they are helping inform ideas for research, however more investigation is needed to answer the questions fully. Further studies are also needed to increase diversity in social work research."
        },
        {
            "heading": 2,
            "text": "Charting a course"
        },
        {
            "text": "In 2023, BASW (the British Association of Social Work), supporting local authorities, universities and the NIHR in asserting the importance of research in adult social care, published The Charter for Social Work Research in Adult Social Care."
        },
        {
            "text": "The Charter sets out a vision and pathway towards more investment in research, within and across social work. Writing in the foreword, Lyn Romeo commented:"
        },
        {
            "text": "“Research is never an optional extra, indeed in these challenging times it is more important than ever”."
        },
        {
            "text": "Our hope for this Fellowship is that over the next 12 months we will be able to support the development of research skills and capabilities across each of our areas. We want to encourage and inspire more social workers to feel confident in making research part of their everyday practice."
        },
        {
            "text": "We also hope to encourage senior leaders across the sector to recognise that value that comes from supporting practitioners to contribute to generating new knowledge about social care. Fellowships, running trials, discursive symposia, writing up and publishing findings are all well-established traditions in health care. We hope to seed ideas that should also be commonplace in social care."
        },
        {
            "text": "If social care knowledge is to be valued on an equal basis to health care evidence, leadership has a role in creating and protecting time for social workers to remain in practice whilst also being able to undertake research as part of their role."
        },
        {
            "heading": 2,
            "text": "Research top tips"
        },
        {
            "text": "So, if you want to incorporate research skills and ethical research with a moral purpose into your practice, here are some suggestions to get started:"
        },
        {
            "text": " "
        }
    ]
}