{
    "url": "https://ipo.blog.gov.uk/2025/03/06/a-bear-of-very-little-copyright-winnie-the-poohs-journey-into-the-public-domain/",
    "title": "A bear of very little copyright: Winnie-the-Pooh's journey into the public domain  ",
    "authors": [
        "Meg Davies"
    ],
    "categories": [
        "Copyright",
        "Trade marks"
    ],
    "pub_date": "2025-03-06T10:00:00+00:00",
    "content": [
        {
            "text": "I’ve always been a big fan of World Book Day. As an avid reader, I have many fond memories of heading into school dressed as my favourite characters, and while I'm not donning a costume this year, I am thinking about the IP in some of my favourite children's books. Today I’m exploring all things IP in Winnie-the-Pooh, one of Britain's most beloved bears. I’m one of many people who have always loved A.A. Milne's stories of Pooh and his pals, and so I was intrigued to hear that this little bear is the centre of some big copyright discussions. "
        },
        {
            "heading": 3,
            "text": "Oh Bother! What's Copyright? "
        },
        {
            "text": "Like every book, these treasured stories have been protected by copyright since their creation. Copyright protection is automatic - as soon as someone creates an original literary, dramatic, musical or artistic work, copyright springs into action just like Tigger bouncing onto the scene. It gives creators control over how their work is used, copied and adapted, ensuring they can benefit from their creativity and continue producing work we all enjoy. "
        },
        {
            "heading": 3,
            "text": "Think Think Think About Protection "
        },
        {
            "text": "In the UK, copyright protects literary and artistic works for the lifetime of the creator, plus an additional 70 years. Since A.A. Milne passed away in 1956, the original Winnie-the-Pooh stories will enter UK public domain on 1st January 2027. The illustrations by E. H. Shepard have separate protection, and as he died in 1976, the illustrations will stop being protected on 1st January 2047. This means that for now in the UK, Pooh is protected - but this isn't the case everywhere… "
        },
        {
            "heading": 3,
            "text": "A Tale of Two Countries "
        },
        {
            "text": "Copyright laws vary around the world and have adapted throughout time, and in the United States, the copyright for Winnie the Pooh’s publication remained active for 95 years after the story was first published. This means that as the first book was written in 1926, for our friends across the pond, A.A. Milne's original book entered the public domain in 2022. "
        },
        {
            "text": "As Pooh is now in the public domain in the USA, a series of adaptions of the original characters have popped up over the last few years, including horror film \"Winnie the Pooh: Blood and Honey\", and reportedly an R-Rated (UK15) TV series about Christopher Robin that’s in production. But creators need to be careful - not every version of the famous bear is free to be adapted.  "
        },
        {
            "heading": 3,
            "text": "Disney's Expedition to the Hundred Acre Wood "
        },
        {
            "text": "Perhaps when you think of Winnie-the-Pooh, you don't think of the original stories, but instead of the animated version of the bear that Disney adopted. He first appeared in \"Winnie the Pooh and the Honey Tree\". This adaptation was able to appear before the books entered the public domain thanks to Disney's licensing agreement with the Milne estate. A licence is an agreement between an IP right owner and another party, granting permission to use protected material in specific ways, showing how intellectual property can be commercially shared while maintaining protection. Through careful licensing, Pooh has appeared in numerous formats while maintaining his cherished character, and the Disney version of Winnie-the-Pooh has become infamous. "
        },
        {
            "text": "Disney holds active trade marks for the Winnie-the-Pooh name and drawings of several characters (such as this instantly recognisable image of Pooh [link]: https://trademarks.ipo.gov.uk/ipo-tmcase/page/Results/1/UK00001031845), meaning that you can't use their distinctive versions without a licensing agreement of your own. This trade mark protection will likely continue even after the copyright of the original books expires, ensuring Disney's particular interpretation remains protected. "
        },
        {
            "heading": 3,
            "text": "The Next Chapter"
        },
        {
            "text": "As we celebrate World Book Day, it's intriguing to think that in less than two years these beloved stories will begin their new adventure in the UK public domain. It will be interesting to see how new generations reimagine these cherished characters while respecting the intellectual property rights, such as copyright in the original illustrations, or Disney’s trade marks, that remain in place. "
        },
        {
            "text": "When works enter the public domain, it opens exciting possibilities for creators. Just as we've seen other classic characters like Sherlock Holmes inspire new interpretations, Pooh's entry into the public domain could lead to fresh adaptations - though I hope for some that are less scary than some we've seen from the US! "
        },
        {
            "text": "\"We'll be friends forever, won't we, Pooh?\" asked Piglet. \"Even longer,\" said Pooh. \"Especially once we're in the public domain.\" "
        },
        {
            "text": "You can read more about how to protect, manage and enforce copyright in our guidance here [link]: https://www.gov.uk/government/collections/intellectual-property-copyright."
        }
    ]
}