{
    "url": "https://mojdigital.blog.gov.uk/2025/03/06/my-experience-as-a-software-developer-at-justice-digital/",
    "title": "My experience as a Software Developer at Justice Digital",
    "authors": [
        "Hettie Street"
    ],
    "categories": [
        "a great place to work",
        "International Women's Day",
        "Software Developer",
        "Women in Tech"
    ],
    "pub_date": "2025-03-06T13:46:22+01:00",
    "content": [
        {
            "text": "My name is Hettie, and for the past two years, I have been a software developer at Justice Digital. I also happen to be a woman."
        },
        {
            "text": "Software development is a notoriously male-dominated field. I work with loads of brilliant colleagues, but there are times when I have felt just that little bit different, or at times on the outskirts. Fortunately, the Civil Service is one of the most welcoming places I have worked, with diversity, inclusion and equality at the heart of so much of what we do."
        },
        {
            "text": "Firstly I would like to share with you what I think are the most useful parts of my experience, then I’ll fill you in on my background, and how I got to where I am today. "
        },
        {
            "text": "Here is what I’ve learnt so far working as a software developer and as a woman in technology."
        },
        {
            "heading": 2,
            "text": "Community is key"
        },
        {
            "text": "One of the most important parts of being a software developer is cultivating your community. A community of sharing and learning together is infinitely better. "
        },
        {
            "text": "Being open and vulnerable about our work, whether it’s a technical problem or a team process issue, helps to build a trusting community where we can learn from one another. "
        },
        {
            "text": "By sharing our mistakes and supporting each other we improve to get things right the next time. This culture of continuous improvement enables us to deliver high-quality services for the public while also finding greater fulfillment in our day-to-day roles"
        },
        {
            "text": "As well as being an active member of the developer community, I have found it important to develop a community with my fellow women software developers too. It is easy to feel siloed and disconnected from others from behind the laptop screen, and I have sometimes found myself wondering, “where are the other women in this field? I can’t see them anywhere!”"
        },
        {
            "text": "It is important to have a forum to connect with one another, especially for those who may find themselves the only woman in their software development team. Recently, I have been making use of our Justice Digital ‘women in tech’ Slack channel, where we share information with one another and have a regular coffee catch-up. We don’t always use the coffee catch-up religiously, but it is there in the calendar for anyone who needs it."
        },
        {
            "text": "I would encourage anyone who identifies outside of the majority to reach out and build those communities at work."
        },
        {
            "heading": 2,
            "text": "Find your role models"
        },
        {
            "text": "As well as being a member of a community, another great way to feel more comfortable and supported as an individual in your profession is to find a role model. "
        },
        {
            "text": "This doesn’t necessarily have to be a formal mentoring thing - it could just be having a regular chat or coffee together. It is important to find someone who you feel is similar to you - someone who inspires you and helps to make the bridge to your future goals look like a realistic path, rather than an impossible dream. Your role models can help you to work out the steps you need to take, to get to where you’d like to be."
        },
        {
            "text": "I’ve had some brilliant role models of all different backgrounds over the years, and I doubt I would be where I am today without their advice and support. However, I think I have felt the strongest connection with individuals who share similarities with me because they make your future professional development seem more obtainable. It is really important to seek out role models wherever you can."
        },
        {
            "heading": 2,
            "text": "Imposter syndrome is real"
        },
        {
            "text": "Most of us doubt our abilities from time to time and question our knowledge and decision-making. This is normal and likely a part of the software developer experience - it is a vast field with a never-ending list of things to learn, that can leave you feeling like you’re starting from scratch sometimes. But imposter syndrome is the experience of feeling like a fraud - like you’ll get found out any minute for not being a ‘proper’ developer!"
        },
        {
            "text": "This can affect everyone but is particularly a problem for women and underrepresented groups. I continue to experience imposter syndrome to varying degrees a lot of the time. It is difficult to overcome, but there are some practices you can use to help. "
        },
        {
            "text": "Ask for feedback from colleagues that you trust. They will likely provide you with lots of positive evidence about your work that you may not even have considered. Then when you’re feeling particularly imposter-like, read that feedback again and remind yourself of the great things you have accomplished. You will slowly realise that maybe you do know a thing or two, after all."
        },
        {
            "text": "Be kind to yourself. I would be willing to bet that negative self-talk has never helped a situation…ever!  You will sometimes get things wrong, or not know the answer, and that is fine and is a realistic expectation in your role. No one knows everything (some people are just very good at pretending). So remind yourself of that regularly and cut yourself some slack."
        },
        {
            "text": "Remember to praise your colleagues regularly and show that you appreciate them and what they do. Don’t underestimate the impact a little bit of praise can have on helping someone feel more confident in themselves."
        },
        {
            "heading": 2,
            "text": "Say yes, but know when to say no"
        },
        {
            "text": "As a woman software developer, it can feel essential to take every opportunity you can get your hands on. This helps you add more strings to your bow and can put you in a position of visibility. Increased visibility of individuals from underrepresented groups is great for organisational culture and can provide valuable support to colleagues who may feel marginalised."
        },
        {
            "text": "Whilst saying yes to opportunities can be a great thing, it is important not to fall into the trap of doing it to ‘catch-up’ with your male counterparts. Women and underrepresented groups in the workplace often feel like they need to do more, just to break even with the majority group."
        },
        {
            "text": "Say yes to the things that align with your values and your professional development - otherwise, let the opportunity go. You can’t do it all, and your time (and sanity) are valuable. The opportunities that you pass on may become a chance for someone else to get involved. "
        },
        {
            "text": "Sometimes as a woman or member of an underrepresented group, you might feel disproportionately asked to take part in some things such as interview panels where a balanced gender representation is required as part of a fair and open recruitment process. "
        },
        {
            "text": "Be mindful that you don’t always have to say yes, you can politely decline and offer the opportunity to someone else. I have always found it ironic that the extra time I dedicate to additional pursuits within the community is probably to the detriment of my technical abilities, which in some way further disadvantages me as a woman in the field of software development. This is something I’m trying to be more aware of, so I can make the right decisions for my professional development."
        },
        {
            "heading": 2,
            "text": "You belong here"
        },
        {
            "text": "A diverse, inclusive, open community is better for everyone. It fosters innovation, strengthens collaboration and creates a sense of belonging for everyone. It allows us to have fresh ideas, challenge assumptions and drive positive change. "
        },
        {
            "text": "As a woman in technology, and as part of any underrepresented group, you not only have every right to be here, but you are also an invaluable part of your profession—and your presence is essential."
        },
        {
            "heading": 2,
            "text": "How I became a software developer"
        },
        {
            "text": "Software development was not part of my educational background. I did a languages degree at university because I loved to learn languages, but never had a particular career in mind. After university and spending some time living in Beijing, I moved to London and tried several different jobs, and none of them quite stuck - but what was always clear to me was that I both enjoyed and was good at picking up new skills."
        },
        {
            "text": "Working in Digital always interested me, and I managed to get a job as a manual QA at a tech start-up. I don’t quite know how I managed to convince them to offer me that role, considering I had limited experience in the digital field, but fortunately, my colleagues were willing to take a chance on me. "
        },
        {
            "text": "That role was a baptism of fire but I learnt more in the space of a year in that role than I had in any of my previous jobs. Every day I worked closely with software developers, and I thought to myself, “I’d quite like to have a go at that too!” The culture at that organisation, however, didn’t feel particularly supportive, which put me off taking the plunge at that time - there was a bit of a ‘tech bro’ culture in the engineering team, and I struggled to feel like I belonged there."
        },
        {
            "text": "I had always considered joining the Civil Service, because I liked the idea of public service and working towards a greater good. When I saw an entry-level position in Digital come up, I applied straight away, and was really lucky to get the role. Fast forward three years and here I am as a Senior Software Developer in Justice Digital."
        },
        {
            "text": "Justice Digital is an incredibly welcoming and supportive environment, where I work with kind, open-minded people who strive to do their best while prioritising inclusivity and a positive culture. One of the things I value most is the flexibility within our teams, allowing individuals to work in a way that enables them to thrive. Whilst flexibility benefits everyone, it can be especially valuable for women who may have additional caregiving responsibilities outside of work."
        },
        {
            "text": "Beyond its inclusive culture, Justice Digital also offers fantastic opportunities for professional growth, whether through bespoke training, conferences, or mentoring programs. It’s a brilliant place to start or advance a career in technology, particularly for those from underrepresented groups. If you're considering a career in tech or looking to grow in your field, don’t hesitate to take the leap and join Justice Digital. "
        },
        {
            "text": "View our current vacancies "
        }
    ]
}