{
    "url": "https://accessibility.blog.gov.uk/2025/03/06/navigating-dyscalculia-designing-with-empathy-in-mind/",
    "title": "Navigating dyscalculia: Designing with empathy in mind",
    "authors": [
        "Faye Gardner, Accessibility specialist, HM Revenue and Customs"
    ],
    "categories": [
        "Accessibility"
    ],
    "pub_date": "2025-03-06T09:09:56+00:00",
    "content": [
        {
            "heading": 2,
            "text": "HMRC’s Accessibility Empathy Hub"
        },
        {
            "text": "In 2019, His Majesty’s Revenue and Customs (HMRC) Digital Inclusion and Accessibility Standards team launched our first Accessibility Empathy Hub. These hubs help people understand some of the barriers disabled users may face by using various simulation tools. Initially, they were set up in different locations with physical equipment like simulation glasses and ear defenders, offering a hands-on way to experience accessibility challenges."
        },
        {
            "text": "However, when COVID hit, we had to re-think our approach and that's when we created our virtual empathy hub. We based this off of the 7 personas created by GDS. We have since refined and expanded them to better fit our sessions. The feedback we received from our sessions was always very positive; the only suggestion being to add more personas."
        },
        {
            "text": "While these hubs are a great way to build awareness and empathy, it’s important to remember, they don’t replace real lived experiences. They are seen as a learning tool, not a way to test products. "
        },
        {
            "heading": 2,
            "text": "Deciding on the new persona"
        },
        {
            "text": "I’m Faye Gardner, an accessibility specialist within the team that leads the work on the Accessibility Empathy Hubs. I knew I wanted to create more personas based on cognitive impairments or learning disabilities. After some time thinking, I decided that dyscalculia would be a great choice for the next persona. "
        },
        {
            "text": "Dyscalculia is a learning difficulty that makes it hard to read, understand and use numbers in daily life. People with dyscalculia don’t just find maths difficult but anything including numbers like:"
        },
        {
            "text": "This can lead to people missing meetings and trains, withdrawing or transferring the wrong amount of money and just everyday struggles to navigate numerical information."
        },
        {
            "text": "Around 6% of people have dyscalculia, that’s about 4 million people in the UK. However, the research into dyscalculia is around 30 years behind that of dyslexia. To make the simulation as accurate as possible, I knew I needed to get real insights from people with dyscalculia."
        },
        {
            "heading": 2,
            "text": "Creating the new persona"
        },
        {
            "text": "I reached out to colleagues that I’d spoken to previously around dyscalculia to ask if they’d be interested in getting involved in the creation of the new persona. I explained that I’d just be asking questions on struggles they have, barriers they face and if there’s any specific things on websites that causes more stress and anxiety. Thankfully, they agreed to help! I massively appreciate those colleagues who opened up to me about the problems they face. "
        },
        {
            "text": "Doing this first-hand research helped me to understand the frustrations and stresses dyscalculia causes much more than any reading I’d done previously on the subject. Based on these insights, we added elements to the simulation to reflect real difficulties, such as:"
        },
        {
            "heading": 2,
            "text": "Feedback"
        },
        {
            "text": "Recently, one of the colleagues I did my research with, posted the persona on LinkedIn. It received over 650 likes and more than 110 reposts. We received amazing feedback, including from people with dyscalculia:"
        },
        {
            "text": "The Dyscalculia Network also commented ‘This is brilliant and will make such a huge difference in raising awareness! We will be sharing and encouraging people to try it out at our talks’. "
        },
        {
            "text": "Receiving this feedback from people with dyscalculia and the dyscalculia network was fantastic. I feel like the work so far has made an impact by raising awareness and providing education, both on dyscalculia itself and on the importance of designing with people with dyscalculia in mind."
        },
        {
            "heading": 2,
            "text": "Try it for yourself"
        },
        {
            "text": "Now that the excitement has been built, we invite you to explore our new dyscalculia persona and see what you think! "
        },
        {
            "text": "By stepping into this experience, you'll gain valuable insight into the challenges people with dyscalculia face and how small design changes can make a big difference."
        }
    ]
}