{
    "url": "https://naturalengland.blog.gov.uk/2025/03/06/outcome-of-natural-englands-review-of-bird-of-prey-wild-take-licensing-for-falconry-and-aviculture/",
    "title": "Outcome of Natural England’s review of bird of prey ‘wild take’ licensing for falconry and aviculture",
    "authors": [
        "John Holmes"
    ],
    "categories": [
        "Evidence",
        "Licensing",
        "Natural England",
        "Nature",
        "Wildlife"
    ],
    "pub_date": "2025-03-06T12:01:00+00:00",
    "content": [
        {
            "text": "Natural England has today published the outcome of its review into the licensing of ‘wild take’, a practice that involves taking young birds of prey from the wild for use in falconry and aviculture. Defra ministers have endorsed Natural England’s recommendation that there should be a presumption against the granting of future wild take licences, other than in exceptional circumstances. This blog examines the background to the review, the way in which it was carried out, what we’ve learnt from this, and the implications for licensing."
        },
        {
            "text": "A little history"
        },
        {
            "text": "Falconry has been practised in England since at least the 8th century and is typically defined as using a trained bird of prey to hunt specific ‘quarry’ species in the wild. UNESCO describe it as “the traditional art and practice of training and flying falcons… and other birds of prey”. There have been some notable changes in how falconry is practised in this country over time. At one stage it was practised almost exclusively by the nobility, often on horseback, and targeting a different range of quarry species to that of present-day falconers. By the 18th century, the popularity of falconry amongst the nobility had declined, as it was increasingly forced to compete with sport shooting. These days, falconry has a wider following, and in increasing numbers, though the core aspect of hunting using a trained bird of prey remains essentially unchanged."
        },
        {
            "text": "In the 1980s, falconers in England stopped taking birds of prey from the wild because of concerns about population declines due to persecution and poisoning by pesticides. Since then, falconers have used captive-bred birds instead. Restrictions on taking birds of prey from the wild do not appear to have had a detrimental impact on the popularity of the sport."
        },
        {
            "text": "Many bird of prey populations have thankfully now recovered and are doing better across much of England. For example, the wild population of peregrine falcon in England, one of the most widely used birds in falconry, has increased from just 47 breeding pairs in the 1970s to 825 pairs by the time of the last full survey in 2014. Although persecution still limits numbers in some upland areas, peregrines are now widespread with a secure, healthy population. The captive-bred population of peregrine falcons has also increased dramatically over this period and now outnumbers the wild population."
        },
        {
            "text": "The law and licensing"
        },
        {
            "text": "Natural England has a statutory responsibility, on behalf of Defra, for determining licence applications to take birds of prey from the wild for use in falconry and aviculture. Licences may only be granted on a selective basis and for a small number of birds, provided there are no satisfactory alternatives and no negative conservation impacts. In recent years, a small number of licence applications have been received and in 2020 Natural England issued three licences to take peregrine falcon chicks. These licences were not used and have now expired."
        },
        {
            "text": "The need for a review"
        },
        {
            "text": "The licences issued in 2020 were the first such licences granted in over 30 years. Although they were not used, there was a strong negative reaction from some stakeholders and questions from both falconry and conservation organisations about our approach to assessing future applications. There were concerns in some quarters that licences could be abused, leading to an increase in the illegal export of wild-origin birds. There were also questions around the availability of captive-bred birds and whether there was a need for wild take to supplement captive populations, as well as on the cultural significance of wild take to practising falconers."
        },
        {
            "text": "It was clear that that additional evidence was needed to inform our assessment of any future applications. Defra agreed that we should temporarily suspend wild take licensing to undertake a review, engage with stakeholders and develop a robust approach to support future decision-making."
        },
        {
            "text": "What we did and what we learned"
        },
        {
            "text": "As there were a range of strong views and possible sources of evidence and insights, it was important for us to reach out to all those with an interest in the topic in an open and transparent way. The review used a mixture of methods, including quantitative and qualitative social science research and participatory stakeholder approaches, based on new International Union for Conservation of Nature (IUCN) guidelines on Human-Wildlife Conflict and Coexistence. This enabled us to obtain a better understanding of stakeholder views, values and attitudes, to identify differences and common ground, and to bring together interested parties to explore what a positive future for birds of prey and falconry might look like."
        },
        {
            "text": "The process included workshops, interviews, a literature review, and a public call for evidence. A range of topics were covered, exploring views on the behaviour and genetics of captive and wild bird of prey populations, and on some of the key historical and cultural aspects of falconry practice and how it has changed over time."
        },
        {
            "text": "The following key points emerged from the social science research, including that:"
        },
        {
            "text": "Conclusion and next steps"
        },
        {
            "text": "Natural England’s review process has concluded that:"
        },
        {
            "text": "Natural England’s Science Advisory Committee found the review process and its conclusions to be scientifically robust. Natural England’s advice to Defra was therefore to recommend a presumption against licensing, other than in exceptional circumstances. This approach provides clarity to stakeholders and avoids putting applicants through a potentially burdensome application process where there is very limited chance of success. This approach is supported by the review findings that it would be extremely difficult for applicants to justify the need to take wild birds at the present time."
        },
        {
            "text": "Defra ministers have endorsed Natural England’s recommendation to adopt a presumption against issuing licences to take wild birds of prey for falconry and aviculture. Whilst the power to grant licences will remain on statute, Defra ministers support the view that licences should not be issued, other than in exceptional circumstances. No evidence was provided during the review process that would support the issuing of licences for any specific exceptional circumstances at the present time."
        },
        {
            "text": "This outcome will help to protect wild birds of prey whilst enabling sustainable falconry practices to continue. Despite the range of views on this topic, or perhaps because of that, it has been widely acknowledged that the review process was robust, transparent, fair, and inclusive. After the second stakeholder workshop, participants reported higher levels of trust in the process and a greater level of confidence of evidence-based outcomes than they did at the start."
        },
        {
            "text": "I would personally like to extend my thanks to everyone involved in the review process, in particular those who took the time to provide information through the call for evidence or by participating in interviews and workshops. We will be publishing an evaluation of the project later this year, informed by the views of those that contributed to the review process."
        },
        {
            "text": "Note: The scope of the review was strictly limited to the consideration of activities relating to the taking of native birds of prey from the wild in England for falconry and aviculture. Licences to kill certain ‘quarry’ species of wild birds in the course of falconry are considered separately and further information can be found here."
        }
    ]
}