{
    "url": "https://environmentagency.blog.gov.uk/2025/03/06/strengthening-environmental-science-a-new-chapter-in-water-monitoring/",
    "title": "Strengthening Environmental Science: A New Chapter in Water Monitoring",
    "authors": [
        "Environment Agency"
    ],
    "categories": [
        "Environment Agency",
        "Science",
        "Water Monitoring"
    ],
    "pub_date": "2025-03-06T11:38:29+00:00",
    "content": [
        {
            "text": "Enhancing our scientific capabilities to understand and monitor England's rivers, lakes and coastal waters."
        },
        {
            "text": "Investing in Scientific Excellence"
        },
        {
            "text": "The Environment Agency (EA) has taken an important step forward in enhancing our water monitoring capabilities with a £4 million investment in our Leeds laboratory facilities. This state-of-the-art facility demonstrates how protecting our environment and growing our economy can work hand in hand – creating skilled jobs for scientists and researchers while strengthening England’s capabilities in environmental science and innovation. The refurbishment, funded through Defra’s Natural Capital and Ecosystem Assessment (NCEA) programme, will help protect our waters while supporting the businesses that depend on them."
        },
        {
            "text": "Speaking at a recent stakeholder event at the newly refurbished Leeds laboratory, our Chief Scientist Dr Robert Bradburne set out the Environment Agency's vision for environmental monitoring. He highlighted how this investment marks a significant milestone in our journey to enhance our scientific capabilities."
        },
        {
            "text": "Environmental monitoring is complex and demanding work that requires continuous adaptation to meet emerging challenges. Like many public sector organisations, we have faced resource pressures in recent years, a challenge recognised by many environmental organisations and specialists. The refurbishment of our Leeds laboratory represents an important step forward in our ongoing work. This investment will enhance our monitoring capabilities, providing increased capacity to analyse samples from our newest monitoring networks while helping us build on our existing scientific expertise."
        },
        {
            "text": "The Scale of Our Environmental Monitoring"
        },
        {
            "text": "Currently, Environment Agency scientists analyse 99,000 water samples annually, producing over 1.7 million individual measurements. We monitor more than 1,800 different elements in water, from chemical compounds to microscopic life, helping us understand and protect our rivers, lakes, and coastal waters. This work fulfils 42 different legislative requirements, split across nearly 100 programmes and environmental themes."
        },
        {
            "text": "Our monitoring network spans the entire water system – from source to sea. Our team of over 1,000 skilled scientists and technical experts use this data to make evidence-based decisions that protect and improve our environment. Whether it's responding to pollution incidents or tracking long-term changes, every action is grounded in robust science."
        },
        {
            "text": "Innovation and Future Direction"
        },
        {
            "text": "The laboratory upgrade in Leeds is just one part of our broader strategy to strengthen environmental monitoring. Our vision is for monitoring that is science-driven, outcomes-focused, and adaptive."
        },
        {
            "text": "Through the NCEA programme, we are developing new approaches to understand the current state of England's waters - establishing what we call a baseline. This baseline will tell us what our waters are like now, helping us measure and understand changes in the future. The NCEA programme has designed new monitoring networks to provide a national-scale picture across different water environments - including rivers, small streams, lakes, groundwater and estuaries & coasts. As these networks are established over the coming years, they will help build our baseline understanding of England's waters."
        },
        {
            "text": "The River Surveillance Network represents a significant advance in our monitoring approach. We have already collected data from 1,400 sites across England’s rivers, working towards our target of 1,600 sites. To ensure we get an unbiased nationally representative picture, we use a scientific method that randomly selects sites across all types of rivers. At these locations, we will be gathering and analysing different features of river health, from the chemical makeup of the water to the tiny plants and animals that live in it."
        },
        {
            "text": "This monitoring goes beyond simply measuring water quality. We're exploring how this data can help us understand the broader benefits our waters provide - from supporting wildlife to contributing to local communities and the economy. By looking at our rivers, streams and other water bodies through this 'natural capital' lens, we can better understand their value to society and how they change over time."
        },
        {
            "text": "As we collect this baseline information, we're also using innovative technologies like environmental DNA analysis, helping us to better understand and respond to challenges across all our water environments."
        },
        {
            "text": "Building for Tomorrow"
        },
        {
            "text": "Looking ahead, we are focused on powering data-driven decisions that deliver positive outcomes for people, nature and the economy. Through the NCEA programme and digital programmes, we are developing new monitoring networks and solutions for storing, analysing, and sharing our data."
        },
        {
            "text": "By combining proven expertise with innovation, we're working to ensure that England's environmental science capabilities continue to develop and strengthen. This investment represents an important step in our ongoing commitment to excellence in environmental monitoring and scientific understanding."
        },
        {
            "text": "Want to know more?"
        },
        {
            "text": "Explore what we know about your local environment by visiting our Data Explorer. Here you can discover and download information about waters across England."
        }
    ]
}