{
    "url": "https://educationhub.blog.gov.uk/2025/03/world-book-day-2025/",
    "title": "World Book Day 2025: Reading for pleasure top tips for parents and teachers",
    "authors": [
        "mediaofficer"
    ],
    "categories": [
        "Literacy",
        "Primary Schools",
        "Schools",
        "World Book Day"
    ],
    "pub_date": "2025-03-06T00:01:00+00:00",
    "content": [
        {
            "heading": 4,
            "text": "Guest post by the National Literacy Trust"
        },
        {
            "text": "World Book Day isn’t just about putting together a great costume idea, it’s about showing children the power of reading."
        },
        {
            "text": "Reading lets children discover new worlds, meet new people and learn about the past. It sparks imagination, gets children thinking differently and helps develop empathy. Which is why this World Book Day, we want to talk about the importance of encouraging reading for pleasure."
        },
        {
            "text": "When children enjoy reading and have books of their own at home, it can benefit all areas of their lives, from boosting their confidence and wellbeing to improving their academic performance and life chances – setting them up for a brighter future."
        },
        {
            "text": "The government’s recent commitment to reading for pleasure as part of its Plan for Change to drive high and rising standards across education comes at an important moment, as our research shows that children and young people’s reading enjoyment has reached a record low."
        },
        {
            "text": "Working together, we’re supporting families and schools to empower more children and young people with the reading and literacy skills they need to grow, learn and thrive. This includes encouraging families to chat, play and read with their child from birth through Start for Life, through to the UK-Ukraine school partnerships programme, where pupils will explore reading as a tool to build literacy skills, cross-cultural understanding, expand horizons, and boost confidence and wellbeing."
        },
        {
            "text": "This World Book Day, we’re sharing top tips for parents and teachers to help children and young people unlock the magic of books and discover a love of reading that can change life stories."
        },
        {
            "text": "Top tips for parents  "
        },
        {
            "text": "Top tips for teachers"
        }
    ]
}