{
    "url": "https://supportingfamilies.blog.gov.uk/2023/08/10/bridging-the-gaps-in-intensive-support-for-expectant-parents-in-redbridge/",
    "title": "Bridging the Gaps in Intensive Support for Expectant Parents in Redbridge",
    "authors": [
        "ballypahal"
    ],
    "categories": [
        "Early Help",
        "Education",
        "Employment",
        "Evaluation",
        "Health",
        "Multidisciplinary Teams",
        "Reducing Parental Conflict"
    ],
    "pub_date": "2023-08-10T11:55:16+01:00",
    "content": [
        {
            "text": "Redbridge Borough Council have a range of support offers for families with babies, from helping those who need some extra community-based support, to others with multiple, complex social problems that may involve safeguarding responses from the local authority."
        },
        {
            "text": "Baby and Me "
        },
        {
            "text": "Redbridge Borough Council have identified that initiating early, preventative and family-centred work for the most vulnerable families is very challenging. The council are responding proactively to fill in gaps in areas where traditionally children’s social care may not have worked closely with more universal services spanning health and early years education."
        },
        {
            "text": "The Council leadership have taken a bespoke approach to supporting vulnerable babies and their families through dedicated Baby and Me social work teams that work with mothers in the later pregnancy. The Baby and Me approach sees social workers, backed by family support and universal health, development and early years education services, working together with community and specialist services from across the local partnership. The Baby and Me team around the family are working intensively with vulnerable expectant parents in the earliest part of the pregnancy, including with families where babies have previously been taken into care."
        },
        {
            "text": "The approach blends statutory social work oversight with family support and a focus on promoting strong parent-infant relationships as early on as possible. The aim of Baby and Me is to change the trajectory of escalation towards young babies being placed into care and adopted. The upskilling and specialising of social work teams in this way is partly with the aim to break down traditional professional silos and thresholds to counter gaps in services that families experience, such as limited access to services due to having moved out of borough or not fitting the criteria for specialist services such as the dedicated Family Nurse Partnership who work with the youngest expectant and new parents in Redbridge."
        },
        {
            "text": "Due to high levels of complexity and safeguarding needs for babies in Redbridge, the approach began by working with families already undergoing statutory child protection intervention. It is now on offer to many families who are not subject to social care involvement but are working with Early Help targeted services. Here babies’ circumstances remain complex although families engage with this intensive support in a voluntary and consent-based arrangement."
        },
        {
            "text": "Supporting babies, supporting whole families through early help"
        },
        {
            "text": "A wider range of new and expectant parents who require a spectrum of targeted and intensive support in Redbridge can access support from a whole family-oriented offer available through early help. The local employment and skills approach, ‘Think Work’ is delivered through DWP and the Local Authority, to overcome barriers in families’ access to benefit entitlements, to build new employment skills, confidence and to access sustainable employment opportunities in the long term. Specialist family support workers also work across local services and networks to assist families facing problematic debt and at risk of homelessness."
        },
        {
            "text": "The Families Together Hub Early Help service takes a ‘Think Couple’ approach. Parenting workers within the Families Together Hub support parents to develop better relationships with their babies through a range of targeted programmes including"
        },
        {
            "text": "Widening community reach for better public health "
        },
        {
            "text": "Redbridge Council employ public health connector roles to prioritise the principle that families navigating services should not tell their stories more than once. The council are currently building up a wider workforce that can roll out ‘making every contact count,’ the approach of helping families and people navigate and connect to services at every given opportunity- whether universal or targeted. Community connectors undertake listening exercises to understand how different communities may want to access or experience public health, community, and universal services. Developing plans for the rollout of a Community Hub in Redbridge is seeing the council further harness the local voluntary sector’s capacity to identify problems and find solutions within the community, and to reach families from all walks of life."
        }
    ]
}