{
    "url": "https://socialcare.blog.gov.uk/2023/08/10/putting-it-on-digital-record/",
    "title": "Putting it on (digital) record",
    "authors": [
        "Peter Skinner"
    ],
    "categories": [
        "Care and support",
        "Digital skills and technologies",
        "Guidance",
        "Innovation",
        "Workforce"
    ],
    "pub_date": "2023-08-10T09:20:29+00:00",
    "content": [
        {
            "heading": 2,
            "text": "What is a DSCR?"
        },
        {
            "text": "A DSCR solution (which you may also know as an electronic care plan) allows the digital recording of care information and care received by an individual, within a social care setting, replacing traditional paper records. DSCRs allow information to be shared securely and in real-time with authorised individuals across the health and care sector."
        },
        {
            "text": "They have the potential to transform the way in which care is provided. Moving care plans from paper to electronic formats makes it easier for care workers and managers to get the information they need to respond more quickly to people’s needs, minimise risks to people’s safety and reduce time wasted on administration and reporting."
        },
        {
            "text": "And looking to the future, they will provide the platform for other remote care tools to integrate, supporting more personalised care and making sure health and care professionals can build up a more complete picture of someone’s care needs. Already, 1,000 providers can access relevant information from GP records through their DSCR and that’s just the beginning."
        },
        {
            "heading": 2,
            "text": "Guidance to go digital"
        },
        {
            "text": "The critical role DSCRs can play has also been recognised by the Care Quality Commission (CQC). In May, they published guidance about DSCRs and their importance in achieving good outcomes for people who use services. The guidance states that “digital records will increasingly replace paper records, meaning digital systems will be vital to capture and share information. This is essential for truly integrated services that work for people”. It also summarises what good digital social care records look like, signposting readers to our list of assured solution providers, which have been tested to ensure they meet the needs of care providers."
        },
        {
            "text": "CQCs guidance highlights the benefits of the digital approach to care planning and how it supports providers to:"
        },
        {
            "text": "Over the last year, we’ve made significant progress, working with the sector, to help providers to adopt DSCRs, in line with government commitments, but we know there are many providers who still need to make that leap. If you are one of them, we’re here to help. From a list of assured solutions, funding and skills support, we can support you to move away from paper-based record keeping and to see how a digital approach can support you in achieving good outcomes for people using adult social care services."
        },
        {
            "text": "Have a look at the Digital Social Care site to find out more or you can email the digitising social care team at england.adultsocialcare@nhs.net"
        },
        {
            "heading": 4,
            "text": "A version of this article first appeared in Caring Times"
        }
    ]
}