{
    "url": "https://socialcareinspection.blog.gov.uk/2023/08/10/registering-childrens-homes-principles-and-hints-and-tips/",
    "title": "Registering children’s homes – principles and hints and tips",
    "authors": [
        "Yvette Stanley"
    ],
    "categories": [
        "children's homes",
        "looked after children",
        "social care regulation"
    ],
    "pub_date": "2023-08-10T10:00:02+01:00",
    "content": [
        {
            "text": "We know that applying to register a children’s home is a serious step. It is right that there are exacting standards to meet, but we want the process to work well. The following hints and tips should help with a smoother application."
        },
        {
            "heading": 3,
            "text": "Principles of registration"
        },
        {
            "text": "We currently have over 3,000 registered children’s homes. But, as I blogged about last year, there remains a need for specialist homes that can provide high-quality care for children with multiple and complex needs."
        },
        {
            "text": "We do not necessarily need more children’s homes; we need the right homes. We need homes that offer suitable care for the most vulnerable children with multiple needs due to their past experiences."
        },
        {
            "text": "Some providers are trying to find creative solutions. We have been looking at how we can take that into account in our registration process."
        },
        {
            "text": "We have created some principles to help our inspectors when they are reviewing applications. We are not lowering our standards. We still make decisions based on whether the applicant complies with (and will continue to comply with) the legal requirements. The principles focus our decision-making on children’s best interests, particularly where the application is for a less conventional home."
        },
        {
            "text": "The principles are that:"
        },
        {
            "heading": 3,
            "text": "Hints and tips"
        },
        {
            "text": "In September 2021, we published a blog ‘Applying to register a children’s home: top tips’."
        },
        {
            "text": "We wanted to highlight this blog again, and provide some further tips based on some of the frequent asked questions."
        },
        {
            "heading": 4,
            "text": "Staffing"
        },
        {
            "text": "We do not expect a full staff team to be in place before you register. But when we carry out the registration visit, we will need to see that you have enough staff and they have the right experience and qualifications to meet the children's needs. They should be able to look after the number of children you intend to accommodate from the start of your registration."
        },
        {
            "text": "So, if you will only be caring for one child at first, we will only expect you to have sufficient staff to care for one child. But we will be looking for this to be reflected in your business plans. And we will want to see a plan for how you will recruit the staff to care for more children in the future."
        },
        {
            "heading": 4,
            "text": "Managers and responsible individuals"
        },
        {
            "text": "We know how difficult it is right now, to find the right people with the right skills to manage your new home. Legislation sets out what managers need to demonstrate, to be considered fit and suitable. We cannot register people who do not meet those criteria. You should be confident that your manager can show us that they have the required skills, knowledge and experience. Otherwise, we cannot recommend that your home is registered."
        },
        {
            "text": "To register you will also need someone to be the responsible individual (RI) who has the skills and experience set out in regulation 26. The RI has a very important role, particularly in the first few months as a home is established. Even experienced managers need support. One of the reasons newly registered homes can be judged inadequate at their first full inspection is because the RI or manager left shortly after registration and was not replaced or replaced quickly enough."
        },
        {
            "heading": 4,
            "text": "Applying to manage more than one children’s home"
        },
        {
            "text": "For a manager to manage 2 homes, we need to be satisfied that the manager has the required experience, qualifications and skills. We need to be confident that they can manage each home, and the care of the children, effectively and on a daily basis. We usually consider factors including:"
        },
        {
            "text": "Our introduction to children’s homes guidance gives more detail."
        },
        {
            "heading": 4,
            "text": "Premises"
        },
        {
            "text": "When we visit premises, we are looking for things such as:"
        },
        {
            "heading": 4,
            "text": "Multi-building children’s homes"
        },
        {
            "text": "You may apply to register a children’s home where the care and accommodation is provided in more than one building. You can accommodate up to 6 children in up to 4 buildings within a single registration with one manager. We call this a ‘multi-building children’s home’."
        },
        {
            "text": "A multi-building children’s home should allow you to make child-centred decisions about where each child lives. It can make it easier to make sure that you meet their individual needs. These decisions should be taken in agreement with the placing authority. It might mean that you can offer a place to a child who needs somewhere to live quickly or who cannot easily live with other children immediately. We have published guidance on registering a multi-building children’s home."
        },
        {
            "heading": 4,
            "text": "Location assessments"
        },
        {
            "text": "Your location assessment must show the steps you have taken to make sure that:"
        },
        {
            "text": "You will also need to consult relevant local bodies and services, and consider their views. Inspectors will ask you for evidence of your contact with the right people in the local authority. They will also ask how your location assessment has informed your plans for the home you want to open."
        },
        {
            "heading": 4,
            "text": "Planning permission for your property"
        },
        {
            "text": "You will need to show that you either don’t need planning permission, or that you have the right planning permission in place. If you have it at the start of your application, this means that we will have an important piece of your application already to hand."
        },
        {
            "text": "We do accept applications where you have applied for planning permission, but you have not yet had a response. We know there can be long waits and you may want to challenge decisions. We know that this can be frustrating, but there is nothing we can do except wait for you to get the correct permissions."
        },
        {
            "heading": 4,
            "text": "Checks on individuals submitting application forms"
        },
        {
            "text": "We know that submitting forms to us can sometimes feel burdensome, particularly if you have done so in the past. We are trying to reduce this burden, but wanted to explain why this is still required in some cases."
        },
        {
            "text": "We do accept applications from someone with an older DBS check, providing they have been subscribed to the DBS Update Service ever since. We do not insist on people working in children’s social care being subscribed to the Update Service but we do recommend it. We know it costs £13 a year but it means you will not need another DBS check while you subscribe, and will not need to carry out a new one when applying."
        },
        {
            "text": "It is also really important that applicants make sure that they identify the right referees. The best referees have professional management experience of a person’s work with children, and the last employer is a must. References are vital to our assessment of an applicant, and an important part of assessing their suitability. I appreciate that providers may have already sought references for their managers, but we are still required to seek our own. The provider’s employment process is different to our registration process."
        },
        {
            "text": "We will accept the application with a self-declaration and review the GP’s form when it arrives. At present, we are unable to make a registration decision without something from your GP."
        },
        {
            "text": "If our application website does not give you the information that you need when trying to submit an application to register, send an email to sc.admin@ofsted.gov.uk with the subject line ‘Social care application’ and provide your full name and reference number for someone to call you."
        },
        {
            "text": "We hope that this information is helpful. We want to help you to open the right homes in the right places so that so that more children can live closer to home, nurtured by skilful staff."
        }
    ]
}