{
    "url": "https://defrafarming.blog.gov.uk/2023/08/10/the-sustainable-farming-incentive-offer-in-2023-guidance-update/",
    "title": "The Sustainable Farming Incentive offer in 2023: guidance update",
    "authors": [
        "The Team"
    ],
    "categories": [
        "Sustainable Farming Incentive"
    ],
    "pub_date": "2023-08-10T16:26:54+01:00",
    "content": [
        {
            "text": "We've made some minor changes to the SFI Handbook for the 2023 offer and provided voluntary guidance on how you could do the SFI actions in response to feedback from farmers. "
        },
        {
            "text": "In this post, we’ll share an overview and links. "
        },
        {
            "heading": 2,
            "text": "Updates to the SFI Handbook for the 2023 offer "
        },
        {
            "text": "In June, we published the SFI Handbook for the 2023 offer on GOV.UK. It sets out all the actions we will pay for and the scheme's rules.   "
        },
        {
            "text": "In response to feedback from farmers and others, we’ve: "
        },
        {
            "text": "We’re making these changes because the controlled rollout of the 2023 offer has not yet started.  "
        },
        {
            "text": "Once the controlled rollout starts from later this month, we’ll minimise any further changes to the SFI handbook.  "
        },
        {
            "text": "This is to provide stability, give certainty to farmers and agents, and save them the trouble of having to keep up to date with changes. "
        },
        {
            "heading": 2,
            "text": "Voluntary 'How to do the SFI actions' guidance "
        },
        {
            "text": "We’ve also created ‘How to do the SFI actions’ guidance. This new guidance explains good practice. "
        },
        {
            "text": "It gives advice on how you might choose to do the actions in the SFI handbook. It gives reassurance if you're unsure how to undertake an action, or if you're concerned you might do the wrong thing. "
        },
        {
            "text": "It covers each of the 23 actions in the SFI 2023 offer. These actions relate to: "
        },
        {
            "text": "This new guidance is voluntary. It’s there to help. You don’t have to follow it. "
        },
        {
            "text": "This is part of our overall approach to making SFI less prescriptive than previous schemes. "
        },
        {
            "text": "The SFI handbook for the 2023 offer sets out what farmers must do. All other guidance is voluntary. "
        },
        {
            "heading": 2,
            "text": "Coming soon"
        },
        {
            "text": "Before we start accepting application for the SFI 2023 offer, we’ll publish guidance to help farmers applying for an SFI agreement. "
        },
        {
            "text": "It will cover: "
        }
    ]
}