{
    "url": "https://naturalengland.blog.gov.uk/2023/08/10/the-england-species-reintroduction-taskforce-who-we-are-and-what-we-do/",
    "title": "The England Species Reintroduction Taskforce – who we are and what we do",
    "authors": [
        "Andy Clements"
    ],
    "categories": [
        "Species re-introductions",
        "Species recovery"
    ],
    "pub_date": "2023-08-10T13:28:34+01:00",
    "content": [
        {
            "text": "By Andy Clements - Chair, the England Species Reintroduction Taskforce"
        },
        {
            "text": "Introduction"
        },
        {
            "text": "Conservation translocations, the movement of species for conservation benefit, comprise a variety of techniques to help species withstand a range of pressures and to enhance ecosystem function. Species translocations include reintroductions, reinforcement of declining populations, replacement of an extinct species with a close relative and assisted colonisation in response to climate change or to mitigate threat of extinction."
        },
        {
            "text": "The Government has established the England Species Reintroduction Taskforce to help realise the full benefits of conservation translocations for nature recovery and society. We are an independent technical advisory group bringing together expertise from a wide range of disciplines to provide evidence-led advice and guidance to inform existing and potential species conservation translocations in England."
        },
        {
            "text": "The Taskforce"
        },
        {
            "text": "I have been appointed as Chair of the Taskforce for an initial term of three years. The membership is made up of 15 professionals from academia, land management, the statutory and the NGO conservation sectors. Specialisms include a range of taxa, and also knowledge and expertise on social science, environmental economics and practical experience of species reintroductions both at home and on a global scale."
        },
        {
            "text": "The Taskforce has met three times, in February, April and July 2023, and plans to meet six times in the first year to establish momentum and progress. We have met face-to-face at the Royal Botanic Gardens, Kew hosted by Professor Mike Fay, and at the Wildfowl & Wetlands Trust, Slimbridge hosted by Geoff Hilton, both hosts being Taskforce members. We have held one meeting online."
        },
        {
            "text": "Conservation translocations"
        },
        {
            "text": "Conservation translocations are a significant mechanism to assist nature’s recovery and this is recognised by Government targets in the Environmental Improvement Plan to stop extinction and improve species abundance. Reintroductions and translocations need to be done well and there is established guidance which should be followed."
        },
        {
            "text": "The Government has published the Reintroductions and other conservation translocations: code and guidance for England  setting the standards for translocations and through alignment with the Scottish code and IUCN guidelines encourages consistency across the United Kingdom and with international best practice."
        },
        {
            "text": "Members of the public are most likely to come across conservation translocations in the news in the context of rewilding, beavers or the reintroduction of controversial megafauna such as lynx and wolf. These media stories can generate emotional views for and against species reintroductions. The reality of what we need to do to recover nature with species interventions is much broader, more subtle and requires careful interpretation, advice and evidence-led guidance from the Taskforce."
        },
        {
            "text": "At our meeting in RBG Kew we heard about research to propagate and translocate the Lady’s Slipper Orchid, and at Slimbridge, the program to ‘head-start’ Curlew chicks. These illustrate the diversity of species that are subject to conservation translocations."
        },
        {
            "text": "Species translocations can be drivers of habitat improvement. The reintroduction of Chequered Skipper butterfly in Fineshade Wood, Northamptonshire has prompted the nearby Collyweston Great Wood National Nature Reserve to implement a programme of improved woodland ride management to encourage the skippers to spread into adjacent habitat. This is delivering enhanced species abundance with increasing populations of commoner butterflies recorded using the new habitat."
        },
        {
            "text": "Species reintroductions have the power to engage the public in experiencing and supporting conservation. In the 1990’s I was part of English Nature’s programme to reintroduce the Red Kite to England. Three decades on, shoppers at the Gateshead Centre, or in the streets of Henley-on-Thames, can watch at close hand the mastery of the air by these magnificent birds. In species recovery terms, the influx of kites across the UK has injected growth into the former relict Welsh population which is now recovering."
        },
        {
            "text": "Support for our work"
        },
        {
            "text": "Some conservation translocations may require a license and this regulatory work is undertaken by Natural England, not the Taskforce. Our current work focuses on two areas: predator guild assessment of candidate reintroductions taking account of their social, economic and ecological risks and benefits, and detailed evaluation of factors at play for progressing more and better species translocations. A future blog will expand on this initial advice and guidance and indicate further areas of evidence-led work."
        },
        {
            "text": "Gaining wide support for the work of the Taskforce, and for species translocations and reintroductions, is vital to the success of these mechanisms to help recover nature. We are beginning to engage much more broadly with stakeholders, initially convening small specialist groups on plants and invertebrates."
        },
        {
            "text": "By the spring of 2024 we expect to bring together a much broader group of interested individuals and organisations from landowners and managers, communities where species reintroductions are proposed, businesses and specialists in species recovery. In the meantime, those interested can keep up to date with the work of the Taskforce through social media and the dedicated GOV.UK website ."
        },
        {
            "text": " "
        }
    ]
}