{
    "url": "https://nationalscreening.blog.gov.uk/2023/08/10/uk-nsc-authors-explore-newborn-blood-spot-screening-best-practice-across-europe/",
    "title": "UK NSC authors explore newborn blood spot screening best practice across Europe  ",
    "authors": [
        "Silvia Lombardo"
    ],
    "categories": [
        "General"
    ],
    "pub_date": "2023-08-10T08:20:37+01:00",
    "content": [
        {
            "text": " "
        },
        {
            "text": "Several reports have highlighted differences between countries in how they approach screening newborn babies for very rare and ultra-rare conditions. "
        },
        {
            "text": "The UK is often considered an outlier by screening for fewer conditions compared to other European countries. Tests, treatments, and screening pathways vary, despite the international evidence base being the same.  "
        },
        {
            "text": "However, as we stressed in a previous blog article, simple screening comparisons between countries mask complex differences.  "
        },
        {
            "heading": 2,
            "text": "Principles for newborn screening "
        },
        {
            "text": "In 2021, the patient-led European Organisation for Rare Diseases (EURORDIS) published a set of principles for newborn blood spot (NBS) screening decision-making and implementation.  "
        },
        {
            "text": "We have taken the opportunity to use these as a comprehensive reference point to explore how NBS policy development and screening practice in the UK compares with a set of principles driven by patients in a paper published in the Lancet Regional Health – Europe."
        },
        {
            "heading": 2,
            "text": "Similarities and differences "
        },
        {
            "text": "Our analysis shows that the UK aligns with many of the principles recommended by EURORDIS, including that: "
        },
        {
            "text": "But we also explore areas of controversy and challenges, such as the concept of ‘actionability’ – whose views count when considering acceptable outcomes for a screening programme.  "
        },
        {
            "text": "EURORDIS principles consider the potential benefits of newborn screening for the broader family unit and consider these separately from benefits for the screened baby. The UK’s approach differs in that wider benefits to the family can strengthen the case for screening, but they do not on their own provide justification for screening.  "
        },
        {
            "text": "EURORDIS prioritises the perspective of the rare diseases’ community, while the UK National Screening Committee (UK NSC) criteria and ethical framework emphasise the perspectives of the broader public health community and the whole population offered screening. Ultimately, our paper concludes that this concept of ‘actionability’ is likely to be debated in the future and that consensus may not be reached.  "
        },
        {
            "text": "When it comes to the principle of stakeholder involvement, we found that the difference between the UK NSC and EURORDIS is not so much one of participation, but perhaps more about when patient and public representatives are invited to participate. Ultimately, we think there are opportunities to continue improving existing processes while at the same time start developing new mechanisms for stakeholder participation.  "
        },
        {
            "text": "The EURORDIS principles also talk about the use of modelling to estimate the effects of screening and to inform decision-making. The UK NSC has increasingly used this approach in recent years. However, while EURORDIS states that decision-making should ‘reflect health economic evidence’ but ‘not be determined only by health economics’, the UK NSC only recommends screening if it is satisfied screening does more good than harm at a reasonable cost.  "
        },
        {
            "heading": 2,
            "text": "Future challenges and opportunities "
        },
        {
            "text": "It is difficult to make international screening comparisons because decision-making processes often remain unpublished and difficult to verify. Despite these difficulties, being able to compare practices across Europe is an extremely useful exercise especially because significant issues are being played out, including whole genome sequencing technology, which could have huge implications for the future of newborn screening.   "
        },
        {
            "text": "Our paper will hopefully improve understanding of the way in which the Wilson and Jungner screening principles are being developed and applied in NBS screening settings across the continent. It may also inspire screening bodies in other European countries to compare their policymaking and implementation practices with those set out by EURORDIS and may stimulate further discussion on the challenges and opportunities of newborn screening. "
        },
        {
            "heading": 2,
            "text": "UK NSC blog"
        },
        {
            "text": "The UK NSC blog provides up to date news from the UK NSC. You can register to receive updates direct to your inbox, so there’s no need to keep checking for new articles. If you have any questions about this blog article, or about the work of the UK NSC, please email screeninginformation@dhsc.gov.uk."
        }
    ]
}