{
    "url": "https://deframedia.blog.gov.uk/2023/06/12/coverage-on-dangerous-dogs/",
    "title": "Coverage on dangerous dogs",
    "authors": [
        "Defra Press Office"
    ],
    "categories": [
        "Nature"
    ],
    "pub_date": "2023-06-12T12:59:29+01:00",
    "content": [
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": "There has been continued coverage on dangerous dogs, including in The Mirror as part of their Time for Action on Dangerous Dogs campaign. The campaign calls for a ‘Jack Lis Law’, named in honour of the 10-year-old tragically killed by a dog."
        },
        {
            "text": "We are working in partnership with police forces and local authorities across England and Wales to ensure the full range of existing dog control powers are effectively applied, including delivering sessions to share best practice in preventive dog control enforcement. This has encouraged multi-agency working to ensure dog control issues are addressed before they escalate."
        },
        {
            "text": "Informed by recent research, we established an expert Responsible Dog Ownership working group with the police, local authority groups and animal welfare experts to identify additional measures to reduce dog attacks and promote responsible dog ownership across all breeds of dog. The group meets regularly and will make its final recommendations to Ministers later this year."
        },
        {
            "text": "Responsible dog ownership is vital for all breeds of dog. Over the past year we have been supporting key partners so that families are equipped with practical tips to enjoy spending time safely with dogs.  Dog safety fact sheets that we have developed in collaboration with the Child Accident Prevention Trust, animal welfare organisations also been widely disseminated to parents, health visitors, safeguarding professionals, police forces and local authorities."
        },
        {
            "text": "Any member of the public can make a complaint to the Magistrates Court that a dog is out of control."
        },
        {
            "text": "It is a criminal offence under the Dangerous Dogs Act 1991 to allow any dog to be dangerously out of control. This can lead to a prison sentence or a disqualification order which prevents the owner from keeping dogs for a certain period of time."
        },
        {
            "text": "Community Protection Notices can be served by police and local authorities on dog owners whose dogs are behaving aggressively - and could require them to take appropriate action to prevent a recurrence of the offending behaviour."
        },
        {
            "text": " "
        },
        {
            "text": "A Defra spokesperson said:"
        },
        {
            "text": " "
        },
        {
            "text": " Follow Defra on Twitter, and sign up for email alerts here."
        }
    ]
}