{
    "url": "https://educationhub.blog.gov.uk/2023/06/how-are-ofsted-inspections-changing/",
    "title": "How are Ofsted inspections changing?",
    "authors": [
        "mediaofficer"
    ],
    "categories": [
        "Schools"
    ],
    "pub_date": "2023-06-12T00:03:19+01:00",
    "content": [
        {
            "text": "Ofsted has announced changes to how school inspections are carried out to reduce pressures on teachers and school leaders.  "
        },
        {
            "text": "Ofsted provides independent, up to date evaluations on the quality of education, behaviour, personal development, safeguarding, and leadership, which schools and parents value.  "
        },
        {
            "text": "We want the inspection system to be as helpful as possible for everyone, which is why we’ve listened to calls from teachers and school leaders and are working with Ofsted to make improvements to the process.  "
        },
        {
            "text": "Here we tell you everything you need to know about the changes by Ofsted and why they’re happening."
        },
        {
            "heading": 3,
            "text": "What Ofsted reforms have been announced? "
        },
        {
            "text": "These reforms aim to reduce stress for teachers and school leaders around inspection time, while making sure school inspections are rigorous and accurate. "
        },
        {
            "text": "The changes include:  "
        },
        {
            "text": "Ofsted is launching a formal consultation on changes to the complaints system, aimed at resolving complaints made by schools more quickly through improved dialogue and transparency. The administrative burden on those making a complaint will be reduced.  "
        },
        {
            "text": "At the moment, even when schools are rated mostly as Good, if the school is rated as Inadequate on safeguarding, the school will receive an Inadequate rating overall. This is due to the importance of keeping children safe.  "
        },
        {
            "text": "But, in very rare cases where a school fails because of safeguarding issues alone, Ofsted will now follow-up with a monitoring visit within three months to provide an opportunity for regrading. If the school has been able to resolve the safeguarding concerns, it is likely to see its overall grade improve. "
        },
        {
            "text": "Ofsted will also make safeguarding requirements as clear as possible for schools and parents. "
        },
        {
            "text": "To reduce pressure on headteachers, Ofsted will make it clear that they are allowed to share the provisional outcomes of inspections privately with colleagues and get support from them before the report is finalised and shared with parents. "
        },
        {
            "text": "Ofsted reports will also talk about what the school needs to do, to reduce public focus on individuals, including headteachers. "
        },
        {
            "text": "Ofsted is giving schools more information about the timing of their next inspection. Schools will still get one day’s notice, but they will have more clarity about the year they are likely to be inspected. This will be particularly helpful for schools that have been exempt from inspection for many years.  "
        },
        {
            "text": "Outstanding schools are inspected less frequently than those with lower ratings. Outstanding schools that were last inspected before September 2015 are already receiving face-to-face seminars, to support them when the time comes for a new inspection. "
        },
        {
            "heading": 3,
            "text": "When will these changes take place? "
        },
        {
            "text": "Many of these changes, such as increased clarity about the timing of the next inspection and seminars for schools between inspections, will take effect immediately or are already being implemented. The rest introduced will be introduced from September 2023. "
        },
        {
            "heading": 3,
            "text": "What other support is the Department for Education providing for teachers? "
        },
        {
            "text": "We’re building on commitments made to improve teacher mental health in the Education Wellbeing Charter by providing extra funding to expand the package of wellbeing support for school leaders.  "
        },
        {
            "text": "This will double our professional supervision and counselling offer for this year, allowing hundreds more school leaders to access support. "
        },
        {
            "heading": 3,
            "text": "Why is Ofsted making these changes?  "
        },
        {
            "text": "Ofsted ratings play an important role in making sure education is the best it can be, as well as making sure children are safe in school.  "
        },
        {
            "text": "However, we know that some teachers and school leaders would like to see some changes to the way inspections are carried out.  "
        },
        {
            "text": "We want all school leaders to have confidence in the inspection system, and for it to be as useful as possible, for teachers, parents and children alike.  "
        },
        {
            "text": "These reforms will have a real difference and will make sure that Ofsted continues to be a valuable source of impartial information, which is trusted by teachers and leaders.  "
        },
        {
            "heading": 3,
            "text": "Why isn’t Ofsted changing the one-word rating system? "
        },
        {
            "text": "We believe that one-word ratings are the clearest way to give parents confidence in choosing the right school for their child.  "
        },
        {
            "text": "More detailed information about Ofsted inspections is easily accessible to everyone via Ofsted’s website. Parents can search for specific school’s Ofsted reports here to get all the detail, as well as the overall rating.  "
        }
    ]
}