{
    "url": "https://educationhub.blog.gov.uk/2023/06/12/how-we-are-ensuring-young-people-have-access-to-great-music-education/",
    "title": "How we are ensuring young people have access to great music education",
    "authors": [
        "mediaofficer"
    ],
    "categories": [
        "music education",
        "Schools"
    ],
    "pub_date": "2023-06-12T10:00:24+01:00",
    "content": [
        {
            "text": "This post was updated on 12/07/2023 "
        },
        {
            "text": "Learning about music and having the opportunity to play musical instruments and make music together is a vital part of a rich and rounded education."
        },
        {
            "text": "It has been proven that music plays a key role in brain development, helping to nurture language, motor skills, emotional intelligence, and collaboration skills."
        },
        {
            "text": "We have published guidance setting out what the National Plan for Music Education means for children and young people, and how they can get involved in music both in and out of school."
        },
        {
            "text": "Here’s what you need to know."
        },
        {
            "heading": 3,
            "text": "What should music education look like in school?"
        },
        {
            "text": "Music is part of the National Curriculum from the ages of 5 to 14, and should be taught in a carefully planned, sequenced way just like maths, English or science."
        },
        {
            "text": "A great music education in school includes:"
        },
        {
            "heading": 3,
            "text": "What is a Music Hub and how can young people get involved?"
        },
        {
            "text": "Music Hubs are networks of schools, education charities and organisations, music services and community groups. They work together to make sure that every child across the country has the chance to explore music."
        },
        {
            "text": "Music Hubs work with around 9 in 10 state-funded schools in England. This includes collaborating with teachers in the classroom to provide great music education, as well as providing opportunities for pupils to learn and enjoy music outside of school. They support pupils through music exams, and encourage whole class instrumental lessons, singing lessons, choirs and much more."
        },
        {
            "text": "You can find information about your local music hub at Music Education Hubs | Arts Council England."
        },
        {
            "text": "National Youth Music Organisations help to develop talented young musicians across a range of musical genres. They also provide support to Music Hubs and many further and higher education settings."
        },
        {
            "heading": 3,
            "text": "How are you helping young people to access musical instruments?"
        },
        {
            "text": "Having access to the right instruments helps all children and young people to progress with their music education inside and outside school, allowing them to play in an ensemble with their peers or recreate broad genres of music."
        },
        {
            "text": "From September 2024, Music Hubs will receive £25 million to fund a wide variety of instruments for children and young people. These will include both traditional instruments and adapted instruments. Adapted instruments are especially designed so that children and young people with SEND (special educational needs & disabilities) can participate in music."
        },
        {
            "heading": 3,
            "text": "What other financial support is available for young people who want to access music education?"
        },
        {
            "text": "There are several organisations that can help with providing support for costs, fees and access to music. More details on these organisations can be found in our guidance."
        },
        {
            "text": "This includes costs for musical instruments, lessons and rehearsal spaces and financial support to take part in activities with youth music organisations beyond school."
        },
        {
            "text": "Your local Music Hub may provide financial support for some activities."
        }
    ]
}