{
    "url": "https://ruralpayments.blog.gov.uk/2023/06/12/join-rpa-at-agricultural-shows-this-summer-and-autumn/",
    "title": "Join RPA at agricultural shows this Summer and Autumn",
    "authors": [
        "RPA Editor"
    ],
    "categories": [
        "Basic Payment Scheme",
        "Countryside Stewardship",
        "Environmental Stewardship"
    ],
    "pub_date": "2023-06-12T14:42:23+01:00",
    "content": [
        {
            "text": "RPA travels around the country throughout the year to attend a variety of agricultural shows. Our presence at these events allows us to have valuable face-to-face contact with a wide range of farmers, gaining their insight and feedback on existing and new schemes, as well as discussing what’s important in their local communities."
        },
        {
            "text": "RPA is primarily at shows to answer queries from farmers and agents across all current and future schemes. This year, RPA will specifically be focussing on the take up of Sustainable Farming Incentive, Farming Investment Fund grants and Countryside Stewardship (CS)."
        },
        {
            "text": "Visitors can discuss any issues or queries they have, and the team manning the stand make sure they’ve got a wide breadth of knowledge and can answer as many questions as they possibly can. We’ll always do what we can to help, or take away queries we can’t answer on the day. We also have a range of leaflets, lots of great literature on CS and the different elements of the scheme, woodland and SFI."
        },
        {
            "text": "For the vast majority of farmers, visiting the RPA stand at a show may be the only face-to-face contact you have with us. So, when you attend, it provides us with the insight into how you feel about our future and existing schemes."
        },
        {
            "text": "Attending shows also allows us to use the insight we gain to influence delivery and inform the development of future schemes. Meeting farmers provides us with unique feedback which influences why we do so many things – policy, guidance, internal processes. Having this early insight into how the industry is feeling allows us to feed that back into RPA and where we may need to do a little bit more."
        },
        {
            "text": "RPA and Defra often attend shows together, and we also have Forestry Commission and Catchment Sensitive Farming colleagues join too, which offers customers the opportunity to talk through a range of issues to a number of delivery bodies in one place."
        },
        {
            "text": "The RPA shows and events schedule adds real value to those who use RPA’s services, as well as engaging out into the industry and listening to what’s being said to us. So please do join us at one of the shows. You can view our 2023 programme below."
        },
        {
            "text": "RPA 2023 programme. "
        },
        {
            "text": "To stay up to date with the latest information and updates from RPA, sign up to our blog and follow us on social media on the following accounts:  "
        },
        {
            "text": "By following and subscribing to our social channels and blog, you’ll be able to see the latest updates about important information. We also share top tips and announcements. "
        },
        {
            "text": "You can also listen to The RPA Podcast which we have launched to help farmers, landowners and rural communities keep up to date with the latest news from RPA."
        }
    ]
}