{
    "url": "https://nda.blog.gov.uk/lets-make-nuclear-waste-permanently-safe-sooner/",
    "title": "Let’s make nuclear waste permanently safe, sooner",
    "authors": [
        "Corhyn Parr CEO Nuclear Waste Services"
    ],
    "categories": [
        "Waste management"
    ],
    "pub_date": "2023-06-12T15:47:27+01:00",
    "content": [
        {
            "text": "Nuclear Waste Services (NWS) is more than nuclear waste management. It’s about ensuring a safer future for us all by protecting our planet through better human stewardship."
        },
        {
            "text": "I passionately believe in the importance of innovative and strategic nuclear decommissioning and waste management. As a newly integrated single waste management organisation, our role is to make nuclear waste permanently safe, sooner."
        },
        {
            "text": "NWS can leave a mark in history if we get the next seven years right, we have an important role to deliver for the UK waste sector and can make a difference with our strategy."
        },
        {
            "text": "Our work affects everyone – the nuclear sector and its workers, the public, our communities, supply chain partners, transporters and industrial users of radioactive products such as hospitals and research facilities. This is why we’ve launched our first Corporate Strategy, paving the way to a better future."
        },
        {
            "text": "In our strategy we set out our “10 by 2030” milestones, including capping the Low Level Waste Repository, developing new treatment technologies, and decisions on the communities to progress as part of the Geological Disposal Facility programme."
        },
        {
            "text": "  "
        },
        {
            "text": "What does Nuclear Waste Services do?"
        },
        {
            "text": "Nuclear has been a part of everyday life in the UK for over 70 years. It provides around 15% of the"
        },
        {
            "text": "county’s electricity and supports key industries like medicine and defence. The UK government sees new nuclear power as essential to a clean and secure energy mix."
        },
        {
            "text": "Combined with the legacy waste for the past 70 years, it’s even more important for us to safely manage nuclear waste from generation to final resting place."
        },
        {
            "text": "NWS brings together the UK’s leading nuclear waste management capabilities making us a one-stop-shop for all nuclear waste. Our new Corporate Strategy builds on decades of work to make nuclear waste permanently safe."
        },
        {
            "text": "The right waste, in the right package, in the right facility"
        },
        {
            "text": "        "
        },
        {
            "text": "We will set standards and provide specialist advice and services so that the right waste is assigned to the right package and disposed of at the right facility.  And at the same time, we will continue to work to prevent waste, encourage recycling and minimising the amount of waste that needs to be disposed of. We will also approach every decision by assessing risk and prioritising the protection of people and the environment whilst promoting sustainable practices."
        },
        {
            "text": "I’m excited to say our new strategy has the potential to influence national and global standards for nuclear waste management."
        },
        {
            "text": "Thinking differently about decommissioning"
        },
        {
            "text": "We will also work with waste producers to overcome common challenges and capitalise on new opportunities. With the opportunity to think differently about waste, we can innovate in everything we do and develop new approaches to the nuclear decommissioning mission."
        },
        {
            "text": "It’s only by thinking differently and innovating that we can discover new and cost-saving solutions for waste challenges across the nuclear industry. For example, by plugging waste treatment gaps, increasing our service offering to the UK and working in partnership with the UK supply chain we can solve future waste challenges together."
        },
        {
            "text": "Adding value for the UK taxpayer"
        },
        {
            "text": "By working even more closely with the NDA group and the supply chain, we will be able to provide overall value for the UK taxpayer. We will deliver cost effective waste treatment and disposal facilities for the UK's radioactive waste."
        },
        {
            "text": "Investing in skills is also priority for us. We passionately believe in supporting the growth of our people and the UK’s nuclear industry. With our new strategy, we aim to nurture a thriving workforce providing the UK with core waste skills, a talent pipeline for waste professionals, and jobs for the future."
        },
        {
            "text": "With a refreshed focus on efficiency, we can deliver on the promises we made when forming Nuclear Waste Services. Our new strategy will deliver early milestones by 2030 and clearly demonstrate the value of a single waste organisation."
        },
        {
            "text": "A new era"
        },
        {
            "text": "Our new Corporate Strategy will help us to move forward in new, innovative ways with a refreshed focus on value and safety. With a newly integrated approach, we are in an even better position to protect our planet now and ensure a safer future, sooner."
        },
        {
            "text": "Over the next few months we will be unpacking our strategy and delving into the details in a series of blogs, so watch this space!"
        },
        {
            "text": "Read our Corporate Strategy in full"
        }
    ]
}