{
    "url": "https://environmentagency.blog.gov.uk/2023/06/12/pollution-prevention-visit-northamptonshire/",
    "title": "Pollution prevention visit Northamptonshire",
    "authors": [
        "Environment Agency"
    ],
    "categories": [
        "Environment Agency"
    ],
    "pub_date": "2023-06-12T10:34:22+00:00",
    "content": [
        {
            "text": "By Abigail Ovenden"
        },
        {
            "text": "In my role as an Environment Officer in the Lincolnshire land and water team I cover a range of topics from abstraction licenses to inspecting sewage treatment works and attending incidents."
        },
        {
            "text": "Another aspect of my job is undertaking pollution prevention visits, we do this to protect the environment from harm. My team recently carried out a pollution prevention patrol in Wellingborough. We teamed up with our waste colleagues and Anglian Water to target 15 businesses including 5 hazardous waste producers."
        },
        {
            "text": "We arrived in small groups with our inspection tick list. We ascertained the activities taking place on each site, identifying any pollution risks, including potential risks, that fell outside of current legislation. Further information was requested from many businesses, such as drainage plans, maintenance logs, waste transfer notes and consignment notes."
        },
        {
            "text": "The patrol brought to light issues at 5 sites which if undetected could have resulted in water and waste pollution. To avoid this from happening we asked the sites to do a number of things including improve their storage of chemicals and oil and improve site drainage to prevent water pollution. As well as ensuring waste transfer notes were completed and waste wasn’t being burnt without a permit."
        },
        {
            "text": "When an issue is found the Environment Agency gives the company advice and guidance and then follows up to ensure the problems are rectified. Visits are key to identifying actual and/or potential risks and communicating these with business owners. Further, these visits can lead to intelligence of illegal sites and keeps the Environment Agency visible within the public domain. Our next steps are to plan other pollution prevention visits in different areas."
        },
        {
            "text": "If you suspect a business is causing environmental damage please report it to our 24/7 incident hotline number 0800 807060 so we can investigate."
        }
    ]
}