{
    "url": "https://teaching.blog.gov.uk/2023/06/12/preventing-identifying-and-supporting-children-missing-education/",
    "title": "Preventing, identifying and supporting Children Missing Education",
    "authors": [
        "Vanessa Davies",
        "Jillian O'Beirne",
        "Amy Daniels"
    ],
    "categories": [
        "Attendance"
    ],
    "pub_date": "2023-06-12T15:24:47+01:00",
    "content": [
        {
            "text": "Children Missing Education (CME) are children and young people of compulsory school age who are not registered pupils at a school and not receiving suitable education otherwise than at a school.  "
        },
        {
            "text": "Three education and local authority leads share how they work to take preventative action or intervene where necessary to help ensure the most vulnerable children and young people remain in education.  "
        },
        {
            "text": "Vanessa Davies, education welfare service lead at Bristol City Council"
        },
        {
            "text": "In Bristol, we offer our free CME sessions at regular intervals across the academic year to schools and multi-academy trusts (MATs). Raising awareness of how CME can be identified is vital, as most local authorities (LAs) find it challenging to support children and young people at risk if they’re not already aware of them.  Maximising CME awareness and training helps to promote the early identification of potential cases."
        },
        {
            "text": "A clear, locally agreed referral process and a front door that’s always open are key to a successful working relationship with our schools and MATs to identifying and supporting CME. Robust procedures alongside an understanding of roles and expectations between the local authority and schools/MATs are all components of a strong working relationship that can also be set out in a CME process document."
        },
        {
            "text": "Asking the right questions in relation to a case can make a real difference. Whether it’s asking a parent for additional information when carrying out reasonable enquires or a discussion with another professional to clarify next steps, professional curiosity can help move a case forward which will hopefully aid a resolution more quickly."
        },
        {
            "text": "Key points I would encourage schools to consider when working with their LA:"
        },
        {
            "text": "Jillian O’Beirne, assistant team manager and CME lead officer - Attendance Advisory Service at Royal Borough of Greenwich"
        },
        {
            "text": "At the beginning of each school year, the Attendance Service at Royal Borough of Greenwich (RBG) provides a protocol and guidelines to all schools in the RGB area, focussing on expected school-led action to address irregular or non-school attendance and potential CME."
        },
        {
            "text": "We make sure there is ongoing advice and guidance provided to schools on CME and recommend that an attendance officer is in place within every school, alongside offering training for these officers or relevant attendance leads. Schools should also have an in-house protocol to develop a strong whole school approach to attendance."
        },
        {
            "text": "The Department for Education's CME guidance recommends a clear timeline, from day 1 to 20 and beyond, to help identify issues and undertake immediate action. We recommend that any necessary intervention happens as early as possible, as we always want to avoid scenarios where action is only being taken on day 20."
        },
        {
            "text": "We encourage our schools to use all resources to communicate with parents, whether this be via email, letters, home visits or WhatsApp, and we advise that their attendance policy includes what is required from their parents. This can cover issues such as requesting details on travel or new addresses and schools, if a parent is taking their child out of school, transferring them to another school or leaving the area or country."
        },
        {
            "text": "Safeguarding is of paramount importance, and we take a child-focused approach. We work closely with our schools to undertake joint reasonable enquiries as early as necessary if we have concerns about a child or young person. We also encourage staff collaboration between schools, LA and social care to ensure that all agencies are coordinated and can provide the right assistance or support."
        },
        {
            "text": "Amy Daniels, trust safeguarding lead at Cornwall Education Learning Trust (CELT)."
        },
        {
            "text": "Safeguarding is everybody’s responsibility and applies to CME. We aim to be as preventative as possible, building relationships with our pupils’ families and putting the right support in place at the right time."
        },
        {
            "text": "Having a close working relationship with our LA is imperative to success and helps enable a different voice to work with families and listen to any issues they may be facing. We have fortnightly meetings to ensure they know our most vulnerable children and the strategies we are deploying to support the child and family."
        },
        {
            "text": "Where there is a pupil at risk, we hold an attendance panel meeting with a wide range of professionals including LA education welfare, social care, statutory special educational needs team, child and adult mental health services, safeguarding general practitioner and school nurse service. This enables all professionals to share concerns and put a strategy in place to bring about a positive change reducing the likelihood of children becoming CME."
        },
        {
            "text": "Where a child is missing education, we ensure we have followed all the necessary steps in a timely fashion and alert the LA with immediate effect. The LA is typically already aware of these children, through our existing relationship, which enables rapid action to take place to locate and identify the child. Having this regular liaison gives the LA confidence with the systems and processes we have followed, and this has resulted in pupils receiving suitable education and reduced CME."
        },
        {
            "text": "Additional information "
        }
    ]
}