{
    "url": "https://educationinspection.blog.gov.uk/2023/06/12/when-will-my-school-be-inspected/",
    "title": "When will my school be inspected?",
    "authors": [
        "Lee Owston, Deputy Director, Schools and Education"
    ],
    "categories": [
        "exempt schools",
        "inspection",
        "outstanding schools",
        "schools"
    ],
    "pub_date": "2023-06-12T00:01:40+01:00",
    "content": [
        {
            "text": "The period between inspections is normally simple. However, there are currently several complicating factors. This blog will clarify when schools can expect their next inspection."
        },
        {
            "text": "Normally:"
        },
        {
            "text": "However, the picture is currently a bit more complicated, for several reasons, including:"
        },
        {
            "text": "This means that the gaps between inspections may be different for your school."
        },
        {
            "text": "The tables below will give you an indication of when your next inspection is likely to be."
        },
        {
            "text": "Things to note"
        },
        {
            "text": "As has always been the case, the indications we give are only rough guides. We may inspect sooner if we need to (for example if we have concerns about a school). We also do not confirm exactly when a school will be inspected before we notify it officially."
        },
        {
            "text": "Exceptions"
        },
        {
            "text": "The suggested timings under current inspection grades also do not apply to all schools. If your school falls into any of the following categories, please scroll down to find timings specific to you:"
        },
        {
            "text": "All other schools"
        },
        {
            "text": "If you do not fall into any of these categories, then the timing of your next inspection will be dependent on the date and grade you received at the last graded or ungraded inspection. Scroll down or click on a link below:"
        },
        {
            "text": "Schools with a good or outstanding judgement who have had an ungraded inspection that recommended a follow-up graded inspection"
        },
        {
            "text": "If your school’s most recent grade was good or outstanding, but you have since had an ungraded inspection that recommended a follow-up graded inspection, your next inspection will be:"
        },
        {
            "text": "Schools with a good or outstanding judgement"
        },
        {
            "text": "If your school’s most recent grade was good or outstanding, and you either:"
        },
        {
            "text": "Then your next inspection will be:"
        },
        {
            "text": "Schools with a requires improvement judgement"
        },
        {
            "text": "Schools with an inadequate judgement"
        },
        {
            "text": "This does not include schools that receive a new URN because they convert to an academy or move to a trust. We treat these as new schools."
        },
        {
            "text": "Previously exempt schools"
        },
        {
            "text": "If your school was previously exempt from routine inspection, due to an outstanding grade, the timings will be different. Your next inspection will depend on when the inspection was that graded your school outstanding. In some cases, this may be the date its predecessor school was inspected."
        },
        {
            "text": "New schools awaiting their first inspection"
        },
        {
            "text": "If you are a new school, your timings will also be different. This includes schools that have closed and opened with a new unique reference number (URN) but doesn’t include schools that were exempt because of a predecessor’s outstanding grade."
        },
        {
            "text": " Schools that have undergone a significant change"
        },
        {
            "text": "All schools that have recently undergone a significant change (for example, having a new key stage added) may be inspected later than these timescales, to give time for these changes to bed in. However, the above guides may give you an indication."
        }
    ]
}