{
    "url": "https://naturalengland.blog.gov.uk/2024/04/23/a-high-five-for-everyone-driving-nature-recovery-but-we-must-not-rest-on-our-laurels/",
    "title": "A high five for everyone driving Nature recovery – but we must not rest on our laurels",
    "authors": [
        "Tony Juniper"
    ],
    "categories": [
        "Biodiversity",
        "Climate change",
        "Environment Act",
        "Environmental Improvement Plan",
        "Natural England",
        "Nature Recovery Network",
        "Site of Special Scientific Interest",
        "Species recovery",
        "Wildlife"
    ],
    "pub_date": "2024-04-23T10:05:47+01:00",
    "content": [
        {
            "text": "Tony Juniper CBE, Chair of Natural England"
        },
        {
            "text": "Today marks five years since I became Chair of Natural England, which seems to me an appropriate point at which to take stock of the important progress made towards recovering Nature in that time, and to reflect on the challenges that lie ahead."
        },
        {
            "text": "It has been a tumultuous period for the natural world, both in England and beyond, in which the twin emergencies of climate change and wildlife loss have fuelled each other in very stark and dangerous ways. Our land, wetlands and seas could be storing carbon, holding back water and providing homes for a rich web of life. Instead, some of these natural treasures are so degraded that they exacerbate the effects of a warming planet, amplifying flooding, drought and pollution and causing people misery when they could be providing places for them to be happy and healthy."
        },
        {
            "text": "Just how much we rely on Nature in emotional terms – quite aside from the more tangible benefits – was brought home to us during the Covid lockdowns when it provided a lifeline for many of us who needed something reassuring and joyful to cling to."
        },
        {
            "text": "In fact the extent to which we, as individuals and as a society, depend upon Nature has become significantly clearer in the last five years. The Dasgupta Review provided a rigorous official appraisal of Nature as the bedrock of our economy and our way of life. The importance of halting Nature’s depletion is now being acknowledged at government level, not just in the UK but across the world where governments are recognising that it is vital as a means of reducing the impacts of climate change. I have been privileged to help our ministers play an important leadership role at various COPs, most notably when the UK was at the forefront of efforts to secure a deal across nearly 200 countries to protect 30% of land and seas by 2030."
        },
        {
            "text": "Natural England, as the government’s adviser on the natural environment, has been central to the delivery of work to protect and restore Nature here. We have supported the development of transformative policies and investment while using our local statutory advice to protect and enhance Nature at the site and landscape level. I’m proud of the way our staff have risen to that challenge in partnership with the many organisations, businesses and communities who share our aims."
        },
        {
            "text": "During my term Natural England has:"
        },
        {
            "text": "I’m immensely grateful to the many people who have put their weight behind Nature recovery at all levels of government and society. But even with that effort and goodwill we are still a long way off securing that ultimate goal of the 25 Year Environment Plan, of leaving the natural world in a better state than we found it."
        },
        {
            "text": "The targets set out in the Environment Act 2021 and Environmental Improvement Plan are very clear and grow more urgent and challenging with each day that passes. This places an increasing focus on how land is used in this country and the decisions affecting that use."
        },
        {
            "text": "The science tells us that managing the land in the same way as we have done in recent decades won’t enable us to make the changes needed for a Nature Recovery Network to flourish across the country. Alongside the well-established tools we have for supporting Nature, such as SSSIs and NNRs, we now have additional ones such as the Environmental Land Management Scheme, Biodiversity Net Gain, Local Nature Recovery Strategies and Green Infrastructure Standards, all of which can help us bend the curve for Nature upwards."
        },
        {
            "text": "Many of those tools may take a little time to bed in but will really make a difference, especially if they can be applied in as strategically a way as possible. So many demands are placed on our relatively small piece of land that we have to ensure all the available budgets, policies and management approaches are pulling in the same direction, especially in regard to Nature recovery."
        },
        {
            "text": "We know that food security is a vital national priority, especially when climate change, cost of living pressures and war in Ukraine are increasing the strain on the farmers who feed us. Equally, it is increasingly clear that long-term food security is impossible without a healthy, sustainable natural environment to provide the water, soil and pollination services on which agriculture depends."
        },
        {
            "text": "Similarly, it is widely acknowledged that more homes and infrastructure are needed for our growing communities, businesses and energy needs, onshore as well as offshore. Natural England is at the forefront of conversations and strategies that ensure development and Nature are not adversaries – we can build sustainably and we can increase our natural capital at the same time and in the same place, as Biodiversity Net Gain intends. The key is to ensure that development takes place with Nature at the heart of plans from the outset, creating places that are healthy, resilient and sustainable, for both wildlife and people."
        },
        {
            "text": "Natural England is closely involved with partners in these scenarios because we know that the sheer scale of their interests means there is an opportunity to make substantial gains. Recovering Nature would be impossible without farmers, for example, who manage two thirds of the nation’s land, or without local authorities or the protected landscapes which cover almost a quarter of the country."
        },
        {
            "text": "Local Nature Recovery Strategies put power in the hands of communities to tackle environmental pressures and plan for the recovery of Nature in a way that is relevant to their needs, while contributing to the bigger picture of national objectives. A large part of our area teams’ focus this year and beyond will be working with the local authorities involved to ensure they have the support and science they need to make LNRS deliver for their communities and natural environment. Using the green infrastructure standards will help address inequalities and ensure that everyone has access to nature close to home for all the health and wellbeing benefits that brings, particularly in areas of high deprivation."
        },
        {
            "text": "These strategies will help to inform ELM schemes in their area, giving farmers an even stronger link with their surrounding communities and fostering a greater understanding of the services they and their land provides to the public. Natural England advisers will continue to work closely with farmers and land managers to recover Nature at scale and support them in producing food in sustainable ways, as well as looking after the public goods that we all rely on such as clean water and air, healthy soil, habitat for wildlife and places for people to enjoy."
        },
        {
            "text": "Beyond these longstanding relationships, Natural England is forging new ones with businesses who are keen to support Nature and recognise the role it has in underpinning a healthy economy. The Nature Recovery Network Delivery Partnership is a very clear demonstration of this commitment. There are others too in the growing world of green finance, such as Projects for Nature which is linking up donors with ambitious efforts to bring about Nature recovery. Public finance alone won’t be sufficient to recover Nature and we know that it is likely to come under even greater pressure during the coming years, so stimulating green finance markets to lever more private investment into Nature is a growing priority."
        },
        {
            "text": "A lot has happened in five years, and quite a bit more needs to happen in the next five if our national environmental targets are to be met. Natural England looks forward to rising to this challenge, working with our many partners across society to make sure that this is the decade when we put Nature firmly on the path to recovery."
        }
    ]
}