{
    "url": "https://hmlandregistry.blog.gov.uk/2024/04/23/accounting-for-discounts-and-incentives-in-developer-applications/",
    "title": "Accounting for discounts and incentives in developer applications",
    "authors": [
        "Clare Dollaghan, Registration Services"
    ],
    "categories": [
        "Law and practice"
    ],
    "pub_date": "2024-04-23T11:05:33+01:00",
    "content": [
        {
            "text": "We receive a lot of applications that refer to discounts and incentives, but there can be confusion over which is which. This is important because it affects the entry we will make in the Land Register and our house price data, so if an application is incorrect or unclear, we will have to raise a requisition to request more information. "
        },
        {
            "text": "Last year (1 April 2023 to 31 March 2024), we sent 2,035 requisitions over discounts and incentives, 806 of these in the first three months of 2024 alone, so I’d like to help you avoid such delays by explaining exactly what we are looking for. If, at the end of this explanation, you’d like more information, you can find it in our practice guide 7: entry of price paid or value stated data in the register.  "
        },
        {
            "heading": 2,
            "text": "What is a discount?"
        },
        {
            "text": "HM Land Registry considers a discount to be a cash sum deducted from the purchase price. "
        },
        {
            "text": "A discount may also be referred to as: "
        },
        {
            "text": "In most cases, if the money paid by the buyer to the seller is less than the purchase price of the property, we regard the difference between these two sums as a discount. "
        },
        {
            "text": "It is our practice to deduct the discount from the purchase price as this represents a true reflection of the price paid for the property and enter the net (lower) sum. "
        },
        {
            "heading": 2,
            "text": "What is an incentive?"
        },
        {
            "text": "HM Land Registry considers an incentive to be something the seller offers, which does not relate to the purchase price, for example: "
        },
        {
            "text": "We also consider assistance under a Homebuy/Help to Buy scheme (that is, money loaned to a purchaser through the schemes) to be an incentive and not a discount as this must be repaid at some point in the future. "
        },
        {
            "text": "It is our practice here to enter the gross price and take no action in respect of the incentives. "
        },
        {
            "heading": 2,
            "text": "Main issues"
        },
        {
            "text": "The Council of Mortgage Lenders requires conveyancers to tell lenders when a discount or incentive is given as part of a property’s purchase price. This helps lenders decide whether or not to make an advance and, if so, the amount of money to lend. "
        },
        {
            "text": "The problem is that ‘incentive’ can mean something different depending on who is using the term. While a buyer may perceive an incentive as a form of discount on the property, HM Land Registry does not, and we register the price paid accordingly. For us, a discount is deducted from the price paid, but we take no action in respect of any incentives."
        },
        {
            "heading": 2,
            "text": "What you need to do"
        },
        {
            "text": "In the TP1 form, enter the correct price paid, net of any discount (that is, the actual sum the buyer has paid to the seller) in the consideration panel. You can make a reference to a discount or incentive in the additional provisions panel (panel 11) of a transfer. "
        },
        {
            "heading": 2,
            "text": "What this means in practice"
        },
        {
            "text": "Let’s look at some examples."
        },
        {
            "text": "1. A correctly worded consideration panel "
        },
        {
            "text": "In this case, you have told us that £329,995 is the gross price and we will deduct the discount of £15,000. We will enter £314,995 as the price paid in the register. "
        },
        {
            "text": "2. When there is additional wording in the body of the transfer "
        },
        {
            "text": "Then later in the deed: "
        },
        {
            "text": "In this case you have told us that £355,000 is the gross price and we will deduct the discount of £17,750. We will enter the net price of £337,250 as the price paid in the register. We will take no further action in respect of the kitchen and flooring upgrades, which we consider to be incentives. "
        },
        {
            "text": "3. Ambiguous wording, which would require a requisition to determine the price paid"
        },
        {
            "text": " "
        },
        {
            "text": "No contract for sale was lodged so we requisitioned for a copy. Here is what we received:"
        },
        {
            "text": "In this case you have told us that £249,995 is the gross price and we will deduct the discount of £3,000. We will enter the net price of £246,995 as the price paid in the register. "
        },
        {
            "text": "No action taken in respect of the upgrades to the kitchen, and so on. "
        },
        {
            "text": "4. Finally, another example using different wording"
        },
        {
            "text": "Then, in the body of the transfer: "
        },
        {
            "text": " "
        },
        {
            "text": "In this case you have told us that £437,500 is the gross price and we will deduct the discount of £21,875. We will enter the net price of £415,625 as the price paid in the register. We will take no action in respect of the flooring upgrades, which we consider to be incentives.  "
        },
        {
            "text": "On completion we received correspondence from the acting conveyancers suggesting that the price paid was incorrect. We sent a requisition for clarification and we got this letter back from the conveyancer: "
        },
        {
            "text": " "
        },
        {
            "text": "The contract for sale showed: "
        },
        {
            "text": " "
        },
        {
            "text": "This highlights the confusion between a discount and an incentive. Practice guide 7 sets out what we class as a discount and we will apply this to all applications. "
        },
        {
            "text": "Being clear on the distinction between a discount and an incentive leads to less correspondence between HM Land Registry and conveyancers, protects the integrity of our register and ensures the accuracy of published price paid data."
        }
    ]
}