{
    "url": "https://stratcommand.blog.gov.uk/2024/04/23/afps-visit-to-gib/",
    "title": "Armed Forces Parliamentarians arrive in Gibraltar",
    "authors": [
        "abievans"
    ],
    "categories": [
        "Gibraltar",
        "International",
        "Overseas Bases"
    ],
    "pub_date": "2024-04-23T14:47:36+01:00",
    "content": [
        {
            "text": "Three Members of Parliament and four members of the House of Lords recently visited Gibraltar as part of the annual Armed Forces Parliamentary Scheme."
        },
        {
            "text": "The scheme, which started in 1989, offers Members of Parliament and the House of Lords the opportunity to gain a first-hand insight into military life for all three Armed Services - Royal Navy, Army and Royal Air Force - enabling them to make informed contributions to defence debates in the Houses of Parliament."
        },
        {
            "text": "The overseas territory visit was a great way to inform the parliamentarians of the purpose of British Forces in Gibraltar (BF Gib) and its role in Defence outputs, as well as how global events have affected Gibraltar."
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": "The strong links between BF Gib, the Foreign, Commonwealth and Development Office and His Majesty's Government of Gibraltar were also emphasised during the trip."
        },
        {
            "text": "During their time in Gibraltar, the parliamentarians conducted office calls with the Governor of Gibraltar, Vice Admiral Sir David Steel KBE, DL, the Chief Minister of Gibraltar, the Hon Fabian Picardo KC, and Commander British Forces, Commodore Tom Guy, before accompanying Royal Navy"
        },
        {
            "text": " "
        },
        {
            "text": "Gibraltar Squadron on the water, engaging with the Gibraltar Defence Police, being guided through the tunnels by the Royal Gibraltar Regiment, and paying a flying visit to RAF Gibraltar."
        }
    ]
}