{
    "url": "https://dataingovernment.blog.gov.uk/2025/02/17/data-ethics-and-society-join-the-conversation-in-2025/",
    "title": "Data, Ethics, and Society: Join the Conversation in 2025",
    "authors": [
        "Michael Hodge – MLOps Strategy Lead, Ministry of Justice",
        "Harriet Sands – AI Technical Specialist, NHS England"
    ],
    "categories": [
        "Data Ethics"
    ],
    "pub_date": "2025-02-17T10:40:04+00:00",
    "content": [
        {
            "text": "The Data Ethics and Society Reading Group has been sparkingconversations about the ethical and societal implications of data,technology, and artificial intelligence (AI) since 2020. Open tocolleagues across the UK public sector, the group provides acollaborative space to explore critical literature, debate emergingissues, and connect with others.As we approach our fifth year, it’s clear that what was asomewhat niche interest is now a mainstream topic. From AI chatbots in the workplace to concerns about algorithmic bias indecision making, discussions once reserved for specialists arenow aired in public. Those of us responsible for delivering publicservices are under increasing pressure to figure out how data-drive tools, including AI, can deliver impact for the public, safelyand responsibly.This reading group offers a chance to step back from day-to-daywork and engage more deeply with the ethical challenges ofdata-driven technologies (including AI), supported by thought-provoking books and the perspectives of colleagues across thepublic sector.So, what’s changing in 2025? And how can you get involved?"
        },
        {
            "text": "What Is the Data Ethics and Society Reading Group?The reading group started with a simple idea: to create a spacewhere people across government could come together to criticallyengage with data ethics. Over the years, we’ve explored booksand articles that challenge assumptions, provide historical contextto emerging tools and systems, and offer fresh perspectives onthe impact of data and AI.Each session is a facilitated discussion where we split intogroups. Attendees can share insights, ask questions, and thinkabout how the material connects to their work. Importantly, it’s notabout arriving at a single “right” answer—it’s about building ahabit of critical thinking and reflection in a supportiveenvironment."
        },
        {
            "text": "Why Are We Making Changes?To ensure the reading group remains relevant and accessible, werecently sought feedback from some of our newslettersubscribers. The responses highlighted what participants valuemost:● A shared motivation to engage with ethical issues thatmight otherwise get lost in busy work schedules.● A safe, informal space to explore ideas and connect withlike-minded colleagues.● Content directly relevant to their professional roles andthe wider challenges facing society.But participants also pointed to challenges:"
        },
        {
            "text": "● Time constraints, both in reading the material andattending sessions.● Cost barriers, as many books can be expensive.● A desire for deeper discussions, as one session perbook often feels too short to cover everything."
        },
        {
            "text": "What’s New for 2025?With this feedback in mind, we’re introducing the followingchanges:"
        },
        {
            "text": "Why Join the Reading Group?The ethical challenges of data and AI are growing more complexevery day. By joining the reading group, you’ll have the chanceto:● Stay informed about critical issues shaping the future oftechnology.● Engage with diverse perspectives from across the publicsector."
        },
        {
            "text": "● Build connections with colleagues who share your interestin data ethics.You don’t need to be a subject matter expert to join—just an openmind and a willingness to learn."
        },
        {
            "text": "2024 WrappedThis year, we’ve read:● Technology Is Not Neutral by Stephanie Hare● Dark Data by David Hand● Code Dependent by Madhumita Murgia● The Alignment Problem by Brian ChristianWe welcome suggestions!"
        },
        {
            "text": "Get InvolvedWant to stay updated or join the conversation? Sign up to ourmailing list to hear about upcoming sessions, book votes, andnew initiatives.We’re looking forward to another year of thought-provokingdiscussions, and we hope you’ll join us."
        }
    ]
}