{
    "url": "https://mhclgdigital.blog.gov.uk/2025/02/17/democracy-matters-join-our-elections-digital-team-and-build-great-services/",
    "title": "Democracy matters: join our Elections Digital Team and build great services",
    "authors": [
        "Liz Owen, Deputy Director, Elections Digital Team"
    ],
    "categories": [
        "Careers",
        "Elections"
    ],
    "pub_date": "2025-02-17T10:25:57+00:00",
    "content": [
        {
            "text": "Hi, I’m Liz Owen, Deputy Director of the Elections Digital Team at the Ministry of Housing, Communities and Local Government (MHCLG).  "
        },
        {
            "text": "This is a really exciting time for our team. We are improving and developing our existing portfolio of services and products, which were used by more than 5 million people during last year’s general election. We’re also working on delivery of the new government’s manifesto commitments, particularly on extending the vote to 16 and 17-year-olds, and increasing the number of people who are correctly registered to vote. We are passionate about designing and delivering excellent digital services which support citizens to exercise their right to vote.  "
        },
        {
            "text": "In this post, I’ll share more about what our team does, how we work and the opportunities on offer. "
        },
        {
            "heading": 2,
            "text": "What is the Elections Digital Team?  "
        },
        {
            "text": "Millions of people use our Elections products and services each year and they are critical to the successful running of elections in the UK. We have a portfolio of 8 products and services, including the flagship Register to vote service. Over the last 3 years, we’ve rapidly expanded our portfolio, and electors can now apply online for postal votes, proxy votes and photo identification to use in polling stations. "
        },
        {
            "text": "Alongside our portfolio, our team has also grown over the last few years. We’re looking to expand further to enable us to do more in house to improve our existing services for users and develop services to support the government’s new priorities for elections. We want to ensure our services are simpler, clearer and faster for everyone, whilst building on the excellent standards we’ve already achieved. If you are thinking of joining us, there’s never been a more exciting time for Elections Digital services.  "
        },
        {
            "heading": 2,
            "text": "Join the team "
        },
        {
            "text": "We’re looking for a range of digital professionals to join us in providing excellent digital services. We have new roles available in our growing digital team, developing our delivery, product and user-centred design capability, including:"
        },
        {
            "text": "Visit our job portal for details about each of the vacancies and keep an eye out for additional roles opening in the coming weeks."
        },
        {
            "heading": 2,
            "text": "How we work   "
        },
        {
            "text": "We are a team of enthusiastic and highly skilled digital specialists, geographically dispersed across the UK. Our multidisciplinary in-house digital team is the driving force behind the development and delivery of excellent elections services for users, as well as the day-to-day operational running of those services. We currently work collaboratively with external partners on the technical build aspects of our services, and will be looking to build our in-house development capability in the coming years.  "
        },
        {
            "text": "We are part of the Elections Directorate, which has overall responsibility for all things related to elections in central government. Within the directorate, we have sister divisions responsible for policy, strategy and project management, and work closely with these colleagues. One of the things I love about my role is the fact that we’re part of a single team with policy and programme colleagues, and have the opportunity to directly influence thinking on policy and legislation based on our users’ needs. "
        },
        {
            "text": "Hybrid working gives us the flexibility to meet in the office or collaborate online wherever we are in the country. Many of us have flexible working patterns to achieve a healthy work/life balance and accommodate commitments outside of work.  "
        },
        {
            "text": "We value each opinion and understand that we need a diverse range of skills and viewpoints to ensure that we represent the communities we serve. It's really important to me that this is a team where everyone feels that their ideas and constructive challenge are valued and welcomed. Good ideas can come from anywhere and are more likely to come from those closest to the problems and to our users. Our teams have a high degree of trust to deliver what’s needed, and we ensure that we offer individuals a challenge and the opportunity to develop themselves and their skills. "
        },
        {
            "text": "We are flexible in delivery approaches, using Agile methodology for digital delivery and waterfall project management for the wider programme activities.    "
        },
        {
            "heading": 2,
            "text": "Why this work matters   "
        },
        {
            "text": "Elections is a fantastic area to work in – our work matters because democracy matters. Whilst our services are in the spotlight at general elections, they are used 365 days a year – 3,151 people registered to vote last Christmas Day! We need to make sure that our current and future services are trusted, secure and meet the need of all our users both in and outside the UK. "
        }
    ]
}