{
    "url": "https://food.blog.gov.uk/2025/02/17/exploring-new-methods-to-protect-honey-authenticity-in-the-uk/",
    "title": "Exploring new methods to protect honey authenticity in the UK",
    "authors": [
        "Rick Mumford, Deputy Director, Science Evidence and Research, Deputy CSA"
    ],
    "categories": [
        "Science"
    ],
    "pub_date": "2025-02-17T09:22:41+00:00",
    "content": [
        {
            "text": "Cymraeg"
        },
        {
            "text": "New techniques and tools are being developed to protect consumers and help businesses, government and local enforcement agencies tackle honey fraud now and in the future."
        },
        {
            "text": "Honey is a naturally complex mixture of different sugars produced entirely by bees, with nothing added or taken away. Consumers want to know honey is what it says it is, and businesses and local beekeepers want to feel confident that fraudsters will not get an unfair advantage."
        },
        {
            "text": "The UK has high standards for the composition and labelling of honey products on sale here and there are strict laws about the definition and labelling of honey."
        },
        {
            "heading": 2,
            "text": "Why might honey be targeted by fraudsters?"
        },
        {
            "text": "The FSA’s recent Food Crime Strategic Assessment highlighted any product that has a high price by weight can be vulnerable to fraud and honey is no exception. Food fraudsters could seek to adulterate honey by adding cheaper sugar syrups or misdescribing its origin or floral type for financial gain."
        },
        {
            "heading": 2,
            "text": "Is there a test for honey to check it is genuine?"
        },
        {
            "text": "No single test can definitively confirm honey’s authenticity. Honey is a natural product with a complex and variable natural composition which can differ based on its floral or geographic origin, so checking if honey is authentic or adulterated with sugar syrups can be tricky."
        },
        {
            "text": "Current testing for honey authenticity includes the use of non-targeted methods. These methods can be considered as screening methods as they offer fast efficient way to identify potential adulteration. However, interpretation of honey results from these methods can be challenging due to the comparison of complex mixtures against a reference sample database. Extensive testing is required to build comprehensive reference databases which is costly and limits the effectiveness of non-targeted methods for honey."
        },
        {
            "heading": 2,
            "text": "How can we improve testing to ensure honey authenticity?"
        },
        {
            "text": "Working together Defra, FSA and the Government Chemist have created practical approaches to improve honey authenticity testing:"
        },
        {
            "heading": 2,
            "text": "Are new and improved tests in development?"
        },
        {
            "text": "The FSA with Cranfield University have conducted research into two alternative methods to detect authenticity in honey."
        },
        {
            "text": "The first method uses Spatial Off-set Raman Spectroscopy (SORS) which is a screening technique using the scattering of laser light to detect adulteration at a molecular level in honey. This test could be used in the field such as in factories or border inspection facilities making it easier, quicker and more affordable compared to current methods."
        },
        {
            "text": "The second is a DNA technique used in the laboratory to detect the addition of the sugar syrups through their DNA profiles. The proposed DNA method tested initially only on UK single origin honeys has potential to be used alongside traditional honey analysis, modern analytical methodologies, and rapid spectroscopic screening tests as a highly sensitive method to identify the species origin of certain plant-based syrups and help confirm if the honey is fraudulently adulterated."
        },
        {
            "heading": 2,
            "text": "When will these new tests be available to use?"
        },
        {
            "text": "The tests trialled at Cranfield were a proof-of-concept feasibility study on UK origin honeys and are not yet fully developed or validated. More development work is required before the methods can be used to provide reliable authenticity tests for both UK produced and imported honeys and honey blends which constitute the majority of honeys on the UK market."
        },
        {
            "heading": 2,
            "text": "What does this mean?"
        },
        {
            "text": " Although there’s still no single test that can determine honey authenticity, this Cranfield study together with the expert views on methods from Defra’s technical group demonstrates potential analytical progress which could complement the work we are doing across government and with partners to build a range of tools and innovations to aid industry and regulators to determine authenticity."
        },
        {
            "text": "These new techniques, in combination with current approaches developed by the Government could be used in the future with local authority partners to tackle honey fraud and ensure the authenticity of honey as it moves through supply chains."
        },
        {
            "heading": 1,
            "text": "Archwilio dulliau newydd o ddiogelu dilysrwydd mêl yn y DU"
        },
        {
            "text": "Mae technegau ac offer newydd yn cael eu datblygu i ddiogelu defnyddwyr a helpu busnesau, y llywodraeth ac asiantaethau gorfodi lleol i fynd i’r afael â thwyll ym maes mêl nawr ac yn y dyfodol."
        },
        {
            "text": "Mae mêl yn gymysgedd naturiol gymhleth o wahanol siwgrau sy’n cael eu cynhyrchu’n gyfan gwbl gan wenyn, heb ddim byd wedi’i ychwanegu ato na’i dynnu oddi wrtho. Mae defnyddwyr eisiau gwybod bod y mêl y maent yn ei fwyta’n cyd-fynd â’r hyn sydd ar y label, ac mae busnesau a gwenynwyr lleol eisiau bod yn hyderus na fydd twyllwyr yn cael mantais annheg."
        },
        {
            "text": "Mae gan y DU safonau uchel ar gyfer cyfansoddiad a labelu cynhyrchion mêl sydd ar werth yn y DU, a cheir hefyd ddeddfau llym ynghylch diffinio a labelu mêl."
        },
        {
            "heading": 2,
            "text": "Pam y gallai twyllwyr dargedu mêl?"
        },
        {
            "text": "Dangosodd Asesiad Strategol o Droseddau Bwyd diweddar yr ASB fod unrhyw gynnyrch sydd â phris uchel yn ôl yn gallu bod yn darged atyniadol i dwyllwyr, ac nid yw mêl yn eithriad. Gall twyllwyr bwyd geisio difwyno mêl drwy ychwanegu suropau siwgr rhatach neu gamddisgrifio ei darddiad neu’r math o flodyn er budd ariannol."
        },
        {
            "heading": 2,
            "text": "A oes prawf ar gyfer mêl i wirio ei fod yn ddilys?"
        },
        {
            "text": "Ni all unrhyw brawf unigol gadarnhau’n bendant fod mêl yn ddilys. Mae mêl yn gynnyrch naturiol sydd â chyfansoddiad cymhleth ac amrywiol a all amrywio gan ddibynnu ar ei darddiad blodeuol neu ddaearyddol. O’r herwydd, gall fod yn anodd cadarnhau a yw mêl yn ddilys neu wedi’i ddifwyno â suropau siwgr."
        },
        {
            "text": "Mae’r profion cyfredol ar gyfer dilysrwydd mêl yn cynnwys defnyddio dulliau heb eu targedu. Gellir ystyried y dulliau hyn fel dulliau sgrinio, gan eu bod yn cynnig ffordd gyflym ac effeithlon o nodi achosion posib o ddifwyno. Fodd bynnag, gall dehongli canlyniadau’r dulliau profi mêl hyn fod yn heriol, am fod yn rhaid cymharu cymysgeddau cymhleth yn erbyn cronfa ddata o samplau cyfeirio. Mae angen cynnal profion helaeth i adeiladu cronfeydd data cyfeirio cynhwysfawr, sy’n gostus ac yn cyfyngu ar effeithiolrwydd dulliau heb eu targedu ar gyfer mêl."
        },
        {
            "heading": 2,
            "text": "Sut allwn ni wella profion i sicrhau dilysrwydd mêl?"
        },
        {
            "text": "Mae Defra, yr ASB a Chemegydd y Llywodraeth, gyda’i gilydd, wedi creu dulliau ymarferol o wella profion dilysrwydd mêl:"
        },
        {
            "heading": 2,
            "text": "A oes profion newydd a gwell yn cael eu datblygu?"
        },
        {
            "text": "Mae’r ASB a Phrifysgol Cranfield wedi ymchwilio i ddau ddull amgen o gadarnhau dilysrwydd mêl."
        },
        {
            "text": "Mae’r dull cyntaf yn defnyddio Sbectrosgopeg Raman Off-set Ofodol (SORS), sef techneg sgrinio sy’n gwasgaru golau laser i ganfod achosion o ddifwyno ar lefel foleciwlaidd mewn mêl. Gellid defnyddio’r prawf hwn yn y maes, er enghraifft mewn ffatrïoedd neu gyfleusterau archwilio ffiniau, gan ei gynnig profion haws, cyflymach a mwy fforddiadwy o gymharu â’r dulliau presennol."
        },
        {
            "text": "Mae’r ail ddull yn dechneg DNA a ddefnyddir yn y labordy i ganfod suropau siwgr a ychwanegwyd trwy edrych ar eu proffiliau DNA. Mae potensial i’r dull DNA arfaethedig, a brofwyd ar fêl ag un tarddiad yn unig yn y DU yn y lle cyntaf, gael ei ddefnyddio ochr yn ochr â dadansoddiadau mêl traddodiadol, methodolegau dadansoddol modern, a phrofion sgrinio sbectrosgopig cyflym fel dull hynod sensitif i nodi tarddiad rhywogaethol suropau penodol sy’n seiliedig ar blanhigion, a helpu i gadarnhau a yw’r mêl wedi’i ddifwyno’n dwyllodrus."
        },
        {
            "heading": 2,
            "text": "Pryd fydd y profion newydd hyn ar gael i’w defnyddio?"
        },
        {
            "text": "Roedd y profion a dreialwyd yn Cranfield yn rhan o astudiaeth ddichonoldeb prawf-cysyniad ar fêl y DU, ac nid ydynt wedi’u datblygu na’u dilysu’n llawn eto.  Mae angen mwy o waith datblygu cyn y gellir defnyddio’r dulliau i ddarparu profion dilysrwydd dibynadwy ar gyfer mêl a chymysgeddau mêl a gynhyrchir yn y DU a mêl sydd wedi’i fewnforio, sef y rhan fwyaf o’r mêl ar farchnad y DU. "
        },
        {
            "heading": 2,
            "text": "Beth mae hyn yn ei olygu?"
        },
        {
            "text": "Er nad oes un prawf o hyd a all bennu dilysrwydd mêl, mae astudiaeth Cranfield, ynghyd â safbwynt arbenigol grŵp technegol Defra ar ddulliau, yn dangos cynnydd dadansoddol posibl a allai ategu’r gwaith yr ydym yn ei wneud ar draws y llywodraeth a chyda phartneriaid i adeiladu ystod o adnoddau a datblygiadau arloesol i gynorthwyo diwydiant a rheoleiddwyr i bennu dilysrwydd."
        },
        {
            "text": "Yn y dyfodol, gellid defnyddio’r technegau newydd hyn, ar y cyd â’r dulliau presennol a ddatblygwyd gan y llywodraeth, gyda phartneriaid awdurdodau lleol er mwyn mynd i’r afael â thwyll ym maes mêl, a sicrhau dilysrwydd mêl wrth iddo symud drwy gadwyni cyflenwi."
        }
    ]
}