{
    "url": "https://environmentagency.blog.gov.uk/2025/02/17/fast-tracking-housebuilding-through-the-new-towns-taskforce-and-new-homes-accelerator/",
    "title": "Fast-tracking housebuilding through the New Towns Taskforce and New Homes Accelerator  ",
    "authors": [
        "defrablogs"
    ],
    "categories": [
        "Climate change",
        "Environment Agency",
        "Flood",
        "Flood Planning",
        "Planning",
        "Sustainability"
    ],
    "pub_date": "2025-02-17T15:23:31+00:00",
    "content": [
        {
            "text": "We recognise the vital importance of the Government’s ambitious target for building 1,500,000 new homes in the next four years. We support this by inputting into more than 10,000 proposed developments each year, ensuring new homes are built with adequate flood risk protection, supply of drinking water and sewerage services and also, by remediating and bringing back into use previously developed land.   "
        },
        {
            "text": "This is certainly a challenge, but we are leading the way in driving the solutions, so people have safe and healthy places to live in, supported by the right environmental infrastructure for today and into the future.  "
        },
        {
            "text": "Our expertise is invaluable in finding the opportunities to achieve sustainable growth while minimising the impact on the environment and maximising opportunities for nature recovery. "
        },
        {
            "text": "We are already helping the Government identify optimal growth and housing sites. This includes supporting the Ministry of Housing, Communities and Local Government with their work on New Towns; the Housing Accelerator Programme and developments in the Oxford to Cambridge Arc. In all three projects we strongly advocate early identification of solutions, particularly to provide drinking water and sewerage for new homes in catchments under particular pressure and steering proposals to areas with fewer flood risks. Our new National Assessment of Flood Risk and National Assessment of Flood Risk Map will further assist planners, developers and decision makers access the information they need to inform their choices about flooding from rivers, sea and surface water. Last week,  we welcomed the Prime Minister’s announcement of new funding under the New Homes Accelerator scheme. This will enable the Environment Agency to invest in its capacity, engage early in the process and further improve the efficiency of our planning application approvals.  "
        },
        {
            "text": "The acceleration of the building of 10,000 homes under this scheme since last October is a marker of the positive results collaboration between the Government and organisations with a stake in the planning system can have.  "
        },
        {
            "text": "Alongside this, the New Towns Taskforce is an exciting opportunity for the Environment Agency to help advise on significantly sized new settlements of 10,000 homes and upwards, putting the environment at the heart of resilient, thriving communities.  "
        },
        {
            "text": "Our early engagement can help provide certainty and grow investment confidence that reduces costs while maintaining high standards of environmental protection. It also enables us to flag strategic opportunities at a critical stage in the plan-making process helping Government steer investments to places where there is clear environmental capacity, such as sufficient water availability.  "
        },
        {
            "text": "We want people to live in safe, healthy and well-designed homes and neighbourhoods. We are contributing to this by:  "
        },
        {
            "text": "Our collaboration and early engagement with government and developers enables us to secure great benefits for a development’s environment, and beyond. We are excited to grow and develop this approach going forward. "
        }
    ]
}