{
    "url": "https://naturalengland.blog.gov.uk/2025/02/17/harnessing-nature-based-solutions-to-help-combat-flooding/",
    "title": "Harnessing Nature-based Solutions to help combat flooding",
    "authors": [
        "Natural England"
    ],
    "categories": [
        "Flood Management",
        "Natural England",
        "Nature",
        "Nature Recovery",
        "Nature-based solutions"
    ],
    "pub_date": "2025-02-17T13:29:51+00:00",
    "content": [
        {
            "text": "As climate change brings more frequent and severe flooding, innovative solutions are emerging to tackle these challenges. Working with nature, not against it, Natural England is proposing schemes to help tackle flooding in Norfolk and Suffolk.  "
        },
        {
            "text": "Projects in our region — one on the River Wissey in Norfolk and another along Suffolk’s Deben Estuary — are showing how nature-based solutions can help reduce flood risks while revitalising landscapes and supporting wildlife. "
        },
        {
            "text": "In Norfolk, Natural England is using technology to help restore and manage water along the River Wissey. Natural England's Catchment Sensitive Farming colleagues and in-house drone team have captured stunning aerial footage of the river and its surroundings to kickstart discussions around future restoration proposals and natural flood management solutions.  "
        },
        {
            "text": "This technology has allowed experts to map a 6.6km stretch in detail, offering a unique view to inform which areas of arable land on either side of the river are less productive and better suited to manage flooding. This technique helps to prevent larger, catastrophic flood events from occurring by giving the river more room to expand in desired locations, rather than it bursting its banks uncontrollably. "
        },
        {
            "text": "Natural Flood Management, (NFM), is an approach that works with nature, not against it. Instead of relying on traditional flood defences like walls and dams, NFM focuses on natural techniques like tree planting, wetland creation, and river re-meandering to slow water flow.  "
        },
        {
            "text": "This, in turn, creates and interconnects habitats for wildlife and improves soil structure and quality by reducing uncontrolled flooding, run-off and loss of topsoil. This approach can turn less-productive farmland into vibrant wetlands that not only absorb excess water and carbon but also support biodiversity. "
        },
        {
            "text": "The drone footage will be shared with local landowners, conservationists, and stakeholders, igniting discussions about how to restore both the river and surrounding farmland. By working together, these groups have the opportunity to transform the landscape by making it more resilient to flooding whilst creating wetlands to boost biodiversity. In a region like East Anglia, where flooding is a growing concern, this project could become a model for future efforts across the country. "
        },
        {
            "text": "Meanwhile, on the Deben Estuary in Suffolk, a farmer, Patrick, is leading the way with his own nature-based solutions. Patrick’s farm borders a saltmarsh designated as a Site of Special Scientific Interest (SSSI), and a ditch separates his fields from the tidal waters. "
        },
        {
            "text": "As sea levels rise, Patrick noticed the ditch filling with sediment, prompting him to seek advice from farm advisers at Natural England. What started as a routine conversation about maintenance quickly evolved into an innovative new plan: managed realignment and intertidal creation.  "
        },
        {
            "text": "Rather than battling the encroaching tides, Patrick chose to work with nature, allowing estuary waters to flow onto his land to create new intertidal habitats. These habitats are vital for the local wildlife that Patrick loves and act as natural flood buffers. "
        },
        {
            "text": "With the support of a stewardship agreement, Patrick is now creating these habitats, turning a challenge into an opportunity. His decision marks a significant shift in how coastal landowners can adapt to rising sea levels. By letting nature take the lead, Patrick is not only protecting his farm for the future from uncontrolled, unwanted flooding, but also enhancing habitats and the local environment. "
        },
        {
            "text": "Together, these projects on the River Wissey and Deben Estuary are showcasing the power of nature-based solutions. By collaborating with nature, they offer a sustainable way to manage flooding, support biodiversity, and create resilient, thriving landscapes for the future. "
        }
    ]
}