{
    "url": "https://moderncivilservice.blog.gov.uk/2025/02/17/one-big-thing-2024-collaborative-innovation-across-government/",
    "title": "One Big Thing 2024: Collaborative innovation across government",
    "authors": [
        "Government Reform"
    ],
    "categories": [
        "A Modern Civil Service",
        "Ambitious",
        "Capability",
        "Government Reform",
        "Innovation",
        "One Big Thing",
        "Policy",
        "Proud Civil Servant",
        "Skilled"
    ],
    "pub_date": "2025-02-17T13:31:23+00:00",
    "content": [
        {
            "text": "One Big Thing 2024 was all about innovation - One Big Thing starts with one small change. Last year, civil servants across government began to implement small yet practical changes into their departments. Many of these new initiatives encouraged colleagues to come together to discuss problems, design solutions and drive transformation."
        },
        {
            "heading": 2,
            "text": "Manchester hackathon event"
        },
        {
            "text": "In the new year, the Cabinet Office and Ofsted collaborated to deliver a hackathon in Manchester. The event involved civil servants from over 10 departments coming together to find innovative solutions to challenges, including how the Civil Service should handle the rise of AI-generated job applications, and how departments can work better together across boundaries. "
        },
        {
            "text": "The day was expertly facilitated by Ofsted colleagues Sara Kewell, Academy Project Delivery Manager, Mandy Nightingale, HMI Specialist Adviser, Social Care Regulation and Practice for Learning & Development and Kirsty Mulvaney, Assistant Regional Director, East of England."
        },
        {
            "text": "The event concluded with teams presenting their elevator pitch to the room and a panel of leaders from Ofsted, the Valuation Office Agency and the Cabinet Office. The panel praised the ideas for their creativity and potential. Teams demonstrated how different perspectives and focused ideation can help solve tough problems in a very short period.  "
        },
        {
            "text": "Attendees also heard from a range of speakers during the day including Zoe Langmead-Jones from Transport for Greater Manchester who spoke about the Bee Network, a great example of public policy innovation. The Bee Network is pioneering the re-regulation of bus services in Greater Manchester, with many other areas expected to follow suit."
        },
        {
            "text": "Grant Mesie, representing the North West Head of Place team, spoke about how Civil Service and partners across the region are collaborating to achieve aims. Eela Muhaimin, Head of One Big Thing, Cabinet Office shared insights on One Big Thing 2024. Many attendees came equipped with tools and techniques from the Innovation Masterclass, which guided over 140,000 civil servants through a step-by-step innovation process. "
        },
        {
            "text": "Attendees said that the event ‘highlighted the potential for collaborative and innovative approaches to shape the future of the Civil Service' and was ‘myth-busting proof that we should challenge previously held assumptions of who, why, and how we look to solve problems or issues going forward'."
        },
        {
            "heading": 2,
            "text": "Problem-solving in London"
        },
        {
            "text": "On Thursday 13 February 2025, teams came together to apply the principles of One Big Thing to challenges they faced at work. They came prepared with a diverse range of problem statements and worked together to develop ideas for small, quick experiments to go back to their departments to pilot."
        },
        {
            "text": "It was great to see teams from Border Force, Ministry of Justice, Department for Science, Innovation and Technology, Department for Education, Home Office, Cabinet Office, the Planning Inspectorate and others all come together to collaborate on shared challenges and leave emboldened to try something new to improve their services and capitalise on the opportunities presented by AI."
        },
        {
            "text": "Attendees were able to leverage the expertise of colleagues in the Open Innovation Team and Accelerated Capability Environment (ACE), who acted as expert facilitators on the day. Speakers included Richard Browning, CEO and Chief Test Pilot, Gravity, Dr Mark Kennedy, Associate Professor at Imperial College and Sean O’Grady Lead Learning Designer at Imperial Business School."
        },
        {
            "heading": 2,
            "text": "Senior civil servant innovation session"
        },
        {
            "text": "In January 2025, civil servants from across the North West came together in an event, organised by the North West Head of Place team, in partnership with the Manchester Combined Authority. "
        },
        {
            "text": "The first part of the day focused on establishing a Digital and Cyber Thematic Campus in the North West, with colleagues from the Darlington and Leeds campuses sharing best practices. Also in attendance were a number of external providers including Microsoft, NHS, BT, and Manchester’s Inward Investment Agency all contributing to the discussion on how we can drive forward our aspirations in the North West."
        },
        {
            "text": "The Digital Campus aims to bring skills and departments together to foster innovation and encourage greater engagement with local and combined authorities so teams can develop their digital capability, collaboration, and talent in the region."
        },
        {
            "text": "The afternoon session brought together senior civil servants from across 17 departments in the North West to hear more about the 2030 vision for Places for Growth, how to can join together to understand National security threats, and how to tackle Cyber security as we use new technology more. This included a conversation, facilitated by the One Big Thing team, where attendees considered small changes that could make a difference in fostering greater collaboration and building a shared thriving community of civil servants in the region."
        },
        {
            "heading": 2,
            "text": "DBS innovation pipeline session"
        },
        {
            "text": "As part of One Big Thing, the Disclosure and Barring Service (DBS) recently held an innovation pipeline sharing session with colleagues from Home Office and HM Revenue and Customs (HMRC), to share innovative ideas and solutions across government departments. "
        },
        {
            "text": "The session, led by Nico Celaj, Head of Innovation at DBS, provided a platform for civil servants from various departments to unite and identify shared innovation interests within their organisations. "
        },
        {
            "text": "The session provided a platform for colleagues from across the Civil Service to exchange insights on their innovation projects, discuss the challenges they encountered, and brainstorm potential solutions."
        },
        {
            "text": "The session was highly successful, with colleagues from DBS, the Home Office, and HMRC unanimously agreeing on the benefits of future meetups to workshop solutions for shared challenges in the innovation arena. They also expressed interest in attending future ideation sessions on topics such as fostering a culture of innovation."
        },
        {
            "text": "The enthusiasm for collaboration among government departments is truly encouraging and embodies the spirit of One Big Thing. If you or your department want to know more about innovation at DBS, or want to get involved with future cross-departmental innovation sessions, please speak to Nico Celaj at nico.celaj@dbs.gov.uk."
        }
    ]
}