{
    "url": "https://stratcommand.blog.gov.uk/2025/02/17/strategies-unveiled/",
    "title": "Strategies Unveiled",
    "authors": [
        "HeatherS"
    ],
    "categories": [
        "Uncategorized"
    ],
    "pub_date": "2025-02-17T10:32:09+00:00",
    "content": [
        {
            "text": "As part of the Defence Experimentation and Wargaming Hub’s People in Wargaming series we recently spoke to a panel of people/experts about their experiences in the field of wargaming."
        },
        {
            "text": "Interviewer: Can you briefly introduce yourself? "
        },
        {
            "text": "Mike: My current role is the senior lessons manager. I'm part of an embryonic and growing staff setting up The Defence Experimentation and Wargaming Hub.  By background, my last job in the regular Army was doing operational lessons. So, it’s been an easy fit into this current role which I’ve been in since January [2024]. "
        },
        {
            "text": "Interviewer: Can you briefly describe your role/experience in wargaming? "
        },
        {
            "text": "Mike: Wargaming was something I did while serving probably in two places in particular.  First was at the Command and Staff Trainer at Warminster, where I was part of the Observer mentor team and the other experience of wargaming would be on Operations doing it for real. "
        },
        {
            "text": "Interviewer: Can you please explain the role of the Defence Experimentation and Wargaming Hub?  "
        },
        {
            "text": "Mike: I’m employed at the Defence Experimentation and Wargaming Hub as the lessons manager. When I arrived, it was just myself and the Chief of Staff. The Hub is a startup so it's all hands to the pump and I’ve sort of become the second in command.  It’s very much a new organisation, everybody does everything, and you've got to be willing to chip in. I do everything from vehicle passes to moving furniture to running the bookings programme and even occasionally doing some lessons work as well. "
        },
        {
            "text": "Interviewer: What drew you into wargaming? "
        },
        {
            "text": "Mike: I find lessons interesting, and I really enjoyed my last appointment, doing operational lessons in the regular Army. So, to continue doing this is a super opportunity. Being a start-up, the Hub is an exciting opportunity and something which you can make your own and shape rather than comply with somebody else's work and rules. "
        },
        {
            "text": "Interviewer: What are some of the key skills required for success in the wargaming field?  "
        },
        {
            "text": "Mike: Firstly, is the ability to analyse the problem and to ask the correct question. Because if you don't get the correct question, you won't get the correct answer. The second, is the ability to break away from group think and to think the unthinkable and dare to voice that view; and not to conform. "
        },
        {
            "text": "Interviewer: Can you talk about the importance of lessons on Wargaming? "
        },
        {
            "text": "Mike: If you're not capturing lessons, it's pointless wargaming!  Wargaming is not there for entertainment. It's there to provide findings that can shape thinking. There are 2 types of lessons; internal lessons; that's the mechanics of the wargame, how to make it better, how to make it more effective.  And then there are external lessons; what do the findings from wargames tell us the bigger picture and that's the bit where I try and concentrate my effort more. The difficult part is turning the analysis into a lesson. Looking at what else is going on in other operational theatres, in training, in trends and conflicts across the world and then applying the findings from a wargame."
        },
        {
            "text": "Interviewer: How do you apply lessons learned from wargaming to real-world situations? "
        },
        {
            "text": "Mike: The breadth of the wargames that we've [DEWH] had here or will have in the future, will tackle major trends across Defence. All lessons have got to have an owner, rather than leaving them hanging in the air, something must be done. Every lesson must be given to somebody who has the authority, and invariably the funding to fix it. "
        },
        {
            "text": "Interviewer: What has been your biggest learning point since starting the role? "
        },
        {
            "text": "Mike: It's been developing a bespoke lesson system for wargaming. How do you produce a system where you turn the game designer’s analysis plan into something meaningful that will then inform the development of wider lessons. It's taken me a while to get my head around it and sometimes it takes a while to explain it to people also. "
        },
        {
            "text": "Interviewer: What current trends are you seeing in wargaming? "
        },
        {
            "text": "Mike: I think, unquestionably, AI will be used more and more; but it must be used in the correct way. It's not a silver bullet that will fix every problem.  It's important to have the ability to show workings, to understand how you got to that decision rather than just blindly trusting computing to come up with the answer. It's like a math exam, most of the marks come from showing your workings to get to the answer. In wargaming, there's always going to be the human factor. "
        },
        {
            "text": "Interviewer: How do you think wargaming will evolve over the next five years? "
        },
        {
            "text": "Mike: There'll be more use of digital and there will be use of AI.  I'm not a complete luddite about it, but I think it's a bit like spice on your food.  There is a right occasion and it’s super, and there is a wrong occasion, and it just doesn't work. As we [DEWH] get more and diverse IT systems plugged in, we'll be able to use them more and get away from manual wargames, when appropriate.  I think there'll always be a place for manual wargames, but we’re moving towards an era where doing it electronically is better. "
        },
        {
            "text": "Interviewer: What is your favourite wargame and why? "
        },
        {
            "text": "Mike: I’ve only ever done one, Battle of Fallujah. I hadn't realised quite the enjoyment factor you can get from a wargame, until then.  "
        },
        {
            "text": "Interviewer: What do you see as the biggest challenge facing Defence Wargaming?   "
        },
        {
            "text": "Mike: At the moment, our stock is high, i.e. people are interested in wargaming, and people want to come to the Hub to conduct events.  What we must do is ensure we maintain the trust of the user.  That they continue to believe that coming to the Defence Experimentation and Wargaming Hib adds value to their planning process. I think part of this is an element of education, that people understand that a wargame is not Google, where you can type in any question and an answer will come out. You need to do a lot of research and analysis beforehand to frame the wargame; if you have a bad question, you'll get a bad answer. "
        },
        {
            "text": "Interviewer: What advice would you give to someone aspiring to enter the wargaming industry? "
        },
        {
            "text": "Mike: Probably try and work with Dstl actually. The amount of time and effort they put into training and mentoring is impressive. "
        },
        {
            "text": "Interviewer: What drives you as an individual? "
        },
        {
            "text": "Mike: A job that has value to it; that has a purpose.  Working at the Hub, there's a genuine purpose to it. It benefits others and benefits wider defence. So, in terms of job satisfaction, I think, it’s high on that. "
        },
        {
            "text": "Interviewer: What do you do in your free time? "
        },
        {
            "text": "Mike: I have two teenage daughters so free time is limited.  I'm a bit of a frustrated military historian, I have a focus on the Old Indian army.  I do talks for clubs, museums and military units; I also run the occasional battlefield tour. "
        }
    ]
}