{
    "url": "https://buyingforschools.blog.gov.uk/2023/04/25/energy-management-smart-meters-helping-you-make-better-informed-decisions-about-energy-use/",
    "title": "Energy management: Smart meters – helping you make better informed decisions about energy use",
    "authors": [
        "Kathryn Swanson, DfE Project Manager"
    ],
    "categories": [
        "Advice and support"
    ],
    "pub_date": "2023-04-25T10:11:43+01:00",
    "content": [
        {
            "text": "In this blog post, Kathryn Swanson, DfE Project Manager, explains more about how smart meters could help you better understand and manage energy use in your school or trust."
        },
        {
            "text": "Chances are, if the electricity meter in your school has not been replaced since 2017, then you probably don’t have a smart meter. Managing your electricity can be confusing, so I’m going right back to basics."
        },
        {
            "text": "What is a smart meter and why should your school consider one"
        },
        {
            "text": "You’ve probably heard of smart meters; you may have one in your own home. You also probably know that they are replacing traditional analogue gas and electricity meters across Great Britain. Smart meters are one part of an essential infrastructure upgrade that will make our energy system cheaper, greener, and more efficient. Other methods include LED lighting, solar panels, low-carbon boilers etc. but we will look at them another time."
        },
        {
            "text": "Installing an electricity smart meter in your school will help to monitor usage in real time, the advantage of this will be no more estimated billing. How you use the data and the frequency its monitored is up to you, for example monthly, termly, annually."
        },
        {
            "text": "How to identify if your school has a smart meter"
        },
        {
            "text": "Let’s start at the beginning, how to identify if you already have an electricity smart meter. This is not an uncommon question that we and energy suppliers are frequently asked. I think one of the easiest ways to know (though it can vary),  is to check if your meter has a digital display, that probably means it’s a smart meter. If your meter has a traditional clock, then it is more likely an old analogue meter. To be absolutely sure, I recommend you contact your current electricity supplier who will be able to tell you."
        },
        {
            "text": "There is a lot of confusing information out there about types of smart meter that talks about SMETS, profile classes and smart meter mandate - let me try and break this down for you:"
        },
        {
            "text": "If in any doubt, contact your existing electricity supplier and they will be able to tell you what meter you have."
        },
        {
            "text": "I’ve produced this short Smart meter video that includes some quick tips on how to identify what electric meter you have. If you are still unsure, contact your current electricity supplier."
        },
        {
            "text": "If your school has more than one meter"
        },
        {
            "text": "If your school currently has more than one electric meter, you may be able to upgrade to one smart meter, but I would recommend you take advice from your current supplier."
        },
        {
            "text": "Why you should consider getting a smart meter"
        },
        {
            "text": "We are all aware of how much the cost of energy has increased over the last few months and I’m sure that your school will have seen an increase in its bill. Installing a smart meter, isn’t going to reduce the unit cost of the electricity your school uses, but it will give you more information and control."
        },
        {
            "text": "A smart meter will remove estimated billing, and this means only paying for the electricity actually used, which should help you to budget and make informed decisions. Once you have a smart meter installed, talk to your electricity supplier who will be able to provide instructions on how to access your data. Energy suppliers are required, under energy supply licence conditions, to ensure that consumers have timely access to their half-hourly electricity data."
        },
        {
            "text": "If you know how much energy you use and what influences it, you can target and prioritise the best ways to reduce consumption. Many suppliers provide a dashboard that allows you to view usage over specific periods e.g., over a term, a year etc. It will let you see peaks and troughs of usage; including how much electricity is being used when your school is empty, and this will help inform how you can become more energy efficient."
        },
        {
            "text": "As a department, the DfE’s ambition is to be world-leading education sector in sustainability and climate change by 2030. Reducing direct and indirect emissions from education and care buildings, driving innovation to meet legislative targets and providing opportunities for children and young people to engage practically with the net-zero goal. Good Estate Management for Schools has published some tips to reduce your energy usage, that includes teachers bringing energy usage into lesson plans that could influence longer-term behaviour both at school and in the home."
        },
        {
            "text": "If your electricity contract is managed through the Local Authority, talk to them about installation of smart meters."
        },
        {
            "text": "The department also has some useful information on GOV.UK you can read at your leisure:"
        },
        {
            "text": "An introductory guide to smart meters in the public sector"
        },
        {
            "text": "Sustainability and climate change: a strategy for the education and children’s services systems"
        },
        {
            "text": "Energy efficiency: guidance for the school and further education college estate"
        },
        {
            "text": " "
        },
        {
            "text": " "
        }
    ]
}