{
    "url": "https://gott.blog.gov.uk/2023/04/25/managing-intellectual-property-and-confidentiality/",
    "title": "Managing intellectual property and confidentiality - GOTT's top 5 takeaways",
    "authors": [
        "riannastone1"
    ],
    "categories": [
        "Intellectual Property",
        "Policy"
    ],
    "pub_date": "2023-04-25T13:47:03+01:00",
    "content": [
        {
            "text": "On 26th April, the GOTT team is celebrating World Intellectual Property Day. This day is about raising awareness of patents, copyright, trade marks and designs."
        },
        {
            "text": "GOTT is working to support innovators across the public sector understand how they can protect their inventions, ideas and other knowledge assets."
        },
        {
            "text": "We’ve pulled together the top five takeaways from our guide ‘Managing Intellectual Property and Confidentiality’"
        },
        {
            "text": "If you work with knowledge assets (KAs), or intangible assets, you might want to find out more about the basics of intellectual property (IP), including how it’s owned, protected and how it can be commercialised."
        },
        {
            "heading": 2,
            "text": "We are surrounded by IP every day!"
        },
        {
            "text": "Topping our list is that you might not be aware of the valuable IP that you use every day, or that is being created within your team."
        },
        {
            "text": "Put simply, IP is a creation of the mind, it’s all around us and can be a valuable public asset. It could be a database that you’ve created, a new technology you’ve developed, a new way of doing something, a creative work such as your department’s logo, or content in a report or booklet."
        },
        {
            "text": " "
        },
        {
            "heading": 2,
            "text": "IP is central to innovation "
        },
        {
            "text": "IP can be protected, for example through patents, trade marks, design rights or copyright. The security or protection afforded by IP rights stimulates innovation, as it gives Government, researchers, inventors and businesses the confidence to invest in doing something new."
        },
        {
            "text": "The creation of new and innovative products often requires a significant investment in time, money or expertise and creators and inventors want assurance that they can reap the benefits of their hard work."
        },
        {
            "text": " "
        },
        {
            "heading": 2,
            "text": "It’s important to manage IP "
        },
        {
            "text": "IP can be a valuable asset so it’s vital that it is properly identified and managed. If IP isn’t protected, there is no way to stop someone else benefitting from the innovation – or controlling the process of how the IP is developed, or by whom. This could mean that benefits for the UK are missed."
        },
        {
            "text": "The process of protecting IP depends on the type of IP which has been created. The GOTT guide to IP provides practical tips on what to do to reap the benefits for different types of IP."
        },
        {
            "text": " "
        },
        {
            "heading": 2,
            "text": "Consider confidentiality "
        },
        {
            "text": "If the created IP could be patentable, or registered as a design, details about it must not have been disclosed anywhere in the world before seeking to protect the IP."
        },
        {
            "text": "The best way to keep something confidential is not to disclose it in the first place. But there will be some situations where disclosure may be protected through a confidentiality agreement, often called a Non-Disclosure Agreement (NDA). Play it safe and seek advice from a legal expert in your organisation or the GOTT team. "
        },
        {
            "text": " "
        },
        {
            "heading": 2,
            "text": "The GOTT team is here to help you keep innovating!"
        },
        {
            "text": "We’re here to support the better management, development and exploitation of knowledge assets and IP held across UK central government and its public bodies."
        },
        {
            "text": "So if you require further advice on managing IP in relation to Knowledge Asset Management or need advice for an invention you can contact us by email at: KAguidance@beis.gov.uk or find more online resources by visiting the Intellectual Property Office (IPO) website. "
        },
        {
            "text": " "
        },
        {
            "heading": 3,
            "text": "Further guidance"
        },
        {
            "text": "For more practical advice, visit The Rose Book: Guidance on Knowledge Asset Management in Government"
        },
        {
            "heading": 3,
            "text": "Other useful sources:"
        }
    ]
}