{
    "url": "https://mojdigital.blog.gov.uk/2023/04/25/moj-digital-strategy-one-year-on/",
    "title": "MoJ Digital Strategy: One Year On",
    "authors": [
        "Gina Gill"
    ],
    "categories": [
        "MoJ Digital Strategy 2025",
        "Our People",
        "Our services",
        "our users"
    ],
    "pub_date": "2023-04-25T13:03:05+01:00",
    "content": [
        {
            "text": "One year ago, we launched the MoJ’s Digital Strategy. It was unusual in that it was a sum of a number (over 40) of existing strategies rather than a top down strategy based on a vision of a future. We said we would make justice services simpler, faster and better for all users; and that we would do this by making the MoJ a more flexible organisation, driven by data and led by users."
        },
        {
            "text": "Anyone who knows me would tell you that it would be impossible to say everything I’d like to say about the first anniversary of our strategy in a single blog. So I’m going to do 3."
        },
        {
            "text": "Part 1: One year on, three stories"
        },
        {
            "text": "We had some Justice Digital all hands meetings recently and instead of, as we usually would do, sharing long lists of great delivery, we heard from real people who are using our services so that we could understand and celebrate the difference we are making. I’m going to share those with you."
        },
        {
            "text": "The Prisoner"
        },
        {
            "text": "Firstly, we had a person in prison dial-in live to talk about his experience of in-cell technology. In-cell technology consists of WiFi to each cell, basic devices, software that allows prisoners to manage their own admin, and The Hub which is a sort of intranet site. It is now available in 15 prisons to over 10,000 prisoners. We heard that the technology had given him the ability to take control of his own admin like canteen purchases, medical appointments, or work assignments. It doesn’t sound like much, but we heard that simple tasks like this help to reduce a “learned helplessness” from reliance on the institution, and provide a sense of hope and preparedness for the outside world. We learned how important the technology is for those who aren’t able to read or write well, and previously had to rely on filling in forms to engage with the regime. And we learned that he was developing his skills by creating content for The Hub, and that it was not only becoming an important source of information and educational content, but a hub in the real sense of word by creating a sense of community."
        },
        {
            "text": "The Probation Officers"
        },
        {
            "text": "We were also joined by not one but two probation colleagues. The first was a simple story (via some very cute dog pictures!) of being provided with reliable network connectivity and basic technology that works at an Approved Premises site. For those who don’t know, these are residential units that house offenders in the community. This means that not only can he and his colleagues get more dependable access to systems that enable them to understand the person in their care, but also allows them to provide better support in terms of finding employment for those people for example. It’s a conversation that we shouldn’t need to have in 2023, but we have a very large estate and not all of it (yet) has reliable WiFi."
        },
        {
            "text": "We then heard from a colleague about the Prepare a Case for Sentence service we launched last year. It does what it says on the tin, allowing probation officers to collate information that is pertinent to making sentencing decisions. This service is saving colleagues up to 50% of their time in finding the right information and bringing it together, which means that they can now properly reflect on what that information is telling them and therefore make better recommendations."
        },
        {
            "text": "The Deputy"
        },
        {
            "text": "Finally, we heard the story of a young deputy through their case manager. This person was in their first year of university when he suddenly found himself responsible for his parents estate and care after a tragic accident. Can you imagine at the age of 18 or 19, being left with the responsibility of managing your parents estate, finances and care? I certainly can’t. Part of that responsibility means he had to provide regular, detailed and complex financial and health reporting. However, because of the work of Justice Digital, he was able to use our Digital Deputies service, which we integrated into our internal case management system last year to make this reporting simpler and faster. This removed an extra layer of complexity and stress for him at a time of unimaginable emotional upheaval."
        },
        {
            "text": "There are many, many more stories like this: from colleagues who we’ve given time back to across the organisation, to victims of crime who for whom we’ve reduced trauma, to prison governors who are able to engage better with those in their care. In an organisation of our size and complexity, this human impact can sometimes be lost to the big numbers and major announcements. In delivering this strategy over the past year, and the journey to more user-centred services, hearing those stories is as important as ever."
        },
        {
            "text": "But hopefully, this gives you a sense of the work that we do - making a genuine, sustained and transformative difference to people’s lives. That is what motivates me to get out of bed every morning, and why I am so proud to be part of the Justice Digital team."
        },
        {
            "text": "Look out for Part II: One year on, Changing the conversation."
        }
    ]
}