{
    "url": "https://civilservice.blog.gov.uk/2021/12/21/cop26-and-the-power-of-collaboration/",
    "title": "COP26 and the power of collaboration",
    "authors": [
        "Kirri Hendriksen"
    ],
    "categories": [
        "A Modern Civil Service",
        "A Skilled Civil Service",
        "An Ambitious Civil Service",
        "An Innovative Civil Service",
        "Apprenticeships",
        "Uncategorized"
    ],
    "pub_date": "2021-12-21T09:58:02+00:00",
    "content": [
        {
            "heading": 3,
            "text": "The Civil Service Environment Network (CSEN) is run by just 35 volunteers from across the organisation and has more than 3,000 members – we demonstrate the power of working together."
        },
        {
            "text": "Last month’s COP26 summit may be over, but its influence and legacy gives real hope that the agreed actions will help cut the emissions of carbon dioxide. This two-week summit was a critical test of global cooperation to tackle the climate crisis. "
        },
        {
            "text": "Sir David Attenborough’s memorable message to powerful global leaders was a challenge to do more together to tackle climate change."
        },
        {
            "text": "“If working apart we are a force powerful enough to destabilise our planet, surely working together, we are powerful enough to save it.” "
        },
        {
            "text": "In spite of the pandemic, 120 world leaders made their way to Glasgow for the COP26 World Leaders Summit. An amazing feat in itself, for this to have been planned and executed in the midst of a global pandemic was nothing short of amazing. "
        },
        {
            "text": "The enormous effort from across government and its diplomatic network served as a reminder of the power of collaboration across departments and sectors. "
        },
        {
            "text": "In the COP26 Unit in the Cabinet Office alone, there were 200 officials working to coordinate the summit and ministerial representation from 15 different departments across government. It could not have taken place without the incredible efforts of hundreds of civil servants from an array of departments, from policy to press officers to comms and finance specialists, all working to deliver such an extraordinary event."
        },
        {
            "text": "Here in the CSEN, we’re committed to supporting the goals of COP26 and beyond, and are hosting a range of diverse and inclusive events providing an impartial space to discuss key learnings and shared challenges. As we continue towards the goal of being An Ambitious Civil Service, collaboration is at the forefront of so much of our work - and our support of the COP26 commitments is no different."
        },
        {
            "heading": 4,
            "text": "Who are we?"
        },
        {
            "text": "Open to all civil servants, the Civil Service Environment Network was established in October 2019 and has steadily grown to more than 3,000 civil servants across 100 departments and agencies. CSEN is run remotely, with members based all over the UK, by a committee of more than 35 volunteers dedicated to arranging a range of fascinating activities and events. "
        },
        {
            "heading": 4,
            "text": "What we do"
        },
        {
            "text": "We arrange talks with high-profile speakers, discussion groups with experts, policy workshops, volunteering opportunities, careers and networking events, a programme of online learning, podcasts and links with regional groups. "
        },
        {
            "text": "Each month, we have a different theme for our content, ranging from climate security in November to regenerative agriculture and soil in December, and from intersectionality and environmental justice in January to sustainable cities in February. "
        },
        {
            "text": "If COP26 has made you curious about net zero, climate change or environmental policy, then we can show you how to bring the momentum of COP26 into your work. We have a unique offer to educate, inspire and develop your environmental knowledge and capability."
        },
        {
            "heading": 4,
            "text": "What we’ve been up to"
        },
        {
            "text": "In the lead up to COP26, we held five ‘Behind the Scenes’ sessions, to hear from colleagues across government about their preparation for the event. The clear message from the speakers was that the cross-government aspect to work is crucial. Some of the government’s priorities – including the Net Zero Strategy – require engagement and collaboration across the Civil Service. "
        },
        {
            "text": "This is one of the most distinctive and enjoyable aspects of being a part of CSEN, which enables members to network with others from a huge range of organisations. This message is also reiterated by our senior sponsors Marine at Defra, and Lee McDonough, Director General for Net Zero Strategy and International at BEIS and David Hill, Director General for Environment, Rural who wrote a blog post for us recently about his career journey."
        },
        {
            "heading": 4,
            "text": "New podcast"
        },
        {
            "text": "We produced our first podcast called CSEN Environment Deep Dives where we talk to experts about the biggest issues in environmental policy. In our first episode on climate security, Jake Billingham from BEIS talks with Chitra Nagarajan."
        },
        {
            "text": "We’ve also produced a series of short Environment 101 videos, investigating biodiversity and ecosystems, sustainable development, natural resources and climate change. "
        },
        {
            "text": "Our latest series explores the meaning of climate security, the way it affects the most vulnerable, and the various drivers behind it. "
        },
        {
            "heading": 4,
            "text": "Get involved"
        },
        {
            "text": "It’s clear Sir David Attenborough was right: we can achieve more by working together. Now that COP26 has ended, the hope is for real-world action to flow from the commitments made. It can be encouraging to connect, learn and collaborate with colleagues across the Civil Service. If you are a civil servant who would like to get involved, join us by signing up on our website CSEN Online to come to our next event, and follow us on LinkedIn and Twitter. "
        }
    ]
}