{
    "url": "https://environmentagency.blog.gov.uk/2021/12/21/do-your-part-to-protect-the-water-environment-this-christmas/",
    "title": "Do your part to protect the water environment this Christmas",
    "authors": [
        "Environment Agency"
    ],
    "categories": [
        "Cleaner Seas",
        "Water"
    ],
    "pub_date": "2021-12-21T10:37:42+00:00",
    "content": [
        {
            "text": "By Rachael Caldwell, Area Environment Manager for North East. "
        },
        {
            "text": "There’s so much we have to be proud of in the North East – a stunning coastline and thriving water sports community not to mention the best salmon river in the country, the River Tyne, cutting through the beautiful countryside."
        },
        {
            "text": "Here at the Environment Agency we work hard all year round to protect the water environment for people to enjoy and for wildlife to thrive. But no one organisation can do it on their own – if we all make small steps we can make a big difference together."
        },
        {
            "text": "The festive season is no exception, so we’re encouraging everyone to play their part. Did you know, that for every 1 million turkeys cooked, around 250 tonnes of fats and oils could find their way into drains? That’s about nine times as heavy as the Statue of Liberty! Imagine the size of the fatberg that could create in our region’s sewerage system."
        },
        {
            "text": "When blockages happen, the content of drains and toilets can end up in rivers and on beaches. As a person who spends a lot of time outdoors and around our beautiful water environment, that’s very unpleasant to see and it also causes pollution that kills fish and other wildlife."
        },
        {
            "text": "Making the link between what you do at home or work and the impact it can have on the environment is vital."
        },
        {
            "text": "What do you flush down your loo? 8 out of 10 people say they only flush pee, poo and paper down the toilet, but huge quantities of wet wipes, cotton buds and other unflushables are still finding their way into the sewer network. When these mix with fats, oils and grease they form fatbergs."
        },
        {
            "text": "So, what should you do with the leftover fats, oils and grease? The answer is very easy:"
        },
        {
            "text": "Remember – don’t feed a festive fatberg."
        },
        {
            "text": "Everyone’s actions affect water quality and we can all play our part in improving the water environment that we all love so much. Let’s end the year knowing we did our bit."
        },
        {
            "text": " Follow the Environment Agency on Twitter, and Don’t Feed a Festive Fatberg."
        },
        {
            "text": " "
        }
    ]
}