{
    "url": "https://nationalscreening.blog.gov.uk/2021/12/21/new-chair-sought-for-uks-expert-screening-committee/",
    "title": "New chair sought for UK’s expert screening committee",
    "authors": [
        "Zeenat Mauthoor"
    ],
    "categories": [
        "General"
    ],
    "pub_date": "2021-12-21T17:00:06+00:00",
    "content": [
        {
            "text": "The UK National Screening Committee (UK NSC) – the independent scientific committee which makes screening recommendations to UK ministers and the NHS – is looking for a new chair to contribute to its ongoing development."
        },
        {
            "text": "It is more than 25 years since the UK NSC was set up to systematically assess the evidence and make the best possible recommendations to ministers so that thousands of people can be helped by health screening programmes."
        },
        {
            "text": "We are recruiting a new chair to lead this group of experts at a time of change for screening and the UK NSC."
        },
        {
            "heading": 2,
            "text": "Big opportunities ahead"
        },
        {
            "text": "The UK NSC continues to evolve as technologies and information change. On advice from the UK’s chief medical officers (CMOs), ministers have agreed to expand the functions of the committee."
        },
        {
            "text": "Going forward, the UK NSC will actively consider:"
        },
        {
            "heading": 2,
            "text": "Chairing the committee"
        },
        {
            "text": "The new chair will reflect the UK NSC’s new role and help lead it through its next phase."
        },
        {
            "text": "Building on the exceptional contribution of the current chair, Professor Bob Steele, the new chair will provide strong strategic leadership, set the direction of the committee, and lead its work to deliver improvements and innovation in screening."
        },
        {
            "text": "The successful candidate will help make sure the UK NSC takes advantage of opportunities presented by developments in research and technological innovation."
        },
        {
            "heading": 2,
            "text": "UK NSC blog"
        },
        {
            "text": "The UK NSC blog provides up to date news from the UK National Screening Committee. You can register to receive updates direct to your inbox, so there’s no need to keep checking for new articles. If you have any questions about this blog article, or about the work of the UK NSC, please contact the UK NSC helpdesk."
        }
    ]
}