{
    "url": "https://insidehmcts.blog.gov.uk/2021/12/21/proving-disability-is-no-barrier-to-jury-service-at-portsmouth-crown-court/",
    "title": "Proving disability is no barrier to jury service at Portsmouth Crown Court",
    "authors": [
        "Eve Miller"
    ],
    "categories": [
        "Court and tribunal reform",
        "Crime",
        "General"
    ],
    "pub_date": "2021-12-21T13:00:18+00:00",
    "content": [
        {
            "text": "For most people, coming to court is an unfamiliar, even daunting, experience whether they’re a witness, defendant, juror or a family member supporting someone else. Every day, it’s our teams’ jobs to welcome people to our court buildings – helping them find their hearing, answering questions and making sure they feel safe and supported."
        },
        {
            "text": "So we were particularly proud to receive excellent feedback from a juror about the support and welcome they received at Portsmouth Crown Court – not least because, as a blind person, we wanted to make sure we’d done everything possible to make their experience positive and productive."
        },
        {
            "text": "Excellent feedback from a juror "
        },
        {
            "text": "While we can’t identify the juror for legal reasons, we wanted to share some of their words:"
        },
        {
            "text": "We’re incredibly proud of this feedback and how it reflects on our staff – we have such a great team. It warms my heart because we have a lot of people doing what can be a very challenging job. Those individuals in OCS and HMCTS have gone the extra mile and embody both our organisations’ customer service culture."
        },
        {
            "text": "Working together to create an inclusive approach"
        },
        {
            "text": "The first thing we did was to understand how this individual would experience the court – what the challenges were, and how we could help to overcome them. To do this, the team met them and talked through what might be required of a juror. They were able to flag up anything that might need specific support or a work-around. We also talked to the judge and Crown Prosecution Service (CPS) to assess what cases would be suitable."
        },
        {
            "text": "We arranged a guided tour of the building so that they would be familiar with the layout and facilities. They said that this; “made my first day as a juror so much less daunting than it could have been, with my having a sense of familiarity with the location, yourself and your team, and in navigating to the right place.”"
        },
        {
            "text": "We also made arrangements in case the individual brought their guide dog or needed to use a laptop with functions such as a narration tool that can read out written documents aloud."
        },
        {
            "text": "On the day the juror arrived in court, our Security team helped them navigate through the metal detection barriers and security checks before talking them through obstacles and turns on their way to the courtroom."
        },
        {
            "text": "Once in the courtroom, the Judge, Ushers and Clerks gave clear descriptions of events and evidence, guiding the juror between courtrooms and the jury room and showing them where to get refreshments."
        },
        {
            "text": "Of course, we make every effort to ensure every juror feels safe, confident and clear on their role.  It’s just that in this case, we needed to work together with the juror to think a bit differently. But it was also about getting the balance right. It can be easy to be condescending or make someone feel singled out and we wanted them to feel included and confident."
        },
        {
            "text": "Helping everyone take on their civic duty"
        },
        {
            "text": "Everyone has a role to play in the justice system. It’s important that we’re inclusive, support jurors and give them confidence when they’re in court. This individual was committed to taking on their civil duty and we were happy to help them achieve this."
        },
        {
            "text": "For us, it’s these words from the juror that show how important this effort was: ‘I can only praise the team you have at Portsmouth Crown Court, from the initial welcome from security at reception, all the way through to my release from service, your staff were truly excellent.’"
        }
    ]
}