{
    "url": "https://hodigital.blog.gov.uk/2021/12/21/refugee-integration-loans-a-policy-colab-case-study/",
    "title": "Refugee integration loans: a Policy CoLab case study",
    "authors": [
        "Katy Arnold, Deputy Director for Design and Research"
    ],
    "categories": [
        "Design",
        "Service design"
    ],
    "pub_date": "2021-12-21T11:38:49+00:00",
    "content": [
        {
            "text": "In our earlier posts we introduced the Home Office Policy and Innovation Lab (CoLab) and shared our approach to helping the Home Office solve problems."
        },
        {
            "text": "In this case study we show how we apply a structured method and design thinking to real-life Home Office problems."
        },
        {
            "text": "We are a creative team of designers, researchers and technologists working on user-centred policy design. We work collaboratively with policy and operations teams to build a complete view of complex problem areas. Our work identifies issues, which allows us to explore ways to design solutions, test ideas and de-risk policy decisions."
        },
        {
            "heading": 2,
            "text": "What are refugee integration loans?"
        },
        {
            "text": "Refugee integration loans are interest-free loans with favourable repayment terms for adults granted refugee status in the United Kingdom (UK)."
        },
        {
            "text": "They were introduced in 2007 following a public consultation and were intended to help people with the costs of integrating into UK society. They are funded by the Home Office who make the initial decisions on applications. They are then administered and recouped by the Department for Work and Pensions (DWP)."
        },
        {
            "text": "By November 2019, when we first started work on this, 18,794 refugees had received loans."
        },
        {
            "text": "The service was set up as a paper-based service in 2007 and had remained largely unchanged since then. The policy team asked CoLab to examine the whole service, including legal and policy aspects, and propose improvements."
        },
        {
            "heading": 2,
            "text": "How we identified the issues"
        },
        {
            "text": "We carried out extensive research with refugees and support workers across the UK, with the staff who process loans, as well as with Home Office colleagues in policy, operations and finance. We worked with third party stakeholders such as local authorities, charities and support organisations across the asylum-seeking and integration journey."
        },
        {
            "text": "Working in collaboration with policy and operations teams from the Home Office Refugee Integration Unit, we mapped out the whole system, identifying core issues for those applying. These included:"
        },
        {
            "text": "In a fast-moving rental market, refugees need support raising deposits and rent advances, but the time the loan was taking to be paid meant that they had little chance of finding adequate housing."
        },
        {
            "heading": 2,
            "text": "Problem definition and target outcomes"
        },
        {
            "text": "We used insight from our user research to define three core problem statements and used these to establish target outcomes."
        },
        {
            "text": "How might we improve the refugee integration loans service so that:"
        },
        {
            "text": "What would success look like for each of the problem statements:"
        },
        {
            "text": "“Design thinking brings together what is desirable from a human point of view with what is technologically feasible and economically viable.”"
        },
        {
            "text": "Building on IDEO’s definition of Design Thinking we were looking for ideas which might also be effective in terms of the target outcomes. We used a combination of research and hypothesis-led, rapid experimentation​ to discard some ideas, iterate others and take the best performing ideas forward for more work."
        },
        {
            "text": "It is this repeatable and structured approach which enables us to build confidence that a solution will deliver what we set out to achieve."
        },
        {
            "heading": 2,
            "text": "Switching from a paper-based to a digital approach during challenging times"
        },
        {
            "text": "Just as the project was coming to an end in March 2020 we went into lockdown. The operational team were forced to move to remote working which made receiving and processing paper applications challenging​."
        },
        {
            "text": "Although CoLab are not a delivery team, we felt we were in a good position to provide support. We had already proposed amendments to the policy, created and tested designs for a digital application form, and developed a simplified decision-making process for case workers​. We had a design for the end-to-end service ready to go."
        },
        {
            "text": "So, together with colleagues in our Software Application Services (SAS) team we created a digital application form and collaborated with the operational team to streamline back-office processes. We also worked with the policy team and contributed to our first ministerial submission, eventually securing approval to make changes to the policy."
        },
        {
            "heading": 2,
            "text": "The launch of the new service and measuring performance"
        },
        {
            "text": "On 7 September 2021, the new service and policy changes were launched."
        },
        {
            "text": "We’ve benchmarked previous service performance and are working with the operational service owners to track how things are working across those target outcomes. Our experimentation suggests we can expect to see significant improvements in staff efficiency and decision-making. We’re also more confident that the loan will deliver on policy intent to help refugees settle and integrate into UK society."
        },
        {
            "text": "Right now, we’re watching to see how things work in real life and will report back here once we’ve collected enough data to accurately measure service performance."
        }
    ]
}