{
    "url": "https://services.blog.gov.uk/2021/12/21/showing-what-good-looks-like-and-creating-a-culture-that-enables-digital-transformation/",
    "title": "Showing what good looks like and creating a culture that enables digital transformation",
    "authors": [
        "Joyce Tedone – Consulting technical architect, CDDO",
        "Tyronne Fisher – Senior technical advisor, CDDO",
        "Dan Bowden – Head of Digital Operations, UKEF",
        "Paul Hosking – Delivery manager, UKEF"
    ],
    "categories": [
        "Service assessments",
        "Service transformation"
    ],
    "pub_date": "2021-12-21T13:24:43+00:00",
    "content": [
        {
            "text": "Last time, we blogged about how the Digital Trade Finance Service (DTFS) team worked in an alpha phase, challenges along the way and how they went about evidencing and preparing for their assessment. As the service moved into beta, the team and colleagues in the Central Digital and Data Office (CDDO) focused on changing the culture and bringing the rest of UK Export Finance (UKEF) on its transformation journey."
        },
        {
            "text": "An organisation’s culture can sometimes make or break a piece of work, so creating the right environment to deliver effectively is paramount to success."
        },
        {
            "text": "The team needed to show what ‘good’ looked like, and to that end, the show and tells were hugely successful, with really positive feedback. It demonstrated to the wider business how they worked – in the open and as a unit. "
        },
        {
            "text": "The team ran a series of workshops and training events with the GDS Academy focusing on agile and digital training for senior leaders. This helped a lot! It got people on the same page, busted many myths, and created a space for honest discussion, showing UKEF’s leaders what ‘good’ was."
        },
        {
            "text": "The team has done a lot in this space. Two things worked exceptionally well. The first was establishing a structured weekly workshop with their business leads and users. This sat outside of project boards, user research sessions and co-design sessions. These workshops involved a group of interested people to bounce ideas and problems around, steering and advising the team at both a tactical and strategic level. "
        },
        {
            "text": "The second thing (which we borrowed from many other service teams) was to make user research a team sport. We actively showed results and involved main stakeholders in actual research sessions, the last one with our Chief Finance Operations Officer. Doing this was a real revelation for people and helped stakeholders see the value in the approach.   "
        },
        {
            "text": "This has helped take the organisation on its transformation journey, creating a safe space for the team to work and ultimately deliver for its users."
        },
        {
            "text": "– Cameron Fox, UKEF, Chief Finance and Operating Officer"
        },
        {
            "heading": 2,
            "text": "Creating a sustainable future for the service"
        },
        {
            "text": "Moving forward, sustainability is essential, and until now the team has worked with an excellent, well-experienced supplier. Nevertheless, at some point, civil servants must take over running and iterating the service. "
        },
        {
            "text": "The supplier was great at helping develop the culture, setting the architectural approach, and doing the heavy lifting on the transformational work. That said, the team now needs to make this sustainable, providing value for money to the taxpayer. "
        },
        {
            "text": "While the team already has civil servants in core roles, a successful Spending Review (SR20) bid means the team have filled 4 out of 5 new posts to help create a full, sustainable, multidisciplinary service team."
        },
        {
            "heading": 2,
            "text": "Designing with data"
        },
        {
            "text": "With the service preparing for private beta phase, the use of analytics and data now becomes increasingly more important."
        },
        {
            "text": "Firstly, why bother tracking data? With a broader lens, the team use data to understand:"
        },
        {
            "text": "Focusing specifically on private beta, the team will use data to understand how the service is performing and report against service and business key performance indicators (KPIs). This will help the team understand where best to focus their efforts, so they can continue iterating and improving the service design before releasing it to a much wider user base."
        },
        {
            "text": "They will take the insights the data provides and use these to focus research efforts to understand what is working well, what users are struggling with, and what the team can do to improve it."
        },
        {
            "text": "In recent weeks, the team’s performance analyst has made massive progress in forging an agreement between the team and business stakeholders on how the service will be measured. That includes capturing data against key metrics, setting KPIs and visualising the data so they can, as a service team, have constant, instant access to the data."
        },
        {
            "text": "To this end, the team is using a data tool to aggregate data sources from across the business into a dashboard that demonstrates performance against KPIs. The tool also allows them to interrogate these data points and provide those nuggets of information that point to what might be happening on the service. This will prepare user researchers to answer the ‘why’ before the wider team gets to resolving issues and improving the service."
        },
        {
            "heading": 2,
            "text": "Where do we go from here? "
        },
        {
            "text": "While there’s still work to be done and more of the story yet to be told, now the service team is soaring towards public beta and their beta assessment, and, to continue the analogy, flying on their own. CDDO remains side by side in the flight path."
        }
    ]
}