{
    "url": "https://educationhub.blog.gov.uk/2021/12/21/teachers-and-parents-get-boosted-now-to-be-ready-for-the-return-to-schools-and-colleges-in-january-and-protect-against-the-omicron-variant-of-covid-19/",
    "title": "Teachers and parents: Get Boosted Now to be ready for the return to schools and colleges in January",
    "authors": [
        "Media Officer"
    ],
    "categories": [
        "Coronavirus",
        "Schools"
    ],
    "pub_date": "2021-12-21T16:58:22+00:00",
    "content": [
        {
            "text": "UK Health Security Agency data shows that within 14 days of a booster vaccination your protection against symptomatic infection from the Omicron variant of COVID-19 increases by as much as 70%"
        },
        {
            "text": "With many schools going back after the Christmas holidays on 4 January – 14 days from today – it is vitally important that people who haven’t already had or booked their booster jabs arrange to Get Boosted Now in order to protect themselves from the virus and to help minimise disruption in schools, colleges and early years providers."
        },
        {
            "text": "The Prime Minister and the Education Secretary have both been clear that protecting education and keeping education and childcare settings open for all children and young people is a key priority. That’s why we have recently launched an appeal for ex-teachers to return to the classroom if they are able and provide cover for staff absences to help maintain face-to-face provision."
        },
        {
            "text": "But making sure you are vaccinated and have had your booster if you’re eligible is vitally important as vaccinated people are far less likely to get COVID-19 with symptoms and even more unlikely to get serious COVID-19, to be admitted to hospital, or to die from it and there is evidence that they are less likely to pass the virus on to others."
        },
        {
            "text": "This means the protections that vaccinations and boosters offer the education system can play a huge part in protecting you from the virus and minimising disruption for pupils and families."
        },
        {
            "text": "Find out more about how boosters will protect education here and book your booster and find out more about your eligibility for vaccinations here."
        }
    ]
}