{
    "url": "https://digitaltrade.blog.gov.uk/2021/12/21/thinking-of-a-career-change-switch-to-be-a-digital-data-and-technology-ddat-professional/",
    "title": "Thinking of a career change? Switch to be a Digital, Data and Technology (DDaT) professional",
    "authors": [
        "Stephen Corder, Senior Product Manager",
        "Madeline Lasko, Service Owner",
        "Ashley Knowles, Senior User Researcher"
    ],
    "categories": [
        "Careers",
        "Culture",
        "People and Skills"
    ],
    "pub_date": "2021-12-21T09:56:41+00:00",
    "content": [
        {
            "text": "In the run up to the New Year, a lot of us may start to think about our next career move. To inspire you, we spoke to colleagues in the DDaT team about their career journey into their current roles, what inspired them to join a digital, data, and tech team, and their advice for someone wanting to make a similar move."
        },
        {
            "heading": 3,
            "text": "Ashley Knowles, Senior User Researcher"
        },
        {
            "heading": 4,
            "text": "What did you do before your current job role?"
        },
        {
            "text": "Before my current role, I was a Collections Management Curator at a national art museum in the Caribbean. My academic background is in anthropology and museum studies. I did internships at different museums in the Caribbean and at the Smithsonian for 4 months. I believed that I would be a museum professional for my entire career, even having a 5- and 10-year plan!"
        },
        {
            "heading": 4,
            "text": "What inspired you to change career paths to be a DDaT professional?"
        },
        {
            "text": "While studying for my Masters degree in Museum Anthropology, a professor mentioned the world of insights and consulting to me. They said that a lot of anthropology professionals go into this area because there are limited jobs in the museum and heritage space. At this time, I was applying to heritage roles in the UK with tough competition. My favourite job interview was in a castle, to be the Collections Manager of the spoon collection."
        },
        {
            "text": "I was intrigued by consumer insights, so I took a short internship as a Research Executive to see if this was for me. I loved it! From here, I made the switch to consumer insights where I then fell into User Experience. Now, I’m a Senior User Researcher!"
        },
        {
            "heading": 4,
            "text": "What advice would you give someone looking to make the move?"
        },
        {
            "text": "My entire career has been both purposeful and accidental. It was purposeful as I chose an area that I thought I wanted to pursue and did courses, degrees, reading, and training to get that role. However, it’s also been accidental because I’ve found out about other great career paths along the way and trusted myself and my skills to go with the flow and make the move."
        },
        {
            "text": "My first piece of advice is to research the area you are interested in. Talk to the people who do the job and understand the role specifications. Use this to identify any gaps in your skillset and target areas for development."
        },
        {
            "text": "Secondly, be prepared to take a pay cut or step down in seniority. When I switched from heritage to consumer insights and user research, it felt like starting again. It was tough at first, but over 5 years I’ve managed to become quite senior quite quickly. I think I am further ahead in my career now than if I had stayed in museums and heritage."
        },
        {
            "text": "I once read somewhere that the average person has at least 3 careers in their lifetime. I’ve had 2 so far and I’m very open to finding out what the third might be!"
        },
        {
            "heading": 3,
            "text": "Madeline Lasko, Service Owner"
        },
        {
            "heading": 4,
            "text": "What did you do before your current job role?"
        },
        {
            "text": "My career began working for a Member of the European Parliament (MEP) in Brussels. After this, I moved to a charity where I spent 7 years advising employers on how they can make their workplaces inclusive and productive environments for everyone. From here I joined the DDaT Fast Stream, taking on a variety of roles across various government departments plus a secondment at a small charity. I applied for a permanent role at DIT during my third year on the Fast Stream programme and have been here ever since."
        },
        {
            "heading": 4,
            "text": "What inspired you to change career paths to be a DDaT professional?"
        },
        {
            "text": "The content management system used at the charity was so difficult that I had to learn basic HTML to write and publish updates on the website. I found that I enjoyed figuring out how to make the code work and decided that I wanted to work in digital. When I realised that the Civil Service had a DDaT Fast Stream pathway, this seemed like a great opportunity to switch to a different specialism while fulfilling my long-term ambition to join the Civil Service. I really appreciate that the Civil Service took me on based on potential, rather than expecting me to already have digital experience."
        },
        {
            "heading": 4,
            "text": "What advice would you give someone looking to make the move? "
        },
        {
            "text": "At the time of making my career change, I was well established in my role and took a step down in seniority and pay to make the move. However, I figured that it was worth it to allow me to learn a new specialism, and it definitely was."
        },
        {
            "text": "Don’t worry if your career path isn’t always on an upward trajectory: I genuinely think that it's more important to enjoy what you do. It’s ok to take a bit of time to achieve your next career goal!"
        },
        {
            "heading": 3,
            "text": "Stephen Corder, Senior Product Manager"
        },
        {
            "heading": 4,
            "text": "What did you do before your current job role?"
        },
        {
            "text": "Before working in DDaT, I held various operational roles within the Department for Work and Pensions (DWP). These roles were very diverse, from Child Maintenance to Universal Credit. My final role in DWP was training Work Coaches in Jobcentres and Contact Centre colleagues, before I was successful in joining the Civil Service DDaT Fast Stream."
        },
        {
            "heading": 4,
            "text": "What inspired you to change career paths to be a DDaT professional?"
        },
        {
            "text": "I’d been introduced to an early form of DDaT when I was working on the Child Maintenance change programme in 2011. In this role, I really started to enjoy and appreciate the importance of building services that made the lives of citizens easier. This job was only temporary, but my interest continued into my next role as a trainer at DWP. When an opportunity arose to apply for the Civil Service Fast Stream and its DDaT profession, I leapt at the chance."
        },
        {
            "heading": 4,
            "text": "What advice would you give someone looking to make the move?"
        },
        {
            "text": "Working in DDaT isn’t about the qualifications you have, but the qualities you possess. I would start by diving into the digital Civil Service blogs that exist. Every department has one, and you can learn more about their ongoing projects. I would also reach out to DDaT and see if you can shadow a team for a day, as there is nothing better than seeing it all firsthand."
        },
        {
            "heading": 3,
            "text": "Feeling inspired?"
        },
        {
            "text": "It’s never too late to make a change! There is a role for everyone in the DDaT team, regardless of your skills, knowledge, and experience."
        }
    ]
}