{
    "url": "https://naturalengland.blog.gov.uk/2021/12/21/tony-juniper-second-term-is-a-chance-to-strengthen-partnerships-for-natures-recovery/",
    "title": "Tony Juniper: second term is a chance to strengthen partnerships for Nature’s recovery",
    "authors": [
        "Tony Juniper"
    ],
    "categories": [
        "Natural England"
    ],
    "pub_date": "2021-12-21T13:57:01+00:00",
    "content": [
        {
            "text": "Tony Juniper CBE, who has been reappointed as Chair of Natural England for a second term, reflects on the past three years and the opportunities that lie ahead"
        },
        {
            "text": " "
        },
        {
            "text": "Back in 2019 I was honoured and delighted to be selected as the new Chair of Natural England. Since I came to lead the organisation we have made significant progress in restoring energy and direction, created a new strategic plan and mission and secured a major increase in resources to achieve England’s new ambition for Nature recovery."
        },
        {
            "text": "This has included work to align our functions firmly behind the Government’s 25 Year Environment Plan, especially the vital aim to create a national Nature Recovery Network (NRN), a framework presenting opportunities to orchestrate (in a far more strategic and impactful way than was hitherto the case) a wide range of different policies and partnerships."
        },
        {
            "text": "Contributing to this broad goal have been a number of specific steps, including the declaration of major new National Nature Reserves, such as the Purbeck Heaths in Dorset, and significant new Sites of Special Scientific Interest, such as Swanscombe Peninsula in Kent and Cotswold Water Park, straddling Oxfordshire, Wiltshire and Gloucestershire. We are also putting in train a series of landscape-scale Nature recovery projects and gearing up to make the most of the new Local Nature Recovery Strategies that will come in the wake of the Environment Act 2021 (and to which we were Government advisers)."
        },
        {
            "text": "Since 2019 we have also begun a process to reinvigorate our landscapes work, including beginning to consider extending two existing Areas of Outstanding Natural Beauty (AONBs) and creating two new ones, and exploring new landscape approaches for other parts of England, especially in towns and cities. We have also strengthened joint delivery with Areas of Outstanding Natural Beauty and National Parks, increasing our capacity to work with these bodies and, through a Joint Delivery Agreement between Natural England, the National Association for AONBs and National Parks England, we have focused cooperation for Nature recovery, increasing people’s enjoyment of these wonderful places and addressing climate change questions."
        },
        {
            "text": "This work has in part been assisted through our efforts to facilitate land managers’ involvement with agri-environment schemes, which reward practices contributing to Nature conservation and recovery. Natural England’s experience with these programmes has also enabled us to work with Defra on the design of the new Environmental Land Management policy. On top of this vital area of work, we have been active in many other spheres where new policy has recently been shaped, such as on peatlands, trees and biodiversity net gain. The latter policy, which will be implemented soon, was also underpinned by the Environment Act, as was the new tool of conservation covenants, creating a legal basis for long-term agreements for Nature recovery."
        },
        {
            "text": "In parallel with these efforts geared to sustainable land management, we have been taking forward activities geared to species recovery. This has included our leadership role in the Back from the Brink coalition, assisting with the recent consultation on the reintroduction of Beavers, and also licensing the release of White-tailed Eagles on the Isle of Wight, and much else besides. Much more will follow."
        },
        {
            "text": "Finding ways to better connect more people with the natural world has also been a strong new theme at Natural England. This is for reasons of the huge social benefits that come from being in wildlife-rich green spaces, and also the extent to which such experiences encourage people to support pro-environmental behaviour. As the on-going COVID 19 pandemic takes its toll, one source of solace that many have found is being outside enjoying Nature. Making a very practical contribution in this respect has been our continuing work to set up the longest coastal walking trail in the world – the England Coast Path – and our enduring commitment to supporting National Trails."
        },
        {
            "text": "Hard though we have worked, our success as a nation in restoring Nature cannot rest on an official body like Natural England: it relies on achievements through partnerships, which we have explicitly recognised in our new mission of ‘Building Partnerships for Nature’s Recovery’. To that end we have been deepening our collaboration with partners and stakeholders, from conservation NGOs to farming interests, and from other government departments and agencies to private sector organisations, including in water and housing companies. One step to enable stronger partnership working has been the establishment of the NRN Delivery Partnership, which has brought together more than 600 organisations. To facilitate action on the ground we have been increasing the capacity of our 12 Area Teams."
        },
        {
            "text": "The progress we have made has been against the backdrop of a number of complex challenges. These include the work we do to license wildlife management. I am not alone in being very reluctant to sanction the killing of any animal, but there are reasons why at times this is necessary – to protect threatened species, such as wader eggs and chicks from predators, to safeguard public safety, such as controlling birds on airfields to avoid collisions with aircraft, and to protect vital industries, such as farming. Finding the correct accommodation between the threat posed and the licensing action to deal with it is a very difficult and often controversial task. This includes the licensing of the Government’s policy to cull Badgers to protect the dairy and beef sectors from Bovine TB."
        },
        {
            "text": "Linked with this has been the challenge of establishing the right mix of actions to assist the recovery of species such as Hen Harriers. These birds have suffered from persecution, to the point where their recovery, and indeed survival as a breeding species in England, has been in doubt. In the midst of highly polarized views, we have nonetheless for the last three years seen increasing breeding success in the English uplands, which I hope is a trend that will continue, despite setbacks seen in the continuing illegal killing of these birds."
        },
        {
            "text": "Having worked as an environmentalist in many different roles for 37 years (including 18 years at Friends of the Earth), I find the work I do with the team at Natural England both demanding and very rewarding. It is a complex job we are doing, with many moving parts, numerous policies, many partners and a wide diversity of priorities. We are making progress though, and as I approach the completion of a first term as Chair I see a transition from rebuilding the organisation and establishing a new plan to one where we shift the emphasis more toward implementation of our shared national ambitions for Nature recovery, including the stretch target to have 30 per cent of England’s land and sea managed for Nature by 2030."
        },
        {
            "text": "I regard my reappointment as a strong vote of confidence in both the work that the whole of Natural England has undertaken in the last three years, and in the direction in which we are heading. I am grateful for the support we have had from Ministers, including the Prime Minister, and would like to thank the Natural England Board, executive and staff and also our many partners and stakeholders for all their support and collaboration during my first term as Chair, and look forward to doing even more together during my second term."
        }
    ]
}