{
    "url": "https://moderncivilservice.blog.gov.uk/2023/10/23/building-a-skilled-civil-service/",
    "title": "Building A Skilled Civil Service",
    "authors": [
        "A Modern Civil Service"
    ],
    "categories": [
        "Uncategorized"
    ],
    "pub_date": "2023-10-23T13:31:19+01:00",
    "content": [
        {
            "text": "A key part of A Modern Civil Service is constantly improving our skills. There’s lots of support available to help colleagues do this already, with more opportunities launching soon across the Civil Service. "
        },
        {
            "heading": 3,
            "text": "Why skills matter"
        },
        {
            "text": "Every day, the work we do helps deliver brilliant public services to millions of people across the United Kingdom, making a huge difference for so many of our customers. To help us do this, a range of improvements to how we work, learn and progress are being delivered, as part of A Modern Civil Service. "
        },
        {
            "text": "Whether it’s cross-government learning events like One Big Thing, a day of data training for all civil servants or simply taking up all our training days, there’s lots that we can do to keep our skills and knowledge up to date. "
        },
        {
            "text": "If you are a civil servant, please look on the intranet of your organisation to find out and access the training opportunities or talk to your line manager about it. You can also log onto Government Campus to sign up for training opportunities "
        },
        {
            "text": "Providing more opportunities wherever people are based is also important if we’re to harness the skills people have across the Civil Service. From the new Policy Campus in Sheffield to the new Regional Fast Stream pilots, the Civil Service is committed to making a wider range of job roles available across the UK."
        },
        {
            "text": "Alex Chisholm, the Civil Service Chief Operating Officer (pictured above), spoke at Civil Service Live in July 2023 about the importance of skills in A Modern Civil Service:"
        },
        {
            "text": "“We want to be a skilled Civil Service that can adapt to the needs of the public we serve” Alex said. “We want to be representative of the communities we work for, with a thriving presence across the country, providing opportunities for colleagues wherever they are based. That’s part of our vision for A Modern Civil Service, one that all Permanent Secretaries share and one we’re working hard to deliver.”"
        },
        {
            "heading": 3,
            "text": "Ways to build Civil Service skills "
        },
        {
            "text": "A number of changes are being delivered across the Civil Service too, to help colleagues grow their skills and expand opportunities around the UK:"
        },
        {
            "text": "We are also taking more steps to ensure opportunities to progress, collaborate and build skills are available across all regions:"
        }
    ]
}