{
    "url": "https://forestrycommission.blog.gov.uk/2023/10/23/developing-the-means-to-manage-woodlands/",
    "title": "Developing the means to manage woodlands",
    "authors": [
        "Rosanna Curtis"
    ],
    "categories": [
        "Woodland management"
    ],
    "pub_date": "2023-10-23T11:04:19+01:00",
    "content": [
        {
            "text": "Did you know that only 50% of our private woodlands are actively managed[1] [2]?"
        },
        {
            "text": "It is well known that active, sustainable management increases the benefits that woodlands provide, including biodiversity, flood alleviation, timber production, water quality, soil health, air quality, carbon sequestration, climate change resilience, landscape protection, food productivity and health and wellbeing through recreation facilities. In the face of climate change and the UK being the second largest net importer of timber in the world, behind China, there is an urgent need to increase and improve the flow of these benefits for the advantage of society, the environment, and the economy."
        },
        {
            "heading": 3,
            "text": "Exploring the barriers to managing woodland"
        },
        {
            "text": "The sector and woodland owners, however, report several barriers that hinder or prevent woodlands from being actively managed. These include:"
        },
        {
            "text": "The importance of – and the barriers to – woodland management are well reported on[3][4][5][6].\nPart of the Forestry Commission’s response to stimulate management in woodlands is to develop innovative solutions to overcome the hurdles woodland owners face."
        },
        {
            "text": "Through the Forestry Commission’s Woods into Management Forestry Innovation Funds (WiMFIF), £7.6million has been awarded towards 62 projects with the aim to support innovative approaches in bringing our woods back into active, sustainable management."
        },
        {
            "heading": 3,
            "text": "Northwoods Innovation Programme supports innovation in woodland management"
        },
        {
            "text": "The Northwoods Innovation Programme is one such project. Running until March 2025, the multi-faceted programme aims to increase active woodland management in the North East and North Yorkshire by developing, disseminating, and supporting innovation to help overcome barriers and support woodland owners to actively manage their woodlands."
        },
        {
            "heading": 3,
            "text": "Developing innovative tools"
        },
        {
            "text": "As part of The Northwoods Programme, the Sylva Foundation are developing the tools available on their leading forestry mapping platform, myForest, which allows woodland owners and managers to map, create, and manage woodlands. With the support of Northwoods, myForest now provides owners and agents with the ability to download woodland maps and accurately plot features whilst using handheld devices out in the field. This development saves woodland owners and managers time, a key barrier to woodland management."
        },
        {
            "text": "Accurate woodland maps are of vital importance for woodland management plans and monitoring woodlands. They also reduce the risk of management operations to landowners, agents, and contractors thus improving outcomes for all."
        },
        {
            "text": "Woodland inventories, a record of what is in the woodland, help to inform management decisions and help achieve woodland owner objectivesThrough Northwoods, Sylva Foundation are developing an improved woodland inventory tool to help owners undertake inventories of their woodlands. The inventory tool seeks to combine classic woodland management data and techniques with an intuitive interface. This allows woodland owners to build woodland inventories and improve their knowledge of their woodlands and build confidence to make decisions quickly and accurately."
        },
        {
            "heading": 3,
            "text": "Supporting innovators"
        },
        {
            "text": "The Northwoods Innovation Programme is delivered by a consortium of experts with a wide range of experience and knowledge on woodland management, business development, and supply chains. These experts are supporting those seeking to develop solutions to management barriers. For example, forward thinking individuals and organisations are looking to develop their business offerings and purchase new equipment to undertake a wider range of forestry services, particularly in smaller woodlands. Northwoods are supporting them to understand different financing options."
        },
        {
            "text": "Other examples of innovators supported by the Northwoods Programme are those looking to develop markets and improve the economics of woodland management to enable woodland owners to undertake management activities from management plans, biodiversity surveys, and physical operations. The avenues being investigated are looking to provide markets to diseased material, sourcing local residues to replace imported materials, offering leisure and recreation facilities, and adding value to brash products. Improving funding options for management activities helps to improve the quality of active management. Grant funding often helps owners on the first steps of their woodland management journey, but income derived from woodland management helps to justify time spent on applying to grants and appointing services."
        },
        {
            "text": "If you have an idea that could be developed to help bring more woodlands into management, our team at Northwoods would love to hear from you."
        },
        {
            "heading": 3,
            "text": "Communicating the benefits of and tools to woodland management"
        },
        {
            "text": "Northwoods Innovation Programme is sharing the work carried out through the project and also the work being done by other innovators who are finding ways to overcome barriers and manage woodlands. The Programme runs a series of networking and demonstration events and webinars, to share examples of activities and tools that innovators and owners are undertaking to bring more woodlands into management."
        },
        {
            "text": "On our website you can find a variety of articles, resources, case studies, and signposting pages to inform you of innovative developments, examples of woodlands previously unmanaged brought into management, and where to go for advice and support including expertise, selling timber, training, and woodland creation."
        },
        {
            "text": "To find out more about Northwoods, its Innovation Programme, and to stay in touch with our project, head to our website, sign up to our newsletter or email northwoods@reheat.uk.com. We hope that you find something of interest and hope to see you involved in the programme in the future as we try to improve the quality and quantity of woodlands in active management."
        },
        {
            "heading": 3,
            "text": "Notes"
        },
        {
            "text": "[1] Sustainably managed is woodland managed to the UK Forestry Standard that has a Woodland Management Plan, or for which Forestry Commission have provided a grant or felling licence in the last 15 years."
        },
        {
            "text": "[2] Forestry-Commission-Key-Performance-Indicators-Report-2022-23.pdf (publishing.service.gov.uk)"
        },
        {
            "text": "[3] Northwoods"
        },
        {
            "text": "[4] British Woodlands Survey – Sylva Foundation"
        },
        {
            "text": "[5] Bringing Woodland into Management: the missed opportunities in England and Wales - Royal Forestry Society (rfs.org.uk)"
        },
        {
            "text": "[6] Management-of-Existing-UK-Woodlands-An-Opportunity-for-Green-Prosperity.pdf (charteredforesters.org)"
        }
    ]
}