{
    "url": "https://naturalengland.blog.gov.uk/2023/10/23/enhancing-access-to-green-blue-spaces-for-people-with-visual-impairment/",
    "title": "Enhancing Access to Green & Blue Spaces for People with Visual Impairment",
    "authors": [
        "Natural England"
    ],
    "categories": [
        "Mental health and wellbeing",
        "Natural England",
        "Science and evidence",
        "Uncategorized"
    ],
    "pub_date": "2023-10-23T11:55:59+01:00",
    "content": [
        {
            "text": "Natural England's mission is 'Building partnerships for Nature recovery,' and we are passionate about building partnerships that make outdoor recreation activities available to everyone. Our commitment to the Equality Act 2010 underscores our dedication to inclusivity in all our endeavours. That’s why we’ve worked with our partners to shine a spotlight on the importance of inclusive nature experiences with the release of a new report that focuses on improving access to green and blue spaces, (including rivers, lakes and the sea), for people with visual impairments."
        },
        {
            "text": "Why Access to Nature Matters"
        },
        {
            "text": "The connection between access to nature, engagement with the environment, and overall physical and mental wellbeing is widely acknowledged. Natural England’s People and Nature survey 2023 reports that 92% of adults who visited a green and natural space in the past 14 days said it was good for their physical health, and 91% said it was good for their mental health."
        },
        {
            "text": "However, certain groups still face significant barriers when it comes to experiencing the enjoyment and benefits of natural spaces. In the UK, nearly 80% of individuals with visual impairments are aged 65 or older, and by 2050, one in five people will encounter sight loss in their lifetime. Each day, 57 people in England alone register with local authorities as blind or partially sighted, with a third of them also living with additional disabilities. People with one or more impairments tend to have lower levels of activity and wellbeing, making it imperative that we strive for inclusivity in nature access for all."
        },
        {
            "text": "Driving Change Through Research Initiatives "
        },
        {
            "text": "Our mission to enhance inclusivity led us to collaborate with the Research Institute for Disabled Consumers (RiDC), Oxfordshire County Council, the University of Oxford, and MyVision Oxfordshire. Together with valued partners including Fight for Sight/Vision Foundation, Royal National Institute of Blind People (RNIB), Guide Dogs, Disabled Ramblers, The Ramblers, Reading Association for the Blind, and Open Country, we embarked on a journey to understand the unique needs and preferences of people with visual impairments as they seek to access green and blue spaces."
        },
        {
            "text": "Key Research Findings"
        },
        {
            "text": "The research, which involved a large-scale survey and insightful focus groups, uncovered several critical challenges faced by individuals with visual impairments when trying to access and enjoy green and blue spaces:"
        },
        {
            "text": "\nEmbracing Inclusivity: Our Recommendations"
        },
        {
            "text": "In response to these findings, the report presents a range of recommendations designed to equitably enhance accessibility to green and blue spaces, benefiting not only visitors with visual impairments but also individuals with disabilities more broadly:"
        },
        {
            "text": "The report underscores the need for a wide ranging approach to improve green and blue space accessibility for people with visual impairments. By implementing these recommendations, we can work towards a more inclusive and equitable experience of nature for all."
        },
        {
            "text": "Access the full report here: Creating More Accessible Green & Blue Spaces: Understanding the experiences of people with visual impairments that visit green and blue space"
        }
    ]
}