{
    "url": "https://levellingupadvisorycouncil.blog.gov.uk/2023/10/23/how-innovation-can-support-levelling-up/",
    "title": "How R&D and innovation can support levelling up",
    "authors": [
        "luacsecretariat"
    ],
    "categories": [
        "Uncategorized"
    ],
    "pub_date": "2023-10-23T07:00:05+01:00",
    "content": [
        {
            "text": "By Dr Hayaatun Sillem CBE, Chief Executive Officer, Royal Academy of Engineering, and Member of the LUAC"
        },
        {
            "text": "In a striking red brick building in Belfast’s city centre, you’ll find a thriving community of tech entrepreneurs. And in the middle of this exemplar of today’s innovation economy, you’ll also find two rather incongruous Victorian bathtubs, harking back to the original purpose of the building. Ormeau Baths were established in 1888 to provide local families with access to bathing facilities and over subsequent years went through a series of reinventions culminating in their current manifestation as a vibrant community space for innovators and accelerators, including the Northern Ireland branch of the Royal Academy of Engineering’s Enterprise Hub."
        },
        {
            "text": "Down the road, an equally dramatic reincarnation has created the Titanic Quarter of Belfast, home to Catalyst, Northern Ireland’s Science Park; CSIT, the UK’s Innovation and Knowledge Centre for cyber security at Queen’s University Belfast; myriad startups and scaleups; over 100 national and international businesses including Citi, Microsoft, SAP and Amazon; as well as Spirit AeroSystems and Harland and Wolff, which share a proud history of over 125 and 160 years respectively of engineering heritage. It isn’t hard to see why Titanic Quarter has become the beating heart of Belfast’s Innovation District."
        },
        {
            "text": "This story of creative reinvention is mirrored many times across the UK. In Roman times, Cheshire was a centre of excellence in salt mining. This thread can be traced through to today’s successful chemicals and pharmaceutical industry in the county, which hosts Alderley Park, the UK's largest single-site life science campus[1]."
        },
        {
            "text": "In South Derbyshire, the industrial revolution saw a transition from textiles to a focus on iron and steel production, in turn underpinning contemporary strengths in manufacturing and logistics. Benefitting from a close relationship with neighbouring Derby where manufacturing giants such as Rolls-Royce aerospace, JCB and Alstom are located, South Derbyshire is key to their supply chains. This proximity to R&D and advanced manufacturing brings high-skilled jobs and supporting employment and training opportunities, many delivered collaboratively between the area’s major businesses and the University of Derby."
        },
        {
            "text": "More broadly, UK universities have played significant roles as anchor institutions for regional innovation economies. In Glasgow, the University of Strathclyde has become a magnet for collaborative R&D with industry, attracting £23 million from the private sector in research grants and contracts in 2021/22[2]. While Academy research in collaboration with Beauhurst has demonstrated strong growth in university spinouts beyond the ‘golden triangle’, with the local authorities of Manchester, City of Bristol and Edinburgh performing particularly well over recent years[3]."
        },
        {
            "text": "In each of these examples, R&D and innovation are fuelling the creation of jobs and growth that make a tangible difference to local communities. There is natural interest in the spatial distribution of public investment in R&D across the UK, and the Levelling Up White Paper commitment to increase the share of R&D funding outside London and the South East provides a valuable policy lever to drive progress towards a more balanced picture. However, it’s also important to realise that the delivery of economic and social benefit from R&D is a slow and complex process, and changing the distribution of R&D funding will not by itself deliver improvements in the lives of those in underserved regions, especially in the near term."
        },
        {
            "text": "It is therefore vital to sharpen our focus on ways to capture more value from our national strengths in R&D in places which haven’t historically felt those benefits. And this matters not just to help those regions catch up, but also to mitigate the risk that they will lose further ground in the years ahead. We live in an era where the pace of technology development can feel overwhelming even for those who are driving it. The recent explosive growth in uptake of generative AI, most notably through ChatGPT, has provided irrefutable evidence of the extent to which disruptive technologies are transforming business models, markets and lifestyles in a profound way – and developments continue apace."
        },
        {
            "text": "While there are many UK organisations at the leading edge of technology development, and others are rapidly learning how to assimilate these innovations, the gap between those at the frontier and the rest of the pack is growing. Productivity in UK companies already lags behind key comparators and sluggish adoption of today’s innovative technology will further erode our competitiveness – a prospect we can ill afford, especially since the UK’s highly internationalised R&D system makes us unusually dependent on inward investment and decisions taken by global companies. Unless we are proactive in building the capacity of those behind the frontier to participate in this new economy, we risk exacerbating inequality and cancelling out the benefits of other Levelling Up interventions."
        },
        {
            "text": "Fortunately, we have several levers at our disposal to increase our capacity to grow our innovation economy across the UK. These include targeted skills interventions, as has happened for nuclear skills in Cumbria; better harnessing public procurement to stimulate local innovation and support technology diffusion; and creating concierge services, based in regions targeting inward investment into R&D and associated manufacturing, to make it easier for businesses to understand and access a joined-up public sector offer."
        },
        {
            "text": "Alongside these, there is a great opportunity – particularly following the confirmation that the UK is rejoining Horizon Europe, the largest and most important R&D partnership globally – for the UK to upgrade its innovation pitch deck to the world. With our powerful legacy of industrial transformation across the UK, and our position at the forefront of the development of many of the most disruptive technologies, we have the chance to position ourselves as an innovation supercluster. With an array of universities, science and industrial parks, startup ecosystems, corporate R&D centres, public sector research establishments and NHS facilities studded across a landmass that is just over half the size of California, we are a nation with one of the highest densities of innovation assets globally."
        },
        {
            "text": "Back in Ormeau Baths, celebrations are continuing following the US$4M raise by resident startup Enzai: one of Northern Ireland’s largest seed investments. Not only is this providing a great boost of confidence for the NI engineering and tech community, but as Enzai’s focus is on accelerating safe and trustworthy AI, it has the potential to deliver benefits at a national and global scale, brilliantly exemplifying why nurturing our regional innovation economies is a win-win for everyone."
        },
        {
            "text": "[1] Engineering Economy and Place, Royal Academy of Engineering and Metro Dynamics, 2023 https://raeng.org.uk/eep"
        },
        {
            "text": "[2] https://www.hesa.ac.uk/data-and-analysis/finances/income#research"
        },
        {
            "text": "[3] Spotlight on spinouts, Royal Academy of Engineering and Beauhurst, 2023 https://raeng.org.uk/media/mlgnaqv1/spotlight-on-spinouts-2023-uk-academic-spinout-trends.pdf"
        }
    ]
}