{
    "url": "https://defrafarming.blog.gov.uk/2023/10/23/leven-carrs-wetland-broadening-our-ambitions-with-landscape-recovery/",
    "title": "Leven Carrs Wetland: broadening our ambitions with Landscape Recovery",
    "authors": [
        "Sarah Aitken"
    ],
    "categories": [
        "Payments to restore landscapes and ecosystems"
    ],
    "pub_date": "2023-10-23T10:03:09+01:00",
    "content": [
        {
            "text": "I’m Sarah, the project manager for the Leven Carrs Wetland project near Beverley in East Yorkshire."
        },
        {
            "text": "In this post, I’ll shine a light on our Landscape Recovery project."
        },
        {
            "text": "We want to transform the area into a landscape-scale, dynamic wetland which is home to an abundance of wildlife and sits alongside sustainable farming practices and food production."
        },
        {
            "text": "Leven Carrs is in East Yorkshire, approximately 10 miles north of Hull and the Humber estuary. As well as being one of the UK’s busiest ports, it is an internationally important site for wildlife. "
        },
        {
            "text": "Sitting in the River Hull floodplain, Hall Farm, the site of the Leven Carrs wetland, was once a vast expanse of wet grassland, marsh and open water. "
        },
        {
            "text": "Following a long history of land use for agriculture, the site is now a mix of drained high input arable farmland and 135 hectares of wetland where water levels are managed through a system of pumps.  "
        },
        {
            "text": "It’s a complex site with peat soils, a 12-turbine windfarm and a Site of Special Scientific Interest (SSSI) running through the boundary. "
        },
        {
            "text": "Over the years, we’ve worked to reverse declines in biodiversity with the help of Countryside Stewardship, but through Landscape Recovery we seek to broaden our ambition. "
        },
        {
            "heading": 2,
            "text": "Understanding the full potential of the land"
        },
        {
            "text": "The great thing about Landscape Recovery is that it gives us the chance to really understand the full potential of the land. "
        },
        {
            "text": "It enables us to try new things and identify which actions work best on the land to deliver the outcomes we want: sustainable water management, carbon storage, biodiversity enhancement, nature recovery, climate adaptation, social benefits, employment opportunities, diversifying food production and more. "
        },
        {
            "text": "I mentioned there is already a wetland on the project site, so you might wonder why we want to create more. "
        },
        {
            "text": "More, better quality wetland habitats including reedbed, pools, wet grassland and small carr woodland (wet woodland characterised by willows, birches and alder that thrive in soils with poor drainage) would provide homes for wildlife, including the threatened water vole (more on that later), space for people to enjoy and grazing land for farming livestock. "
        },
        {
            "text": "The site has a range of natural hydrological and topographical features which make this a perfect place to work with nature."
        },
        {
            "text": " For example, the geology, elevation and landform of the site means water can be stored easily. This means the land is well suited to become a wetland habitat, but it is more of a challenge to farm with an arable rotation. "
        },
        {
            "heading": 2,
            "text": "Farming "
        },
        {
            "text": "Farming in this area is central to the local economy and community. It’s also the mainstay of our business in the area, so it will always be part of our plans. "
        },
        {
            "text": "The farm is currently an intensive arable farm, but there are other exciting options which could allow us to farm in a more sustainable, environmentally-friendly way while still producing food and creating jobs. "
        },
        {
            "text": "For example, livestock farming for sustainable meat and crops such as lettuce or watercress which prefer wetter soil around the wetland sites. "
        },
        {
            "text": "Other products from 'wet farming’ include bioenergy, building materials, clothing, and biodegradable food packaging to name a few. "
        },
        {
            "text": "Rewetting peatland for wet farming also has wider environmental benefits. When peatlands are drained, they emit carbon due to the decomposition of organic matter. That’s why damaged peatlands are a major source of greenhouse gas emissions. "
        },
        {
            "text": "If we wet farm our peat soils we can help peat to restore and accumulate, reducing carbon emissions. "
        },
        {
            "heading": 2,
            "text": "People "
        },
        {
            "text": "The wider area’s rich history, beautiful landscapes, and miles of walking paths make it popular with locals and visitors alike. We’re pleased to be a small part of this tapestry. "
        },
        {
            "text": "The project will require a large team of local employees working together to support the wetland and farming enterprises, boosting economic resilience, as we tackle the challenges of climate change."
        },
        {
            "text": " Tourism and recreation opportunities including public access routes, visitor infrastructure, and green social prescribing in conjunction with hospitals and doctor’s surgeries are all in the mix as we investigate what’s possible. "
        },
        {
            "text": "We hope to create a green space for locals to visit, enjoy, volunteer and be proud of. The social benefits of the project are as important as any other. "
        },
        {
            "heading": 2,
            "text": "Biodiversity "
        },
        {
            "text": "Healthy wetlands support an abundance of plant life. They also provide shelter, nurseries and breeding grounds for wildlife. "
        },
        {
            "text": "As a species recovery project, several species are predicted to benefit from our proposals, but our target species is the water vole. "
        },
        {
            "text": "The water vole has declined by 94% since the 1960s. This is due to habitat degradation and fragmentation leading to the isolation of populations. This issue is further exacerbated by American mink predation.  "
        },
        {
            "text": "By improving the network of ditches, we can create a safer habitat mosaic to attract more water voles into the area, as well as boosting their breeding success. "
        },
        {
            "text": "With the project area linking the nationally important protected sites of the river Hull, Leven Canal, Pulfin Bog and Tophill Low, and the internationally important Humber estuary to the south, it’s also a potential hotspot for breeding waders. It's also a stone’s throw away for wintering and passage birds.  "
        },
        {
            "text": "Many more insects, mammals and freshwater species will also benefit from the plans. "
        },
        {
            "heading": 2,
            "text": "Other ecosystem services "
        },
        {
            "text": "We hope to achieve great things for both wildlife and people, but there are wider, and perhaps less obvious, benefits that our project will create. "
        },
        {
            "text": "For example, carbon storage and flood risk management could also contribute to the UK’s broader climate change commitments, not to mention a drop in emissions as we change the way we farm.  "
        },
        {
            "heading": 2,
            "text": "Our progress "
        },
        {
            "text": "We’re in the development phase at the moment. We have until 31 December 2024 to complete our feasibility studies. We're surveying what we have on site currently and its condition. This includes habitats, species, water quality, water sources and carbon storage."
        },
        {
            "text": "We're working with experts who use this data to design a landscape-scale wetland and create a robust business model which is based on the site’s potential ecosystem services. "
        },
        {
            "text": "Some of the work is pretty sizeable, for example, sinking 30 metre boreholes, measuring peat depths over the entire site, or laying a thousand water vole rafts. When the water voles run across the rafts, they leave droppings and we get excited because it means they’re there! "
        },
        {
            "text": "Other work is less gruelling. For example, I'll be in my wellies collecting water samples from the drains, ditches and pools on site –  with the odd bit of bird watching in between! "
        },
        {
            "text": "As we conduct studies on the site, we’ll learn more about what’s possible, and we’ll be able to make informed decisions about the land use and management at Hall Farm. "
        },
        {
            "heading": 2,
            "text": "Our partners "
        },
        {
            "text": "A steering group of experts from governmental and non-governmental organisations provide advice and guidance to the project through monthly steering group meetings. "
        },
        {
            "text": "We’ve been very fortunate to have their input and their expertise is of enormous value. "
        },
        {
            "text": "They are representatives from Albanwise Farming Ltd, Natural England, the Environment Agency, Forestry Commission, Beverley and North Holderness Internal Drainage Board, Yorkshire Water, Yorkshire Wildlife Trust, East Riding of Yorkshire Council and Albanwise Wallace Estates Ltd."
        },
        {
            "text": " We plan to work with them throughout the project and, if successful, into the next phase of the scheme when we get to put our plans into action. "
        },
        {
            "heading": 2,
            "text": "The future  "
        },
        {
            "text": "If we’re successful and we progress to the next stage, the implementation phase, we’ll need to make sure we can fund the work from 2025 well into the future (30+ years). "
        },
        {
            "text": "Securing private finance is crucial to the success of the project so we’re working hard to do just that. Conversations with a range of organisations are in the early stages and we are always keen to hear from people interested in supporting the restoration of this special landscape. "
        },
        {
            "text": "If you have any questions about our project or Landscape Recovery in general, leave a comment below. "
        }
    ]
}