{
    "url": "https://prisonjobs.blog.gov.uk/2023/10/23/making-an-impact-working-as-a-probation-services-officer/",
    "title": "Making an impact: Working as a probation services officer",
    "authors": [
        "Ministry of Justice"
    ],
    "categories": [
        "Probation"
    ],
    "pub_date": "2023-10-23T16:21:18+01:00",
    "content": [
        {
            "heading": 3,
            "text": "Every day, HM Prison and Probation staff deliver brilliant work that helps keep our communities safe. We asked probation services officer, Jim, to tell us about his extraordinary work with offenders to support them, help reduce reoffending and protect the public."
        },
        {
            "text": "Can you explain the role of a probation services officer?"
        },
        {
            "text": "We maintain regular contact with offenders on probation to give them any help that we can – helping with rehabilitation and transitioning to life outside prison, and just being a support system for them as they readjust to normal life."
        },
        {
            "text": "By doing this, our ultimate aim is that they don’t reoffend, which helps protect the public."
        },
        {
            "text": "We also work with external agencies, to see where we can help offenders on probation find work, housing, training, education, etc. If we can help them find gainful employment, or improve their employment prospects or living conditions, it all helps towards making it less likely that they’ll reoffend in the future."
        },
        {
            "text": "Why did you join the Probation Service?"
        },
        {
            "text": "To be honest with you, a probation officer is not something I ever considered becoming. I just happened to chance upon an advert on Indeed.com. It wasn’t intentional but I was struck by the point the advert made."
        },
        {
            "text": "It was saying that they want people from all sorts of backgrounds, who’ve done all sorts of jobs, all levels of education, and all ages. I read through, and I thought, well, that sounds great, but let’s see if you mean it. And here I am."
        },
        {
            "text": "What motivates you in your role as a probation services officer?"
        },
        {
            "text": "I think when you get older, you start to reflect and look back and think ‘what have I done?’ and ‘what can I do?’ I hate to say ‘give back’ because it sounds so clichéd, but it is essentially that. You think ‘what can I do beyond just living my life for myself?’ So, the chance to make an impact motivates me."
        },
        {
            "text": "What do you enjoy the most about your role?"
        },
        {
            "text": "I’m enjoying the probation services officer role very much. It can be challenging, and of course, frustrating at times, however, I really do believe I’m doing something worthwhile. I think you would struggle to meet a nicer bunch of people than those working in probation. They are a really excellent, experienced team who go out of their way to help. And I can see the impact that they make on  lives, and that’s very inspiring."
        },
        {
            "text": "Is teamwork and the support of colleagues an important aspect of the role for you?"
        },
        {
            "text": "We do see a real impact from working together across the Probation Service. It is certainly not easy, but there are tangible results to see. And I think everybody plays a part in that. For instance, those at the front of house (reception) in our offices – they’re fantastic. Sometimes they have offenders, who may be anxious or agitated, come in and give them a hard time. So it’s not always an easy job but the team here are always so helpful and handle everything so professionally. Without them we couldn’t do what we do every day."
        },
        {
            "text": "Where can people find out more about your role?"
        },
        {
            "text": "Anyone interested in finding out about probation roles can visit Probation Service."
        }
    ]
}