{
    "url": "https://hmlandregistry.blog.gov.uk/2023/10/23/opening-the-door-to-easier-property-transactions/",
    "title": "Opening the door to easier property transactions",
    "authors": [
        "Michael Wadsworth, Founder, adoor"
    ],
    "categories": [
        "Data"
    ],
    "pub_date": "2023-10-23T11:00:15+01:00",
    "content": [
        {
            "text": "Property technology (PropTech) provider adoor joined the Geovation Accelerator Programme in October 2020 – a programme backed by HM Land Registry and Ordnance Survey which provides geospatial and PropTech start-ups with grant funding and 12 months of support. "
        },
        {
            "heading": 2,
            "text": "Why we set up adoor"
        },
        {
            "text": "Currently, transactions take over 151 days on average to complete and nearly half of transactions fell through in the first quarter of 2023. Conveyancers and estate agents are battling higher caseloads, with more enquiries, meaning they have less time to complete tasks."
        },
        {
            "text": "We’ve built adoor to help buyers, sellers, conveyancers and estate agents track the progress of property transactions from mortgage to moving day, whenever works for them."
        },
        {
            "text": "By enabling everyone to see the entire chain in one place online, we have seen users save up to seven hours per week in reduced admin. We’ve also seen fall-throughs reduce to almost zero with greater clarity and transparency made possible by tracking the chain in one place."
        },
        {
            "text": "We provide proactive notifications on upcoming tasks and give everyone the same view on progress. This reduces the need for chasing calls as you can see the next stage and its due date across the entire chain of transactions. Connecting services such as identity verification, anti-money laundering checks and property searches all within the adoor platform also saves time."
        },
        {
            "heading": 2,
            "text": "How we use data"
        },
        {
            "text": "We use HM Land Registry’s title numbers to validate each property on adoor and to get the title deeds. We also reference the UK House Price Index and Price Paid Data to track the trend of house sales and prices. The data from HM Land Registry is then combined with property data provided by property professionals, alongside the automated data we provide for the Energy Performance Certificate and the council tax band. We also work with Veya to show their title insights and risk scores that help property professionals focus enquiries and to give a heads up of potential issues, ultimately reducing fall-throughs and speeding up transactions."
        },
        {
            "heading": 2,
            "text": "What the Geovation programme did for us"
        },
        {
            "text": "We joined the Geovation Accelerator Programme in October 2020. Having access to this network and community during the peak of the COVID pandemic was especially helpful. Members of the Geovation team challenged our assumptions to craft a product that truly solves a problem. In addition, introductions to people within the industry helped us to get vital feedback, enabling us to improve the service before launch."
        },
        {
            "heading": 2,
            "text": "Building partnerships and reducing stress"
        },
        {
            "text": "For a small team of three, we’ve already achieved a lot! Most importantly, we have powerful partnerships with LEAP, Thirdfort, Veya, Search Acumen, AnyVan and Rhino Home Protect."
        },
        {
            "text": "Our partnerships have allowed us to create a central platform for property data and updates which was previously siloed between different systems and stakeholders. This data is infinitely more useful when shared - conveyancers can be instructed sooner and complete enquiries faster with the upfront property information collected, meaning there is less of a delay after the offer has been accepted. Estate agents can also track progress in the same place."
        },
        {
            "text": "By bringing everything onto one platform, there is no need to waste time finding folders, remembering passwords or having too many tabs open! We also hope to see this reduce the stress levels for property professionals."
        },
        {
            "heading": 2,
            "text": "What's next?"
        },
        {
            "text": "We’re about to announce our partnership with Just Move In – the home moving experts, handling removals and changing your utilities."
        },
        {
            "text": "We’re implementing version 2 of the BASPI (Buying and Selling Property Information) form created by the Home Buying and Selling Group. This aligns to the Property Data Trust Framework that standardises the format property data is shared in. Collecting this upfront property information helps to speed up property transactions by up to four weeks and reduces fall-throughs significantly as potential buyers know more at the point of making an offer."
        },
        {
            "text": "We’re continuing to develop our system with more integrations with case management systems and fellow PropTech providers, most recently with fellow Geovation alumni Veya."
        },
        {
            "text": "We will continue to collaborate with industry bodies and clients to refine and develop new features in our quest to make moving home easier for all."
        },
        {
            "text": "See our website for more information."
        }
    ]
}