{
    "url": "https://publicguardian.blog.gov.uk/2023/10/23/power-of-attorney-stories-maureen-and-petra/",
    "title": "Power of Attorney stories: Maureen and Petra  ",
    "authors": [
        "rebeccaparker1"
    ],
    "categories": [
        "lasting power of attorney",
        "LPA",
        "YourVoiceYourDecision"
    ],
    "pub_date": "2023-10-23T09:50:12+01:00",
    "content": [
        {
            "text": "[English] - [Cymraeg]"
        },
        {
            "text": "A lasting power of attorney (LPA) allows you to nominate someone you trust, known as an attorney, to step in if you lose the mental capacity to make certain decisions yourself. They are legal documents that cover decisions about health and welfare, or property and finance.  "
        },
        {
            "text": "Maureen, a retired teacher from Maghull, Sefton, and her daughter Petra both have an LPA. Maureen set hers up before a big holiday. Here, they share their story.   "
        },
        {
            "text": "Maureen was planning a trip to Australia with her husband to visit relatives when she found out about lasting powers of attorney. The couple both set up a property and finance LPA so their daughter Petra, and their son, could step in if something unfortunate happened during the holiday. "
        },
        {
            "text": " "
        },
        {
            "text": "After this, Maureen thought it would make sense to have a health and welfare LPA too. Having cared for elderly relatives in the past, Maureen wanted to make sure that if she was unable to make decisions about her care, she would be able to rely on her daughter Petra to do what was in her best interests. "
        },
        {
            "text": "  "
        },
        {
            "heading": 2,
            "text": "Maureen and Petra talked to us about how they raised the topic of planning for the future...  "
        },
        {
            "heading": 3,
            "text": " Where were you when you first had a conversation about making an LPA?  "
        },
        {
            "text": "Petra: Mum and I love a cuppa and our walks on Crosby and Formby Beach, where we have lots of good conversations as we stroll along, usually with my dog, Shep. It was on one of these beach walks that mum explained to me the reasons why she wanted me to be her attorney, together with my dad and brother.  I was so proud of mum and grateful that she was doing this. Not just for her but for me too, to make my life easier if she became unable to manage her affairs.  "
        },
        {
            "heading": 3,
            "text": "How did you decide who your attorneys would be? "
        },
        {
            "text": "Maureen: We both trust each other implicitly so it made perfect sense to choose close family as attorneys. With recent changes in circumstances, we’ve now also discovered that it’s easy to change who your attorneys are, if necessary.  "
        },
        {
            "heading": 3,
            "text": "How has having an LPA helped your relationship?  "
        },
        {
            "text": "Petra: Knowing that my mum trusts me to take care of her affairs is really comforting. My mum has always been so loving and reliable throughout my life. Knowing we both have LPAs registered gives us both a sense of security whatever the future holds.    "
        },
        {
            "text": " "
        },
        {
            "text": "It didn’t surprise me that mum was one of the first people I knew to have an LPA. She’s always been ahead of the curve. Back in the 1970s, I was the first kid in my class to have a duvet; to have a bean bag and to have Velcro on my clothes! Mum made all my clothes and she trained and became a needlework and home economics teacher in a secondary school when I was 5 years old.   "
        },
        {
            "text": " My mum has always been there for me through the ups and downs of life, so of course, I want to be there for her whenever she needs me.  "
        },
        {
            "text": "Maureen: As a family we discuss things about money openly, and I knew I could trust Petra which is so reassuring. We are very pragmatic and practical so once we knew about LPAs it just seemed obvious and common sense to get them sorted.  "
        },
        {
            "text": "Maureen and Petra are one of the many families across England and Wales that have made an LPA. It's never too early to talk about lasting powers of attorney with someone you trust. Start a conversation today.   Find out more at https://powerofattorney.campaign.gov.uk/.  "
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " [English] - [Cymraeg]"
        },
        {
            "text": "Mae atwrneiaeth arhosol (LPA) yn caniatáu i chi enwebu rhywun rydych chi’n ymddiried ynddo, a elwir yn atwrnai, i gamu i mewn os byddwch chi’n colli’r galluedd meddyliol i wneud rhai penderfyniadau eich hun. Maent yn ddogfennau cyfreithiol sy’n ymdrin â phenderfyniadau ynghylch iechyd a lles, neu eiddo a chyllid.  "
        },
        {
            "text": "Mae gan Maureen, athrawes sydd wedi ymddeol o Maghull, Sefton, a’i merch Petra, ill dwy, atwrneiaeth arhosol. Trefnodd Maureen ei un hi cyn mynd ar wyliau mawr. Yma, maen nhw’n rhannu eu stori.  "
        },
        {
            "text": "Roedd Maureen yn cynllunio taith i Awstralia gyda’i gŵr i ymweld â pherthnasau pan gafodd wybod am atwrneiaeth arhosol. Trefnoddy cwpl atwrneiaeth arhosol ar gyfer eiddo a chyllid er mwyn i’w merch Petra, a’u mab, gamu i mewn pe bai rhywbeth anffodus yn digwydd yn ystod y gwyliau. "
        },
        {
            "text": " Ar ôl hyn, credai Maureen y byddai’n gwneud synnwyr cael LPA iechyd a lles hefyd. Ar ôl gofalu am berthnasau oedrannus yn y gorffennol,roedd Maureen eisiau gwneudyn siŵr, pe na fyddai’n gallu gwneud penderfyniadau am ei gofal, y byddai’n gallu dibynnu ar ei merch Petra i wneud yr hyn a oedd er ei lles gorau. "
        },
        {
            "heading": 2,
            "text": "Siaradodd Maureen a Petra â ni am sut y gwnaethant godi pwnc cynllunio ar gyfer y dyfodol...  "
        },
        {
            "heading": 3,
            "text": "Ble oeddech chi pan gawsoch chi’r sgwrs gyntaf am wneud atwrneiaeth arhosol?  "
        },
        {
            "text": "Petra: Mae Mam a minnau wrth ein bodd gyda phaned wrth fynd am dro ar draeth Crosby a Formby, lle rydyn ni’n cael llawer o sgyrsiau da wrth i ni gerdded, fel arfer gyda fy nghi, Shep. Ar un o’r teithiau hyn ar y traeth, eglurodd mam i mi y rhesymau pam ei bod am i mi fod yn atwrnai iddi, ynghyd â’m tad a’m brawd.  Roeddwn i mor falch o mam ac yn ddiolchgar ei bod hi’n gwneud hyn. Nid yn unig iddi hi ond i mi hefyd, i wneud fy mywyd yn haws pe na bai’n gallu rheoli ei materion.  "
        },
        {
            "heading": 3,
            "text": "Sut wnaethoch chi benderfynu pwy fyddai eich atwrneiod?  "
        },
        {
            "text": "Maureen: Mae’r ddau ohonom yn ymddiried yn ein gilydd yn llwyr, felly roedd yn gwneud synnwyr perffaith i ddewis teulu agos fel atwrneiod. Gyda newidiadau diweddar mewn amgylchiadau, rydym bellach wedi darganfod hefyd ei bod yn hawdd newid pwy yw eich atwrneiod, os oes angen. "
        },
        {
            "heading": 3,
            "text": "Sut mae cael atwrneiaeth arhosol wedi helpu eich perthynas?  "
        },
        {
            "text": "Petra: Mae gwybod bod mam yn ymddiried ynof i ofalu am ei materion yn gysur mawr. Mae fy mam bob amser wedi bod mor gariadus a dibynadwy drwy gydol fy mywyd. Mae gwybod bod gan y ddau ohonom atwrneiaethau arhosol cofrestredig yn rhoi ymdeimlad o ddiogelwch i ni beth bynnag fydd yn digwydd yn y dyfodol.    "
        },
        {
            "text": "Nid oedd yn syndod i mi mai mam oedd un o’r bobl gyntaf roeddwn i’n ei hadnabod i gael atwrneiaeth arhosol. Mae hi wastad wedi bod ar y blaen. Yn ôl yn y 1970au, fi oedd y plentyn cyntaf yn fy nosbarth i gael duvet; i gael bag ffa ac i gael Velcro ar fy nillad! Roedd Mam yn gwneud fy holl ddillad, ac fe aeth drwy hyfforddiant a dod yn athrawes economeg y cartref a gwnïo mewn ysgol uwchradd pan oeddwn i’n 5 oed.   "
        },
        {
            "text": " Mae fy mam bob amser wedi bod yno i mi drwy gyfnodau da a drwg bywyd, felly wrth gwrs, rydw i eisiau bod yno iddi pryd bynnag y bydd hi fy angen i  "
        },
        {
            "text": "Maureen: Fel teulu, rydyn ni’n trafod materion ariannol yn agored, ac roeddwn i’n gwybod y gallwn i ymddiried yn Petra, sy’n galonogol iawn. Rydyn ni’n bragmatig ac yn ymarferol iawn felly ar ôl i ni wybod am atwrneiaethau arhosol, roedd trefnu hynny yn amlwg yn gwneud synnwyr.  "
        },
        {
            "text": " "
        },
        {
            "text": "Mae Maureen a Petra yn un o’r llu o deuluoedd ledled Cymru a Lloegr sydd wedi gwneud LPA. Dydy hi byth yn rhy gynnar i siarad am atwrneiaeth arhosol gyda rhywun rydych chi’n ymddiried ynddo. Dechreuwch sgwrs heddiw.   "
        },
        {
            "text": "Cewch ragor o wybodaeth yn https://powerofattorney.campaign.gov.uk/.  "
        },
        {
            "text": " "
        },
        {
            "text": " "
        }
    ]
}