{
    "url": "https://publicguardian.blog.gov.uk/2023/10/23/power-of-attorney-stories-shirin/",
    "title": "Power of Attorney stories - Shirin  ",
    "authors": [
        "rebeccaparker1"
    ],
    "categories": [
        "lasting power of attorney",
        "LPA",
        "YourVoiceYourDecision"
    ],
    "pub_date": "2023-10-23T09:55:10+01:00",
    "content": [
        {
            "text": "[English] - [Cymraeg]"
        },
        {
            "text": "A Lasting Power of Attorney (also known as an LPA) if a legal document that allows you to nominate someone you trust to step in and make decisions about your health and welfare and property and finance if you lack mental capacity to do so.   "
        },
        {
            "text": " Shirin Housee, aged 62, lives in South Birmingham with her husband and two children. She was a Senior Lecturer in sociology at a University in the West Midlands and retired in 2021.  "
        },
        {
            "text": "After Shirin became an attorney for her Dad, she decided to look into options for making a lasting power of attorney (LPA) for herself. Here she shares her story…  "
        },
        {
            "heading": 3,
            "text": " When did you make your LPA?   "
        },
        {
            "text": " My Father decided to make an LPA and asked me and my sister to be his attorneys. During the process I really got to understand what a lasting power of attorney is and how important it is.   "
        },
        {
            "text": "As someone who plans ahead in pretty much everything I do, it made sense for my Husband and I to make our LPAs to secure my wishes and protect my interests. This was just before our 60th birthdays. "
        },
        {
            "heading": 3,
            "text": " When did you bring up the subject of an LPA and have the conversation with your loved ones?   "
        },
        {
            "text": "Any conversation about what will happen when you are sick, or any talk about one's final wishes will never be easy, so of course it was a tearful moment when we approached the subject. Our children didn’t want to believe we were getting older but it’s a hurdle you must cross.  "
        },
        {
            "text": " By being open and honest we were able to talk through everything and ensure that my boys understood their responsibilities as my attorneys.  "
        },
        {
            "text": " Following my Father’s death, we were all in shock. We had to plan care for my Mother and it brought home the reality that when we become vulnerable, our loved ones should have their wishes respected. This first-hand experience encouraged me to make an LPA myself.  "
        },
        {
            "heading": 3,
            "text": "Tell us about your relationship with your attorneys. How did you decide who your attorneys would be?  "
        },
        {
            "text": "I have two grown sons, who I have great relationships with. For me it was an obvious choice to make my boys my attorneys as they would step in and follow my wishes if need be. I made it a point to explain the process to them and what their responsibilities would be.  "
        },
        {
            "heading": 3,
            "text": " Why would you recommend others think about getting an LPA?  "
        },
        {
            "text": "We all must have an LPA to help secure and protect our wishes. It is not fair for our children to deal with difficult decisions about our wellbeing if anything happens to us and this has not been clarified through an LPA. It is far easier and less painful, if we set down our plans, wants and needs. Making my LPA was a learning process and I really understood the importance of it as I was taking mine out.   "
        },
        {
            "text": "Having gone through it I really do have peace of mind that my sons will be able to make decisions on my behalf if they need to.   "
        },
        {
            "text": "It's never too early to talk about lasting powers of attorney with someone you trust. Start a conversation today.   "
        },
        {
            "text": "Find out more at https://powerofattorney.campaign.gov.uk/.     "
        },
        {
            "text": " "
        },
        {
            "text": " [English] - [Cymraeg]"
        },
        {
            "text": "Mae Atwrneiaeth Barhaol (a elwir hefyd yn LPA) yn ddogfen gyfreithiol sy’n caniatáu i chi enwebu rhywun yr ydych yn ymddiried ynddo i gamu i mewn a gwneud penderfyniadau am eich iechyd a’ch lles ac eiddo a chyllid os nad oes gennych alluedd meddyliol i wneud hynny.   "
        },
        {
            "text": "Mae Shirin Housee, 62 oed, yn byw yn Ne Birmingham gyda’i gŵr a’i dau blentyn. Roedd yn uwch ddarlithydd mewn cymdeithaseg mewn prifysgol yng ngorllewin canolbarth Lloegr ac ymddeolodd yn 2021.  "
        },
        {
            "text": "Ar ôl i Shirin ddod yn atwrnai i’w thad, penderfynodd ymchwilio i opsiynau ar gyfer gwneud atwrneiaeth arhosol (LPA) iddi hi ei hun. Dyma hi’n rhannu ei stori...  "
        },
        {
            "heading": 3,
            "text": " Pryd wnaethoch chi eich LPA?   "
        },
        {
            "text": " Penderfynodd fy nhad wneud atwrneiaeth arhosol a gofynnodd i mi a’m chwaer fod yn atwrneiod iddo. Yn ystod y broses, cefais gyfle i ddeall beth yw atwrneiaeth arhosol a pha mor bwysig ydyw.   "
        },
        {
            "text": "Fel rhywun sy’n cynllunio ymlaen llaw ym mhopeth rwy’n ei wneud, roedd yn gwneud synnwyr i’m gŵr a minnau wneud ein LPA i sicrhau fy nymuniadau a diogelu fy muddiannau. Roedd hyn ychydig cyn ein pen-blwydd yn 60 oed. "
        },
        {
            "heading": 3,
            "text": " Pryd wnaethoch chi godi pwnc atwrneiaeth arhosol a chael y sgwrs â’ch anwyliaid?   "
        },
        {
            "text": "Ni fydd unrhyw sgwrs am yr hyn fydd yn digwydd pan fyddwch chi’n sâl, neu am eich dymuniadau olaf, byth yn hawdd, felly wrth gwrs, roedd yn foment ddagreuol pan wnaethon ni drafod y pwnc. Doedd ein plant ddim eisiau credu ein bod ni’n heneiddio, ond mae’n rhwystr y mae’n rhaid i chi ei groesi.  "
        },
        {
            "text": "Drwy fod yn agored ac yn onest, roeddem yn gallu trafod popeth a sicrhau bod fy meibion yn deall eu cyfrifoldebau fel atwrneiod.  "
        },
        {
            "text": "Yn dilyn marwolaeth fy nhad, roedd pob un ohonom mewn sioc. Roedd yn rhaid i ni gynllunio gofal ar gyfer fy mam, ac amlygodd y realiti pan fyddwn yn dod yn fregus, y dylid parchu dymuniadau ein hanwyliaid. Roedd y profiad uniongyrchol hwn wedi fy annog i wneud atwrneiaeth arhosol fy hun.  "
        },
        {
            "heading": 3,
            "text": "Dywedwch wrthym am eich perthynas â’ch atwrneiod. Sut wnaethoch chi benderfynu pwy fyddai eich atwrneiod?  "
        },
        {
            "text": "Mae gen i ddau fab sy’n oedolion, ac mae gen i berthynas dda â nhw. I mi, roedd yn ddewis amlwg gwneud fy meibion yn atwrneiod i mi gan y byddent yn camu i mewn ac yn dilyn fy nymuniadau pe bai angen. Esboniais y broses iddynt yn bwrpasol a beth fyddai eu cyfrifoldebau.  "
        },
        {
            "text": "Pam fyddech chi’n argymell bod pobl eraill yn meddwl am gael atwrneiaeth arhosol?  "
        },
        {
            "text": "Rhaid i bob un ohonom gael Atwrneiaeth Arhosol i helpu i sicrhau a diogelu ein dymuniadau. Nid yw’n deg i’n plant ddelio â phenderfyniadau anodd am ein llesiant os bydd unrhyw beth yn digwydd i ni ac nad yw hynny wedi cael ei egluro drwy Atwrneiaeth Arhosol. Mae’n llawer haws ac yn llai poenus, os byddwn yn nodi ein cynlluniau, ein dymuniadau a’n hanghenion. Roedd gwneud fy Atwrneiaeth Arhosol yn broses o ddysgu ac roeddwn i wir yn deall pwysigrwydd hynny wrth i mi ei wneud.   "
        },
        {
            "text": "Ar ôl mynd drwyddo, mae gen i dawelwch meddwl y bydd fy meibion yn gallu gwneud penderfyniadau ar fy rhan os bydd angen.   "
        },
        {
            "text": " "
        },
        {
            "text": "Dydy hi byth yn rhy gynnar i siarad am atwrneiaeth arhosol gyda rhywun rydych chi’n ymddiried ynddo. Dechreuwch sgwrs heddiw.   "
        },
        {
            "text": "Cewch ragor o wybodaeth yn https://powerofattorney.campaign.gov.uk/.  "
        }
    ]
}