{
    "url": "https://governmentscienceandengineering.blog.gov.uk/2023/10/23/saluting-our-sisters-black-history-month-october-2023/",
    "title": "Saluting Our Sisters – Black History Month October 2023",
    "authors": [
        "gseprofession"
    ],
    "categories": [
        "Blog Series",
        "Diversity & Inclusion"
    ],
    "pub_date": "2023-10-23T11:32:15+01:00",
    "content": [
        {
            "text": "October is Black History Month, which has the theme of 'Celebrating our Sisters'. In this blog, we hear from two of our GSE members: Matimba and Josephine."
        },
        {
            "text": "Matimba Swana shares the impact she has made, and what she has recently learnt about diversity and inclusion in the health sector."
        },
        {
            "text": "My work: I am currently based in the Futures team in the UK Government Office for Science, and I am a PhD candidate in the School of Engineering Mathematics & Technology and Centre for Ethics in Medicine at the University of Bristol."
        },
        {
            "text": "My research involves: Cancer nanomedicine, swarm medicine, bioethics, and the use of virtual tumours and patient twin models in clinical trials."
        },
        {
            "text": "I am passionate about: Emerging technologies, medical ethics, global health, and digital health disparities."
        },
        {
            "text": "There are three things I have learnt about diversity and inclusion recently: The first is I never realised how much representation can make a meaningful difference. Last year, I was lucky enough to attend Cancer Research’s sponsored Black in Cancer event, which was both informative and empowering. After Black in Cancer, I contributed to Cancer Research’s patient involvement newsletter and co-founded the organisation Black and Brown in Bioethics (BBB), with Kumeri Bandara and Harleen Kaur Johal."
        },
        {
            "text": "The second is we can all make small incremental steps that provoke change over time. BBB aims to achieve racial equity within the UK bioethics community. Within the first year of launching BBB, we have organised a series of webinars with academics and industry professionals, received funding from the Institute of Medical Ethics for a qualitative study into the experiences of postgraduates in different racial groups, organised a limited podcast series exploring Power and Privilege in Academia, and won the EACME Paul Schotsmans award for our project Inclusive bioethics: modifying methodology to transform research."
        },
        {
            "text": "The third, and I feel one of the most important things is understanding the importance of lived experience and participatory research. I previously worked in the clinical trials industry where there were debates around patient-centricity being a buzzword or a paradigm shift. I currently sit on the Bristol Cancer Research Network steering committee and on the Board of Trustees at the Brain Tumour Charity, which has helped me really understand the value of authentic lived experience. I acknowledge there are still obstacles and I feel we can ensure that more people from different life journeys have input in science advice, strategies and policies at all levels to help us not just imagine but achieve a more positive future for future generations."
        },
        {
            "text": "How this learning connects with my role: Before joining the Futures team, I would tend to catastrophise the future, but I have found future thinking is not about dystopias and utopias but understanding long-term issues or challenges shaping future development in policy. There are many future possibilities that can happen, but we can also influence things based on what we do today."
        },
        {
            "text": "Happy Black History Month!"
        },
        {
            "heading": 3,
            "text": "Breaking Barriers: Celebrating Black British Women in Art"
        },
        {
            "text": "My name is Josephine Amteng, and I am currently a third-year student in London. I was born in Ghana but have lived most of my life in Coventry. I spent 8 weeks on an internship with the GSE Profession team in the Government Office for Science. When I am not studying or working, I enjoy exploring different cultures and engaging in topics of diversity and inclusion."
        },
        {
            "text": "Art has always been a powerful medium for self-expression, activism, and cultural exploration. In British art, Black British women have played a crucial role in challenging stereotypes, reshaping narratives, and leading with their distinct voices and unique perspectives."
        },
        {
            "text": "In light of this year’s theme, ‘our Sisters’, here are some Black British women in art that I think you should know about:"
        },
        {
            "text": "Lubaina Himid  – ‘Freedom and Change‘, Lubaina Himid CBE RA, 1984 | Tate"
        },
        {
            "text": "Born in Tanzania, Lubaina Himid is celebrated for her work as an artist and activist. As an influential figure of the British Black arts movement, Himid has dedicated her career to uncovering hidden histories and reclaiming identities. Her work is inspired by everyday life, culture, and the Black experience, fostering meaningful dialogues and conversations through her art."
        },
        {
            "text": "In 2017, Himid was awarded the Turner Prize and in 2018, she was made a CBE for her services to art in the Queen’s Birthday Honours."
        },
        {
            "text": "Sonya Boyce  – ‘The Audition‘, Sonia Boyce OBE, 1997, printed 2018 | Tate"
        },
        {
            "text": "Sonya Boyce is an Afro-Caribbean artist and a key figure of the British Black arts movement. Her works provoke conversations around racial and sexual bias as she explores representations of the black body in art. In her recent projects, Boyce employs diverse artistic mediums, including drawing and digital photography, to create immersive environments that capture contemporary life and the intersection between identity and politics."
        },
        {
            "text": "In 2016, Sonya Boyce became the first black female Royal Academician and in 2019, she was awarded an OBE in the New Year Honours for her services to art. Boyce also became the first black woman to be selected by the British Council to represent Britain at the Venice Biennale in 2022."
        },
        {
            "text": "Lynette Yiadom-Boakye – ‘Razorbill‘, Lynette Yiadom-Boakye, 2020 | Tate"
        },
        {
            "text": "Lynette Yiadom-Boakye, a British painter of Ghanaian descent, has made a significant impact in the art world with her ability to capture the essence of her imagined subjects. Yiadom-Boakye's artworks depict predominantly black individuals in ordinary, timeless moments of joy, solitude, and companionship. Through this, her work extends beyond the confines of race and identity, redefining the representation of black figures in art."
        },
        {
            "text": "Lynette Yiadom-Boakye was recognised as a finalist for the Turner Prize in 2013 and her art can be found in renowned collections, including the Tate Collection in London and The Museum of Modern Art in New York."
        },
        {
            "text": "Get in touch with the GSE Team to share your thoughts and inspirations this Black History Month."
        }
    ]
}