{
    "url": "https://nda.blog.gov.uk/supporting-community-partners-to-deliver-green-growth/",
    "title": "Supporting community partners to deliver green growth",
    "authors": [
        "Jamie Reed"
    ],
    "categories": [
        "Mission delivery",
        "Socio-economic"
    ],
    "pub_date": "2023-10-23T09:29:55+01:00",
    "content": [
        {
            "heading": 3,
            "text": "NDA Director of Socio-Economics, Jamie Reed, explains why we invest in projects to help deliver positive change in our communities."
        },
        {
            "text": "As the NDA’s first Director of Socio-Economics, it’s a privilege to work as part of a team committed to working with local partners to help improve, grow and diversify the economies in those communities closest to our sites."
        },
        {
            "text": " "
        },
        {
            "text": "We are working to ensure that beyond the completion of our decommissioning mission we leave a positive and long-lasting legacy for future generations."
        },
        {
            "text": "Last week, the First Minister of Wales, Mark Drakeford MS officially opened the substation linked to the Morlais tidal energy project on Anglesey. Accompanied by the Tánaiste, Micheál Martin TD (Deputy Prime Minister of Ireland) and Vaughan Gething MS, Minister for the Economy, the event marked the culmination of more than ten years work and a significant milestone for the project and the tidal energy sector in Wales."
        },
        {
            "text": "NDA and Magnox have worked in partnership with Menter Môn over many years, investing over £1m in the Morlais project so far to help leverage almost £50m of funding from the Welsh government for the delivery of the project and this represents one of our most innovative socio-economic projects to date."
        },
        {
            "text": "Morlais is the tidal stream energy project created by Menter Môn  - a social enterprise working across Wales to deliver a range of regeneration, environmental and cultural projects for the benefit of local communities. Morlais will benefit local communities, the economy and climate by generating clean low carbon electricity using tidal power. The project is phased to protect wildlife and habitats and will be developed gradually to a potential maximum generating capacity of 240MW, creating between 100 and 200 jobs in the process. Profits from the scheme will be reinvested by Menter Môn into other regeneration projects."
        },
        {
            "text": "Working with our local communities and operating companies, we have developed a portfolio of socio-economic projects across our estate. Every community is different and success is achieved in a painstaking way. There are no silver bullets, but the difference our approach can make is remarkable and the Morlais success demonstrates this."
        },
        {
            "text": "Working with local partners to help to deliver green growth is an achievement we should take pride in. This creates jobs, supports communities, drives growth and helps us to contribute towards the challenge of Net Zero; it’s sustainability in action."
        },
        {
            "text": "At it’s heart, Morlais is about people. The NDA didn’t identify or create the project, but by working with local partners we have enabled good ideas to take flight, grow and become reality. As an enabling organisation, we will continue to use our resources to leverage significantly more money than we are able to provide directly, supporting our communities in the creation and realisation of their ambitions."
        },
        {
            "text": "In a world of growing challenges and rapidly moving pieces, progress can feel like a daunting prospect. But with the right ideas, right partners and right approach; brick by brick, project by project, we can make a positive difference. That’s what we do and that’s what Morlais represents."
        },
        {
            "text": " "
        }
    ]
}