{
    "url": "https://ruralpayments.blog.gov.uk/2023/10/23/the-2024-round-of-countryside-stewardship-facilitation-fund-opens-today/",
    "title": "The 2024 round of Countryside Stewardship Facilitation Fund opens today",
    "authors": [
        "RPA Editor"
    ],
    "categories": [
        "Countryside Stewardship"
    ],
    "pub_date": "2023-10-23T15:10:44+01:00",
    "content": [
        {
            "text": "We know farmers across the country are making decisions on the future of their farms and businesses, with many factors and opportunities to consider in a challenging climate.  "
        },
        {
            "text": "We also know a sense of community and shared goals is important in a thriving rural economy, so we’re pleased that a further round of the popular Countryside Stewardship Facilitation Fund (CSFF) has opened today for applications."
        },
        {
            "text": "Working together with a facilitator, the fund helps groups of farmers and landowners in England to coordinate action, join agri-environment schemes and share knowledge, to achieve greater environmental benefits than they would working alone. "
        },
        {
            "text": "Building on the successes of previous rounds, this year the scheme includes support for environmental priorities such as:  "
        },
        {
            "text": "Other key changes for this year’s scheme include: "
        },
        {
            "heading": 2,
            "text": "How the fund works  "
        },
        {
            "text": "Groups of farmers and landowners choose a facilitator, who will work with them for the duration of a 3-year agreement. Funding is available for facilitators who will organise activities and bring support, advice, and training to the group. These activities help the group achieve their goals to improve their local environment.  "
        },
        {
            "text": "Groups could look at things like restoring habitats for wildlife and improving biodiversity, creating woodland, improving air and water quality, or restoring historic environments. In previous rounds of the scheme, we’ve seen groups running demonstration days in timber extraction, exploring measures to reduce flooding, learning about ground nesting birds and improving confidence in conservation farming, to name a few. The great thing about the fund is that projects can be tailored.  "
        },
        {
            "text": "Alison Cross, of Wessex Farm and Wildlife, and facilitator of The Lower Pang and Kennet Farmers groups, says: "
        },
        {
            "text": "The Lower Pang and Kennet Farmers aim to be a leading example of nature friendly farming in West Berkshire. Their focus is managing successful farm businesses whilst creating and improving wildlife habitats, benefiting biodiversity without lowering yield or productivity and identifying opportunities for sustainable farming. The group are exploring ways to reduce flood risk, enhance freshwater habitats and improve air quality and soil health. Engaging with the community to teach the public about farming and food, improve perceptions and increase demand for local food are also key objectives for the group.  "
        },
        {
            "text": "Since the fund launched in 2015, 224 groups with over 5,982 members have taken the opportunity to work together. Members have built a strong sense of community by helping each other and sharing good farming and environmental practices.    "
        },
        {
            "text": "We know that mental health in rural communities is a real concern. It is important to us that farmers have the support they need, both through our schemes, and from each other. Feedback from the farming community has shown that being involved in facilitation groups helps farmers feel less isolated. "
        },
        {
            "text": "You can read more about the benefits of the scheme in the evaluation report published by Natural England. To learn more about the objectives and priorities of the facilitation fund groups, you can read the successful facilitation fund groups: project plans on GOV.UK.    "
        },
        {
            "heading": 2,
            "text": "How to apply  "
        },
        {
            "text": "The facilitator for the group coordinates the application on behalf of the group. All the information you need, including the application form, is on the Facilitation Fund page on GOV.UK. "
        },
        {
            "text": "To make sure we are supporting the best possible projects, all applications for the fund are competitive. This means all applications are scored, and the highest-scoring ones will be offered funding. The 3-year agreements start on 1 June 2024.   "
        },
        {
            "text": "To give you the best chance of a successful application, make sure the goals in your application align with the Countryside Stewardship priorities for your local area. "
        },
        {
            "text": "The deadline to apply for this round of the Facilitation Fund is midnight on 15 January 2024. "
        },
        {
            "text": "The Facilitation Fund is a valuable part of the Countryside Stewardship offer and we’re proud to make this available so more farmers can benefit. "
        }
    ]
}