{
    "url": "https://ukhodigital.blog.gov.uk/2023/10/23/what-is-a-primary-charting-authority/",
    "title": "What is a Primary Charting Authority?",
    "authors": [
        "Ian Davies"
    ],
    "categories": [
        "Primary Charting Authority"
    ],
    "pub_date": "2023-10-23T13:47:09+01:00",
    "content": [
        {
            "text": "Ian Davies, International Hydrographic Portfolio Manager for the UK Hydrographic Office (UKHO), reflects on the organisation’s role as Primary Charting Authority (PCA) for Kiribati, and how recently collected data benefits the nation’s islands."
        },
        {
            "text": "There is no internationally accepted definition of a Primary Charting Authority (PCA).  Generally, it refers to an established hydrographic office or charting authority supporting another nation that does not currently have the ability to meet all of its obligations regarding safety of navigation. The PCA often has an historic link with the other nation and can establish relationships on that country’s behalf, where other formal links at government level do not exist."
        },
        {
            "text": "The PCA is responsible for compiling, producing and distributing official navigational products for the waters of a coastal state that it represents. It can also undertake other functions, at the nation’s request, which are often formally agreed (e.g. Memorandum of Understanding or Bilateral Agreement) and may include the following:"
        },
        {
            "text": "The UKHO is currently acting as PCA for 63 nations including several small island developing states in the Southwest Pacific, Caribbean, Indian Ocean, and South Atlantic. Engaging with partners across the globe, the UKHO supports these nations through a range of activities, enabling them to sustainably manage their marine space."
        },
        {
            "heading": 2,
            "text": "Data collection for the Kiribati Outer Island Transport Infrastructure Improvement Project"
        },
        {
            "text": "As the PCA for Kiribati, the UKHO initially provided support by sourcing satellite-derived seabed data. This helped the Government of Kiribati with monitoring the sea level rise, climate change adaption and resilience, and disaster management and planning."
        },
        {
            "text": "The data collected also supported a successful development bank funding bid for the Kiribati Outer Island Transport Infrastructure Investment Project. The project, funded by the World Bank and Asian Development Bank, aims to improve the connectivity, safety and climate resilience of Kiribati’s transport and maritime infrastructure, and to introduce a more developed immediate-response plan for any crisis or emergency on its islands."
        },
        {
            "text": "As part of this project, our specialist teams have recently managed the first phase of data collection using airborne and vessel-based bathymetric surveys across four islands in Kiribati. Our Hydrographic Programmes Team and Scientific Analysis Group have acted as a client representative to Kiribati, monitoring the quality of data collection and advising the government and a contractor of any required amends to survey area limits and the data collected."
        },
        {
            "heading": 2,
            "text": "How does data collection benefit the people of Kiribati?"
        },
        {
            "text": "Kiribati is one of the smallest and most geographically dispersed countries in the world, with a population of 119,000 people. The Republic of Kiribati is a sovereign state in Micronesia comprising 32 atolls that are, on average, just 2m above sea level and, at around 3.5 million square kilometres, spread over one of the world’s largest Exclusive Economic Zones."
        },
        {
            "text": "The nation comprises three island chains: the Gilbert Islands in the west, the Phoenix Islands in the centre and the Line Islands in the east. When completed, the data collection project will provide insights that help to improve maritime transport links between Abaiang, Nonouti, Tabiteuea and Beru, and the capital island of Tarawa."
        },
        {
            "text": "The data is now being processed by the contractor. Once all work is complete and processed, it will be assessed as part of a validation process by the UKHO. Once the data passes validation, it can be used to produce new navigational charts – including Electronic Navigational Charts – and products for the four islands."
        },
        {
            "text": "In addition, the data will be supplied to the Government of Kiribati, enabling the engineers involved in the next phase of the project to develop plans for new infrastructure and aids to navigation. This will improve safety of navigation as well as assisting with wider government initiatives on climate change adaption, disaster management, and planning and coastal zone management."
        },
        {
            "text": "Discover more on how, as PCA for Kiribati, the UKHO is helping the nation combat the effects of climate change."
        }
    ]
}