{
    "url": "https://userresearch.blog.gov.uk/2024/10/07/effective-communication-for-researchers-how-to-listen-observe-and-speak-for-impact/",
    "title": "Effective communication for researchers: how to listen, observe and speak for impact",
    "authors": [
        "Dominika Morton - User Researcher, HMRC",
        "Aimee Fulton - User Researcher, HMRC"
    ],
    "categories": [
        "Conferences and events",
        "Tips and techniques",
        "User research"
    ],
    "pub_date": "2024-10-07T13:05:04+01:00",
    "content": [
        {
            "text": "As user researchers we help create digital services that meet users’ needs. We identify the problems users encounter, which informs ideation on what to build, refines product design and fundamentally considers whether the service you create will work well. "
        },
        {
            "text": "At HMRC, we hold an annual learning and development event - ResCon - to discuss trending user research topics and learn new skills. At our last event, experts in body language, persuasion, negotiation and marketing advised us on effective communication, a vital skill for all researchers."
        },
        {
            "heading": 2,
            "text": "Effective communication"
        },
        {
            "text": "Effective communication is one of the most important skills within research because it facilitates our understanding of who our users are, what they are trying to do and how they are trying to do it. This unlocks our knowledge of how they use and experience current or existing services. "
        },
        {
            "text": "As researchers in government, we also need to advocate for our users and  influence stakeholders to make a positive change - communicating effectively is crucial for that. Here are our top 3 learnings from ResCon speakers."
        },
        {
            "heading": 3,
            "text": "Tip 1: the power of listening"
        },
        {
            "text": "To deliver a clear message when advocating for research, sharing findings or ideas, it's important to understand your audience. The key is to gather information about them in advance, so that you can tailor your approach to what they care about. When giving a presentation, for example to stakeholders, listen to your audience’s questions and feedback. Encourage differing views. This will help you engage and demonstrate that you value their input. Listening to your audience, not just in the interests of gathering information, will help you create an impactful message."
        },
        {
            "heading": 3,
            "text": "Tip 2: crafting your message"
        },
        {
            "text": "Effective communication involves planning and a well-structured format. Outline your goals and expand on them, signposting a clear roadmap for your audience. Identify your key message and lead with it - remembering that less is often more, especially in written communication. "
        },
        {
            "text": "Tools that help you do this are:"
        },
        {
            "text": " Building trust is crucial, so make a positive first impression. In user research sessions this can help users feel they can freely share their thoughts. In research playbacks, sharing key takeaways and starting with your strongest arguments can help those with short attention spans."
        },
        {
            "heading": 3,
            "text": "Tip 3: observing body language"
        },
        {
            "text": "Posture and pace play a big role in communicating confidence, building trust and maintaining control during presentations. Be mindful of distracting habits such as fidgeting with hands, hair or clothes. Recording yourself and reviewing your body language is a good way to make improvements. Consider the message you want to convey – whether authoritative or passive – and adapt your style. "
        },
        {
            "text": "You should also pay close attention to your audience's body language. This will allow you to understand how your message is being received.  For example, in a research session, you may notice that a participant is uncomfortable or distressed. You can then adapt your body language to help put them at ease by smiling and relaxing your hands. Ensuring theparticipant is comfortable helps them open up and give real insights to how your product or service makes them feel. Remember, the way you carry yourself not only affects how others perceive you but can also influence how you feel."
        },
        {
            "text": "It’s been great to see that many of our fellow user researchers have been putting these tips into practice. We are now looking forward to more learning at the next HMRC ResCon event."
        }
    ]
}