{
    "url": "https://space.blog.gov.uk/2024/10/07/enabling-technologies-programme-aiding-exploration/",
    "title": "Enabling Technologies Programme: Aiding Exploration ",
    "authors": [
        "Emily Jayne Peters"
    ],
    "categories": [
        "Applications",
        "Delivering Missions and Capabilities",
        "Space exploration",
        "Space science"
    ],
    "pub_date": "2024-10-07T14:36:34+01:00",
    "content": [
        {
            "text": "From the first satellite launches in the 1950s, to the Voyager 1 craft breaching the edge of our solar system in 2012, humanity has sought to push the boundaries of space exploration. At the UK Space Agency, our Enabling Technologies Programme (ETP) funds national efforts to drive innovation in exploration and human space activity, in-orbit and beyond."
        },
        {
            "text": "One example can be seen at the University of Manchester, where an ETP-funded team aims to further exploration and research capabilities with their hopping and rolling explorer, HARE. The project involves development of alternative motion techniques for exploration missions, expanding the range and set of operating capabilities for extra-terrestrial robotic missions. Project lead  Dr Kate Smith shared the below updates on how their jumping robot design might explore lava tubes on the moon:"
        },
        {
            "text": "The University of Manchester team, working alongside Olsen Actuators Ltd, have also developed a prototype belay device that can be used to lower the HARE rover into a lava tube from the lunar surface."
        },
        {
            "text": "Dr Smith and her team will be presenting HARE at the upcoming 75th International Astronautical Congress (IAC) in Milan, 14-18 October 2024.In addition, the team will be hosting a stand at the upcoming Science Festival at the historic Museum of Science and Industry in Manchester, where participants can attempt to navigate through a lava tube using the hopping rover with VR - you can visit the “Extreme Space” exhibition 18-27 October 2024."
        },
        {
            "text": "Another project is funding the University of Southampton in collaboration with the Open University and Airbus Defence and Space for their work on “Non-thermal plasma surface decontamination method for sensitive materials”. Sterilisation is imperative for human spaceflight; the novel implementation of non-thermal plasma methods is an enabling technology for future exploration, as it is safer and cheaper than high-temperature alternatives which can be volatile and inefficient in the space environment."
        },
        {
            "text": "Project lead Minkwan Kim tells us; “The team has successfully developed prototypes of both direct and indirect low-temperature plasma sterilisation systems, which are currently undergoing biological performance and material compatibility testing. The project features a groundbreaking design using metal foam and porous Surface Dielectric Barrier Discharge (pDBD) technology, significantly enhancing plasma stability and extending the system's operational lifetime.”"
        },
        {
            "text": "This innovative work has already gained international recognition, with the team's recent progress accepted for presentation at the 2025 AIAA SciTech Forum, the world’s largest event for aerospace research, development, and technology. "
        },
        {
            "text": "Yet another ETP project is developing novel in-orbit capabilities. Harwell-based GMV NSL have produced “REALM: VR Aided Spacecraft Refuelling for IOSM V&V”, a verification and validation capability based on a space sustainability in-orbit refuelling scenario."
        },
        {
            "text": "Project manager Juan Bevan tells us: “REALM will deliver a unique, first-of-its-kind anywhere federated, interoperable, and distributed Digital Twin simulation environment based on High Level Architecture (HLA), incorporating cutting-edge Extended Reality (XR) immersion to support refuelling Guidance, Navigation and Control (GNC) system development DDVV at both software and hardware levels. Our solution will provide novel capabilities for the UK, by exploring operations concepts while providing unique opportunities for enhanced training, public outreach, and stakeholder engagement.”"
        },
        {
            "text": "Technical lead Karl Buckley tells us more about REALM in the short video below."
        },
        {
            "text": "In addition to training and engagement opportunities, we expect this project to generate positive commercial outcomes as the demand for verification and validation of capabilities increases in pursuit of raising technology readiness levels of in-orbit technologies. GMV anticipates that the project will significantly unlock revenue streams for hardware in the loop robotic trials at the National IOSM facility in Westcott."
        },
        {
            "text": "Finally, crewed missions will benefit from the University of Northumbria’s “Project PTSS: Personalised Tourniquet System for Spaceflight Technology”."
        },
        {
            "text": "Dr Luke Hughes told us about the project: “Blood flow restriction exercise has been identified as a key area of interest within ESA’s and NASA’s human space exploration programmes, specifically as a countermeasure to mitigate physical deconditioning in astronauts during spaceflight. This technique requires a Personalised Tourniquet System Technology to be performed; however, at present no such technology exists for spaceflight. This project will develop the design for a new, innovative Personalised Tourniquet System for Spaceflight Technology that can be approved and qualified for use in crewed spaceflight missions, through collaboration with industry experts.” "
        },
        {
            "text": "Look out for more information on our ETP projects in the next blog post, featuring enabling technologies for communications and satellites!"
        }
    ]
}