{
    "url": "https://environmentagency.blog.gov.uk/2024/10/07/is-there-enough-in-the-tank/",
    "title": "Is there enough in the tank?",
    "authors": [
        "Environment Agency"
    ],
    "categories": [
        "Sustainability",
        "Water"
    ],
    "pub_date": "2024-10-07T10:12:18+00:00",
    "content": [
        {
            "text": "It’s unlikely that you’d set off on a long car journey without filling up your car, or leave the house for the day without charging your phone. Without adequate preparation, many parts of our everyday lives wouldn’t be possible. So how do you feel about your water supply at home and at work? Do you know how much you use? It’s easy to think that the water we use from the tap will always be there, but without a vast amount of planning and work, the answer is, it won’t."
        },
        {
            "text": "A plentiful and sustainable supply of water, in any country, is critical to its population, its industry and its future. If we look around the world, we can see the devastating impacts lack of water can have upon a country’s population, chances of survival and economic success. In England, we face a shortfall of nearly 5 billion litres* of water per day by 2050 between the available, sustainable water supplies and expected demand. It’s vital that we plan and prepare for our water needs now to ensure we have enough in the future."
        },
        {
            "text": "Planning for the future"
        },
        {
            "text": "An essential part of our role at the Environment Agency is to advise water companies and the Government on effectively planning for the future. By law, every five years, water companies must produce Water Resources Management Plans (WRMPs) which set out how they intend to deliver our water security and protection of the environment for the next 25 years, in their supply area. These plans are a positive step forward as, upon implementation, they should improve resilience to extreme droughts, serve a thriving economy and improve the environment allowing fish and wildlife to flourish. We play a crucial role in this, using our specialist knowledge to set technical guidance, respond to draft plans and advise the Secretary of State on their suitability."
        },
        {
            "text": "How do we face this challenge together?"
        },
        {
            "text": "Back in March we published a blog post focusing on meeting our water needs for the next 25 years, detailing the options available to us and exploring alternative ways of generating water. It’s a challenge we never stop thinking about. Actions taken by the water industry in the next 12 months, and towards 2030, will be critical to ensuring there is a plentiful and sustainable water supply across England over the coming decades. This is very much a living and agile process which needs to be clearly regulated, which is why, every twelve months, water companies have a statutory duty to report on the progress of their water resources management plans. It’s our job to check that progress and ensure the plans are robust and fit for purpose."
        },
        {
            "text": "So, how are they doing?"
        },
        {
            "text": "Our latest report published today assesses water companies’ annual performance data against their WRMPs. This is the only independent summary and analysis of water resources performance across the sector, providing transparency, greater accountability, and driving evidence-based decisions. This year’s report shows some progress, but highlights areas of significant under delivery which require greater focus from the industry to meet future demand."
        },
        {
            "text": "In particular, water leakage remains too high with 19% of supplies being lost before reaching consumers. It’s positive to see demand and leakage has reduced in 2023/24 from the previous year, however the weather will have been a key factor, due to people using less water, particularly outdoors. The industry needs to ensure the reductions continue and are sustained under drier and more challenging conditions. There is a wide range of existing and emerging innovative ways water companies can reduce leakage. This includes activities such as pipe replacements, smart metering and smart monitoring of networks, and specific activities to help locate and fix leaks such as the use of acoustic logging, satellite imagery, drones and sniffer dogs that can pinpoint leaks."
        },
        {
            "text": "Reducing the demand for water from customers, known as demand management, is another critical element for water companies in their efforts to meet the supply/demand balance and encourage efficient use of the increasingly scarce resource. This will particularly depend on effective smart metering and customer engagement alongside national policy initiatives such as the mandatory water efficiency label and Ofwat’s proposed national water efficiency campaign. Not only is reducing demand important for the long-term management of water, but it is also hugely beneficial to society; it means less water being taken from the environment, less water and wastewater being pumped and treated, and reduces the need for new supplies to meet growth. This translates into fewer carbon emissions, lower costs and a healthier more sustainable environment.   "
        },
        {
            "text": "You can read the full report on GOV.UK"
        },
        {
            "text": "Water companies need to do better – and the EA is working closely with Ofwat and Defra to escalate water resources performance issues on a company-by-company basis. Alongside this report, our joint regulatory letters in relation to this will be published on Ofwat’s website.  We look forward to continuing to work closely with Ofwat to ensure water companies deliver the full range of their commitments. "
        }
    ]
}