{
    "url": "https://ruralpayments.blog.gov.uk/2024/10/07/rpa-and-national-customer-service-week/",
    "title": "RPA and National Customer Service Week",
    "authors": [
        "RPA Editor"
    ],
    "categories": [
        "External engagement"
    ],
    "pub_date": "2024-10-07T15:07:37+01:00",
    "content": [
        {
            "text": "This year’s National Customer Service Week runs from 7 to 11 October 2024 and is designed to raise awareness of customer service and the vital role it plays. One of the ways RPA gathers feedback on our approach to customer service is by attending shows and events across the country. "
        },
        {
            "text": "If you’re attending a rural show or event come and have a chat with RPA to ask questions, or find out more about the schemes and grants available. Visiting our stand is often the only face-to-face contact that many people have with RPA. For us, being able to meet farmers and agents allows us to gain insight and feedback that we can use to further shape the way we work, or the way we write guidance and design processes."
        },
        {
            "text": "Importantly, it gives us a greater understanding of your needs – we’re eager to listen and improve. It’s also a chance for us to gain some early insight into how you feel about our existing and future schemes."
        },
        {
            "text": "When RPA attends a show, the stand often includes screens to show videos, along with tables of leaflets, banners and other information. We’re there to engage with the public and members of the agricultural industry: answering questions, explaining our role in Defra and gathering feedback and ideas to circulate within wider RPA. "
        },
        {
            "text": "By connecting across the agricultural community, we’re able to better understand the needs of the industry, build new relationships and strengthen existing relationships."
        },
        {
            "text": "You can find out more about past shows, events and read about RPA Ambassadors who often attend shows and auction marts."
        },
        {
            "text": "Read the RPA blog post, where Sal Drew said; “Personally, I enjoy getting out there meeting people face to face, helping and guiding. But it’s not just farmers and agents. Networking is a big part of being on the RPA stand. We mainly share the stand with Defra when we attend shows and it’s good listening to them, as I’ve learnt so much\"."
        },
        {
            "text": "Georgina Ling, from Grants Service added; “Attending a show is a great way to meet farmers and the customers we deal with and be able to better understand their issues and priorities\"."
        }
    ]
}