{
    "url": "https://forestrycommission.blog.gov.uk/2024/10/07/using-the-5th-edition-of-the-uk-forestry-standard-in-england/",
    "title": "Using the 5th edition of the UK Forestry Standard in England",
    "authors": [
        "Ian Tubby",
        "Joe Watts"
    ],
    "categories": [
        "Woodland creation",
        "Woodland management"
    ],
    "pub_date": "2024-10-07T12:20:30+01:00",
    "content": [
        {
            "text": "The 5th edition of the UK Forestry Standard (UKFS) came into full effect on 1 October 2024. We’ll explain what this means for you, highlight some of the key changes and tell you how to find out more. "
        },
        {
            "text": "It feels like only a few weeks have passed since we introduced the 5th edition of the standard. It’s difficult to believe, but we have now reached the end of the 12-month transition period from the 4th edition."
        },
        {
            "heading": 2,
            "text": "The basics of UKFS"
        },
        {
            "text": "The UKFS is a technical standard for managing forests across the UK, and applies to all woodland, regardless of who owns or manages it. It’s designed to apply to all kinds of woodlands, from timber plantations to conservation habitats."
        },
        {
            "text": "It’s not an auditable standard or a ‘gold standard’. The document occupies the space between the law and the conditions of specific grants and certifications. By using current evidence bases, it helps to address the most significant risks to our woodland. "
        },
        {
            "text": "The standard is intended for professional foresters such as forest owners, managers, practitioners, regulators and advisors."
        },
        {
            "heading": 2,
            "text": "The end of the transition period"
        },
        {
            "text": "We published the 5th edition of the UKFS last year and introduced a 12-month transition period. This period gave users time to understand the new edition and to complete forestry plans and proposals that were already in development. "
        },
        {
            "text": "The transition period has now ended. From 1 October 2024, grant scheme and regulatory applications received by the Forestry Commission will be assessed against the 5th edition of UKFS. "
        },
        {
            "text": "We want to minimise any disruption and delay to applicants, so grant applications and regulatory approvals received before 1 October 2024 will be assessed using the 4th edition of the UKFS. Existing approvals under the 4th edition remain valid. "
        },
        {
            "text": "This means:"
        },
        {
            "heading": 2,
            "text": "Changes to the standard"
        },
        {
            "text": "The UKFS was first published in 1998. It uses a series of internationally agreed criteria and indicators as the basis. In fact, you can trace the standard back to commitments made at the 1992 Earth Summit.  "
        },
        {
            "text": "While the principals and ethos of the standard haven’t changed, it has been reviewed to ensure that it’s kept up to date."
        },
        {
            "text": "The 5th edition:"
        },
        {
            "heading": 2,
            "text": "How to use the UKFS"
        },
        {
            "text": "To get the most out of UKFS it should be read and applied ‘in the whole’. In some cases it refers to country specific guidance that is tailored to prevailing site and soil conditions in that country. Professional expertise and judgement are needed to get the most from the standard.  "
        },
        {
            "text": "If you’re developing an application, make sure you show your working and the logic behind your plans and proposals. We’ll consider your objectives, evidence and the impact of your proposal. "
        },
        {
            "heading": 2,
            "text": "We're happy to help"
        },
        {
            "text": "Please get in touch if you are confused by changes to the 5th edition of UKFS, or are unsure of how the standard will be implemented. Contact your local Forestry Commission office and we will do our best to help you. "
        },
        {
            "text": "In any case, we like hearing from you in the early stages of planning woodland management operations or developing a woodland proposal. Early dialogue often makes grant or regulatory processes much smoother. It also helps us to better understand your objectives and the potential of your site. "
        }
    ]
}