{
    "url": "https://educationhub.blog.gov.uk/2023/01/03/king-honours-people-for-their-contributions-to-education-and-childcare/",
    "title": "King honours people for their contributions to education and childcare",
    "authors": [
        "mediaofficer"
    ],
    "categories": [
        "Childcare",
        "Further education",
        "Higher Education",
        "Schools"
    ],
    "pub_date": "2023-01-03T15:40:32+00:00",
    "content": [
        {
            "text": "This year, a number of people have been honoured by the King in recognition of their contributions to education and childcare."
        },
        {
            "text": "Among those honoured are:"
        },
        {
            "text": "Peter Offord Davies British Empire Medal (BEM)"
        },
        {
            "text": "Peter receives a BEM for his work as a reading volunteer at Dean Valley Community Primary School and is also the oldest recipient of an honour at 100-years-old."
        },
        {
            "text": "Jane Cook BEM"
        },
        {
            "text": "Jane receives a BEM for services to fostering at Birmingham Children's Trust."
        },
        {
            "text": "Christopher Hall BEM"
        },
        {
            "text": "Christopher receives a BEM for services to fostering at Birmingham Children's Trust."
        },
        {
            "text": "Mark Clive Escott BEM"
        },
        {
            "text": "Mark receives a BEM for transforming provision for traumatised children and families through innovative, therapeutic education services in South West England."
        },
        {
            "text": "Shirley Irlam BEM"
        },
        {
            "text": "Shirley is a lunchtime supervisor at Wistaston Academy in Crewe and receives a BEM for services to education."
        },
        {
            "text": "Sally Ingram MBE"
        },
        {
            "text": "Sally is Director for Student Health and Wellbeing Services at Newcastle University and has been made an MBE for services to student mental health and wellbeing."
        },
        {
            "text": "Samina Qasim Iqbal BEM"
        },
        {
            "text": "Samina is a foster carer and receives a BEM for services to fostering at Birmingham Children's Trust."
        },
        {
            "text": "Javaid Iqbal BEM"
        },
        {
            "text": "Javaid is a foster carer and receives a BEM for services to fostering at Birmingham Children's Trust."
        },
        {
            "text": "Catherine Lee MBE"
        },
        {
            "text": "Catherine is Professor of Inclusive Education and Leadership and Deputy Dean for Education at Anglia Ruskin University and has been made an MBE for services to equality in education."
        },
        {
            "text": "Susan Julie Higginson OBE"
        },
        {
            "text": "Susan is the Principal and Chief Executive at Wirral Metropolitan College, Birkenhead, Merseyside and has been made an OBE for services to further education."
        },
        {
            "text": "Paula Hudgell OBE"
        },
        {
            "text": "Paula is a foster carer in Kent and has been made an OBE for services to children."
        },
        {
            "text": "Mouhssin Ismail OBE"
        },
        {
            "text": "Mouhssin is lately Principal at Newham Collegiate Sixth Form Centre in the London Borough of Newham and has been made an OBE for services to education."
        },
        {
            "text": "Benjamin Lindsay OBE"
        },
        {
            "text": "Benjamin is the Chief Executive Officer of Power the Fight and has been made an OBE for services to the community in South East London."
        },
        {
            "text": "Susan Pittock OBE"
        },
        {
            "text": "Susan is the Chief Executive Officer of Remit Training and has been made an OBE for services to education and skills."
        },
        {
            "text": "Christian Upton OBE"
        },
        {
            "text": "Christian is the headteacher of Tarleton Community Primary School in Preston, Lancashire and has been made an OBE for services to education."
        },
        {
            "text": "Linda Merrick CBE"
        },
        {
            "text": "Linda is the Principal at the Royal Northern College of Music and has been made a CBE for services to music in higher education."
        },
        {
            "text": "The full list of those who have been honoured is available here."
        }
    ]
}