{
    "url": "https://companieshouse.blog.gov.uk/2023/01/03/register-of-overseas-entities-tips-to-speed-up-the-process/",
    "title": "Register of Overseas Entities: tips to speed up the process",
    "authors": [
        "Nick Lindsay, CEO of Elemental",
        "Tobias Latham, solicitor and fellow of the Chartered Institute of Governance"
    ],
    "categories": [
        "Company guidance",
        "Legislative reform"
    ],
    "pub_date": "2023-01-03T13:35:12+00:00",
    "content": [
        {
            "text": "Time is running out for overseas entities to comply with the new Register of Overseas Entities requirements. With less than 4 weeks left, it’s important to register as soon as possible."
        },
        {
            "text": "In August 2022, the UK government, together with Companies House, launched a public Register of Overseas Entities. The new rules require overseas entities that own or lease land or property long-term in the UK to register with Companies House. Information needs to be verified before it’s submitted."
        },
        {
            "text": "As we approach the deadline, the most common question we’re asked is how entities can speed up the process. Here are the top tips from our team of verification officers.  "
        },
        {
            "heading": 3,
            "text": "Appoint a UK-regulated agent "
        },
        {
            "text": "The process cannot be completed without a UK-regulated agent. Every UK-regulated agent is reliant on third parties to help with the verification process. "
        },
        {
            "text": "No provider will be able to guarantee timeframes, so it’s important to start this process right away. You can find a list of UK-regulated agents on GOV.UK. "
        },
        {
            "text": "Consider your own internal processes for appointing suppliers, transferring sensitive information and invoicing. All these can potentially slow down the process. "
        },
        {
            "heading": 3,
            "text": "Understand the history of the property or land  "
        },
        {
            "text": "It’s important to understand the history of the property or land. If there’s been a disposal there will need to be a paper process, which takes extra time."
        },
        {
            "text": "The new rules do not apply and you do not need to register if the land or property was bought before: "
        },
        {
            "heading": 3,
            "text": "Stakeholder management "
        },
        {
            "text": "Most entities are reliant on stakeholders to meet compliance requirements. This could be to gather information or to appoint a UK-regulated agent.  "
        },
        {
            "text": "You’ll need the cooperation of your beneficial owners and managing officers to provide evidence. This is an essential part of the process but can take some time. Beneficial owners can often be busy, and not everyone is keen to share personal details such as their date of birth. "
        },
        {
            "heading": 3,
            "text": "Identify your beneficial owners "
        },
        {
            "text": "The UK-regulated agent will need to understand your ownership structure before they can verify the information. This is not always straightforward and often there are several layers to look at.  "
        },
        {
            "text": "In our experience, one of the quickest ways to do this is to provide an ownership structure chart. Not all entities will have this so you could prepare a written explanation of the structure.  "
        },
        {
            "heading": 3,
            "text": "Get your documents ready "
        },
        {
            "text": "The evidence requirements for each overseas entity can be different depending on the country of incorporation and exact ownership structure. However, there are some pieces of evidence that are common across different filings, such as: "
        },
        {
            "text": "Make sure you have a lawyer in the relevant jurisdiction who can help verify documents. Other professionals can assist, but this can slow things down because of additional requirements.  "
        },
        {
            "heading": 3,
            "text": "Respond promptly "
        },
        {
            "text": "As mentioned, it’s difficult for a UK-regulated agent to outline all the requirements without getting into the detail of the entity. Once they do, be prepared to respond promptly to any queries so time isn’t lost.  "
        },
        {
            "heading": 3,
            "text": "Trusts "
        },
        {
            "text": "Where a trustee of a trust is a beneficial owner, it can often slow things down. The amount of information that needs to be provided increases significantly, as can the complexity of obtaining it. Gather as much historical information as you can about the trust. The entity will need to provide basic details on the trust but also details of all trustees (since the land was acquired) and each beneficiary and others who may have control over the trustees.  "
        },
        {
            "heading": 3,
            "text": "Use the same UK-regulated agent to verify and submit "
        },
        {
            "text": "Companies House advises that it’s quicker and easier for the same UK-regulated agent to verify the information and register it with Companies House. In October 2022, 3 out of 10 filings were rejected, often because the information provided by the overseas entity did not match the information provided by the agent. For this reason, Elemental and other UK-regulated agents do not offer a standalone service.  "
        },
        {
            "heading": 2,
            "text": "What happens if you miss the deadline "
        },
        {
            "text": "Overseas entities will be going through this process for the first time and it’s understandable that, despite best efforts, not all will be able to meet the deadline for a number of reasons.  "
        },
        {
            "text": "In this case, demonstrate that you’ve started the process and aim to complete it as soon as possible after the deadline. Appointing a UK-regulated agent and following the tips in this blog will help to minimise the risk of missing the deadline."
        },
        {
            "heading": 2,
            "text": "About the authors"
        },
        {
            "text": "Nick Lindsay is the founder and CEO of Elemental. He is a qualified solicitor and chartered company secretary. Nick began his career at the law firm Olswang (now CMS), and also worked in-house for Visa and BBC Worldwide.  "
        },
        {
            "text": "Tobias Latham is a qualified solicitor and trained at Linklaters and practised at Macfarlanes. He has also taught future City lawyers at BPP Law School. He is also a Fellow of the Chartered Institute of Governance.  "
        },
        {
            "text": "Both authors have presented and written extensively on the Register of Overseas Entities to audiences in the UK and overseas jurisdictions.  "
        },
        {
            "heading": 3,
            "text": "About Elemental  "
        },
        {
            "text": "Elemental is an integrated corporate services provider that specialises in supporting law firms and corporate service providers. They are an independent UK specialist, and the CGI awarded them Service Provider of the Year 2021 and again in 2022. "
        },
        {
            "text": "Elemental is the market leader for Register of Overseas Entities services and are advising a number of law firms, corporate service providers and other UK-regulated agents on the new regime.  "
        }
    ]
}