{
    "url": "https://valuationoffice.blog.gov.uk/2023/01/03/the-evidence-we-collect-during-revaluation/",
    "title": "The evidence we collect during revaluation",
    "authors": [
        "Alan Colston - Chief Valuer and Head of Surveying Profession"
    ],
    "categories": [
        "Revaluation 2023"
    ],
    "pub_date": "2023-01-03T15:12:50+00:00",
    "content": [
        {
            "text": "As part of our work to deliver revaluations, we typically contact around one million ratepayers to collect the specific rent and lease information we need. For the 2023 revaluation, two thirds of ratepayers have returned the information we asked for and we have collected more relevant evidence than ever before. "
        },
        {
            "text": "By law, all valuations are based on the open market annual rental value of a property at a set point in time. This is known as the Antecedent Valuation Date (AVD).  "
        },
        {
            "text": "The AVD of this revaluation is 1 April 2021. Ministers chose this date to ensure valuations reflected the impact of COVID-19 on the property market. It also gave us enough time to collect and analyse the information we needed to value over two million properties. "
        },
        {
            "text": "The evidence "
        },
        {
            "text": "To collect the evidence we need, we use rental and trade data gathered from property occupiers and landlords. We use three main methods and types of evidence to arrive at a valuation. We explain these methods in our blog on what revaluation means for businesses. "
        },
        {
            "text": "We have collected more evidence than ever before by working with local councils and taxpayers to get the information we need.  "
        },
        {
            "text": "Local councils now provide the VOA with lists of occupiers of all non-domestic properties (properties that are not private homes). For the 2023 revaluation, 100% of local councils have supplied lists of occupiers from their local area.  "
        },
        {
            "text": "We can compare this information to our own data and identify properties that have a new occupier. We then automatically send them Rent and Lease Detail (RALD) request forms. These forms ask the occupier to provide us with details about their lease. "
        },
        {
            "text": "We also have a dedicated Market Information Team who continuously collect information for us to analyse. This ensures we are up to date with market values and trends in the different sectors of the property market.  "
        },
        {
            "text": "We value everything from airports to zoos. A detailed knowledge of the factors affecting rental values for every property in every region is therefore essential in ensuring we produce valuations that taxpayers can rely on.  "
        },
        {
            "text": "Our expertise "
        },
        {
            "text": "COVID-19 had an impact on both the volume and the complexity of the evidence we have received. Our surveyors have worked closely with agents on the ground to investigate local and national markets to understand how they were impacted by the pandemic. "
        },
        {
            "text": "As a result, we have been able to look at a wider range of evidence including letting details, vacancy rates and footfall data, as well as actual transactions.   "
        },
        {
            "text": "In previous revaluations we looked at rental data over a two-year period around the AVD. We do this to understand what the annual rent of a property around the AVD would be.  "
        },
        {
            "text": "We have still gathered this data for Revaluation 2023 but have attached greater weight to evidence from after the pandemic started (March 2020 to April 2021). This is to make sure our valuations reflect the actual experiences of landlords and tenants leading up to 1 April 2021. "
        },
        {
            "text": "One of the best examples of our stakeholder engagement is our work with the licensed trade sector. We have agreed an approach to the valuation of public houses with industry representatives. This included taking account of the impact COVID-19 had on trade and profitability and agreeing an adjustment to our valuations. We have looked at past trading performance, trade during the pandemic and the prospect of trade recovering to arrive at a valuation.  "
        },
        {
            "text": "We have used our surveyors’ expertise and engaged with ratepayers, their agents, and external stakeholders in over twenty property sectors to make sure our valuations are accurate. "
        }
    ]
}