{
    "url": "https://food.blog.gov.uk/2025/11/18/antimicrobial-resistance-and-food-what-it-is-and-why-it-matters/",
    "title": "Antimicrobial Resistance and food: What it is and why it matters",
    "authors": [
        "Rick Mumford, Deputy Director, Science Evidence and Research, Deputy CSA"
    ],
    "categories": [
        "Science"
    ],
    "pub_date": "2025-11-18T08:30:00+00:00",
    "content": [
        {
            "text": "Cymraeg"
        },
        {
            "text": "Antibiotics have saved millions of lives, but what happens when they stop working? Antimicrobial resistance (AMR) is a growing threat and it’s not just a hospital problem; it’s also on our plates. "
        },
        {
            "text": "This week is World AMR Awareness Week (WAAW), an annual event promoted by the World Health Organisation (WHO), who recognise AMR as one the top 10 threats to global public health. Through over, or inappropriate, use of antibiotics, bacterial and fungal pathogens (any small organism that can cause disease, such as a virus or bacterium) can develop resistance and thus render treatments ineffective over time; raising the risk that even simple medical procedures become more dangerous in the future. "
        },
        {
            "text": "In the UK, the case for containing and controlling AMR was presented by the Government in the 20-year vision and delivered via a 5-year National Action Plans (NAP). The first action plan ran from 2019 until 2024 and the second is currently in progress. The NAP approach is important because it recognises that AMR is a One Health issue, which can only be properly addressed by joining up human, animal and environmental health. The role of the Food Standards Agency (FSA) in the NAP exemplifies this. Many pathogens causing gastrointestinal illness in humans (for example, salmonella) can carry AMR. These pathogens are zoonotic i.e. originating in animals and spreading to humans via food or the environment. That is why the FSA’s AMR research and surveillance work is focused on understanding the risk posed by food as a bridge between animal sources and human infections (a farm to fork approach). For more information on food and AMR, you can visit the FSA’s website. "
        },
        {
            "text": "FSA science in action against AMR "
        },
        {
            "text": "The FSA has a long-standing programme of research and surveillance focused on AMR in food, and you can find out more on our AMR research webpages. Every year we support a number of projects through our Foodborne Disease and AMR Research & Evidence Programme. The research priorities for this can be found in our recently expanded and published Areas of Research Interest. "
        },
        {
            "text": "A key element of our work is surveillance to understand which foods might be carrying AMR pathogens. We look at how much and of what type of resistance is present, for example resistance to medically critical antibiotics. Recent examples include a survey on whole head lettuce (FS900515). Ready-to-eat foods like lettuce can pose a higher risk, if contaminated, since they are not cooked before eating and therefore any harmful bacteria present are not destroyed. Our survey on raw dog and cat food (FS900253) isn't just about pet health; it's about the risk of cross-contamination onto kitchen surfaces and human hands. These studies told us two different stories; there is limited evidence of AMR contamination on lettuce, contrasted with finding lots of pathogens and AMR on raw pet food. "
        },
        {
            "text": "In addition to targeted surveys, we have also been looking at how we can carry out foodborne pathogen and AMR surveillance better in the future, for example through increasing the use of newer technology like Whole Genome Sequencing (WGS). A key example of surveillance innovation was the FSA-led PATH-SAFE programme, which generated valuable new data on AMR in the environment and developed new tools and approaches to conducting pathogen and AMR surveillance, such as monitoring wastewater from hospitals. The FSA are continuing this work via a new national Food Surveillance Programme. "
        },
        {
            "text": "This also links to the FSA-funded Infectious Intestinal Disease (IID3) study designed to ascertain the levels and causes of intestinal illnesses in the UK. This major study, testing over 5000 human samples for the first time, is also testing for AMR in the pathogens it finds. This will help us understand what proportion of foodborne infections are resistant to antibiotics and how big the problem really is. "
        },
        {
            "text": "You are part of the solution: The 4 Cs "
        },
        {
            "text": "Whilst we understand food can be a cause of spread for AMR into humans, there are simple things people can do to reduce any risk. And actually, these align with best practice for food hygiene in the kitchen, namely the 4 Cs: Cooking, Chilling, Cleaning and avoiding Cross-contamination. In the case of AMR, thorough cooking will kill the bugs carrying the resistance and proper cleaning (hands and surfaces) after handling (for example) raw pet food will help prevent cross-contamination. For more advice, go to the FSA website: Antimicrobial resistance (AMR) | Food Standards Agency. "
        },
        {
            "heading": 1,
            "text": "Ymwrthedd gwrthficrobaidd a bwyd: Beth yw e a pham mae’n bwysig?"
        },
        {
            "text": "Mae gwrthfiotigau wedi achub miliynau o fywydau, ond beth sy’n digwydd pan fyddan nhw’n stopio gweithio? Mae ymwrthedd gwrthficrobaidd (AMR) yn fygythiad cynyddol ac nid yn unig i ysbytai; mae’r bygythiad hefyd i’w gael ar ein platiau ni."
        },
        {
            "text": "Yr wythnos hon yw Wythnos Ymwybyddiaeth AMR y Byd (WAAW), digwyddiad blynyddol sy’n cael ei hyrwyddo gan Sefydliad Iechyd y Byd (WHO), sy’n cydnabod ymwrthedd gwrthficrobaidd fel un o’r 10 bygythiad mwyaf i iechyd y cyhoedd ar draws y byd. Drwy or-ddefnyddio gwrthfiotigau, neu eu defnyddio’n amhriodol, gall pathogenau  (unrhyw organeb fach a all achosi clefyd, fel feirws neu facteriwm) bacteriol a ffwngaidd ddatblygu ymwrthedd gan wneud triniaethau’n aneffeithiol dros amser. Yn y dyfodol, gallai hyn olygu y bydd hyd yn oed y triniaethau meddygol symlaf yn dod yn fwy peryglus."
        },
        {
            "text": "Yn y DU, cafodd yr achos dros atal a rheoli ymwrthedd gwrthficrobaidd ei gyflwyno gan y llywodraeth yn ei gweledigaeth 20 mlynedd a’i gyflwyno drwy Gynllun Gweithredu Cenedlaethol pum mlynedd. Roedd cyfnod y cynllun gweithredu cyntaf rhwng 2019 a 2024, ac mae’r ail gynllun ar y gweill ar hyn o bryd. Mae’r dull sydd yn y Cynllun Gweithredu Cenedlaethol yn bwysig oherwydd ei fod yn cydnabod bod ymwrthedd gwrthficrobaidd yn fater Iechyd Cyfunol, ac mai’r unig ffordd o fynd i’r afael ag ef yn iawn yw trwy gyfuno iechyd pobl, anifeiliaid a’r amgylchedd. Mae rôl yr Asiantaeth Safonau Bwyd (ASB) yn y Cynllun Gweithredu Cenedlaethol yn enghraifft o hyn. Gall llawer o bathogenau sy’n achosi salwch gastroberfeddol mewn pobl (er enghraifft, salmonela) gario ymwrthedd gwrthficrobaidd. Mae’r pathogenau hyn yn filheintiol, hynny yw, maen nhw’n tarddu o anifeiliaid ac yn lledaenu i bobl trwy fwyd neu’r amgylchedd. Dyna pam mae gwaith ymchwil a gwyliadwriaeth yr ASB mewn perthynas ag ymwrthedd gwrthficrobaidd yn canolbwyntio ar ddeall y risg a achosir gan fwyd fel pont rhwng ffynonellau anifeiliaid a heintiau dynol (dull o’r fferm i’r fforc). Am fwy o wybodaeth am fwyd ac ymwrthedd gwrthficrobaidd, gallwch ymweld â gwefan yr ASB."
        },
        {
            "heading": 4,
            "text": "Gwyddoniaeth yr ASB ar waith yn erbyn ymwrthedd gwrthficrobaidd"
        },
        {
            "text": "Mae gan yr ASB raglen ymchwil a gwyliadwriaeth hirsefydlog sy’n canolbwyntio ar ymwrthedd gwrthficrobaidd mewn bwyd, a gallwch ddysgu mwy ar ein tudalennau gwe ymchwil ymwrthedd gwrthficrobaidd. Bob blwyddyn, rydym yn cefnogi nifer o brosiectau trwy ein Rhaglen Ymchwil a Thystiolaeth ar gyfer Clefydau a Gludir gan Fwyd ac Ymwrthedd Gwrthficrobaidd. Gellir dod o hyd i’r blaenoriaethau ymchwil ar gyfer hyn yn ein meysydd o ddiddordeb ymchwil a gafodd eu hehangu a’u cyhoeddi’n ddiweddar."
        },
        {
            "text": "Elfen allweddol o’n gwaith yw gwyliadwriaeth er mwyn deall pa fwydydd a allai fod yn cario pathogenau ag ymwrthedd gwrthficrobaidd. Rydym yn edrych ar faint o"
        },
        {
            "text": "ymwrthedd sydd, a pha fath o ymwrthedd sy’n bresennol, er enghraifft ymwrthedd i wrthfiotigau sy’n hanfodol yn feddygol. Mae enghreifftiau diweddar yn cynnwys arolwg ar letys pen cyfan (FS900515). Gall bwydydd parod i’w bwyta fel letys beri risg uwch, os ydynt wedi’u halogi, gan nad ydynt yn cael eu coginio cyn eu bwyta ac felly nid yw unrhyw facteria niweidiol sy’n bresennol yn cael eu dinistrio. Nid yw ein harolwg ar fwyd cŵn a chathod amrwd (FS900253) yn ymwneud ag iechyd anifeiliaid anwes yn unig; mae’n ymwneud â’r risg o groeshalogi ar arwynebau cegin a dwylo pobl. Dywedodd yr astudiaethau hyn ddwy stori wahanol wrthym; mae tystiolaeth gyfyngedig o halogiad ag ymwrthedd gwrthficrobaidd ar letys, o’i gymharu â chanfod llawer o bathogenau ac ymwrthedd gwrthficrobaidd ar fwyd anifeiliaid anwes amrwd."
        },
        {
            "text": "Yn ogystal ag arolygon wedi’u targedu, rydym hefyd wedi bod yn edrych ar sut y gallwn gynnal gwaith gwyliadwriaeth gwell ar bathogenau a gludir gan fwyd ac ymwrthedd gwrthficrobaidd yn y dyfodol, er enghraifft trwy gynyddu’r defnydd o dechnoleg newydd fel Dilyniannu Genom Cyfan. Enghraifft allweddol o arloesi ym maes gwyliadwriaeth oedd y rhaglen PATH-SAFE dan arweiniad yr ASB, a gynhyrchodd ddata newydd gwerthfawr ar ymwrthedd gwrthficrobaidd yn yr amgylchedd ac a ddatblygodd offer a dulliau newydd o gynnal gwaith gwyliadwriaeth ar bathogenau ac ymwrthedd gwrthficrobaidd, fel monitro dŵr gwastraff o ysbytai. Mae’r ASB yn parhau â’r gwaith hwn drwy Raglen Cadw Gwyliadwriaeth ar Fwyd genedlaethol newydd."
        },
        {
            "text": "Mae hyn hefyd yn cysylltu â’r astudiaeth Clefydau Perfeddol Heintus (IID3) a ariannwyd gan yr ASB. Cafodd yr astudiaeth ei chynllunio i ganfod lefelau ac achosion afiechydon perfeddol yn y DU. Mae’r astudiaeth fawr hon, sy’n profi dros 5,000 o samplau dynol am y tro cyntaf, hefyd yn profi am ymwrthedd gwrthficrobaidd yn y pathogenau y mae’n eu canfod. Bydd hyn yn ein helpu i ddeall pa gyfran o heintiau a gludir gan fwyd sy’n gwrthsefyll gwrthfiotigau a pha mor fawr yw’r broblem mewn gwirionedd."
        },
        {
            "text": "Rydych chi’n rhan o’r ateb: Y pedwar hanfod hylendid bwyd"
        },
        {
            "text": "Er ein bod yn deall y gall bwyd fod yn gyfrifol am ledaenu ymwrthedd gwrthficrobaidd ymhlith pobl, mae yna bethau syml y gellir eu gwneud i leihau unrhyw risg. Mewn gwirionedd, mae’r rhain yn cyd-fynd â’r arferion gorau ar gyfer hylendid bwyd yn y gegin, sef: coginio, oeri, glanhau ac atal croeshalogi. Yn achos ymwrthedd gwrthficrobaidd, bydd coginio trylwyr yn lladd yr heintiau sy’n cario’r ymwrthedd, a bydd glanhau dwylo ac arwynebau yn briodol ar ôl trin, er enghraifft, fwyd anifeiliaid anwes amrwd yn helpu i atal croeshalogi. Am fwy o gyngor, ewch i wefan yr ASB: Ymwrthedd gwrthficrobaidd (AMR) | Asiantaeth Safonau Bwyd"
        }
    ]
}