{
    "url": "https://mhclgmedia.blog.gov.uk/2025/11/18/coverage-of-the-housebuilding-acceleration-measures-announcement/",
    "title": "Coverage of the housebuilding acceleration measures announcement",
    "authors": [
        "mhclgpress"
    ],
    "categories": [
        "Housing"
    ],
    "pub_date": "2025-11-18T16:51:57+00:00",
    "content": [
        {
            "text": "There has been widespread, national print and broadcast coverage, alongside extensive positive stakeholder reaction, to the Ministry of Housing, Communities and Local Government’s announcement to speed up housebuilding with a default ‘yes’ for new homes around well-connected train stations, measures for the Housing Secretary to potentially intervene in schemes of 150 or more homes, and proposals to streamline the statutory consultee process."
        },
        {
            "text": "The measures have been positively welcomed by the Home Builders Federation, Royal Town Planning Institute, Centre for Cities, major housebuilders Barratt Redrow and Vistry, campaign groups Britain Remade and the YIMBY Alliance, alongside building on the progress made by Platform4."
        },
        {
            "text": "The Financial Times features an exclusive interview with the Housing Secretary, leading on the angle that councils in England are set to lose their power to obstruct large-scale housing projects in an effort to boost housebuilding. Meanwhile, The Express reports that pro-building groups have welcomed new pledges to reform planning laws to boost housebuilding around railway stations. The announcement and sector reaction was also covered across national outlets including PA,iNews, Sky News, and Independent, The Telegraph, and Daily Mail."
        },
        {
            "text": "This morning, Housing Secretary, Steve Reed, also gave interviews to Times Radio, Sky News, BBC Breakfast, LBC, Today Programme, ITV Good Morning Britain, ITN, and GB News to talk about the impact the measures will have and how it will boost housebuilding across the country."
        },
        {
            "text": "Housing Secretary, Steve Reed:  "
        },
        {
            "text": "“I promised we’d get Britain building and that’s exactly what we are doing. But it has to be the right homes in the right places and nearby transport links are a vital part of that."
        },
        {
            "text": "“We’re making it easier to build well-connected and high-quality homes, using stronger powers to speed things up if councils drag their feet, and proposing to streamline the consultation process to cut back delays."
        },
        {
            "text": "“This is about action: spades in the ground, breathing new life into communities, and families finally getting the homes they need.”"
        },
        {
            "text": "Stakeholder reaction to the announcement"
        },
        {
            "text": "Catherine Williams, Planning Director at the Home Builders Federation said:"
        },
        {
            "text": "\"Making more land available for development and increasing the certainty of achieving planning permission and doing so more quickly are essential steps if we are to increase housing supply. "
        },
        {
            "text": "\"Sustainable development is at the core of the planning system and it is positive that Government are being proactive in permitting developments near train stations. "
        },
        {
            "text": "“Reducing the number of statutory consultees to planning applications is welcome and should help reduce delays and bureaucracy in the planning process. "
        },
        {
            "text": "“Ensuring more larger sites come forward and preventing unnecessary delays to getting sites appropriate for development approved is a positive move that could accelerate supply. "
        },
        {
            "text": "“These further changes to the planning system build on the earlier changes made by this Government, and if broader constraints can be addressed, will really help the industry increase the delivery of high quality, environmentally friendly homes.”"
        },
        {
            "text": "Dr Victoria Hills, Chief Executive of the RTPI, said:"
        },
        {
            "text": "“Sustainable travel means relying less on cars and creating places where walking, cycling and public transport are the easy, everyday choices. But most new housing developments are still car-dependent, with access to key services barely improving over the last decade. "
        },
        {
            "text": "“These reforms are a step towards rectifying that, prioritising developments that are built around sustainable, accessible transport from the start. When we line up new development and transport planning, we can better connect homes with jobs, shops and services, build healthier, fairer communities and give people genuine choice in how they get around.” "
        },
        {
            "text": "Robin Dobson, CEO of Platform4, said:  "
        },
        {
            "text": "“Today’s announcement is a welcome step in the delivery of new homes around train stations and making it simpler for everyone involved. Unlocking land around infrastructure is complex however the neighbourhoods created are well connected and stimulate further growth for towns and cities. We look forward to working with local and combined authorities as we generate more opportunities across the rail estate in the future.”   "
        },
        {
            "text": "Andrew Carter, Chief Executive of Centre for Cities, said:  "
        },
        {
            "text": "“The Government’s continued focus on making the planning system more rules-based and targeting reforms that unlock the economic potential of Britain’s cities is very welcome.”  "
        },
        {
            "text": "“This streamlined approach to developing new homes around well-connected transport stops is one of the best ways to align the planning system with economic growth.  "
        },
        {
            "text": "“Prioritising more homes in and around big cities especially will connect more people to places with the highest number of jobs and opportunities.\" "
        },
        {
            "text": "David Thomas, CEO at Barratt Redrow, said:"
        },
        {
            "text": "“We support the government’s mission to reform the planning system, which remains a significant barrier to UK growth. Today, outline planning permission for a medium-sized development takes an average of two and a half years – more than three times as long as a decade ago. "
        },
        {
            "text": "“We also share the ambition to accelerate delivery, with our own plans to grow to 22,000 new homes a year. We welcome these pragmatic proposals for a default ‘yes’ for building near train stations and to streamline the statutory consultee process, and we look forward to working with government to build the homes the country needs.” "
        },
        {
            "text": "Stephen Teagle, Chief Executive of Partnerships and Regeneration, Vistry:  "
        },
        {
            "text": "“We welcome today’s announcement; this is a positive step forward and demonstrates the Government’s commitment to delivering more homes where they are needed most.  "
        },
        {
            "text": "“As the UK’s leading partnerships-led housebuilder, Vistry is committed to placemaking and to developing communities that people are proud to live in. As such, we welcome this move to streamline planning processes around transport hubs where infrastructure already exists. We look forward to continuing to collaborate with Government and our partners under this framework, building thriving communities across the country.” "
        },
        {
            "text": "Kane Emerson, Head of housing research at YIMBY Alliance:"
        },
        {
            "text": "\"This is a welcome announcement for the hundreds of thousands of British workers that commute by rail every day. Building well-located homes around railway stations will allow workers and their families to live within easy reach of economic opportunity and public services."
        },
        {
            "text": "These are exactly the homes that Britain needs to give people better access to well-paid jobs, reduce car dependency and grow the economy.\""
        }
    ]
}