{
    "url": "https://forestrycommission.blog.gov.uk/2025/11/18/help-beat-the-eight-toothed-spruce-bark-beetle-through-proactive-woodland-management/",
    "title": "Help beat the eight-toothed spruce bark beetle through proactive woodland management",
    "authors": [
        "Fred Toft"
    ],
    "categories": [
        "Tree health",
        "Woodland management"
    ],
    "pub_date": "2025-11-18T09:00:00+00:00",
    "content": [
        {
            "text": "As a woodland owner, staying informed about threats to your trees is crucial for maintaining healthy forests and protecting your investment. One pest you need to know about is Ips typographus, commonly known as the eight-toothed spruce bark beetle. This beetle represents a significant threat to spruce trees across Great Britain."
        },
        {
            "heading": 2,
            "text": "About Ips typographus"
        },
        {
            "text": "Ips typographus is classified as a quarantine pest in the UK, meaning we're legally obligated to act against any findings to prevent its establishment. This beetle specifically targets spruce tree species and could have devastating effects on our forestry sector if it becomes established."
        },
        {
            "text": "The numbers speak for themselves: spruce makes up 60% of the conifer crop across Great Britain, with a total estimated value of £2.9 billion per annum, supporting thousands of jobs across the country.1 This includes economic, social and environmental benefits, with around £350 million annually coming from timber revenue alone.2"
        },
        {
            "heading": 2,
            "text": "How the beetle arrived in the UK"
        },
        {
            "text": "Evidence shows that outbreaks since 2018 have resulted from natural dispersal – essentially, beetles being blown over by the wind from continental Europe, where the pest is native, during favourable weather conditions. There's currently no evidence of the pest spreading within the UK or impacting healthy spruce trees domestically."
        },
        {
            "text": "Using extensive pheromone trap networks across France, Belgium and England, scientists have managed to track the beetles’ movements. They observed a clear pattern in the Ardenne region, where the number of beetles decrease the further you are away from outbreak hotspots. This confirms that cross-channel aerial dispersal is indeed a viable pathway for this pest invasion.3"
        },
        {
            "text": "The team are also exploring methods to trap the beetles at varying altitudes using aircraft and helium balloons. This will help to understand how far the species can travel using wind-assisted dispersal."
        },
        {
            "heading": 2,
            "text": "Weather conditions increase risk"
        },
        {
            "text": "Recent extreme weather patterns have created concerning conditions for spruce trees in south-eastern and eastern England. The combination of heavy rain and waterlogging throughout 2024, followed by the driest spring in 69 years, are considered to be key causes for putting lowland spruce on clay soils under significant stress."
        },
        {
            "text": "This stress is critical because it reduces resin pressure in trees – their main defence mechanism against bark beetle attack. Stressed spruce trees become vulnerable targets for Ips typographus, making vigilant monitoring and proactive management more important than ever."
        },
        {
            "heading": 2,
            "text": "Reducing the risk of establishment"
        },
        {
            "text": "Collaboration across the Forestry Commission, Forest Research and the Department for Environment, Food and Rural Affairs is helping to manage and reduce the risk of Ips typographus establishing in the UK. A series of innovative methods are being used to help fight this invasive pest."
        },
        {
            "heading": 3,
            "text": "Demarcated area and restrictions"
        },
        {
            "text": "To prevent establishment of Ips typographus, a demarcated area covers south-eastern and eastern England, providing robust detection and eradication measures. Within this area, restrictions apply to planting, felling, stacking and the movement of spruce material. All movement of spruce in this area is subject to inspection."
        },
        {
            "text": "If your woodland is in this region, we actively encourage the proactive management or removal of spruce and to replace these trees with non-susceptible tree species. This approach significantly limits the potential for the pest to establish and can protect not only your woodland but the broader forestry industry too."
        },
        {
            "heading": 3,
            "text": "Cutting-edge surveillance and research"
        },
        {
            "text": "The fight against Ips typographus involves sophisticated monitoring systems. Since 2018, 62 woodland-focused aerial surveillance flights have covered over 105,000 hectares of spruce on Public Forest Estate. During the 2024/25 season alone, surveillance identified 1,200 sites requiring ground inspections – a 154% increase from the previous season."
        },
        {
            "text": "The demarcated area was expanded in June 2024 following the discovery of outbreaks in East Anglia. Within the expanded zone, restrictions on spruce management came into effect, prompting rapid adaptation by the forestry sector."
        },
        {
            "text": "As a result, there was a 143% increase in requests for authorisation inspections – a significant rise that my team, along with the wider Plant Health team, managed effectively without compromising ongoing Ips typographus surveillance or other priority pest surveys."
        },
        {
            "text": "Our extensive pheromone trapping network monitors over 700 locations across Great Britain, including a citizen science project with the Sylva Foundation where volunteers monitor traps on their land. From across all the pheromone trapping networks, Forest Research processed over 8,000 samples during the 2024/25 season."
        },
        {
            "text": "We are keen on recruiting more volunteers for the citizen science network. If you are willing to host a pheromone trap in your spruce woodland, you can join our national monitoring project to help prevent the potential spread of Ips typographus."
        },
        {
            "heading": 3,
            "text": "Innovation in detection methods"
        },
        {
            "text": "Exciting developments in detection technology are enhancing our capabilities to help stop the establishment of Ips typographus. Forest Research is developing prototype traps that could photograph beetles in real-time, potentially revolutionising early detection. Partners contributing to these efforts include CENSIS and the University of Cambridge."
        },
        {
            "text": "Detection dogs represent another innovative approach. These specially trained dogs can identify indirect scents of Ips typographus, including beetle frass (excrement or debris left by beetles) and artificial pheromones. They're currently undergoing trials and could significantly improve spruce material movement inspections within the demarcated area."
        },
        {
            "text": "Drone surveillance adds another layer to our monitoring capabilities, providing highly repeatable datasets to detect changes over time and to identify symptomatic trees requiring investigation."
        },
        {
            "heading": 2,
            "text": "What you can do as a woodland owner"
        },
        {
            "text": "Your role in preventing establishment is crucial. Check the health of spruce trees on your land, particularly identifying stressed, recently fallen and snapped trees. Take immediate action to remove these vulnerable trees and any surrounding susceptible material by chipping, burning or debarking."
        },
        {
            "text": "If your woodland is based in the demarcated area and you would like to move spruce material off-site, you will need prior authorisation from the Forestry Commission."
        },
        {
            "text": "You can also watch our informative video: Ips typographus: beat the beetle, for practical guidance on identification and management. Look out for adult beetles in the spring and summer, when the temperature rises above 20°C. Signs to look out for include 2-3mm entrance and exit holes in the bark, and linear larval gallery systems that show in the bark and the surface of the wood."
        },
        {
            "text": "Remain vigilant for signs of this beetle, if you suspect you've spotted signs of Ips typographus, report it immediately using TreeAlert. You can also submit alerts if your spruce woodland shows signs of decline or stress – as we may arrange follow-up inspections."
        },
        {
            "heading": 2,
            "text": "Financial support is available"
        },
        {
            "text": "Grants are available to help manage or fell spruce trees, restock woodland and maintain newly planted trees. This includes support following receipt of a Statutory Plant Health Notice, or through proactive management via the tree health pilot for removing spruce that falls within the proactive spruce removal area in south-eastern England."
        },
        {
            "text": "Recently we also launched the Spruce Site Assessment grant which supports woodland owners by encouraging proactive management of spruce trees to help prevent outbreaks of Ips typographus."
        },
        {
            "text": "This is available to landowners with spruce trees within the proactive spruce removal area, and these assessments will help with making informed decisions about proactive spruce removal on your land to mitigate future risks."
        },
        {
            "heading": 2,
            "text": "Effective eradication of Ips typographus"
        },
        {
            "text": "I’m pleased to say that there's good news to share. We have successfully eradicated Ips typographus from all 13 outbreak sites identified in 2021. This achievement demonstrates that our policy approach and operational activities are working effectively."
        },
        {
            "text": "Following the removal of spruce trees, outbreak sites are continuously monitored for three years, with extensive surveillance showing no ongoing presence of breeding beetles."
        },
        {
            "text": "Analysis of pheromone trap catches from these eradication sites reveals significantly lower beetle numbers compared to nearby spruce forests. This confirms successful eradication of breeding beetles at these sites."
        },
        {
            "text": "There is still much more work to be done. Ips typographus continues to be caught in pheromone traps even on sites without spruce, likely due to wind-assisted dispersal from the continent. Ongoing proactive management and the removal of spruce in areas vulnerable to pest incursions is essential if we are to sustain this success story."
        },
        {
            "heading": 2,
            "text": "Looking ahead"
        },
        {
            "text": "Current modelling suggests further incursions may occur while continental populations of the beetle remain high, and when warm, dry weather conditions are present. However, our comprehensive surveillance network, rapid response capabilities and ongoing research provide robust protection against establishment during this window of opportunity to beat the beetle."
        },
        {
            "text": "By working together – government agencies, researchers and woodland owners like you are continuing to protect the UK’s valuable spruce forests from this significant threat. Your continued vigilance and cooperation remain essential to maintaining this success."
        }
    ]
}