{
    "url": "https://ukhsa.blog.gov.uk/2025/11/18/how-to-protect-your-home-and-family-from-the-invisible-danger-of-carbon-monoxide/",
    "title": "How to protect your home and family from the invisible danger of carbon monoxide",
    "authors": [
        "Blog Editor"
    ],
    "categories": [
        "Chemical and environmental hazards"
    ],
    "pub_date": "2025-11-18T15:38:38+01:00",
    "content": [
        {
            "text": "As the weather turns colder and we close our windows and turn on our heating, there's an invisible danger that can leak into our homes. Carbon monoxide (CO) is a colourless, odourless gas that you cannot see, smell or taste - but it can kill."
        },
        {
            "text": "Around 20 people die each year in England and Wales from unintentional carbon monoxide poisoning, with many more hospitalised."
        },
        {
            "heading": 2,
            "text": "Why winter is riskier"
        },
        {
            "text": "In England, 68% of carbon monoxide deaths occur in autumn and winter. During colder months, we use heating appliances more and keep windows closed to stay warm. This combination - more potentially malfunctioning fuel-burning appliances in use and less ventilation can create the perfect conditions for CO to build up to dangerous levels."
        },
        {
            "text": "Smaller rooms containing CO sources, such as fuel-burning cookers and fireplaces, are particularly at risk, as the pollutant concentrates more quickly in confined spaces. However, built-up CO levels can pose a threat throughout homes, as the gas disperses from room to room."
        },
        {
            "heading": 2,
            "text": "Recognising the symptoms"
        },
        {
            "text": "Because carbon monoxide is invisible and has no smell, recognising the symptoms is crucial. Watch out for:"
        },
        {
            "text": "An important warning sign is symptoms coming and going, especially if they get worse when you're in a particular room or building and improve when you leave or go outside. If you notice this pattern, it could indicate a CO problem."
        },
        {
            "heading": 2,
            "text": "Where does carbon monoxide come from?"
        },
        {
            "text": "Common household appliances can produce carbon monoxide if they're not installed properly, are faulty, or are poorly maintained. These include:"
        },
        {
            "text": "Using portable generators and barbecues or camping stoves inside homes, caravans or tents potentially poses a risk for CO poisoning. CO can even enter tents from a smouldering barbecue outside, so always take an alarm when camping."
        },
        {
            "text": "Ventilation is key - if you are turning on vehicles, generators or engines in an enclosed space such as a garage or shed, make sure to keep a window or door open, to prevent CO from building up. Make sure you use the extractor fan while cooking or open the window."
        },
        {
            "heading": 2,
            "text": "How to protect your home and family"
        },
        {
            "text": "There are several straightforward steps you can take to protect yourself and your family:"
        },
        {
            "text": "Install CO alarms. This is the single most important action you can take. Only 46% of English homes had a CO alarm in 2020, leaving millions of households vulnerable. Install alarms in every room with a fuel-burning appliance – whether that's a gas boiler, coal fire, or wood-burning stove. The same applies to temporary accommodation such as caravans and boats. Test your alarms regularly, and replace batteries as needed."
        },
        {
            "text": "Use ventilation wisely. Research shows that using extractor fans in kitchens significantly lowers CO levels. When cooking or using open fireplaces, wood-burning stoves, or other fuel-burning appliances, ensure you have adequate ventilation. The same applies if you are using a generator or turning on vehicles in an enclosed space."
        },
        {
            "text": "Service your appliances annually. Have all gas appliances serviced every year by a Gas Safe registered engineer and get your chimney swept annually. Don't wait until something goes wrong."
        },
        {
            "text": "Watch for warning signs. 'Floppy' yellow or orange flames on gas appliances instead of crisp blue ones, soot marks around appliances, or increased condensation inside windows can all indicate a problem. Don't ignore these signs."
        },
        {
            "heading": 2,
            "text": "What to do If you suspect CO poisoning"
        },
        {
            "text": "If you think you might have carbon monoxide poisoning:"
        },
        {
            "text": "If you think a gas appliance is leaking carbon monoxide, call the free National Gas Helpline immediately on 0800 111 999. The service is available 24 hours a day, 7 days a week."
        },
        {
            "text": "Every carbon monoxide death is preventable. As we head into the colder months when risk is highest, take time this week to check your CO alarms, book appliance services if they're due, and make sure everyone in your household knows the symptoms to watch for. These simple actions could save your life or the life of someone you love."
        }
    ]
}