{
    "url": "https://civilservice.blog.gov.uk/2025/11/18/how-mhclg-is-delivering-for-the-british-public/",
    "title": "How MHCLG is Delivering for the British Public",
    "authors": [
        "Joanna Key"
    ],
    "categories": [
        "Uncategorized"
    ],
    "pub_date": "2025-11-18T10:47:32+00:00",
    "content": [
        {
            "text": "In the first of our new series spotlighting civil servants driving the government’s Plan for Change, we meet the woman tasked with delivering more homes than Britain has built in half a century. Joanna Key of Ministry of Housing, Communities and Local Government explains why planning reform, a £39bn investment and making YIMBYs cool are all part of her mission to get 1.5 homes built this Parliament."
        },
        {
            "text": "Name: Joanna Key"
        },
        {
            "text": "Role: Director General for Regeneration, Housing and Planning"
        },
        {
            "text": "Department: Ministry of Housing, Communities and Local Government (MHCLG)"
        },
        {
            "text": "If you had to explain what your mission is about to a member of the public in a lift in 30 seconds, what would you say?"
        },
        {
            "text": "This is the mission to build 1.5 million homes over this parliament. That’s a 50% increase on the million homes we built during the last parliament, and would take housebuilding back to levels not seen for more than 50 years. Delivering on this is essential to ensuring everyone has a safe, affordable and decent home."
        },
        {
            "text": "Practically, what has actually been achieved on this goal since it began?"
        },
        {
            "text": "Last year we made a great start by delivering a major reform of the planning system which the OBR say will take housebuilding to its highest level in 40 years. At the Spending Review, we announced historic investment: A new 10-year, £39bn Social and Affordable Homes Programme, delivering around 300,000 social and affordable homes over its lifetime."
        },
        {
            "text": "Our landmark Planning and Infrastructure Bill will also shortly receive Royal Assent, speeding up and streamlining the delivery of new homes and critical infrastructure."
        },
        {
            "text": "Next year, we will launch a new National Housing Bank to unlock private investment into house building and help build over 500,000 homes."
        },
        {
            "text": "What's the one moment in the past three months that made you think, \"This is why I do this job\"?"
        },
        {
            "text": "There have been many moments, as I feel very privileged to do this job, but in the last few weeks, we have announced two very important milestones."
        },
        {
            "text": "First, Awaab’s Law came into effect, protecting social housing tenants from health hazards like damp and mould. It’s named after Awaab Ishak, a small boy who sadly died after his health became exacerbated by his living conditions. I hope we’ve made it very difficult for anything like that to occur again."
        },
        {
            "text": "We also saw Royal Assent to the Renters’ Rights Bill, which will prevent landlords evicting private tenants without reason. Our hope is that this brings more stability and certainty for millions of people in the private rented sector."
        },
        {
            "text": "Name one barrier standing between you and your goal – and  how are you smashing through it?"
        },
        {
            "text": "Maybe the trickiest thing about the 1.5m homes milestone is timelines. It can take years to build a home, so we need to speed up every part of the delivery chain."
        },
        {
            "text": "Our New Homes Accelerator is removing delivery blockers and has sped up the delivery of almost 100,000 homes. Our planning reforms are speeding up processes and increasing certainty for developers."
        },
        {
            "text": "What's your biggest win that nobody's talking about yet, but should be shouting from the rooftops?"
        },
        {
            "text": "I think maybe.... we’ve made it cooler to be a YIMBY! (Yes In My Backyard!)"
        },
        {
            "text": "What's the biggest myth about your delivery area, you'd love to bust right now?"
        },
        {
            "text": "Data shows most people think that around 70-80% of England is developed land. In fact, it’s around 9% - smaller than the Green Belt designation, which covers about 13% of land in England."
        },
        {
            "text": "This weekly series runs from 10 November to 15 December, where we quiz senior leaders on their department’s goals, what progress they’re making, and the challenges they face."
        }
    ]
}