{
    "url": "https://marinedevelopments.blog.gov.uk/2025/11/18/launch-of-east-marine-plan-development-engagement-summary-report/",
    "title": "Launch of ‘East Marine Plan development engagement’ summary report ",
    "authors": [
        "Rosie Bailey, Marine Planner"
    ],
    "categories": [
        "marine planning"
    ],
    "pub_date": "2025-11-18T09:23:40+00:00",
    "content": [
        {
            "text": "The Marine Planning Team have published the ‘East Marine Plan development engagement summary report’ concluding this period of engagement."
        },
        {
            "text": "What does the report say?"
        },
        {
            "text": "The report details stakeholder insights on drafted plan policies and spatial prescription opportunities for the East Marine Plan. Stakeholders were very knowledgeable and engaged, providing their perspectives on all drafted policies which are detailed within the report."
        },
        {
            "text": "The Marine Management Organisation (MMO) conducted three in-person events in Norwich, King’s Lynn, and Hull, two online sessions for external stakeholders and two online sessions for MMO colleagues. The events took place in the period from 16 September - 08 October."
        },
        {
            "text": "Why are England’s East Marine Plans being replaced?"
        },
        {
            "text": "In 2023, the Secretary of State for Environment, Food and Rural Affairs agreed with the Marine Management Organisation’s recommendation to replace the East Inshore and East Offshore Marine Plans. The adopted East Inshore and East Offshore Marine Plans will be replaced with a new ‘East Marine Plan’ which will be the first of a second generation of plans for English waters. The new document will be referred to as the ‘East Marine Plan’."
        },
        {
            "text": "The first stage of plan development was the East Marine Plan Statement of Public Participation, which was published in April 2024, updated in April 2025."
        },
        {
            "text": "The east marine plan area consists of the east inshore and the east offshore marine plan areas. The east inshore marine plan area stretches from mean high water springs to 12 nautical miles offshore along the coastline between Flamborough Head and Felixstowe. The east offshore marine plan area extends from the outer boundary of the east inshore area to England’s maritime borders with the Netherlands, Belgium, and France."
        },
        {
            "text": "Stakeholder input and collaboration is vital through all stages of developing and shaping the new East Marine Plan. The new policies in the plan will affect all stakeholders operating in the east marine plan areas."
        },
        {
            "text": "Marine Planning"
        },
        {
            "text": "If you would like to receive regular updates from the Marine Planning Team, please sign up to our newsletter."
        },
        {
            "text": "If you have any questions, please do not hesitate to contact the team at planning@marinemanagement.org.uk."
        }
    ]
}