{
    "url": "https://enablingdigitalidentity.blog.gov.uk/2025/11/18/notifying-users-of-changes-to-their-holder-service-accounts/",
    "title": "Notifying users of changes to their holder service accounts ",
    "authors": [
        "Dr Tom Fisher"
    ],
    "categories": [
        "Digital identity",
        "UK digital identity and attributes trust framework"
    ],
    "pub_date": "2025-11-18T17:37:17+00:00",
    "content": [
        {
            "text": "To be certified against the UK digital identity and attributes trust framework as a holder service provider (HSP), you need to have a process in place to get in touch with users if: "
        },
        {
            "text": "This is a requirement for all HSPs and is outlined in rule 7.3.1a of the gamma (0.4) publication of the trust framework.  "
        },
        {
            "text": "The purpose of the rule is to help prevent fraud, as the user can react appropriately if the request has happened without their knowledge.  "
        },
        {
            "heading": 2,
            "text": "Your process must be multi-channel "
        },
        {
            "text": "As stated in rule 7.3.1.a, the communication must be “multi-channel”, which means you must make more than one channel available to users. The process you put in place to notify them of changes to their holder service account, or of requests to close it, must take account of this.  "
        },
        {
            "text": "Some examples of channels you might use to communicate to meet the requirements of 7.3.1 include: "
        },
        {
            "text": "This is not an exhaustive list.  "
        },
        {
            "text": "User-initiated channels could be considered in your processes too. For example, you may have an email or phone-based helpdesk, a web-based chat, or social channel through which users can initiate contact.  "
        },
        {
            "heading": 2,
            "text": "Proportionate and reasonable processes  "
        },
        {
            "text": "The decision about which channels you use to notify users of any account changes or closure requests must be appropriate to the: "
        },
        {
            "text": "The conformity assessment body (CAB) certifying your service will make a judgement about whether the processes you have in place are proportionate and reasonable in the context of the service you offer.   "
        }
    ]
}