{
    "url": "https://ipo.blog.gov.uk/2025/11/18/protecting-your-students-creative-ideas-a-new-free-guide/",
    "title": "Protecting students' creative ideas: a new free guide ",
    "authors": [
        "Lauren Brobin"
    ],
    "categories": [
        "Schools",
        "STEM career",
        "Universities"
    ],
    "pub_date": "2025-11-18T14:59:14+00:00",
    "content": [
        {
            "text": "The work of the Intellectual Property Office's  (IPO) Education Team is all about bringing intellectual property (IP) to life for young people. The team creates resources that help teachers and educators show young people how to protect their creativity and turn their ideas into real opportunities - essential skills in today's digital world. "
        },
        {
            "text": "This work has never been more timely - Education Team Campaigns Manager, Lauren, tells us why: "
        },
        {
            "text": "New UK research from Young Enterprise reveals that 81% of 16–24-year-olds have already engaged in entrepreneurial activity, from selling products online to running side hustles. Our latest guide, \"Protecting Your Creativity: A Guide for Students,\" provides the IP knowledge they need to safeguard their work, from school projects to potential business ventures. The guide makes IP accessible, relevant and curriculum-ready. It delivers the IPO's commitment to providing tools and support that inspires innovation and creativity. "
        },
        {
            "text": "Why IP matters in education "
        },
        {
            "text": "Young peoples’ entrepreneurial drive is thriving, and education can help channel it into lasting opportunities. Whether they’re creating products for design and technology coursework, coding apps in computer science or developing photography portfolios, these projects often become the foundation for real ventures. Young people are generating valuable IP long before they enter the workplace. But do they know how to protect it? "
        },
        {
            "text": "Well, some do, and the results speak for themselves. "
        },
        {
            "text": "When 15-year-old Ruth Amos created an innovative stair handle for her GCSE Design & Technology project, she didn't just get a good mark. She protected her invention with a patent and built a successful business that now helps thousands of people. Her full story (available in the new guide) shows what's possible when young people understand IP. "
        },
        {
            "text": "But Ruth's story isn't common enough. Most students don't realise their creative work has value or that they can protect it. That's the gap our new guide \"Protecting Your Creativity\" aims to fill - helping to unlock the entrepreneurial potential that clearly exists in this generation. "
        },
        {
            "text": "What makes this guide different "
        },
        {
            "text": "The team has written this guide specifically for young people aged 11+. No legal jargon, no complicated explanations, just clear, practical guidance on protecting their work. "
        },
        {
            "text": "The guide covers everything from copyright (protecting art, music and writing) to patents (which protected Ruth's invention), trade marks (think brand logos) and design rights. Each section uses real examples students can relate to. "
        },
        {
            "text": "It's already supporting the curriculum "
        },
        {
            "text": "Those who teach GCSE Digital Technology or Computer Science will know that students need to understand the Copyright Act 1988, licensing requirements, and IP laws. The guide addresses those requirements directly, while also supporting learning in art, business studies, music and more. "
        },
        {
            "text": "Jason Cates, Subject Officer for Design & Technology at WJEC (Wales’ largest awarding body for education qualifications) told us: "
        },
        {
            "text": "Students learn practical skills like: "
        },
        {
            "text": "\n\nhow to document and protect their original work \nunderstanding when they need permission to use others' content \nrecognising opportunities to turn creative projects into income \nnavigating digital content sharing responsibly. \n\n\nHow to access the guide\nWhether you work with young people, know a budding entrepreneur or want to share IP knowledge, you can access the guide today. It is freely available in English, with a Welsh version coming soon, along with other teaching resources. You can download the guide at Cracking Ideas, found amongst the IPO's online support tools (www.ipo.gov.uk/ip-support). You'll need to register for a free account to access the IP tools and resources, but registration only takes a few minutes. \n\nStay informed about IP education resources \nWhy not subscribe to our ‘IP in Education’ newsletter topic? You'll be first to hear about new educational opportunities and resources as they become available. Subscribe to ensure you don't miss future guides, learning materials and competitions that can help inspire the next generation of creators, innovators and entrepreneurs. \nYour next Ruth Amos might already be sitting in your classroom. \n\n"
        }
    ]
}