{
    "url": "https://socialworkwithadults.blog.gov.uk/2025/11/18/reflections-on-the-role-of-social-workers-in-safeguarding-adults/",
    "title": "Reflections on the Role of Social Workers in Safeguarding Adults",
    "authors": [
        "Dr Adi Cooper OBE"
    ],
    "categories": [
        "Care and support",
        "Communities",
        "Education and training",
        "Events",
        "Knowledge and skills",
        "Our profession",
        "Personalisation",
        "Recognition",
        "Safeguarding",
        "Viewpoint"
    ],
    "pub_date": "2025-11-18T08:51:14+00:00",
    "content": [
        {
            "heading": 2,
            "text": "Introduction by Sarah McClinton, Chief Social Worker for Adults"
        },
        {
            "heading": 2,
            "text": "Reflections on the role of social workers in safeguarding adults - Dr Adi Cooper OBE"
        },
        {
            "text": "I remain concerned that, in adults’ social services, safeguarding often remains a niche area of practice and interest – it is still not integrated across adult social care in the way that child protection is within children’s social care. Yet risk is an integral part of life. We want to enable the people we work with to live their best lives, which does mean taking some risks, as we do ourselves. However, having care and support needs can affect the risks that people face in daily living – and in some cases mean that people are more vulnerable to abuse and neglect. They may be more dependent on other people who can exploit that dependency, whether through financial abuse, psychological abuse, sexual abuse, domestic violence, physical abuse, neglect and acts of omission……."
        },
        {
            "text": "For every individual the risks they face are personal to them, their relationships, family, friends, circumstances, care and support needs, their personal histories and identities; this is why Making Safeguarding Personal remains so important. Each person is different and so the processes, practices and pathways we have for supporting people must accommodate a broad range of needs and risks. We have made huge strides and progressed a long way from the adult protection processes of the 2000s which sought to establish whether harm was ‘substantiated’ or not, rather than seeking resolution and recovery for the person involved. Safeguarding knowledge and practices have improved considerably; the Care Act 2014 has helped to clarify and establish who is responsible for what and how, by making safeguarding enquiries a statutory duty for the first time. But there is still a long way to go; we are still at the beginning of the journey (compared to our colleagues working to safeguard children)."
        },
        {
            "text": "What we do know from the current round of Care Quality Commission inspections of adult social care services, is that approximately 40% of local areas need some improvement in their safeguarding services – and the most common themes emerging are issues with safeguarding practice, staff (social workers) capability and confidence, as well as pathways, waiting lists and decision making. But let’s be more positive, 60% are doing well."
        },
        {
            "text": "I would argue that social work is essential to effective safeguarding practice – as well as multi-agency working – as we need everyone’s expertise (for example, as a social worker I am not able to assess whether a pressure sore is due to neglect, I would ask a Tissue Viability Nurse for advice).‘Safeguarding is everybody’s business’ of course. However, as social workers, we bring our social justice and human rights values, which are critical when balancing rights and responsibilities and dealing with ethical issues. We bring our skills in relational working, and cultural humility, which are needed in working with someone experiencing safeguarding risks to support them to reduce the risks in their life, for example where the abuser is an informal carer/family member and may be under huge stress themselves."
        },
        {
            "text": "We utilise our professional curiosity to find out what lies behind the surface, why someone might self-neglect, harm themselves, use drugs and alcohol to manage mental ill-health or emotional distress. We apply our legal literacy regarding mental health and mental capacity to negotiate some of the trickiest areas of social work practice, informing and directing our ability to intervene in people’s lives.  "
        },
        {
            "text": "We bring trauma-informed approaches, which means that we understand when someone refuses help despite being ‘cuckooed’ (home invasion), or experiencing multiple exclusion homelessness. We understand how their personal history might have led to a distrust of authority, and so we persevere and don’t close a case automatically because of ‘service refusal’ or ‘non-engagement’. We don’t judge or differentiate between those who are ‘deserving’ and ‘undeserving’ of our support."
        },
        {
            "text": "We can deal with the pain and shame that safeguarding situations inevitably contain. We understand that our colleagues who want to ‘hand off’ cases do so because they can’t contain the transference of distress; this is a predictable reaction even though not necessarily the right one. We know that we need resilience to do this work and have to look after ourselves, seeking support and space for reflection, so we don’t burn out from emotional overload, nor lose our ability to empathise and to care. We can be brave and courageous, advocating for people who don’t fit rigid eligibility criteria. We are able to deal with complexity and chaos, messy interfaces between non-congruent legislation and policies regarding safeguarding practice, for example when working with young people (recognising the challenges of Transitional Safeguarding)."
        },
        {
            "text": "As with all we do, we use a strengths-based approach, validating what people, their families and communities can bring to prevent or mitigate risks of abuse or neglect. We hold onto hope, even when it seems unrealistic, that people’s lives can improve, and that we can make a difference. And we understand that this work is not for everyone."
        },
        {
            "heading": 2,
            "text": "Thank you"
        },
        {
            "text": "I want to use this opportunity to celebrate the wonderful work that social workers do, every day, everywhere, with people experiencing or at risk of abuse or neglect. In Safeguarding Adults Week let’s take a step back and notice, acknowledge each other (because we don’t often get thanked for it). This role is important. Thank you to all the social workers who are undertaking safeguarding work: ‘working with’ not ‘doing to’; helping people achieve the outcomes they want in their lives; and keeping themselves safe (because we can’t be by their side 24/7), to attain whatever resolution is required and recovery from trauma is possible. You are amazing."
        }
    ]
}