{
    "url": "https://forestrycommission.blog.gov.uk/2025/05/05/into-the-woods-finding-the-cows-among-the-trees/",
    "title": "Into the woods: finding the cows among the trees",
    "authors": [
        "Rachel Harries"
    ],
    "categories": [
        "Ancient woodland",
        "Into the woods series",
        "Woodland management"
    ],
    "pub_date": "2025-05-05T09:00:00+01:00",
    "content": [
        {
            "text": "On a typically wet Dartmoor day, I walk into the woods to look for cows with my friend and herdswoman Desley."
        },
        {
            "heading": 2,
            "text": "A rainforest in the Avon Valley"
        },
        {
            "text": "Penstave Copse is one of the UK’s few remaining temperate rainforests on the southern edge of Dartmoor in Devon. Owned and managed by the Woodland Trust, this 8.5-hectare site cloaks one side of the steep valley of the River Avon, which tumbles off the moor over mossy boulders. These predominantly oak woods are notable for their plants and mix of mosses, ferns, lichens and liverworts that clothe trees and boulders, some of which are of international importance."
        },
        {
            "text": "The site is managed with help from local volunteers and some of Desley’s hardy Dexter cattle, as part of the conservation grazing enterprise Cows in Clover. It’s a lush, green, magical place, which I love visiting."
        },
        {
            "heading": 2,
            "text": "Cows in Clover"
        },
        {
            "text": "There are two Dexters, and two beef shorthorn-Dexter crosses. Dexter cattle are a small native breed. They are short legged and stocky with rough coats and come up to waist height. They are very calm and docile, which is crucial in a wood loved by local people, visitors and dog walkers."
        },
        {
            "text": "The wood is a mosaic of ancient woodland, old boundary walls, grassy glades and new plantations from the 1990s where the trees are a uniform age and height."
        },
        {
            "text": "The cows here have a job to do. They nibble at a wide range of plants, leaves and tree branches, rub against trunks and push their way through thickets and brambles. They create a more varied woodland structure, create new paths and open up areas to light, which is key for certain species which can be shaded out if the understory is too dense."
        },
        {
            "text": "The cows’ manure attracts flies and other insects, an important food source for the wood’s bat population. Their heavy hooves also trample the bracken which can smother woodland plants and suppress new tree growth."
        },
        {
            "text": "Being in the woods also benefits the cows as they can graze a varied diet of different trees, grasses and woodland plants. Trees and evergreen shrubs provide shelter from the Dartmoor wind and rain, although today they don’t appear to mind!"
        },
        {
            "text": "Cows in Clover and the wider herd offer conservation grazing to a range of landowners on the southern edge of Dartmoor and the South Hams of Devon. The herd grazes wildflower meadows, as well as woodlands. Desley has recently introduced two pigs to the project, who are also tasked with opening up overgrown areas and restructuring the landscape through their natural rooting behaviour (they are especially good for rooting out bracken)."
        },
        {
            "heading": 2,
            "text": "Managing the cows"
        },
        {
            "text": "It is important that the cows’ movements are controlled. Overgrazing, particularly by deer is a major problem in our woods. These cows wear Nofence collars, which emit a noise when they stray close to an invisible fence line. "
        },
        {
            "text": "Desley uses a mapping app to set the grazing zone, ensuring they don’t graze areas with sensitive ground flora or where natural regeneration is being encouraged. The app also enables her to view the location of the cattle, making them easier to find in a dense wood. Desley’s business partner, John, works with the Woodland Trust’s site manager to agree which areas of the wood will benefit most from the cows, when and for how long."
        },
        {
            "text": "When the cows need to be moved, Desley draws on her Dial-a-Drover WhatsApp group of friends. We turn up to walk the cows down narrow Dartmoor lanes from one site to another, or herd them into the trailer to go further afield. Our WhatsApp group is a modern adaptation to Dartmoor’s network of ancient drovers’ paths, used by farmers to bring cattle off the moor, and down into small towns for market."
        },
        {
            "text": "Grazing and browsing are integral elements of forest ecosystems and long extinct large herbivores like aurochs and elk would have helped maintain a mosaic of habitats in Britain's forest landscapes. Desley and John are part of a small group of pioneers, fighting their corner and showing how important they are to woodland management."
        },
        {
            "text": "I regularly walk in these woods, admiring the swathes of bluebells in the spring, watching dragonflies and damselflies dart over the river in the summer, and searching for fungi in the autumn. Now I also appreciate the key role these Dexter cows play in maintaining this diverse and healthy ecosystem."
        }
    ]
}