{
    "url": "https://environmentagency.blog.gov.uk/2025/01/28/enhancing-flood-and-coastal-erosion-risk-digital-services-with-the-latest-data-and-mapping/",
    "title": "Enhancing flood and coastal erosion risk digital services with the latest data and mapping",
    "authors": [
        "Julie Foley, Director of Flood Risk Strategy & National Adaptation at the Environment Agency"
    ],
    "categories": [
        "Environment Agency",
        "Flood",
        "Flood Mapping",
        "Flood Planning",
        "Uncategorized"
    ],
    "pub_date": "2025-01-28T12:08:17+00:00",
    "content": [
        {
            "text": "The Environment Agency is transforming its understanding of flood and coastal erosion risk in England.  "
        },
        {
            "text": "Over the past four years, we’ve been working with local authorities to develop a new National Flood Risk Assessment (NaFRA) and a new National Coastal Erosion Risk Map (NCERM). Both use the best available data, information and modelling from the Environment Agency and local authorities to provide the most detailed and accurate understanding yet of current and future risks."
        },
        {
            "text": "For the first time both NaFRA and NCERM now can account for the latest UK climate projections from the Met Office. This is critical given that we will continue to see the impacts of a changing climate leading to more frequent and severe flooding and storms."
        },
        {
            "text": "Today, 28 January 2025, we have made the new data - which shows the risk of flooding from rivers, the sea and surface water - available on Gov.uk for all areas in England. "
        },
        {
            "text": "The new NaFRA shows as many as 6.3 million properties in England are in areas at risk of flooding from one or a combination of sources: rivers, the sea and surface water. With climate change this could increase to around 8 million (or one in four) properties by the middle of the century."
        },
        {
            "text": "The latest updates in data and information mean that the flood risk for some homes or businesses may have changed. It’s crucial that people check what the long-term flood risk is for their area and know what to do in the event of a flood. If homes or businesses are at risk of flooding, for the first time on the digital service, it is possible to see information on potential flood depths as well as future flood risk taking into account climate change."
        },
        {
            "text": "Visit GOV.UK to Check your long term flood risk for an area in England, and sign-up to flood warnings where available.  You can also find more information about how to prepare for a flood including making changes to your property to reduce potential damage, obtaining insurance and making a flood plan. Visit prepare for flooding for more information."
        },
        {
            "text": "We have also made the new NCERM information available on Check coastal erosion risk for an area in England and Shoreline Management Plan Explorer as well as on data.gov.uk.  "
        },
        {
            "text": "NCERM shows the coastal erosion risk information in maps to be used by coastal managers, planners, decision makers and the public. The new NCERM shows that 3,500 properties are in areas at risk of coastal erosion in the period up to 2055 increasing to about 10,100 properties by the end of the century."
        },
        {
            "text": "If you have a property on the coast or are planning to buy a property on the coast, we encourage people to check their current and future risk on our Check coastal erosion risk for an area in England service on GOV.UK. For more information about how coastal flood and erosion risk is managed in your area visit the online tool – Shoreline Management Plan Explorer."
        },
        {
            "text": "The release of the NaFRA and NCERM data follows the publication of our report National assessment of flood and coastal erosion risk in England 2024 in December 2024. This report summarised the national and regional findings from the new NaFRA and the new NCERM.  My blog published in December 2024 shows the key findings."
        },
        {
            "text": "On 25 March 2025, we will be updating our Flood map for planning service to display updated flood zones using the new NaFRA data. We will add new information to this service to display surface water risk and to show how climate change may affect the extent of future flood risk from rivers and the sea. The improved service will assist planners and developers to make decisions about the location and design of new development and will make it easier to produce flood risk assessments.  "
        }
    ]
}