{
    "url": "https://mhclgmedia.blog.gov.uk/2025/01/28/holocaust-memorial-day/",
    "title": "Holocaust Memorial Day",
    "authors": [
        "mhclgpress"
    ],
    "categories": [
        "Faith"
    ],
    "pub_date": "2025-01-28T16:12:32+00:00",
    "content": [
        {
            "text": "Monday 27 January marked Holocaust Memorial Day, with this year also commemorating the 80th anniversary of the liberation of Auschwitz-Birkenau making it a particularly pertinent event this year."
        },
        {
            "text": "The Deputy Prime Minister, Angela Rayner, attended a series of events to honour and remember victims of the Holocaust. She had the privilege of meeting and speaking to Jewish Holocaust survivor, Eve Kugler, as well as meeting many more inspiring survivors at the Holocaust Memorial Day Trust’s reception at Guildhall in London."
        },
        {
            "text": "Following the Deputy Prime Minister’s meeting with Eve Kugler, she shared her reflections on the meeting and discussed the significance of Holocaust remembrance in a piece for The Mirror, published on Sunday (26 January)."
        },
        {
            "text": "The Deputy Prime Minister also took part in the #LightTheDarkness campaign, remembering the six million Jews and all those killed - symbolising a commitment to stand against hate and prejudice today and in the future."
        },
        {
            "text": "However, fighting antisemitism and preserving the memory of the Holocaust and its remaining survivors is a year-round priority. This year, the UK chairs the International Holocaust Remembrance Alliance, supported by MHCLG and FCDO, to lead on fostering education, remembrance and research into the Holocaust and Roma genocide to build a more unified and hopeful future. Separately, the Deputy Prime Minister regularly meets with Jewish community leaders, as well as those of other faiths,  in her capacity of the Secretary of State for Communities."
        },
        {
            "text": "More widely, the government is fully committed to tackling antisemitism which has seen a shocking rise in incidents in recent years."
        },
        {
            "text": "The Holocaust Memorial and Learning Centre forms part of this work. The Centre, which will be built at the heart of our democracy next to Parliament, will serve as a permanent reminder of the atrocity of the Holocaust as well as housing a learning centre, preserving the testimonies of survivors for generations to come and ensuring we continue to learn vital lessons from the past."
        }
    ]
}