{
    "url": "https://mhclgmedia.blog.gov.uk/2025/01/28/inaccurate-council-tax-rise-reporting/",
    "title": "Inaccurate Council Tax rise reporting",
    "authors": [
        "mhclgpress"
    ],
    "categories": [
        "Council finance",
        "Local government"
    ],
    "pub_date": "2025-01-28T15:35:59+00:00",
    "content": [
        {
            "text": "There has been media reporting in The Daily Mail and the Daily Telegraph suggesting that councils will be able to raise their council tax above the threshold of 3%, with 2% for the adult social care precept. This is inaccurate and speculative as we are maintaining the previous government’s approach to council tax."
        },
        {
            "text": "The Daily Mail article has calculated figures based on speculation about councils that have requested council tax rises. Any increases above the referendum threshold would require ministerial sign-off and no decisions have been made regarding granting council tax flexibilities."
        },
        {
            "text": "Furthermore, the article has taken these speculative areas and collected population figures of all areas to reach the ‘four million people’ referenced, however this inaccurately assumes all areas requesting a council tax increase would be granted this and also disregards that the entire population is not eligible for paying council tax."
        },
        {
            "text": "In line with the previous government’s approach, Ministers will consider requests for additional rises from councils that require exceptional financial support, but this government will be putting working people at the forefront of our decisions and only agreeing in exceptional circumstances. The government will not accept a rise in council taxes if it deems the changes to be too substantial to many households, despite councils’ request."
        },
        {
            "text": "We are taking the necessary steps to fix the foundations and support councils through providing more stability through multi-year funding settlements including over £5 billion of new funding for local services over and above local council tax."
        },
        {
            "text": "An MHCLG spokesperson said:"
        },
        {
            "text": "“This is pure speculation. No decisions have been made on council tax increases and we will only consider agreeing to requests for rises above 3%, with 2% for the adult social care precept, in exceptional circumstances, in line with the previous government’s position.”"
        }
    ]
}