{
    "url": "https://governmentscienceandengineering.blog.gov.uk/2025/01/28/kickstart-your-chartership-journey-new-year-new-goals/",
    "title": "Kickstart your chartership journey: New year, new goals ",
    "authors": [
        "gseprofession"
    ],
    "categories": [
        "GSE Offer",
        "Learning & Development",
        "Reward & Recognition"
    ],
    "pub_date": "2025-01-28T10:27:59+00:00",
    "content": [
        {
            "text": "As we begin 2025, it's an ideal time to set new professional goals. Achieving chartership is one of the most rewarding and impactful goals you can pursue. This not only elevates your career but also enhances your skills, knowledge, and credibility within your field.  "
        },
        {
            "text": "If you are ready to seize this opportunity, please email gse@go-science.gov.uk or complete the GSE Professional Recognition Offer form to receive our new professional recognition support booklet and start your journey to chartership. "
        },
        {
            "text": "To illustrate the transformative power of chartership, consider the inspiring story of GSE member Sue Richards, who achieved Chartered Engineer status through the express route in 2024. "
        },
        {
            "text": "Sue’s story is a testament to the power of chartership. It is a journey of personal and professional growth that offers lifelong benefits. As we step into the new year, take inspiration from Sue and set your sights on achieving professional recognition. "
        },
        {
            "text": "The GSE Profession is ready to support you, email gse@go-science.gov.uk or complete the  GSE Professional Recognition Offer form to begin the journey to chartership.  "
        },
        {
            "text": "If you are already chartered and would like to support fellow GSE members in building their science and engineering capability, you should consider becoming a Professional Recognition Mentor, please email the GSE team to learn more. "
        }
    ]
}