{
    "url": "https://civilservice.blog.gov.uk/2025/01/28/world-cancer-day-our-journeys-are-unique-but-we-thrive-when-united/",
    "title": "World Cancer Day: our journeys are unique, but we thrive when united",
    "authors": [
        "Seonaid Webb is Deputy Director for Change, Strategy Directorate, Defra and Chair of the Civil Service Working through Cancer network"
    ],
    "categories": [
        "A great place to work",
        "A Modern Civil Service",
        "Health & Wellbeing"
    ],
    "pub_date": "2025-01-28T13:34:20+00:00",
    "content": [
        {
            "text": "This year the Civil Service Working Through Cancer Network will show support for World Cancer Day on 4 February by focusing our events on the unique human story behind every cancer diagnosis, and how by uniting we are stronger and more resilient."
        },
        {
            "text": "Now in our sixth year, our network continues to grow, locally, nationally and excitingly internationally, with the launch of a new WTC network in the Canadian Civil Service."
        },
        {
            "text": "As a staff network, we come together to share powerful stories, from the most painful to the most uplifting, and to offer support. Our many hundreds of members are unique but able to feel comforted by others who “just get it”."
        },
        {
            "text": "We have connected groups of buddies over the years such as young workers, carers, those living with rare cancers, people struggling with the taboo of cancer in certain communities, encouraging more men to talk openly about symptoms and the importance of early diagnosis."
        },
        {
            "text": "We broaden our reach by asking charities, medical, and scientific experts to co-host “open to all” events – uniting our voices with the goal of raising awareness and improving outcomes for people affected by cancer."
        },
        {
            "text": "One of our most successful collaborations resulted in fantastic results. By working on a series of blood and stem cell events with other Civil Service networks (such as Race and LGBTQ+), the NHS Blood Team, and charity DKMS, more than 1,200 new Civil Servants became blood donors, and more than 800 new Civil Servants joined the stem cell donation register – huge thanks to you all!"
        },
        {
            "text": "Author Seonaid Webb is Deputy Director for Change, Strategy Directorate, Defra"
        },
        {
            "text": "We’ve also heard fascinating presentations about medical advances and how public and private sector organisations and charities are uniting to ensure a positive future for generations to come."
        },
        {
            "text": "We hope that by offering all Civil Servants a safe space network – whether they’re someone with a cancer diagnosis, or a carer (or line manager) of someone with cancer - nobody needs to feel alone in the workplace."
        },
        {
            "text": "As always, we are excited to announce some “open to all” events for this year’s World Cancer Day. And, if you want to join the WTC Network you can do so here.       "
        }
    ]
}