{
    "url": "https://mhclgdigital.blog.gov.uk/2024/12/03/digital-planning-applying-digital-principles-and-innovation-to-transform-englands-planning-system/",
    "title": "Digital Planning: applying digital principles and innovation to transform England’s planning system ",
    "authors": [
        "Digital Planning"
    ],
    "categories": [
        "Digital Planning",
        "Strategy"
    ],
    "pub_date": "2024-12-03T10:24:55+00:00",
    "content": [
        {
            "text": "The Digital Planning programme within MHCLG has a mission to modernise the planning system and make it fit for the 21st century.  "
        },
        {
            "text": "In this blog post, you will read about what the Digital Planning team is doing to empower planners with innovative tools, collaborate with local authorities and industry partners, and enhance the use of digital tools to create a more efficient, inclusive and responsive planning system, and what has been achieved so far.  "
        },
        {
            "text": "This piece forms part of a series of case studies bringing to life MHCLG Digital’s objectives and guiding principles. The programme’s work demonstrates how digital ways of working, collaboration and innovation support the delivery of our departmental objectives and outcomes, offering better, faster and more efficient services to citizens. "
        },
        {
            "heading": 2,
            "text": "The Digital Planning programme and its mission  "
        },
        {
            "text": "Planning plays a vital role in shaping our communities. The Digital Planning programme represents a fundamental shift in how England approaches planning.  "
        },
        {
            "text": "The current picture tells a challenging story. Only one third of Local Planning Authorities have adopted a local plan within the last 5 years. These local plans are crucial for ensuring new development serves local communities and creates places where people want to live.  "
        },
        {
            "text": "Even more striking is that just 1% of people currently engage in local planning, which means many communities are not represented when important decisions are made about their local areas.  "
        },
        {
            "text": "So there's clearly a pressing need to modernise the planning system – to improve our plan-making and our engagement methods, and ensure future developments reflect community needs.  "
        },
        {
            "text": "The Digital Planning programme aims to help bridge this gap. By replacing outdated paper-based systems with modern, data-driven solutions, we’re making planning more accessible, efficient and responsive to community needs. Our approach puts users first, whether they’re planning officers, developers or residents wanting to shape their neighbourhoods. By working collaboratively with Local Planning Authorities, our goal is to enable faster, more efficient decision-making and more inclusive placemaking. "
        },
        {
            "heading": 2,
            "text": "Our actions "
        },
        {
            "heading": 3,
            "text": "Better access to planning data "
        },
        {
            "text": "At the heart of our transformation is our national planning data platform.  "
        },
        {
            "text": "By standardising planning data across England, and making the data accessible, we're laying the groundwork for a more efficient system. We have built a national Planning Data platform which will allow faster, more informed decision-making for central and local government that is based on up-to-date and open data. And it isn't just for planners – it's creating opportunities for innovators to develop new services that will make planning more accessible for everyone. "
        },
        {
            "heading": 3,
            "text": "Faster and more efficient planning decisions "
        },
        {
            "text": "Collaboration is key to our success. We’re proud to be working with a thriving community of more than 100 Local Planning Authorities (LPAs), through Open Digital Planning. Together we’re developing user-friendly planning software that’s already showing impressive results. Early adopters have cut their planning application processing times by 36%. The products which have been co-designed not only improve efficiency but also enhance the experience for users through intuitive interfaces and streamlined feedback mechanisms. This collaborative approach is ensuring our solutions work in the real world.   "
        },
        {
            "heading": 3,
            "text": "Faster plan-making "
        },
        {
            "text": "Local Plans are crucial documents that shape development in a local area but they're time-consuming and difficult to create. We want to bring plan-making into the digital age, to provide faster, simpler, more accessible plans, informed by up-to-date data and shaped more actively by communities and other stakeholders. We’re developing new tools and guidance for Local Planning Authorities that ensures Local Plans are underpinned by good-quality data and become simpler to produce and understand, so that they can be adopted more quickly. "
        },
        {
            "heading": 3,
            "text": "Improved local community engagement and supporting the PropTech (property technology) sector  "
        },
        {
            "text": "Our programme represents the UK Government's largest investment in property technology (PropTech). Our work aims to transform the UK housing market and planning system by creating a thriving PropTech marketplace that accelerates planning outcomes. Through our PropTech Innovation Fund, we're supporting Local Planning Authorities to work with industry at pace and accelerate the adoption of digital tools and systems across the whole plan-making process, from community engagement to site assessments. You can find out more about the projects and pilots funded through the PropTech Innovation Fund on our Digital Planning case studies page. "
        },
        {
            "heading": 2,
            "text": "The outcomes of our work  "
        },
        {
            "text": "By combining standardised data, modern software, new plan-making resources and innovative digital tools, we're creating a planning system that's not just faster and more efficient, but truly inclusive.  "
        },
        {
            "text": "Looking ahead, our digital transformation of the planning system will help deliver housing and infrastructure that better reflects local needs and aspirations, while ensuring the process is more transparent and accessible for everyone involved. "
        },
        {
            "text": "We have already made some tangible efficiencies, including: "
        },
        {
            "heading": 2,
            "text": "Find out more about Digital Planning "
        },
        {
            "text": "The Digital Planning programme continues to modernise the planning system through innovative digital solutions. We’re committed to creating lasting positive change that will benefit everyone who comes into contact with the planning sector.  "
        },
        {
            "text": "Keep up to date with our progress:  "
        },
        {
            "text": "Read more about MHCLG Digital's objectives and guiding principles and the work digital teams are doing to improve outcomes across MHCLG.  "
        }
    ]
}